{
    "title": "Serious BF Changes everything",
    "post_id": "vx9u94",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/vx9u94/serious_bf_changes_everything/",
    "author": "Timely-Pen1449",
    "body": "I was in a really nice 2 1/2 year arrangement.  I am single and stayed faithful to my SB, but I did agree that she could go on random dates as long as she was discreet.  Things went very well until she started canceling or changing the days and times of our dates. She ended up meeting a guy that she really liked and recently revealed that she has been dating him very seriously for the past six months and that some of the allowance I gave her is being used to give the bf gifts, meals etc. I told her that I was happy for her, but I’m not really comfortable supporting their relationship so I wished her well and ended it. She went ballistic for about a week, saying I should be able to ignore her personal life (even though it affected our arrangement) and continue seeing her. \nI told her that the erratic changes to our schedule and the total priority given to the bf, made continuing impossible for me. I’m disappointed to lose her, but I felt I had to draw the line somewhere.  Any similar experiences?",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/vx9u94/serious_bf_changes_everything/",
    "score": 135,
    "upvote_ratio": 0.97,
    "created_utc": 1657628306.0,
    "num_comments": 197,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "You did the right thing. Dynamics change.",
            "author": null,
            "id": "ifukv2w",
            "parent_id": "t3_vx9u94",
            "score": 89,
            "created_utc": 1657629193.0,
            "replies": [
                {
                    "body": "They do. After my last SB met someone, there was less kissing, less cuddling, and a lot more awkward silence. There is also a feeling of romantic rejection even if you’re still sleeping with them. My last SB held out for two months after she met someone and waited until after our vacation to end things.",
                    "author": null,
                    "id": "ifvlkhn",
                    "parent_id": "t1_ifukv2w",
                    "score": 23,
                    "created_utc": 1657644662.0,
                    "replies": [
                        {
                            "body": "Man, are we the same person? Mine started dating someone in December, we kept it up into February, and then I think he went on vacation with her and everything ended immediately after.",
                            "author": null,
                            "id": "ifvmvfy",
                            "parent_id": "t1_ifvlkhn",
                            "score": 14,
                            "created_utc": 1657645163.0,
                            "replies": [
                                {
                                    "body": "It’s a common outcome and it hurts! Sucks to watch yourself not be selected for someone hotter, more popular or more “interesting”. It made me quit sugaring so I could focus on winning someone like her next time they come around. She was only seven years younger too. But at least this life showed me the kind of person I want to be with in a relationship and now I know what I’m looking for.",
                                    "author": null,
                                    "id": "ifvp90n",
                                    "parent_id": "t1_ifvmvfy",
                                    "score": 14,
                                    "created_utc": 1657646095.0,
                                    "replies": [
                                        {
                                            "body": "I speak for myself only, at some point I want someone long term. My SD has clearly stated he is not marriage minded. We both have admitted to having deeper feelings, so I would very much be open to long term if he felt otherwise, but that isn’t on the table. While I empathize that is sucks having someone chosen over you, in my case (and probably many other girls) it boils down to the reasons he chose an arrangement that will eventually be why I leave. My only suggestion, take with a grain of salt, is to recognize whether you are searching for long term and discuss whether that’s compatible with her life goals as well. 🤞🏻best of luck in finding what you seek",
                                            "author": "sciencewasright",
                                            "id": "ifwd7dj",
                                            "parent_id": "t1_ifvp90n",
                                            "score": 13,
                                            "created_utc": 1657655615.0,
                                            "replies": [
                                                {
                                                    "body": "My current SD is also not marriage-minded, but oddly enough wanting something long-term. It saddens me to think that I have to leave him after several years. But hey, that’s life. 🫤",
                                                    "author": "JaneBarret",
                                                    "id": "ifygrof",
                                                    "parent_id": "t1_ifwd7dj",
                                                    "score": 5,
                                                    "created_utc": 1657690525.0,
                                                    "replies": []
                                                },
                                                {
                                                    "body": "Same situation here. I’m not even set on marriage necessarily, but I can’t even get him to sit down with me to even talk about the next year or two and if he still sees me in his life. He’s said he doesn’t want to stand in the way of me meeting anyone, but right now I’m unsure where I stand on marriage and kids and want to spend this part of my life traveling and growing with him.",
                                                    "author": "blue_eyes18",
                                                    "id": "ifz9wgd",
                                                    "parent_id": "t1_ifwd7dj",
                                                    "score": 1,
                                                    "created_utc": 1657712600.0,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "body": "I was intending on asking her to take the next step towards vanilla upon her return as it all seemed good up until the trip. Think she picked him more out of convenience without the messy transition from SGF to something more traditional. That’s what she was craving, almost had a restart between us the next month, and then another vanilla relationship for her really derailed everything. Remained good friends for six months and now she’s gone.",
                                            "author": null,
                                            "id": "ifvq0or",
                                            "parent_id": "t1_ifvp90n",
                                            "score": 6,
                                            "created_utc": 1657646395.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "For me, they usually go back to the \"Bad Boy\" types. And by \"Bad\" I mean, abusive, lazy, jobless or low paying job. Like, WTF???",
                                            "author": "MrRetrdO",
                                            "id": "ifyf1as",
                                            "parent_id": "t1_ifvp90n",
                                            "score": 2,
                                            "created_utc": 1657689376.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Bottomline is SBs who think they can have it all unfortunately can’t. In the end they risk losing it all. I think OP would have understood and respected her if she had been upfront and honest about her vanilla and expressed interest in moving on herself. She would have kept the respect if not the arrangement and maybe even a chance to get back with the OP in the future. In this case she burnt all her bridges!",
                    "author": null,
                    "id": "ifzk7uq",
                    "parent_id": "t1_ifukv2w",
                    "score": 0,
                    "created_utc": 1657718001.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I think we've all had SBs who have found a real life relationship, multiple SBs in my case. I will pull the allowance within a few weeks if we've been unable to meet or if theyve gone silent. In the majority of cases there is a quiet period while they are still working out if this new relationship is going to go somewhere then at the next opportunity they let me know and  we end things. Ive had a couple contact me 6 months or up to 2 yrs later and want to start up again. If Im available and it works for me it saves a lot of time hunting around for someone new.  \nIm happy they are happy as this arrangement was never going to be a long term permanent thing but Im not paying for something Im not getting.",
            "author": "Upper-District-50",
            "id": "ifuy33k",
            "parent_id": "t3_vx9u94",
            "score": 32,
            "created_utc": 1657635371.0,
            "replies": [
                {
                    "body": "I agree",
                    "author": "Timely-Pen1449",
                    "id": "ifvcno8",
                    "parent_id": "t1_ifuy33k",
                    "score": 8,
                    "created_utc": 1657641206.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "My only similar experiences have been with women who've removed themselves from sugaring due to serious vanilla relationships. In one case I'm pretty sure it was with a guy she met on SA.\n\nWe discuss this a lot here. In your example, it seems you noticed negative changes (erratic schedule etc) prior to learning about the bf. Thus it seems natural that once you learned the cause of this, you were ready to end it.\n\nWe see a lot of \"what she does with the money is none of your business.\" I agree, and disagree. If you're not happy having her spend her allowance on her vanilla bf, you have every right to end the relationship. imho",
            "author": null,
            "id": "ifur0wt",
            "parent_id": "t3_vx9u94",
            "score": 14,
            "created_utc": 1657632261.0,
            "replies": [
                {
                    "body": "I try to be the bigger person, but it did bother me when she blurted that out. The primary issue was not prioritizing our meets.",
                    "author": "Timely-Pen1449",
                    "id": "ifve3d8",
                    "parent_id": "t1_ifur0wt",
                    "score": 8,
                    "created_utc": 1657641766.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I hear you and you did the right thing.  Whatever people may think a SR is still a relationship and if it starts being disrespected, then one party can choose to end it.",
            "author": "Jonconnerysd",
            "id": "ifut3fj",
            "parent_id": "t3_vx9u94",
            "score": 25,
            "created_utc": 1657633207.0,
            "replies": [
                {
                    "body": "I tried to handle ending the SR with kindness, but she seemed genuinely angry. I think it may have been a shock to her.",
                    "author": "Timely-Pen1449",
                    "id": "ifvdr3c",
                    "parent_id": "t1_ifut3fj",
                    "score": 8,
                    "created_utc": 1657641633.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "ifwam02",
                            "parent_id": "t1_ifvdr3c",
                            "score": 11,
                            "created_utc": 1657654602.0,
                            "replies": [
                                {
                                    "body": "That could have been her plan",
                                    "author": "Timely-Pen1449",
                                    "id": "ifwmceh",
                                    "parent_id": "t1_ifwam02",
                                    "score": 6,
                                    "created_utc": 1657659167.0,
                                    "replies": []
                                },
                                {
                                    "body": "Exactly what I was thinking.\nAlthough I AM very surprised that she was actually up front about using her allowance to buy the dude a gift.😳\nThat was just stupid.🤦🏻‍♀️🤦🏻‍♀️🤦🏻‍♀️\nSorry, not sorry, I call it like I see it.\n\nThat allowance should've actually been put to a good resource, to HELP the SB, NOT some new dude.\n\nFrankly, if yall had a good relationship going, there's no way in hell that I'd be like...oh hey, guess what, I found a boy toy that I really started liking....and then make it so our arrangement was conflicted. \nEspecially since yalls relationship was first.🤨🤦🏻‍♀️🤦🏻‍♀️🤦🏻‍♀️\n\nOf COURSE you are going to end it, bc she isn't putting yall first anymore!!  (That just seems like such a dit da dee moment to me🤷🏻‍♀️🤦🏻‍♀️🙄)\n\nSeriously, I don't get the audacity sometimes.🤷🏻‍♀️🤷🏻‍♀️🤨\n\nShe was probably angry bc she felt like she was being honest and open with you about it, and in her mind it was OK, IF you said it was OK if she was discreet.\n\nBUT....THEN AGAIN, discreet IS NOT, telling your SD about what you bought your possible new boy toy, with the money that was meant to help your ass!🙄🙄🤦🏻‍♀️🤦🏻‍♀️",
                                    "author": "JustAsk4Alice",
                                    "id": "ifwi1ot",
                                    "parent_id": "t1_ifwam02",
                                    "score": 3,
                                    "created_utc": 1657657503.0,
                                    "replies": [
                                        {
                                            "body": "She really miscalculated, didn’t she? Lol",
                                            "author": "Timely-Pen1449",
                                            "id": "ifwmfd3",
                                            "parent_id": "t1_ifwi1ot",
                                            "score": 6,
                                            "created_utc": 1657659199.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "don’t they say you can’t have your cake and eat it or something?",
                            "author": "Jonconnerysd",
                            "id": "ifvus6w",
                            "parent_id": "t1_ifvdr3c",
                            "score": 5,
                            "created_utc": 1657648345.0,
                            "replies": [
                                {
                                    "body": "Yes, that is the saying",
                                    "author": "Timely-Pen1449",
                                    "id": "ifwnpi3",
                                    "parent_id": "t1_ifvus6w",
                                    "score": 5,
                                    "created_utc": 1657659690.0,
                                    "replies": []
                                },
                                {
                                    "body": "Yeah. You can’t have your cake and eat it too.",
                                    "author": "JaneBarret",
                                    "id": "ifyhhq1",
                                    "parent_id": "t1_ifvus6w",
                                    "score": 3,
                                    "created_utc": 1657691020.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I've been here. We were together for a month and a half, exclusive. Someone in her friend circle evolved into more than a friend, and she had some moral struggle around seeing us both. \n\nI didn't care initially, but just like you wrote her availability became an issue and after being stood up twice I ended the arrangement.\n\nI personally believe if you're in a serious relationship and you aren't open with your partner about ethical poly... Then you should probably choose one option and stick to it.\n\nI don't regret ending that SR, as it led to me meeting someone else who I was with for one year.\n\nLife happens. I hope your SB can accept the circumstances for what they are and good luck to you both.",
            "author": "SD-Casual-Fla",
            "id": "ifup2p1",
            "parent_id": "t3_vx9u94",
            "score": 26,
            "created_utc": 1657631332.0,
            "replies": [
                {
                    "body": "I think she’ll be fine. She’s head over heels with the bf and I wish her well. If they break up and I am\nnot in a SR, I would probably consider getting back with her.",
                    "author": "Timely-Pen1449",
                    "id": "ifveeg6",
                    "parent_id": "t1_ifup2p1",
                    "score": 6,
                    "created_utc": 1657641889.0,
                    "replies": []
                },
                {
                    "body": "Heh, I’ve been on the receiving end of the moral crisis, too.",
                    "author": null,
                    "id": "ifuya3e",
                    "parent_id": "t1_ifup2p1",
                    "score": 7,
                    "created_utc": 1657635453.0,
                    "replies": [
                        {
                            "body": "She was probably the most conventionally attractive gal I've ever dated...Former Maxim model.\n\nBut to quote a former colleague, \"It doesn't matter how beautiful she is, there's some guy out there who's sick of her shit.\" 😂",
                            "author": "SD-Casual-Fla",
                            "id": "ifuzlxn",
                            "parent_id": "t1_ifuya3e",
                            "score": 14,
                            "created_utc": 1657636006.0,
                            "replies": [
                                {
                                    "body": "Why does it have to be negative? Be happy for her if you care about her.",
                                    "author": "WhisperingPetals",
                                    "id": "ifwzkoj",
                                    "parent_id": "t1_ifuzlxn",
                                    "score": 1,
                                    "created_utc": 1657664590.0,
                                    "replies": [
                                        {
                                            "body": "Please read my other comment on this thread.",
                                            "author": "SD-Casual-Fla",
                                            "id": "ifwzwbn",
                                            "parent_id": "t1_ifwzkoj",
                                            "score": 3,
                                            "created_utc": 1657664727.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "ifv3ff0",
                                    "parent_id": "t1_ifuzlxn",
                                    "score": 1,
                                    "created_utc": 1657637547.0,
                                    "replies": [
                                        {
                                            "body": "I didn't. We were a month and a half, weekly arrangement. Felt like king for the day, when we were in South Beach a couple times. Sweet lady, I wish her nothing but the best.",
                                            "author": "SD-Casual-Fla",
                                            "id": "ifv6ibj",
                                            "parent_id": "t1_ifv3ff0",
                                            "score": 3,
                                            "created_utc": 1657638761.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I am curious if the vanilla BF knew she was with an older SD? And she was sugaring because now.... she will obviously have less money... \n\nI was with a woman who i knew / was aware about the vanilla BF and she said \"he was aware of me and our relationship\" (she was a well kept SB) \n\nThat was a lie and i found out when this guy... jacked up and pissed off half my age shows up \"going to kick my ass for cheating with his GF\" and it was disgusting of me to be with a girl who was younger....\n\nOnce he calmed down and we talked it out to a civil tone he understood where i was coming from.... he realized he was in a \"supposedly real relationship\" with a woman who lied about what she was really doing for a year or so.... it messed him up pretty bad and she got home to HIM freaking out on her.\n\nI ended it because i didn't like a guy 20 years younger wanting to rip my head off at my house....",
            "author": "SpaceGuy1968",
            "id": "ifvggwk",
            "parent_id": "t3_vx9u94",
            "score": 7,
            "created_utc": 1657642704.0,
            "replies": [
                {
                    "body": "She told me, eventually, that the bf knew about me and was OK with it, but I think she was clutching at straws in order to keep the money flowing. What she didn’t understand was that she was disrespecting me by changing our scheduled dates.",
                    "author": "Timely-Pen1449",
                    "id": "ifvj9lo",
                    "parent_id": "t1_ifvggwk",
                    "score": 4,
                    "created_utc": 1657643774.0,
                    "replies": []
                },
                {
                    "body": "he showed up @ your house?",
                    "author": "vtec__",
                    "id": "ifxwcqk",
                    "parent_id": "t1_ifvggwk",
                    "score": 2,
                    "created_utc": 1657679210.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "How she spends money doesnt matter. What you should focus on is that her personal relationship affected your arrangement. She canceled and changed the dates meant that she didn't respect you at all and she went ballistic and said that you should continue seeing her meant that she got mad because she no longer receives the money from you. she nees the money not you. that's it",
            "author": "Dealer_Academic",
            "id": "ifv184e",
            "parent_id": "t3_vx9u94",
            "score": 14,
            "created_utc": 1657636674.0,
            "replies": [
                {
                    "body": "You are absolutely correct.",
                    "author": "Timely-Pen1449",
                    "id": "ifvckf9",
                    "parent_id": "t1_ifv184e",
                    "score": 3,
                    "created_utc": 1657641171.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "On one hand how she uses her allowance is her business and you agreed about non exclusivity. On another hand, the caveat was being discreet and a \"don't ask don't tell\" policy.\n\nThis is a bit like a woman vanilla dating a guy and him telling her that he is seeing someone else AND spoiling her. I don't vanilla date but if I did, I would be done with him.\n\nShe messed up royally by telling you the details and I don't blame you for breaking up with her.\n\nShe broke the mystique and you are now seeing her differently. I think you handled it properly.",
            "author": "LightOLove",
            "id": "ifut40w",
            "parent_id": "t3_vx9u94",
            "score": 21,
            "created_utc": 1657633214.0,
            "replies": [
                {
                    "body": "Thanks for your kind words. I agree.",
                    "author": "Timely-Pen1449",
                    "id": "ifvddha",
                    "parent_id": "t1_ifut40w",
                    "score": 5,
                    "created_utc": 1657641484.0,
                    "replies": []
                },
                {
                    "body": "It’s not just that. There is a primal male thing going on here too. \n\nOlder guys don’t like supporting the younger guy, even indirectly. He gets to have the girl and my money?? \n\nIt’s a massive slap in the face to one’s masculinity. The SB is basically telling OP that she sleeps with this other guy and gives him money (gifts , etc) because that’s how much better he is than you (who has to be the one giving money). It also grates on an older guy that a younger guy is being supported like that when traditionally even that younger guy should be the gift giver. “He can’t even be a proper man and she still prefers him to some stupid degree”. \n\nThat’s what goes through my head at least.  I’m sure many guys are similar.",
                    "author": "Neither-Ad-2833",
                    "id": "ifwpkld",
                    "parent_id": "t1_ifut40w",
                    "score": 9,
                    "created_utc": 1657660433.0,
                    "replies": [
                        {
                            "body": "this. idk whats up with these younger girls today..they literally pay for everything and they're in LOVE with these losers!!",
                            "author": "vtec__",
                            "id": "ifxw5nr",
                            "parent_id": "t1_ifwpkld",
                            "score": 4,
                            "created_utc": 1657679120.0,
                            "replies": [
                                {
                                    "body": "Too many Disney movies. \n\nI went on a weekend trip with a miserly ex [close to my age, who made decent money] while I was unemployed. I felt the need to be seen as an equal partner, so I put over a hundo on a credit card for food and drinks and such for us while there, with obviously no hope of paying it off anytime soon. That amount isn’t nearly as much of an issue now, but from that experience, I learned a very important lesson about partner worthiness and finding someone who will support me through a career transition, instead of just happily letting me pay because I feel like I *should* contribute in order to keep him when I’m in no place to do so. Thankfully, he ended things after that weekend trip. I haven’t made the same mistake since. \n\nAnyway, I blame it on Disney and the idea that he could have been “the one” that I was doing everything I could to keep. I feel sorry for early 2020 me who thought he was actually a worthy partner, but I’ve forgiven her because we’ve learned and grown a lot since then.",
                                    "author": "blue_eyes18",
                                    "id": "ifzbl3o",
                                    "parent_id": "t1_ifxw5nr",
                                    "score": 2,
                                    "created_utc": 1657713583.0,
                                    "replies": [
                                        {
                                            "body": "its been like this for along time, 10 years or so. i know alot of girls who date dustys",
                                            "author": "vtec__",
                                            "id": "ig14xiu",
                                            "parent_id": "t1_ifzbl3o",
                                            "score": 3,
                                            "created_utc": 1657740536.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "I see you may have posted a number which is most likely an amount in relations to an arrangement. If this is the case, you are violating Rule #4 - \"No dollar amounts that are in reference to allowance/PPM are allowed.\"\n\nIf you are curious about Allowances reported by SLF contributors please see the [Allowance Master Thread 2021-2022](/r/sugarlifestyleforum/comments/pc22tk/allowance_master_thread_20212022/).\n\nYour post will not be approved until you remove the amount.  Please read the sub [Rules](/r/sugarlifestyleforum/comments/748zta/updated_and_clarified_rules_for_slf/) prior to posting anything else. \n\nIf you simply posted a number not referencing a monetary amount, please message the MODs to approve your post.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/sugarlifestyleforum) if you have any questions or concerns.*",
                                            "author": "AutoModerator",
                                            "id": "ifzbl57",
                                            "parent_id": "t1_ifzbl3o",
                                            "score": 1,
                                            "created_utc": 1657713584.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "I think the relationship is much less of a problem than you perceive it to be. \n\nFairly sure OP and a whole bunch of other SDs would be completely fine with the SB having a relationship and even knowing about it. But she stopped fulfilling her part of the sugar relationship, became unreliable and pretty much untrustworthy. That is the problem here.",
                    "author": "YlangScent",
                    "id": "ifwrtxp",
                    "parent_id": "t1_ifut40w",
                    "score": 7,
                    "created_utc": 1657661340.0,
                    "replies": [
                        {
                            "body": "I agree. Except a lot of men are here complaining about what she spends her money on. They seem to still want full financial control even after they give their SB the money.",
                            "author": "fakemoose",
                            "id": "ifxi662",
                            "parent_id": "t1_ifwrtxp",
                            "score": 3,
                            "created_utc": 1657672743.0,
                            "replies": [
                                {
                                    "body": "Yes, but that's not OP nor is it the problem indicated in this relationship.\n\nYou can't make a point that all we need to do is accept their financial autonomy. Because the relationship would still be messed up even if everyone did that.\n\nThe core problem is that she started prioritising the sugar relationship much lower and cancelling meetings among other things. No matter what else is happening that people have different opinions on, this factor is the key one that is unacceptable across the board.",
                                    "author": "YlangScent",
                                    "id": "ifynexu",
                                    "parent_id": "t1_ifxi662",
                                    "score": 3,
                                    "created_utc": 1657695369.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Are you kidding me brother? Next thing she’s gonna ask you to start giving the boyfriend an allowance too. The time to move on was yesterday.",
            "author": "Regular_Phone3261",
            "id": "ifvw0sv",
            "parent_id": "t3_vx9u94",
            "score": 7,
            "created_utc": 1657648843.0,
            "replies": [
                {
                    "body": "I figured an offer for a threesome was coming next..lol",
                    "author": "Timely-Pen1449",
                    "id": "ifwnmth",
                    "parent_id": "t1_ifvw0sv",
                    "score": 7,
                    "created_utc": 1657659661.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Definitely made the right decision!!!",
            "author": "Misshairypussy",
            "id": "ifx3du9",
            "parent_id": "t3_vx9u94",
            "score": 6,
            "created_utc": 1657666198.0,
            "replies": [
                {
                    "body": "Thanks.",
                    "author": "Timely-Pen1449",
                    "id": "ifx5vej",
                    "parent_id": "t1_ifx3du9",
                    "score": 4,
                    "created_utc": 1657667261.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Does the boyfriend know about you?  Here is a scenario that could go south.  She may (will probably) lie to the boyfriend - not honestly disclosing her relationship to you.  When he finds out, he could go ballastic and make your life difficult - especially risky if you are married.  There is great risk in this scenario - I will not be involved is such a case.   And - it is very disappointing to lose someone you have been intimately and emotionally connected to for years.",
            "author": "HappyBear1952",
            "id": "ifv81pa",
            "parent_id": "t3_vx9u94",
            "score": 5,
            "created_utc": 1657639381.0,
            "replies": [
                {
                    "body": "I wish her all the best. SRs usually have a limited shelf life.",
                    "author": "Timely-Pen1449",
                    "id": "ifvbpzh",
                    "parent_id": "t1_ifv81pa",
                    "score": 5,
                    "created_utc": 1657640845.0,
                    "replies": [
                        {
                            "body": "Agree completely with your thinking, plus you're being very gracious. What I 'm curious about is now that your support for her has ended, she will not be able to gift her boyfriend anymore. Wonder how that will affect their relationship . . .",
                            "author": "Socrates59",
                            "id": "ifyhdcr",
                            "parent_id": "t1_ifvbpzh",
                            "score": 2,
                            "created_utc": 1657690936.0,
                            "replies": [
                                {
                                    "body": "I suppose that is their problem",
                                    "author": "Timely-Pen1449",
                                    "id": "ifz0z2a",
                                    "parent_id": "t1_ifyhdcr",
                                    "score": 2,
                                    "created_utc": 1657706478.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I insist on exclusivity and monogamy in order to avoid this kind of situation. She can do with her money whatever she wants, as long we are exclusive. Sometimes girl starts a vanilla relationship and, based on financial support, pretends she’s not what she is. Without money from her SD, she starts losing confidence. The fact that she can’t afford some things makes her unhappy. That reflects on her vanilla relationship.",
            "author": "Foreign-Concern436",
            "id": "ifv8glp",
            "parent_id": "t3_vx9u94",
            "score": 5,
            "created_utc": 1657639547.0,
            "replies": []
        },
        {
            "body": "“She went ballistic for about a week, saying I should be able to ignore her personal life (even though it affected our arrangement) and continue seeing her”\n\nWhat she meant was you ought to continue paying her ideally without seeing her so she can invest in her loser vanilla bf. \n\nHere is a very common mistake a lot of women in the bowl make. They start to date multiple men and soon realize they are not getting too far with any of them because the guys they are dating are easily able to pick up subtle signs of degrading attention, prioritization etc.\n\nThen these guys pull back or break up and that shocks the lady. \n\nWhat is weird is she knows that this vanillla may not last and she will need you soon but now she is going to lose you regardless and that’s why she went ballistic.\n\nI guess she did not realize that it’s not who she was dating but how she prioritizes her SD. She lost this one for sure.",
            "author": null,
            "id": "ifum8er",
            "parent_id": "t3_vx9u94",
            "score": 15,
            "created_utc": 1657629911.0,
            "replies": [
                {
                    "body": "We had a great SR. She’s so focused on the bf, that she couldn’t see that the constant schedule changes were affecting us.",
                    "author": "Timely-Pen1449",
                    "id": "ifvfe8m",
                    "parent_id": "t1_ifum8er",
                    "score": 3,
                    "created_utc": 1657642277.0,
                    "replies": [
                        {
                            "body": "I guess she figured she had the SR “in the bank” so she has enough flex to go vanilla date with little awareness that she may not be able to handle the demands of multiple relationships and causing her SR to weaken and die.\n\n I feel sorry for her but I hope the vanilla lasts. They often don’t and then the lady ends up with a zero.",
                            "author": null,
                            "id": "ifvtyve",
                            "parent_id": "t1_ifvfe8m",
                            "score": 5,
                            "created_utc": 1657647932.0,
                            "replies": [
                                {
                                    "body": "I hope things work out for her. She’s both smart and beautiful and has a bright future. I just won’t be helping her achieve her goals anymore.",
                                    "author": "Timely-Pen1449",
                                    "id": "ifwo4ka",
                                    "parent_id": "t1_ifvtyve",
                                    "score": 3,
                                    "created_utc": 1657659854.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I would much prefer to be exclusive with my SB, but I have learned to accept that she has a boyfriend. She is impressive, and I consider the existence of her boyfriend part of the price of being with her. She is discreet about her relationship, and although we have become very close over time and know a lot about each other's lives, she understands that I don't want to know much about her boyfriend.\n\nI don't understand why it bothers you that she used a part of her allowance for him. In fact, after accidentally finding out who my SB is dating, I can safely say I would prefer it if he was a broke loser she subsidizes.\n\nReading your post it sounds like your SB was the one who changed the terms of your arrangement by canceling dates repeatedly. So, I understand your reaction.",
            "author": "Strict_Hold_4910",
            "id": "ifuvy14",
            "parent_id": "t3_vx9u94",
            "score": 16,
            "created_utc": 1657634443.0,
            "replies": [
                {
                    "body": "It was the constant rescheduling that drew attention. If she would have kept our regular schedule and been discreet, I may have continued the arrangement.",
                    "author": "Timely-Pen1449",
                    "id": "ifvd437",
                    "parent_id": "t1_ifuvy14",
                    "score": 5,
                    "created_utc": 1657641383.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Consider yourself lucky. All good things come to an end. She has someone else to lean on now and you can move on. Best of luck to ya.",
            "author": "GordonGuapo",
            "id": "ifux2oj",
            "parent_id": "t3_vx9u94",
            "score": 5,
            "created_utc": 1657634935.0,
            "replies": [
                {
                    "body": "Thanks for the good wishes.",
                    "author": "Timely-Pen1449",
                    "id": "ifvcr4z",
                    "parent_id": "t1_ifux2oj",
                    "score": 3,
                    "created_utc": 1657641243.0,
                    "replies": []
                },
                {
                    "body": "Good point.  Its an easy way to break up with here.  You are no longer financially responsible for her, or having to solve all the problems in her life.  (been there).",
                    "author": "HappyBear1952",
                    "id": "ifv8z0e",
                    "parent_id": "t1_ifux2oj",
                    "score": 5,
                    "created_utc": 1657639752.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "You did right..",
            "author": "meleficent007",
            "id": "ifvf7js",
            "parent_id": "t3_vx9u94",
            "score": 5,
            "created_utc": 1657642205.0,
            "replies": [
                {
                    "body": "Thanks.",
                    "author": "Timely-Pen1449",
                    "id": "ifvfz7u",
                    "parent_id": "t1_ifvf7js",
                    "score": 3,
                    "created_utc": 1657642510.0,
                    "replies": [
                        {
                            "body": "You must miss her though..did you look for another SB?",
                            "author": "meleficent007",
                            "id": "ifvg55u",
                            "parent_id": "t1_ifvfz7u",
                            "score": 3,
                            "created_utc": 1657642575.0,
                            "replies": [
                                {
                                    "body": "I’m searching now",
                                    "author": "Timely-Pen1449",
                                    "id": "ifviobu",
                                    "parent_id": "t1_ifvg55u",
                                    "score": 2,
                                    "created_utc": 1657643547.0,
                                    "replies": [
                                        {
                                            "body": "Nice...where are you located..",
                                            "author": "meleficent007",
                                            "id": "ifviwc4",
                                            "parent_id": "t1_ifviobu",
                                            "score": 3,
                                            "created_utc": 1657643634.0,
                                            "replies": [
                                                {
                                                    "body": "Florida",
                                                    "author": "Timely-Pen1449",
                                                    "id": "ifvjbrx",
                                                    "parent_id": "t1_ifviwc4",
                                                    "score": 2,
                                                    "created_utc": 1657643797.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Had a long-term arrangement with an SB wherein we knew quite a lot about each other due to how long we'd been together. She started dating a guy and I felt a little badly for him because she was cheating on him with me. One time, she was going down on me and literally seconds after I finished in her mouth, the phone rang and she picked it up. It was her new boyfriend, so I was quiet while they talked, but realized it was time to end things. They're now married with a kid and I wonder if their marriage will survive because it started with her deceiving him. Based on social media, they look happy together, but that doesn't always tell the full story.",
            "author": "carbonara_and_jazz",
            "id": "ifvuerr",
            "parent_id": "t3_vx9u94",
            "score": 4,
            "created_utc": 1657648191.0,
            "replies": [
                {
                    "body": "I don’t wish my former sb anything but happiness. She just accelerated the ending of our relationship by her actions.",
                    "author": "Timely-Pen1449",
                    "id": "ifwnvr6",
                    "parent_id": "t1_ifvuerr",
                    "score": 5,
                    "created_utc": 1657659759.0,
                    "replies": []
                }
            ]
        },
        {
            "body": ">recently revealed that she has been dating him very seriously for the past six months and that some of the allowance I gave her is being used to give the bf gifts, meals etc.\n\nYou did the right thing. But how did the topic of her buying this dude stuff come up? I am presuming you straight up asked her if she was spending money on him.",
            "author": "fatsocalsd",
            "id": "ifwdy0w",
            "parent_id": "t3_vx9u94",
            "score": 4,
            "created_utc": 1657655904.0,
            "replies": [
                {
                    "body": "Nope. That’s the crazy part. Why she thought that would help matters is beyond my comprehension. The worst thing was changing our scheduled dates.",
                    "author": "Timely-Pen1449",
                    "id": "ifwn2lx",
                    "parent_id": "t1_ifwdy0w",
                    "score": 4,
                    "created_utc": 1657659447.0,
                    "replies": [
                        {
                            "body": "Oh wow that is pretty shitty of her. Block and move on brother. Let her find money elsewhere to support her loser BF.",
                            "author": "fatsocalsd",
                            "id": "ifx11zv",
                            "parent_id": "t1_ifwn2lx",
                            "score": 4,
                            "created_utc": 1657665215.0,
                            "replies": [
                                {
                                    "body": "I actually wish her well. Its a shame it had to go down this way",
                                    "author": "Timely-Pen1449",
                                    "id": "ifx5n6q",
                                    "parent_id": "t1_ifx11zv",
                                    "score": 2,
                                    "created_utc": 1657667165.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Happened to me before too.",
            "author": "BigBearSD",
            "id": "ifuw3tn",
            "parent_id": "t3_vx9u94",
            "score": 4,
            "created_utc": 1657634512.0,
            "replies": []
        },
        {
            "body": "Been there. Except she continued lying about it. Guilt tripped me into staying after her father passed by saying every man in her life either dies or leaves her.",
            "author": "pattycakerod77",
            "id": "ifx9f7x",
            "parent_id": "t3_vx9u94",
            "score": 3,
            "created_utc": 1657668806.0,
            "replies": [
                {
                    "body": "Sorry to hear that. Sounds like you tried to be a good guy about it",
                    "author": "Timely-Pen1449",
                    "id": "ifxc1ry",
                    "parent_id": "t1_ifx9f7x",
                    "score": 3,
                    "created_utc": 1657669966.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "ifxcnwy",
                            "parent_id": "t1_ifxc1ry",
                            "score": 2,
                            "created_utc": 1657670243.0,
                            "replies": [
                                {
                                    "body": "I had a SB before this past one. We were together through her last two years of Med School. When she left the state for her fellowship, we ended things amicably. I think that’s how a SR should work.",
                                    "author": "Timely-Pen1449",
                                    "id": "ifxeqfk",
                                    "parent_id": "t1_ifxcnwy",
                                    "score": 3,
                                    "created_utc": 1657671181.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I disagree with her buying gifts or meals for her bf in general, lol. Like, does she not have a normal job  to get him little things here and there once in a while? \n\nI personally don’t want any kind of relationship where I would buy gifts or meals?! for the man (unless special occasions, or very small gifts that are more meaningful than valuable). \n\nWhy would you be the provider in this relationship, while she accepts to be a provider in a relationship with another man? \n\nTo each their own, but I am looking for generous men for both SR and vanilla relationships.",
            "author": "AleksiaE",
            "id": "ifym1au",
            "parent_id": "t3_vx9u94",
            "score": 4,
            "created_utc": 1657694312.0,
            "replies": [
                {
                    "body": "I agree with you. I’m not sure what her logic was in even making that statement to me.",
                    "author": "Timely-Pen1449",
                    "id": "ifz0rj9",
                    "parent_id": "t1_ifym1au",
                    "score": 1,
                    "created_utc": 1657706313.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Lol so she expected you to subsidize someone else’s lifetstyle?",
            "author": "jeffend1981",
            "id": "ifuo1zx",
            "parent_id": "t3_vx9u94",
            "score": 7,
            "created_utc": 1657630831.0,
            "replies": [
                {
                    "body": "Maybe. She’s head over heels for the bf and isn’t thinking about anything else. I wish her well.",
                    "author": "Timely-Pen1449",
                    "id": "ifver0k",
                    "parent_id": "t1_ifuo1zx",
                    "score": 3,
                    "created_utc": 1657642026.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "ifv6g8o",
            "parent_id": "t3_vx9u94",
            "score": 6,
            "created_utc": 1657638737.0,
            "replies": [
                {
                    "body": "Shit....phone a friend then.\nI got you.\n\nI'm an SB and I would've taken care of it.\nAin't no way in hell a POT BF would EVER be allowed to mess with my ALREADY REAL sugar relationship.\nNooooope.🙅🏻‍♀️🙅🏻‍♀️🙅🏻‍♀️\n\nThat was a chick that OBVIOUSLY couldn't \"handle her man.\" \nThere's a lot of ways to resolve things and whatever the hell she did that gave him the info to your place, THAT, was seriously one of the most stupid things that she could have done.\nI'm sorry you were subjected to that.",
                    "author": "JustAsk4Alice",
                    "id": "ifwxkys",
                    "parent_id": "t1_ifv6g8o",
                    "score": 5,
                    "created_utc": 1657663759.0,
                    "replies": []
                },
                {
                    "body": "Lmfao bro.",
                    "author": "Regular_Phone3261",
                    "id": "ifvwd7l",
                    "parent_id": "t1_ifv6g8o",
                    "score": 5,
                    "created_utc": 1657648982.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "The only 'wrong' thing you did was caring about how she spends her money, shouldn't matter to you if it's on her bf. But frequent cancelling due to a bf is a deal breaker for sure, you did the right thing.",
            "author": "whatever-tata",
            "id": "ifuocl2",
            "parent_id": "t3_vx9u94",
            "score": 10,
            "created_utc": 1657630979.0,
            "replies": [
                {
                    "body": "Generally totally agree how she spends her money not my business….but, it would feel bad to me to support someone who is giving gifts to a BF and not respecting our dynamic.",
                    "author": "Pitkin_SD",
                    "id": "ifuqlvv",
                    "parent_id": "t1_ifuocl2",
                    "score": 6,
                    "created_utc": 1657632066.0,
                    "replies": []
                },
                {
                    "body": "It was the constant rescheduling that bothered me the most.",
                    "author": "Timely-Pen1449",
                    "id": "ifvekqk",
                    "parent_id": "t1_ifuocl2",
                    "score": 3,
                    "created_utc": 1657641957.0,
                    "replies": []
                },
                {
                    "body": "I disagree.  I have never had a SB that is in a marriage/bf’d  or in an open relationship as I don’t want to be supporting his lazy ass.  Guys that don’t provide properly for their partners should just stick to being fuck boys.",
                    "author": "DomDaddyNW",
                    "id": "ifuxqmk",
                    "parent_id": "t1_ifuocl2",
                    "score": 6,
                    "created_utc": 1657635223.0,
                    "replies": [
                        {
                            "body": "Lmfao a gift or dinner sometimes is not even close to the same as supporting someone.",
                            "author": "fakemoose",
                            "id": "ifxiifn",
                            "parent_id": "t1_ifuxqmk",
                            "score": 1,
                            "created_utc": 1657672899.0,
                            "replies": [
                                {
                                    "body": "So if they are so content with their life that their BF or SO has provided why are they on SA.  You be their cuck ATM seems to work for you.",
                                    "author": "DomDaddyNW",
                                    "id": "ify6bqi",
                                    "parent_id": "t1_ifxiifn",
                                    "score": 0,
                                    "created_utc": 1657684173.0,
                                    "replies": [
                                        {
                                            "body": "You can’t seem to wrap your head around the concept that there doesn’t have to be someone in the role of “provider” in all relationships. It’s fascinating.",
                                            "author": "fakemoose",
                                            "id": "ig00ywn",
                                            "parent_id": "t1_ify6bqi",
                                            "score": 1,
                                            "created_utc": 1657725087.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "It's disrespectful to make us sugar her boyfriend when we'd rather keep her to ourselves to begin with. We'll I'm selfish and possessive, and I am proud of it. The shame on women thinking men should be ok sharing them, we have self respect 💪",
                    "author": "sugardad123",
                    "id": "ifv400b",
                    "parent_id": "t1_ifuocl2",
                    "score": 2,
                    "created_utc": 1657637771.0,
                    "replies": [
                        {
                            "body": "Feels too much like when the right say shit like \"I don't want my tax dollars going to abortions!!!!\" Like fuck off, the government spends on every conceivable issue and everyone pays for things they don't support or vote for. It's not disrespectful, it's her money. I stick to monogamous relationships, so the bf would end things for me too, but it wouldn't bother me if she spent money given to her on a bf.",
                            "author": "whatever-tata",
                            "id": "ifw8q9p",
                            "parent_id": "t1_ifv400b",
                            "score": 5,
                            "created_utc": 1657653864.0,
                            "replies": [
                                {
                                    "body": "What planet are you living on? I don't even support SBs who have boyfriends to boot, and you think I'd be ok giving her money knowingly?\n\nNo if I'm paying a girl to be my girlfriend, she can't have a boyfriend, I'm her boyfriend my friend. The disrespect is so enormous! I can't even believe it.",
                                    "author": "sugardad123",
                                    "id": "ifwd5dt",
                                    "parent_id": "t1_ifw8q9p",
                                    "score": -1,
                                    "created_utc": 1657655594.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I try to start every SR with the end in mind.  I tell my SBs that I am just a rest stop on their life-journey.   3 times, I had SBs get engaged while seeing me...and I was happy for all.  But my best memory of an SB looking out for me was a young blond nurse...we had been together for 2+ years at that point....one night, she got drunk and hooked up, unprotected.   She took it upon herself to get tested and  bring a condom to our next meet.  I was soooo proud of her!",
            "author": "sdphilly",
            "id": "ifurfo0",
            "parent_id": "t3_vx9u94",
            "score": 6,
            "created_utc": 1657632454.0,
            "replies": [
                {
                    "body": "You indulged to fuck her with condom? Why didn't you just wait for test results? I'm so done with condoms, I blow up magnums everytime, now 4 years without 💪",
                    "author": "sugardad123",
                    "id": "ifv4nb9",
                    "parent_id": "t1_ifurfo0",
                    "score": -2,
                    "created_utc": 1657638022.0,
                    "replies": [
                        {
                            "body": "I used to feel that way, but my current SB and I went protected for 4 months, and I got used to them.  Thankfully, we developed enough trust to now go without...but I wouldn't hesitate to use them again.\n\n\\#olddognewtrick",
                            "author": "sdphilly",
                            "id": "ifv77sh",
                            "parent_id": "t1_ifv4nb9",
                            "score": 1,
                            "created_utc": 1657639048.0,
                            "replies": []
                        },
                        {
                            "body": "Unless your condoms are old, that shouldn't happen.  Those things are stress tested by holding up to 2liters of liquid.  I just recently took a class at Frolicon and learned how to give a blowjob with a condom.  It was phenomenal.  Just as much drool with the flavored lubes as without, plus a few new technique.",
                            "author": "Mostly_Always_Truly",
                            "id": "ifvbr74",
                            "parent_id": "t1_ifv4nb9",
                            "score": 0,
                            "created_utc": 1657640857.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I really hope my SB finds a BF someday, but that will effectively end our arrangement, which is OK. I will be sad, but will soon get over it and move forward. That is life",
            "author": "Teejaynj",
            "id": "ifvph4y",
            "parent_id": "t3_vx9u94",
            "score": 3,
            "created_utc": 1657646182.0,
            "replies": [
                {
                    "body": "I agree. Most SRs have a limited shelf life",
                    "author": "Timely-Pen1449",
                    "id": "ifwo7j7",
                    "parent_id": "t1_ifvph4y",
                    "score": 2,
                    "created_utc": 1657659886.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Def did the right thing. There's no point staying in a situation that is going to make you unhappy. Life is too short. What you \"should\" be like has nothing to do with it and her taking it that way shows that you're better off without her.",
            "author": "hapiidadii",
            "id": "ifwtqtf",
            "parent_id": "t3_vx9u94",
            "score": 3,
            "created_utc": 1657662114.0,
            "replies": [
                {
                    "body": "I agree completely",
                    "author": "Timely-Pen1449",
                    "id": "ifwtwnl",
                    "parent_id": "t1_ifwtqtf",
                    "score": 1,
                    "created_utc": 1657662180.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Kick her to the curb. You don't have to put up with that.",
            "author": "Automatic_Joke_4414",
            "id": "ifwz603",
            "parent_id": "t3_vx9u94",
            "score": 3,
            "created_utc": 1657664420.0,
            "replies": [
                {
                    "body": "Oh, she’s on the curb right now. \nIn reality, I wish her all the best as she pursues her goals. It’s a shame I can’t continue to help her, but it was her choice.",
                    "author": "Timely-Pen1449",
                    "id": "ifwzna6",
                    "parent_id": "t1_ifwz603",
                    "score": 3,
                    "created_utc": 1657664621.0,
                    "replies": [
                        {
                            "body": "Good deal. You'll find another one.",
                            "author": "Automatic_Joke_4414",
                            "id": "ifx0e1r",
                            "parent_id": "t1_ifwzna6",
                            "score": 4,
                            "created_utc": 1657664934.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "&#x200B;\n\nYou did exactly what you should have done.  What you did is in your best interest.\n\nShe is just mad that she was leaning on your money to support her new lifestyle/relationship and she feels you screwed her over.  That's her issue, not yours.\n\n&#x200B;\n\nMove on and look for someone new, maybe play the field some.\n\nI would not be surprised if she contacted you again down the line.",
            "author": "johnties",
            "id": "ifwzyo6",
            "parent_id": "t3_vx9u94",
            "score": 3,
            "created_utc": 1657664754.0,
            "replies": [
                {
                    "body": "Maybe, maybe not. SRs usually have a limited shelf life",
                    "author": "Timely-Pen1449",
                    "id": "ifx5tkh",
                    "parent_id": "t1_ifwzyo6",
                    "score": 2,
                    "created_utc": 1657667240.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Clearly the BF did change things for both of you.  \nHer priorities no longer included you.   \nTo me that is the deal breaker.  \nJust like 'monogamy' we will never really know what the SB will spend money on.  \nIs it really something that we should care about?  \nAs long as it is not lots of heroin (which also causes a shifting of priorities!) - why should an SD care what they spend money on?  \nOnce we give money - it is not ours - it belongs to the person we gave it to.  \n\n\nCase in point - the government seems to want to take a lot of my money - and they give me NO SAY in how they spend it :)    \n\n\n(Let's not go all political - I am sure we all have some form of Government spending we hate :D)",
            "author": "sd424242",
            "id": "ifx6jul",
            "parent_id": "t3_vx9u94",
            "score": 3,
            "created_utc": 1657667558.0,
            "replies": [
                {
                    "body": "I agree. The issue was really the change in priorities.",
                    "author": "Timely-Pen1449",
                    "id": "ifx6saq",
                    "parent_id": "t1_ifx6jul",
                    "score": 2,
                    "created_utc": 1657667661.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "It kind of sucks that she decided to be honest with you and got dumped as a result.  On the other hand it was prob going end sooner than later with this new development anyway.\nPersonally I'd be bothered by the change in priority but not by the new relationship, how she was using funds, etc.",
            "author": "greenshade1",
            "id": "ifv7xb9",
            "parent_id": "t3_vx9u94",
            "score": 4,
            "created_utc": 1657639332.0,
            "replies": [
                {
                    "body": "I agree, for the most part. I didn’t tell her how to spend her allowance. It was the constant schedule changes that really caused me to confront the situation.",
                    "author": "Timely-Pen1449",
                    "id": "ifvc1y0",
                    "parent_id": "t1_ifv7xb9",
                    "score": 2,
                    "created_utc": 1657640973.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "She has no right to be angry. No man should be okay to pay for some other guy to dick your girl",
            "author": "Blueexpression",
            "id": "ifwoihx",
            "parent_id": "t3_vx9u94",
            "score": 5,
            "created_utc": 1657660004.0,
            "replies": [
                {
                    "body": "While I agree he should move on because he wasn’t comfortable with the situation, What she spends her money on is really none of his business.",
                    "author": "Lar5031",
                    "id": "ifx5qao",
                    "parent_id": "t1_ifwoihx",
                    "score": 4,
                    "created_utc": 1657667201.0,
                    "replies": [
                        {
                            "body": "As long as it doesn't affect the SR .  . . that's what the issue is here.",
                            "author": "Socrates59",
                            "id": "ifyhn6e",
                            "parent_id": "t1_ifx5qao",
                            "score": 2,
                            "created_utc": 1657691126.0,
                            "replies": [
                                {
                                    "body": "This",
                                    "author": "Blueexpression",
                                    "id": "ifynb0m",
                                    "parent_id": "t1_ifyhn6e",
                                    "score": 1,
                                    "created_utc": 1657695284.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "She’s got a very delusional perspective on things. Either way, I still wish her well.",
                    "author": "Timely-Pen1449",
                    "id": "ifwop98",
                    "parent_id": "t1_ifwoihx",
                    "score": 3,
                    "created_utc": 1657660078.0,
                    "replies": [
                        {
                            "body": "The entitlement is astounding . . .",
                            "author": "Socrates59",
                            "id": "ifyhjyc",
                            "parent_id": "t1_ifwop98",
                            "score": 2,
                            "created_utc": 1657691063.0,
                            "replies": [
                                {
                                    "body": "I’m still scratching my head over that",
                                    "author": "Timely-Pen1449",
                                    "id": "ifz0wjz",
                                    "parent_id": "t1_ifyhjyc",
                                    "score": 1,
                                    "created_utc": 1657706424.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "sounds like your typical gen Z / millenial woman",
                            "author": "vtec__",
                            "id": "ifxxf5y",
                            "parent_id": "t1_ifwop98",
                            "score": 0,
                            "created_utc": 1657679714.0,
                            "replies": [
                                {
                                    "body": "Unfortunately…",
                                    "author": "Timely-Pen1449",
                                    "id": "ifxzznk",
                                    "parent_id": "t1_ifxxf5y",
                                    "score": 1,
                                    "created_utc": 1657680942.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "You did right, it's totally selfish for SBs to expect us to do that.\n\nI had the exact same thing happen, and I tried to stay, never again 😂",
            "author": "sugardad123",
            "id": "ifv3gao",
            "parent_id": "t3_vx9u94",
            "score": 2,
            "created_utc": 1657637557.0,
            "replies": [
                {
                    "body": "Like  said, I didn’t have a problem with casual dating. When she got serious with someone and it affected our arrangement, I had to call it quits.",
                    "author": "Timely-Pen1449",
                    "id": "ifvci83",
                    "parent_id": "t1_ifv3gao",
                    "score": 2,
                    "created_utc": 1657641148.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "ifv9n4g",
            "parent_id": "t3_vx9u94",
            "score": 2,
            "created_utc": 1657640023.0,
            "replies": [
                {
                    "body": "Not for long…",
                    "author": "Timely-Pen1449",
                    "id": "ifvbfxa",
                    "parent_id": "t1_ifv9n4g",
                    "score": 1,
                    "created_utc": 1657640736.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "ending it was the right call.\n\nwhen she reaches out again (she will) are you going to try again or leave it alone?",
            "author": "sicrm",
            "id": "ifvmpjs",
            "parent_id": "t3_vx9u94",
            "score": 2,
            "created_utc": 1657645101.0,
            "replies": [
                {
                    "body": "I really enjoyed our SR and might be tempted, but I guess it all depends on if I have established something with someone else.",
                    "author": "Timely-Pen1449",
                    "id": "ifvnydq",
                    "parent_id": "t1_ifvmpjs",
                    "score": 1,
                    "created_utc": 1657645582.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "What my SB does with her allowance is her business, apart from drugs of course. However, lie to me and it's over. Explain the situation, if I can live with it then it's all good. If not, we can go our separate ways.",
            "author": "Grouchy_Ad_355",
            "id": "ifvoccn",
            "parent_id": "t3_vx9u94",
            "score": 2,
            "created_utc": 1657645734.0,
            "replies": [
                {
                    "body": "I agree",
                    "author": "Timely-Pen1449",
                    "id": "ifvoxwq",
                    "parent_id": "t1_ifvoccn",
                    "score": 1,
                    "created_utc": 1657645973.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "A common story it seems. Have their cake and eat it too",
            "author": "ConstructionReal356",
            "id": "ifvyao7",
            "parent_id": "t3_vx9u94",
            "score": 2,
            "created_utc": 1657649752.0,
            "replies": [
                {
                    "body": "Unfortunately, I think she’s living in a fantasy world.",
                    "author": "Timely-Pen1449",
                    "id": "ifwnj7c",
                    "parent_id": "t1_ifvyao7",
                    "score": 2,
                    "created_utc": 1657659624.0,
                    "replies": [
                        {
                            "body": "Yeah. When this happened to me, she ended up unhappy because he didn’t support her lifestyle. Now it’s a sloppy mess.",
                            "author": "ConstructionReal356",
                            "id": "ifwnszm",
                            "parent_id": "t1_ifwnj7c",
                            "score": 1,
                            "created_utc": 1657659729.0,
                            "replies": [
                                {
                                    "body": "All relationships are tough and require work to maintain. She and I had a really good run.",
                                    "author": "Timely-Pen1449",
                                    "id": "ifwokbk",
                                    "parent_id": "t1_ifwnszm",
                                    "score": 1,
                                    "created_utc": 1657660024.0,
                                    "replies": [
                                        {
                                            "body": "I’m in a situation where I kept helping her out and now I’ve met her new boyfriend and he’s convinced I’m going to steal her away and live happily ever after and tis a bit stupid",
                                            "author": "ConstructionReal356",
                                            "id": "ifwotii",
                                            "parent_id": "t1_ifwokbk",
                                            "score": 1,
                                            "created_utc": 1657660125.0,
                                            "replies": [
                                                {
                                                    "body": "I don’t envy you. It’s gotta be a little awkward and weird",
                                                    "author": "Timely-Pen1449",
                                                    "id": "ifwp8al",
                                                    "parent_id": "t1_ifwotii",
                                                    "score": 1,
                                                    "created_utc": 1657660292.0,
                                                    "replies": [
                                                        {
                                                            "body": "It is. I mean the more he fixates on it, the more I’m tempted to swoop in and steal her tbh.",
                                                            "author": "ConstructionReal356",
                                                            "id": "ifwpfai",
                                                            "parent_id": "t1_ifwp8al",
                                                            "score": 1,
                                                            "created_utc": 1657660372.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Wow. I checked her bfs social media and saw pics of them at an air B&B on the day she and I were supposed to be together. That sealed the deal.",
                                                                    "author": "Timely-Pen1449",
                                                                    "id": "ifwt327",
                                                                    "parent_id": "t1_ifwpfai",
                                                                    "score": 3,
                                                                    "created_utc": 1657661846.0,
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "body": "Where and when do you communicate with the bf? I’m curious now.",
                                                                    "author": "Timely-Pen1449",
                                                                    "id": "ifwrxjv",
                                                                    "parent_id": "t1_ifwpfai",
                                                                    "score": 1,
                                                                    "created_utc": 1657661380.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "Social media mostly. And occasionally in person lol. Only really chatted a few times with him. But I’ve read over her texts (not snooping) and he’s outright expressed to me that he thinks she likes me better.",
                                                                            "author": "ConstructionReal356",
                                                                            "id": "ifwsfs3",
                                                                            "parent_id": "t1_ifwrxjv",
                                                                            "score": 1,
                                                                            "created_utc": 1657661586.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Man, that sucks. I’m fairly new, but I don’t, or wouldn’t, get into a long-term SR where there was vanilla dating on the side. Don’t know if it’s pride, but something doesn’t sit right with financially supporting someone dating others outside of our arrangement.",
            "author": "Quiet-Eggplant-6811",
            "id": "ifwbkwn",
            "parent_id": "t3_vx9u94",
            "score": 2,
            "created_utc": 1657654978.0,
            "replies": [
                {
                    "body": "I think the parameters of the arrangement need to be settled up front.",
                    "author": "Timely-Pen1449",
                    "id": "ifwne06",
                    "parent_id": "t1_ifwbkwn",
                    "score": 2,
                    "created_utc": 1657659568.0,
                    "replies": [
                        {
                            "body": "Of course. If any party breaks the arrangement, then that’s clear grounds to end it. Or, just end it because we are all adults and no one is tied to any of these arrangements. I think it’s strange that there is this sense of entitlement on both the SB and SD side. If you want true commitment from either side, then you need to engage and pursue a traditional relationship. Many SBs complain about SDs being too controlling when the obvious resolution is just to end it; but obviously the financial benefit keeps them there. Same with SDs.  SBs are plentiful, especially if you have the means to support them.",
                            "author": "Quiet-Eggplant-6811",
                            "id": "ifwzwx1",
                            "parent_id": "t1_ifwne06",
                            "score": 2,
                            "created_utc": 1657664734.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I don't know the details of what her bf does or how old they are (SB and BF), and I don't need to know, but hopefully he's working towards something in his life in terms of a good professional life that pays well, otherwise she may get sick of him not carrying his weight beyond a short-term blimp.",
            "author": null,
            "id": "ifwbmjd",
            "parent_id": "t3_vx9u94",
            "score": 2,
            "created_utc": 1657654997.0,
            "replies": [
                {
                    "body": "She comes from an upper middle class family. I don’t think he has much, but I really don’t know or care.",
                    "author": "Timely-Pen1449",
                    "id": "ifwna41",
                    "parent_id": "t1_ifwbmjd",
                    "score": 1,
                    "created_utc": 1657659527.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "She cancelled your days, you did the right thing",
            "author": "KnocDown",
            "id": "ifwescu",
            "parent_id": "t3_vx9u94",
            "score": 2,
            "created_utc": 1657656232.0,
            "replies": [
                {
                    "body": "Yup, that’s how I thought about it.",
                    "author": "Timely-Pen1449",
                    "id": "ifwmtak",
                    "parent_id": "t1_ifwescu",
                    "score": 1,
                    "created_utc": 1657659347.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Based on the enormous response, this seems to happen to many of us.  What do you do in case of allowance…does it stop immediately or do you give some type of “severance package?”",
            "author": "PracticePositive69",
            "id": "ifwg62m",
            "parent_id": "t3_vx9u94",
            "score": 2,
            "created_utc": 1657656773.0,
            "replies": [
                {
                    "body": "Under the circumstances, I ended things immediately. When she became belligerent and demanded I see things her way, I really couldn’t continue one more day.",
                    "author": "Timely-Pen1449",
                    "id": "ifwmot2",
                    "parent_id": "t1_ifwg62m",
                    "score": 2,
                    "created_utc": 1657659299.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "ifxdwmq",
            "parent_id": "t3_vx9u94",
            "score": 2,
            "created_utc": 1657670802.0,
            "replies": [
                {
                    "body": "I’m not comfortable using that terminology. I know SRs are transactional, but I did consider her a friend. I wish her well.",
                    "author": "Timely-Pen1449",
                    "id": "ifxea9c",
                    "parent_id": "t1_ifxdwmq",
                    "score": 0,
                    "created_utc": 1657670976.0,
                    "replies": [
                        {
                            "body": "She's probably a wonderful person; but under the literal sense - she was. Im just reminding you and the open forum the matter of fact. \n\nMore a word of warning than anything.",
                            "author": "biggergorilla10",
                            "id": "ifxmpb0",
                            "parent_id": "t1_ifxea9c",
                            "score": 2,
                            "created_utc": 1657674810.0,
                            "replies": [
                                {
                                    "body": "I appreciate it. Thanks.",
                                    "author": "Timely-Pen1449",
                                    "id": "ifxz7q1",
                                    "parent_id": "t1_ifxmpb0",
                                    "score": 1,
                                    "created_utc": 1657680569.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "BFs Trump Sugar most of the time and usually manifest themselves in that way i.e cancellations, vibe is different, ensing is natural these are temporary.",
            "author": "bookworm010101",
            "id": "ifxrsjf",
            "parent_id": "t3_vx9u94",
            "score": 2,
            "created_utc": 1657677091.0,
            "replies": [
                {
                    "body": "If a bf is the highest priority to the SB it’s best for her to be honest about it and tell the SD, not milk him for more cash. If my SB would have been honest from the start, things would have been better in the end. Money changes people and it doesn’t have to be a lot of money.",
                    "author": "Timely-Pen1449",
                    "id": "ifxzut4",
                    "parent_id": "t1_ifxrsjf",
                    "score": 1,
                    "created_utc": 1657680877.0,
                    "replies": [
                        {
                            "body": "Most SBs juggle real life and SR life just like most SDs",
                            "author": "bookworm010101",
                            "id": "ifyyn55",
                            "parent_id": "t1_ifxzut4",
                            "score": 2,
                            "created_utc": 1657704571.0,
                            "replies": [
                                {
                                    "body": "Of course",
                                    "author": "Timely-Pen1449",
                                    "id": "ifz0lhk",
                                    "parent_id": "t1_ifyyn55",
                                    "score": 1,
                                    "created_utc": 1657706177.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "was texting a chick i met awhile ago and was trying to meet up again...her bf texts me @ 2 am in the morning threatening me. like dude..you're dating one of these girls..dont be mad @ me!!",
            "author": "vtec__",
            "id": "ifxw09o",
            "parent_id": "t3_vx9u94",
            "score": 2,
            "created_utc": 1657679048.0,
            "replies": [
                {
                    "body": "Yeah, he was probably in a little bit of shock.",
                    "author": "Timely-Pen1449",
                    "id": "ifxzy1v",
                    "parent_id": "t1_ifxw09o",
                    "score": 2,
                    "created_utc": 1657680921.0,
                    "replies": [
                        {
                            "body": "yea man, im in my 30s..def too young to be feelin' this old and jaded about these modern women. our society is going to enter the terminal phase of decline in about 10~ years or so...just tryin to enjoy it while i can!",
                            "author": "vtec__",
                            "id": "ify04v1",
                            "parent_id": "t1_ifxzy1v",
                            "score": 1,
                            "created_utc": 1657681014.0,
                            "replies": [
                                {
                                    "body": "There are some good SBs out there. You just need to be patient and weed out the scammers and immature ones.",
                                    "author": "Timely-Pen1449",
                                    "id": "ify0d48",
                                    "parent_id": "t1_ify04v1",
                                    "score": 1,
                                    "created_utc": 1657681127.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yes similar here.\nLong term very close.\nThen she meets BF.\nGoes ok for a few months. Then because of her mental health I paid her lost income for an extended break from her work.\nThen goes on an overseas trip with BF and never had the decency to bounce it off me first.\n\nSad but that just made me switch off.\n\nYou did the right thing.",
            "author": "sydsyd3",
            "id": "ifyjm6l",
            "parent_id": "t3_vx9u94",
            "score": 2,
            "created_utc": 1657692528.0,
            "replies": [
                {
                    "body": "Sorry to hear about your experience, but I’m sure you’re bouncing back just as I am.",
                    "author": "Timely-Pen1449",
                    "id": "ifz0utg",
                    "parent_id": "t1_ifyjm6l",
                    "score": 1,
                    "created_utc": 1657706387.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I’m so sorry… dynamics should be about open and honest communication. You did the right thing.",
            "author": "Villennox",
            "id": "ifzx69n",
            "parent_id": "t3_vx9u94",
            "score": 2,
            "created_utc": 1657723586.0,
            "replies": [
                {
                    "body": "Thanks. It wasn’t easy to let her go, but it’s clearly the right thing.",
                    "author": "Timely-Pen1449",
                    "id": "ig01afl",
                    "parent_id": "t1_ifzx69n",
                    "score": 2,
                    "created_utc": 1657725215.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "this is why people should draw the line and not let themself to be exposed to more stimuli it ends the integrity/dignity of their focus, which gets them confused with their feelings since their monkey mind just goes for it as their not content nor are they mindful of why or where these thoughts are coming from and why so\n\nmost aren't aware that is what's happening not seeing the consequence of it all just keep ending up being unhappy over and over\n\nnot a fan of poly no one should ever be this is common sense imo",
            "author": "therewasguy",
            "id": "ig14lr3",
            "parent_id": "t3_vx9u94",
            "score": 2,
            "created_utc": 1657740409.0,
            "replies": []
        },
        {
            "body": "Well done",
            "author": "SD1070",
            "id": "ig1hwh1",
            "parent_id": "t3_vx9u94",
            "score": 2,
            "created_utc": 1657745584.0,
            "replies": [
                {
                    "body": "Thanks",
                    "author": "Timely-Pen1449",
                    "id": "ig2fwty",
                    "parent_id": "t1_ig1hwh1",
                    "score": 1,
                    "created_utc": 1657760062.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I had a SB for a short time who often cancelled or changed meeting times. We didn't last long.",
            "author": "gaxxzz",
            "id": "ih1j302",
            "parent_id": "t3_vx9u94",
            "score": 2,
            "created_utc": 1658406635.0,
            "replies": []
        },
        {
            "body": "  Wow.  It’s okay for her to change things up, but not okay for you to do the same ?   That’s a big nope.  Glad you got out.",
            "author": "stocks-mostly-lower",
            "id": "ihxp4oe",
            "parent_id": "t3_vx9u94",
            "score": 2,
            "created_utc": 1658972965.0,
            "replies": []
        },
        {
            "body": "Congratulations for making the obvious decision. IMO it is important that SBs know that there is a price to pay for disrespecting Daddy's boundaries. We always talk about SB boundaries,but rarely ours. I make it clear that I support my LT SB's decision to pursue other dates and vanilla BFs. But I will not continue with her if she does. It is a very simple line that I draw in the sand. Obviously there are many guys here who don't care about their SBs body counts ,but many of us do.",
            "author": "GSSD",
            "id": "ifulm65",
            "parent_id": "t3_vx9u94",
            "score": 6,
            "created_utc": 1657629592.0,
            "replies": [
                {
                    "body": "I looked at it from a woman's angle and I think the issue is probably more the blow to the ego than body count.\n\n  \nIf I was vanilla dating (which I don't LOL) someone with a don't ask don't tell understanding and he told me that he is seeing another girl and $poiling her, it would be a huge blow to my ego and I would end things immediately.",
                    "author": "LightOLove",
                    "id": "ifuy8ls",
                    "parent_id": "t1_ifulm65",
                    "score": 7,
                    "created_utc": 1657635435.0,
                    "replies": [
                        {
                            "body": "The ego is the biggest deal here. I agree it’s like someone came and took your place and you felt deprioritized. \n\nLike you were in first class but were now asked to go take a seat in economy. Sure you are still going to get your destination and ride the same plane, it is unfortunately a horrible feeling to be in that position.",
                            "author": null,
                            "id": "ifvuduk",
                            "parent_id": "t1_ifuy8ls",
                            "score": 7,
                            "created_utc": 1657648181.0,
                            "replies": []
                        },
                        {
                            "body": "I think it’s important to define the arrangement from the start so both parties are in agreement.",
                            "author": "Timely-Pen1449",
                            "id": "ifvfqyr",
                            "parent_id": "t1_ifuy8ls",
                            "score": 3,
                            "created_utc": 1657642418.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "ifuvli1",
            "parent_id": "t3_vx9u94",
            "score": 4,
            "created_utc": 1657634295.0,
            "replies": [
                {
                    "body": "I never put restrictions on how she spent the money, but I felt very disrespected by the constant schedule changes.",
                    "author": "Timely-Pen1449",
                    "id": "ifvd9x1",
                    "parent_id": "t1_ifuvli1",
                    "score": 3,
                    "created_utc": 1657641446.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "You did the right thing.",
            "author": null,
            "id": "ifujokg",
            "parent_id": "t3_vx9u94",
            "score": 3,
            "created_utc": 1657628547.0,
            "replies": [
                {
                    "body": "Thanks. I wish her well and I am moving on.",
                    "author": "Timely-Pen1449",
                    "id": "ifvfxo3",
                    "parent_id": "t1_ifujokg",
                    "score": 2,
                    "created_utc": 1657642493.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "This is my feeling exactly. I wouldn't have an issue with my SB looking for a meaningful vanilla relationship, but as soon as one starts to affect our SR, it's time to end things.",
            "author": "sparky_SD16",
            "id": "ifumcfn",
            "parent_id": "t3_vx9u94",
            "score": 3,
            "created_utc": 1657629967.0,
            "replies": [
                {
                    "body": "I agree.",
                    "author": "Timely-Pen1449",
                    "id": "ifvf0l7",
                    "parent_id": "t1_ifumcfn",
                    "score": 1,
                    "created_utc": 1657642130.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "2.5 years is too long for an arrangement. She doesn’t care about you anymore. Move on.",
            "author": "UnearthlyDinosaur",
            "id": "ifvfv11",
            "parent_id": "t3_vx9u94",
            "score": 3,
            "created_utc": 1657642463.0,
            "replies": [
                {
                    "body": "It was uncharted waters for me…",
                    "author": "Timely-Pen1449",
                    "id": "ifvg4e6",
                    "parent_id": "t1_ifvfv11",
                    "score": 2,
                    "created_utc": 1657642567.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "You did the right thing. She was not keeping up with her end of the deal. Next.",
            "author": "CenTexFunGuy",
            "id": "ifuk5kp",
            "parent_id": "t3_vx9u94",
            "score": 2,
            "created_utc": 1657628809.0,
            "replies": [
                {
                    "body": "I’m sorry that she couldn’t see that.",
                    "author": "Timely-Pen1449",
                    "id": "ifvfusy",
                    "parent_id": "t1_ifuk5kp",
                    "score": 1,
                    "created_utc": 1657642460.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Wow, I do not know how SDs can handle non-monogamous relationships! \n\nAnother dick hanging around my SB is an immediate stop for me.\n\nCall me insecure, but I call self-respect.",
            "author": "Resolve-Brilliant",
            "id": "ifunbd5",
            "parent_id": "t3_vx9u94",
            "score": 0,
            "created_utc": 1657630457.0,
            "replies": [
                {
                    "body": "Self respecting your insecurity",
                    "author": "sparky_SD16",
                    "id": "ifuw4za",
                    "parent_id": "t1_ifunbd5",
                    "score": 7,
                    "created_utc": 1657634525.0,
                    "replies": [
                        {
                            "body": "Haha thanks",
                            "author": "Resolve-Brilliant",
                            "id": "ifuw7kf",
                            "parent_id": "t1_ifuw4za",
                            "score": 0,
                            "created_utc": 1657634558.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "I’m realistic about the SR. I can’t put up with constant scheduling issues though.",
                    "author": "Timely-Pen1449",
                    "id": "ifveyy3",
                    "parent_id": "t1_ifunbd5",
                    "score": 3,
                    "created_utc": 1657642112.0,
                    "replies": []
                },
                {
                    "body": "Same here",
                    "author": null,
                    "id": "ifuo3fr",
                    "parent_id": "t1_ifunbd5",
                    "score": 3,
                    "created_utc": 1657630851.0,
                    "replies": []
                },
                {
                    "body": "I’d call you ignorant if you think anyone isn’t fucking someone else unless you’ve talked about being exclusive.",
                    "author": null,
                    "id": "ifuo59x",
                    "parent_id": "t1_ifunbd5",
                    "score": 2,
                    "created_utc": 1657630876.0,
                    "replies": [
                        {
                            "body": "Of course I talk about exclusivity on first date.",
                            "author": "Resolve-Brilliant",
                            "id": "ifus2qd",
                            "parent_id": "t1_ifuo59x",
                            "score": 4,
                            "created_utc": 1657632750.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I think giving a shit what she spends her money on is bizarre and borderline controlling. Is buying a friend lunch okay? A dress you don’t like? A present for her dad? Does she need to submit a monthly expense report to you? Once you give her the money, what she does with it isn’t up to you.   It’s also weird to tell your not-girlfriend she has your permission to date, but only if it’s not serious.\n\n\nYou should have just left it at being unhappy with the change in the relationship dynamic and the constant rescheduling or canceling. That’s an understandable reason.",
            "author": "fakemoose",
            "id": "ifxhney",
            "parent_id": "t3_vx9u94",
            "score": 1,
            "created_utc": 1657672506.0,
            "replies": [
                {
                    "body": "That was the primary reason.  A SR is a form of dating. A SD is a type of bf. I didn’t restrict her spending in any way. I even gave her extra money to buy gifts for her mother and father on holidays. Telling me she used some of the money I gave her to buy anything for the bf was just plain foolish. It’s extremely disrespectful. If you read most of the other comments, you will see the majority of the other SDs agree. I liked helping her. I was never interested in funding her relationship with someone else. She effectively ended the arrangement by shifting her priorities which caused me to shift mine. Let her bf or someone else fund her lifestyle.",
                    "author": "Timely-Pen1449",
                    "id": "ifxkar9",
                    "parent_id": "t1_ifxhney",
                    "score": 3,
                    "created_utc": 1657673714.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Arrangement lol so you were\nLike a sugar daddy this post can’t be real lmao",
            "author": "Bubbles77_",
            "id": "ifx5ste",
            "parent_id": "t3_vx9u94",
            "score": -1,
            "created_utc": 1657667231.0,
            "replies": [
                {
                    "body": "It’s absolutely real. Are you not familiar with SRs?",
                    "author": "Timely-Pen1449",
                    "id": "ifx5xss",
                    "parent_id": "t1_ifx5ste",
                    "score": 3,
                    "created_utc": 1657667290.0,
                    "replies": [
                        {
                            "body": "Well u can be my sugar daddy now then 😂",
                            "author": "Bubbles77_",
                            "id": "ifx62gn",
                            "parent_id": "t1_ifx5xss",
                            "score": -2,
                            "created_utc": 1657667347.0,
                            "replies": [
                                {
                                    "body": "Here’s a suggestion if you’re serious. Get on a sugar dating site, make a profile and see who contacts you.",
                                    "author": "Timely-Pen1449",
                                    "id": "ifx739u",
                                    "parent_id": "t1_ifx62gn",
                                    "score": 2,
                                    "created_utc": 1657667796.0,
                                    "replies": [
                                        {
                                            "body": "Where’s a website? I’ll totally do it lol I’m attractive for sure lol",
                                            "author": "Bubbles77_",
                                            "id": "ifx7a97",
                                            "parent_id": "t1_ifx739u",
                                            "score": -2,
                                            "created_utc": 1657667880.0,
                                            "replies": [
                                                {
                                                    "body": "Maybe you can Google some sites",
                                                    "author": "Timely-Pen1449",
                                                    "id": "ifxby33",
                                                    "parent_id": "t1_ifx7a97",
                                                    "score": 2,
                                                    "created_utc": 1657669920.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "They do. After my last SB met someone, there was less kissing, less cuddling, and a lot more awkward silence. There is also a feeling of romantic rejection even if you’re still sleeping with them. My last SB held out for two months after she met someone and waited until after our vacation to end things.",
            "author": null,
            "id": "ifvlkhn",
            "parent_id": "t1_ifukv2w",
            "score": 23,
            "created_utc": 1657644662.0,
            "replies": [
                {
                    "body": "Man, are we the same person? Mine started dating someone in December, we kept it up into February, and then I think he went on vacation with her and everything ended immediately after.",
                    "author": null,
                    "id": "ifvmvfy",
                    "parent_id": "t1_ifvlkhn",
                    "score": 14,
                    "created_utc": 1657645163.0,
                    "replies": [
                        {
                            "body": "It’s a common outcome and it hurts! Sucks to watch yourself not be selected for someone hotter, more popular or more “interesting”. It made me quit sugaring so I could focus on winning someone like her next time they come around. She was only seven years younger too. But at least this life showed me the kind of person I want to be with in a relationship and now I know what I’m looking for.",
                            "author": null,
                            "id": "ifvp90n",
                            "parent_id": "t1_ifvmvfy",
                            "score": 14,
                            "created_utc": 1657646095.0,
                            "replies": [
                                {
                                    "body": "I speak for myself only, at some point I want someone long term. My SD has clearly stated he is not marriage minded. We both have admitted to having deeper feelings, so I would very much be open to long term if he felt otherwise, but that isn’t on the table. While I empathize that is sucks having someone chosen over you, in my case (and probably many other girls) it boils down to the reasons he chose an arrangement that will eventually be why I leave. My only suggestion, take with a grain of salt, is to recognize whether you are searching for long term and discuss whether that’s compatible with her life goals as well. 🤞🏻best of luck in finding what you seek",
                                    "author": "sciencewasright",
                                    "id": "ifwd7dj",
                                    "parent_id": "t1_ifvp90n",
                                    "score": 13,
                                    "created_utc": 1657655615.0,
                                    "replies": [
                                        {
                                            "body": "My current SD is also not marriage-minded, but oddly enough wanting something long-term. It saddens me to think that I have to leave him after several years. But hey, that’s life. 🫤",
                                            "author": "JaneBarret",
                                            "id": "ifygrof",
                                            "parent_id": "t1_ifwd7dj",
                                            "score": 5,
                                            "created_utc": 1657690525.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "Same situation here. I’m not even set on marriage necessarily, but I can’t even get him to sit down with me to even talk about the next year or two and if he still sees me in his life. He’s said he doesn’t want to stand in the way of me meeting anyone, but right now I’m unsure where I stand on marriage and kids and want to spend this part of my life traveling and growing with him.",
                                            "author": "blue_eyes18",
                                            "id": "ifz9wgd",
                                            "parent_id": "t1_ifwd7dj",
                                            "score": 1,
                                            "created_utc": 1657712600.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "I was intending on asking her to take the next step towards vanilla upon her return as it all seemed good up until the trip. Think she picked him more out of convenience without the messy transition from SGF to something more traditional. That’s what she was craving, almost had a restart between us the next month, and then another vanilla relationship for her really derailed everything. Remained good friends for six months and now she’s gone.",
                                    "author": null,
                                    "id": "ifvq0or",
                                    "parent_id": "t1_ifvp90n",
                                    "score": 6,
                                    "created_utc": 1657646395.0,
                                    "replies": []
                                },
                                {
                                    "body": "For me, they usually go back to the \"Bad Boy\" types. And by \"Bad\" I mean, abusive, lazy, jobless or low paying job. Like, WTF???",
                                    "author": "MrRetrdO",
                                    "id": "ifyf1as",
                                    "parent_id": "t1_ifvp90n",
                                    "score": 2,
                                    "created_utc": 1657689376.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Bottomline is SBs who think they can have it all unfortunately can’t. In the end they risk losing it all. I think OP would have understood and respected her if she had been upfront and honest about her vanilla and expressed interest in moving on herself. She would have kept the respect if not the arrangement and maybe even a chance to get back with the OP in the future. In this case she burnt all her bridges!",
            "author": null,
            "id": "ifzk7uq",
            "parent_id": "t1_ifukv2w",
            "score": 0,
            "created_utc": 1657718001.0,
            "replies": []
        },
        {
            "body": "I agree",
            "author": "Timely-Pen1449",
            "id": "ifvcno8",
            "parent_id": "t1_ifuy33k",
            "score": 8,
            "created_utc": 1657641206.0,
            "replies": []
        },
        {
            "body": "I try to be the bigger person, but it did bother me when she blurted that out. The primary issue was not prioritizing our meets.",
            "author": "Timely-Pen1449",
            "id": "ifve3d8",
            "parent_id": "t1_ifur0wt",
            "score": 8,
            "created_utc": 1657641766.0,
            "replies": []
        },
        {
            "body": "I tried to handle ending the SR with kindness, but she seemed genuinely angry. I think it may have been a shock to her.",
            "author": "Timely-Pen1449",
            "id": "ifvdr3c",
            "parent_id": "t1_ifut3fj",
            "score": 8,
            "created_utc": 1657641633.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "ifwam02",
                    "parent_id": "t1_ifvdr3c",
                    "score": 11,
                    "created_utc": 1657654602.0,
                    "replies": [
                        {
                            "body": "That could have been her plan",
                            "author": "Timely-Pen1449",
                            "id": "ifwmceh",
                            "parent_id": "t1_ifwam02",
                            "score": 6,
                            "created_utc": 1657659167.0,
                            "replies": []
                        },
                        {
                            "body": "Exactly what I was thinking.\nAlthough I AM very surprised that she was actually up front about using her allowance to buy the dude a gift.😳\nThat was just stupid.🤦🏻‍♀️🤦🏻‍♀️🤦🏻‍♀️\nSorry, not sorry, I call it like I see it.\n\nThat allowance should've actually been put to a good resource, to HELP the SB, NOT some new dude.\n\nFrankly, if yall had a good relationship going, there's no way in hell that I'd be like...oh hey, guess what, I found a boy toy that I really started liking....and then make it so our arrangement was conflicted. \nEspecially since yalls relationship was first.🤨🤦🏻‍♀️🤦🏻‍♀️🤦🏻‍♀️\n\nOf COURSE you are going to end it, bc she isn't putting yall first anymore!!  (That just seems like such a dit da dee moment to me🤷🏻‍♀️🤦🏻‍♀️🙄)\n\nSeriously, I don't get the audacity sometimes.🤷🏻‍♀️🤷🏻‍♀️🤨\n\nShe was probably angry bc she felt like she was being honest and open with you about it, and in her mind it was OK, IF you said it was OK if she was discreet.\n\nBUT....THEN AGAIN, discreet IS NOT, telling your SD about what you bought your possible new boy toy, with the money that was meant to help your ass!🙄🙄🤦🏻‍♀️🤦🏻‍♀️",
                            "author": "JustAsk4Alice",
                            "id": "ifwi1ot",
                            "parent_id": "t1_ifwam02",
                            "score": 3,
                            "created_utc": 1657657503.0,
                            "replies": [
                                {
                                    "body": "She really miscalculated, didn’t she? Lol",
                                    "author": "Timely-Pen1449",
                                    "id": "ifwmfd3",
                                    "parent_id": "t1_ifwi1ot",
                                    "score": 6,
                                    "created_utc": 1657659199.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "don’t they say you can’t have your cake and eat it or something?",
                    "author": "Jonconnerysd",
                    "id": "ifvus6w",
                    "parent_id": "t1_ifvdr3c",
                    "score": 5,
                    "created_utc": 1657648345.0,
                    "replies": [
                        {
                            "body": "Yes, that is the saying",
                            "author": "Timely-Pen1449",
                            "id": "ifwnpi3",
                            "parent_id": "t1_ifvus6w",
                            "score": 5,
                            "created_utc": 1657659690.0,
                            "replies": []
                        },
                        {
                            "body": "Yeah. You can’t have your cake and eat it too.",
                            "author": "JaneBarret",
                            "id": "ifyhhq1",
                            "parent_id": "t1_ifvus6w",
                            "score": 3,
                            "created_utc": 1657691020.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I think she’ll be fine. She’s head over heels with the bf and I wish her well. If they break up and I am\nnot in a SR, I would probably consider getting back with her.",
            "author": "Timely-Pen1449",
            "id": "ifveeg6",
            "parent_id": "t1_ifup2p1",
            "score": 6,
            "created_utc": 1657641889.0,
            "replies": []
        },
        {
            "body": "Heh, I’ve been on the receiving end of the moral crisis, too.",
            "author": null,
            "id": "ifuya3e",
            "parent_id": "t1_ifup2p1",
            "score": 7,
            "created_utc": 1657635453.0,
            "replies": [
                {
                    "body": "She was probably the most conventionally attractive gal I've ever dated...Former Maxim model.\n\nBut to quote a former colleague, \"It doesn't matter how beautiful she is, there's some guy out there who's sick of her shit.\" 😂",
                    "author": "SD-Casual-Fla",
                    "id": "ifuzlxn",
                    "parent_id": "t1_ifuya3e",
                    "score": 14,
                    "created_utc": 1657636006.0,
                    "replies": [
                        {
                            "body": "Why does it have to be negative? Be happy for her if you care about her.",
                            "author": "WhisperingPetals",
                            "id": "ifwzkoj",
                            "parent_id": "t1_ifuzlxn",
                            "score": 1,
                            "created_utc": 1657664590.0,
                            "replies": [
                                {
                                    "body": "Please read my other comment on this thread.",
                                    "author": "SD-Casual-Fla",
                                    "id": "ifwzwbn",
                                    "parent_id": "t1_ifwzkoj",
                                    "score": 3,
                                    "created_utc": 1657664727.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "ifv3ff0",
                            "parent_id": "t1_ifuzlxn",
                            "score": 1,
                            "created_utc": 1657637547.0,
                            "replies": [
                                {
                                    "body": "I didn't. We were a month and a half, weekly arrangement. Felt like king for the day, when we were in South Beach a couple times. Sweet lady, I wish her nothing but the best.",
                                    "author": "SD-Casual-Fla",
                                    "id": "ifv6ibj",
                                    "parent_id": "t1_ifv3ff0",
                                    "score": 3,
                                    "created_utc": 1657638761.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "She told me, eventually, that the bf knew about me and was OK with it, but I think she was clutching at straws in order to keep the money flowing. What she didn’t understand was that she was disrespecting me by changing our scheduled dates.",
            "author": "Timely-Pen1449",
            "id": "ifvj9lo",
            "parent_id": "t1_ifvggwk",
            "score": 4,
            "created_utc": 1657643774.0,
            "replies": []
        },
        {
            "body": "he showed up @ your house?",
            "author": "vtec__",
            "id": "ifxwcqk",
            "parent_id": "t1_ifvggwk",
            "score": 2,
            "created_utc": 1657679210.0,
            "replies": []
        },
        {
            "body": "You are absolutely correct.",
            "author": "Timely-Pen1449",
            "id": "ifvckf9",
            "parent_id": "t1_ifv184e",
            "score": 3,
            "created_utc": 1657641171.0,
            "replies": []
        },
        {
            "body": "Thanks for your kind words. I agree.",
            "author": "Timely-Pen1449",
            "id": "ifvddha",
            "parent_id": "t1_ifut40w",
            "score": 5,
            "created_utc": 1657641484.0,
            "replies": []
        },
        {
            "body": "It’s not just that. There is a primal male thing going on here too. \n\nOlder guys don’t like supporting the younger guy, even indirectly. He gets to have the girl and my money?? \n\nIt’s a massive slap in the face to one’s masculinity. The SB is basically telling OP that she sleeps with this other guy and gives him money (gifts , etc) because that’s how much better he is than you (who has to be the one giving money). It also grates on an older guy that a younger guy is being supported like that when traditionally even that younger guy should be the gift giver. “He can’t even be a proper man and she still prefers him to some stupid degree”. \n\nThat’s what goes through my head at least.  I’m sure many guys are similar.",
            "author": "Neither-Ad-2833",
            "id": "ifwpkld",
            "parent_id": "t1_ifut40w",
            "score": 9,
            "created_utc": 1657660433.0,
            "replies": [
                {
                    "body": "this. idk whats up with these younger girls today..they literally pay for everything and they're in LOVE with these losers!!",
                    "author": "vtec__",
                    "id": "ifxw5nr",
                    "parent_id": "t1_ifwpkld",
                    "score": 4,
                    "created_utc": 1657679120.0,
                    "replies": [
                        {
                            "body": "Too many Disney movies. \n\nI went on a weekend trip with a miserly ex [close to my age, who made decent money] while I was unemployed. I felt the need to be seen as an equal partner, so I put over a hundo on a credit card for food and drinks and such for us while there, with obviously no hope of paying it off anytime soon. That amount isn’t nearly as much of an issue now, but from that experience, I learned a very important lesson about partner worthiness and finding someone who will support me through a career transition, instead of just happily letting me pay because I feel like I *should* contribute in order to keep him when I’m in no place to do so. Thankfully, he ended things after that weekend trip. I haven’t made the same mistake since. \n\nAnyway, I blame it on Disney and the idea that he could have been “the one” that I was doing everything I could to keep. I feel sorry for early 2020 me who thought he was actually a worthy partner, but I’ve forgiven her because we’ve learned and grown a lot since then.",
                            "author": "blue_eyes18",
                            "id": "ifzbl3o",
                            "parent_id": "t1_ifxw5nr",
                            "score": 2,
                            "created_utc": 1657713583.0,
                            "replies": [
                                {
                                    "body": "its been like this for along time, 10 years or so. i know alot of girls who date dustys",
                                    "author": "vtec__",
                                    "id": "ig14xiu",
                                    "parent_id": "t1_ifzbl3o",
                                    "score": 3,
                                    "created_utc": 1657740536.0,
                                    "replies": []
                                },
                                {
                                    "body": "I see you may have posted a number which is most likely an amount in relations to an arrangement. If this is the case, you are violating Rule #4 - \"No dollar amounts that are in reference to allowance/PPM are allowed.\"\n\nIf you are curious about Allowances reported by SLF contributors please see the [Allowance Master Thread 2021-2022](/r/sugarlifestyleforum/comments/pc22tk/allowance_master_thread_20212022/).\n\nYour post will not be approved until you remove the amount.  Please read the sub [Rules](/r/sugarlifestyleforum/comments/748zta/updated_and_clarified_rules_for_slf/) prior to posting anything else. \n\nIf you simply posted a number not referencing a monetary amount, please message the MODs to approve your post.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/sugarlifestyleforum) if you have any questions or concerns.*",
                                    "author": "AutoModerator",
                                    "id": "ifzbl57",
                                    "parent_id": "t1_ifzbl3o",
                                    "score": 1,
                                    "created_utc": 1657713584.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I think the relationship is much less of a problem than you perceive it to be. \n\nFairly sure OP and a whole bunch of other SDs would be completely fine with the SB having a relationship and even knowing about it. But she stopped fulfilling her part of the sugar relationship, became unreliable and pretty much untrustworthy. That is the problem here.",
            "author": "YlangScent",
            "id": "ifwrtxp",
            "parent_id": "t1_ifut40w",
            "score": 7,
            "created_utc": 1657661340.0,
            "replies": [
                {
                    "body": "I agree. Except a lot of men are here complaining about what she spends her money on. They seem to still want full financial control even after they give their SB the money.",
                    "author": "fakemoose",
                    "id": "ifxi662",
                    "parent_id": "t1_ifwrtxp",
                    "score": 3,
                    "created_utc": 1657672743.0,
                    "replies": [
                        {
                            "body": "Yes, but that's not OP nor is it the problem indicated in this relationship.\n\nYou can't make a point that all we need to do is accept their financial autonomy. Because the relationship would still be messed up even if everyone did that.\n\nThe core problem is that she started prioritising the sugar relationship much lower and cancelling meetings among other things. No matter what else is happening that people have different opinions on, this factor is the key one that is unacceptable across the board.",
                            "author": "YlangScent",
                            "id": "ifynexu",
                            "parent_id": "t1_ifxi662",
                            "score": 3,
                            "created_utc": 1657695369.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I figured an offer for a threesome was coming next..lol",
            "author": "Timely-Pen1449",
            "id": "ifwnmth",
            "parent_id": "t1_ifvw0sv",
            "score": 7,
            "created_utc": 1657659661.0,
            "replies": []
        },
        {
            "body": "Thanks.",
            "author": "Timely-Pen1449",
            "id": "ifx5vej",
            "parent_id": "t1_ifx3du9",
            "score": 4,
            "created_utc": 1657667261.0,
            "replies": []
        },
        {
            "body": "I wish her all the best. SRs usually have a limited shelf life.",
            "author": "Timely-Pen1449",
            "id": "ifvbpzh",
            "parent_id": "t1_ifv81pa",
            "score": 5,
            "created_utc": 1657640845.0,
            "replies": [
                {
                    "body": "Agree completely with your thinking, plus you're being very gracious. What I 'm curious about is now that your support for her has ended, she will not be able to gift her boyfriend anymore. Wonder how that will affect their relationship . . .",
                    "author": "Socrates59",
                    "id": "ifyhdcr",
                    "parent_id": "t1_ifvbpzh",
                    "score": 2,
                    "created_utc": 1657690936.0,
                    "replies": [
                        {
                            "body": "I suppose that is their problem",
                            "author": "Timely-Pen1449",
                            "id": "ifz0z2a",
                            "parent_id": "t1_ifyhdcr",
                            "score": 2,
                            "created_utc": 1657706478.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "We had a great SR. She’s so focused on the bf, that she couldn’t see that the constant schedule changes were affecting us.",
            "author": "Timely-Pen1449",
            "id": "ifvfe8m",
            "parent_id": "t1_ifum8er",
            "score": 3,
            "created_utc": 1657642277.0,
            "replies": [
                {
                    "body": "I guess she figured she had the SR “in the bank” so she has enough flex to go vanilla date with little awareness that she may not be able to handle the demands of multiple relationships and causing her SR to weaken and die.\n\n I feel sorry for her but I hope the vanilla lasts. They often don’t and then the lady ends up with a zero.",
                    "author": null,
                    "id": "ifvtyve",
                    "parent_id": "t1_ifvfe8m",
                    "score": 5,
                    "created_utc": 1657647932.0,
                    "replies": [
                        {
                            "body": "I hope things work out for her. She’s both smart and beautiful and has a bright future. I just won’t be helping her achieve her goals anymore.",
                            "author": "Timely-Pen1449",
                            "id": "ifwo4ka",
                            "parent_id": "t1_ifvtyve",
                            "score": 3,
                            "created_utc": 1657659854.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "It was the constant rescheduling that drew attention. If she would have kept our regular schedule and been discreet, I may have continued the arrangement.",
            "author": "Timely-Pen1449",
            "id": "ifvd437",
            "parent_id": "t1_ifuvy14",
            "score": 5,
            "created_utc": 1657641383.0,
            "replies": []
        },
        {
            "body": "Thanks for the good wishes.",
            "author": "Timely-Pen1449",
            "id": "ifvcr4z",
            "parent_id": "t1_ifux2oj",
            "score": 3,
            "created_utc": 1657641243.0,
            "replies": []
        },
        {
            "body": "Good point.  Its an easy way to break up with here.  You are no longer financially responsible for her, or having to solve all the problems in her life.  (been there).",
            "author": "HappyBear1952",
            "id": "ifv8z0e",
            "parent_id": "t1_ifux2oj",
            "score": 5,
            "created_utc": 1657639752.0,
            "replies": []
        },
        {
            "body": "Thanks.",
            "author": "Timely-Pen1449",
            "id": "ifvfz7u",
            "parent_id": "t1_ifvf7js",
            "score": 3,
            "created_utc": 1657642510.0,
            "replies": [
                {
                    "body": "You must miss her though..did you look for another SB?",
                    "author": "meleficent007",
                    "id": "ifvg55u",
                    "parent_id": "t1_ifvfz7u",
                    "score": 3,
                    "created_utc": 1657642575.0,
                    "replies": [
                        {
                            "body": "I’m searching now",
                            "author": "Timely-Pen1449",
                            "id": "ifviobu",
                            "parent_id": "t1_ifvg55u",
                            "score": 2,
                            "created_utc": 1657643547.0,
                            "replies": [
                                {
                                    "body": "Nice...where are you located..",
                                    "author": "meleficent007",
                                    "id": "ifviwc4",
                                    "parent_id": "t1_ifviobu",
                                    "score": 3,
                                    "created_utc": 1657643634.0,
                                    "replies": [
                                        {
                                            "body": "Florida",
                                            "author": "Timely-Pen1449",
                                            "id": "ifvjbrx",
                                            "parent_id": "t1_ifviwc4",
                                            "score": 2,
                                            "created_utc": 1657643797.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I don’t wish my former sb anything but happiness. She just accelerated the ending of our relationship by her actions.",
            "author": "Timely-Pen1449",
            "id": "ifwnvr6",
            "parent_id": "t1_ifvuerr",
            "score": 5,
            "created_utc": 1657659759.0,
            "replies": []
        },
        {
            "body": "Nope. That’s the crazy part. Why she thought that would help matters is beyond my comprehension. The worst thing was changing our scheduled dates.",
            "author": "Timely-Pen1449",
            "id": "ifwn2lx",
            "parent_id": "t1_ifwdy0w",
            "score": 4,
            "created_utc": 1657659447.0,
            "replies": [
                {
                    "body": "Oh wow that is pretty shitty of her. Block and move on brother. Let her find money elsewhere to support her loser BF.",
                    "author": "fatsocalsd",
                    "id": "ifx11zv",
                    "parent_id": "t1_ifwn2lx",
                    "score": 4,
                    "created_utc": 1657665215.0,
                    "replies": [
                        {
                            "body": "I actually wish her well. Its a shame it had to go down this way",
                            "author": "Timely-Pen1449",
                            "id": "ifx5n6q",
                            "parent_id": "t1_ifx11zv",
                            "score": 2,
                            "created_utc": 1657667165.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Sorry to hear that. Sounds like you tried to be a good guy about it",
            "author": "Timely-Pen1449",
            "id": "ifxc1ry",
            "parent_id": "t1_ifx9f7x",
            "score": 3,
            "created_utc": 1657669966.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "ifxcnwy",
                    "parent_id": "t1_ifxc1ry",
                    "score": 2,
                    "created_utc": 1657670243.0,
                    "replies": [
                        {
                            "body": "I had a SB before this past one. We were together through her last two years of Med School. When she left the state for her fellowship, we ended things amicably. I think that’s how a SR should work.",
                            "author": "Timely-Pen1449",
                            "id": "ifxeqfk",
                            "parent_id": "t1_ifxcnwy",
                            "score": 3,
                            "created_utc": 1657671181.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I agree with you. I’m not sure what her logic was in even making that statement to me.",
            "author": "Timely-Pen1449",
            "id": "ifz0rj9",
            "parent_id": "t1_ifym1au",
            "score": 1,
            "created_utc": 1657706313.0,
            "replies": []
        },
        {
            "body": "Maybe. She’s head over heels for the bf and isn’t thinking about anything else. I wish her well.",
            "author": "Timely-Pen1449",
            "id": "ifver0k",
            "parent_id": "t1_ifuo1zx",
            "score": 3,
            "created_utc": 1657642026.0,
            "replies": []
        },
        {
            "body": "Shit....phone a friend then.\nI got you.\n\nI'm an SB and I would've taken care of it.\nAin't no way in hell a POT BF would EVER be allowed to mess with my ALREADY REAL sugar relationship.\nNooooope.🙅🏻‍♀️🙅🏻‍♀️🙅🏻‍♀️\n\nThat was a chick that OBVIOUSLY couldn't \"handle her man.\" \nThere's a lot of ways to resolve things and whatever the hell she did that gave him the info to your place, THAT, was seriously one of the most stupid things that she could have done.\nI'm sorry you were subjected to that.",
            "author": "JustAsk4Alice",
            "id": "ifwxkys",
            "parent_id": "t1_ifv6g8o",
            "score": 5,
            "created_utc": 1657663759.0,
            "replies": []
        },
        {
            "body": "Lmfao bro.",
            "author": "Regular_Phone3261",
            "id": "ifvwd7l",
            "parent_id": "t1_ifv6g8o",
            "score": 5,
            "created_utc": 1657648982.0,
            "replies": []
        },
        {
            "body": "Generally totally agree how she spends her money not my business….but, it would feel bad to me to support someone who is giving gifts to a BF and not respecting our dynamic.",
            "author": "Pitkin_SD",
            "id": "ifuqlvv",
            "parent_id": "t1_ifuocl2",
            "score": 6,
            "created_utc": 1657632066.0,
            "replies": []
        },
        {
            "body": "It was the constant rescheduling that bothered me the most.",
            "author": "Timely-Pen1449",
            "id": "ifvekqk",
            "parent_id": "t1_ifuocl2",
            "score": 3,
            "created_utc": 1657641957.0,
            "replies": []
        },
        {
            "body": "I disagree.  I have never had a SB that is in a marriage/bf’d  or in an open relationship as I don’t want to be supporting his lazy ass.  Guys that don’t provide properly for their partners should just stick to being fuck boys.",
            "author": "DomDaddyNW",
            "id": "ifuxqmk",
            "parent_id": "t1_ifuocl2",
            "score": 6,
            "created_utc": 1657635223.0,
            "replies": [
                {
                    "body": "Lmfao a gift or dinner sometimes is not even close to the same as supporting someone.",
                    "author": "fakemoose",
                    "id": "ifxiifn",
                    "parent_id": "t1_ifuxqmk",
                    "score": 1,
                    "created_utc": 1657672899.0,
                    "replies": [
                        {
                            "body": "So if they are so content with their life that their BF or SO has provided why are they on SA.  You be their cuck ATM seems to work for you.",
                            "author": "DomDaddyNW",
                            "id": "ify6bqi",
                            "parent_id": "t1_ifxiifn",
                            "score": 0,
                            "created_utc": 1657684173.0,
                            "replies": [
                                {
                                    "body": "You can’t seem to wrap your head around the concept that there doesn’t have to be someone in the role of “provider” in all relationships. It’s fascinating.",
                                    "author": "fakemoose",
                                    "id": "ig00ywn",
                                    "parent_id": "t1_ify6bqi",
                                    "score": 1,
                                    "created_utc": 1657725087.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "It's disrespectful to make us sugar her boyfriend when we'd rather keep her to ourselves to begin with. We'll I'm selfish and possessive, and I am proud of it. The shame on women thinking men should be ok sharing them, we have self respect 💪",
            "author": "sugardad123",
            "id": "ifv400b",
            "parent_id": "t1_ifuocl2",
            "score": 2,
            "created_utc": 1657637771.0,
            "replies": [
                {
                    "body": "Feels too much like when the right say shit like \"I don't want my tax dollars going to abortions!!!!\" Like fuck off, the government spends on every conceivable issue and everyone pays for things they don't support or vote for. It's not disrespectful, it's her money. I stick to monogamous relationships, so the bf would end things for me too, but it wouldn't bother me if she spent money given to her on a bf.",
                    "author": "whatever-tata",
                    "id": "ifw8q9p",
                    "parent_id": "t1_ifv400b",
                    "score": 5,
                    "created_utc": 1657653864.0,
                    "replies": [
                        {
                            "body": "What planet are you living on? I don't even support SBs who have boyfriends to boot, and you think I'd be ok giving her money knowingly?\n\nNo if I'm paying a girl to be my girlfriend, she can't have a boyfriend, I'm her boyfriend my friend. The disrespect is so enormous! I can't even believe it.",
                            "author": "sugardad123",
                            "id": "ifwd5dt",
                            "parent_id": "t1_ifw8q9p",
                            "score": -1,
                            "created_utc": 1657655594.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "You indulged to fuck her with condom? Why didn't you just wait for test results? I'm so done with condoms, I blow up magnums everytime, now 4 years without 💪",
            "author": "sugardad123",
            "id": "ifv4nb9",
            "parent_id": "t1_ifurfo0",
            "score": -2,
            "created_utc": 1657638022.0,
            "replies": [
                {
                    "body": "I used to feel that way, but my current SB and I went protected for 4 months, and I got used to them.  Thankfully, we developed enough trust to now go without...but I wouldn't hesitate to use them again.\n\n\\#olddognewtrick",
                    "author": "sdphilly",
                    "id": "ifv77sh",
                    "parent_id": "t1_ifv4nb9",
                    "score": 1,
                    "created_utc": 1657639048.0,
                    "replies": []
                },
                {
                    "body": "Unless your condoms are old, that shouldn't happen.  Those things are stress tested by holding up to 2liters of liquid.  I just recently took a class at Frolicon and learned how to give a blowjob with a condom.  It was phenomenal.  Just as much drool with the flavored lubes as without, plus a few new technique.",
                    "author": "Mostly_Always_Truly",
                    "id": "ifvbr74",
                    "parent_id": "t1_ifv4nb9",
                    "score": 0,
                    "created_utc": 1657640857.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I agree. Most SRs have a limited shelf life",
            "author": "Timely-Pen1449",
            "id": "ifwo7j7",
            "parent_id": "t1_ifvph4y",
            "score": 2,
            "created_utc": 1657659886.0,
            "replies": []
        },
        {
            "body": "I agree completely",
            "author": "Timely-Pen1449",
            "id": "ifwtwnl",
            "parent_id": "t1_ifwtqtf",
            "score": 1,
            "created_utc": 1657662180.0,
            "replies": []
        },
        {
            "body": "Oh, she’s on the curb right now. \nIn reality, I wish her all the best as she pursues her goals. It’s a shame I can’t continue to help her, but it was her choice.",
            "author": "Timely-Pen1449",
            "id": "ifwzna6",
            "parent_id": "t1_ifwz603",
            "score": 3,
            "created_utc": 1657664621.0,
            "replies": [
                {
                    "body": "Good deal. You'll find another one.",
                    "author": "Automatic_Joke_4414",
                    "id": "ifx0e1r",
                    "parent_id": "t1_ifwzna6",
                    "score": 4,
                    "created_utc": 1657664934.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Maybe, maybe not. SRs usually have a limited shelf life",
            "author": "Timely-Pen1449",
            "id": "ifx5tkh",
            "parent_id": "t1_ifwzyo6",
            "score": 2,
            "created_utc": 1657667240.0,
            "replies": []
        },
        {
            "body": "I agree. The issue was really the change in priorities.",
            "author": "Timely-Pen1449",
            "id": "ifx6saq",
            "parent_id": "t1_ifx6jul",
            "score": 2,
            "created_utc": 1657667661.0,
            "replies": []
        },
        {
            "body": "I agree, for the most part. I didn’t tell her how to spend her allowance. It was the constant schedule changes that really caused me to confront the situation.",
            "author": "Timely-Pen1449",
            "id": "ifvc1y0",
            "parent_id": "t1_ifv7xb9",
            "score": 2,
            "created_utc": 1657640973.0,
            "replies": []
        },
        {
            "body": "While I agree he should move on because he wasn’t comfortable with the situation, What she spends her money on is really none of his business.",
            "author": "Lar5031",
            "id": "ifx5qao",
            "parent_id": "t1_ifwoihx",
            "score": 4,
            "created_utc": 1657667201.0,
            "replies": [
                {
                    "body": "As long as it doesn't affect the SR .  . . that's what the issue is here.",
                    "author": "Socrates59",
                    "id": "ifyhn6e",
                    "parent_id": "t1_ifx5qao",
                    "score": 2,
                    "created_utc": 1657691126.0,
                    "replies": [
                        {
                            "body": "This",
                            "author": "Blueexpression",
                            "id": "ifynb0m",
                            "parent_id": "t1_ifyhn6e",
                            "score": 1,
                            "created_utc": 1657695284.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "She’s got a very delusional perspective on things. Either way, I still wish her well.",
            "author": "Timely-Pen1449",
            "id": "ifwop98",
            "parent_id": "t1_ifwoihx",
            "score": 3,
            "created_utc": 1657660078.0,
            "replies": [
                {
                    "body": "The entitlement is astounding . . .",
                    "author": "Socrates59",
                    "id": "ifyhjyc",
                    "parent_id": "t1_ifwop98",
                    "score": 2,
                    "created_utc": 1657691063.0,
                    "replies": [
                        {
                            "body": "I’m still scratching my head over that",
                            "author": "Timely-Pen1449",
                            "id": "ifz0wjz",
                            "parent_id": "t1_ifyhjyc",
                            "score": 1,
                            "created_utc": 1657706424.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "sounds like your typical gen Z / millenial woman",
                    "author": "vtec__",
                    "id": "ifxxf5y",
                    "parent_id": "t1_ifwop98",
                    "score": 0,
                    "created_utc": 1657679714.0,
                    "replies": [
                        {
                            "body": "Unfortunately…",
                            "author": "Timely-Pen1449",
                            "id": "ifxzznk",
                            "parent_id": "t1_ifxxf5y",
                            "score": 1,
                            "created_utc": 1657680942.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Like  said, I didn’t have a problem with casual dating. When she got serious with someone and it affected our arrangement, I had to call it quits.",
            "author": "Timely-Pen1449",
            "id": "ifvci83",
            "parent_id": "t1_ifv3gao",
            "score": 2,
            "created_utc": 1657641148.0,
            "replies": []
        },
        {
            "body": "Not for long…",
            "author": "Timely-Pen1449",
            "id": "ifvbfxa",
            "parent_id": "t1_ifv9n4g",
            "score": 1,
            "created_utc": 1657640736.0,
            "replies": []
        },
        {
            "body": "I really enjoyed our SR and might be tempted, but I guess it all depends on if I have established something with someone else.",
            "author": "Timely-Pen1449",
            "id": "ifvnydq",
            "parent_id": "t1_ifvmpjs",
            "score": 1,
            "created_utc": 1657645582.0,
            "replies": []
        },
        {
            "body": "I agree",
            "author": "Timely-Pen1449",
            "id": "ifvoxwq",
            "parent_id": "t1_ifvoccn",
            "score": 1,
            "created_utc": 1657645973.0,
            "replies": []
        },
        {
            "body": "Unfortunately, I think she’s living in a fantasy world.",
            "author": "Timely-Pen1449",
            "id": "ifwnj7c",
            "parent_id": "t1_ifvyao7",
            "score": 2,
            "created_utc": 1657659624.0,
            "replies": [
                {
                    "body": "Yeah. When this happened to me, she ended up unhappy because he didn’t support her lifestyle. Now it’s a sloppy mess.",
                    "author": "ConstructionReal356",
                    "id": "ifwnszm",
                    "parent_id": "t1_ifwnj7c",
                    "score": 1,
                    "created_utc": 1657659729.0,
                    "replies": [
                        {
                            "body": "All relationships are tough and require work to maintain. She and I had a really good run.",
                            "author": "Timely-Pen1449",
                            "id": "ifwokbk",
                            "parent_id": "t1_ifwnszm",
                            "score": 1,
                            "created_utc": 1657660024.0,
                            "replies": [
                                {
                                    "body": "I’m in a situation where I kept helping her out and now I’ve met her new boyfriend and he’s convinced I’m going to steal her away and live happily ever after and tis a bit stupid",
                                    "author": "ConstructionReal356",
                                    "id": "ifwotii",
                                    "parent_id": "t1_ifwokbk",
                                    "score": 1,
                                    "created_utc": 1657660125.0,
                                    "replies": [
                                        {
                                            "body": "I don’t envy you. It’s gotta be a little awkward and weird",
                                            "author": "Timely-Pen1449",
                                            "id": "ifwp8al",
                                            "parent_id": "t1_ifwotii",
                                            "score": 1,
                                            "created_utc": 1657660292.0,
                                            "replies": [
                                                {
                                                    "body": "It is. I mean the more he fixates on it, the more I’m tempted to swoop in and steal her tbh.",
                                                    "author": "ConstructionReal356",
                                                    "id": "ifwpfai",
                                                    "parent_id": "t1_ifwp8al",
                                                    "score": 1,
                                                    "created_utc": 1657660372.0,
                                                    "replies": [
                                                        {
                                                            "body": "Wow. I checked her bfs social media and saw pics of them at an air B&B on the day she and I were supposed to be together. That sealed the deal.",
                                                            "author": "Timely-Pen1449",
                                                            "id": "ifwt327",
                                                            "parent_id": "t1_ifwpfai",
                                                            "score": 3,
                                                            "created_utc": 1657661846.0,
                                                            "replies": []
                                                        },
                                                        {
                                                            "body": "Where and when do you communicate with the bf? I’m curious now.",
                                                            "author": "Timely-Pen1449",
                                                            "id": "ifwrxjv",
                                                            "parent_id": "t1_ifwpfai",
                                                            "score": 1,
                                                            "created_utc": 1657661380.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Social media mostly. And occasionally in person lol. Only really chatted a few times with him. But I’ve read over her texts (not snooping) and he’s outright expressed to me that he thinks she likes me better.",
                                                                    "author": "ConstructionReal356",
                                                                    "id": "ifwsfs3",
                                                                    "parent_id": "t1_ifwrxjv",
                                                                    "score": 1,
                                                                    "created_utc": 1657661586.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I think the parameters of the arrangement need to be settled up front.",
            "author": "Timely-Pen1449",
            "id": "ifwne06",
            "parent_id": "t1_ifwbkwn",
            "score": 2,
            "created_utc": 1657659568.0,
            "replies": [
                {
                    "body": "Of course. If any party breaks the arrangement, then that’s clear grounds to end it. Or, just end it because we are all adults and no one is tied to any of these arrangements. I think it’s strange that there is this sense of entitlement on both the SB and SD side. If you want true commitment from either side, then you need to engage and pursue a traditional relationship. Many SBs complain about SDs being too controlling when the obvious resolution is just to end it; but obviously the financial benefit keeps them there. Same with SDs.  SBs are plentiful, especially if you have the means to support them.",
                    "author": "Quiet-Eggplant-6811",
                    "id": "ifwzwx1",
                    "parent_id": "t1_ifwne06",
                    "score": 2,
                    "created_utc": 1657664734.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "She comes from an upper middle class family. I don’t think he has much, but I really don’t know or care.",
            "author": "Timely-Pen1449",
            "id": "ifwna41",
            "parent_id": "t1_ifwbmjd",
            "score": 1,
            "created_utc": 1657659527.0,
            "replies": []
        },
        {
            "body": "Yup, that’s how I thought about it.",
            "author": "Timely-Pen1449",
            "id": "ifwmtak",
            "parent_id": "t1_ifwescu",
            "score": 1,
            "created_utc": 1657659347.0,
            "replies": []
        },
        {
            "body": "Under the circumstances, I ended things immediately. When she became belligerent and demanded I see things her way, I really couldn’t continue one more day.",
            "author": "Timely-Pen1449",
            "id": "ifwmot2",
            "parent_id": "t1_ifwg62m",
            "score": 2,
            "created_utc": 1657659299.0,
            "replies": []
        },
        {
            "body": "I’m not comfortable using that terminology. I know SRs are transactional, but I did consider her a friend. I wish her well.",
            "author": "Timely-Pen1449",
            "id": "ifxea9c",
            "parent_id": "t1_ifxdwmq",
            "score": 0,
            "created_utc": 1657670976.0,
            "replies": [
                {
                    "body": "She's probably a wonderful person; but under the literal sense - she was. Im just reminding you and the open forum the matter of fact. \n\nMore a word of warning than anything.",
                    "author": "biggergorilla10",
                    "id": "ifxmpb0",
                    "parent_id": "t1_ifxea9c",
                    "score": 2,
                    "created_utc": 1657674810.0,
                    "replies": [
                        {
                            "body": "I appreciate it. Thanks.",
                            "author": "Timely-Pen1449",
                            "id": "ifxz7q1",
                            "parent_id": "t1_ifxmpb0",
                            "score": 1,
                            "created_utc": 1657680569.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "If a bf is the highest priority to the SB it’s best for her to be honest about it and tell the SD, not milk him for more cash. If my SB would have been honest from the start, things would have been better in the end. Money changes people and it doesn’t have to be a lot of money.",
            "author": "Timely-Pen1449",
            "id": "ifxzut4",
            "parent_id": "t1_ifxrsjf",
            "score": 1,
            "created_utc": 1657680877.0,
            "replies": [
                {
                    "body": "Most SBs juggle real life and SR life just like most SDs",
                    "author": "bookworm010101",
                    "id": "ifyyn55",
                    "parent_id": "t1_ifxzut4",
                    "score": 2,
                    "created_utc": 1657704571.0,
                    "replies": [
                        {
                            "body": "Of course",
                            "author": "Timely-Pen1449",
                            "id": "ifz0lhk",
                            "parent_id": "t1_ifyyn55",
                            "score": 1,
                            "created_utc": 1657706177.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yeah, he was probably in a little bit of shock.",
            "author": "Timely-Pen1449",
            "id": "ifxzy1v",
            "parent_id": "t1_ifxw09o",
            "score": 2,
            "created_utc": 1657680921.0,
            "replies": [
                {
                    "body": "yea man, im in my 30s..def too young to be feelin' this old and jaded about these modern women. our society is going to enter the terminal phase of decline in about 10~ years or so...just tryin to enjoy it while i can!",
                    "author": "vtec__",
                    "id": "ify04v1",
                    "parent_id": "t1_ifxzy1v",
                    "score": 1,
                    "created_utc": 1657681014.0,
                    "replies": [
                        {
                            "body": "There are some good SBs out there. You just need to be patient and weed out the scammers and immature ones.",
                            "author": "Timely-Pen1449",
                            "id": "ify0d48",
                            "parent_id": "t1_ify04v1",
                            "score": 1,
                            "created_utc": 1657681127.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Sorry to hear about your experience, but I’m sure you’re bouncing back just as I am.",
            "author": "Timely-Pen1449",
            "id": "ifz0utg",
            "parent_id": "t1_ifyjm6l",
            "score": 1,
            "created_utc": 1657706387.0,
            "replies": []
        },
        {
            "body": "Thanks. It wasn’t easy to let her go, but it’s clearly the right thing.",
            "author": "Timely-Pen1449",
            "id": "ig01afl",
            "parent_id": "t1_ifzx69n",
            "score": 2,
            "created_utc": 1657725215.0,
            "replies": []
        },
        {
            "body": "Thanks",
            "author": "Timely-Pen1449",
            "id": "ig2fwty",
            "parent_id": "t1_ig1hwh1",
            "score": 1,
            "created_utc": 1657760062.0,
            "replies": []
        },
        {
            "body": "I looked at it from a woman's angle and I think the issue is probably more the blow to the ego than body count.\n\n  \nIf I was vanilla dating (which I don't LOL) someone with a don't ask don't tell understanding and he told me that he is seeing another girl and $poiling her, it would be a huge blow to my ego and I would end things immediately.",
            "author": "LightOLove",
            "id": "ifuy8ls",
            "parent_id": "t1_ifulm65",
            "score": 7,
            "created_utc": 1657635435.0,
            "replies": [
                {
                    "body": "The ego is the biggest deal here. I agree it’s like someone came and took your place and you felt deprioritized. \n\nLike you were in first class but were now asked to go take a seat in economy. Sure you are still going to get your destination and ride the same plane, it is unfortunately a horrible feeling to be in that position.",
                    "author": null,
                    "id": "ifvuduk",
                    "parent_id": "t1_ifuy8ls",
                    "score": 7,
                    "created_utc": 1657648181.0,
                    "replies": []
                },
                {
                    "body": "I think it’s important to define the arrangement from the start so both parties are in agreement.",
                    "author": "Timely-Pen1449",
                    "id": "ifvfqyr",
                    "parent_id": "t1_ifuy8ls",
                    "score": 3,
                    "created_utc": 1657642418.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I never put restrictions on how she spent the money, but I felt very disrespected by the constant schedule changes.",
            "author": "Timely-Pen1449",
            "id": "ifvd9x1",
            "parent_id": "t1_ifuvli1",
            "score": 3,
            "created_utc": 1657641446.0,
            "replies": []
        },
        {
            "body": "Thanks. I wish her well and I am moving on.",
            "author": "Timely-Pen1449",
            "id": "ifvfxo3",
            "parent_id": "t1_ifujokg",
            "score": 2,
            "created_utc": 1657642493.0,
            "replies": []
        },
        {
            "body": "I agree.",
            "author": "Timely-Pen1449",
            "id": "ifvf0l7",
            "parent_id": "t1_ifumcfn",
            "score": 1,
            "created_utc": 1657642130.0,
            "replies": []
        },
        {
            "body": "It was uncharted waters for me…",
            "author": "Timely-Pen1449",
            "id": "ifvg4e6",
            "parent_id": "t1_ifvfv11",
            "score": 2,
            "created_utc": 1657642567.0,
            "replies": []
        },
        {
            "body": "I’m sorry that she couldn’t see that.",
            "author": "Timely-Pen1449",
            "id": "ifvfusy",
            "parent_id": "t1_ifuk5kp",
            "score": 1,
            "created_utc": 1657642460.0,
            "replies": []
        },
        {
            "body": "Self respecting your insecurity",
            "author": "sparky_SD16",
            "id": "ifuw4za",
            "parent_id": "t1_ifunbd5",
            "score": 7,
            "created_utc": 1657634525.0,
            "replies": [
                {
                    "body": "Haha thanks",
                    "author": "Resolve-Brilliant",
                    "id": "ifuw7kf",
                    "parent_id": "t1_ifuw4za",
                    "score": 0,
                    "created_utc": 1657634558.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I’m realistic about the SR. I can’t put up with constant scheduling issues though.",
            "author": "Timely-Pen1449",
            "id": "ifveyy3",
            "parent_id": "t1_ifunbd5",
            "score": 3,
            "created_utc": 1657642112.0,
            "replies": []
        },
        {
            "body": "Same here",
            "author": null,
            "id": "ifuo3fr",
            "parent_id": "t1_ifunbd5",
            "score": 3,
            "created_utc": 1657630851.0,
            "replies": []
        },
        {
            "body": "I’d call you ignorant if you think anyone isn’t fucking someone else unless you’ve talked about being exclusive.",
            "author": null,
            "id": "ifuo59x",
            "parent_id": "t1_ifunbd5",
            "score": 2,
            "created_utc": 1657630876.0,
            "replies": [
                {
                    "body": "Of course I talk about exclusivity on first date.",
                    "author": "Resolve-Brilliant",
                    "id": "ifus2qd",
                    "parent_id": "t1_ifuo59x",
                    "score": 4,
                    "created_utc": 1657632750.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "That was the primary reason.  A SR is a form of dating. A SD is a type of bf. I didn’t restrict her spending in any way. I even gave her extra money to buy gifts for her mother and father on holidays. Telling me she used some of the money I gave her to buy anything for the bf was just plain foolish. It’s extremely disrespectful. If you read most of the other comments, you will see the majority of the other SDs agree. I liked helping her. I was never interested in funding her relationship with someone else. She effectively ended the arrangement by shifting her priorities which caused me to shift mine. Let her bf or someone else fund her lifestyle.",
            "author": "Timely-Pen1449",
            "id": "ifxkar9",
            "parent_id": "t1_ifxhney",
            "score": 3,
            "created_utc": 1657673714.0,
            "replies": []
        },
        {
            "body": "It’s absolutely real. Are you not familiar with SRs?",
            "author": "Timely-Pen1449",
            "id": "ifx5xss",
            "parent_id": "t1_ifx5ste",
            "score": 3,
            "created_utc": 1657667290.0,
            "replies": [
                {
                    "body": "Well u can be my sugar daddy now then 😂",
                    "author": "Bubbles77_",
                    "id": "ifx62gn",
                    "parent_id": "t1_ifx5xss",
                    "score": -2,
                    "created_utc": 1657667347.0,
                    "replies": [
                        {
                            "body": "Here’s a suggestion if you’re serious. Get on a sugar dating site, make a profile and see who contacts you.",
                            "author": "Timely-Pen1449",
                            "id": "ifx739u",
                            "parent_id": "t1_ifx62gn",
                            "score": 2,
                            "created_utc": 1657667796.0,
                            "replies": [
                                {
                                    "body": "Where’s a website? I’ll totally do it lol I’m attractive for sure lol",
                                    "author": "Bubbles77_",
                                    "id": "ifx7a97",
                                    "parent_id": "t1_ifx739u",
                                    "score": -2,
                                    "created_utc": 1657667880.0,
                                    "replies": [
                                        {
                                            "body": "Maybe you can Google some sites",
                                            "author": "Timely-Pen1449",
                                            "id": "ifxby33",
                                            "parent_id": "t1_ifx7a97",
                                            "score": 2,
                                            "created_utc": 1657669920.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Man, are we the same person? Mine started dating someone in December, we kept it up into February, and then I think he went on vacation with her and everything ended immediately after.",
            "author": null,
            "id": "ifvmvfy",
            "parent_id": "t1_ifvlkhn",
            "score": 14,
            "created_utc": 1657645163.0,
            "replies": [
                {
                    "body": "It’s a common outcome and it hurts! Sucks to watch yourself not be selected for someone hotter, more popular or more “interesting”. It made me quit sugaring so I could focus on winning someone like her next time they come around. She was only seven years younger too. But at least this life showed me the kind of person I want to be with in a relationship and now I know what I’m looking for.",
                    "author": null,
                    "id": "ifvp90n",
                    "parent_id": "t1_ifvmvfy",
                    "score": 14,
                    "created_utc": 1657646095.0,
                    "replies": [
                        {
                            "body": "I speak for myself only, at some point I want someone long term. My SD has clearly stated he is not marriage minded. We both have admitted to having deeper feelings, so I would very much be open to long term if he felt otherwise, but that isn’t on the table. While I empathize that is sucks having someone chosen over you, in my case (and probably many other girls) it boils down to the reasons he chose an arrangement that will eventually be why I leave. My only suggestion, take with a grain of salt, is to recognize whether you are searching for long term and discuss whether that’s compatible with her life goals as well. 🤞🏻best of luck in finding what you seek",
                            "author": "sciencewasright",
                            "id": "ifwd7dj",
                            "parent_id": "t1_ifvp90n",
                            "score": 13,
                            "created_utc": 1657655615.0,
                            "replies": [
                                {
                                    "body": "My current SD is also not marriage-minded, but oddly enough wanting something long-term. It saddens me to think that I have to leave him after several years. But hey, that’s life. 🫤",
                                    "author": "JaneBarret",
                                    "id": "ifygrof",
                                    "parent_id": "t1_ifwd7dj",
                                    "score": 5,
                                    "created_utc": 1657690525.0,
                                    "replies": []
                                },
                                {
                                    "body": "Same situation here. I’m not even set on marriage necessarily, but I can’t even get him to sit down with me to even talk about the next year or two and if he still sees me in his life. He’s said he doesn’t want to stand in the way of me meeting anyone, but right now I’m unsure where I stand on marriage and kids and want to spend this part of my life traveling and growing with him.",
                                    "author": "blue_eyes18",
                                    "id": "ifz9wgd",
                                    "parent_id": "t1_ifwd7dj",
                                    "score": 1,
                                    "created_utc": 1657712600.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "I was intending on asking her to take the next step towards vanilla upon her return as it all seemed good up until the trip. Think she picked him more out of convenience without the messy transition from SGF to something more traditional. That’s what she was craving, almost had a restart between us the next month, and then another vanilla relationship for her really derailed everything. Remained good friends for six months and now she’s gone.",
                            "author": null,
                            "id": "ifvq0or",
                            "parent_id": "t1_ifvp90n",
                            "score": 6,
                            "created_utc": 1657646395.0,
                            "replies": []
                        },
                        {
                            "body": "For me, they usually go back to the \"Bad Boy\" types. And by \"Bad\" I mean, abusive, lazy, jobless or low paying job. Like, WTF???",
                            "author": "MrRetrdO",
                            "id": "ifyf1as",
                            "parent_id": "t1_ifvp90n",
                            "score": 2,
                            "created_utc": 1657689376.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "ifwam02",
            "parent_id": "t1_ifvdr3c",
            "score": 11,
            "created_utc": 1657654602.0,
            "replies": [
                {
                    "body": "That could have been her plan",
                    "author": "Timely-Pen1449",
                    "id": "ifwmceh",
                    "parent_id": "t1_ifwam02",
                    "score": 6,
                    "created_utc": 1657659167.0,
                    "replies": []
                },
                {
                    "body": "Exactly what I was thinking.\nAlthough I AM very surprised that she was actually up front about using her allowance to buy the dude a gift.😳\nThat was just stupid.🤦🏻‍♀️🤦🏻‍♀️🤦🏻‍♀️\nSorry, not sorry, I call it like I see it.\n\nThat allowance should've actually been put to a good resource, to HELP the SB, NOT some new dude.\n\nFrankly, if yall had a good relationship going, there's no way in hell that I'd be like...oh hey, guess what, I found a boy toy that I really started liking....and then make it so our arrangement was conflicted. \nEspecially since yalls relationship was first.🤨🤦🏻‍♀️🤦🏻‍♀️🤦🏻‍♀️\n\nOf COURSE you are going to end it, bc she isn't putting yall first anymore!!  (That just seems like such a dit da dee moment to me🤷🏻‍♀️🤦🏻‍♀️🙄)\n\nSeriously, I don't get the audacity sometimes.🤷🏻‍♀️🤷🏻‍♀️🤨\n\nShe was probably angry bc she felt like she was being honest and open with you about it, and in her mind it was OK, IF you said it was OK if she was discreet.\n\nBUT....THEN AGAIN, discreet IS NOT, telling your SD about what you bought your possible new boy toy, with the money that was meant to help your ass!🙄🙄🤦🏻‍♀️🤦🏻‍♀️",
                    "author": "JustAsk4Alice",
                    "id": "ifwi1ot",
                    "parent_id": "t1_ifwam02",
                    "score": 3,
                    "created_utc": 1657657503.0,
                    "replies": [
                        {
                            "body": "She really miscalculated, didn’t she? Lol",
                            "author": "Timely-Pen1449",
                            "id": "ifwmfd3",
                            "parent_id": "t1_ifwi1ot",
                            "score": 6,
                            "created_utc": 1657659199.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "don’t they say you can’t have your cake and eat it or something?",
            "author": "Jonconnerysd",
            "id": "ifvus6w",
            "parent_id": "t1_ifvdr3c",
            "score": 5,
            "created_utc": 1657648345.0,
            "replies": [
                {
                    "body": "Yes, that is the saying",
                    "author": "Timely-Pen1449",
                    "id": "ifwnpi3",
                    "parent_id": "t1_ifvus6w",
                    "score": 5,
                    "created_utc": 1657659690.0,
                    "replies": []
                },
                {
                    "body": "Yeah. You can’t have your cake and eat it too.",
                    "author": "JaneBarret",
                    "id": "ifyhhq1",
                    "parent_id": "t1_ifvus6w",
                    "score": 3,
                    "created_utc": 1657691020.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "She was probably the most conventionally attractive gal I've ever dated...Former Maxim model.\n\nBut to quote a former colleague, \"It doesn't matter how beautiful she is, there's some guy out there who's sick of her shit.\" 😂",
            "author": "SD-Casual-Fla",
            "id": "ifuzlxn",
            "parent_id": "t1_ifuya3e",
            "score": 14,
            "created_utc": 1657636006.0,
            "replies": [
                {
                    "body": "Why does it have to be negative? Be happy for her if you care about her.",
                    "author": "WhisperingPetals",
                    "id": "ifwzkoj",
                    "parent_id": "t1_ifuzlxn",
                    "score": 1,
                    "created_utc": 1657664590.0,
                    "replies": [
                        {
                            "body": "Please read my other comment on this thread.",
                            "author": "SD-Casual-Fla",
                            "id": "ifwzwbn",
                            "parent_id": "t1_ifwzkoj",
                            "score": 3,
                            "created_utc": 1657664727.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "ifv3ff0",
                    "parent_id": "t1_ifuzlxn",
                    "score": 1,
                    "created_utc": 1657637547.0,
                    "replies": [
                        {
                            "body": "I didn't. We were a month and a half, weekly arrangement. Felt like king for the day, when we were in South Beach a couple times. Sweet lady, I wish her nothing but the best.",
                            "author": "SD-Casual-Fla",
                            "id": "ifv6ibj",
                            "parent_id": "t1_ifv3ff0",
                            "score": 3,
                            "created_utc": 1657638761.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "this. idk whats up with these younger girls today..they literally pay for everything and they're in LOVE with these losers!!",
            "author": "vtec__",
            "id": "ifxw5nr",
            "parent_id": "t1_ifwpkld",
            "score": 4,
            "created_utc": 1657679120.0,
            "replies": [
                {
                    "body": "Too many Disney movies. \n\nI went on a weekend trip with a miserly ex [close to my age, who made decent money] while I was unemployed. I felt the need to be seen as an equal partner, so I put over a hundo on a credit card for food and drinks and such for us while there, with obviously no hope of paying it off anytime soon. That amount isn’t nearly as much of an issue now, but from that experience, I learned a very important lesson about partner worthiness and finding someone who will support me through a career transition, instead of just happily letting me pay because I feel like I *should* contribute in order to keep him when I’m in no place to do so. Thankfully, he ended things after that weekend trip. I haven’t made the same mistake since. \n\nAnyway, I blame it on Disney and the idea that he could have been “the one” that I was doing everything I could to keep. I feel sorry for early 2020 me who thought he was actually a worthy partner, but I’ve forgiven her because we’ve learned and grown a lot since then.",
                    "author": "blue_eyes18",
                    "id": "ifzbl3o",
                    "parent_id": "t1_ifxw5nr",
                    "score": 2,
                    "created_utc": 1657713583.0,
                    "replies": [
                        {
                            "body": "its been like this for along time, 10 years or so. i know alot of girls who date dustys",
                            "author": "vtec__",
                            "id": "ig14xiu",
                            "parent_id": "t1_ifzbl3o",
                            "score": 3,
                            "created_utc": 1657740536.0,
                            "replies": []
                        },
                        {
                            "body": "I see you may have posted a number which is most likely an amount in relations to an arrangement. If this is the case, you are violating Rule #4 - \"No dollar amounts that are in reference to allowance/PPM are allowed.\"\n\nIf you are curious about Allowances reported by SLF contributors please see the [Allowance Master Thread 2021-2022](/r/sugarlifestyleforum/comments/pc22tk/allowance_master_thread_20212022/).\n\nYour post will not be approved until you remove the amount.  Please read the sub [Rules](/r/sugarlifestyleforum/comments/748zta/updated_and_clarified_rules_for_slf/) prior to posting anything else. \n\nIf you simply posted a number not referencing a monetary amount, please message the MODs to approve your post.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/sugarlifestyleforum) if you have any questions or concerns.*",
                            "author": "AutoModerator",
                            "id": "ifzbl57",
                            "parent_id": "t1_ifzbl3o",
                            "score": 1,
                            "created_utc": 1657713584.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I agree. Except a lot of men are here complaining about what she spends her money on. They seem to still want full financial control even after they give their SB the money.",
            "author": "fakemoose",
            "id": "ifxi662",
            "parent_id": "t1_ifwrtxp",
            "score": 3,
            "created_utc": 1657672743.0,
            "replies": [
                {
                    "body": "Yes, but that's not OP nor is it the problem indicated in this relationship.\n\nYou can't make a point that all we need to do is accept their financial autonomy. Because the relationship would still be messed up even if everyone did that.\n\nThe core problem is that she started prioritising the sugar relationship much lower and cancelling meetings among other things. No matter what else is happening that people have different opinions on, this factor is the key one that is unacceptable across the board.",
                    "author": "YlangScent",
                    "id": "ifynexu",
                    "parent_id": "t1_ifxi662",
                    "score": 3,
                    "created_utc": 1657695369.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Agree completely with your thinking, plus you're being very gracious. What I 'm curious about is now that your support for her has ended, she will not be able to gift her boyfriend anymore. Wonder how that will affect their relationship . . .",
            "author": "Socrates59",
            "id": "ifyhdcr",
            "parent_id": "t1_ifvbpzh",
            "score": 2,
            "created_utc": 1657690936.0,
            "replies": [
                {
                    "body": "I suppose that is their problem",
                    "author": "Timely-Pen1449",
                    "id": "ifz0z2a",
                    "parent_id": "t1_ifyhdcr",
                    "score": 2,
                    "created_utc": 1657706478.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I guess she figured she had the SR “in the bank” so she has enough flex to go vanilla date with little awareness that she may not be able to handle the demands of multiple relationships and causing her SR to weaken and die.\n\n I feel sorry for her but I hope the vanilla lasts. They often don’t and then the lady ends up with a zero.",
            "author": null,
            "id": "ifvtyve",
            "parent_id": "t1_ifvfe8m",
            "score": 5,
            "created_utc": 1657647932.0,
            "replies": [
                {
                    "body": "I hope things work out for her. She’s both smart and beautiful and has a bright future. I just won’t be helping her achieve her goals anymore.",
                    "author": "Timely-Pen1449",
                    "id": "ifwo4ka",
                    "parent_id": "t1_ifvtyve",
                    "score": 3,
                    "created_utc": 1657659854.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "You must miss her though..did you look for another SB?",
            "author": "meleficent007",
            "id": "ifvg55u",
            "parent_id": "t1_ifvfz7u",
            "score": 3,
            "created_utc": 1657642575.0,
            "replies": [
                {
                    "body": "I’m searching now",
                    "author": "Timely-Pen1449",
                    "id": "ifviobu",
                    "parent_id": "t1_ifvg55u",
                    "score": 2,
                    "created_utc": 1657643547.0,
                    "replies": [
                        {
                            "body": "Nice...where are you located..",
                            "author": "meleficent007",
                            "id": "ifviwc4",
                            "parent_id": "t1_ifviobu",
                            "score": 3,
                            "created_utc": 1657643634.0,
                            "replies": [
                                {
                                    "body": "Florida",
                                    "author": "Timely-Pen1449",
                                    "id": "ifvjbrx",
                                    "parent_id": "t1_ifviwc4",
                                    "score": 2,
                                    "created_utc": 1657643797.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Oh wow that is pretty shitty of her. Block and move on brother. Let her find money elsewhere to support her loser BF.",
            "author": "fatsocalsd",
            "id": "ifx11zv",
            "parent_id": "t1_ifwn2lx",
            "score": 4,
            "created_utc": 1657665215.0,
            "replies": [
                {
                    "body": "I actually wish her well. Its a shame it had to go down this way",
                    "author": "Timely-Pen1449",
                    "id": "ifx5n6q",
                    "parent_id": "t1_ifx11zv",
                    "score": 2,
                    "created_utc": 1657667165.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "ifxcnwy",
            "parent_id": "t1_ifxc1ry",
            "score": 2,
            "created_utc": 1657670243.0,
            "replies": [
                {
                    "body": "I had a SB before this past one. We were together through her last two years of Med School. When she left the state for her fellowship, we ended things amicably. I think that’s how a SR should work.",
                    "author": "Timely-Pen1449",
                    "id": "ifxeqfk",
                    "parent_id": "t1_ifxcnwy",
                    "score": 3,
                    "created_utc": 1657671181.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Lmfao a gift or dinner sometimes is not even close to the same as supporting someone.",
            "author": "fakemoose",
            "id": "ifxiifn",
            "parent_id": "t1_ifuxqmk",
            "score": 1,
            "created_utc": 1657672899.0,
            "replies": [
                {
                    "body": "So if they are so content with their life that their BF or SO has provided why are they on SA.  You be their cuck ATM seems to work for you.",
                    "author": "DomDaddyNW",
                    "id": "ify6bqi",
                    "parent_id": "t1_ifxiifn",
                    "score": 0,
                    "created_utc": 1657684173.0,
                    "replies": [
                        {
                            "body": "You can’t seem to wrap your head around the concept that there doesn’t have to be someone in the role of “provider” in all relationships. It’s fascinating.",
                            "author": "fakemoose",
                            "id": "ig00ywn",
                            "parent_id": "t1_ify6bqi",
                            "score": 1,
                            "created_utc": 1657725087.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Feels too much like when the right say shit like \"I don't want my tax dollars going to abortions!!!!\" Like fuck off, the government spends on every conceivable issue and everyone pays for things they don't support or vote for. It's not disrespectful, it's her money. I stick to monogamous relationships, so the bf would end things for me too, but it wouldn't bother me if she spent money given to her on a bf.",
            "author": "whatever-tata",
            "id": "ifw8q9p",
            "parent_id": "t1_ifv400b",
            "score": 5,
            "created_utc": 1657653864.0,
            "replies": [
                {
                    "body": "What planet are you living on? I don't even support SBs who have boyfriends to boot, and you think I'd be ok giving her money knowingly?\n\nNo if I'm paying a girl to be my girlfriend, she can't have a boyfriend, I'm her boyfriend my friend. The disrespect is so enormous! I can't even believe it.",
                    "author": "sugardad123",
                    "id": "ifwd5dt",
                    "parent_id": "t1_ifw8q9p",
                    "score": -1,
                    "created_utc": 1657655594.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I used to feel that way, but my current SB and I went protected for 4 months, and I got used to them.  Thankfully, we developed enough trust to now go without...but I wouldn't hesitate to use them again.\n\n\\#olddognewtrick",
            "author": "sdphilly",
            "id": "ifv77sh",
            "parent_id": "t1_ifv4nb9",
            "score": 1,
            "created_utc": 1657639048.0,
            "replies": []
        },
        {
            "body": "Unless your condoms are old, that shouldn't happen.  Those things are stress tested by holding up to 2liters of liquid.  I just recently took a class at Frolicon and learned how to give a blowjob with a condom.  It was phenomenal.  Just as much drool with the flavored lubes as without, plus a few new technique.",
            "author": "Mostly_Always_Truly",
            "id": "ifvbr74",
            "parent_id": "t1_ifv4nb9",
            "score": 0,
            "created_utc": 1657640857.0,
            "replies": []
        },
        {
            "body": "Good deal. You'll find another one.",
            "author": "Automatic_Joke_4414",
            "id": "ifx0e1r",
            "parent_id": "t1_ifwzna6",
            "score": 4,
            "created_utc": 1657664934.0,
            "replies": []
        },
        {
            "body": "As long as it doesn't affect the SR .  . . that's what the issue is here.",
            "author": "Socrates59",
            "id": "ifyhn6e",
            "parent_id": "t1_ifx5qao",
            "score": 2,
            "created_utc": 1657691126.0,
            "replies": [
                {
                    "body": "This",
                    "author": "Blueexpression",
                    "id": "ifynb0m",
                    "parent_id": "t1_ifyhn6e",
                    "score": 1,
                    "created_utc": 1657695284.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "The entitlement is astounding . . .",
            "author": "Socrates59",
            "id": "ifyhjyc",
            "parent_id": "t1_ifwop98",
            "score": 2,
            "created_utc": 1657691063.0,
            "replies": [
                {
                    "body": "I’m still scratching my head over that",
                    "author": "Timely-Pen1449",
                    "id": "ifz0wjz",
                    "parent_id": "t1_ifyhjyc",
                    "score": 1,
                    "created_utc": 1657706424.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "sounds like your typical gen Z / millenial woman",
            "author": "vtec__",
            "id": "ifxxf5y",
            "parent_id": "t1_ifwop98",
            "score": 0,
            "created_utc": 1657679714.0,
            "replies": [
                {
                    "body": "Unfortunately…",
                    "author": "Timely-Pen1449",
                    "id": "ifxzznk",
                    "parent_id": "t1_ifxxf5y",
                    "score": 1,
                    "created_utc": 1657680942.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yeah. When this happened to me, she ended up unhappy because he didn’t support her lifestyle. Now it’s a sloppy mess.",
            "author": "ConstructionReal356",
            "id": "ifwnszm",
            "parent_id": "t1_ifwnj7c",
            "score": 1,
            "created_utc": 1657659729.0,
            "replies": [
                {
                    "body": "All relationships are tough and require work to maintain. She and I had a really good run.",
                    "author": "Timely-Pen1449",
                    "id": "ifwokbk",
                    "parent_id": "t1_ifwnszm",
                    "score": 1,
                    "created_utc": 1657660024.0,
                    "replies": [
                        {
                            "body": "I’m in a situation where I kept helping her out and now I’ve met her new boyfriend and he’s convinced I’m going to steal her away and live happily ever after and tis a bit stupid",
                            "author": "ConstructionReal356",
                            "id": "ifwotii",
                            "parent_id": "t1_ifwokbk",
                            "score": 1,
                            "created_utc": 1657660125.0,
                            "replies": [
                                {
                                    "body": "I don’t envy you. It’s gotta be a little awkward and weird",
                                    "author": "Timely-Pen1449",
                                    "id": "ifwp8al",
                                    "parent_id": "t1_ifwotii",
                                    "score": 1,
                                    "created_utc": 1657660292.0,
                                    "replies": [
                                        {
                                            "body": "It is. I mean the more he fixates on it, the more I’m tempted to swoop in and steal her tbh.",
                                            "author": "ConstructionReal356",
                                            "id": "ifwpfai",
                                            "parent_id": "t1_ifwp8al",
                                            "score": 1,
                                            "created_utc": 1657660372.0,
                                            "replies": [
                                                {
                                                    "body": "Wow. I checked her bfs social media and saw pics of them at an air B&B on the day she and I were supposed to be together. That sealed the deal.",
                                                    "author": "Timely-Pen1449",
                                                    "id": "ifwt327",
                                                    "parent_id": "t1_ifwpfai",
                                                    "score": 3,
                                                    "created_utc": 1657661846.0,
                                                    "replies": []
                                                },
                                                {
                                                    "body": "Where and when do you communicate with the bf? I’m curious now.",
                                                    "author": "Timely-Pen1449",
                                                    "id": "ifwrxjv",
                                                    "parent_id": "t1_ifwpfai",
                                                    "score": 1,
                                                    "created_utc": 1657661380.0,
                                                    "replies": [
                                                        {
                                                            "body": "Social media mostly. And occasionally in person lol. Only really chatted a few times with him. But I’ve read over her texts (not snooping) and he’s outright expressed to me that he thinks she likes me better.",
                                                            "author": "ConstructionReal356",
                                                            "id": "ifwsfs3",
                                                            "parent_id": "t1_ifwrxjv",
                                                            "score": 1,
                                                            "created_utc": 1657661586.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Of course. If any party breaks the arrangement, then that’s clear grounds to end it. Or, just end it because we are all adults and no one is tied to any of these arrangements. I think it’s strange that there is this sense of entitlement on both the SB and SD side. If you want true commitment from either side, then you need to engage and pursue a traditional relationship. Many SBs complain about SDs being too controlling when the obvious resolution is just to end it; but obviously the financial benefit keeps them there. Same with SDs.  SBs are plentiful, especially if you have the means to support them.",
            "author": "Quiet-Eggplant-6811",
            "id": "ifwzwx1",
            "parent_id": "t1_ifwne06",
            "score": 2,
            "created_utc": 1657664734.0,
            "replies": []
        },
        {
            "body": "She's probably a wonderful person; but under the literal sense - she was. Im just reminding you and the open forum the matter of fact. \n\nMore a word of warning than anything.",
            "author": "biggergorilla10",
            "id": "ifxmpb0",
            "parent_id": "t1_ifxea9c",
            "score": 2,
            "created_utc": 1657674810.0,
            "replies": [
                {
                    "body": "I appreciate it. Thanks.",
                    "author": "Timely-Pen1449",
                    "id": "ifxz7q1",
                    "parent_id": "t1_ifxmpb0",
                    "score": 1,
                    "created_utc": 1657680569.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Most SBs juggle real life and SR life just like most SDs",
            "author": "bookworm010101",
            "id": "ifyyn55",
            "parent_id": "t1_ifxzut4",
            "score": 2,
            "created_utc": 1657704571.0,
            "replies": [
                {
                    "body": "Of course",
                    "author": "Timely-Pen1449",
                    "id": "ifz0lhk",
                    "parent_id": "t1_ifyyn55",
                    "score": 1,
                    "created_utc": 1657706177.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "yea man, im in my 30s..def too young to be feelin' this old and jaded about these modern women. our society is going to enter the terminal phase of decline in about 10~ years or so...just tryin to enjoy it while i can!",
            "author": "vtec__",
            "id": "ify04v1",
            "parent_id": "t1_ifxzy1v",
            "score": 1,
            "created_utc": 1657681014.0,
            "replies": [
                {
                    "body": "There are some good SBs out there. You just need to be patient and weed out the scammers and immature ones.",
                    "author": "Timely-Pen1449",
                    "id": "ify0d48",
                    "parent_id": "t1_ify04v1",
                    "score": 1,
                    "created_utc": 1657681127.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "The ego is the biggest deal here. I agree it’s like someone came and took your place and you felt deprioritized. \n\nLike you were in first class but were now asked to go take a seat in economy. Sure you are still going to get your destination and ride the same plane, it is unfortunately a horrible feeling to be in that position.",
            "author": null,
            "id": "ifvuduk",
            "parent_id": "t1_ifuy8ls",
            "score": 7,
            "created_utc": 1657648181.0,
            "replies": []
        },
        {
            "body": "I think it’s important to define the arrangement from the start so both parties are in agreement.",
            "author": "Timely-Pen1449",
            "id": "ifvfqyr",
            "parent_id": "t1_ifuy8ls",
            "score": 3,
            "created_utc": 1657642418.0,
            "replies": []
        },
        {
            "body": "Haha thanks",
            "author": "Resolve-Brilliant",
            "id": "ifuw7kf",
            "parent_id": "t1_ifuw4za",
            "score": 0,
            "created_utc": 1657634558.0,
            "replies": []
        },
        {
            "body": "Of course I talk about exclusivity on first date.",
            "author": "Resolve-Brilliant",
            "id": "ifus2qd",
            "parent_id": "t1_ifuo59x",
            "score": 4,
            "created_utc": 1657632750.0,
            "replies": []
        },
        {
            "body": "Well u can be my sugar daddy now then 😂",
            "author": "Bubbles77_",
            "id": "ifx62gn",
            "parent_id": "t1_ifx5xss",
            "score": -2,
            "created_utc": 1657667347.0,
            "replies": [
                {
                    "body": "Here’s a suggestion if you’re serious. Get on a sugar dating site, make a profile and see who contacts you.",
                    "author": "Timely-Pen1449",
                    "id": "ifx739u",
                    "parent_id": "t1_ifx62gn",
                    "score": 2,
                    "created_utc": 1657667796.0,
                    "replies": [
                        {
                            "body": "Where’s a website? I’ll totally do it lol I’m attractive for sure lol",
                            "author": "Bubbles77_",
                            "id": "ifx7a97",
                            "parent_id": "t1_ifx739u",
                            "score": -2,
                            "created_utc": 1657667880.0,
                            "replies": [
                                {
                                    "body": "Maybe you can Google some sites",
                                    "author": "Timely-Pen1449",
                                    "id": "ifxby33",
                                    "parent_id": "t1_ifx7a97",
                                    "score": 2,
                                    "created_utc": 1657669920.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "It’s a common outcome and it hurts! Sucks to watch yourself not be selected for someone hotter, more popular or more “interesting”. It made me quit sugaring so I could focus on winning someone like her next time they come around. She was only seven years younger too. But at least this life showed me the kind of person I want to be with in a relationship and now I know what I’m looking for.",
            "author": null,
            "id": "ifvp90n",
            "parent_id": "t1_ifvmvfy",
            "score": 14,
            "created_utc": 1657646095.0,
            "replies": [
                {
                    "body": "I speak for myself only, at some point I want someone long term. My SD has clearly stated he is not marriage minded. We both have admitted to having deeper feelings, so I would very much be open to long term if he felt otherwise, but that isn’t on the table. While I empathize that is sucks having someone chosen over you, in my case (and probably many other girls) it boils down to the reasons he chose an arrangement that will eventually be why I leave. My only suggestion, take with a grain of salt, is to recognize whether you are searching for long term and discuss whether that’s compatible with her life goals as well. 🤞🏻best of luck in finding what you seek",
                    "author": "sciencewasright",
                    "id": "ifwd7dj",
                    "parent_id": "t1_ifvp90n",
                    "score": 13,
                    "created_utc": 1657655615.0,
                    "replies": [
                        {
                            "body": "My current SD is also not marriage-minded, but oddly enough wanting something long-term. It saddens me to think that I have to leave him after several years. But hey, that’s life. 🫤",
                            "author": "JaneBarret",
                            "id": "ifygrof",
                            "parent_id": "t1_ifwd7dj",
                            "score": 5,
                            "created_utc": 1657690525.0,
                            "replies": []
                        },
                        {
                            "body": "Same situation here. I’m not even set on marriage necessarily, but I can’t even get him to sit down with me to even talk about the next year or two and if he still sees me in his life. He’s said he doesn’t want to stand in the way of me meeting anyone, but right now I’m unsure where I stand on marriage and kids and want to spend this part of my life traveling and growing with him.",
                            "author": "blue_eyes18",
                            "id": "ifz9wgd",
                            "parent_id": "t1_ifwd7dj",
                            "score": 1,
                            "created_utc": 1657712600.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "I was intending on asking her to take the next step towards vanilla upon her return as it all seemed good up until the trip. Think she picked him more out of convenience without the messy transition from SGF to something more traditional. That’s what she was craving, almost had a restart between us the next month, and then another vanilla relationship for her really derailed everything. Remained good friends for six months and now she’s gone.",
                    "author": null,
                    "id": "ifvq0or",
                    "parent_id": "t1_ifvp90n",
                    "score": 6,
                    "created_utc": 1657646395.0,
                    "replies": []
                },
                {
                    "body": "For me, they usually go back to the \"Bad Boy\" types. And by \"Bad\" I mean, abusive, lazy, jobless or low paying job. Like, WTF???",
                    "author": "MrRetrdO",
                    "id": "ifyf1as",
                    "parent_id": "t1_ifvp90n",
                    "score": 2,
                    "created_utc": 1657689376.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "That could have been her plan",
            "author": "Timely-Pen1449",
            "id": "ifwmceh",
            "parent_id": "t1_ifwam02",
            "score": 6,
            "created_utc": 1657659167.0,
            "replies": []
        },
        {
            "body": "Exactly what I was thinking.\nAlthough I AM very surprised that she was actually up front about using her allowance to buy the dude a gift.😳\nThat was just stupid.🤦🏻‍♀️🤦🏻‍♀️🤦🏻‍♀️\nSorry, not sorry, I call it like I see it.\n\nThat allowance should've actually been put to a good resource, to HELP the SB, NOT some new dude.\n\nFrankly, if yall had a good relationship going, there's no way in hell that I'd be like...oh hey, guess what, I found a boy toy that I really started liking....and then make it so our arrangement was conflicted. \nEspecially since yalls relationship was first.🤨🤦🏻‍♀️🤦🏻‍♀️🤦🏻‍♀️\n\nOf COURSE you are going to end it, bc she isn't putting yall first anymore!!  (That just seems like such a dit da dee moment to me🤷🏻‍♀️🤦🏻‍♀️🙄)\n\nSeriously, I don't get the audacity sometimes.🤷🏻‍♀️🤷🏻‍♀️🤨\n\nShe was probably angry bc she felt like she was being honest and open with you about it, and in her mind it was OK, IF you said it was OK if she was discreet.\n\nBUT....THEN AGAIN, discreet IS NOT, telling your SD about what you bought your possible new boy toy, with the money that was meant to help your ass!🙄🙄🤦🏻‍♀️🤦🏻‍♀️",
            "author": "JustAsk4Alice",
            "id": "ifwi1ot",
            "parent_id": "t1_ifwam02",
            "score": 3,
            "created_utc": 1657657503.0,
            "replies": [
                {
                    "body": "She really miscalculated, didn’t she? Lol",
                    "author": "Timely-Pen1449",
                    "id": "ifwmfd3",
                    "parent_id": "t1_ifwi1ot",
                    "score": 6,
                    "created_utc": 1657659199.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yes, that is the saying",
            "author": "Timely-Pen1449",
            "id": "ifwnpi3",
            "parent_id": "t1_ifvus6w",
            "score": 5,
            "created_utc": 1657659690.0,
            "replies": []
        },
        {
            "body": "Yeah. You can’t have your cake and eat it too.",
            "author": "JaneBarret",
            "id": "ifyhhq1",
            "parent_id": "t1_ifvus6w",
            "score": 3,
            "created_utc": 1657691020.0,
            "replies": []
        },
        {
            "body": "Why does it have to be negative? Be happy for her if you care about her.",
            "author": "WhisperingPetals",
            "id": "ifwzkoj",
            "parent_id": "t1_ifuzlxn",
            "score": 1,
            "created_utc": 1657664590.0,
            "replies": [
                {
                    "body": "Please read my other comment on this thread.",
                    "author": "SD-Casual-Fla",
                    "id": "ifwzwbn",
                    "parent_id": "t1_ifwzkoj",
                    "score": 3,
                    "created_utc": 1657664727.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "ifv3ff0",
            "parent_id": "t1_ifuzlxn",
            "score": 1,
            "created_utc": 1657637547.0,
            "replies": [
                {
                    "body": "I didn't. We were a month and a half, weekly arrangement. Felt like king for the day, when we were in South Beach a couple times. Sweet lady, I wish her nothing but the best.",
                    "author": "SD-Casual-Fla",
                    "id": "ifv6ibj",
                    "parent_id": "t1_ifv3ff0",
                    "score": 3,
                    "created_utc": 1657638761.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Too many Disney movies. \n\nI went on a weekend trip with a miserly ex [close to my age, who made decent money] while I was unemployed. I felt the need to be seen as an equal partner, so I put over a hundo on a credit card for food and drinks and such for us while there, with obviously no hope of paying it off anytime soon. That amount isn’t nearly as much of an issue now, but from that experience, I learned a very important lesson about partner worthiness and finding someone who will support me through a career transition, instead of just happily letting me pay because I feel like I *should* contribute in order to keep him when I’m in no place to do so. Thankfully, he ended things after that weekend trip. I haven’t made the same mistake since. \n\nAnyway, I blame it on Disney and the idea that he could have been “the one” that I was doing everything I could to keep. I feel sorry for early 2020 me who thought he was actually a worthy partner, but I’ve forgiven her because we’ve learned and grown a lot since then.",
            "author": "blue_eyes18",
            "id": "ifzbl3o",
            "parent_id": "t1_ifxw5nr",
            "score": 2,
            "created_utc": 1657713583.0,
            "replies": [
                {
                    "body": "its been like this for along time, 10 years or so. i know alot of girls who date dustys",
                    "author": "vtec__",
                    "id": "ig14xiu",
                    "parent_id": "t1_ifzbl3o",
                    "score": 3,
                    "created_utc": 1657740536.0,
                    "replies": []
                },
                {
                    "body": "I see you may have posted a number which is most likely an amount in relations to an arrangement. If this is the case, you are violating Rule #4 - \"No dollar amounts that are in reference to allowance/PPM are allowed.\"\n\nIf you are curious about Allowances reported by SLF contributors please see the [Allowance Master Thread 2021-2022](/r/sugarlifestyleforum/comments/pc22tk/allowance_master_thread_20212022/).\n\nYour post will not be approved until you remove the amount.  Please read the sub [Rules](/r/sugarlifestyleforum/comments/748zta/updated_and_clarified_rules_for_slf/) prior to posting anything else. \n\nIf you simply posted a number not referencing a monetary amount, please message the MODs to approve your post.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/sugarlifestyleforum) if you have any questions or concerns.*",
                    "author": "AutoModerator",
                    "id": "ifzbl57",
                    "parent_id": "t1_ifzbl3o",
                    "score": 1,
                    "created_utc": 1657713584.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yes, but that's not OP nor is it the problem indicated in this relationship.\n\nYou can't make a point that all we need to do is accept their financial autonomy. Because the relationship would still be messed up even if everyone did that.\n\nThe core problem is that she started prioritising the sugar relationship much lower and cancelling meetings among other things. No matter what else is happening that people have different opinions on, this factor is the key one that is unacceptable across the board.",
            "author": "YlangScent",
            "id": "ifynexu",
            "parent_id": "t1_ifxi662",
            "score": 3,
            "created_utc": 1657695369.0,
            "replies": []
        },
        {
            "body": "I suppose that is their problem",
            "author": "Timely-Pen1449",
            "id": "ifz0z2a",
            "parent_id": "t1_ifyhdcr",
            "score": 2,
            "created_utc": 1657706478.0,
            "replies": []
        },
        {
            "body": "I hope things work out for her. She’s both smart and beautiful and has a bright future. I just won’t be helping her achieve her goals anymore.",
            "author": "Timely-Pen1449",
            "id": "ifwo4ka",
            "parent_id": "t1_ifvtyve",
            "score": 3,
            "created_utc": 1657659854.0,
            "replies": []
        },
        {
            "body": "I’m searching now",
            "author": "Timely-Pen1449",
            "id": "ifviobu",
            "parent_id": "t1_ifvg55u",
            "score": 2,
            "created_utc": 1657643547.0,
            "replies": [
                {
                    "body": "Nice...where are you located..",
                    "author": "meleficent007",
                    "id": "ifviwc4",
                    "parent_id": "t1_ifviobu",
                    "score": 3,
                    "created_utc": 1657643634.0,
                    "replies": [
                        {
                            "body": "Florida",
                            "author": "Timely-Pen1449",
                            "id": "ifvjbrx",
                            "parent_id": "t1_ifviwc4",
                            "score": 2,
                            "created_utc": 1657643797.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I actually wish her well. Its a shame it had to go down this way",
            "author": "Timely-Pen1449",
            "id": "ifx5n6q",
            "parent_id": "t1_ifx11zv",
            "score": 2,
            "created_utc": 1657667165.0,
            "replies": []
        },
        {
            "body": "I had a SB before this past one. We were together through her last two years of Med School. When she left the state for her fellowship, we ended things amicably. I think that’s how a SR should work.",
            "author": "Timely-Pen1449",
            "id": "ifxeqfk",
            "parent_id": "t1_ifxcnwy",
            "score": 3,
            "created_utc": 1657671181.0,
            "replies": []
        },
        {
            "body": "So if they are so content with their life that their BF or SO has provided why are they on SA.  You be their cuck ATM seems to work for you.",
            "author": "DomDaddyNW",
            "id": "ify6bqi",
            "parent_id": "t1_ifxiifn",
            "score": 0,
            "created_utc": 1657684173.0,
            "replies": [
                {
                    "body": "You can’t seem to wrap your head around the concept that there doesn’t have to be someone in the role of “provider” in all relationships. It’s fascinating.",
                    "author": "fakemoose",
                    "id": "ig00ywn",
                    "parent_id": "t1_ify6bqi",
                    "score": 1,
                    "created_utc": 1657725087.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "What planet are you living on? I don't even support SBs who have boyfriends to boot, and you think I'd be ok giving her money knowingly?\n\nNo if I'm paying a girl to be my girlfriend, she can't have a boyfriend, I'm her boyfriend my friend. The disrespect is so enormous! I can't even believe it.",
            "author": "sugardad123",
            "id": "ifwd5dt",
            "parent_id": "t1_ifw8q9p",
            "score": -1,
            "created_utc": 1657655594.0,
            "replies": []
        },
        {
            "body": "This",
            "author": "Blueexpression",
            "id": "ifynb0m",
            "parent_id": "t1_ifyhn6e",
            "score": 1,
            "created_utc": 1657695284.0,
            "replies": []
        },
        {
            "body": "I’m still scratching my head over that",
            "author": "Timely-Pen1449",
            "id": "ifz0wjz",
            "parent_id": "t1_ifyhjyc",
            "score": 1,
            "created_utc": 1657706424.0,
            "replies": []
        },
        {
            "body": "Unfortunately…",
            "author": "Timely-Pen1449",
            "id": "ifxzznk",
            "parent_id": "t1_ifxxf5y",
            "score": 1,
            "created_utc": 1657680942.0,
            "replies": []
        },
        {
            "body": "All relationships are tough and require work to maintain. She and I had a really good run.",
            "author": "Timely-Pen1449",
            "id": "ifwokbk",
            "parent_id": "t1_ifwnszm",
            "score": 1,
            "created_utc": 1657660024.0,
            "replies": [
                {
                    "body": "I’m in a situation where I kept helping her out and now I’ve met her new boyfriend and he’s convinced I’m going to steal her away and live happily ever after and tis a bit stupid",
                    "author": "ConstructionReal356",
                    "id": "ifwotii",
                    "parent_id": "t1_ifwokbk",
                    "score": 1,
                    "created_utc": 1657660125.0,
                    "replies": [
                        {
                            "body": "I don’t envy you. It’s gotta be a little awkward and weird",
                            "author": "Timely-Pen1449",
                            "id": "ifwp8al",
                            "parent_id": "t1_ifwotii",
                            "score": 1,
                            "created_utc": 1657660292.0,
                            "replies": [
                                {
                                    "body": "It is. I mean the more he fixates on it, the more I’m tempted to swoop in and steal her tbh.",
                                    "author": "ConstructionReal356",
                                    "id": "ifwpfai",
                                    "parent_id": "t1_ifwp8al",
                                    "score": 1,
                                    "created_utc": 1657660372.0,
                                    "replies": [
                                        {
                                            "body": "Wow. I checked her bfs social media and saw pics of them at an air B&B on the day she and I were supposed to be together. That sealed the deal.",
                                            "author": "Timely-Pen1449",
                                            "id": "ifwt327",
                                            "parent_id": "t1_ifwpfai",
                                            "score": 3,
                                            "created_utc": 1657661846.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "Where and when do you communicate with the bf? I’m curious now.",
                                            "author": "Timely-Pen1449",
                                            "id": "ifwrxjv",
                                            "parent_id": "t1_ifwpfai",
                                            "score": 1,
                                            "created_utc": 1657661380.0,
                                            "replies": [
                                                {
                                                    "body": "Social media mostly. And occasionally in person lol. Only really chatted a few times with him. But I’ve read over her texts (not snooping) and he’s outright expressed to me that he thinks she likes me better.",
                                                    "author": "ConstructionReal356",
                                                    "id": "ifwsfs3",
                                                    "parent_id": "t1_ifwrxjv",
                                                    "score": 1,
                                                    "created_utc": 1657661586.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I appreciate it. Thanks.",
            "author": "Timely-Pen1449",
            "id": "ifxz7q1",
            "parent_id": "t1_ifxmpb0",
            "score": 1,
            "created_utc": 1657680569.0,
            "replies": []
        },
        {
            "body": "Of course",
            "author": "Timely-Pen1449",
            "id": "ifz0lhk",
            "parent_id": "t1_ifyyn55",
            "score": 1,
            "created_utc": 1657706177.0,
            "replies": []
        },
        {
            "body": "There are some good SBs out there. You just need to be patient and weed out the scammers and immature ones.",
            "author": "Timely-Pen1449",
            "id": "ify0d48",
            "parent_id": "t1_ify04v1",
            "score": 1,
            "created_utc": 1657681127.0,
            "replies": []
        },
        {
            "body": "Here’s a suggestion if you’re serious. Get on a sugar dating site, make a profile and see who contacts you.",
            "author": "Timely-Pen1449",
            "id": "ifx739u",
            "parent_id": "t1_ifx62gn",
            "score": 2,
            "created_utc": 1657667796.0,
            "replies": [
                {
                    "body": "Where’s a website? I’ll totally do it lol I’m attractive for sure lol",
                    "author": "Bubbles77_",
                    "id": "ifx7a97",
                    "parent_id": "t1_ifx739u",
                    "score": -2,
                    "created_utc": 1657667880.0,
                    "replies": [
                        {
                            "body": "Maybe you can Google some sites",
                            "author": "Timely-Pen1449",
                            "id": "ifxby33",
                            "parent_id": "t1_ifx7a97",
                            "score": 2,
                            "created_utc": 1657669920.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I speak for myself only, at some point I want someone long term. My SD has clearly stated he is not marriage minded. We both have admitted to having deeper feelings, so I would very much be open to long term if he felt otherwise, but that isn’t on the table. While I empathize that is sucks having someone chosen over you, in my case (and probably many other girls) it boils down to the reasons he chose an arrangement that will eventually be why I leave. My only suggestion, take with a grain of salt, is to recognize whether you are searching for long term and discuss whether that’s compatible with her life goals as well. 🤞🏻best of luck in finding what you seek",
            "author": "sciencewasright",
            "id": "ifwd7dj",
            "parent_id": "t1_ifvp90n",
            "score": 13,
            "created_utc": 1657655615.0,
            "replies": [
                {
                    "body": "My current SD is also not marriage-minded, but oddly enough wanting something long-term. It saddens me to think that I have to leave him after several years. But hey, that’s life. 🫤",
                    "author": "JaneBarret",
                    "id": "ifygrof",
                    "parent_id": "t1_ifwd7dj",
                    "score": 5,
                    "created_utc": 1657690525.0,
                    "replies": []
                },
                {
                    "body": "Same situation here. I’m not even set on marriage necessarily, but I can’t even get him to sit down with me to even talk about the next year or two and if he still sees me in his life. He’s said he doesn’t want to stand in the way of me meeting anyone, but right now I’m unsure where I stand on marriage and kids and want to spend this part of my life traveling and growing with him.",
                    "author": "blue_eyes18",
                    "id": "ifz9wgd",
                    "parent_id": "t1_ifwd7dj",
                    "score": 1,
                    "created_utc": 1657712600.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I was intending on asking her to take the next step towards vanilla upon her return as it all seemed good up until the trip. Think she picked him more out of convenience without the messy transition from SGF to something more traditional. That’s what she was craving, almost had a restart between us the next month, and then another vanilla relationship for her really derailed everything. Remained good friends for six months and now she’s gone.",
            "author": null,
            "id": "ifvq0or",
            "parent_id": "t1_ifvp90n",
            "score": 6,
            "created_utc": 1657646395.0,
            "replies": []
        },
        {
            "body": "For me, they usually go back to the \"Bad Boy\" types. And by \"Bad\" I mean, abusive, lazy, jobless or low paying job. Like, WTF???",
            "author": "MrRetrdO",
            "id": "ifyf1as",
            "parent_id": "t1_ifvp90n",
            "score": 2,
            "created_utc": 1657689376.0,
            "replies": []
        },
        {
            "body": "She really miscalculated, didn’t she? Lol",
            "author": "Timely-Pen1449",
            "id": "ifwmfd3",
            "parent_id": "t1_ifwi1ot",
            "score": 6,
            "created_utc": 1657659199.0,
            "replies": []
        },
        {
            "body": "Please read my other comment on this thread.",
            "author": "SD-Casual-Fla",
            "id": "ifwzwbn",
            "parent_id": "t1_ifwzkoj",
            "score": 3,
            "created_utc": 1657664727.0,
            "replies": []
        },
        {
            "body": "I didn't. We were a month and a half, weekly arrangement. Felt like king for the day, when we were in South Beach a couple times. Sweet lady, I wish her nothing but the best.",
            "author": "SD-Casual-Fla",
            "id": "ifv6ibj",
            "parent_id": "t1_ifv3ff0",
            "score": 3,
            "created_utc": 1657638761.0,
            "replies": []
        },
        {
            "body": "its been like this for along time, 10 years or so. i know alot of girls who date dustys",
            "author": "vtec__",
            "id": "ig14xiu",
            "parent_id": "t1_ifzbl3o",
            "score": 3,
            "created_utc": 1657740536.0,
            "replies": []
        },
        {
            "body": "I see you may have posted a number which is most likely an amount in relations to an arrangement. If this is the case, you are violating Rule #4 - \"No dollar amounts that are in reference to allowance/PPM are allowed.\"\n\nIf you are curious about Allowances reported by SLF contributors please see the [Allowance Master Thread 2021-2022](/r/sugarlifestyleforum/comments/pc22tk/allowance_master_thread_20212022/).\n\nYour post will not be approved until you remove the amount.  Please read the sub [Rules](/r/sugarlifestyleforum/comments/748zta/updated_and_clarified_rules_for_slf/) prior to posting anything else. \n\nIf you simply posted a number not referencing a monetary amount, please message the MODs to approve your post.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/sugarlifestyleforum) if you have any questions or concerns.*",
            "author": "AutoModerator",
            "id": "ifzbl57",
            "parent_id": "t1_ifzbl3o",
            "score": 1,
            "created_utc": 1657713584.0,
            "replies": []
        },
        {
            "body": "Nice...where are you located..",
            "author": "meleficent007",
            "id": "ifviwc4",
            "parent_id": "t1_ifviobu",
            "score": 3,
            "created_utc": 1657643634.0,
            "replies": [
                {
                    "body": "Florida",
                    "author": "Timely-Pen1449",
                    "id": "ifvjbrx",
                    "parent_id": "t1_ifviwc4",
                    "score": 2,
                    "created_utc": 1657643797.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "You can’t seem to wrap your head around the concept that there doesn’t have to be someone in the role of “provider” in all relationships. It’s fascinating.",
            "author": "fakemoose",
            "id": "ig00ywn",
            "parent_id": "t1_ify6bqi",
            "score": 1,
            "created_utc": 1657725087.0,
            "replies": []
        },
        {
            "body": "I’m in a situation where I kept helping her out and now I’ve met her new boyfriend and he’s convinced I’m going to steal her away and live happily ever after and tis a bit stupid",
            "author": "ConstructionReal356",
            "id": "ifwotii",
            "parent_id": "t1_ifwokbk",
            "score": 1,
            "created_utc": 1657660125.0,
            "replies": [
                {
                    "body": "I don’t envy you. It’s gotta be a little awkward and weird",
                    "author": "Timely-Pen1449",
                    "id": "ifwp8al",
                    "parent_id": "t1_ifwotii",
                    "score": 1,
                    "created_utc": 1657660292.0,
                    "replies": [
                        {
                            "body": "It is. I mean the more he fixates on it, the more I’m tempted to swoop in and steal her tbh.",
                            "author": "ConstructionReal356",
                            "id": "ifwpfai",
                            "parent_id": "t1_ifwp8al",
                            "score": 1,
                            "created_utc": 1657660372.0,
                            "replies": [
                                {
                                    "body": "Wow. I checked her bfs social media and saw pics of them at an air B&B on the day she and I were supposed to be together. That sealed the deal.",
                                    "author": "Timely-Pen1449",
                                    "id": "ifwt327",
                                    "parent_id": "t1_ifwpfai",
                                    "score": 3,
                                    "created_utc": 1657661846.0,
                                    "replies": []
                                },
                                {
                                    "body": "Where and when do you communicate with the bf? I’m curious now.",
                                    "author": "Timely-Pen1449",
                                    "id": "ifwrxjv",
                                    "parent_id": "t1_ifwpfai",
                                    "score": 1,
                                    "created_utc": 1657661380.0,
                                    "replies": [
                                        {
                                            "body": "Social media mostly. And occasionally in person lol. Only really chatted a few times with him. But I’ve read over her texts (not snooping) and he’s outright expressed to me that he thinks she likes me better.",
                                            "author": "ConstructionReal356",
                                            "id": "ifwsfs3",
                                            "parent_id": "t1_ifwrxjv",
                                            "score": 1,
                                            "created_utc": 1657661586.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Where’s a website? I’ll totally do it lol I’m attractive for sure lol",
            "author": "Bubbles77_",
            "id": "ifx7a97",
            "parent_id": "t1_ifx739u",
            "score": -2,
            "created_utc": 1657667880.0,
            "replies": [
                {
                    "body": "Maybe you can Google some sites",
                    "author": "Timely-Pen1449",
                    "id": "ifxby33",
                    "parent_id": "t1_ifx7a97",
                    "score": 2,
                    "created_utc": 1657669920.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "My current SD is also not marriage-minded, but oddly enough wanting something long-term. It saddens me to think that I have to leave him after several years. But hey, that’s life. 🫤",
            "author": "JaneBarret",
            "id": "ifygrof",
            "parent_id": "t1_ifwd7dj",
            "score": 5,
            "created_utc": 1657690525.0,
            "replies": []
        },
        {
            "body": "Same situation here. I’m not even set on marriage necessarily, but I can’t even get him to sit down with me to even talk about the next year or two and if he still sees me in his life. He’s said he doesn’t want to stand in the way of me meeting anyone, but right now I’m unsure where I stand on marriage and kids and want to spend this part of my life traveling and growing with him.",
            "author": "blue_eyes18",
            "id": "ifz9wgd",
            "parent_id": "t1_ifwd7dj",
            "score": 1,
            "created_utc": 1657712600.0,
            "replies": []
        },
        {
            "body": "Florida",
            "author": "Timely-Pen1449",
            "id": "ifvjbrx",
            "parent_id": "t1_ifviwc4",
            "score": 2,
            "created_utc": 1657643797.0,
            "replies": []
        },
        {
            "body": "I don’t envy you. It’s gotta be a little awkward and weird",
            "author": "Timely-Pen1449",
            "id": "ifwp8al",
            "parent_id": "t1_ifwotii",
            "score": 1,
            "created_utc": 1657660292.0,
            "replies": [
                {
                    "body": "It is. I mean the more he fixates on it, the more I’m tempted to swoop in and steal her tbh.",
                    "author": "ConstructionReal356",
                    "id": "ifwpfai",
                    "parent_id": "t1_ifwp8al",
                    "score": 1,
                    "created_utc": 1657660372.0,
                    "replies": [
                        {
                            "body": "Wow. I checked her bfs social media and saw pics of them at an air B&B on the day she and I were supposed to be together. That sealed the deal.",
                            "author": "Timely-Pen1449",
                            "id": "ifwt327",
                            "parent_id": "t1_ifwpfai",
                            "score": 3,
                            "created_utc": 1657661846.0,
                            "replies": []
                        },
                        {
                            "body": "Where and when do you communicate with the bf? I’m curious now.",
                            "author": "Timely-Pen1449",
                            "id": "ifwrxjv",
                            "parent_id": "t1_ifwpfai",
                            "score": 1,
                            "created_utc": 1657661380.0,
                            "replies": [
                                {
                                    "body": "Social media mostly. And occasionally in person lol. Only really chatted a few times with him. But I’ve read over her texts (not snooping) and he’s outright expressed to me that he thinks she likes me better.",
                                    "author": "ConstructionReal356",
                                    "id": "ifwsfs3",
                                    "parent_id": "t1_ifwrxjv",
                                    "score": 1,
                                    "created_utc": 1657661586.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Maybe you can Google some sites",
            "author": "Timely-Pen1449",
            "id": "ifxby33",
            "parent_id": "t1_ifx7a97",
            "score": 2,
            "created_utc": 1657669920.0,
            "replies": []
        },
        {
            "body": "It is. I mean the more he fixates on it, the more I’m tempted to swoop in and steal her tbh.",
            "author": "ConstructionReal356",
            "id": "ifwpfai",
            "parent_id": "t1_ifwp8al",
            "score": 1,
            "created_utc": 1657660372.0,
            "replies": [
                {
                    "body": "Wow. I checked her bfs social media and saw pics of them at an air B&B on the day she and I were supposed to be together. That sealed the deal.",
                    "author": "Timely-Pen1449",
                    "id": "ifwt327",
                    "parent_id": "t1_ifwpfai",
                    "score": 3,
                    "created_utc": 1657661846.0,
                    "replies": []
                },
                {
                    "body": "Where and when do you communicate with the bf? I’m curious now.",
                    "author": "Timely-Pen1449",
                    "id": "ifwrxjv",
                    "parent_id": "t1_ifwpfai",
                    "score": 1,
                    "created_utc": 1657661380.0,
                    "replies": [
                        {
                            "body": "Social media mostly. And occasionally in person lol. Only really chatted a few times with him. But I’ve read over her texts (not snooping) and he’s outright expressed to me that he thinks she likes me better.",
                            "author": "ConstructionReal356",
                            "id": "ifwsfs3",
                            "parent_id": "t1_ifwrxjv",
                            "score": 1,
                            "created_utc": 1657661586.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Wow. I checked her bfs social media and saw pics of them at an air B&B on the day she and I were supposed to be together. That sealed the deal.",
            "author": "Timely-Pen1449",
            "id": "ifwt327",
            "parent_id": "t1_ifwpfai",
            "score": 3,
            "created_utc": 1657661846.0,
            "replies": []
        },
        {
            "body": "Where and when do you communicate with the bf? I’m curious now.",
            "author": "Timely-Pen1449",
            "id": "ifwrxjv",
            "parent_id": "t1_ifwpfai",
            "score": 1,
            "created_utc": 1657661380.0,
            "replies": [
                {
                    "body": "Social media mostly. And occasionally in person lol. Only really chatted a few times with him. But I’ve read over her texts (not snooping) and he’s outright expressed to me that he thinks she likes me better.",
                    "author": "ConstructionReal356",
                    "id": "ifwsfs3",
                    "parent_id": "t1_ifwrxjv",
                    "score": 1,
                    "created_utc": 1657661586.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Social media mostly. And occasionally in person lol. Only really chatted a few times with him. But I’ve read over her texts (not snooping) and he’s outright expressed to me that he thinks she likes me better.",
            "author": "ConstructionReal356",
            "id": "ifwsfs3",
            "parent_id": "t1_ifwrxjv",
            "score": 1,
            "created_utc": 1657661586.0,
            "replies": []
        }
    ]
}