{
    "title": "Rant: What’s the point?!",
    "post_id": "gzye4o",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/gzye4o/rant_whats_the_point/",
    "author": "cantakeajoke",
    "body": "So I’m genuinely curious. \n\nMore than a few times, I’ve started to chat with a guy on SA. Conversation is flowing and we seem to want the same thing. Then all of a sudden, he’ll say “well I do love to takes girls to concerts and pick up the tab for our dates, but I will never pay someone for their company”. WHICH WOULD BE TOTALLY FINE ON ANY OTHER WEBSITE. However, these dudes are paying $90 per month on SA to essentially find a vanilla girlfriend. What’s the appeal in this?",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/gzye4o/rant_whats_the_point/",
    "score": 99,
    "upvote_ratio": 0.93,
    "created_utc": 1591743239.0,
    "num_comments": 78,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "Yup I've gotten this. Tried to guilt trip me when I asked what amount he'd offer (he wanted me to give a #) because \"you're the one who wants an allowance. If it was up to me I'd date you normally because you seem cool.\"\n\n\nLike no shit, but we didnt meet normally",
            "author": "SweetieBby",
            "id": "ftj1snc",
            "parent_id": "t3_gzye4o",
            "score": 61,
            "created_utc": 1591744486.0,
            "replies": [
                {
                    "body": "😂",
                    "author": "cantakeajoke",
                    "id": "ftj2amz",
                    "parent_id": "t1_ftj1snc",
                    "score": 13,
                    "created_utc": 1591744761.0,
                    "replies": [
                        {
                            "body": "Right! Like I had a guy who met with me and even talked about providing a allowance on his original message then when I said hey are you giving me a allowance he was like if that's what you want. Like I should not have to beg to be paid. When men go to work their manager wouldn't say that when they ask for their pay check do why do it to us.",
                            "author": "TwitchyArtist",
                            "id": "ftj5xsy",
                            "parent_id": "t1_ftj2amz",
                            "score": 19,
                            "created_utc": 1591746768.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Curious because I've seen this sentiment a few times, is there something wrong with SB giving a number first in your opinion? \n\nI look at it the same was as your hypothetical guy and it is not about guilt tripping anyone at least for me. Giving someone an allowance/PPM does nothing *for me* in and of itself. Its something for the SB in the relationship that I can provide and I'm happy to provide it. In most cases I'd be equally or more happy to vanilla date the girl (goes without saying) but I understand that isn't what most on SA are looking for. I'm ready and willing and expect to provide an allowance/PPM. Is it not fair to ask \"what do you want out of the relationship?\" in the form of financial support? The answers varies the same way people are looking for different frequency of dates or levels of emotional connection. As an SD I do kind of need to know what you're looking for.",
                    "author": "canavatar12",
                    "id": "ftlbubs",
                    "parent_id": "t1_ftj1snc",
                    "score": 6,
                    "created_utc": 1591801797.0,
                    "replies": [
                        {
                            "body": "To me, the SD is usually the more mature one and the one guiding the relationship, so I would defer to him to take the lead.\n\n\nAlso, I feel like if an SD asked a question about intimacy, and how the SB would like to proceed / what they're comfortable with, it would be equally as shitty for her to respond with \"well YOU'RE the one who wants to have sex. If it was up to me I would just receive an allowance and not engage in intimacy\"",
                            "author": "SweetieBby",
                            "id": "ftm6qnk",
                            "parent_id": "t1_ftlbubs",
                            "score": 5,
                            "created_utc": 1591817208.0,
                            "replies": [
                                {
                                    "body": "Thats fair and I understand where you're coming from. No question there is a better way to communicate it. It would be better for an SD to say \"I'm open to anything from a vanilla relationship to direct financial support depending on what you are looking for and the connection when we meet. What are you looking for?\" and also fair for an SB to say to the intimacy question \"I'm open to anything from platonic friendship to a romantic relationship depending on what you are looking for and the connection when we meet. What are you looking for?\" \n\nThe difference is the money is a one way street. It needs to be figured out ahead of time. Sometimes, that means the onus is on the SB to ask for what she wants, if the SD is open to different types of things. The intimacy and romantic/emotional connection *should* be a two way street and you can let that play itself out naturally once you both confirm you are open and interested in an intimate relationship. I don't want a laundry list of what my SB is comfortable doing sexually before a first date, that would be weird, all I want to know is whether she is open to and looking for a full relationship.",
                                    "author": "canavatar12",
                                    "id": "ftn2txe",
                                    "parent_id": "t1_ftm6qnk",
                                    "score": 2,
                                    "created_utc": 1591832974.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Pretty simple...they're not real SD's. They're probably men of modest means that are hoping to capitalize on the naivete or desperation of many of the young ladies that inhabit SA. Their end goal is to get laid with as little effort and money expended as possible.",
            "author": "chippyboy11254",
            "id": "ftj02rk",
            "parent_id": "t3_gzye4o",
            "score": 53,
            "created_utc": 1591743562.0,
            "replies": [
                {
                    "body": "But to pay $90 per month is counterintuitive if you really wanted to spend as little as possible 🤔",
                    "author": "cantakeajoke",
                    "id": "ftj0mif",
                    "parent_id": "t1_ftj02rk",
                    "score": 17,
                    "created_utc": 1591743853.0,
                    "replies": [
                        {
                            "body": "I think there are also a lot of Pick Up Artists and Red Pill guys that like the challenge of trying to \"score for free\" on a Sugar site where most girls are looking for an allowance.  It is a way of demonstrating their prowess to show that they can get the girl without paying an allowance.  You will sometimes see them bragging about their success in online forums.",
                            "author": "willfromvb",
                            "id": "ftl2f67",
                            "parent_id": "t1_ftj0mif",
                            "score": 11,
                            "created_utc": 1591796779.0,
                            "replies": []
                        },
                        {
                            "body": "Not really. There’s women on Seeking that do not want allowance. So paying $90 access gets you fishing in a well stocked pond so to speak. On Tinder, you have lots of competition as a man but on Seeking your odds of meeting someone are much better even without an allowance because some women use SA for Vanilla or they just want a guy with money that can pay for experiences",
                            "author": "ruphun",
                            "id": "ftj2b55",
                            "parent_id": "t1_ftj0mif",
                            "score": 15,
                            "created_utc": 1591744769.0,
                            "replies": [
                                {
                                    "body": "\\^ This. \n\nThere are a number of college girls and 20-somethings for whom being with a guy who simply has a steady job and isn't sitting around all day playing video games (their same age peers) is a pleasant escape. Like it or not, there is  percentage of women on sites like SA for whom\" being taken to concerts and having the dinner tab for our dates picked up\" is a welcome change from the losers who can't even buy her a slice of pizza on a Friday night. \"Hey, man. Can you cover tonight?\" Not gonna claim it is a large percentage, but it is out there in the bowl.",
                                    "author": "BinghamtonSD",
                                    "id": "ftj7pah",
                                    "parent_id": "t1_ftj2b55",
                                    "score": 19,
                                    "created_utc": 1591747740.0,
                                    "replies": [
                                        {
                                            "body": "DEFINITELY.... this is why I went looking for an older man to have as an FWB and occasionally take me to dinner. I paid for all my college boyfriends everything and I just wanted a guy who could take care of himself, fuck me, and buy me dinner once in a while.",
                                            "author": null,
                                            "id": "ftlcmkh",
                                            "parent_id": "t1_ftj7pah",
                                            "score": 2,
                                            "created_utc": 1591802388.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "yes it is. Ive also come across later 20's women that want the spoiled GF route. Someone that takes them places, pays for their hair, nails, spa, and occasional shopping trips. Ive even met a mid 20's women that just wanted a FWB and didn't even want to go anywhere. It's definitely not a large percentage.. probably 5% at most, but you will come across it, and if you're the type of SD that doesnt talk arrangement details until after meeting, you just might meet someone that isnt looking an actual arrangement or allowance. I also feel that women sometimes go into a meet and greet, and will call an audible, based on how you look, and the connection you have, an may change what they're open to.",
                                            "author": "ruphun",
                                            "id": "ftjjm0p",
                                            "parent_id": "t1_ftj7pah",
                                            "score": -3,
                                            "created_utc": 1591754647.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "> spend as little as possible\n\nThere's a big difference between $90 and $WXYZ monthly",
                            "author": "GSSD",
                            "id": "ftla9se",
                            "parent_id": "t1_ftj0mif",
                            "score": 2,
                            "created_utc": 1591800882.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "They're buying a good female response rate for their $90. Now I'm an SD and have been for 10 years. If I post my pic and vanilla profile on Tinder, Okc or the like , I get crickets. I post my pic & SD profile on SA and I get lots of responses that say...(insert fake Asian accent) \"Oh, you a hansom man!\" 😉",
                    "author": "chippyboy11254",
                    "id": "ftj1edu",
                    "parent_id": "t1_ftj02rk",
                    "score": -8,
                    "created_utc": 1591744274.0,
                    "replies": [
                        {
                            "body": "Love to see the completely unnecessary anti-Asian racism here... gross",
                            "author": null,
                            "id": "ftkst5d",
                            "parent_id": "t1_ftj1edu",
                            "score": 8,
                            "created_utc": 1591790737.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": ">Pretty simple...they're not real SD's. \n\nI wouldnt say that applies to everyone that does that. \n\n&#x200B;\n\n>They're probably men of modest means that are hoping to capitalize on the naivete or desperation of many of the young ladies that inhabit SA. \n\nNo need to pray on desperate women. Ive had women that have their own money, that don't want or need an allowance.  \n\n\n>Their end goal is to get laid with as little effort and money expended as possible.\n\nWhat man doesnt have an end goal of getting laid easily?",
                    "author": "ruphun",
                    "id": "ftjlah3",
                    "parent_id": "t1_ftj02rk",
                    "score": -4,
                    "created_utc": 1591755646.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "If you think that’s bad, think about how you would feel paying $90 per month when 90% of the women you chat with are looking for virtual/platonic or selling feet pics 😂",
            "author": "8x-leverage",
            "id": "ftj04fy",
            "parent_id": "t3_gzye4o",
            "score": 83,
            "created_utc": 1591743587.0,
            "replies": [
                {
                    "body": "Yep. SA can make you feel jaded searching for a real person and connection. The $90 would seem like wasting money for prudent business men.",
                    "author": "BeautyGr8ce",
                    "id": "ftj779a",
                    "parent_id": "t1_ftj04fy",
                    "score": 12,
                    "created_utc": 1591747472.0,
                    "replies": []
                },
                {
                    "body": "This.  Total time waste.",
                    "author": "LotBuilder",
                    "id": "ftjwp1h",
                    "parent_id": "t1_ftj04fy",
                    "score": 8,
                    "created_utc": 1591762705.0,
                    "replies": []
                },
                {
                    "body": "1000% this!",
                    "author": "ruphun",
                    "id": "ftj1yy0",
                    "parent_id": "t1_ftj04fy",
                    "score": 13,
                    "created_utc": 1591744582.0,
                    "replies": []
                },
                {
                    "body": "Stop doing it then.",
                    "author": "adool999",
                    "id": "ftj9fv9",
                    "parent_id": "t1_ftj04fy",
                    "score": -1,
                    "created_utc": 1591748738.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "They want to think they have a chance with hot women lol I feel you though, drives me mad!!",
            "author": null,
            "id": "ftizn6i",
            "parent_id": "t3_gzye4o",
            "score": 17,
            "created_utc": 1591743333.0,
            "replies": [
                {
                    "body": "Drives me nuts. I would assume that once the guy says that, most if not all women would be like “thanks, but no thanks.”",
                    "author": "cantakeajoke",
                    "id": "ftj05pf",
                    "parent_id": "t1_ftizn6i",
                    "score": 6,
                    "created_utc": 1591743605.0,
                    "replies": [
                        {
                            "body": "Most not all. All you have to do is talk to 100 women on SA and you will find at least one that is ok with that.",
                            "author": "ruphun",
                            "id": "ftj2fxy",
                            "parent_id": "t1_ftj05pf",
                            "score": 0,
                            "created_utc": 1591744842.0,
                            "replies": [
                                {
                                    "body": "My former SB even told me that she would have slept with me for free if I hadn't offered to pay her a PPM. She told me this weeks after our first intimate date. At the time I was even getting that vibe - she didn't want to talk about money until I kind of insisted to pay her the morning AFTER we slept together for the first time.\n\nI feel like alot of newbie women on SA come from a vanilla dating background and if they meet a guy they would conceivably vanilla date, they'll be fine with not being paid a PPM for the date as long as the guy pays for everything else, if they're attracted enough to the POT SD. At least, that's the vibe I got from her and I'm sure there were plenty of others like that. To get this \"deal\" it probably helps to be under 40 though.",
                                    "author": "mrjimmyjsz",
                                    "id": "ftn9rt0",
                                    "parent_id": "t1_ftj2fxy",
                                    "score": 3,
                                    "created_utc": 1591836729.0,
                                    "replies": [
                                        {
                                            "body": "I’ve experienced that too. Definitely not under 40 though, closer to 50.  My previous SB wouldn’t even accept any money the first time we slept together.  In the first couple weeks she would only let me pay for things. We had very organic chemistry right from the meet and greet, so nothing was forced or negotiated . Intimacy happened very organically",
                                            "author": "ruphun",
                                            "id": "ftnbf3r",
                                            "parent_id": "t1_ftn9rt0",
                                            "score": 2,
                                            "created_utc": 1591837648.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "I'm talking to *2* women right now that do not want direct financial assistance as part of our dating.\n\nwhile this sounds great, in principle, it has also meant they have little urgency to schedule dates, and one has cancelled twice on short notice and the other has no call, no showed.\n\ngiving each a second chance, but I'm not getting my hopes up that either will turn into anything steady.",
                                    "author": "joc13",
                                    "id": "ftmb9ak",
                                    "parent_id": "t1_ftj2fxy",
                                    "score": 2,
                                    "created_utc": 1591819343.0,
                                    "replies": [
                                        {
                                            "body": "That’s all part of the fun. I would still go on meet and greets & look for a SB if that’s what you want too. But see where these 2 pots go as well.\n\nI’ve had 3 vanillaish experiences on SA that ranged from 1 night to 3 months",
                                            "author": "ruphun",
                                            "id": "ftmf3nm",
                                            "parent_id": "t1_ftmb9ak",
                                            "score": 1,
                                            "created_utc": 1591821189.0,
                                            "replies": [
                                                {
                                                    "body": "I'm still going to give them a chance. it is still fun to *court* women, even when there is going to be an allowance involved. and, if either of these two become something steady, I'd probably still end up spending the same amount of money on them, it would just be allocated differently.\n\nthe only downside is that a cancelled date wastes an evening that could have been scheduled with someone else.",
                                                    "author": "joc13",
                                                    "id": "ftmift7",
                                                    "parent_id": "t1_ftmf3nm",
                                                    "score": 2,
                                                    "created_utc": 1591822778.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "I recently found an SB for my husband. About a quarter of the women I spoke with didn’t want any sort of allowance. I was very surprised.",
                                    "author": "affectionateSB",
                                    "id": "ftl707c",
                                    "parent_id": "t1_ftj2fxy",
                                    "score": 1,
                                    "created_utc": 1591799228.0,
                                    "replies": [
                                        {
                                            "body": "My experience with this wasn’t this year, so possibly more women are using Seeking for vanilla dating with everything going on. It doesn’t surprise me,  many younger women are tired of all the F Boys, Broke guys, and guys that that don’t know how to treat a women",
                                            "author": "ruphun",
                                            "id": "ftlhdik",
                                            "parent_id": "t1_ftl707c",
                                            "score": 2,
                                            "created_utc": 1591804964.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "But they do have a chance. That’s what some of you on SLF don’t understand. I primarily use SA for sugar dating but I’ll not going to lie and say I haven’t also used it to meet women that weren’t lookin for allowances when the opportunity prevented itself. Because the truth is, those women  are on there too, although they are a minority",
                    "author": "ruphun",
                    "id": "ftj2p6n",
                    "parent_id": "t1_ftizn6i",
                    "score": 0,
                    "created_utc": 1591744983.0,
                    "replies": [
                        {
                            "body": "Honestly part of me would be open to vanilla relationship with someone from SA if they were younger and I was actually very interested in them. That's part of why I got on the site I wanted the chance to meet successful guys. But the kind of guys I'd be open to dating are not the common guys on there, I'm only 20 and have no intention of vanilla dating over 35. That being said I would probably do a m&g and a date before deciding if I was willing to see them without a allowance. I was interested in one guy recently who approached me offering an allowance with out a given ammount. We talked and he was kinda cool but in person he was boring and intamate time was lousy the only thing that I was willing to do was sugar date him and his allowance ended up being horribly low so I ended it",
                            "author": "TwitchyArtist",
                            "id": "ftjwmim",
                            "parent_id": "t1_ftj2p6n",
                            "score": 3,
                            "created_utc": 1591762657.0,
                            "replies": []
                        },
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "ftjj7w2",
                            "parent_id": "t1_ftj2p6n",
                            "score": -1,
                            "created_utc": 1591754416.0,
                            "replies": [
                                {
                                    "body": "Its true, and Im not even one of these younger SDs that would be the type to use SA for that. Im late 40's, but look early 40's, fairly decent shape, not extremely hard on the eyes but definitely not a head turner. I just approach every POT on SA and say Im looking for a sugar relationship, but never discuss any arrangement details prior to meeting, except that I want someone thats available at least weekly for dates. By doing this, sometimes you meet someone that is open to something completely different, and as long as you're open to what they're looking, you just might experience something different.",
                                    "author": "ruphun",
                                    "id": "ftjk75q",
                                    "parent_id": "t1_ftjj7w2",
                                    "score": 3,
                                    "created_utc": 1591754997.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I had talked to a guy like that as well (didn't ditch just curious what will happen next). The next thing he said when I say \"I might expect guys to pay for my Uber Premium travel\" was: \n\nYou're so high maintenance and shallow, I didn't be nice to you so that you can bully me!!\n\nI literally laughed it off.",
            "author": "komeonebabe",
            "id": "ftjdr3u",
            "parent_id": "t3_gzye4o",
            "score": 11,
            "created_utc": 1591751242.0,
            "replies": [
                {
                    "body": "🤣🤣🤣",
                    "author": "LikeHoney99",
                    "id": "ftjembz",
                    "parent_id": "t1_ftjdr3u",
                    "score": 3,
                    "created_utc": 1591751732.0,
                    "replies": []
                },
                {
                    "body": "LOL, that guy is funny!",
                    "author": "dpark80",
                    "id": "ftjiw9u",
                    "parent_id": "t1_ftjdr3u",
                    "score": 3,
                    "created_utc": 1591754225.0,
                    "replies": [
                        {
                            "body": "Yes I wondered if he was a legit comedian",
                            "author": "komeonebabe",
                            "id": "ftjocly",
                            "parent_id": "t1_ftjiw9u",
                            "score": 2,
                            "created_utc": 1591757444.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Lol dong forget the guy who are too cheap to even pay the $90 I had a guy tell me today, hey my subscription expires tomorrow and I'm not going to pay to renew it so can you just text me. Next lol cant even afford to keep your membership then you really can't afford me",
            "author": "TwitchyArtist",
            "id": "ftj68sz",
            "parent_id": "t3_gzye4o",
            "score": 17,
            "created_utc": 1591746935.0,
            "replies": [
                {
                    "body": "i've done this before.  it wasn't cause i couldn't afford it.  i wanted to take a break from the site.  but i'd still do M&G if the girl was still interested even if i deactivated my account.  \n\nit's up to you to respond, no need to be salty.",
                    "author": null,
                    "id": "ftjoci7",
                    "parent_id": "t1_ftj68sz",
                    "score": -5,
                    "created_utc": 1591757443.0,
                    "replies": [
                        {
                            "body": "I mean in some cases yes but I must add that the guy was only 22 as well",
                            "author": "TwitchyArtist",
                            "id": "ftjs78o",
                            "parent_id": "t1_ftjoci7",
                            "score": 10,
                            "created_utc": 1591759774.0,
                            "replies": [
                                {
                                    "body": "More than likely a scammer.",
                                    "author": "bsbdfw",
                                    "id": "ftkzvxg",
                                    "parent_id": "t1_ftjs78o",
                                    "score": 3,
                                    "created_utc": 1591795327.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "It's simple, people are idiots",
            "author": "doctorcoolpop",
            "id": "ftkqfhc",
            "parent_id": "t3_gzye4o",
            "score": 4,
            "created_utc": 1591788890.0,
            "replies": []
        },
        {
            "body": "I feel like because SA is ran by a SD it’s basically completed formatted to maximize things for the man. \n\nI feel like if a man just wants to pay for things he should clearly post that in his profile so that SBs don’t waste their time. That’s not at all what a sugar daddy is however.",
            "author": "enigmaticHOE",
            "id": "ftjln43",
            "parent_id": "t3_gzye4o",
            "score": 9,
            "created_utc": 1591755851.0,
            "replies": [
                {
                    "body": ">I feel like because SA is ran by a SD\n\nYes, his name is Brandon Wade.",
                    "author": "bsbdfw",
                    "id": "ftkzr7h",
                    "parent_id": "t1_ftjln43",
                    "score": 3,
                    "created_utc": 1591795248.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "> However, these dudes are paying $90 per month on SA to essentially find a vanilla girlfriend. What’s the appeal in this?\n\nBecause in many situations/cases, there is enough success to justify.\n\nWhy do scammers pay 90/month?  Because they get returns.\n\nFWIW - I have run into women looking for vanilla relationships/marriages/children.  I've never went forward with it (because it was always - serious vanilla relationship leading to marriage/kids).  But I have chatted with POTs that were looking for that.",
            "author": "SDstartingOut",
            "id": "ftkvwj6",
            "parent_id": "t3_gzye4o",
            "score": 3,
            "created_utc": 1591792849.0,
            "replies": []
        },
        {
            "body": "They are wasting real SB's time by casting lines in a pond that they know might be stocked with prospects that are out of their league in a vanilla dating venue. It's annoying, but karma has it's little jokes: little do they know that these days, most of what they'll be catching in that pond is offers for online only, platonic, or feet pics.",
            "author": "roscoe7585",
            "id": "ftl6k6h",
            "parent_id": "t3_gzye4o",
            "score": 3,
            "created_utc": 1591798999.0,
            "replies": [
                {
                    "body": ">most of what they'll be catching in that pond is offers for online only, platonic, or feet pics.\n\nLMAO!!!!\n\n&#x200B;\n\nThis is so hilarious. I love this place",
                    "author": "_THE_PROFESSIE",
                    "id": "fuska0e",
                    "parent_id": "t1_ftl6k6h",
                    "score": 2,
                    "created_utc": 1592135514.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "\"30s and hot\" or \"experience daddy\". apparently for some women this is enough",
            "author": "saltgrindr",
            "id": "ftj8upn",
            "parent_id": "t3_gzye4o",
            "score": 6,
            "created_utc": 1591748396.0,
            "replies": [
                {
                    "body": "If he was 30s and hit and actually interesting maybe I'd go for experiences but he better be giving me some awesome experience, I mean like I want to go to disney land and mountain climbing",
                    "author": "TwitchyArtist",
                    "id": "ftjxsbd",
                    "parent_id": "t1_ftj8upn",
                    "score": 3,
                    "created_utc": 1591763464.0,
                    "replies": [
                        {
                            "body": "honestly those are experiences any guy you're dating could provide",
                            "author": "saltgrindr",
                            "id": "ftk1e4d",
                            "parent_id": "t1_ftjxsbd",
                            "score": 10,
                            "created_utc": 1591766102.0,
                            "replies": [
                                {
                                    "body": "Not really, not every guy has that kind of disposable income.",
                                    "author": null,
                                    "id": "ftm5w2v",
                                    "parent_id": "t1_ftk1e4d",
                                    "score": 1,
                                    "created_utc": 1591816814.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "dont have to be 30 and hot. You just have to meet the right woman, that finds you attractive and likes older guys.",
                    "author": "ruphun",
                    "id": "ftjkxki",
                    "parent_id": "t1_ftj8upn",
                    "score": -2,
                    "created_utc": 1591755433.0,
                    "replies": [
                        {
                            "body": "it's more of a joke that's these kinds of guys are likely to scam women",
                            "author": "saltgrindr",
                            "id": "ftjsgr5",
                            "parent_id": "t1_ftjkxki",
                            "score": 7,
                            "created_utc": 1591759939.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "They're shooting their shot. Yes they pay $90 for the chance to shoot their shot, but that's a LOT less than paying for a full SR.  There are some girls out there that will settle for an expereince-only situation and there are pletny of people who just don't understand what SA is. Is it annoying? Sure. Is ranting going to help anything? Nope. Just block the guy and move along. Maybe you can skim profiles to make sure they mention allowance or generosity or something as a screening method.",
            "author": "MASugarBaby",
            "id": "ftjlqzl",
            "parent_id": "t3_gzye4o",
            "score": 6,
            "created_utc": 1591755916.0,
            "replies": []
        },
        {
            "body": "They dont get nearly the attention especially from hotter women on any other app/website.  Membership fee is nothing when you compare it to the cost of an actual arrangement and they're hoping maybe they can get lucky with a gullible one and considering the hits they probably get it's probably worth the fee",
            "author": "Agent_3w",
            "id": "ftkie5z",
            "parent_id": "t3_gzye4o",
            "score": 3,
            "created_utc": 1591781253.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "ftjmorw",
            "parent_id": "t3_gzye4o",
            "score": 6,
            "created_utc": 1591756463.0,
            "replies": [
                {
                    "body": ">I know lots of guys that will go to a strip club and drop 5-10x what it would cost for an escort because they can't bring themselves to \"pay for sex\". \n\nEXACTLY! \n\nAlso, most SBs & SDs do not view money the same way. Using $90 a month to better their dating pool is seen as an investment, for most SBs that would be irrational to do so.",
                    "author": "bsbdfw",
                    "id": "ftkzmlx",
                    "parent_id": "t1_ftjmorw",
                    "score": 2,
                    "created_utc": 1591795172.0,
                    "replies": []
                },
                {
                    "body": "Strip clubs can be such a scam for men. Why pay that much money to be teased by man-hating women (majority of strippers talk about men like they're all complete garbage) when you literally could have spent that money on an escort or a sugar baby.",
                    "author": "mrjimmyjsz",
                    "id": "ftna6w9",
                    "parent_id": "t1_ftjmorw",
                    "score": 1,
                    "created_utc": 1591836963.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Sadly, as some of the SD OPs comment, there are some women who bite for dating. This is why daters are here. I guess\" turnabout is fair play \"since SB/SDs are looking for Sugar partners on vanilla dating sites.",
            "author": "GSSD",
            "id": "ftlcut6",
            "parent_id": "t3_gzye4o",
            "score": 2,
            "created_utc": 1591802582.0,
            "replies": []
        },
        {
            "body": "I have had a few men on SA tell me that they are on normal dating sites/apps and none of the women they perceive as beautiful will talk to them or follow through on actually going on a date with them. After a while they instead decide to try SA. Apparently \"all the beautiful women are on SA\". Through SA they can get their attention and have a much higher chance of getting these beautiful women to go on a date/meet up with them. Another reason men do this on SA is because its a numbers game. They'll try it with several women and most will say no, but at some point one will say yes.",
            "author": "Here_t0_Party",
            "id": "ftlxu4p",
            "parent_id": "t3_gzye4o",
            "score": 2,
            "created_utc": 1591813045.0,
            "replies": []
        },
        {
            "body": "I wondered the same thing 🤔 just happened to me actually. I met up with a POT SD and our first meet up was very friendly, just hanging out. But the second meet up, he wanted to do more (have sex) and my allowance would be “fun times”??? So no cash but possibly gifts...",
            "author": "hope5498",
            "id": "ftn0rdb",
            "parent_id": "t3_gzye4o",
            "score": 2,
            "created_utc": 1591831898.0,
            "replies": []
        },
        {
            "body": "Since each SB on SA is going to have different expectations from an \"arrangement\" I think these guys just recognize that and feel like the $90 is going to have a better ROI in terms of women at least talking to them than they would get on a vanilla app or buying attractive women drinks at bars. I've heard from so many male friends that they barely even get matches on tinder aside from scam accounts. Then when they send messages to their extremely limited pool of matches the response rate is terrible. That leaves very little chance of them actually making it to an in person meeting. But for $90 they can have attractive women messaging them all month? Why wouldn't they at least try? Annoying for everyone looking for a more traditional arrangement but the deck is massively stacked against a lot of guys on vanilla apps.",
            "author": "nopethatstakentoo",
            "id": "ftk5hps",
            "parent_id": "t3_gzye4o",
            "score": 4,
            "created_utc": 1591769314.0,
            "replies": []
        },
        {
            "body": "The thing that I don't get is why a guy would want to go to sa for a vanilla relationship. I mean my lasted did say that the girls there were more normal than regular girls but that seems weird to me. The amount you have to pay is very high compared to a regular sight and most the girls as I've been told are kinda fake. The other thing is that most of us are there for the money. I'm different because I see the value of mentorship and connection with a successful guy but that means a guy who actually has a large amount of money. If your not good looking and in my age bracket I'm not going to be interested even if your on sa the only reason I compromise typically is to gain financial support",
            "author": "TwitchyArtist",
            "id": "ftjxikc",
            "parent_id": "t3_gzye4o",
            "score": 4,
            "created_utc": 1591763276.0,
            "replies": [
                {
                    "body": "There are many types of non-“vanilla” relationships, and nothing about SA is vanilla aside from financial arrangements.",
                    "author": "daddoms",
                    "id": "ftl2x3o",
                    "parent_id": "t1_ftjxikc",
                    "score": 1,
                    "created_utc": 1591797049.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "That is a type of sugar relationship.  It's not one you want, which is fine, but he is offering to pay for everything which is not the same as a vanilla relationship.",
            "author": "UseTheForceRey",
            "id": "ftjcj6y",
            "parent_id": "t3_gzye4o",
            "score": 1,
            "created_utc": 1591750524.0,
            "replies": []
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "ftlvk8x",
            "parent_id": "t3_gzye4o",
            "score": 1,
            "created_utc": 1591811987.0,
            "replies": [
                {
                    "body": "Rule #3: No solicitation or spamming\n\nPosts looking for arrangements are not allowed and will be considered solicitation and result in an automatic ban. Any post that link articles/blogs without any context will be considered spam and removed. Posts of this nature must include a comment about why it's being posted. Any post advertising another subreddit, blog, website, or group will be removed. Any screenshots/quoting of profiles (that are not your own) will be considered spam and removed. All non-sugar-related post will be removed.\n\nIf you are looking for a sugar partner, please read the wiki on [How should new SBs and SDs get started?](https://www.reddit.com/r/sugarlifestyleforum/wiki/index#wiki_how_should_new_sbs_and_sds_get_started.3F).",
                    "author": "Azurecole",
                    "id": "ftmf9zm",
                    "parent_id": "t1_ftlvk8x",
                    "score": 1,
                    "created_utc": 1591821273.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I wasn't looking for it or expecting it, but I ended up having a two year vanilla relationship with a hot woman 37 years younger than me. Yep I thought it was bizarre too but she was really pleased to have 'caught' me, even announced it to her parents and friends. She was a very intelligent uni student but just came from a modest background and was excited by things like going out for dinner, being in a car that worked, staying in a hotel. Rare but it does happen.",
            "author": "SlothsvPangolins",
            "id": "ftkaqak",
            "parent_id": "t3_gzye4o",
            "score": 1,
            "created_utc": 1591773814.0,
            "replies": [
                {
                    "body": "So hopefully you did the right thing by helping her out without her asking? It’s great that you were together, but once you’ve established that she wasn’t looking for $$, a uni girl from modest background really could use some help.",
                    "author": "daddoms",
                    "id": "ftl2pp0",
                    "parent_id": "t1_ftkaqak",
                    "score": 6,
                    "created_utc": 1591796936.0,
                    "replies": [
                        {
                            "body": "She actively didn't want money, said it would make her feel bad. Instead I bought her stuff that helped in her course, like a laptop and phone, we went on trips (she'd never been on a plane or out of her country), bought her clothes, travel pass etc.",
                            "author": "SlothsvPangolins",
                            "id": "ftleqq3",
                            "parent_id": "t1_ftl2pp0",
                            "score": 2,
                            "created_utc": 1591803651.0,
                            "replies": [
                                {
                                    "body": "Laptop, phone perfect. I’ve been in similar situations, and honestly came to a new understanding of how expensive it is to be a girl!",
                                    "author": "daddoms",
                                    "id": "ftlf8p2",
                                    "parent_id": "t1_ftleqq3",
                                    "score": 1,
                                    "created_utc": 1591803900.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Very annoying\n\nThe male variety of the \"I'm a sugar baby but don't want to give any sugar\" type",
            "author": "Casual_DM",
            "id": "ftl4wq6",
            "parent_id": "t3_gzye4o",
            "score": 0,
            "created_utc": 1591798128.0,
            "replies": []
        },
        {
            "body": "I am happy to pay for company on seeking but that gal may not be on my arm at the concert. It’s really 2 different worlds for me period.",
            "author": null,
            "id": "ftjqo88",
            "parent_id": "t3_gzye4o",
            "score": -1,
            "created_utc": 1591758826.0,
            "replies": []
        },
        {
            "body": "\\>  However, these dudes are paying $90 per month on SA to essentially find a vanilla girlfriend. What’s the appeal in this? \n\nThe appeal is that many girls are open to vanilla date on SA. In fact, this is becoming more common by the day.\n\nFrankly, you sound egocentric: \"why do guys do these things i'm not interested in??\"",
            "author": null,
            "id": "ftjjpi8",
            "parent_id": "t3_gzye4o",
            "score": -8,
            "created_utc": 1591754705.0,
            "replies": [
                {
                    "body": "“Ugh it’s so egocentric to want what the generic description is for a sugar relationship.” K. 👍",
                    "author": "cantakeajoke",
                    "id": "ftjo6b4",
                    "parent_id": "t1_ftjjpi8",
                    "score": 9,
                    "created_utc": 1591757338.0,
                    "replies": []
                },
                {
                    "body": ">Frankly, you sound egocentric: \"why do guys do these things i'm not interested in??\"\n\nIts quite hilarious, but these same women will try to use Tinder for sugar dating 😜",
                    "author": "ruphun",
                    "id": "ftjku6v",
                    "parent_id": "t1_ftjjpi8",
                    "score": -1,
                    "created_utc": 1591755377.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "😂",
            "author": "cantakeajoke",
            "id": "ftj2amz",
            "parent_id": "t1_ftj1snc",
            "score": 13,
            "created_utc": 1591744761.0,
            "replies": [
                {
                    "body": "Right! Like I had a guy who met with me and even talked about providing a allowance on his original message then when I said hey are you giving me a allowance he was like if that's what you want. Like I should not have to beg to be paid. When men go to work their manager wouldn't say that when they ask for their pay check do why do it to us.",
                    "author": "TwitchyArtist",
                    "id": "ftj5xsy",
                    "parent_id": "t1_ftj2amz",
                    "score": 19,
                    "created_utc": 1591746768.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Curious because I've seen this sentiment a few times, is there something wrong with SB giving a number first in your opinion? \n\nI look at it the same was as your hypothetical guy and it is not about guilt tripping anyone at least for me. Giving someone an allowance/PPM does nothing *for me* in and of itself. Its something for the SB in the relationship that I can provide and I'm happy to provide it. In most cases I'd be equally or more happy to vanilla date the girl (goes without saying) but I understand that isn't what most on SA are looking for. I'm ready and willing and expect to provide an allowance/PPM. Is it not fair to ask \"what do you want out of the relationship?\" in the form of financial support? The answers varies the same way people are looking for different frequency of dates or levels of emotional connection. As an SD I do kind of need to know what you're looking for.",
            "author": "canavatar12",
            "id": "ftlbubs",
            "parent_id": "t1_ftj1snc",
            "score": 6,
            "created_utc": 1591801797.0,
            "replies": [
                {
                    "body": "To me, the SD is usually the more mature one and the one guiding the relationship, so I would defer to him to take the lead.\n\n\nAlso, I feel like if an SD asked a question about intimacy, and how the SB would like to proceed / what they're comfortable with, it would be equally as shitty for her to respond with \"well YOU'RE the one who wants to have sex. If it was up to me I would just receive an allowance and not engage in intimacy\"",
                    "author": "SweetieBby",
                    "id": "ftm6qnk",
                    "parent_id": "t1_ftlbubs",
                    "score": 5,
                    "created_utc": 1591817208.0,
                    "replies": [
                        {
                            "body": "Thats fair and I understand where you're coming from. No question there is a better way to communicate it. It would be better for an SD to say \"I'm open to anything from a vanilla relationship to direct financial support depending on what you are looking for and the connection when we meet. What are you looking for?\" and also fair for an SB to say to the intimacy question \"I'm open to anything from platonic friendship to a romantic relationship depending on what you are looking for and the connection when we meet. What are you looking for?\" \n\nThe difference is the money is a one way street. It needs to be figured out ahead of time. Sometimes, that means the onus is on the SB to ask for what she wants, if the SD is open to different types of things. The intimacy and romantic/emotional connection *should* be a two way street and you can let that play itself out naturally once you both confirm you are open and interested in an intimate relationship. I don't want a laundry list of what my SB is comfortable doing sexually before a first date, that would be weird, all I want to know is whether she is open to and looking for a full relationship.",
                            "author": "canavatar12",
                            "id": "ftn2txe",
                            "parent_id": "t1_ftm6qnk",
                            "score": 2,
                            "created_utc": 1591832974.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "But to pay $90 per month is counterintuitive if you really wanted to spend as little as possible 🤔",
            "author": "cantakeajoke",
            "id": "ftj0mif",
            "parent_id": "t1_ftj02rk",
            "score": 17,
            "created_utc": 1591743853.0,
            "replies": [
                {
                    "body": "I think there are also a lot of Pick Up Artists and Red Pill guys that like the challenge of trying to \"score for free\" on a Sugar site where most girls are looking for an allowance.  It is a way of demonstrating their prowess to show that they can get the girl without paying an allowance.  You will sometimes see them bragging about their success in online forums.",
                    "author": "willfromvb",
                    "id": "ftl2f67",
                    "parent_id": "t1_ftj0mif",
                    "score": 11,
                    "created_utc": 1591796779.0,
                    "replies": []
                },
                {
                    "body": "Not really. There’s women on Seeking that do not want allowance. So paying $90 access gets you fishing in a well stocked pond so to speak. On Tinder, you have lots of competition as a man but on Seeking your odds of meeting someone are much better even without an allowance because some women use SA for Vanilla or they just want a guy with money that can pay for experiences",
                    "author": "ruphun",
                    "id": "ftj2b55",
                    "parent_id": "t1_ftj0mif",
                    "score": 15,
                    "created_utc": 1591744769.0,
                    "replies": [
                        {
                            "body": "\\^ This. \n\nThere are a number of college girls and 20-somethings for whom being with a guy who simply has a steady job and isn't sitting around all day playing video games (their same age peers) is a pleasant escape. Like it or not, there is  percentage of women on sites like SA for whom\" being taken to concerts and having the dinner tab for our dates picked up\" is a welcome change from the losers who can't even buy her a slice of pizza on a Friday night. \"Hey, man. Can you cover tonight?\" Not gonna claim it is a large percentage, but it is out there in the bowl.",
                            "author": "BinghamtonSD",
                            "id": "ftj7pah",
                            "parent_id": "t1_ftj2b55",
                            "score": 19,
                            "created_utc": 1591747740.0,
                            "replies": [
                                {
                                    "body": "DEFINITELY.... this is why I went looking for an older man to have as an FWB and occasionally take me to dinner. I paid for all my college boyfriends everything and I just wanted a guy who could take care of himself, fuck me, and buy me dinner once in a while.",
                                    "author": null,
                                    "id": "ftlcmkh",
                                    "parent_id": "t1_ftj7pah",
                                    "score": 2,
                                    "created_utc": 1591802388.0,
                                    "replies": []
                                },
                                {
                                    "body": "yes it is. Ive also come across later 20's women that want the spoiled GF route. Someone that takes them places, pays for their hair, nails, spa, and occasional shopping trips. Ive even met a mid 20's women that just wanted a FWB and didn't even want to go anywhere. It's definitely not a large percentage.. probably 5% at most, but you will come across it, and if you're the type of SD that doesnt talk arrangement details until after meeting, you just might meet someone that isnt looking an actual arrangement or allowance. I also feel that women sometimes go into a meet and greet, and will call an audible, based on how you look, and the connection you have, an may change what they're open to.",
                                    "author": "ruphun",
                                    "id": "ftjjm0p",
                                    "parent_id": "t1_ftj7pah",
                                    "score": -3,
                                    "created_utc": 1591754647.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "> spend as little as possible\n\nThere's a big difference between $90 and $WXYZ monthly",
                    "author": "GSSD",
                    "id": "ftla9se",
                    "parent_id": "t1_ftj0mif",
                    "score": 2,
                    "created_utc": 1591800882.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "They're buying a good female response rate for their $90. Now I'm an SD and have been for 10 years. If I post my pic and vanilla profile on Tinder, Okc or the like , I get crickets. I post my pic & SD profile on SA and I get lots of responses that say...(insert fake Asian accent) \"Oh, you a hansom man!\" 😉",
            "author": "chippyboy11254",
            "id": "ftj1edu",
            "parent_id": "t1_ftj02rk",
            "score": -8,
            "created_utc": 1591744274.0,
            "replies": [
                {
                    "body": "Love to see the completely unnecessary anti-Asian racism here... gross",
                    "author": null,
                    "id": "ftkst5d",
                    "parent_id": "t1_ftj1edu",
                    "score": 8,
                    "created_utc": 1591790737.0,
                    "replies": []
                }
            ]
        },
        {
            "body": ">Pretty simple...they're not real SD's. \n\nI wouldnt say that applies to everyone that does that. \n\n&#x200B;\n\n>They're probably men of modest means that are hoping to capitalize on the naivete or desperation of many of the young ladies that inhabit SA. \n\nNo need to pray on desperate women. Ive had women that have their own money, that don't want or need an allowance.  \n\n\n>Their end goal is to get laid with as little effort and money expended as possible.\n\nWhat man doesnt have an end goal of getting laid easily?",
            "author": "ruphun",
            "id": "ftjlah3",
            "parent_id": "t1_ftj02rk",
            "score": -4,
            "created_utc": 1591755646.0,
            "replies": []
        },
        {
            "body": "Yep. SA can make you feel jaded searching for a real person and connection. The $90 would seem like wasting money for prudent business men.",
            "author": "BeautyGr8ce",
            "id": "ftj779a",
            "parent_id": "t1_ftj04fy",
            "score": 12,
            "created_utc": 1591747472.0,
            "replies": []
        },
        {
            "body": "This.  Total time waste.",
            "author": "LotBuilder",
            "id": "ftjwp1h",
            "parent_id": "t1_ftj04fy",
            "score": 8,
            "created_utc": 1591762705.0,
            "replies": []
        },
        {
            "body": "1000% this!",
            "author": "ruphun",
            "id": "ftj1yy0",
            "parent_id": "t1_ftj04fy",
            "score": 13,
            "created_utc": 1591744582.0,
            "replies": []
        },
        {
            "body": "Stop doing it then.",
            "author": "adool999",
            "id": "ftj9fv9",
            "parent_id": "t1_ftj04fy",
            "score": -1,
            "created_utc": 1591748738.0,
            "replies": []
        },
        {
            "body": "Drives me nuts. I would assume that once the guy says that, most if not all women would be like “thanks, but no thanks.”",
            "author": "cantakeajoke",
            "id": "ftj05pf",
            "parent_id": "t1_ftizn6i",
            "score": 6,
            "created_utc": 1591743605.0,
            "replies": [
                {
                    "body": "Most not all. All you have to do is talk to 100 women on SA and you will find at least one that is ok with that.",
                    "author": "ruphun",
                    "id": "ftj2fxy",
                    "parent_id": "t1_ftj05pf",
                    "score": 0,
                    "created_utc": 1591744842.0,
                    "replies": [
                        {
                            "body": "My former SB even told me that she would have slept with me for free if I hadn't offered to pay her a PPM. She told me this weeks after our first intimate date. At the time I was even getting that vibe - she didn't want to talk about money until I kind of insisted to pay her the morning AFTER we slept together for the first time.\n\nI feel like alot of newbie women on SA come from a vanilla dating background and if they meet a guy they would conceivably vanilla date, they'll be fine with not being paid a PPM for the date as long as the guy pays for everything else, if they're attracted enough to the POT SD. At least, that's the vibe I got from her and I'm sure there were plenty of others like that. To get this \"deal\" it probably helps to be under 40 though.",
                            "author": "mrjimmyjsz",
                            "id": "ftn9rt0",
                            "parent_id": "t1_ftj2fxy",
                            "score": 3,
                            "created_utc": 1591836729.0,
                            "replies": [
                                {
                                    "body": "I’ve experienced that too. Definitely not under 40 though, closer to 50.  My previous SB wouldn’t even accept any money the first time we slept together.  In the first couple weeks she would only let me pay for things. We had very organic chemistry right from the meet and greet, so nothing was forced or negotiated . Intimacy happened very organically",
                                    "author": "ruphun",
                                    "id": "ftnbf3r",
                                    "parent_id": "t1_ftn9rt0",
                                    "score": 2,
                                    "created_utc": 1591837648.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "I'm talking to *2* women right now that do not want direct financial assistance as part of our dating.\n\nwhile this sounds great, in principle, it has also meant they have little urgency to schedule dates, and one has cancelled twice on short notice and the other has no call, no showed.\n\ngiving each a second chance, but I'm not getting my hopes up that either will turn into anything steady.",
                            "author": "joc13",
                            "id": "ftmb9ak",
                            "parent_id": "t1_ftj2fxy",
                            "score": 2,
                            "created_utc": 1591819343.0,
                            "replies": [
                                {
                                    "body": "That’s all part of the fun. I would still go on meet and greets & look for a SB if that’s what you want too. But see where these 2 pots go as well.\n\nI’ve had 3 vanillaish experiences on SA that ranged from 1 night to 3 months",
                                    "author": "ruphun",
                                    "id": "ftmf3nm",
                                    "parent_id": "t1_ftmb9ak",
                                    "score": 1,
                                    "created_utc": 1591821189.0,
                                    "replies": [
                                        {
                                            "body": "I'm still going to give them a chance. it is still fun to *court* women, even when there is going to be an allowance involved. and, if either of these two become something steady, I'd probably still end up spending the same amount of money on them, it would just be allocated differently.\n\nthe only downside is that a cancelled date wastes an evening that could have been scheduled with someone else.",
                                            "author": "joc13",
                                            "id": "ftmift7",
                                            "parent_id": "t1_ftmf3nm",
                                            "score": 2,
                                            "created_utc": 1591822778.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "I recently found an SB for my husband. About a quarter of the women I spoke with didn’t want any sort of allowance. I was very surprised.",
                            "author": "affectionateSB",
                            "id": "ftl707c",
                            "parent_id": "t1_ftj2fxy",
                            "score": 1,
                            "created_utc": 1591799228.0,
                            "replies": [
                                {
                                    "body": "My experience with this wasn’t this year, so possibly more women are using Seeking for vanilla dating with everything going on. It doesn’t surprise me,  many younger women are tired of all the F Boys, Broke guys, and guys that that don’t know how to treat a women",
                                    "author": "ruphun",
                                    "id": "ftlhdik",
                                    "parent_id": "t1_ftl707c",
                                    "score": 2,
                                    "created_utc": 1591804964.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "But they do have a chance. That’s what some of you on SLF don’t understand. I primarily use SA for sugar dating but I’ll not going to lie and say I haven’t also used it to meet women that weren’t lookin for allowances when the opportunity prevented itself. Because the truth is, those women  are on there too, although they are a minority",
            "author": "ruphun",
            "id": "ftj2p6n",
            "parent_id": "t1_ftizn6i",
            "score": 0,
            "created_utc": 1591744983.0,
            "replies": [
                {
                    "body": "Honestly part of me would be open to vanilla relationship with someone from SA if they were younger and I was actually very interested in them. That's part of why I got on the site I wanted the chance to meet successful guys. But the kind of guys I'd be open to dating are not the common guys on there, I'm only 20 and have no intention of vanilla dating over 35. That being said I would probably do a m&g and a date before deciding if I was willing to see them without a allowance. I was interested in one guy recently who approached me offering an allowance with out a given ammount. We talked and he was kinda cool but in person he was boring and intamate time was lousy the only thing that I was willing to do was sugar date him and his allowance ended up being horribly low so I ended it",
                    "author": "TwitchyArtist",
                    "id": "ftjwmim",
                    "parent_id": "t1_ftj2p6n",
                    "score": 3,
                    "created_utc": 1591762657.0,
                    "replies": []
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "ftjj7w2",
                    "parent_id": "t1_ftj2p6n",
                    "score": -1,
                    "created_utc": 1591754416.0,
                    "replies": [
                        {
                            "body": "Its true, and Im not even one of these younger SDs that would be the type to use SA for that. Im late 40's, but look early 40's, fairly decent shape, not extremely hard on the eyes but definitely not a head turner. I just approach every POT on SA and say Im looking for a sugar relationship, but never discuss any arrangement details prior to meeting, except that I want someone thats available at least weekly for dates. By doing this, sometimes you meet someone that is open to something completely different, and as long as you're open to what they're looking, you just might experience something different.",
                            "author": "ruphun",
                            "id": "ftjk75q",
                            "parent_id": "t1_ftjj7w2",
                            "score": 3,
                            "created_utc": 1591754997.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "🤣🤣🤣",
            "author": "LikeHoney99",
            "id": "ftjembz",
            "parent_id": "t1_ftjdr3u",
            "score": 3,
            "created_utc": 1591751732.0,
            "replies": []
        },
        {
            "body": "LOL, that guy is funny!",
            "author": "dpark80",
            "id": "ftjiw9u",
            "parent_id": "t1_ftjdr3u",
            "score": 3,
            "created_utc": 1591754225.0,
            "replies": [
                {
                    "body": "Yes I wondered if he was a legit comedian",
                    "author": "komeonebabe",
                    "id": "ftjocly",
                    "parent_id": "t1_ftjiw9u",
                    "score": 2,
                    "created_utc": 1591757444.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "i've done this before.  it wasn't cause i couldn't afford it.  i wanted to take a break from the site.  but i'd still do M&G if the girl was still interested even if i deactivated my account.  \n\nit's up to you to respond, no need to be salty.",
            "author": null,
            "id": "ftjoci7",
            "parent_id": "t1_ftj68sz",
            "score": -5,
            "created_utc": 1591757443.0,
            "replies": [
                {
                    "body": "I mean in some cases yes but I must add that the guy was only 22 as well",
                    "author": "TwitchyArtist",
                    "id": "ftjs78o",
                    "parent_id": "t1_ftjoci7",
                    "score": 10,
                    "created_utc": 1591759774.0,
                    "replies": [
                        {
                            "body": "More than likely a scammer.",
                            "author": "bsbdfw",
                            "id": "ftkzvxg",
                            "parent_id": "t1_ftjs78o",
                            "score": 3,
                            "created_utc": 1591795327.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": ">I feel like because SA is ran by a SD\n\nYes, his name is Brandon Wade.",
            "author": "bsbdfw",
            "id": "ftkzr7h",
            "parent_id": "t1_ftjln43",
            "score": 3,
            "created_utc": 1591795248.0,
            "replies": []
        },
        {
            "body": ">most of what they'll be catching in that pond is offers for online only, platonic, or feet pics.\n\nLMAO!!!!\n\n&#x200B;\n\nThis is so hilarious. I love this place",
            "author": "_THE_PROFESSIE",
            "id": "fuska0e",
            "parent_id": "t1_ftl6k6h",
            "score": 2,
            "created_utc": 1592135514.0,
            "replies": []
        },
        {
            "body": "If he was 30s and hit and actually interesting maybe I'd go for experiences but he better be giving me some awesome experience, I mean like I want to go to disney land and mountain climbing",
            "author": "TwitchyArtist",
            "id": "ftjxsbd",
            "parent_id": "t1_ftj8upn",
            "score": 3,
            "created_utc": 1591763464.0,
            "replies": [
                {
                    "body": "honestly those are experiences any guy you're dating could provide",
                    "author": "saltgrindr",
                    "id": "ftk1e4d",
                    "parent_id": "t1_ftjxsbd",
                    "score": 10,
                    "created_utc": 1591766102.0,
                    "replies": [
                        {
                            "body": "Not really, not every guy has that kind of disposable income.",
                            "author": null,
                            "id": "ftm5w2v",
                            "parent_id": "t1_ftk1e4d",
                            "score": 1,
                            "created_utc": 1591816814.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "dont have to be 30 and hot. You just have to meet the right woman, that finds you attractive and likes older guys.",
            "author": "ruphun",
            "id": "ftjkxki",
            "parent_id": "t1_ftj8upn",
            "score": -2,
            "created_utc": 1591755433.0,
            "replies": [
                {
                    "body": "it's more of a joke that's these kinds of guys are likely to scam women",
                    "author": "saltgrindr",
                    "id": "ftjsgr5",
                    "parent_id": "t1_ftjkxki",
                    "score": 7,
                    "created_utc": 1591759939.0,
                    "replies": []
                }
            ]
        },
        {
            "body": ">I know lots of guys that will go to a strip club and drop 5-10x what it would cost for an escort because they can't bring themselves to \"pay for sex\". \n\nEXACTLY! \n\nAlso, most SBs & SDs do not view money the same way. Using $90 a month to better their dating pool is seen as an investment, for most SBs that would be irrational to do so.",
            "author": "bsbdfw",
            "id": "ftkzmlx",
            "parent_id": "t1_ftjmorw",
            "score": 2,
            "created_utc": 1591795172.0,
            "replies": []
        },
        {
            "body": "Strip clubs can be such a scam for men. Why pay that much money to be teased by man-hating women (majority of strippers talk about men like they're all complete garbage) when you literally could have spent that money on an escort or a sugar baby.",
            "author": "mrjimmyjsz",
            "id": "ftna6w9",
            "parent_id": "t1_ftjmorw",
            "score": 1,
            "created_utc": 1591836963.0,
            "replies": []
        },
        {
            "body": "There are many types of non-“vanilla” relationships, and nothing about SA is vanilla aside from financial arrangements.",
            "author": "daddoms",
            "id": "ftl2x3o",
            "parent_id": "t1_ftjxikc",
            "score": 1,
            "created_utc": 1591797049.0,
            "replies": []
        },
        {
            "body": "Rule #3: No solicitation or spamming\n\nPosts looking for arrangements are not allowed and will be considered solicitation and result in an automatic ban. Any post that link articles/blogs without any context will be considered spam and removed. Posts of this nature must include a comment about why it's being posted. Any post advertising another subreddit, blog, website, or group will be removed. Any screenshots/quoting of profiles (that are not your own) will be considered spam and removed. All non-sugar-related post will be removed.\n\nIf you are looking for a sugar partner, please read the wiki on [How should new SBs and SDs get started?](https://www.reddit.com/r/sugarlifestyleforum/wiki/index#wiki_how_should_new_sbs_and_sds_get_started.3F).",
            "author": "Azurecole",
            "id": "ftmf9zm",
            "parent_id": "t1_ftlvk8x",
            "score": 1,
            "created_utc": 1591821273.0,
            "replies": []
        },
        {
            "body": "So hopefully you did the right thing by helping her out without her asking? It’s great that you were together, but once you’ve established that she wasn’t looking for $$, a uni girl from modest background really could use some help.",
            "author": "daddoms",
            "id": "ftl2pp0",
            "parent_id": "t1_ftkaqak",
            "score": 6,
            "created_utc": 1591796936.0,
            "replies": [
                {
                    "body": "She actively didn't want money, said it would make her feel bad. Instead I bought her stuff that helped in her course, like a laptop and phone, we went on trips (she'd never been on a plane or out of her country), bought her clothes, travel pass etc.",
                    "author": "SlothsvPangolins",
                    "id": "ftleqq3",
                    "parent_id": "t1_ftl2pp0",
                    "score": 2,
                    "created_utc": 1591803651.0,
                    "replies": [
                        {
                            "body": "Laptop, phone perfect. I’ve been in similar situations, and honestly came to a new understanding of how expensive it is to be a girl!",
                            "author": "daddoms",
                            "id": "ftlf8p2",
                            "parent_id": "t1_ftleqq3",
                            "score": 1,
                            "created_utc": 1591803900.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "“Ugh it’s so egocentric to want what the generic description is for a sugar relationship.” K. 👍",
            "author": "cantakeajoke",
            "id": "ftjo6b4",
            "parent_id": "t1_ftjjpi8",
            "score": 9,
            "created_utc": 1591757338.0,
            "replies": []
        },
        {
            "body": ">Frankly, you sound egocentric: \"why do guys do these things i'm not interested in??\"\n\nIts quite hilarious, but these same women will try to use Tinder for sugar dating 😜",
            "author": "ruphun",
            "id": "ftjku6v",
            "parent_id": "t1_ftjjpi8",
            "score": -1,
            "created_utc": 1591755377.0,
            "replies": []
        },
        {
            "body": "Right! Like I had a guy who met with me and even talked about providing a allowance on his original message then when I said hey are you giving me a allowance he was like if that's what you want. Like I should not have to beg to be paid. When men go to work their manager wouldn't say that when they ask for their pay check do why do it to us.",
            "author": "TwitchyArtist",
            "id": "ftj5xsy",
            "parent_id": "t1_ftj2amz",
            "score": 19,
            "created_utc": 1591746768.0,
            "replies": []
        },
        {
            "body": "To me, the SD is usually the more mature one and the one guiding the relationship, so I would defer to him to take the lead.\n\n\nAlso, I feel like if an SD asked a question about intimacy, and how the SB would like to proceed / what they're comfortable with, it would be equally as shitty for her to respond with \"well YOU'RE the one who wants to have sex. If it was up to me I would just receive an allowance and not engage in intimacy\"",
            "author": "SweetieBby",
            "id": "ftm6qnk",
            "parent_id": "t1_ftlbubs",
            "score": 5,
            "created_utc": 1591817208.0,
            "replies": [
                {
                    "body": "Thats fair and I understand where you're coming from. No question there is a better way to communicate it. It would be better for an SD to say \"I'm open to anything from a vanilla relationship to direct financial support depending on what you are looking for and the connection when we meet. What are you looking for?\" and also fair for an SB to say to the intimacy question \"I'm open to anything from platonic friendship to a romantic relationship depending on what you are looking for and the connection when we meet. What are you looking for?\" \n\nThe difference is the money is a one way street. It needs to be figured out ahead of time. Sometimes, that means the onus is on the SB to ask for what she wants, if the SD is open to different types of things. The intimacy and romantic/emotional connection *should* be a two way street and you can let that play itself out naturally once you both confirm you are open and interested in an intimate relationship. I don't want a laundry list of what my SB is comfortable doing sexually before a first date, that would be weird, all I want to know is whether she is open to and looking for a full relationship.",
                    "author": "canavatar12",
                    "id": "ftn2txe",
                    "parent_id": "t1_ftm6qnk",
                    "score": 2,
                    "created_utc": 1591832974.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I think there are also a lot of Pick Up Artists and Red Pill guys that like the challenge of trying to \"score for free\" on a Sugar site where most girls are looking for an allowance.  It is a way of demonstrating their prowess to show that they can get the girl without paying an allowance.  You will sometimes see them bragging about their success in online forums.",
            "author": "willfromvb",
            "id": "ftl2f67",
            "parent_id": "t1_ftj0mif",
            "score": 11,
            "created_utc": 1591796779.0,
            "replies": []
        },
        {
            "body": "Not really. There’s women on Seeking that do not want allowance. So paying $90 access gets you fishing in a well stocked pond so to speak. On Tinder, you have lots of competition as a man but on Seeking your odds of meeting someone are much better even without an allowance because some women use SA for Vanilla or they just want a guy with money that can pay for experiences",
            "author": "ruphun",
            "id": "ftj2b55",
            "parent_id": "t1_ftj0mif",
            "score": 15,
            "created_utc": 1591744769.0,
            "replies": [
                {
                    "body": "\\^ This. \n\nThere are a number of college girls and 20-somethings for whom being with a guy who simply has a steady job and isn't sitting around all day playing video games (their same age peers) is a pleasant escape. Like it or not, there is  percentage of women on sites like SA for whom\" being taken to concerts and having the dinner tab for our dates picked up\" is a welcome change from the losers who can't even buy her a slice of pizza on a Friday night. \"Hey, man. Can you cover tonight?\" Not gonna claim it is a large percentage, but it is out there in the bowl.",
                    "author": "BinghamtonSD",
                    "id": "ftj7pah",
                    "parent_id": "t1_ftj2b55",
                    "score": 19,
                    "created_utc": 1591747740.0,
                    "replies": [
                        {
                            "body": "DEFINITELY.... this is why I went looking for an older man to have as an FWB and occasionally take me to dinner. I paid for all my college boyfriends everything and I just wanted a guy who could take care of himself, fuck me, and buy me dinner once in a while.",
                            "author": null,
                            "id": "ftlcmkh",
                            "parent_id": "t1_ftj7pah",
                            "score": 2,
                            "created_utc": 1591802388.0,
                            "replies": []
                        },
                        {
                            "body": "yes it is. Ive also come across later 20's women that want the spoiled GF route. Someone that takes them places, pays for their hair, nails, spa, and occasional shopping trips. Ive even met a mid 20's women that just wanted a FWB and didn't even want to go anywhere. It's definitely not a large percentage.. probably 5% at most, but you will come across it, and if you're the type of SD that doesnt talk arrangement details until after meeting, you just might meet someone that isnt looking an actual arrangement or allowance. I also feel that women sometimes go into a meet and greet, and will call an audible, based on how you look, and the connection you have, an may change what they're open to.",
                            "author": "ruphun",
                            "id": "ftjjm0p",
                            "parent_id": "t1_ftj7pah",
                            "score": -3,
                            "created_utc": 1591754647.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "> spend as little as possible\n\nThere's a big difference between $90 and $WXYZ monthly",
            "author": "GSSD",
            "id": "ftla9se",
            "parent_id": "t1_ftj0mif",
            "score": 2,
            "created_utc": 1591800882.0,
            "replies": []
        },
        {
            "body": "Love to see the completely unnecessary anti-Asian racism here... gross",
            "author": null,
            "id": "ftkst5d",
            "parent_id": "t1_ftj1edu",
            "score": 8,
            "created_utc": 1591790737.0,
            "replies": []
        },
        {
            "body": "Most not all. All you have to do is talk to 100 women on SA and you will find at least one that is ok with that.",
            "author": "ruphun",
            "id": "ftj2fxy",
            "parent_id": "t1_ftj05pf",
            "score": 0,
            "created_utc": 1591744842.0,
            "replies": [
                {
                    "body": "My former SB even told me that she would have slept with me for free if I hadn't offered to pay her a PPM. She told me this weeks after our first intimate date. At the time I was even getting that vibe - she didn't want to talk about money until I kind of insisted to pay her the morning AFTER we slept together for the first time.\n\nI feel like alot of newbie women on SA come from a vanilla dating background and if they meet a guy they would conceivably vanilla date, they'll be fine with not being paid a PPM for the date as long as the guy pays for everything else, if they're attracted enough to the POT SD. At least, that's the vibe I got from her and I'm sure there were plenty of others like that. To get this \"deal\" it probably helps to be under 40 though.",
                    "author": "mrjimmyjsz",
                    "id": "ftn9rt0",
                    "parent_id": "t1_ftj2fxy",
                    "score": 3,
                    "created_utc": 1591836729.0,
                    "replies": [
                        {
                            "body": "I’ve experienced that too. Definitely not under 40 though, closer to 50.  My previous SB wouldn’t even accept any money the first time we slept together.  In the first couple weeks she would only let me pay for things. We had very organic chemistry right from the meet and greet, so nothing was forced or negotiated . Intimacy happened very organically",
                            "author": "ruphun",
                            "id": "ftnbf3r",
                            "parent_id": "t1_ftn9rt0",
                            "score": 2,
                            "created_utc": 1591837648.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "I'm talking to *2* women right now that do not want direct financial assistance as part of our dating.\n\nwhile this sounds great, in principle, it has also meant they have little urgency to schedule dates, and one has cancelled twice on short notice and the other has no call, no showed.\n\ngiving each a second chance, but I'm not getting my hopes up that either will turn into anything steady.",
                    "author": "joc13",
                    "id": "ftmb9ak",
                    "parent_id": "t1_ftj2fxy",
                    "score": 2,
                    "created_utc": 1591819343.0,
                    "replies": [
                        {
                            "body": "That’s all part of the fun. I would still go on meet and greets & look for a SB if that’s what you want too. But see where these 2 pots go as well.\n\nI’ve had 3 vanillaish experiences on SA that ranged from 1 night to 3 months",
                            "author": "ruphun",
                            "id": "ftmf3nm",
                            "parent_id": "t1_ftmb9ak",
                            "score": 1,
                            "created_utc": 1591821189.0,
                            "replies": [
                                {
                                    "body": "I'm still going to give them a chance. it is still fun to *court* women, even when there is going to be an allowance involved. and, if either of these two become something steady, I'd probably still end up spending the same amount of money on them, it would just be allocated differently.\n\nthe only downside is that a cancelled date wastes an evening that could have been scheduled with someone else.",
                                    "author": "joc13",
                                    "id": "ftmift7",
                                    "parent_id": "t1_ftmf3nm",
                                    "score": 2,
                                    "created_utc": 1591822778.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "I recently found an SB for my husband. About a quarter of the women I spoke with didn’t want any sort of allowance. I was very surprised.",
                    "author": "affectionateSB",
                    "id": "ftl707c",
                    "parent_id": "t1_ftj2fxy",
                    "score": 1,
                    "created_utc": 1591799228.0,
                    "replies": [
                        {
                            "body": "My experience with this wasn’t this year, so possibly more women are using Seeking for vanilla dating with everything going on. It doesn’t surprise me,  many younger women are tired of all the F Boys, Broke guys, and guys that that don’t know how to treat a women",
                            "author": "ruphun",
                            "id": "ftlhdik",
                            "parent_id": "t1_ftl707c",
                            "score": 2,
                            "created_utc": 1591804964.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Honestly part of me would be open to vanilla relationship with someone from SA if they were younger and I was actually very interested in them. That's part of why I got on the site I wanted the chance to meet successful guys. But the kind of guys I'd be open to dating are not the common guys on there, I'm only 20 and have no intention of vanilla dating over 35. That being said I would probably do a m&g and a date before deciding if I was willing to see them without a allowance. I was interested in one guy recently who approached me offering an allowance with out a given ammount. We talked and he was kinda cool but in person he was boring and intamate time was lousy the only thing that I was willing to do was sugar date him and his allowance ended up being horribly low so I ended it",
            "author": "TwitchyArtist",
            "id": "ftjwmim",
            "parent_id": "t1_ftj2p6n",
            "score": 3,
            "created_utc": 1591762657.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "ftjj7w2",
            "parent_id": "t1_ftj2p6n",
            "score": -1,
            "created_utc": 1591754416.0,
            "replies": [
                {
                    "body": "Its true, and Im not even one of these younger SDs that would be the type to use SA for that. Im late 40's, but look early 40's, fairly decent shape, not extremely hard on the eyes but definitely not a head turner. I just approach every POT on SA and say Im looking for a sugar relationship, but never discuss any arrangement details prior to meeting, except that I want someone thats available at least weekly for dates. By doing this, sometimes you meet someone that is open to something completely different, and as long as you're open to what they're looking, you just might experience something different.",
                    "author": "ruphun",
                    "id": "ftjk75q",
                    "parent_id": "t1_ftjj7w2",
                    "score": 3,
                    "created_utc": 1591754997.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yes I wondered if he was a legit comedian",
            "author": "komeonebabe",
            "id": "ftjocly",
            "parent_id": "t1_ftjiw9u",
            "score": 2,
            "created_utc": 1591757444.0,
            "replies": []
        },
        {
            "body": "I mean in some cases yes but I must add that the guy was only 22 as well",
            "author": "TwitchyArtist",
            "id": "ftjs78o",
            "parent_id": "t1_ftjoci7",
            "score": 10,
            "created_utc": 1591759774.0,
            "replies": [
                {
                    "body": "More than likely a scammer.",
                    "author": "bsbdfw",
                    "id": "ftkzvxg",
                    "parent_id": "t1_ftjs78o",
                    "score": 3,
                    "created_utc": 1591795327.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "honestly those are experiences any guy you're dating could provide",
            "author": "saltgrindr",
            "id": "ftk1e4d",
            "parent_id": "t1_ftjxsbd",
            "score": 10,
            "created_utc": 1591766102.0,
            "replies": [
                {
                    "body": "Not really, not every guy has that kind of disposable income.",
                    "author": null,
                    "id": "ftm5w2v",
                    "parent_id": "t1_ftk1e4d",
                    "score": 1,
                    "created_utc": 1591816814.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "it's more of a joke that's these kinds of guys are likely to scam women",
            "author": "saltgrindr",
            "id": "ftjsgr5",
            "parent_id": "t1_ftjkxki",
            "score": 7,
            "created_utc": 1591759939.0,
            "replies": []
        },
        {
            "body": "She actively didn't want money, said it would make her feel bad. Instead I bought her stuff that helped in her course, like a laptop and phone, we went on trips (she'd never been on a plane or out of her country), bought her clothes, travel pass etc.",
            "author": "SlothsvPangolins",
            "id": "ftleqq3",
            "parent_id": "t1_ftl2pp0",
            "score": 2,
            "created_utc": 1591803651.0,
            "replies": [
                {
                    "body": "Laptop, phone perfect. I’ve been in similar situations, and honestly came to a new understanding of how expensive it is to be a girl!",
                    "author": "daddoms",
                    "id": "ftlf8p2",
                    "parent_id": "t1_ftleqq3",
                    "score": 1,
                    "created_utc": 1591803900.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Thats fair and I understand where you're coming from. No question there is a better way to communicate it. It would be better for an SD to say \"I'm open to anything from a vanilla relationship to direct financial support depending on what you are looking for and the connection when we meet. What are you looking for?\" and also fair for an SB to say to the intimacy question \"I'm open to anything from platonic friendship to a romantic relationship depending on what you are looking for and the connection when we meet. What are you looking for?\" \n\nThe difference is the money is a one way street. It needs to be figured out ahead of time. Sometimes, that means the onus is on the SB to ask for what she wants, if the SD is open to different types of things. The intimacy and romantic/emotional connection *should* be a two way street and you can let that play itself out naturally once you both confirm you are open and interested in an intimate relationship. I don't want a laundry list of what my SB is comfortable doing sexually before a first date, that would be weird, all I want to know is whether she is open to and looking for a full relationship.",
            "author": "canavatar12",
            "id": "ftn2txe",
            "parent_id": "t1_ftm6qnk",
            "score": 2,
            "created_utc": 1591832974.0,
            "replies": []
        },
        {
            "body": "\\^ This. \n\nThere are a number of college girls and 20-somethings for whom being with a guy who simply has a steady job and isn't sitting around all day playing video games (their same age peers) is a pleasant escape. Like it or not, there is  percentage of women on sites like SA for whom\" being taken to concerts and having the dinner tab for our dates picked up\" is a welcome change from the losers who can't even buy her a slice of pizza on a Friday night. \"Hey, man. Can you cover tonight?\" Not gonna claim it is a large percentage, but it is out there in the bowl.",
            "author": "BinghamtonSD",
            "id": "ftj7pah",
            "parent_id": "t1_ftj2b55",
            "score": 19,
            "created_utc": 1591747740.0,
            "replies": [
                {
                    "body": "DEFINITELY.... this is why I went looking for an older man to have as an FWB and occasionally take me to dinner. I paid for all my college boyfriends everything and I just wanted a guy who could take care of himself, fuck me, and buy me dinner once in a while.",
                    "author": null,
                    "id": "ftlcmkh",
                    "parent_id": "t1_ftj7pah",
                    "score": 2,
                    "created_utc": 1591802388.0,
                    "replies": []
                },
                {
                    "body": "yes it is. Ive also come across later 20's women that want the spoiled GF route. Someone that takes them places, pays for their hair, nails, spa, and occasional shopping trips. Ive even met a mid 20's women that just wanted a FWB and didn't even want to go anywhere. It's definitely not a large percentage.. probably 5% at most, but you will come across it, and if you're the type of SD that doesnt talk arrangement details until after meeting, you just might meet someone that isnt looking an actual arrangement or allowance. I also feel that women sometimes go into a meet and greet, and will call an audible, based on how you look, and the connection you have, an may change what they're open to.",
                    "author": "ruphun",
                    "id": "ftjjm0p",
                    "parent_id": "t1_ftj7pah",
                    "score": -3,
                    "created_utc": 1591754647.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "My former SB even told me that she would have slept with me for free if I hadn't offered to pay her a PPM. She told me this weeks after our first intimate date. At the time I was even getting that vibe - she didn't want to talk about money until I kind of insisted to pay her the morning AFTER we slept together for the first time.\n\nI feel like alot of newbie women on SA come from a vanilla dating background and if they meet a guy they would conceivably vanilla date, they'll be fine with not being paid a PPM for the date as long as the guy pays for everything else, if they're attracted enough to the POT SD. At least, that's the vibe I got from her and I'm sure there were plenty of others like that. To get this \"deal\" it probably helps to be under 40 though.",
            "author": "mrjimmyjsz",
            "id": "ftn9rt0",
            "parent_id": "t1_ftj2fxy",
            "score": 3,
            "created_utc": 1591836729.0,
            "replies": [
                {
                    "body": "I’ve experienced that too. Definitely not under 40 though, closer to 50.  My previous SB wouldn’t even accept any money the first time we slept together.  In the first couple weeks she would only let me pay for things. We had very organic chemistry right from the meet and greet, so nothing was forced or negotiated . Intimacy happened very organically",
                    "author": "ruphun",
                    "id": "ftnbf3r",
                    "parent_id": "t1_ftn9rt0",
                    "score": 2,
                    "created_utc": 1591837648.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I'm talking to *2* women right now that do not want direct financial assistance as part of our dating.\n\nwhile this sounds great, in principle, it has also meant they have little urgency to schedule dates, and one has cancelled twice on short notice and the other has no call, no showed.\n\ngiving each a second chance, but I'm not getting my hopes up that either will turn into anything steady.",
            "author": "joc13",
            "id": "ftmb9ak",
            "parent_id": "t1_ftj2fxy",
            "score": 2,
            "created_utc": 1591819343.0,
            "replies": [
                {
                    "body": "That’s all part of the fun. I would still go on meet and greets & look for a SB if that’s what you want too. But see where these 2 pots go as well.\n\nI’ve had 3 vanillaish experiences on SA that ranged from 1 night to 3 months",
                    "author": "ruphun",
                    "id": "ftmf3nm",
                    "parent_id": "t1_ftmb9ak",
                    "score": 1,
                    "created_utc": 1591821189.0,
                    "replies": [
                        {
                            "body": "I'm still going to give them a chance. it is still fun to *court* women, even when there is going to be an allowance involved. and, if either of these two become something steady, I'd probably still end up spending the same amount of money on them, it would just be allocated differently.\n\nthe only downside is that a cancelled date wastes an evening that could have been scheduled with someone else.",
                            "author": "joc13",
                            "id": "ftmift7",
                            "parent_id": "t1_ftmf3nm",
                            "score": 2,
                            "created_utc": 1591822778.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I recently found an SB for my husband. About a quarter of the women I spoke with didn’t want any sort of allowance. I was very surprised.",
            "author": "affectionateSB",
            "id": "ftl707c",
            "parent_id": "t1_ftj2fxy",
            "score": 1,
            "created_utc": 1591799228.0,
            "replies": [
                {
                    "body": "My experience with this wasn’t this year, so possibly more women are using Seeking for vanilla dating with everything going on. It doesn’t surprise me,  many younger women are tired of all the F Boys, Broke guys, and guys that that don’t know how to treat a women",
                    "author": "ruphun",
                    "id": "ftlhdik",
                    "parent_id": "t1_ftl707c",
                    "score": 2,
                    "created_utc": 1591804964.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Its true, and Im not even one of these younger SDs that would be the type to use SA for that. Im late 40's, but look early 40's, fairly decent shape, not extremely hard on the eyes but definitely not a head turner. I just approach every POT on SA and say Im looking for a sugar relationship, but never discuss any arrangement details prior to meeting, except that I want someone thats available at least weekly for dates. By doing this, sometimes you meet someone that is open to something completely different, and as long as you're open to what they're looking, you just might experience something different.",
            "author": "ruphun",
            "id": "ftjk75q",
            "parent_id": "t1_ftjj7w2",
            "score": 3,
            "created_utc": 1591754997.0,
            "replies": []
        },
        {
            "body": "More than likely a scammer.",
            "author": "bsbdfw",
            "id": "ftkzvxg",
            "parent_id": "t1_ftjs78o",
            "score": 3,
            "created_utc": 1591795327.0,
            "replies": []
        },
        {
            "body": "Not really, not every guy has that kind of disposable income.",
            "author": null,
            "id": "ftm5w2v",
            "parent_id": "t1_ftk1e4d",
            "score": 1,
            "created_utc": 1591816814.0,
            "replies": []
        },
        {
            "body": "Laptop, phone perfect. I’ve been in similar situations, and honestly came to a new understanding of how expensive it is to be a girl!",
            "author": "daddoms",
            "id": "ftlf8p2",
            "parent_id": "t1_ftleqq3",
            "score": 1,
            "created_utc": 1591803900.0,
            "replies": []
        },
        {
            "body": "DEFINITELY.... this is why I went looking for an older man to have as an FWB and occasionally take me to dinner. I paid for all my college boyfriends everything and I just wanted a guy who could take care of himself, fuck me, and buy me dinner once in a while.",
            "author": null,
            "id": "ftlcmkh",
            "parent_id": "t1_ftj7pah",
            "score": 2,
            "created_utc": 1591802388.0,
            "replies": []
        },
        {
            "body": "yes it is. Ive also come across later 20's women that want the spoiled GF route. Someone that takes them places, pays for their hair, nails, spa, and occasional shopping trips. Ive even met a mid 20's women that just wanted a FWB and didn't even want to go anywhere. It's definitely not a large percentage.. probably 5% at most, but you will come across it, and if you're the type of SD that doesnt talk arrangement details until after meeting, you just might meet someone that isnt looking an actual arrangement or allowance. I also feel that women sometimes go into a meet and greet, and will call an audible, based on how you look, and the connection you have, an may change what they're open to.",
            "author": "ruphun",
            "id": "ftjjm0p",
            "parent_id": "t1_ftj7pah",
            "score": -3,
            "created_utc": 1591754647.0,
            "replies": []
        },
        {
            "body": "I’ve experienced that too. Definitely not under 40 though, closer to 50.  My previous SB wouldn’t even accept any money the first time we slept together.  In the first couple weeks she would only let me pay for things. We had very organic chemistry right from the meet and greet, so nothing was forced or negotiated . Intimacy happened very organically",
            "author": "ruphun",
            "id": "ftnbf3r",
            "parent_id": "t1_ftn9rt0",
            "score": 2,
            "created_utc": 1591837648.0,
            "replies": []
        },
        {
            "body": "That’s all part of the fun. I would still go on meet and greets & look for a SB if that’s what you want too. But see where these 2 pots go as well.\n\nI’ve had 3 vanillaish experiences on SA that ranged from 1 night to 3 months",
            "author": "ruphun",
            "id": "ftmf3nm",
            "parent_id": "t1_ftmb9ak",
            "score": 1,
            "created_utc": 1591821189.0,
            "replies": [
                {
                    "body": "I'm still going to give them a chance. it is still fun to *court* women, even when there is going to be an allowance involved. and, if either of these two become something steady, I'd probably still end up spending the same amount of money on them, it would just be allocated differently.\n\nthe only downside is that a cancelled date wastes an evening that could have been scheduled with someone else.",
                    "author": "joc13",
                    "id": "ftmift7",
                    "parent_id": "t1_ftmf3nm",
                    "score": 2,
                    "created_utc": 1591822778.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "My experience with this wasn’t this year, so possibly more women are using Seeking for vanilla dating with everything going on. It doesn’t surprise me,  many younger women are tired of all the F Boys, Broke guys, and guys that that don’t know how to treat a women",
            "author": "ruphun",
            "id": "ftlhdik",
            "parent_id": "t1_ftl707c",
            "score": 2,
            "created_utc": 1591804964.0,
            "replies": []
        },
        {
            "body": "I'm still going to give them a chance. it is still fun to *court* women, even when there is going to be an allowance involved. and, if either of these two become something steady, I'd probably still end up spending the same amount of money on them, it would just be allocated differently.\n\nthe only downside is that a cancelled date wastes an evening that could have been scheduled with someone else.",
            "author": "joc13",
            "id": "ftmift7",
            "parent_id": "t1_ftmf3nm",
            "score": 2,
            "created_utc": 1591822778.0,
            "replies": []
        }
    ]
}