{
    "title": "SB just texted that she miscarried this morning.",
    "post_id": "sjkcbq",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/sjkcbq/sb_just_texted_that_she_miscarried_this_morning/",
    "author": "chemistryromance",
    "body": "My SB of eight months just texted that she miscarried this morning and we didn't even know she was pregnant. She has always been on birth control. \n\nShe cancelled our date a few days ago, said she was feeling sick and generally unwell, then she said she also had cramps, we put it down to period pains and  seasonal flu and didn't think much of it at the time. \n\nJust in complete and utter shock. My circumstances don't allow me to go visit her immediately. She is sitting there upset and I am stuck here miles away, just a hopeless situation. \n\nDon't know what I should be doing? I will of course go and see her as soon as she is able to. I would appreciate any advice.",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/sjkcbq/sb_just_texted_that_she_miscarried_this_morning/",
    "score": 98,
    "upvote_ratio": 0.95,
    "created_utc": 1643897973.0,
    "num_comments": 66,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "Don't go quiet. Your goal in life is to make sure she doesn't feel alone. Especially since this is a sugar relationship and she might not be able to talk to anyone else about it.\n\nTalk to her, respond quickly, listen. If you can't be there in person, get away long enough for a call. You job on the call isn't to fix anything (I know as men we always want to do that), its just to be there for her.\n\nAsk if there is anything you can do. She will probably say nothing, but ask anyway.\n\nCheck in with her once a day and see how she is doing.\n\nYou can't \"fix\" it. But you can make sure she isn't alone.",
            "author": "TwerkingAvocado",
            "id": "hvfautq",
            "parent_id": "t3_sjkcbq",
            "score": 111,
            "created_utc": 1643899435.0,
            "replies": [
                {
                    "body": "Thank you, yes I am in touch with her continuously. She is too upset and unwell to talk on the phone right now.",
                    "author": "chemistryromance",
                    "id": "hvfehbu",
                    "parent_id": "t1_hvfautq",
                    "score": 35,
                    "created_utc": 1643900911.0,
                    "replies": [
                        {
                            "body": "That's fair. When she is ready, be there.",
                            "author": "TwerkingAvocado",
                            "id": "hvfin2p",
                            "parent_id": "t1_hvfehbu",
                            "score": 15,
                            "created_utc": 1643902526.0,
                            "replies": [
                                {
                                    "body": "Thank you yes, meeting her today. It will be emotional and I will be there for her as much as she needs me.",
                                    "author": "chemistryromance",
                                    "id": "hvj8g5k",
                                    "parent_id": "t1_hvfin2p",
                                    "score": 7,
                                    "created_utc": 1643959134.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "we need more men like u 🥺❤️",
                    "author": "Meancuisine_",
                    "id": "hvh0ttx",
                    "parent_id": "t1_hvfautq",
                    "score": 5,
                    "created_utc": 1643922648.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Use one of the delivery apps to send her a care package (heating pad for cramps, favorite foods, etc.) and let her know you're aiming to go see her when you can.",
            "author": "MistressMM",
            "id": "hvf9w83",
            "parent_id": "t3_sjkcbq",
            "score": 42,
            "created_utc": 1643899033.0,
            "replies": [
                {
                    "body": "Just wanted to come back and say thanks for the kind words. I have arranged to see her tomorrow now. I was a bit lost for words at the time and thanks was all I could muster.",
                    "author": "chemistryromance",
                    "id": "hvft0zj",
                    "parent_id": "t1_hvf9w83",
                    "score": 19,
                    "created_utc": 1643906392.0,
                    "replies": []
                },
                {
                    "body": "I agree that sending a little care package would be great.  Since you can't be there in person, it will show how much you care.",
                    "author": "tragic_realiTi",
                    "id": "hvfamn6",
                    "parent_id": "t1_hvf9w83",
                    "score": 14,
                    "created_utc": 1643899340.0,
                    "replies": []
                },
                {
                    "body": "Thank you.",
                    "author": "chemistryromance",
                    "id": "hvfadvh",
                    "parent_id": "t1_hvf9w83",
                    "score": 8,
                    "created_utc": 1643899239.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "hvfc6j0",
            "parent_id": "t3_sjkcbq",
            "score": 25,
            "created_utc": 1643899983.0,
            "replies": [
                {
                    "body": "Thank you.",
                    "author": "chemistryromance",
                    "id": "hvfej73",
                    "parent_id": "t1_hvfc6j0",
                    "score": 7,
                    "created_utc": 1643900932.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "hvfrpkw",
            "parent_id": "t3_sjkcbq",
            "score": 11,
            "created_utc": 1643905915.0,
            "replies": [
                {
                    "body": "Thank you, yes I know what you mean. I would hate for her to go through this on her own.",
                    "author": "chemistryromance",
                    "id": "hvg3y8q",
                    "parent_id": "t1_hvfrpkw",
                    "score": 2,
                    "created_utc": 1643910338.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "wow all around. i say just be there for her as much as you can maybe offer to order her some food over the next few days so she doesn’t have to worry about cooking and cleanup. then be emotionally vulnerable with her together in person when you can.",
            "author": "ValueFuck",
            "id": "hvf8mae",
            "parent_id": "t3_sjkcbq",
            "score": 21,
            "created_utc": 1643898492.0,
            "replies": [
                {
                    "body": "Thank you",
                    "author": "chemistryromance",
                    "id": "hvfa9po",
                    "parent_id": "t1_hvf8mae",
                    "score": 7,
                    "created_utc": 1643899190.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Just know that even the best birth control can fail and most women don’t know that they’re pregnant until 6-8 weeks in at the earliest. This may have been as much of a surprise for her as it is you. \n\nCall her, talk to her, do your best to support her like a vanilla partner would. Hold a safe space for her to talk if she needs to, encourage her to get support from a therapist. A miscarriage can be grief-inducing and she’ll need to work through it. \n\nSuggest simple things like do you need me to order you food? Would you like to FaceTime while I’m away and just have my presence? \n\nSimply, support her like you would a vanilla partner that is grieving and make sure her basic needs are taken care of. Food, water, comfort, safety, and love ❤️ \n\nSo sorry to hear you’re in this situation. It must be very hard for both of you and I’m wishing you both a bright road ahead ❤️",
            "author": "SatansBirthdayCake",
            "id": "hvf90ph",
            "parent_id": "t3_sjkcbq",
            "score": 17,
            "created_utc": 1643898663.0,
            "replies": [
                {
                    "body": "I was in too much of a shock to reply properly at that time but just wanted to say that your comment allowed me to see things from her point of view which was very helpful. We have arranged to meet tomorrow now. Thanks for the kind words.",
                    "author": "chemistryromance",
                    "id": "hvfrokd",
                    "parent_id": "t1_hvf90ph",
                    "score": 7,
                    "created_utc": 1643905904.0,
                    "replies": []
                },
                {
                    "body": "Simply seconding. We thought I ruptured a cyst, because I was on the depro shot, but it was an etopic pregnancy. Sometimes you really just have no idea you're pregnant.",
                    "author": "hone_ypig",
                    "id": "hvg9sed",
                    "parent_id": "t1_hvf90ph",
                    "score": 6,
                    "created_utc": 1643912430.0,
                    "replies": []
                },
                {
                    "body": "Thank you.",
                    "author": "chemistryromance",
                    "id": "hvfac5s",
                    "parent_id": "t1_hvf90ph",
                    "score": 4,
                    "created_utc": 1643899219.0,
                    "replies": [
                        {
                            "body": "You might offer to purchase a talkspace or one of the other therapy subscriptions for her as well.",
                            "author": "MistressMM",
                            "id": "hvffgjx",
                            "parent_id": "t1_hvfac5s",
                            "score": 4,
                            "created_utc": 1643901298.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Talk to her. If in person is not possible right now, call her. Try to be understanding of her wants and needs during the next days and weeks. Maybe just hang out a few times without having sex, if you are close.\n\nThe most important thing is that you have the right attitude when you talk to her. Just from your post, I conclude that you have it.",
            "author": "Inner_Examination_38",
            "id": "hvfa9hc",
            "parent_id": "t3_sjkcbq",
            "score": 7,
            "created_utc": 1643899187.0,
            "replies": [
                {
                    "body": "Thank you",
                    "author": "chemistryromance",
                    "id": "hvfe22y",
                    "parent_id": "t1_hvfa9hc",
                    "score": 2,
                    "created_utc": 1643900744.0,
                    "replies": []
                },
                {
                    "body": "Just wanted to return and say thanks for the kind words and your comment was very helpful. I was in too much of a shock at that time to respond properly.",
                    "author": "chemistryromance",
                    "id": "hvjavie",
                    "parent_id": "t1_hvfa9hc",
                    "score": 2,
                    "created_utc": 1643960841.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "hvfxesm",
            "parent_id": "t3_sjkcbq",
            "score": 7,
            "created_utc": 1643907979.0,
            "replies": [
                {
                    "body": "Thank you,all very good points. She was nine weeks gone.",
                    "author": "chemistryromance",
                    "id": "hvggj4o",
                    "parent_id": "t1_hvfxesm",
                    "score": 2,
                    "created_utc": 1643914847.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Life often throws curve balls.  These are the things that draw people closer to each other.",
            "author": "HappyBear1952",
            "id": "hvgj8jo",
            "parent_id": "t3_sjkcbq",
            "score": 7,
            "created_utc": 1643915857.0,
            "replies": [
                {
                    "body": "Thank you, that is beautiful.",
                    "author": "chemistryromance",
                    "id": "hvgoxkp",
                    "parent_id": "t1_hvgj8jo",
                    "score": 3,
                    "created_utc": 1643917999.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "So there's going to be a lot going on with her right now, mentally, physically, and hormonally. I'd say be there for her, be patient, and communicate very openly and honestly on what she needs from you. I know that sex is expected from an SB but for now back off when it comes to that and wait for her to initiate any of it when she's ready.",
            "author": "Charming-Eye-1309",
            "id": "hvjede7",
            "parent_id": "t3_sjkcbq",
            "score": 5,
            "created_utc": 1643963433.0,
            "replies": [
                {
                    "body": "Thank you, yes I have made sure she is comfortable and I am around and will be seeing her throughout the next week. She is not alone in this. Sex is the last thing on my mind. Our arrangement will be platonic until she is fully ready.",
                    "author": "chemistryromance",
                    "id": "hvopo9w",
                    "parent_id": "t1_hvjede7",
                    "score": 3,
                    "created_utc": 1644059356.0,
                    "replies": [
                        {
                            "body": "Thank you <3 I'm glad she has an understanding SD like you. Honestly if she seems like she's having a rough time I might encourage her to see a therapist? But I'm also of the opinion that everyone can benefit from seeing a therapist if they have the option to",
                            "author": "Charming-Eye-1309",
                            "id": "hvoptjb",
                            "parent_id": "t1_hvopo9w",
                            "score": 2,
                            "created_utc": 1644059478.0,
                            "replies": [
                                {
                                    "body": "I fell in love with her sometime ago so this is more than an arrangement for me. I will suggest therapty to her in a week or two and I agree, she might benefit from it, there is too much to process. Thanks for the kind words.",
                                    "author": "chemistryromance",
                                    "id": "hvoq48m",
                                    "parent_id": "t1_hvoptjb",
                                    "score": 2,
                                    "created_utc": 1644059723.0,
                                    "replies": [
                                        {
                                            "body": "No problem <3 thank you for the kind actions and I hope everything turns out okay",
                                            "author": "Charming-Eye-1309",
                                            "id": "hvoq6xg",
                                            "parent_id": "t1_hvoq48m",
                                            "score": 2,
                                            "created_utc": 1644059783.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Send flowers, food, and anything else you know would comfort her",
            "author": "Cledaddy23",
            "id": "hvfhh2a",
            "parent_id": "t3_sjkcbq",
            "score": 4,
            "created_utc": 1643902076.0,
            "replies": [
                {
                    "body": "Thank you",
                    "author": "chemistryromance",
                    "id": "hvfqozq",
                    "parent_id": "t1_hvfhh2a",
                    "score": 1,
                    "created_utc": 1643905545.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I obviously don’t know what circumstances are stopping you from going to her or how long they will last or how clearly you’re thinking but can you possibly get out of them? And just go to her? Tell work a personal crisis came up or feign illness or tell whoever you’re with something else?",
            "author": "SBerryTrifle",
            "id": "hvfhost",
            "parent_id": "t3_sjkcbq",
            "score": 3,
            "created_utc": 1643902160.0,
            "replies": [
                {
                    "body": "Trifle yes, I am out of the initial shock now and we have arranged to meet tomorrow afternoon. She said it's painful when she moves and is understanably feeling drained.",
                    "author": "chemistryromance",
                    "id": "hvfqnfe",
                    "parent_id": "t1_hvfhost",
                    "score": 4,
                    "created_utc": 1643905529.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "This happened to me (not by a SD but unexpected miscarriage at around the same stage), I feel sorry for her. Can you send her some flowers or other things she likes? Don't pressure her to go places or do things, she can have symptoms for a few weeks. \n\nI physically felt like crap for quite a while. It took around 3 weeks to be totally finished and then have all the remaining tissue removed, then I didn't really feel like myself for around 8 weeks until my period came back. Felt very weak physically from the blood loss and needed time to build myself back up.\n\nMy then-BF started trying to have sex with me less than 1 week after the D&C  😐 I had not even finished cramping. Started trying to make me feel guilty for \"neglecting him\" then turned it around that it would make me feel better. Then constantly went on more about how devasted *he* was and how alone he felt, to me. Don't be like that guy. \n\nI wouldn't have kept it anyway, but it was still very upsetting. I was on the pill and I didn't notice any changes so it was really disorienting and made me feel alienated from my body.  I'd avoid jokes and comments about not being stuck with kids unless she makes them.",
            "author": "OneCanToucanThreeCan",
            "id": "hvjkkhz",
            "parent_id": "t3_sjkcbq",
            "score": 4,
            "created_utc": 1643968350.0,
            "replies": [
                {
                    "body": "Thank you for the kind words and I am so sorry this happened to you and the bad experience with your bf at that time, sounds awful. Your experience helps me understand what she might be going through and feeling. I love her and I am full supportive. I have made sure that she is comfortable.",
                    "author": "chemistryromance",
                    "id": "hvopduj",
                    "parent_id": "t1_hvjkkhz",
                    "score": 3,
                    "created_utc": 1644059121.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Just be as supportive as possible 🙂",
            "author": "Bitterway_3097",
            "id": "hvf9wxw",
            "parent_id": "t3_sjkcbq",
            "score": 6,
            "created_utc": 1643899041.0,
            "replies": [
                {
                    "body": "Thank you",
                    "author": "chemistryromance",
                    "id": "hvfe0je",
                    "parent_id": "t1_hvf9wxw",
                    "score": 2,
                    "created_utc": 1643900727.0,
                    "replies": [
                        {
                            "body": "Your welcome I wish you both the very best",
                            "author": "Bitterway_3097",
                            "id": "hvfegfl",
                            "parent_id": "t1_hvfe0je",
                            "score": 3,
                            "created_utc": 1643900900.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "What circumstances aren't allowing you to be there? If there's a will there's a way. I think you can get to her somehow and if so, just be there for a day. Miscarriages and even abortions suck to go through alone. Especially when they didn't put themselves in that situation alone you know",
            "author": "NeatClean3715",
            "id": "hvgwa2f",
            "parent_id": "t3_sjkcbq",
            "score": 2,
            "created_utc": 1643920860.0,
            "replies": [
                {
                    "body": "I am out of town and when I told her I will drive down she said she can't meet today because she is still bleeding heavily and it's painful every time she moves. We are meeting tomorrow afternoon now.",
                    "author": "chemistryromance",
                    "id": "hvgxwwz",
                    "parent_id": "t1_hvgwa2f",
                    "score": 1,
                    "created_utc": 1643921539.0,
                    "replies": []
                },
                {
                    "body": "I am out of town and when I told her I will drive down she said she can't meet today because she is still bleeding heavily and it's painful every time she moves. We are meeting tomorrow afternoon now.",
                    "author": "chemistryromance",
                    "id": "hvgy77w",
                    "parent_id": "t1_hvgwa2f",
                    "score": 1,
                    "created_utc": 1643921661.0,
                    "replies": [
                        {
                            "body": "Can you go to her place or is she at the hospital? If she’s bleeding too heavily to move easily today then I wouldn’t have her go out tomorrow. She should maybe be resting and taking it easy? Or what about booking a nice hotel for tomorrow (and maybe today and the day after tomorrow if she wants) where she can relax and have a bath and get room service and not have to worry about doing much? And sending a car for her? Then you could have privacy and hang out tomorrow and if she feels bad or like crying that could be a better place to do it than in public? And chances are good she’ll want to talk for a while or only sporadically and then / otherwise want to be distracted and cuddled and will be too tired to talk or be entertaining so you can lay down together and watch movies or something.",
                            "author": "SBerryTrifle",
                            "id": "hvh3oiw",
                            "parent_id": "t1_hvgy77w",
                            "score": 3,
                            "created_utc": 1643923696.0,
                            "replies": [
                                {
                                    "body": "Yes, the Doctors have asked her to be on bed rest today. She was nine weeks gone so it is a bit more serious than an earlier miscarriage. She might need further treatment if the bleeding doesn't stop. So for tomorrow, I am going to pick her up and depending on how she is feeling, we might just sit in the car, drive around and get some food or book a hotel and spend some time there but I just don't how she will be feeling tomorrow and I don't want to put too much pressure on her tonight because then she will start thinking about tomorrow and stress herself out. I can't go to her place because she has housemates. \n\nYou are right, it will be emotional, I hadn't thought of that and maybe I should be better prepared to not be in public place. Thank you though, all good points that will be helpful tomorrow. I particularly like the idea of her being able to relax in a hotel room and that will be the best option if she is well enough.",
                                    "author": "chemistryromance",
                                    "id": "hvh8j4n",
                                    "parent_id": "t1_hvh3oiw",
                                    "score": 3,
                                    "created_utc": 1643925501.0,
                                    "replies": [
                                        {
                                            "body": "Hopefully you’re with her now and everything is ok. I’m sure the two of you can figure out what works best but it might be worth considering keeping her in a hotel the next few days if that’s a better place for her to recover and possibly paying for a private therapist / counselor for her to talk to if there’s a long wait for a public one. Possible you could talk to someone as well. Good luck and I hope she feels better soon!",
                                            "author": "SBerryTrifle",
                                            "id": "hvmmatq",
                                            "parent_id": "t1_hvh8j4n",
                                            "score": 2,
                                            "created_utc": 1644016339.0,
                                            "replies": [
                                                {
                                                    "body": "Thank you so much, yes, she was too weak to go anywhere so we just sat in the car. It was really hard, she is broken up physically and emotionally and still hasn't had a chance to fully process everything. The first time she realised she was pregnant was when she was holding the dead foetus in her hands. I can't even imagine how  traumatic that must have been. Her healing will take time but she has been checked by Doctors and seems to be following the natural course of recovery after miscarriage. \n\nI have made sure she is comfortable and plan to see her throughout next week. I love her and care about her a lot. Counselling is not a bad idea and I will suggest this to her in a week or two. Will do a follow on Post today or tomorrow.",
                                                    "author": "chemistryromance",
                                                    "id": "hvoowww",
                                                    "parent_id": "t1_hvmmatq",
                                                    "score": 1,
                                                    "created_utc": 1644058742.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "First, how are you doing? Whether it was your baby or not, you have some emotional attachment to her and should take care of your own emotional health also.\n\nI would send flowers and a sympathy card immediately.  I would also arrange for a week of meals to be delivered. I would send her some of her favorite foods, but I wouldn't ask her about sending it, rather I would just let her know they're coming (depending on her living situation). Then, I would ask her about her other needs and take care of them as much as possible. Finally, I would want to arrange a personal visit as soon as possible.\n\nYou both need to talk about how to avoid this situation in the future and what to do should it happen again. If both of you have not taken steps to avoid pregnancy, then there is always a possibility this could happen again.",
            "author": "GACyberCool",
            "id": "hvfg50y",
            "parent_id": "t3_sjkcbq",
            "score": 2,
            "created_utc": 1643901563.0,
            "replies": [
                {
                    "body": "It's hit me a lot harder then I thought it would, thanks for asking. Yes, the baby was mine and I am in love with her, although she doesn't know. I am out of the initial shock now, thinking a bit more clearly and trying to arrange to meet. Good point about having a discussion on how to avoid this scenario, this was not in my mind. Thanks for the advice and kind words.",
                    "author": "chemistryromance",
                    "id": "hvfp5oc",
                    "parent_id": "t1_hvfg50y",
                    "score": 3,
                    "created_utc": 1643904985.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Has she asked you for anything? This has happened to me twice in the dozen years in the bowl; both times completely fake. Each time after a couple of weeks my SB at the time asked for compensation for her pain and suffering. Just be aware that this kind of thing does occur",
            "author": "lessgeo",
            "id": "hvfwqjg",
            "parent_id": "t3_sjkcbq",
            "score": 2,
            "created_utc": 1643907733.0,
            "replies": [
                {
                    "body": "In the eight months we have been together, she has never ever asked me for anything. Even when I have given her expensive gift options for birthday etc. she asked me to get her a single bed frame instead because her bed was broken and the landlord wouldn't change it. I spoil her in different ways and have a lot of respect for her.",
                    "author": "chemistryromance",
                    "id": "hvgkm2u",
                    "parent_id": "t1_hvfwqjg",
                    "score": 5,
                    "created_utc": 1643916374.0,
                    "replies": [
                        {
                            "body": "One in a million!!! You are a lucky man",
                            "author": "lessgeo",
                            "id": "hvglyqg",
                            "parent_id": "t1_hvgkm2u",
                            "score": 2,
                            "created_utc": 1643916885.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "I agree! This is an old trick used in the bad neighborhoods of sugar and even vanilla. Plus how do we know it was OP and not someone else who was responsible to get her pregnant.",
                    "author": null,
                    "id": "hvfyoq5",
                    "parent_id": "t1_hvfwqjg",
                    "score": 1,
                    "created_utc": 1643908449.0,
                    "replies": [
                        {
                            "body": "Precisely",
                            "author": "lessgeo",
                            "id": "hvfyuvv",
                            "parent_id": "t1_hvfyoq5",
                            "score": -1,
                            "created_utc": 1643908512.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "All of the supportive stuff described in other posts AND be aware that this would be a great start to a scam if it is one.",
            "author": "TY2022",
            "id": "hvfiy8b",
            "parent_id": "t3_sjkcbq",
            "score": -3,
            "created_utc": 1643902646.0,
            "replies": [
                {
                    "body": "Thank you. We have been together for a while now and I know her quite well and trust her.",
                    "author": "chemistryromance",
                    "id": "hvfphb2",
                    "parent_id": "t1_hvfiy8b",
                    "score": 5,
                    "created_utc": 1643905105.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "First thing I'd do Is fall on my knees and say Thank you baby Jesus....",
            "author": "princelydeeds",
            "id": "hvgxtqs",
            "parent_id": "t3_sjkcbq",
            "score": -2,
            "created_utc": 1643921484.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "hvfumbh",
            "parent_id": "t3_sjkcbq",
            "score": -5,
            "created_utc": 1643906970.0,
            "replies": [
                {
                    "body": "Yes, that’s right. She had an 8 month intimate relationship with him so that she could pretend to go through this heartbreaking situation and con him into sending her a sweet sweet bouquet of flowers.\n\n/s",
                    "author": "TwerkingAvocado",
                    "id": "hvhzyg9",
                    "parent_id": "t1_hvfumbh",
                    "score": 6,
                    "created_utc": 1643936712.0,
                    "replies": []
                },
                {
                    "body": "I agree. Old age trick practiced by frauds!",
                    "author": null,
                    "id": "hvfyrkc",
                    "parent_id": "t1_hvfumbh",
                    "score": -2,
                    "created_utc": 1643908478.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "If it was your baby you escaped a bullet.",
            "author": "GSSD",
            "id": "hvfd6uz",
            "parent_id": "t3_sjkcbq",
            "score": -19,
            "created_utc": 1643900394.0,
            "replies": [
                {
                    "body": "Don’t think that’s what OPs looking to hear here...",
                    "author": "bacongrilledcheese18",
                    "id": "hvfehf3",
                    "parent_id": "t1_hvfd6uz",
                    "score": 10,
                    "created_utc": 1643900912.0,
                    "replies": [
                        {
                            "body": "What SD wants a baby with a SB? If he said my SO or SGF then I would get it.",
                            "author": "GSSD",
                            "id": "hvfetdc",
                            "parent_id": "t1_hvfehf3",
                            "score": -8,
                            "created_utc": 1643901044.0,
                            "replies": [
                                {
                                    "body": "It’s still perfectly natural and normal to grieve the unexpected loss. \n\nChoosing not to carry a pregnancy is one term. Having that choice taken from you is an entirely different kettle of fish.",
                                    "author": "jupiterLILY",
                                    "id": "hvfgdef",
                                    "parent_id": "t1_hvfetdc",
                                    "score": 6,
                                    "created_utc": 1643901653.0,
                                    "replies": [
                                        {
                                            "body": "> Having that choice taken \n\nAt least it was nature's way and not an active choice.",
                                            "author": "GSSD",
                                            "id": "hvfv8xb",
                                            "parent_id": "t1_hvfgdef",
                                            "score": -2,
                                            "created_utc": 1643907195.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "Me I wanted a baby with my SB.",
                                    "author": "TonyStarkSD",
                                    "id": "hvgwv5j",
                                    "parent_id": "t1_hvfetdc",
                                    "score": 1,
                                    "created_utc": 1643921096.0,
                                    "replies": [
                                        {
                                            "body": "Did you have one together ? Are you still together ? Do you live together? Do you have generous visitation?\n\nAll questions you might not want to discuss but just curious.",
                                            "author": "GSSD",
                                            "id": "hvh00jg",
                                            "parent_id": "t1_hvgwv5j",
                                            "score": 0,
                                            "created_utc": 1643922347.0,
                                            "replies": [
                                                {
                                                    "body": "Yeah we have a fake baby, she's so cute.\n\nNo what happened is I told her I wanted more kids, so when I left she faked a pregnancy.\n\nAll water under a bridge now, but I think she enjoyed hurting me.",
                                                    "author": "TonyStarkSD",
                                                    "id": "hvh1yrz",
                                                    "parent_id": "t1_hvh00jg",
                                                    "score": 1,
                                                    "created_utc": 1643923069.0,
                                                    "replies": [
                                                        {
                                                            "body": "Cruel",
                                                            "author": "GSSD",
                                                            "id": "hvh3863",
                                                            "parent_id": "t1_hvh1yrz",
                                                            "score": 1,
                                                            "created_utc": 1643923528.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Thank you, yes I am in touch with her continuously. She is too upset and unwell to talk on the phone right now.",
            "author": "chemistryromance",
            "id": "hvfehbu",
            "parent_id": "t1_hvfautq",
            "score": 35,
            "created_utc": 1643900911.0,
            "replies": [
                {
                    "body": "That's fair. When she is ready, be there.",
                    "author": "TwerkingAvocado",
                    "id": "hvfin2p",
                    "parent_id": "t1_hvfehbu",
                    "score": 15,
                    "created_utc": 1643902526.0,
                    "replies": [
                        {
                            "body": "Thank you yes, meeting her today. It will be emotional and I will be there for her as much as she needs me.",
                            "author": "chemistryromance",
                            "id": "hvj8g5k",
                            "parent_id": "t1_hvfin2p",
                            "score": 7,
                            "created_utc": 1643959134.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "we need more men like u 🥺❤️",
            "author": "Meancuisine_",
            "id": "hvh0ttx",
            "parent_id": "t1_hvfautq",
            "score": 5,
            "created_utc": 1643922648.0,
            "replies": []
        },
        {
            "body": "Just wanted to come back and say thanks for the kind words. I have arranged to see her tomorrow now. I was a bit lost for words at the time and thanks was all I could muster.",
            "author": "chemistryromance",
            "id": "hvft0zj",
            "parent_id": "t1_hvf9w83",
            "score": 19,
            "created_utc": 1643906392.0,
            "replies": []
        },
        {
            "body": "I agree that sending a little care package would be great.  Since you can't be there in person, it will show how much you care.",
            "author": "tragic_realiTi",
            "id": "hvfamn6",
            "parent_id": "t1_hvf9w83",
            "score": 14,
            "created_utc": 1643899340.0,
            "replies": []
        },
        {
            "body": "Thank you.",
            "author": "chemistryromance",
            "id": "hvfadvh",
            "parent_id": "t1_hvf9w83",
            "score": 8,
            "created_utc": 1643899239.0,
            "replies": []
        },
        {
            "body": "Thank you.",
            "author": "chemistryromance",
            "id": "hvfej73",
            "parent_id": "t1_hvfc6j0",
            "score": 7,
            "created_utc": 1643900932.0,
            "replies": []
        },
        {
            "body": "Thank you, yes I know what you mean. I would hate for her to go through this on her own.",
            "author": "chemistryromance",
            "id": "hvg3y8q",
            "parent_id": "t1_hvfrpkw",
            "score": 2,
            "created_utc": 1643910338.0,
            "replies": []
        },
        {
            "body": "Thank you",
            "author": "chemistryromance",
            "id": "hvfa9po",
            "parent_id": "t1_hvf8mae",
            "score": 7,
            "created_utc": 1643899190.0,
            "replies": []
        },
        {
            "body": "I was in too much of a shock to reply properly at that time but just wanted to say that your comment allowed me to see things from her point of view which was very helpful. We have arranged to meet tomorrow now. Thanks for the kind words.",
            "author": "chemistryromance",
            "id": "hvfrokd",
            "parent_id": "t1_hvf90ph",
            "score": 7,
            "created_utc": 1643905904.0,
            "replies": []
        },
        {
            "body": "Simply seconding. We thought I ruptured a cyst, because I was on the depro shot, but it was an etopic pregnancy. Sometimes you really just have no idea you're pregnant.",
            "author": "hone_ypig",
            "id": "hvg9sed",
            "parent_id": "t1_hvf90ph",
            "score": 6,
            "created_utc": 1643912430.0,
            "replies": []
        },
        {
            "body": "Thank you.",
            "author": "chemistryromance",
            "id": "hvfac5s",
            "parent_id": "t1_hvf90ph",
            "score": 4,
            "created_utc": 1643899219.0,
            "replies": [
                {
                    "body": "You might offer to purchase a talkspace or one of the other therapy subscriptions for her as well.",
                    "author": "MistressMM",
                    "id": "hvffgjx",
                    "parent_id": "t1_hvfac5s",
                    "score": 4,
                    "created_utc": 1643901298.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Thank you",
            "author": "chemistryromance",
            "id": "hvfe22y",
            "parent_id": "t1_hvfa9hc",
            "score": 2,
            "created_utc": 1643900744.0,
            "replies": []
        },
        {
            "body": "Just wanted to return and say thanks for the kind words and your comment was very helpful. I was in too much of a shock at that time to respond properly.",
            "author": "chemistryromance",
            "id": "hvjavie",
            "parent_id": "t1_hvfa9hc",
            "score": 2,
            "created_utc": 1643960841.0,
            "replies": []
        },
        {
            "body": "Thank you,all very good points. She was nine weeks gone.",
            "author": "chemistryromance",
            "id": "hvggj4o",
            "parent_id": "t1_hvfxesm",
            "score": 2,
            "created_utc": 1643914847.0,
            "replies": []
        },
        {
            "body": "Thank you, that is beautiful.",
            "author": "chemistryromance",
            "id": "hvgoxkp",
            "parent_id": "t1_hvgj8jo",
            "score": 3,
            "created_utc": 1643917999.0,
            "replies": []
        },
        {
            "body": "Thank you, yes I have made sure she is comfortable and I am around and will be seeing her throughout the next week. She is not alone in this. Sex is the last thing on my mind. Our arrangement will be platonic until she is fully ready.",
            "author": "chemistryromance",
            "id": "hvopo9w",
            "parent_id": "t1_hvjede7",
            "score": 3,
            "created_utc": 1644059356.0,
            "replies": [
                {
                    "body": "Thank you <3 I'm glad she has an understanding SD like you. Honestly if she seems like she's having a rough time I might encourage her to see a therapist? But I'm also of the opinion that everyone can benefit from seeing a therapist if they have the option to",
                    "author": "Charming-Eye-1309",
                    "id": "hvoptjb",
                    "parent_id": "t1_hvopo9w",
                    "score": 2,
                    "created_utc": 1644059478.0,
                    "replies": [
                        {
                            "body": "I fell in love with her sometime ago so this is more than an arrangement for me. I will suggest therapty to her in a week or two and I agree, she might benefit from it, there is too much to process. Thanks for the kind words.",
                            "author": "chemistryromance",
                            "id": "hvoq48m",
                            "parent_id": "t1_hvoptjb",
                            "score": 2,
                            "created_utc": 1644059723.0,
                            "replies": [
                                {
                                    "body": "No problem <3 thank you for the kind actions and I hope everything turns out okay",
                                    "author": "Charming-Eye-1309",
                                    "id": "hvoq6xg",
                                    "parent_id": "t1_hvoq48m",
                                    "score": 2,
                                    "created_utc": 1644059783.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Thank you",
            "author": "chemistryromance",
            "id": "hvfqozq",
            "parent_id": "t1_hvfhh2a",
            "score": 1,
            "created_utc": 1643905545.0,
            "replies": []
        },
        {
            "body": "Trifle yes, I am out of the initial shock now and we have arranged to meet tomorrow afternoon. She said it's painful when she moves and is understanably feeling drained.",
            "author": "chemistryromance",
            "id": "hvfqnfe",
            "parent_id": "t1_hvfhost",
            "score": 4,
            "created_utc": 1643905529.0,
            "replies": []
        },
        {
            "body": "Thank you for the kind words and I am so sorry this happened to you and the bad experience with your bf at that time, sounds awful. Your experience helps me understand what she might be going through and feeling. I love her and I am full supportive. I have made sure that she is comfortable.",
            "author": "chemistryromance",
            "id": "hvopduj",
            "parent_id": "t1_hvjkkhz",
            "score": 3,
            "created_utc": 1644059121.0,
            "replies": []
        },
        {
            "body": "Thank you",
            "author": "chemistryromance",
            "id": "hvfe0je",
            "parent_id": "t1_hvf9wxw",
            "score": 2,
            "created_utc": 1643900727.0,
            "replies": [
                {
                    "body": "Your welcome I wish you both the very best",
                    "author": "Bitterway_3097",
                    "id": "hvfegfl",
                    "parent_id": "t1_hvfe0je",
                    "score": 3,
                    "created_utc": 1643900900.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I am out of town and when I told her I will drive down she said she can't meet today because she is still bleeding heavily and it's painful every time she moves. We are meeting tomorrow afternoon now.",
            "author": "chemistryromance",
            "id": "hvgxwwz",
            "parent_id": "t1_hvgwa2f",
            "score": 1,
            "created_utc": 1643921539.0,
            "replies": []
        },
        {
            "body": "I am out of town and when I told her I will drive down she said she can't meet today because she is still bleeding heavily and it's painful every time she moves. We are meeting tomorrow afternoon now.",
            "author": "chemistryromance",
            "id": "hvgy77w",
            "parent_id": "t1_hvgwa2f",
            "score": 1,
            "created_utc": 1643921661.0,
            "replies": [
                {
                    "body": "Can you go to her place or is she at the hospital? If she’s bleeding too heavily to move easily today then I wouldn’t have her go out tomorrow. She should maybe be resting and taking it easy? Or what about booking a nice hotel for tomorrow (and maybe today and the day after tomorrow if she wants) where she can relax and have a bath and get room service and not have to worry about doing much? And sending a car for her? Then you could have privacy and hang out tomorrow and if she feels bad or like crying that could be a better place to do it than in public? And chances are good she’ll want to talk for a while or only sporadically and then / otherwise want to be distracted and cuddled and will be too tired to talk or be entertaining so you can lay down together and watch movies or something.",
                    "author": "SBerryTrifle",
                    "id": "hvh3oiw",
                    "parent_id": "t1_hvgy77w",
                    "score": 3,
                    "created_utc": 1643923696.0,
                    "replies": [
                        {
                            "body": "Yes, the Doctors have asked her to be on bed rest today. She was nine weeks gone so it is a bit more serious than an earlier miscarriage. She might need further treatment if the bleeding doesn't stop. So for tomorrow, I am going to pick her up and depending on how she is feeling, we might just sit in the car, drive around and get some food or book a hotel and spend some time there but I just don't how she will be feeling tomorrow and I don't want to put too much pressure on her tonight because then she will start thinking about tomorrow and stress herself out. I can't go to her place because she has housemates. \n\nYou are right, it will be emotional, I hadn't thought of that and maybe I should be better prepared to not be in public place. Thank you though, all good points that will be helpful tomorrow. I particularly like the idea of her being able to relax in a hotel room and that will be the best option if she is well enough.",
                            "author": "chemistryromance",
                            "id": "hvh8j4n",
                            "parent_id": "t1_hvh3oiw",
                            "score": 3,
                            "created_utc": 1643925501.0,
                            "replies": [
                                {
                                    "body": "Hopefully you’re with her now and everything is ok. I’m sure the two of you can figure out what works best but it might be worth considering keeping her in a hotel the next few days if that’s a better place for her to recover and possibly paying for a private therapist / counselor for her to talk to if there’s a long wait for a public one. Possible you could talk to someone as well. Good luck and I hope she feels better soon!",
                                    "author": "SBerryTrifle",
                                    "id": "hvmmatq",
                                    "parent_id": "t1_hvh8j4n",
                                    "score": 2,
                                    "created_utc": 1644016339.0,
                                    "replies": [
                                        {
                                            "body": "Thank you so much, yes, she was too weak to go anywhere so we just sat in the car. It was really hard, she is broken up physically and emotionally and still hasn't had a chance to fully process everything. The first time she realised she was pregnant was when she was holding the dead foetus in her hands. I can't even imagine how  traumatic that must have been. Her healing will take time but she has been checked by Doctors and seems to be following the natural course of recovery after miscarriage. \n\nI have made sure she is comfortable and plan to see her throughout next week. I love her and care about her a lot. Counselling is not a bad idea and I will suggest this to her in a week or two. Will do a follow on Post today or tomorrow.",
                                            "author": "chemistryromance",
                                            "id": "hvoowww",
                                            "parent_id": "t1_hvmmatq",
                                            "score": 1,
                                            "created_utc": 1644058742.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "It's hit me a lot harder then I thought it would, thanks for asking. Yes, the baby was mine and I am in love with her, although she doesn't know. I am out of the initial shock now, thinking a bit more clearly and trying to arrange to meet. Good point about having a discussion on how to avoid this scenario, this was not in my mind. Thanks for the advice and kind words.",
            "author": "chemistryromance",
            "id": "hvfp5oc",
            "parent_id": "t1_hvfg50y",
            "score": 3,
            "created_utc": 1643904985.0,
            "replies": []
        },
        {
            "body": "In the eight months we have been together, she has never ever asked me for anything. Even when I have given her expensive gift options for birthday etc. she asked me to get her a single bed frame instead because her bed was broken and the landlord wouldn't change it. I spoil her in different ways and have a lot of respect for her.",
            "author": "chemistryromance",
            "id": "hvgkm2u",
            "parent_id": "t1_hvfwqjg",
            "score": 5,
            "created_utc": 1643916374.0,
            "replies": [
                {
                    "body": "One in a million!!! You are a lucky man",
                    "author": "lessgeo",
                    "id": "hvglyqg",
                    "parent_id": "t1_hvgkm2u",
                    "score": 2,
                    "created_utc": 1643916885.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I agree! This is an old trick used in the bad neighborhoods of sugar and even vanilla. Plus how do we know it was OP and not someone else who was responsible to get her pregnant.",
            "author": null,
            "id": "hvfyoq5",
            "parent_id": "t1_hvfwqjg",
            "score": 1,
            "created_utc": 1643908449.0,
            "replies": [
                {
                    "body": "Precisely",
                    "author": "lessgeo",
                    "id": "hvfyuvv",
                    "parent_id": "t1_hvfyoq5",
                    "score": -1,
                    "created_utc": 1643908512.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Thank you. We have been together for a while now and I know her quite well and trust her.",
            "author": "chemistryromance",
            "id": "hvfphb2",
            "parent_id": "t1_hvfiy8b",
            "score": 5,
            "created_utc": 1643905105.0,
            "replies": []
        },
        {
            "body": "Yes, that’s right. She had an 8 month intimate relationship with him so that she could pretend to go through this heartbreaking situation and con him into sending her a sweet sweet bouquet of flowers.\n\n/s",
            "author": "TwerkingAvocado",
            "id": "hvhzyg9",
            "parent_id": "t1_hvfumbh",
            "score": 6,
            "created_utc": 1643936712.0,
            "replies": []
        },
        {
            "body": "I agree. Old age trick practiced by frauds!",
            "author": null,
            "id": "hvfyrkc",
            "parent_id": "t1_hvfumbh",
            "score": -2,
            "created_utc": 1643908478.0,
            "replies": []
        },
        {
            "body": "Don’t think that’s what OPs looking to hear here...",
            "author": "bacongrilledcheese18",
            "id": "hvfehf3",
            "parent_id": "t1_hvfd6uz",
            "score": 10,
            "created_utc": 1643900912.0,
            "replies": [
                {
                    "body": "What SD wants a baby with a SB? If he said my SO or SGF then I would get it.",
                    "author": "GSSD",
                    "id": "hvfetdc",
                    "parent_id": "t1_hvfehf3",
                    "score": -8,
                    "created_utc": 1643901044.0,
                    "replies": [
                        {
                            "body": "It’s still perfectly natural and normal to grieve the unexpected loss. \n\nChoosing not to carry a pregnancy is one term. Having that choice taken from you is an entirely different kettle of fish.",
                            "author": "jupiterLILY",
                            "id": "hvfgdef",
                            "parent_id": "t1_hvfetdc",
                            "score": 6,
                            "created_utc": 1643901653.0,
                            "replies": [
                                {
                                    "body": "> Having that choice taken \n\nAt least it was nature's way and not an active choice.",
                                    "author": "GSSD",
                                    "id": "hvfv8xb",
                                    "parent_id": "t1_hvfgdef",
                                    "score": -2,
                                    "created_utc": 1643907195.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Me I wanted a baby with my SB.",
                            "author": "TonyStarkSD",
                            "id": "hvgwv5j",
                            "parent_id": "t1_hvfetdc",
                            "score": 1,
                            "created_utc": 1643921096.0,
                            "replies": [
                                {
                                    "body": "Did you have one together ? Are you still together ? Do you live together? Do you have generous visitation?\n\nAll questions you might not want to discuss but just curious.",
                                    "author": "GSSD",
                                    "id": "hvh00jg",
                                    "parent_id": "t1_hvgwv5j",
                                    "score": 0,
                                    "created_utc": 1643922347.0,
                                    "replies": [
                                        {
                                            "body": "Yeah we have a fake baby, she's so cute.\n\nNo what happened is I told her I wanted more kids, so when I left she faked a pregnancy.\n\nAll water under a bridge now, but I think she enjoyed hurting me.",
                                            "author": "TonyStarkSD",
                                            "id": "hvh1yrz",
                                            "parent_id": "t1_hvh00jg",
                                            "score": 1,
                                            "created_utc": 1643923069.0,
                                            "replies": [
                                                {
                                                    "body": "Cruel",
                                                    "author": "GSSD",
                                                    "id": "hvh3863",
                                                    "parent_id": "t1_hvh1yrz",
                                                    "score": 1,
                                                    "created_utc": 1643923528.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "That's fair. When she is ready, be there.",
            "author": "TwerkingAvocado",
            "id": "hvfin2p",
            "parent_id": "t1_hvfehbu",
            "score": 15,
            "created_utc": 1643902526.0,
            "replies": [
                {
                    "body": "Thank you yes, meeting her today. It will be emotional and I will be there for her as much as she needs me.",
                    "author": "chemistryromance",
                    "id": "hvj8g5k",
                    "parent_id": "t1_hvfin2p",
                    "score": 7,
                    "created_utc": 1643959134.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "You might offer to purchase a talkspace or one of the other therapy subscriptions for her as well.",
            "author": "MistressMM",
            "id": "hvffgjx",
            "parent_id": "t1_hvfac5s",
            "score": 4,
            "created_utc": 1643901298.0,
            "replies": []
        },
        {
            "body": "Thank you <3 I'm glad she has an understanding SD like you. Honestly if she seems like she's having a rough time I might encourage her to see a therapist? But I'm also of the opinion that everyone can benefit from seeing a therapist if they have the option to",
            "author": "Charming-Eye-1309",
            "id": "hvoptjb",
            "parent_id": "t1_hvopo9w",
            "score": 2,
            "created_utc": 1644059478.0,
            "replies": [
                {
                    "body": "I fell in love with her sometime ago so this is more than an arrangement for me. I will suggest therapty to her in a week or two and I agree, she might benefit from it, there is too much to process. Thanks for the kind words.",
                    "author": "chemistryromance",
                    "id": "hvoq48m",
                    "parent_id": "t1_hvoptjb",
                    "score": 2,
                    "created_utc": 1644059723.0,
                    "replies": [
                        {
                            "body": "No problem <3 thank you for the kind actions and I hope everything turns out okay",
                            "author": "Charming-Eye-1309",
                            "id": "hvoq6xg",
                            "parent_id": "t1_hvoq48m",
                            "score": 2,
                            "created_utc": 1644059783.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Your welcome I wish you both the very best",
            "author": "Bitterway_3097",
            "id": "hvfegfl",
            "parent_id": "t1_hvfe0je",
            "score": 3,
            "created_utc": 1643900900.0,
            "replies": []
        },
        {
            "body": "Can you go to her place or is she at the hospital? If she’s bleeding too heavily to move easily today then I wouldn’t have her go out tomorrow. She should maybe be resting and taking it easy? Or what about booking a nice hotel for tomorrow (and maybe today and the day after tomorrow if she wants) where she can relax and have a bath and get room service and not have to worry about doing much? And sending a car for her? Then you could have privacy and hang out tomorrow and if she feels bad or like crying that could be a better place to do it than in public? And chances are good she’ll want to talk for a while or only sporadically and then / otherwise want to be distracted and cuddled and will be too tired to talk or be entertaining so you can lay down together and watch movies or something.",
            "author": "SBerryTrifle",
            "id": "hvh3oiw",
            "parent_id": "t1_hvgy77w",
            "score": 3,
            "created_utc": 1643923696.0,
            "replies": [
                {
                    "body": "Yes, the Doctors have asked her to be on bed rest today. She was nine weeks gone so it is a bit more serious than an earlier miscarriage. She might need further treatment if the bleeding doesn't stop. So for tomorrow, I am going to pick her up and depending on how she is feeling, we might just sit in the car, drive around and get some food or book a hotel and spend some time there but I just don't how she will be feeling tomorrow and I don't want to put too much pressure on her tonight because then she will start thinking about tomorrow and stress herself out. I can't go to her place because she has housemates. \n\nYou are right, it will be emotional, I hadn't thought of that and maybe I should be better prepared to not be in public place. Thank you though, all good points that will be helpful tomorrow. I particularly like the idea of her being able to relax in a hotel room and that will be the best option if she is well enough.",
                    "author": "chemistryromance",
                    "id": "hvh8j4n",
                    "parent_id": "t1_hvh3oiw",
                    "score": 3,
                    "created_utc": 1643925501.0,
                    "replies": [
                        {
                            "body": "Hopefully you’re with her now and everything is ok. I’m sure the two of you can figure out what works best but it might be worth considering keeping her in a hotel the next few days if that’s a better place for her to recover and possibly paying for a private therapist / counselor for her to talk to if there’s a long wait for a public one. Possible you could talk to someone as well. Good luck and I hope she feels better soon!",
                            "author": "SBerryTrifle",
                            "id": "hvmmatq",
                            "parent_id": "t1_hvh8j4n",
                            "score": 2,
                            "created_utc": 1644016339.0,
                            "replies": [
                                {
                                    "body": "Thank you so much, yes, she was too weak to go anywhere so we just sat in the car. It was really hard, she is broken up physically and emotionally and still hasn't had a chance to fully process everything. The first time she realised she was pregnant was when she was holding the dead foetus in her hands. I can't even imagine how  traumatic that must have been. Her healing will take time but she has been checked by Doctors and seems to be following the natural course of recovery after miscarriage. \n\nI have made sure she is comfortable and plan to see her throughout next week. I love her and care about her a lot. Counselling is not a bad idea and I will suggest this to her in a week or two. Will do a follow on Post today or tomorrow.",
                                    "author": "chemistryromance",
                                    "id": "hvoowww",
                                    "parent_id": "t1_hvmmatq",
                                    "score": 1,
                                    "created_utc": 1644058742.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "One in a million!!! You are a lucky man",
            "author": "lessgeo",
            "id": "hvglyqg",
            "parent_id": "t1_hvgkm2u",
            "score": 2,
            "created_utc": 1643916885.0,
            "replies": []
        },
        {
            "body": "Precisely",
            "author": "lessgeo",
            "id": "hvfyuvv",
            "parent_id": "t1_hvfyoq5",
            "score": -1,
            "created_utc": 1643908512.0,
            "replies": []
        },
        {
            "body": "What SD wants a baby with a SB? If he said my SO or SGF then I would get it.",
            "author": "GSSD",
            "id": "hvfetdc",
            "parent_id": "t1_hvfehf3",
            "score": -8,
            "created_utc": 1643901044.0,
            "replies": [
                {
                    "body": "It’s still perfectly natural and normal to grieve the unexpected loss. \n\nChoosing not to carry a pregnancy is one term. Having that choice taken from you is an entirely different kettle of fish.",
                    "author": "jupiterLILY",
                    "id": "hvfgdef",
                    "parent_id": "t1_hvfetdc",
                    "score": 6,
                    "created_utc": 1643901653.0,
                    "replies": [
                        {
                            "body": "> Having that choice taken \n\nAt least it was nature's way and not an active choice.",
                            "author": "GSSD",
                            "id": "hvfv8xb",
                            "parent_id": "t1_hvfgdef",
                            "score": -2,
                            "created_utc": 1643907195.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Me I wanted a baby with my SB.",
                    "author": "TonyStarkSD",
                    "id": "hvgwv5j",
                    "parent_id": "t1_hvfetdc",
                    "score": 1,
                    "created_utc": 1643921096.0,
                    "replies": [
                        {
                            "body": "Did you have one together ? Are you still together ? Do you live together? Do you have generous visitation?\n\nAll questions you might not want to discuss but just curious.",
                            "author": "GSSD",
                            "id": "hvh00jg",
                            "parent_id": "t1_hvgwv5j",
                            "score": 0,
                            "created_utc": 1643922347.0,
                            "replies": [
                                {
                                    "body": "Yeah we have a fake baby, she's so cute.\n\nNo what happened is I told her I wanted more kids, so when I left she faked a pregnancy.\n\nAll water under a bridge now, but I think she enjoyed hurting me.",
                                    "author": "TonyStarkSD",
                                    "id": "hvh1yrz",
                                    "parent_id": "t1_hvh00jg",
                                    "score": 1,
                                    "created_utc": 1643923069.0,
                                    "replies": [
                                        {
                                            "body": "Cruel",
                                            "author": "GSSD",
                                            "id": "hvh3863",
                                            "parent_id": "t1_hvh1yrz",
                                            "score": 1,
                                            "created_utc": 1643923528.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Thank you yes, meeting her today. It will be emotional and I will be there for her as much as she needs me.",
            "author": "chemistryromance",
            "id": "hvj8g5k",
            "parent_id": "t1_hvfin2p",
            "score": 7,
            "created_utc": 1643959134.0,
            "replies": []
        },
        {
            "body": "I fell in love with her sometime ago so this is more than an arrangement for me. I will suggest therapty to her in a week or two and I agree, she might benefit from it, there is too much to process. Thanks for the kind words.",
            "author": "chemistryromance",
            "id": "hvoq48m",
            "parent_id": "t1_hvoptjb",
            "score": 2,
            "created_utc": 1644059723.0,
            "replies": [
                {
                    "body": "No problem <3 thank you for the kind actions and I hope everything turns out okay",
                    "author": "Charming-Eye-1309",
                    "id": "hvoq6xg",
                    "parent_id": "t1_hvoq48m",
                    "score": 2,
                    "created_utc": 1644059783.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yes, the Doctors have asked her to be on bed rest today. She was nine weeks gone so it is a bit more serious than an earlier miscarriage. She might need further treatment if the bleeding doesn't stop. So for tomorrow, I am going to pick her up and depending on how she is feeling, we might just sit in the car, drive around and get some food or book a hotel and spend some time there but I just don't how she will be feeling tomorrow and I don't want to put too much pressure on her tonight because then she will start thinking about tomorrow and stress herself out. I can't go to her place because she has housemates. \n\nYou are right, it will be emotional, I hadn't thought of that and maybe I should be better prepared to not be in public place. Thank you though, all good points that will be helpful tomorrow. I particularly like the idea of her being able to relax in a hotel room and that will be the best option if she is well enough.",
            "author": "chemistryromance",
            "id": "hvh8j4n",
            "parent_id": "t1_hvh3oiw",
            "score": 3,
            "created_utc": 1643925501.0,
            "replies": [
                {
                    "body": "Hopefully you’re with her now and everything is ok. I’m sure the two of you can figure out what works best but it might be worth considering keeping her in a hotel the next few days if that’s a better place for her to recover and possibly paying for a private therapist / counselor for her to talk to if there’s a long wait for a public one. Possible you could talk to someone as well. Good luck and I hope she feels better soon!",
                    "author": "SBerryTrifle",
                    "id": "hvmmatq",
                    "parent_id": "t1_hvh8j4n",
                    "score": 2,
                    "created_utc": 1644016339.0,
                    "replies": [
                        {
                            "body": "Thank you so much, yes, she was too weak to go anywhere so we just sat in the car. It was really hard, she is broken up physically and emotionally and still hasn't had a chance to fully process everything. The first time she realised she was pregnant was when she was holding the dead foetus in her hands. I can't even imagine how  traumatic that must have been. Her healing will take time but she has been checked by Doctors and seems to be following the natural course of recovery after miscarriage. \n\nI have made sure she is comfortable and plan to see her throughout next week. I love her and care about her a lot. Counselling is not a bad idea and I will suggest this to her in a week or two. Will do a follow on Post today or tomorrow.",
                            "author": "chemistryromance",
                            "id": "hvoowww",
                            "parent_id": "t1_hvmmatq",
                            "score": 1,
                            "created_utc": 1644058742.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "It’s still perfectly natural and normal to grieve the unexpected loss. \n\nChoosing not to carry a pregnancy is one term. Having that choice taken from you is an entirely different kettle of fish.",
            "author": "jupiterLILY",
            "id": "hvfgdef",
            "parent_id": "t1_hvfetdc",
            "score": 6,
            "created_utc": 1643901653.0,
            "replies": [
                {
                    "body": "> Having that choice taken \n\nAt least it was nature's way and not an active choice.",
                    "author": "GSSD",
                    "id": "hvfv8xb",
                    "parent_id": "t1_hvfgdef",
                    "score": -2,
                    "created_utc": 1643907195.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Me I wanted a baby with my SB.",
            "author": "TonyStarkSD",
            "id": "hvgwv5j",
            "parent_id": "t1_hvfetdc",
            "score": 1,
            "created_utc": 1643921096.0,
            "replies": [
                {
                    "body": "Did you have one together ? Are you still together ? Do you live together? Do you have generous visitation?\n\nAll questions you might not want to discuss but just curious.",
                    "author": "GSSD",
                    "id": "hvh00jg",
                    "parent_id": "t1_hvgwv5j",
                    "score": 0,
                    "created_utc": 1643922347.0,
                    "replies": [
                        {
                            "body": "Yeah we have a fake baby, she's so cute.\n\nNo what happened is I told her I wanted more kids, so when I left she faked a pregnancy.\n\nAll water under a bridge now, but I think she enjoyed hurting me.",
                            "author": "TonyStarkSD",
                            "id": "hvh1yrz",
                            "parent_id": "t1_hvh00jg",
                            "score": 1,
                            "created_utc": 1643923069.0,
                            "replies": [
                                {
                                    "body": "Cruel",
                                    "author": "GSSD",
                                    "id": "hvh3863",
                                    "parent_id": "t1_hvh1yrz",
                                    "score": 1,
                                    "created_utc": 1643923528.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "No problem <3 thank you for the kind actions and I hope everything turns out okay",
            "author": "Charming-Eye-1309",
            "id": "hvoq6xg",
            "parent_id": "t1_hvoq48m",
            "score": 2,
            "created_utc": 1644059783.0,
            "replies": []
        },
        {
            "body": "Hopefully you’re with her now and everything is ok. I’m sure the two of you can figure out what works best but it might be worth considering keeping her in a hotel the next few days if that’s a better place for her to recover and possibly paying for a private therapist / counselor for her to talk to if there’s a long wait for a public one. Possible you could talk to someone as well. Good luck and I hope she feels better soon!",
            "author": "SBerryTrifle",
            "id": "hvmmatq",
            "parent_id": "t1_hvh8j4n",
            "score": 2,
            "created_utc": 1644016339.0,
            "replies": [
                {
                    "body": "Thank you so much, yes, she was too weak to go anywhere so we just sat in the car. It was really hard, she is broken up physically and emotionally and still hasn't had a chance to fully process everything. The first time she realised she was pregnant was when she was holding the dead foetus in her hands. I can't even imagine how  traumatic that must have been. Her healing will take time but she has been checked by Doctors and seems to be following the natural course of recovery after miscarriage. \n\nI have made sure she is comfortable and plan to see her throughout next week. I love her and care about her a lot. Counselling is not a bad idea and I will suggest this to her in a week or two. Will do a follow on Post today or tomorrow.",
                    "author": "chemistryromance",
                    "id": "hvoowww",
                    "parent_id": "t1_hvmmatq",
                    "score": 1,
                    "created_utc": 1644058742.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "> Having that choice taken \n\nAt least it was nature's way and not an active choice.",
            "author": "GSSD",
            "id": "hvfv8xb",
            "parent_id": "t1_hvfgdef",
            "score": -2,
            "created_utc": 1643907195.0,
            "replies": []
        },
        {
            "body": "Did you have one together ? Are you still together ? Do you live together? Do you have generous visitation?\n\nAll questions you might not want to discuss but just curious.",
            "author": "GSSD",
            "id": "hvh00jg",
            "parent_id": "t1_hvgwv5j",
            "score": 0,
            "created_utc": 1643922347.0,
            "replies": [
                {
                    "body": "Yeah we have a fake baby, she's so cute.\n\nNo what happened is I told her I wanted more kids, so when I left she faked a pregnancy.\n\nAll water under a bridge now, but I think she enjoyed hurting me.",
                    "author": "TonyStarkSD",
                    "id": "hvh1yrz",
                    "parent_id": "t1_hvh00jg",
                    "score": 1,
                    "created_utc": 1643923069.0,
                    "replies": [
                        {
                            "body": "Cruel",
                            "author": "GSSD",
                            "id": "hvh3863",
                            "parent_id": "t1_hvh1yrz",
                            "score": 1,
                            "created_utc": 1643923528.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Thank you so much, yes, she was too weak to go anywhere so we just sat in the car. It was really hard, she is broken up physically and emotionally and still hasn't had a chance to fully process everything. The first time she realised she was pregnant was when she was holding the dead foetus in her hands. I can't even imagine how  traumatic that must have been. Her healing will take time but she has been checked by Doctors and seems to be following the natural course of recovery after miscarriage. \n\nI have made sure she is comfortable and plan to see her throughout next week. I love her and care about her a lot. Counselling is not a bad idea and I will suggest this to her in a week or two. Will do a follow on Post today or tomorrow.",
            "author": "chemistryromance",
            "id": "hvoowww",
            "parent_id": "t1_hvmmatq",
            "score": 1,
            "created_utc": 1644058742.0,
            "replies": []
        },
        {
            "body": "Yeah we have a fake baby, she's so cute.\n\nNo what happened is I told her I wanted more kids, so when I left she faked a pregnancy.\n\nAll water under a bridge now, but I think she enjoyed hurting me.",
            "author": "TonyStarkSD",
            "id": "hvh1yrz",
            "parent_id": "t1_hvh00jg",
            "score": 1,
            "created_utc": 1643923069.0,
            "replies": [
                {
                    "body": "Cruel",
                    "author": "GSSD",
                    "id": "hvh3863",
                    "parent_id": "t1_hvh1yrz",
                    "score": 1,
                    "created_utc": 1643923528.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Cruel",
            "author": "GSSD",
            "id": "hvh3863",
            "parent_id": "t1_hvh1yrz",
            "score": 1,
            "created_utc": 1643923528.0,
            "replies": []
        }
    ]
}