{
    "title": "SBs Can Be Submissive AND Have Boundaries 🤯",
    "post_id": "mvy3we",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/mvy3we/sbs_can_be_submissive_and_have_boundaries/",
    "author": "Fair_Meal1725",
    "body": "I have no problem whatsoever talking about sexual preferences prior to a M&G. In fact, I actually prefer to discuss that before (and the topic of allowance). \n\nThat said, I am BEYOND annoyed with the overly sexual comments. I cannot count on my hands the number of times a POT has asked me, “Are you submissive?” and then followed up with something like “I think you’d look good on your knees.” That kind of behavior before meeting for a first date is appalling, SR or not. \n\nI responded to “look good on your knees” guy with this:\n\n“Discussing sexual preferences is perfectly okay but I don’t appreciate comments like that prior to a M&G. I would be happy to indulge in similar conversation with you after we are more established. I am submissive. However, that doesn’t mean that I do not have boundaries. If you are able to respect them, then I think we will get along great. 🙂”\n\nHaven’t heard back since. Sometimes the trash takes itself out.",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/mvy3we/sbs_can_be_submissive_and_have_boundaries/",
    "score": 318,
    "upvote_ratio": 0.98,
    "created_utc": 1619069488.0,
    "num_comments": 72,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "“Sometimes the trash takes itself out”\n\nWell said!! (dramatic applause) 👏",
            "author": "TheMysteryRemains",
            "id": "gvexw3k",
            "parent_id": "t3_mvy3we",
            "score": 95,
            "created_utc": 1619070300.0,
            "replies": []
        },
        {
            "body": "YEP. I wish these guys had any idea what a better time they’ll have with a happy, respected kink partner. Make me feel like you’d be my champion in the boardroom and I’ll your little freak in the bedroom. My dom SD is awesomely respectful of me, so it’s really fun giving him my subby side.",
            "author": null,
            "id": "gvezsy2",
            "parent_id": "t3_mvy3we",
            "score": 38,
            "created_utc": 1619071837.0,
            "replies": [
                {
                    "body": "Love that for you!",
                    "author": "Fair_Meal1725",
                    "id": "gvezzbg",
                    "parent_id": "t1_gvezsy2",
                    "score": 10,
                    "created_utc": 1619071981.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Dude, if a sexual partner messaged me what you said about being submissive but having boundaries I (along with I think any other reasonable human being) would be SO psyched.\n\nIt’s so much easier to establish consent and my own boundaries/limitations, as well as chat about how we’re gonna have great sex, when the other person is upfront about their needs! That way I don’t have to worry about overstepping or underperforming! \n\nAny person who doesn’t respond to that message with enthusiasm and respect isn’t worth a minute of your time",
            "author": "iAmPizzaJohn",
            "id": "gvf3mz3",
            "parent_id": "t3_mvy3we",
            "score": 29,
            "created_utc": 1619075118.0,
            "replies": []
        },
        {
            "body": "All people with submissive type personalities have boundaries. \n\nJust because a person has a submissive preference doesn’t mean they are submissive to any rando. \n\nBeing submissive doesn’t mean “I’ll just do anything you say”\n\nThis is akin to “Are you hetero?” “Yes” “Great let’s fuck now” ... oh wait ...",
            "author": "daddoms",
            "id": "gvfjdjt",
            "parent_id": "t3_mvy3we",
            "score": 29,
            "created_utc": 1619089832.0,
            "replies": []
        },
        {
            "body": "Many people either don't understand or intentionally misuse the Submissive /  Dominant dynamic.  This guy was either ignorant, or worse, dangerously abusive.\n\nMost sexually submissive people are actually very strong and independent people that have the confidence to enjoy letting themselves be vulnerable to someone they TRUST.  True Dominants know they have to EARN that trust by demonstrating their concern for the safety, boundaries, well being and pleasure of the Submissive.  True Dominants gain their pleasure from gaining the trust of the Submissive as much, if not more, than from rough aggressive sex.\n\nUnfortunately, there are FALSE Dominants, that pretend to be dominant as a cover for their  abuse and misogynistic behavior.   They gain pleasure by abusing and mistreating women.  They show no concern for the safety, boundaries, well being or pleasure of the Submissive.\n\nGood for you that you recognized and didn't accept his bad behavior.  It is so important for Submissives to understand the differences between True Dominants and False Dominants and not put themselves at risk.",
            "author": "willfromvb",
            "id": "gvfqa7l",
            "parent_id": "t3_mvy3we",
            "score": 19,
            "created_utc": 1619094544.0,
            "replies": [
                {
                    "body": "Right. This post (OP) could’ve as easily been made on r/BDSMAdvice (minus the sugar) and the reactions would be even more strongly negative. \n\nLanguage like described by OP is the mark of someone who has no experience being a dominant nor has no experience talking with submissives.",
                    "author": "daddoms",
                    "id": "gvftxsz",
                    "parent_id": "t1_gvfqa7l",
                    "score": 5,
                    "created_utc": 1619096615.0,
                    "replies": [
                        {
                            "body": "I am so confused by your message. Domly doms/false doms are very much a thing and they are toxic. \n\nA good Dom/me will acknowledge a submissive's choice to consent. They make the environment so good (whatever that means is negotiated) that the sub continues to stay.",
                            "author": "LadyMorgan2018",
                            "id": "gvimkdy",
                            "parent_id": "t1_gvftxsz",
                            "score": 2,
                            "created_utc": 1619141707.0,
                            "replies": [
                                {
                                    "body": "Was I confusing? The types of comments described by the OP would be strongly opposed in the BDSm community.  I was agreeing with the comment I responded directly to (“Right”) and commenting on the language described by the OP. Clarification ok?",
                                    "author": "daddoms",
                                    "id": "gvin6a9",
                                    "parent_id": "t1_gvimkdy",
                                    "score": 1,
                                    "created_utc": 1619142009.0,
                                    "replies": [
                                        {
                                            "body": "Ah, yes...I totally agree. I thought you were disagreeing with a different response that also condemned that domly dom.   🤗😘",
                                            "author": "LadyMorgan2018",
                                            "id": "gviqyb3",
                                            "parent_id": "t1_gvin6a9",
                                            "score": 1,
                                            "created_utc": 1619143919.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "This right here. Well said.",
                    "author": "KnottySexAcct",
                    "id": "gvgvxyu",
                    "parent_id": "t1_gvfqa7l",
                    "score": 2,
                    "created_utc": 1619113251.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Guys like that don’t go on SA looking for serious SBs, they only want to sext, maybe get a few free pics, and move on. Save yourself the trouble by blocking them instead of replying with a lengthy paragraph that they’ll never read.",
            "author": "curly_spice",
            "id": "gvexfb7",
            "parent_id": "t3_mvy3we",
            "score": 30,
            "created_utc": 1619069933.0,
            "replies": [
                {
                    "body": "I try to be the bigger person but it’s getting old. I’m taking your advice next time.\n\nEdit: To add, the comment was after agreeing on a time & place for a M&G. That wasn’t his opening line (surprisingly).",
                    "author": "Fair_Meal1725",
                    "id": "gvexouy",
                    "parent_id": "t1_gvexfb7",
                    "score": 12,
                    "created_utc": 1619070139.0,
                    "replies": [
                        {
                            "body": "Those dudes are just tire kickers who want to flirt and fantasize about having a hot SB who will endlessly sext them for free.  Don't engage in sexting prior to M&G to save yourself time and engaging in time-wasters.",
                            "author": "KarensSmokeShop",
                            "id": "gvf31y4",
                            "parent_id": "t1_gvexouy",
                            "score": 10,
                            "created_utc": 1619074599.0,
                            "replies": []
                        },
                        {
                            "body": "You don’t have to be the bigger person. If he’s being a creep, he’s being a creep, and I think you handled it very well. You are much nicer than I am when they are creepy to me.",
                            "author": "Cdnsugarr",
                            "id": "gvfh4xt",
                            "parent_id": "t1_gvexouy",
                            "score": 7,
                            "created_utc": 1619088001.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "This",
                    "author": "wb19081908",
                    "id": "gvf0nu9",
                    "parent_id": "t1_gvexfb7",
                    "score": 3,
                    "created_utc": 1619072547.0,
                    "replies": []
                },
                {
                    "body": "very true, any decent human being wouldn't act like that. Don't even give people like that a response.",
                    "author": "codeblaze",
                    "id": "gvf9fpj",
                    "parent_id": "t1_gvexfb7",
                    "score": 0,
                    "created_utc": 1619080624.0,
                    "replies": []
                },
                {
                    "body": "Kind of not true.. i’ve been known as an SD to say that kind of stuff and i’m definitely not the sext only kind",
                    "author": "soCalCurved",
                    "id": "gvfaalo",
                    "parent_id": "t1_gvexfb7",
                    "score": -7,
                    "created_utc": 1619081476.0,
                    "replies": []
                },
                {
                    "body": "Could be but what about these other options:\n\n1) verbal degradation\n2) narcissistic \n3) Aspberger’s\n\n?",
                    "author": "daddoms",
                    "id": "gvg7fyp",
                    "parent_id": "t1_gvexfb7",
                    "score": 1,
                    "created_utc": 1619103021.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I did met POT SD on Tuesday. It was all good until he started saying, show me your tongue 👅, seems you can suck well, you look good on your knees.... bla bla... and then when I was leaving he saw my car, he was somehow shocked. I drive a Tesla model 3.we stood there chatting and then he told me he doesn’t like fine dining because desert 🏜 is too small and it is expensive! That’s how I knew we ain’t going no where ! He was handsome,2M tall but when he opens his mouth he became ugly. On the text before meet I wouldn’t have imagine him like that . I blocked him before I left the parking lot",
            "author": null,
            "id": "gvf8s4o",
            "parent_id": "t3_mvy3we",
            "score": 20,
            "created_utc": 1619079992.0,
            "replies": [
                {
                    "body": "He said this IN PERSON AT THE M&G?  🤢",
                    "author": "Cdnsugarr",
                    "id": "gvfh849",
                    "parent_id": "t1_gvf8s4o",
                    "score": 11,
                    "created_utc": 1619088075.0,
                    "replies": [
                        {
                            "body": "Yes in person on my face! He went ahead and said he likes being chased not the other way around 😂. My worst ever M&G 😂. I deleted my SA account yesterday, I need to breath first !",
                            "author": null,
                            "id": "gvfi550",
                            "parent_id": "t1_gvfh849",
                            "score": 9,
                            "created_utc": 1619088846.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Ugh...I've had similar. I choose to bring out my inner Domme and school him with withering remarks to make him think twice the next time he starts to be crass without warrant.",
                    "author": "LadyMorgan2018",
                    "id": "gvin9gu",
                    "parent_id": "t1_gvf8s4o",
                    "score": 6,
                    "created_utc": 1619142054.0,
                    "replies": []
                },
                {
                    "body": "Kudos on your choice of car 👍",
                    "author": "ChapterRelative",
                    "id": "gvgo30i",
                    "parent_id": "t1_gvf8s4o",
                    "score": 3,
                    "created_utc": 1619110012.0,
                    "replies": []
                },
                {
                    "body": "🤮",
                    "author": "Fair_Meal1725",
                    "id": "gvmlh6s",
                    "parent_id": "t1_gvf8s4o",
                    "score": 1,
                    "created_utc": 1619222341.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I sometimes wonder what kind of pack of wolves raised some of these men when I see comments on here. All’s I can say here is I love a women who tells me what she’s hoping for/expecting takes all the uncertainty out of the situation",
            "author": "kitkatbrainz",
            "id": "gvezoys",
            "parent_id": "t3_mvy3we",
            "score": 8,
            "created_utc": 1619071745.0,
            "replies": [
                {
                    "body": "Raised by bro-knowledge and porn.  Doesn’t really prepare anyone for civilization",
                    "author": "Alienrite",
                    "id": "gvfmytg",
                    "parent_id": "t1_gvezoys",
                    "score": 13,
                    "created_utc": 1619092413.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Love your response. I hate that D\\S and kink lingo have become so mainstream and people think they can partake without really understanding the lifestyle. I’m sure a guy like that has no idea what aftercare is or even to provide it.",
            "author": "koalandi",
            "id": "gvg7e2l",
            "parent_id": "t3_mvy3we",
            "score": 7,
            "created_utc": 1619102998.0,
            "replies": [
                {
                    "body": "Oh..it happens all the time within the lifestyle as well.",
                    "author": "LadyMorgan2018",
                    "id": "gvilr5q",
                    "parent_id": "t1_gvg7e2l",
                    "score": 1,
                    "created_utc": 1619141299.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I like to wave good bye when the trash takes itself out",
            "author": "littlebobeep29",
            "id": "gveztuo",
            "parent_id": "t3_mvy3we",
            "score": 5,
            "created_utc": 1619071857.0,
            "replies": []
        },
        {
            "body": "That was an amazing response on your behalf. I’m glad you said that. I think it’s sad the SB has to remind the SD on how to be respectful towards a woman. Men, do better. This is disgusting, I’m so sorry you had to receive a comment like that, that’s so rude and belittling.",
            "author": "____thewayitis",
            "id": "gvfnp9h",
            "parent_id": "t3_mvy3we",
            "score": 6,
            "created_utc": 1619092915.0,
            "replies": []
        },
        {
            "body": "These are the same SDs that hate when we bring up the topic if allowance or are cheap as hell too smh 😤it’s just rude and poor taste. You don’t want us SBs talking about money too much beforehand give us the same respect and stop over sexualizing this relationship.",
            "author": "PrettyFlyForABlasian",
            "id": "gvfqafg",
            "parent_id": "t3_mvy3we",
            "score": 6,
            "created_utc": 1619094548.0,
            "replies": []
        },
        {
            "body": "Ugh!!! The \"domly doms\" make me cringe. You were nicer than I ever am in any arena. \n\nI generally tell them that while I am often submissive, this Cougar is feral and not THEIR submissive. It is in their best interest to treat me with respect until we have an agreement that says otherwise.",
            "author": "LadyMorgan2018",
            "id": "gvilotg",
            "parent_id": "t3_mvy3we",
            "score": 5,
            "created_utc": 1619141266.0,
            "replies": [
                {
                    "body": "Love this.",
                    "author": "Fair_Meal1725",
                    "id": "gvj9vhe",
                    "parent_id": "t1_gvilotg",
                    "score": 2,
                    "created_utc": 1619155232.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "🤢🤢🤢🤢🤮🤮🤮🤮 ewwww can’t stand those guys. I refuse to discuss ANYTHING even alluding to sex before meeting. Only that my ideal arrangement includes “intimacy”. Period. If they push -> BLOCK",
            "author": "usernamechecksout4u",
            "id": "gvey382",
            "parent_id": "t3_mvy3we",
            "score": 8,
            "created_utc": 1619070456.0,
            "replies": []
        },
        {
            "body": "The guys that talk about sex before meeting are probably the horniest and most desperate. A good SD wouldn’t feel the need to talk about it",
            "author": "UnearthlyDinosaur",
            "id": "gvf0ad3",
            "parent_id": "t3_mvy3we",
            "score": 9,
            "created_utc": 1619072234.0,
            "replies": [
                {
                    "body": "Wrong! Its a crappy feeling getting with an SB and the sex is incongruent or incompatible. I find it much better to discuss sexual preferences and fantasies before meeting up as that takes the guess work and saves time from dealing with sexual compatibilities for BOTH parties",
                    "author": "soCalCurved",
                    "id": "gvfage2",
                    "parent_id": "t1_gvf0ad3",
                    "score": -7,
                    "created_utc": 1619081632.0,
                    "replies": [
                        {
                            "body": "There a huge difference between have a discussion about sexual preferences  and being an asshole who doesn't respect a woman enough to even grasp the concept she might have boundaries & couldn't care less about her consent.\n\nEveryone here is talking about a POT being overly familiar without asking if that's ok. They're not talking about having a frank, equal talk about what BOTH partners expect sexually in the relationship.",
                            "author": "ShaArt5",
                            "id": "gvfi4up",
                            "parent_id": "t1_gvfage2",
                            "score": 9,
                            "created_utc": 1619088840.0,
                            "replies": [
                                {
                                    "body": "Agreed! I’m replying to the person above me. Do you not know how to use reddit?",
                                    "author": "soCalCurved",
                                    "id": "gvfmzmb",
                                    "parent_id": "t1_gvfi4up",
                                    "score": -7,
                                    "created_utc": 1619092428.0,
                                    "replies": [
                                        {
                                            "body": "Do you? I'm replying to you in consequence to what you replied to the person you attached your comment to.",
                                            "author": "ShaArt5",
                                            "id": "gvfwb7a",
                                            "parent_id": "t1_gvfmzmb",
                                            "score": 6,
                                            "created_utc": 1619097862.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "Yikes buddy.",
                                            "author": "_Fortuna_",
                                            "id": "gvg0c11",
                                            "parent_id": "t1_gvfmzmb",
                                            "score": 4,
                                            "created_utc": 1619099835.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Do you talk about it pre M&G or during? What kind of questions do you ask to figure out compatibility?",
                            "author": "Babyspacecake",
                            "id": "gvfujhh",
                            "parent_id": "t1_gvfage2",
                            "score": 1,
                            "created_utc": 1619096940.0,
                            "replies": [
                                {
                                    "body": "I do it most of the time during pre and then sometimes on M&G. But if you’re a SB, do it only if the SD brings it up",
                                    "author": "soCalCurved",
                                    "id": "gvgyurw",
                                    "parent_id": "t1_gvfujhh",
                                    "score": 1,
                                    "created_utc": 1619114447.0,
                                    "replies": [
                                        {
                                            "body": "[removed]",
                                            "author": null,
                                            "id": "gvhdwsq",
                                            "parent_id": "t1_gvgyurw",
                                            "score": 2,
                                            "created_utc": 1619120863.0,
                                            "replies": [
                                                {
                                                    "body": "Yes i’m an SD. I personally do PPM and i’m non-exclusive. I’m also young at 32 years old so a lot of SBs get along with me easy and I have been told refreshing.\nWith my style of relationship/arrangements, talking about money during pre and during the M&G have both been fine as everything is very casual, blunt and straight forward for me. Im not here to date and play guessing games because i don’t have the time so I enjoy the SB’s that can be on the same page like that.\n\nSome older guys might not like that if they want something more deep and thoughtful. Its kinda tricky. Money talk always feels weird even for me at first but its nice to finally get over that and come to an agreement with a new SB.",
                                                    "author": "soCalCurved",
                                                    "id": "gvhj2x6",
                                                    "parent_id": "t1_gvhdwsq",
                                                    "score": 2,
                                                    "created_utc": 1619123075.0,
                                                    "replies": [
                                                        {
                                                            "body": "Got it. Yes this is an older SD (63) and he is very careful with his words. I am pretty sure he wants deep and thoughtful (that’s actually how I describe myself in my profile - I’m a bit older than the typical SB). So I’m trying to carefully toe the line and it’s not easy! Thanks for your input.",
                                                            "author": "Babyspacecake",
                                                            "id": "gvhjl0t",
                                                            "parent_id": "t1_gvhj2x6",
                                                            "score": 2,
                                                            "created_utc": 1619123290.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Good luck!!",
                                                                    "author": "soCalCurved",
                                                                    "id": "gvmxo7k",
                                                                    "parent_id": "t1_gvhjl0t",
                                                                    "score": 2,
                                                                    "created_utc": 1619229007.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "body": "See the [allowance master thread](https://www.reddit.com/r/sugarlifestyleforum/comments/76stil/allowance_master_thread/).",
                                                    "author": "Fair_Meal1725",
                                                    "id": "gvmm1m7",
                                                    "parent_id": "t1_gvhdwsq",
                                                    "score": 2,
                                                    "created_utc": 1619222650.0,
                                                    "replies": [
                                                        {
                                                            "body": "Thanks, but my city isn’t in there. =\\ I’ll probably just try to pick an average for the region.",
                                                            "author": "Babyspacecake",
                                                            "id": "gvpd97s",
                                                            "parent_id": "t1_gvmm1m7",
                                                            "score": 1,
                                                            "created_utc": 1619274155.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "body": "Removed for [Rule #4](/r/sugarlifestyleforum/comments/748zta/updated_and_clarified_rules_for_slf/):\n\n* No \"value for money\" discussions- Discussions about how to get the most value for your money are not allowed. Post Asking for or assigning a monetary value to sexual acts are not allowed. Assigning a monetary worth to individuals based on race, age, size,looks, etc., are not allowed. Post about how much allowance/ppm to ask for, give, is average, for such and such area or situation, will no longer be allowed on SLF. Any post of this nature will immediately be removed. There are many posts that covers this topic in our archives, please utilize the search feature to access them. Any posts with dollar amounts that are in reference to PPMs and/or allowances will be removed and are no longer allowed.",
                                                    "author": "SeattleLaserMeteor",
                                                    "id": "gvmv9pl",
                                                    "parent_id": "t1_gvhdwsq",
                                                    "score": 1,
                                                    "created_utc": 1619227674.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "They're just jerkers who are searching for free online sexual amusement.\n\nYour response is excellent, and their reaction to it is a only a confirmation of the above.",
            "author": "A-touchofreality",
            "id": "gvfmbv9",
            "parent_id": "t3_mvy3we",
            "score": 3,
            "created_utc": 1619091980.0,
            "replies": []
        },
        {
            "body": "Someone that speaks like that before even meeting you likely is not a real Dom anyways. Good for you!",
            "author": "LuciousLicker",
            "id": "gvfssu9",
            "parent_id": "t3_mvy3we",
            "score": 4,
            "created_utc": 1619095988.0,
            "replies": []
        },
        {
            "body": "My SB is completely submissive and LOVES to please me. I respect her boundaries. we discussed this BEFORE the intimacy started and so we have great chemistry.  😈 the \"good girl\" / \"yes daddy\" banter we have via text BEFORE we meet up really ads a fun, sexy component to our relationship.",
            "author": "Tough-Raisin1514",
            "id": "gvfsv4m",
            "parent_id": "t3_mvy3we",
            "score": 4,
            "created_utc": 1619096022.0,
            "replies": []
        },
        {
            "body": "Excellent post. Your thoughtful response was probably more thought out than that piece of trash deserved. Appalling is exactly the right word for his action/behavior...why is the concept of being a gentleman with a woman you are courting so foreign to some of these idiots?",
            "author": "Cledaddy23",
            "id": "gvfyyzy",
            "parent_id": "t3_mvy3we",
            "score": 4,
            "created_utc": 1619099192.0,
            "replies": []
        },
        {
            "body": "What all the wannabe \"doms\" out there don't understand that in a relationship with a dominant/submissive kink there must first be TRUST. Most people today get their impressions of this dynamic from Fifty Shades or porn, without any understanding of the groundwork needed.",
            "author": "KeyToGramercy",
            "id": "gvhcw33",
            "parent_id": "t3_mvy3we",
            "score": 5,
            "created_utc": 1619120420.0,
            "replies": []
        },
        {
            "body": "Men with money and access to the internet can be crazy sometimes. I myself have been a little overboard.",
            "author": "Weekendsunsout",
            "id": "gvf1ld1",
            "parent_id": "t3_mvy3we",
            "score": 3,
            "created_utc": 1619073339.0,
            "replies": []
        },
        {
            "body": "Would of left him on read lol",
            "author": "Sunny-Ram-515",
            "id": "gvf2lbd",
            "parent_id": "t3_mvy3we",
            "score": 3,
            "created_utc": 1619074207.0,
            "replies": []
        },
        {
            "body": "Good on you , guy sounded like a Fuck Boy !!",
            "author": "Mangas70",
            "id": "gvfil4c",
            "parent_id": "t3_mvy3we",
            "score": 2,
            "created_utc": 1619089207.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gvfk5sy",
            "parent_id": "t3_mvy3we",
            "score": 2,
            "created_utc": 1619090426.0,
            "replies": [
                {
                    "body": "Kinksters have varied tastes. There is no standard, except that whatever is done is consentual. If you want to know what a submissive wants, you need only ask them. Once there is agreement, stick to what was agreed upon. Then regroup in aftercare and talk about what went right, what needs more work, and any new ideas.",
                    "author": "LadyMorgan2018",
                    "id": "gvin2fo",
                    "parent_id": "t1_gvfk5sy",
                    "score": 1,
                    "created_utc": 1619141955.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Such a dumb thing to say.  I'd get the \"I bet you look a lot better without clothes on\"  phrase as it gives a women a bit of confidence that she has a nice body and the clothes are hiding it.  but on your knees????  obviously someone who only cares about degrading women.",
            "author": "UseRound7488",
            "id": "gvfxnc4",
            "parent_id": "t3_mvy3we",
            "score": 2,
            "created_utc": 1619098541.0,
            "replies": []
        },
        {
            "body": "Tbh I think even saying you are open to anything relating to being submissive is asking for a lot of BS on SA.",
            "author": "prettylilprostitute",
            "id": "gvgf9ux",
            "parent_id": "t3_mvy3we",
            "score": 2,
            "created_utc": 1619106337.0,
            "replies": []
        },
        {
            "body": "You are absolutely right!  Any \"dom\" who does not make a major effort to understand your triggers, your emotional landscape, the why behind your preferences and talk specific limits is simply not worth your time.  Even with a respectful conversation, this kind of thing is tough.  With an idiot, it might well be impossible.",
            "author": "NCtriadSD",
            "id": "gvglfac",
            "parent_id": "t3_mvy3we",
            "score": 2,
            "created_utc": 1619108906.0,
            "replies": []
        },
        {
            "body": "Yea. I find myself doing this more and more. With POT and ‘normal’ potential partners. Nothing is less sexy.",
            "author": "realgirl_fakename",
            "id": "gvh4ot2",
            "parent_id": "t3_mvy3we",
            "score": 2,
            "created_utc": 1619116878.0,
            "replies": []
        },
        {
            "body": "There was someone that always ALWAYS talked dirty to me and we didn't even talk about an arrangement yet, needless to say, that stayed in the \"read\" where it remains. If you can't have some kind of respect for someone you're wanting to be your SB then why even bother?",
            "author": null,
            "id": "gvhfafv",
            "parent_id": "t3_mvy3we",
            "score": 2,
            "created_utc": 1619121448.0,
            "replies": []
        },
        {
            "body": "I love your reply",
            "author": "k815",
            "id": "h2ef64n",
            "parent_id": "t3_mvy3we",
            "score": 2,
            "created_utc": 1624166605.0,
            "replies": []
        },
        {
            "body": "No asshole here. The guy makes a comment like this to better establish where they are at, and while that might seem tacky to some he is trying to gauge attraction, intent and communication style. If the girl doesn't want that at that time, she just needs to set expectations and boundaries. She's done that well and the guy should respect the boundary. But it's unrealistic to think that some guys will not want to make sexual comments before the relationship is consumated. I mean... How many men can you have flirted with to think that it's unusually transgressive to make a sexual comment, not even using rude language, in this context?",
            "author": "Distinct-Animal-9628",
            "id": "gvf5drr",
            "parent_id": "t3_mvy3we",
            "score": -15,
            "created_utc": 1619076713.0,
            "replies": [
                {
                    "body": "This is **absolutely** an asshole move and disrespectful prior to the M&G. You haven’t established any rapport. It’s like walking up and doing it at a bar, and the fact you think it’s acceptable worries me about your character. \n\nAny normal human can discuss sexual preferences appropriately and if he was a Dom seeking a true sub he would know that this is not accepted in the kink world either.\n\nEdit: consent is only an enthusiastic yes and that includes anything sexual whatsoever, FYI. Read the room before you tell a woman she would look good on her knees like a creep.",
                    "author": "Cdnsugarr",
                    "id": "gvfhz9e",
                    "parent_id": "t1_gvf5drr",
                    "score": 15,
                    "created_utc": 1619088710.0,
                    "replies": []
                },
                {
                    "body": "How about following up “are you submissive” with “would you be interested in developing a D/s relationship once we get to know each other? We can talk about boundaries and expectations over coffee!” That would be soooo much sexier.",
                    "author": "chubbypaws",
                    "id": "gvf9xw7",
                    "parent_id": "t1_gvf5drr",
                    "score": 10,
                    "created_utc": 1619081127.0,
                    "replies": [
                        {
                            "body": "I think that sounds sexier. But, wow, 14 downvotes say I am wrong.",
                            "author": "Distinct-Animal-9628",
                            "id": "gvlhiic",
                            "parent_id": "t1_gvf9xw7",
                            "score": 1,
                            "created_utc": 1619203149.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "No it’s a douche bag move.",
                    "author": "daddoms",
                    "id": "gvfjgfo",
                    "parent_id": "t1_gvf5drr",
                    "score": 9,
                    "created_utc": 1619089894.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Love that for you!",
            "author": "Fair_Meal1725",
            "id": "gvezzbg",
            "parent_id": "t1_gvezsy2",
            "score": 10,
            "created_utc": 1619071981.0,
            "replies": []
        },
        {
            "body": "Right. This post (OP) could’ve as easily been made on r/BDSMAdvice (minus the sugar) and the reactions would be even more strongly negative. \n\nLanguage like described by OP is the mark of someone who has no experience being a dominant nor has no experience talking with submissives.",
            "author": "daddoms",
            "id": "gvftxsz",
            "parent_id": "t1_gvfqa7l",
            "score": 5,
            "created_utc": 1619096615.0,
            "replies": [
                {
                    "body": "I am so confused by your message. Domly doms/false doms are very much a thing and they are toxic. \n\nA good Dom/me will acknowledge a submissive's choice to consent. They make the environment so good (whatever that means is negotiated) that the sub continues to stay.",
                    "author": "LadyMorgan2018",
                    "id": "gvimkdy",
                    "parent_id": "t1_gvftxsz",
                    "score": 2,
                    "created_utc": 1619141707.0,
                    "replies": [
                        {
                            "body": "Was I confusing? The types of comments described by the OP would be strongly opposed in the BDSm community.  I was agreeing with the comment I responded directly to (“Right”) and commenting on the language described by the OP. Clarification ok?",
                            "author": "daddoms",
                            "id": "gvin6a9",
                            "parent_id": "t1_gvimkdy",
                            "score": 1,
                            "created_utc": 1619142009.0,
                            "replies": [
                                {
                                    "body": "Ah, yes...I totally agree. I thought you were disagreeing with a different response that also condemned that domly dom.   🤗😘",
                                    "author": "LadyMorgan2018",
                                    "id": "gviqyb3",
                                    "parent_id": "t1_gvin6a9",
                                    "score": 1,
                                    "created_utc": 1619143919.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "This right here. Well said.",
            "author": "KnottySexAcct",
            "id": "gvgvxyu",
            "parent_id": "t1_gvfqa7l",
            "score": 2,
            "created_utc": 1619113251.0,
            "replies": []
        },
        {
            "body": "I try to be the bigger person but it’s getting old. I’m taking your advice next time.\n\nEdit: To add, the comment was after agreeing on a time & place for a M&G. That wasn’t his opening line (surprisingly).",
            "author": "Fair_Meal1725",
            "id": "gvexouy",
            "parent_id": "t1_gvexfb7",
            "score": 12,
            "created_utc": 1619070139.0,
            "replies": [
                {
                    "body": "Those dudes are just tire kickers who want to flirt and fantasize about having a hot SB who will endlessly sext them for free.  Don't engage in sexting prior to M&G to save yourself time and engaging in time-wasters.",
                    "author": "KarensSmokeShop",
                    "id": "gvf31y4",
                    "parent_id": "t1_gvexouy",
                    "score": 10,
                    "created_utc": 1619074599.0,
                    "replies": []
                },
                {
                    "body": "You don’t have to be the bigger person. If he’s being a creep, he’s being a creep, and I think you handled it very well. You are much nicer than I am when they are creepy to me.",
                    "author": "Cdnsugarr",
                    "id": "gvfh4xt",
                    "parent_id": "t1_gvexouy",
                    "score": 7,
                    "created_utc": 1619088001.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "This",
            "author": "wb19081908",
            "id": "gvf0nu9",
            "parent_id": "t1_gvexfb7",
            "score": 3,
            "created_utc": 1619072547.0,
            "replies": []
        },
        {
            "body": "very true, any decent human being wouldn't act like that. Don't even give people like that a response.",
            "author": "codeblaze",
            "id": "gvf9fpj",
            "parent_id": "t1_gvexfb7",
            "score": 0,
            "created_utc": 1619080624.0,
            "replies": []
        },
        {
            "body": "Kind of not true.. i’ve been known as an SD to say that kind of stuff and i’m definitely not the sext only kind",
            "author": "soCalCurved",
            "id": "gvfaalo",
            "parent_id": "t1_gvexfb7",
            "score": -7,
            "created_utc": 1619081476.0,
            "replies": []
        },
        {
            "body": "Could be but what about these other options:\n\n1) verbal degradation\n2) narcissistic \n3) Aspberger’s\n\n?",
            "author": "daddoms",
            "id": "gvg7fyp",
            "parent_id": "t1_gvexfb7",
            "score": 1,
            "created_utc": 1619103021.0,
            "replies": []
        },
        {
            "body": "He said this IN PERSON AT THE M&G?  🤢",
            "author": "Cdnsugarr",
            "id": "gvfh849",
            "parent_id": "t1_gvf8s4o",
            "score": 11,
            "created_utc": 1619088075.0,
            "replies": [
                {
                    "body": "Yes in person on my face! He went ahead and said he likes being chased not the other way around 😂. My worst ever M&G 😂. I deleted my SA account yesterday, I need to breath first !",
                    "author": null,
                    "id": "gvfi550",
                    "parent_id": "t1_gvfh849",
                    "score": 9,
                    "created_utc": 1619088846.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Ugh...I've had similar. I choose to bring out my inner Domme and school him with withering remarks to make him think twice the next time he starts to be crass without warrant.",
            "author": "LadyMorgan2018",
            "id": "gvin9gu",
            "parent_id": "t1_gvf8s4o",
            "score": 6,
            "created_utc": 1619142054.0,
            "replies": []
        },
        {
            "body": "Kudos on your choice of car 👍",
            "author": "ChapterRelative",
            "id": "gvgo30i",
            "parent_id": "t1_gvf8s4o",
            "score": 3,
            "created_utc": 1619110012.0,
            "replies": []
        },
        {
            "body": "🤮",
            "author": "Fair_Meal1725",
            "id": "gvmlh6s",
            "parent_id": "t1_gvf8s4o",
            "score": 1,
            "created_utc": 1619222341.0,
            "replies": []
        },
        {
            "body": "Raised by bro-knowledge and porn.  Doesn’t really prepare anyone for civilization",
            "author": "Alienrite",
            "id": "gvfmytg",
            "parent_id": "t1_gvezoys",
            "score": 13,
            "created_utc": 1619092413.0,
            "replies": []
        },
        {
            "body": "Oh..it happens all the time within the lifestyle as well.",
            "author": "LadyMorgan2018",
            "id": "gvilr5q",
            "parent_id": "t1_gvg7e2l",
            "score": 1,
            "created_utc": 1619141299.0,
            "replies": []
        },
        {
            "body": "Love this.",
            "author": "Fair_Meal1725",
            "id": "gvj9vhe",
            "parent_id": "t1_gvilotg",
            "score": 2,
            "created_utc": 1619155232.0,
            "replies": []
        },
        {
            "body": "Wrong! Its a crappy feeling getting with an SB and the sex is incongruent or incompatible. I find it much better to discuss sexual preferences and fantasies before meeting up as that takes the guess work and saves time from dealing with sexual compatibilities for BOTH parties",
            "author": "soCalCurved",
            "id": "gvfage2",
            "parent_id": "t1_gvf0ad3",
            "score": -7,
            "created_utc": 1619081632.0,
            "replies": [
                {
                    "body": "There a huge difference between have a discussion about sexual preferences  and being an asshole who doesn't respect a woman enough to even grasp the concept she might have boundaries & couldn't care less about her consent.\n\nEveryone here is talking about a POT being overly familiar without asking if that's ok. They're not talking about having a frank, equal talk about what BOTH partners expect sexually in the relationship.",
                    "author": "ShaArt5",
                    "id": "gvfi4up",
                    "parent_id": "t1_gvfage2",
                    "score": 9,
                    "created_utc": 1619088840.0,
                    "replies": [
                        {
                            "body": "Agreed! I’m replying to the person above me. Do you not know how to use reddit?",
                            "author": "soCalCurved",
                            "id": "gvfmzmb",
                            "parent_id": "t1_gvfi4up",
                            "score": -7,
                            "created_utc": 1619092428.0,
                            "replies": [
                                {
                                    "body": "Do you? I'm replying to you in consequence to what you replied to the person you attached your comment to.",
                                    "author": "ShaArt5",
                                    "id": "gvfwb7a",
                                    "parent_id": "t1_gvfmzmb",
                                    "score": 6,
                                    "created_utc": 1619097862.0,
                                    "replies": []
                                },
                                {
                                    "body": "Yikes buddy.",
                                    "author": "_Fortuna_",
                                    "id": "gvg0c11",
                                    "parent_id": "t1_gvfmzmb",
                                    "score": 4,
                                    "created_utc": 1619099835.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Do you talk about it pre M&G or during? What kind of questions do you ask to figure out compatibility?",
                    "author": "Babyspacecake",
                    "id": "gvfujhh",
                    "parent_id": "t1_gvfage2",
                    "score": 1,
                    "created_utc": 1619096940.0,
                    "replies": [
                        {
                            "body": "I do it most of the time during pre and then sometimes on M&G. But if you’re a SB, do it only if the SD brings it up",
                            "author": "soCalCurved",
                            "id": "gvgyurw",
                            "parent_id": "t1_gvfujhh",
                            "score": 1,
                            "created_utc": 1619114447.0,
                            "replies": [
                                {
                                    "body": "[removed]",
                                    "author": null,
                                    "id": "gvhdwsq",
                                    "parent_id": "t1_gvgyurw",
                                    "score": 2,
                                    "created_utc": 1619120863.0,
                                    "replies": [
                                        {
                                            "body": "Yes i’m an SD. I personally do PPM and i’m non-exclusive. I’m also young at 32 years old so a lot of SBs get along with me easy and I have been told refreshing.\nWith my style of relationship/arrangements, talking about money during pre and during the M&G have both been fine as everything is very casual, blunt and straight forward for me. Im not here to date and play guessing games because i don’t have the time so I enjoy the SB’s that can be on the same page like that.\n\nSome older guys might not like that if they want something more deep and thoughtful. Its kinda tricky. Money talk always feels weird even for me at first but its nice to finally get over that and come to an agreement with a new SB.",
                                            "author": "soCalCurved",
                                            "id": "gvhj2x6",
                                            "parent_id": "t1_gvhdwsq",
                                            "score": 2,
                                            "created_utc": 1619123075.0,
                                            "replies": [
                                                {
                                                    "body": "Got it. Yes this is an older SD (63) and he is very careful with his words. I am pretty sure he wants deep and thoughtful (that’s actually how I describe myself in my profile - I’m a bit older than the typical SB). So I’m trying to carefully toe the line and it’s not easy! Thanks for your input.",
                                                    "author": "Babyspacecake",
                                                    "id": "gvhjl0t",
                                                    "parent_id": "t1_gvhj2x6",
                                                    "score": 2,
                                                    "created_utc": 1619123290.0,
                                                    "replies": [
                                                        {
                                                            "body": "Good luck!!",
                                                            "author": "soCalCurved",
                                                            "id": "gvmxo7k",
                                                            "parent_id": "t1_gvhjl0t",
                                                            "score": 2,
                                                            "created_utc": 1619229007.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "body": "See the [allowance master thread](https://www.reddit.com/r/sugarlifestyleforum/comments/76stil/allowance_master_thread/).",
                                            "author": "Fair_Meal1725",
                                            "id": "gvmm1m7",
                                            "parent_id": "t1_gvhdwsq",
                                            "score": 2,
                                            "created_utc": 1619222650.0,
                                            "replies": [
                                                {
                                                    "body": "Thanks, but my city isn’t in there. =\\ I’ll probably just try to pick an average for the region.",
                                                    "author": "Babyspacecake",
                                                    "id": "gvpd97s",
                                                    "parent_id": "t1_gvmm1m7",
                                                    "score": 1,
                                                    "created_utc": 1619274155.0,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "body": "Removed for [Rule #4](/r/sugarlifestyleforum/comments/748zta/updated_and_clarified_rules_for_slf/):\n\n* No \"value for money\" discussions- Discussions about how to get the most value for your money are not allowed. Post Asking for or assigning a monetary value to sexual acts are not allowed. Assigning a monetary worth to individuals based on race, age, size,looks, etc., are not allowed. Post about how much allowance/ppm to ask for, give, is average, for such and such area or situation, will no longer be allowed on SLF. Any post of this nature will immediately be removed. There are many posts that covers this topic in our archives, please utilize the search feature to access them. Any posts with dollar amounts that are in reference to PPMs and/or allowances will be removed and are no longer allowed.",
                                            "author": "SeattleLaserMeteor",
                                            "id": "gvmv9pl",
                                            "parent_id": "t1_gvhdwsq",
                                            "score": 1,
                                            "created_utc": 1619227674.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Kinksters have varied tastes. There is no standard, except that whatever is done is consentual. If you want to know what a submissive wants, you need only ask them. Once there is agreement, stick to what was agreed upon. Then regroup in aftercare and talk about what went right, what needs more work, and any new ideas.",
            "author": "LadyMorgan2018",
            "id": "gvin2fo",
            "parent_id": "t1_gvfk5sy",
            "score": 1,
            "created_utc": 1619141955.0,
            "replies": []
        },
        {
            "body": "This is **absolutely** an asshole move and disrespectful prior to the M&G. You haven’t established any rapport. It’s like walking up and doing it at a bar, and the fact you think it’s acceptable worries me about your character. \n\nAny normal human can discuss sexual preferences appropriately and if he was a Dom seeking a true sub he would know that this is not accepted in the kink world either.\n\nEdit: consent is only an enthusiastic yes and that includes anything sexual whatsoever, FYI. Read the room before you tell a woman she would look good on her knees like a creep.",
            "author": "Cdnsugarr",
            "id": "gvfhz9e",
            "parent_id": "t1_gvf5drr",
            "score": 15,
            "created_utc": 1619088710.0,
            "replies": []
        },
        {
            "body": "How about following up “are you submissive” with “would you be interested in developing a D/s relationship once we get to know each other? We can talk about boundaries and expectations over coffee!” That would be soooo much sexier.",
            "author": "chubbypaws",
            "id": "gvf9xw7",
            "parent_id": "t1_gvf5drr",
            "score": 10,
            "created_utc": 1619081127.0,
            "replies": [
                {
                    "body": "I think that sounds sexier. But, wow, 14 downvotes say I am wrong.",
                    "author": "Distinct-Animal-9628",
                    "id": "gvlhiic",
                    "parent_id": "t1_gvf9xw7",
                    "score": 1,
                    "created_utc": 1619203149.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "No it’s a douche bag move.",
            "author": "daddoms",
            "id": "gvfjgfo",
            "parent_id": "t1_gvf5drr",
            "score": 9,
            "created_utc": 1619089894.0,
            "replies": []
        },
        {
            "body": "I am so confused by your message. Domly doms/false doms are very much a thing and they are toxic. \n\nA good Dom/me will acknowledge a submissive's choice to consent. They make the environment so good (whatever that means is negotiated) that the sub continues to stay.",
            "author": "LadyMorgan2018",
            "id": "gvimkdy",
            "parent_id": "t1_gvftxsz",
            "score": 2,
            "created_utc": 1619141707.0,
            "replies": [
                {
                    "body": "Was I confusing? The types of comments described by the OP would be strongly opposed in the BDSm community.  I was agreeing with the comment I responded directly to (“Right”) and commenting on the language described by the OP. Clarification ok?",
                    "author": "daddoms",
                    "id": "gvin6a9",
                    "parent_id": "t1_gvimkdy",
                    "score": 1,
                    "created_utc": 1619142009.0,
                    "replies": [
                        {
                            "body": "Ah, yes...I totally agree. I thought you were disagreeing with a different response that also condemned that domly dom.   🤗😘",
                            "author": "LadyMorgan2018",
                            "id": "gviqyb3",
                            "parent_id": "t1_gvin6a9",
                            "score": 1,
                            "created_utc": 1619143919.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Those dudes are just tire kickers who want to flirt and fantasize about having a hot SB who will endlessly sext them for free.  Don't engage in sexting prior to M&G to save yourself time and engaging in time-wasters.",
            "author": "KarensSmokeShop",
            "id": "gvf31y4",
            "parent_id": "t1_gvexouy",
            "score": 10,
            "created_utc": 1619074599.0,
            "replies": []
        },
        {
            "body": "You don’t have to be the bigger person. If he’s being a creep, he’s being a creep, and I think you handled it very well. You are much nicer than I am when they are creepy to me.",
            "author": "Cdnsugarr",
            "id": "gvfh4xt",
            "parent_id": "t1_gvexouy",
            "score": 7,
            "created_utc": 1619088001.0,
            "replies": []
        },
        {
            "body": "Yes in person on my face! He went ahead and said he likes being chased not the other way around 😂. My worst ever M&G 😂. I deleted my SA account yesterday, I need to breath first !",
            "author": null,
            "id": "gvfi550",
            "parent_id": "t1_gvfh849",
            "score": 9,
            "created_utc": 1619088846.0,
            "replies": []
        },
        {
            "body": "There a huge difference between have a discussion about sexual preferences  and being an asshole who doesn't respect a woman enough to even grasp the concept she might have boundaries & couldn't care less about her consent.\n\nEveryone here is talking about a POT being overly familiar without asking if that's ok. They're not talking about having a frank, equal talk about what BOTH partners expect sexually in the relationship.",
            "author": "ShaArt5",
            "id": "gvfi4up",
            "parent_id": "t1_gvfage2",
            "score": 9,
            "created_utc": 1619088840.0,
            "replies": [
                {
                    "body": "Agreed! I’m replying to the person above me. Do you not know how to use reddit?",
                    "author": "soCalCurved",
                    "id": "gvfmzmb",
                    "parent_id": "t1_gvfi4up",
                    "score": -7,
                    "created_utc": 1619092428.0,
                    "replies": [
                        {
                            "body": "Do you? I'm replying to you in consequence to what you replied to the person you attached your comment to.",
                            "author": "ShaArt5",
                            "id": "gvfwb7a",
                            "parent_id": "t1_gvfmzmb",
                            "score": 6,
                            "created_utc": 1619097862.0,
                            "replies": []
                        },
                        {
                            "body": "Yikes buddy.",
                            "author": "_Fortuna_",
                            "id": "gvg0c11",
                            "parent_id": "t1_gvfmzmb",
                            "score": 4,
                            "created_utc": 1619099835.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Do you talk about it pre M&G or during? What kind of questions do you ask to figure out compatibility?",
            "author": "Babyspacecake",
            "id": "gvfujhh",
            "parent_id": "t1_gvfage2",
            "score": 1,
            "created_utc": 1619096940.0,
            "replies": [
                {
                    "body": "I do it most of the time during pre and then sometimes on M&G. But if you’re a SB, do it only if the SD brings it up",
                    "author": "soCalCurved",
                    "id": "gvgyurw",
                    "parent_id": "t1_gvfujhh",
                    "score": 1,
                    "created_utc": 1619114447.0,
                    "replies": [
                        {
                            "body": "[removed]",
                            "author": null,
                            "id": "gvhdwsq",
                            "parent_id": "t1_gvgyurw",
                            "score": 2,
                            "created_utc": 1619120863.0,
                            "replies": [
                                {
                                    "body": "Yes i’m an SD. I personally do PPM and i’m non-exclusive. I’m also young at 32 years old so a lot of SBs get along with me easy and I have been told refreshing.\nWith my style of relationship/arrangements, talking about money during pre and during the M&G have both been fine as everything is very casual, blunt and straight forward for me. Im not here to date and play guessing games because i don’t have the time so I enjoy the SB’s that can be on the same page like that.\n\nSome older guys might not like that if they want something more deep and thoughtful. Its kinda tricky. Money talk always feels weird even for me at first but its nice to finally get over that and come to an agreement with a new SB.",
                                    "author": "soCalCurved",
                                    "id": "gvhj2x6",
                                    "parent_id": "t1_gvhdwsq",
                                    "score": 2,
                                    "created_utc": 1619123075.0,
                                    "replies": [
                                        {
                                            "body": "Got it. Yes this is an older SD (63) and he is very careful with his words. I am pretty sure he wants deep and thoughtful (that’s actually how I describe myself in my profile - I’m a bit older than the typical SB). So I’m trying to carefully toe the line and it’s not easy! Thanks for your input.",
                                            "author": "Babyspacecake",
                                            "id": "gvhjl0t",
                                            "parent_id": "t1_gvhj2x6",
                                            "score": 2,
                                            "created_utc": 1619123290.0,
                                            "replies": [
                                                {
                                                    "body": "Good luck!!",
                                                    "author": "soCalCurved",
                                                    "id": "gvmxo7k",
                                                    "parent_id": "t1_gvhjl0t",
                                                    "score": 2,
                                                    "created_utc": 1619229007.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "See the [allowance master thread](https://www.reddit.com/r/sugarlifestyleforum/comments/76stil/allowance_master_thread/).",
                                    "author": "Fair_Meal1725",
                                    "id": "gvmm1m7",
                                    "parent_id": "t1_gvhdwsq",
                                    "score": 2,
                                    "created_utc": 1619222650.0,
                                    "replies": [
                                        {
                                            "body": "Thanks, but my city isn’t in there. =\\ I’ll probably just try to pick an average for the region.",
                                            "author": "Babyspacecake",
                                            "id": "gvpd97s",
                                            "parent_id": "t1_gvmm1m7",
                                            "score": 1,
                                            "created_utc": 1619274155.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "Removed for [Rule #4](/r/sugarlifestyleforum/comments/748zta/updated_and_clarified_rules_for_slf/):\n\n* No \"value for money\" discussions- Discussions about how to get the most value for your money are not allowed. Post Asking for or assigning a monetary value to sexual acts are not allowed. Assigning a monetary worth to individuals based on race, age, size,looks, etc., are not allowed. Post about how much allowance/ppm to ask for, give, is average, for such and such area or situation, will no longer be allowed on SLF. Any post of this nature will immediately be removed. There are many posts that covers this topic in our archives, please utilize the search feature to access them. Any posts with dollar amounts that are in reference to PPMs and/or allowances will be removed and are no longer allowed.",
                                    "author": "SeattleLaserMeteor",
                                    "id": "gvmv9pl",
                                    "parent_id": "t1_gvhdwsq",
                                    "score": 1,
                                    "created_utc": 1619227674.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I think that sounds sexier. But, wow, 14 downvotes say I am wrong.",
            "author": "Distinct-Animal-9628",
            "id": "gvlhiic",
            "parent_id": "t1_gvf9xw7",
            "score": 1,
            "created_utc": 1619203149.0,
            "replies": []
        },
        {
            "body": "Was I confusing? The types of comments described by the OP would be strongly opposed in the BDSm community.  I was agreeing with the comment I responded directly to (“Right”) and commenting on the language described by the OP. Clarification ok?",
            "author": "daddoms",
            "id": "gvin6a9",
            "parent_id": "t1_gvimkdy",
            "score": 1,
            "created_utc": 1619142009.0,
            "replies": [
                {
                    "body": "Ah, yes...I totally agree. I thought you were disagreeing with a different response that also condemned that domly dom.   🤗😘",
                    "author": "LadyMorgan2018",
                    "id": "gviqyb3",
                    "parent_id": "t1_gvin6a9",
                    "score": 1,
                    "created_utc": 1619143919.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Agreed! I’m replying to the person above me. Do you not know how to use reddit?",
            "author": "soCalCurved",
            "id": "gvfmzmb",
            "parent_id": "t1_gvfi4up",
            "score": -7,
            "created_utc": 1619092428.0,
            "replies": [
                {
                    "body": "Do you? I'm replying to you in consequence to what you replied to the person you attached your comment to.",
                    "author": "ShaArt5",
                    "id": "gvfwb7a",
                    "parent_id": "t1_gvfmzmb",
                    "score": 6,
                    "created_utc": 1619097862.0,
                    "replies": []
                },
                {
                    "body": "Yikes buddy.",
                    "author": "_Fortuna_",
                    "id": "gvg0c11",
                    "parent_id": "t1_gvfmzmb",
                    "score": 4,
                    "created_utc": 1619099835.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I do it most of the time during pre and then sometimes on M&G. But if you’re a SB, do it only if the SD brings it up",
            "author": "soCalCurved",
            "id": "gvgyurw",
            "parent_id": "t1_gvfujhh",
            "score": 1,
            "created_utc": 1619114447.0,
            "replies": [
                {
                    "body": "[removed]",
                    "author": null,
                    "id": "gvhdwsq",
                    "parent_id": "t1_gvgyurw",
                    "score": 2,
                    "created_utc": 1619120863.0,
                    "replies": [
                        {
                            "body": "Yes i’m an SD. I personally do PPM and i’m non-exclusive. I’m also young at 32 years old so a lot of SBs get along with me easy and I have been told refreshing.\nWith my style of relationship/arrangements, talking about money during pre and during the M&G have both been fine as everything is very casual, blunt and straight forward for me. Im not here to date and play guessing games because i don’t have the time so I enjoy the SB’s that can be on the same page like that.\n\nSome older guys might not like that if they want something more deep and thoughtful. Its kinda tricky. Money talk always feels weird even for me at first but its nice to finally get over that and come to an agreement with a new SB.",
                            "author": "soCalCurved",
                            "id": "gvhj2x6",
                            "parent_id": "t1_gvhdwsq",
                            "score": 2,
                            "created_utc": 1619123075.0,
                            "replies": [
                                {
                                    "body": "Got it. Yes this is an older SD (63) and he is very careful with his words. I am pretty sure he wants deep and thoughtful (that’s actually how I describe myself in my profile - I’m a bit older than the typical SB). So I’m trying to carefully toe the line and it’s not easy! Thanks for your input.",
                                    "author": "Babyspacecake",
                                    "id": "gvhjl0t",
                                    "parent_id": "t1_gvhj2x6",
                                    "score": 2,
                                    "created_utc": 1619123290.0,
                                    "replies": [
                                        {
                                            "body": "Good luck!!",
                                            "author": "soCalCurved",
                                            "id": "gvmxo7k",
                                            "parent_id": "t1_gvhjl0t",
                                            "score": 2,
                                            "created_utc": 1619229007.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "See the [allowance master thread](https://www.reddit.com/r/sugarlifestyleforum/comments/76stil/allowance_master_thread/).",
                            "author": "Fair_Meal1725",
                            "id": "gvmm1m7",
                            "parent_id": "t1_gvhdwsq",
                            "score": 2,
                            "created_utc": 1619222650.0,
                            "replies": [
                                {
                                    "body": "Thanks, but my city isn’t in there. =\\ I’ll probably just try to pick an average for the region.",
                                    "author": "Babyspacecake",
                                    "id": "gvpd97s",
                                    "parent_id": "t1_gvmm1m7",
                                    "score": 1,
                                    "created_utc": 1619274155.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Removed for [Rule #4](/r/sugarlifestyleforum/comments/748zta/updated_and_clarified_rules_for_slf/):\n\n* No \"value for money\" discussions- Discussions about how to get the most value for your money are not allowed. Post Asking for or assigning a monetary value to sexual acts are not allowed. Assigning a monetary worth to individuals based on race, age, size,looks, etc., are not allowed. Post about how much allowance/ppm to ask for, give, is average, for such and such area or situation, will no longer be allowed on SLF. Any post of this nature will immediately be removed. There are many posts that covers this topic in our archives, please utilize the search feature to access them. Any posts with dollar amounts that are in reference to PPMs and/or allowances will be removed and are no longer allowed.",
                            "author": "SeattleLaserMeteor",
                            "id": "gvmv9pl",
                            "parent_id": "t1_gvhdwsq",
                            "score": 1,
                            "created_utc": 1619227674.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Ah, yes...I totally agree. I thought you were disagreeing with a different response that also condemned that domly dom.   🤗😘",
            "author": "LadyMorgan2018",
            "id": "gviqyb3",
            "parent_id": "t1_gvin6a9",
            "score": 1,
            "created_utc": 1619143919.0,
            "replies": []
        },
        {
            "body": "Do you? I'm replying to you in consequence to what you replied to the person you attached your comment to.",
            "author": "ShaArt5",
            "id": "gvfwb7a",
            "parent_id": "t1_gvfmzmb",
            "score": 6,
            "created_utc": 1619097862.0,
            "replies": []
        },
        {
            "body": "Yikes buddy.",
            "author": "_Fortuna_",
            "id": "gvg0c11",
            "parent_id": "t1_gvfmzmb",
            "score": 4,
            "created_utc": 1619099835.0,
            "replies": []
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "gvhdwsq",
            "parent_id": "t1_gvgyurw",
            "score": 2,
            "created_utc": 1619120863.0,
            "replies": [
                {
                    "body": "Yes i’m an SD. I personally do PPM and i’m non-exclusive. I’m also young at 32 years old so a lot of SBs get along with me easy and I have been told refreshing.\nWith my style of relationship/arrangements, talking about money during pre and during the M&G have both been fine as everything is very casual, blunt and straight forward for me. Im not here to date and play guessing games because i don’t have the time so I enjoy the SB’s that can be on the same page like that.\n\nSome older guys might not like that if they want something more deep and thoughtful. Its kinda tricky. Money talk always feels weird even for me at first but its nice to finally get over that and come to an agreement with a new SB.",
                    "author": "soCalCurved",
                    "id": "gvhj2x6",
                    "parent_id": "t1_gvhdwsq",
                    "score": 2,
                    "created_utc": 1619123075.0,
                    "replies": [
                        {
                            "body": "Got it. Yes this is an older SD (63) and he is very careful with his words. I am pretty sure he wants deep and thoughtful (that’s actually how I describe myself in my profile - I’m a bit older than the typical SB). So I’m trying to carefully toe the line and it’s not easy! Thanks for your input.",
                            "author": "Babyspacecake",
                            "id": "gvhjl0t",
                            "parent_id": "t1_gvhj2x6",
                            "score": 2,
                            "created_utc": 1619123290.0,
                            "replies": [
                                {
                                    "body": "Good luck!!",
                                    "author": "soCalCurved",
                                    "id": "gvmxo7k",
                                    "parent_id": "t1_gvhjl0t",
                                    "score": 2,
                                    "created_utc": 1619229007.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "See the [allowance master thread](https://www.reddit.com/r/sugarlifestyleforum/comments/76stil/allowance_master_thread/).",
                    "author": "Fair_Meal1725",
                    "id": "gvmm1m7",
                    "parent_id": "t1_gvhdwsq",
                    "score": 2,
                    "created_utc": 1619222650.0,
                    "replies": [
                        {
                            "body": "Thanks, but my city isn’t in there. =\\ I’ll probably just try to pick an average for the region.",
                            "author": "Babyspacecake",
                            "id": "gvpd97s",
                            "parent_id": "t1_gvmm1m7",
                            "score": 1,
                            "created_utc": 1619274155.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Removed for [Rule #4](/r/sugarlifestyleforum/comments/748zta/updated_and_clarified_rules_for_slf/):\n\n* No \"value for money\" discussions- Discussions about how to get the most value for your money are not allowed. Post Asking for or assigning a monetary value to sexual acts are not allowed. Assigning a monetary worth to individuals based on race, age, size,looks, etc., are not allowed. Post about how much allowance/ppm to ask for, give, is average, for such and such area or situation, will no longer be allowed on SLF. Any post of this nature will immediately be removed. There are many posts that covers this topic in our archives, please utilize the search feature to access them. Any posts with dollar amounts that are in reference to PPMs and/or allowances will be removed and are no longer allowed.",
                    "author": "SeattleLaserMeteor",
                    "id": "gvmv9pl",
                    "parent_id": "t1_gvhdwsq",
                    "score": 1,
                    "created_utc": 1619227674.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yes i’m an SD. I personally do PPM and i’m non-exclusive. I’m also young at 32 years old so a lot of SBs get along with me easy and I have been told refreshing.\nWith my style of relationship/arrangements, talking about money during pre and during the M&G have both been fine as everything is very casual, blunt and straight forward for me. Im not here to date and play guessing games because i don’t have the time so I enjoy the SB’s that can be on the same page like that.\n\nSome older guys might not like that if they want something more deep and thoughtful. Its kinda tricky. Money talk always feels weird even for me at first but its nice to finally get over that and come to an agreement with a new SB.",
            "author": "soCalCurved",
            "id": "gvhj2x6",
            "parent_id": "t1_gvhdwsq",
            "score": 2,
            "created_utc": 1619123075.0,
            "replies": [
                {
                    "body": "Got it. Yes this is an older SD (63) and he is very careful with his words. I am pretty sure he wants deep and thoughtful (that’s actually how I describe myself in my profile - I’m a bit older than the typical SB). So I’m trying to carefully toe the line and it’s not easy! Thanks for your input.",
                    "author": "Babyspacecake",
                    "id": "gvhjl0t",
                    "parent_id": "t1_gvhj2x6",
                    "score": 2,
                    "created_utc": 1619123290.0,
                    "replies": [
                        {
                            "body": "Good luck!!",
                            "author": "soCalCurved",
                            "id": "gvmxo7k",
                            "parent_id": "t1_gvhjl0t",
                            "score": 2,
                            "created_utc": 1619229007.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "See the [allowance master thread](https://www.reddit.com/r/sugarlifestyleforum/comments/76stil/allowance_master_thread/).",
            "author": "Fair_Meal1725",
            "id": "gvmm1m7",
            "parent_id": "t1_gvhdwsq",
            "score": 2,
            "created_utc": 1619222650.0,
            "replies": [
                {
                    "body": "Thanks, but my city isn’t in there. =\\ I’ll probably just try to pick an average for the region.",
                    "author": "Babyspacecake",
                    "id": "gvpd97s",
                    "parent_id": "t1_gvmm1m7",
                    "score": 1,
                    "created_utc": 1619274155.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Removed for [Rule #4](/r/sugarlifestyleforum/comments/748zta/updated_and_clarified_rules_for_slf/):\n\n* No \"value for money\" discussions- Discussions about how to get the most value for your money are not allowed. Post Asking for or assigning a monetary value to sexual acts are not allowed. Assigning a monetary worth to individuals based on race, age, size,looks, etc., are not allowed. Post about how much allowance/ppm to ask for, give, is average, for such and such area or situation, will no longer be allowed on SLF. Any post of this nature will immediately be removed. There are many posts that covers this topic in our archives, please utilize the search feature to access them. Any posts with dollar amounts that are in reference to PPMs and/or allowances will be removed and are no longer allowed.",
            "author": "SeattleLaserMeteor",
            "id": "gvmv9pl",
            "parent_id": "t1_gvhdwsq",
            "score": 1,
            "created_utc": 1619227674.0,
            "replies": []
        },
        {
            "body": "Got it. Yes this is an older SD (63) and he is very careful with his words. I am pretty sure he wants deep and thoughtful (that’s actually how I describe myself in my profile - I’m a bit older than the typical SB). So I’m trying to carefully toe the line and it’s not easy! Thanks for your input.",
            "author": "Babyspacecake",
            "id": "gvhjl0t",
            "parent_id": "t1_gvhj2x6",
            "score": 2,
            "created_utc": 1619123290.0,
            "replies": [
                {
                    "body": "Good luck!!",
                    "author": "soCalCurved",
                    "id": "gvmxo7k",
                    "parent_id": "t1_gvhjl0t",
                    "score": 2,
                    "created_utc": 1619229007.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Thanks, but my city isn’t in there. =\\ I’ll probably just try to pick an average for the region.",
            "author": "Babyspacecake",
            "id": "gvpd97s",
            "parent_id": "t1_gvmm1m7",
            "score": 1,
            "created_utc": 1619274155.0,
            "replies": []
        },
        {
            "body": "Good luck!!",
            "author": "soCalCurved",
            "id": "gvmxo7k",
            "parent_id": "t1_gvhjl0t",
            "score": 2,
            "created_utc": 1619229007.0,
            "replies": []
        }
    ]
}