{
    "title": "How to reply to “are you seeing me just for the money” without lying while making him feel valued",
    "post_id": "m2gykx",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/m2gykx/how_to_reply_to_are_you_seeing_me_just_for_the/",
    "author": "Stingflare",
    "body": "Use this reply to make him feel special, valued, appreciated, and that you’re not with him ONLY for the money.\n\n“I became a sugar baby for financial support, among other things. So money is definitely very important to me.\n\n“But I have standards and won’t be with an SD who just give me lots of money. \n\n“I only want to be with SD that I enjoy hanging out with. I've screened and rejected many POT who offers me lots of money but we don't match. I really enjoy spending time with you and I have been having a really great time with you. \n\n“I really like that you... *&lt;Insert what you like about him, or what you have enjoyed. Give as specific details as possible. The more specific the better&gt;*\n\n*&lt;Praise him, boost his ego. Make him feel good about himself&gt;*\n\n*e.g I really like how you make me laugh. I really like that you always ask how I’m doing. I really like that you make sure I finish first. I like that you have a hot body. I like that you have a very big cock. I like how you make me feel. yada yada*\n\n\"I love how we... *&lt;insert what you like about the SR.&gt;*\n\n*e.g. how we connected so well without feeling awkward. How we have so many mutual interest.*\n\n“And I feel so lucky to have found you and have you as my SD. After reading all the horror stories about terrible SD, I’m just so glad to be with you.\n\n“So no, I’m NOT just seeing you for the money. Money is important to me, but so do the other things.\n\n*Then, if he’s not that insecure or if you really need to drive home the point:*\n\n\"But financial support is my top most priority right now like what I’ve mentioned  (And I won’t see you without money, if that’s what you’re really asking.)\n\n=\n\nBTW if you’re an SD, please don’t ever ask this question. There’s just no point to it, and will cause unnecessary discomfort to your SB",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/m2gykx/how_to_reply_to_are_you_seeing_me_just_for_the/",
    "score": 168,
    "upvote_ratio": 0.95,
    "created_utc": 1615433880.0,
    "num_comments": 77,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "\"You want the truth? You can't handle the truth!\"",
            "author": "non_giant_panda",
            "id": "gqj38y9",
            "parent_id": "t3_m2gykx",
            "score": 80,
            "created_utc": 1615434191.0,
            "replies": [
                {
                    "body": "Totally agree- my SD would have a hissy fit and lash out and call me a slut.  Just not worth the truth.  He knows it anyway.",
                    "author": "baronessblockage",
                    "id": "gqkt05u",
                    "parent_id": "t1_gqj38y9",
                    "score": 9,
                    "created_utc": 1615474270.0,
                    "replies": [
                        {
                            "body": "Sounds like your SD is a douche 🙃",
                            "author": "Stingflare",
                            "id": "gqrmj1j",
                            "parent_id": "t1_gqkt05u",
                            "score": 1,
                            "created_utc": 1615607917.0,
                            "replies": [
                                {
                                    "body": "Yes, he is.  Then after the lashing out, he will send me a gift.  He is quite immature.  I am getting sick of him and thinking of ending it.  He kind of senses this and whined that I am slipping from him.  Ya think?",
                                    "author": "baronessblockage",
                                    "id": "gqtbvms",
                                    "parent_id": "t1_gqrmj1j",
                                    "score": 1,
                                    "created_utc": 1615655401.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "😂🤣😂🤣",
                    "author": "Milnvirg2019",
                    "id": "gqk5206",
                    "parent_id": "t1_gqj38y9",
                    "score": 7,
                    "created_utc": 1615459252.0,
                    "replies": []
                },
                {
                    "body": "You can tell the truth without hurting his feelings (too much).",
                    "author": "Stingflare",
                    "id": "gqj3iiz",
                    "parent_id": "t1_gqj38y9",
                    "score": 18,
                    "created_utc": 1615434343.0,
                    "replies": [
                        {
                            "body": "Just tell them \"it started with the money, but now Im with you for the sex\".  You could skip all the ego boosting above!",
                            "author": "redeye87",
                            "id": "gqkn8p5",
                            "parent_id": "t1_gqj3iiz",
                            "score": -4,
                            "created_utc": 1615471394.0,
                            "replies": [
                                {
                                    "body": "This is the worst possible answer 😂 it would be giving the SD permission to say “alright then let’s just have sex without financial support”",
                                    "author": "Stingflare",
                                    "id": "gqkp0k0",
                                    "parent_id": "t1_gqkn8p5",
                                    "score": 27,
                                    "created_utc": 1615472314.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Ikr!?? 😂😂😂",
                    "author": "HJ71",
                    "id": "gqkuoe5",
                    "parent_id": "t1_gqj38y9",
                    "score": 1,
                    "created_utc": 1615475047.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "\"would you still support me if I didn't give you any intimacy or affection?\"  \n\n\ni need to tell my SB in advance, to slap me if I ever seriously asked her that kind of baited question.",
            "author": "bluelunarmonkey",
            "id": "gqj67i1",
            "parent_id": "t3_m2gykx",
            "score": 76,
            "created_utc": 1615436091.0,
            "replies": [
                {
                    "body": "\"Would you still support me if I'm old and wrinkled?\"",
                    "author": "Stingflare",
                    "id": "gqj6ggk",
                    "parent_id": "t1_gqj67i1",
                    "score": 27,
                    "created_utc": 1615436242.0,
                    "replies": [
                        {
                            "body": "Will you sill need me, will you still fed me, when I'm 64",
                            "author": "BinghamtonSD",
                            "id": "gqkb4pm",
                            "parent_id": "t1_gqj6ggk",
                            "score": 22,
                            "created_utc": 1615463478.0,
                            "replies": []
                        },
                        {
                            "body": "there you go!",
                            "author": "bluelunarmonkey",
                            "id": "gqk3map",
                            "parent_id": "t1_gqj6ggk",
                            "score": 6,
                            "created_utc": 1615458230.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "This is what every online SB wants to know.",
                    "author": "UnearthlyDinosaur",
                    "id": "gqm1u1w",
                    "parent_id": "t1_gqj67i1",
                    "score": 2,
                    "created_utc": 1615493934.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "This is honestly the kind of baited, manipulative question that shouldn’t be asked in most SRs. It’s like the SB asking, “How would you feel about financially supporting me if I no longer wanted to be intimate?” I know that platonic SRs exist—I quite accidentally found myself in one for a while—but most SDs would politely decline, and would be justified in doing so. \n\nLikewise, most SBs would quickly take their leave if their SD suddenly stopped providing financial support, and pretending that isn’t true is delusional at worst, and willfully ignorant at best. However, no SD wants to hear that, and none of us wants to *say* it. Of course I only choose SDs that I genuinely connect with, find attractive, enjoying spending time with and truly appreciate as people! I don’t waste my time with anyone I don’t actually like, so I’m not *technically* just with them for financial support because I could also get that from many SDs I’m not at all interested in. I always feel deeply for whomever I’m seeing and care for them, on a personal level. I make sure to say this, often! What I don’t want to say is, “No, I’m not only with you for the money,” because I feel it opens a can of worms that might quickly make a mess of everything. \n\nAny SD that asks a question like this is doing so to either have you stroke his ego, or use your answer against you as a weapon, down the line. If I say yes (which isn’t true, but also isn’t entirely untrue), I sound like a shallow bitch. If I say no, he might take advantage of that out of context and try to rope me into a vanilla relationship, when I absolutely didn’t agree to ever doing such a thing. I make my terms and expectations clear from the M&G, and expect any SD to do the same without exception. I’d quite frankly say, “I’m not sure why you’re even asking, babe. I thought we were on the same page regarding this SR. I feel as though a question like this sets me up to fail regardless of the answer, which is pretty unfair.”\n\nEdit: all that said, if this question *is* asked and you *don’t* mind answering it, I definitely agree that OP’s example of how to respond is a good one! \n\nI wasn’t at all trying to take away from that.",
            "author": "FoxyFreckles1989",
            "id": "gqjl1cj",
            "parent_id": "t3_m2gykx",
            "score": 20,
            "created_utc": 1615445049.0,
            "replies": [
                {
                    "body": "Thanks for adding the edited portion 😂\n\nYeah this question should never be asked for the reasons you mentioned.\n\nBut some SDs are dumb so the point of my post is to be able to answer truthfully without unnecessary tension and drama. Or create more negative feelings",
                    "author": "Stingflare",
                    "id": "gqjyjpp",
                    "parent_id": "t1_gqjl1cj",
                    "score": 3,
                    "created_utc": 1615454263.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Not sure why everyone can't just be honest about the situation. The SB and SD both know why they're doing what they're doing.\n\n\nThat being said a sugar relationship violates the cardinal rule \"don't mix business with pleasure\". It's way too easy to think the relationship is something that it isn't.",
            "author": null,
            "id": "gqjgrv8",
            "parent_id": "t3_m2gykx",
            "score": 32,
            "created_utc": 1615442460.0,
            "replies": [
                {
                    "body": "Yeah exactly. Though SDs still ask this question even though they already know the answer 🤷‍♂️",
                    "author": "Stingflare",
                    "id": "gqjgx09",
                    "parent_id": "t1_gqjgrv8",
                    "score": 11,
                    "created_utc": 1615442554.0,
                    "replies": [
                        {
                            "body": "On the other side I've heard SBs wonder whether the SD would stay if she stopped fucking him. A lot of SBs are very reluctant to admit they're trading sex for money and vice versa.",
                            "author": null,
                            "id": "gqjhptg",
                            "parent_id": "t1_gqjgx09",
                            "score": 9,
                            "created_utc": 1615443066.0,
                            "replies": [
                                {
                                    "body": "The difference is SBs will never ask “are you only seeing me just for sex?”\n\nGoes to show that most guys are just dumb 🤣",
                                    "author": "Stingflare",
                                    "id": "gqji3qe",
                                    "parent_id": "t1_gqjhptg",
                                    "score": 21,
                                    "created_utc": 1615443290.0,
                                    "replies": [
                                        {
                                            "body": "Yeah no SB is under the delusion like \"You'll keep giving me money if I completely stop having sex w you or looking cute right\" lmao",
                                            "author": "ColdHeaux",
                                            "id": "gqjlu9i",
                                            "parent_id": "t1_gqji3qe",
                                            "score": 12,
                                            "created_utc": 1615445556.0,
                                            "replies": [
                                                {
                                                    "body": "Yeah exactly",
                                                    "author": "Stingflare",
                                                    "id": "gqjoamx",
                                                    "parent_id": "t1_gqjlu9i",
                                                    "score": 5,
                                                    "created_utc": 1615447120.0,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "body": ">The difference is SBs will never ask “are you only seeing me just for sex?”\n\nThey may not ask it, but if my SB asked me this, the answer would be a similar to your original post... not JUST for the sex. Yes, is the amazing sex with a woman out of my league the crucial part of this.... sure. That we enjoy hanging out, having dinner, watching movies, playing games, talking about anything and everything under the sun. It's not JUST the sex. If the sex was great, but  it lacked the overall chemistry and connection, I'm not sure I would want to continue.",
                                            "author": "BinghamtonSD",
                                            "id": "gqkbjfi",
                                            "parent_id": "t1_gqji3qe",
                                            "score": 5,
                                            "created_utc": 1615463808.0,
                                            "replies": [
                                                {
                                                    "body": "Yeah definitely.",
                                                    "author": "Stingflare",
                                                    "id": "gqkc3ka",
                                                    "parent_id": "t1_gqkbjfi",
                                                    "score": 1,
                                                    "created_utc": 1615464254.0,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "body": "Or feel like they have a right to ask (entitlement). Most SBs wouldn't ask about if he'd date her if they didn't have sex because of the drama and emotional distress it could cause.",
                                            "author": null,
                                            "id": "gqjwft2",
                                            "parent_id": "t1_gqji3qe",
                                            "score": 4,
                                            "created_utc": 1615452733.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "I guess sugar mamas don’t exist smh",
                                            "author": "Resident-Leader",
                                            "id": "gqki3ho",
                                            "parent_id": "t1_gqji3qe",
                                            "score": 0,
                                            "created_utc": 1615468457.0,
                                            "replies": [
                                                {
                                                    "body": "They exist in the same sphere as unicorns",
                                                    "author": "wildhorses6565",
                                                    "id": "gqkkghz",
                                                    "parent_id": "t1_gqki3ho",
                                                    "score": 5,
                                                    "created_utc": 1615469868.0,
                                                    "replies": []
                                                },
                                                {
                                                    "body": "😂😂😂 I don’t have enough data on SMs to comment on that",
                                                    "author": "Stingflare",
                                                    "id": "gqkiv2v",
                                                    "parent_id": "t1_gqki3ho",
                                                    "score": 2,
                                                    "created_utc": 1615468930.0,
                                                    "replies": []
                                                },
                                                {
                                                    "body": "They definitely do exist but not on the online sphere",
                                                    "author": null,
                                                    "id": "gqkmxn0",
                                                    "parent_id": "t1_gqki3ho",
                                                    "score": 2,
                                                    "created_utc": 1615471227.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "its shades of grey.  hard not to mix emotion with someone you enjoy being with regardless of how you met.",
                    "author": "Buckeyechamp21",
                    "id": "gqkqcxm",
                    "parent_id": "t1_gqjgrv8",
                    "score": 1,
                    "created_utc": 1615472984.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "This is really good.",
            "author": null,
            "id": "gqj36ss",
            "parent_id": "t3_m2gykx",
            "score": 19,
            "created_utc": 1615434158.0,
            "replies": [
                {
                    "body": "Glad you found it useful :)",
                    "author": "Stingflare",
                    "id": "gqj6r9l",
                    "parent_id": "t1_gqj36ss",
                    "score": 8,
                    "created_utc": 1615436426.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "They don’t want the truth. They want you to support their delusion that you like them for who they are blah blah blah.",
            "author": "GuideParty9434",
            "id": "gqku7l3",
            "parent_id": "t3_m2gykx",
            "score": 4,
            "created_utc": 1615474834.0,
            "replies": [
                {
                    "body": "But you can give them both",
                    "author": "Stingflare",
                    "id": "gqkuri2",
                    "parent_id": "t1_gqku7l3",
                    "score": 1,
                    "created_utc": 1615475087.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Just say that you love to spend time with him, but it takes you away from a job that you could be doing as to pay rent, etc and that is why you are asking for financial support. Things, like your time, and spending time looking good, is not free.",
            "author": "peterharris100",
            "id": "gql5d69",
            "parent_id": "t3_m2gykx",
            "score": 4,
            "created_utc": 1615479883.0,
            "replies": []
        },
        {
            "body": "For long term SRs, I've generally found that if I even *want* to ask my SB this question more than just once in a blue moon... it means the end of the SR is right around the corner, and rather than posing the question to her...its better to either double down on the effort I'm putting in and see if it makes a difference at all to her, or to start thinking about ending it (or both).",
            "author": "Gemini-Fox",
            "id": "gqj67xv",
            "parent_id": "t3_m2gykx",
            "score": 8,
            "created_utc": 1615436099.0,
            "replies": [
                {
                    "body": "Sometimes SD found that they really like the SB (and may even have feelings for them) and would wish that they didn't give to keep giving financial support",
                    "author": "Stingflare",
                    "id": "gqj6j0e",
                    "parent_id": "t1_gqj67xv",
                    "score": 6,
                    "created_utc": 1615436285.0,
                    "replies": [
                        {
                            "body": " and would wish that they ~~didn't give to keep giving financial support~~  could date their SBs vanilla\n\nThe problem is, they can't.  It's the same as a girl having an affair wishing her married guy finally gets a divorce and picks her.  It's 99.9999% fantasy.",
                            "author": "Gemini-Fox",
                            "id": "gqj6ziz",
                            "parent_id": "t1_gqj6j0e",
                            "score": 14,
                            "created_utc": 1615436565.0,
                            "replies": [
                                {
                                    "body": "Yep. But probably also why they ask this question",
                                    "author": "Stingflare",
                                    "id": "gqj75em",
                                    "parent_id": "t1_gqj6ziz",
                                    "score": 5,
                                    "created_utc": 1615436666.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "What if we enjoy helping out?\n\nWhen I’m in a “vanilla” relationship (whatever that is) I still get pretty sparkly things and take nice trips..  these new style SR are actually less expensive — trust me.",
                            "author": "daddoms",
                            "id": "gqj88t4",
                            "parent_id": "t1_gqj6j0e",
                            "score": 3,
                            "created_utc": 1615437347.0,
                            "replies": [
                                {
                                    "body": "While this is a good point, I’m not in a SR to be gifted sparkly things and go on trips. Those things are very nice in addition to financial support, but if I had to choose, I’d much rather have the money to save, get ahead on bills, buy things I actually *need* and go after goals I have for myself. I know there are plenty of SBs out there that sugar in order to live lavish lifestyles, but there are also plenty of us that don’t prioritize that.\n\nI don’t enter a SR with a SD I don’t enjoy spending time with, talking to, or fucking. I just also want financial support.",
                                    "author": "FoxyFreckles1989",
                                    "id": "gqjlzec",
                                    "parent_id": "t1_gqj88t4",
                                    "score": 6,
                                    "created_utc": 1615445656.0,
                                    "replies": [
                                        {
                                            "body": "Yep...I want that cash first and foremost. I can't pay rent with jewelry (but please, DO get jewelry as well after my allowance is taken care of!!).",
                                            "author": "Pixie_Lizard",
                                            "id": "gqkdm9f",
                                            "parent_id": "t1_gqjlzec",
                                            "score": 3,
                                            "created_utc": 1615465408.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "That’s the point. I was referring to “vanilla” in quotes — from my point of view gifts and trips are just as expensive as allowance.\n\nThis question could be rephrased: “are you seeing me just for the trips to (nyc, paris, Disney, Croatia)?”\n\n“Are you seeing me just for rides in my Lamborghini?” — I don’t have one but dude, why are you flaunting money, for street cred with your bros?",
                                            "author": "daddoms",
                                            "id": "gqkiiqv",
                                            "parent_id": "t1_gqjlzec",
                                            "score": 2,
                                            "created_utc": 1615468722.0,
                                            "replies": [
                                                {
                                                    "body": "Oh! Goodness. So you meant the *question* could be asked in a vanilla relationship? That would be a much more appropriate relationship *to* ask such a thing inside of!",
                                                    "author": "FoxyFreckles1989",
                                                    "id": "gqkmqwl",
                                                    "parent_id": "t1_gqkiiqv",
                                                    "score": 1,
                                                    "created_utc": 1615471127.0,
                                                    "replies": [
                                                        {
                                                            "body": "If by “vanilla” we are talking about relationships where no prior arrangement is negotiated, expectations come up “are we headed toward marriage?” ... which includes financial support ...  “do you want to date me because of my social status?” etc etc etc",
                                                            "author": "daddoms",
                                                            "id": "gqkpw9d",
                                                            "parent_id": "t1_gqkmqwl",
                                                            "score": 2,
                                                            "created_utc": 1615472756.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "Then there’s no issue at all right?",
                                    "author": "Stingflare",
                                    "id": "gqj8eiz",
                                    "parent_id": "t1_gqj88t4",
                                    "score": 3,
                                    "created_utc": 1615437447.0,
                                    "replies": [
                                        {
                                            "body": "It’s all good.",
                                            "author": "daddoms",
                                            "id": "gqj9hdb",
                                            "parent_id": "t1_gqj8eiz",
                                            "score": 3,
                                            "created_utc": 1615438141.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "This is how I always sugared. It just happened naturally. I never had to negotiate an arrangement. Gifts, trips, and allowance just occurred.",
                                    "author": null,
                                    "id": "gqjwocf",
                                    "parent_id": "t1_gqj88t4",
                                    "score": 1,
                                    "created_utc": 1615452911.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "While developing feelings is natural (and I would honestly be worried if neither party did, on some level, unless they’re very casual and just meet up once or twice a month for intimacy), “really liking,” the SB isn’t a reason to stop offering financial support. Almost every SR will remain just that, a *sugar relationship,* until it ends. Transitions to vanilla relationships are uncommon. If anything, a SR transitioning to something “more serious” will still involve financial support/gifts/trips etc., and the parties involved will become SBF/SGF. \n\nIf I “really like” my SD, is that a reason to stop being intimate? What if I decide I like him so much I’d marry him, and say, “now that we’re engaged I would like to save intimacy for our wedding night so it’s *special*?” Such an abrupt and extreme change would probably be unacceptable in the eyes of the SD. Same goes for financial support, in most cases.\n\nWhen the SR begins, terms and expectations from both sides should be thoroughly discussed and agreed to. Those terms should rarely be changed. In most cases, a change will mean more of something—a higher allowance from the SD and more time/dates/intimacy from the SB, for example. Not less. I have a friend who is happily married to her SD. He financially supports them, she raises their son, *and* he still gives her a monthly allowance (that’s quite generous).",
                            "author": "FoxyFreckles1989",
                            "id": "gqkn9ci",
                            "parent_id": "t1_gqj6j0e",
                            "score": 1,
                            "created_utc": 1615471404.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "gqkriqm",
                    "parent_id": "t1_gqj67xv",
                    "score": 1,
                    "created_utc": 1615473560.0,
                    "replies": [
                        {
                            "body": "1000 miles is 1609.34 km",
                            "author": "converter-bot",
                            "id": "gqkrji7",
                            "parent_id": "t1_gqkriqm",
                            "score": 1,
                            "created_utc": 1615473571.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "\"What do you think?\"",
            "author": "extracheese343y",
            "id": "gqjyj61",
            "parent_id": "t3_m2gykx",
            "score": 2,
            "created_utc": 1615454252.0,
            "replies": [
                {
                    "body": "I like this answer 😂 but it might create unnecessary tension",
                    "author": "Stingflare",
                    "id": "gqjyltf",
                    "parent_id": "t1_gqjyj61",
                    "score": 3,
                    "created_utc": 1615454311.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "If my SB said she wasn’t just interested in the money I’d drop her cause I’d know she was lying to me 😂😂😂🤣🤣🤣🤣🤣",
            "author": "UnearthlyDinosaur",
            "id": "gqllpfa",
            "parent_id": "t3_m2gykx",
            "score": 2,
            "created_utc": 1615486924.0,
            "replies": []
        },
        {
            "body": "Of course you are and SDs know this, it’s what a SR is about.  But that doesn’t mean we like to have our noses rubbed in it...",
            "author": "Zaisengoro",
            "id": "gqnedco",
            "parent_id": "t3_m2gykx",
            "score": 2,
            "created_utc": 1615517948.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gqjexsp",
            "parent_id": "t3_m2gykx",
            "score": 1,
            "created_utc": 1615441398.0,
            "replies": [
                {
                    "body": "Mental convolutions?",
                    "author": "Stingflare",
                    "id": "gqjf3m8",
                    "parent_id": "t1_gqjexsp",
                    "score": 2,
                    "created_utc": 1615441487.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Do Sugar babies think the same?  Like are they worried that daddies only want them for their looks or body? 😂",
            "author": "midwestsweetking",
            "id": "gqjmm4a",
            "parent_id": "t3_m2gykx",
            "score": 1,
            "created_utc": 1615446055.0,
            "replies": [
                {
                    "body": "SBs are smarter than most SDs and probably won’t ask the question 😂",
                    "author": "Stingflare",
                    "id": "gqjofob",
                    "parent_id": "t1_gqjmm4a",
                    "score": 9,
                    "created_utc": 1615447216.0,
                    "replies": []
                },
                {
                    "body": "Trust me, we know. I think for the most part we’re okay with it. Though I can’t speak for everyone. 🤷🏼‍♀️",
                    "author": "christinamatteson",
                    "id": "gqk56y4",
                    "parent_id": "t1_gqjmm4a",
                    "score": 5,
                    "created_utc": 1615459358.0,
                    "replies": []
                },
                {
                    "body": "Yeah, we definitely know. For me, this is all about money. Anything else is secondary and supplemental. As I replied to on SD who seemed surprised I was looking for an allowance, \"Well, I'm on SA for a reason.\"\n\nDon't be so fucking thick. \n\nThe way I often respond to this question (which I agree is a ridiculous question to ask) is to say, \"Look, the money is really helpful, and it has helped make life much easier for me. But it's not ALL about the money. I do like you [for x, y, z, reasons] and love spending time with you, and the money helps me have a more comfortable lifestyle.\"\n\nBut really...don't ask SBs this question. You will either get your feelings hurt or lied to in some capacity.",
                    "author": "Pixie_Lizard",
                    "id": "gqkdcwk",
                    "parent_id": "t1_gqjmm4a",
                    "score": 5,
                    "created_utc": 1615465217.0,
                    "replies": [
                        {
                            "body": "Yeah exactly my point",
                            "author": "Stingflare",
                            "id": "gqkjf2k",
                            "parent_id": "t1_gqkdcwk",
                            "score": 2,
                            "created_utc": 1615469265.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gqjnb90",
            "parent_id": "t3_m2gykx",
            "score": 1,
            "created_utc": 1615446499.0,
            "replies": [
                {
                    "body": "While there’s really no point in asking this question, if the SD ever asks it, then there are responses that will cause even more unnecessary tension and drama. \n\nThe point of this post is to show that you can answer it truthfully while making the SD happy as well",
                    "author": "Stingflare",
                    "id": "gqjouea",
                    "parent_id": "t1_gqjnb90",
                    "score": 3,
                    "created_utc": 1615447505.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "People rag on SBs for asking for financial support without giving it up, but then this. Okay. \n\nWe all want the complete package and we would like to think we are that to others, I get it. Feeling like someone only tolerates you is a bad feeling. Maybe if you feel like you have to ask that question there's actually other questions you need to ask more, because you're feeling something amiss in your relationship. Asking a pointed question like that is unproductive. What is making you feel only just tolerated? Are you not feeling like you have much to talk about, are you having trouble connecting emotionally? Is something troubling them and it is bleeding over into your time together? \n\nIt just seems like a very argumentative, immature question that requires an SB to manage your emotions rather than fixing anything. You're both still people, this is still a kind of relationship- you might need to communicate and work stuff out.",
            "author": "oneangstybiscuit",
            "id": "gqkxjn4",
            "parent_id": "t3_m2gykx",
            "score": 1,
            "created_utc": 1615476361.0,
            "replies": []
        },
        {
            "body": "plot twist: you're actually not seeing him just for his money",
            "author": null,
            "id": "gqlesoi",
            "parent_id": "t3_m2gykx",
            "score": 1,
            "created_utc": 1615483978.0,
            "replies": []
        },
        {
            "body": "Reading the comments in these always shock me you guys really all have sex for money. That’s okay I guess but you’re selling your body for money... YOU are.... there is such a thing as platonic sugar relationships Jesus have some self respect and maybe you won’t need to have sex with someone you don’t want to for money",
            "author": "Resident-Leader",
            "id": "gqkjpp2",
            "parent_id": "t3_m2gykx",
            "score": -4,
            "created_utc": 1615469436.0,
            "replies": [
                {
                    "body": "Why are you even here 🤣🤣🤣",
                    "author": "Stingflare",
                    "id": "gqkk6tv",
                    "parent_id": "t1_gqkjpp2",
                    "score": 6,
                    "created_utc": 1615469713.0,
                    "replies": [
                        {
                            "body": "Seems like a sarcastic post.  Person is just trying to be funny.  Who ever heard of a truly platonic sugar relationship?",
                            "author": "baronessblockage",
                            "id": "gql4g6f",
                            "parent_id": "t1_gqkk6tv",
                            "score": 0,
                            "created_utc": 1615479472.0,
                            "replies": [
                                {
                                    "body": "There is such a thing try having some self respect and you might find one vice did a story on a dude from miami that has tons of sb’s it’s not about sexual shit at some point",
                                    "author": "Resident-Leader",
                                    "id": "gs1vhrf",
                                    "parent_id": "t1_gql4g6f",
                                    "score": 1,
                                    "created_utc": 1616596112.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "This is very disingenuous.\n\nSugar arrangements ought to be dating with financial support. If you have no attraction to the man you are dating then you are simply escorting.  Don't lie to yourself or your SD, be an escort and provide GFE",
            "author": "anonymoustruth_99",
            "id": "gqojjog",
            "parent_id": "t3_m2gykx",
            "score": 0,
            "created_utc": 1615550395.0,
            "replies": []
        },
        {
            "body": "I’m way too drunk to answer this question honestly.",
            "author": "HydeParkDaddy",
            "id": "gqjssx1",
            "parent_id": "t3_m2gykx",
            "score": -2,
            "created_utc": 1615450134.0,
            "replies": []
        },
        {
            "body": "I’ve always mention in these arrangements. Don’t ever ask the question you don’t want to hear the answer for.",
            "author": "SingleCondition4",
            "id": "gqksl4t",
            "parent_id": "t3_m2gykx",
            "score": 1,
            "created_utc": 1615474072.0,
            "replies": [
                {
                    "body": "That’s a good way to set expectations",
                    "author": "Stingflare",
                    "id": "gqkuun6",
                    "parent_id": "t1_gqksl4t",
                    "score": 1,
                    "created_utc": 1615475127.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Whenever an SD asks this question- an SB response should be some variation of ...why are you with me?   \n\nMaybe a....well are you only with me because I'm _______, and I do that thing you like? And when he replies- no I'm with you because _______.  You should reply me too, or yeah- that!😂😂😂",
            "author": "HJ71",
            "id": "gqkwgc5",
            "parent_id": "t3_m2gykx",
            "score": 1,
            "created_utc": 1615475863.0,
            "replies": []
        },
        {
            "body": "Rebuttal with are you seeing me just for sex?!  The end.  🤣",
            "author": null,
            "id": "gqn8407",
            "parent_id": "t3_m2gykx",
            "score": 1,
            "created_utc": 1615514626.0,
            "replies": []
        },
        {
            "body": "Say partially but I also enjoy your company or maybe say kind of but there’s many other sugar daddy’s but I picked you",
            "author": "Deathlydolly",
            "id": "gqysk0z",
            "parent_id": "t3_m2gykx",
            "score": 1,
            "created_utc": 1615770403.0,
            "replies": []
        },
        {
            "body": "Totally agree- my SD would have a hissy fit and lash out and call me a slut.  Just not worth the truth.  He knows it anyway.",
            "author": "baronessblockage",
            "id": "gqkt05u",
            "parent_id": "t1_gqj38y9",
            "score": 9,
            "created_utc": 1615474270.0,
            "replies": [
                {
                    "body": "Sounds like your SD is a douche 🙃",
                    "author": "Stingflare",
                    "id": "gqrmj1j",
                    "parent_id": "t1_gqkt05u",
                    "score": 1,
                    "created_utc": 1615607917.0,
                    "replies": [
                        {
                            "body": "Yes, he is.  Then after the lashing out, he will send me a gift.  He is quite immature.  I am getting sick of him and thinking of ending it.  He kind of senses this and whined that I am slipping from him.  Ya think?",
                            "author": "baronessblockage",
                            "id": "gqtbvms",
                            "parent_id": "t1_gqrmj1j",
                            "score": 1,
                            "created_utc": 1615655401.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "😂🤣😂🤣",
            "author": "Milnvirg2019",
            "id": "gqk5206",
            "parent_id": "t1_gqj38y9",
            "score": 7,
            "created_utc": 1615459252.0,
            "replies": []
        },
        {
            "body": "You can tell the truth without hurting his feelings (too much).",
            "author": "Stingflare",
            "id": "gqj3iiz",
            "parent_id": "t1_gqj38y9",
            "score": 18,
            "created_utc": 1615434343.0,
            "replies": [
                {
                    "body": "Just tell them \"it started with the money, but now Im with you for the sex\".  You could skip all the ego boosting above!",
                    "author": "redeye87",
                    "id": "gqkn8p5",
                    "parent_id": "t1_gqj3iiz",
                    "score": -4,
                    "created_utc": 1615471394.0,
                    "replies": [
                        {
                            "body": "This is the worst possible answer 😂 it would be giving the SD permission to say “alright then let’s just have sex without financial support”",
                            "author": "Stingflare",
                            "id": "gqkp0k0",
                            "parent_id": "t1_gqkn8p5",
                            "score": 27,
                            "created_utc": 1615472314.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Ikr!?? 😂😂😂",
            "author": "HJ71",
            "id": "gqkuoe5",
            "parent_id": "t1_gqj38y9",
            "score": 1,
            "created_utc": 1615475047.0,
            "replies": []
        },
        {
            "body": "\"Would you still support me if I'm old and wrinkled?\"",
            "author": "Stingflare",
            "id": "gqj6ggk",
            "parent_id": "t1_gqj67i1",
            "score": 27,
            "created_utc": 1615436242.0,
            "replies": [
                {
                    "body": "Will you sill need me, will you still fed me, when I'm 64",
                    "author": "BinghamtonSD",
                    "id": "gqkb4pm",
                    "parent_id": "t1_gqj6ggk",
                    "score": 22,
                    "created_utc": 1615463478.0,
                    "replies": []
                },
                {
                    "body": "there you go!",
                    "author": "bluelunarmonkey",
                    "id": "gqk3map",
                    "parent_id": "t1_gqj6ggk",
                    "score": 6,
                    "created_utc": 1615458230.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "This is what every online SB wants to know.",
            "author": "UnearthlyDinosaur",
            "id": "gqm1u1w",
            "parent_id": "t1_gqj67i1",
            "score": 2,
            "created_utc": 1615493934.0,
            "replies": []
        },
        {
            "body": "Thanks for adding the edited portion 😂\n\nYeah this question should never be asked for the reasons you mentioned.\n\nBut some SDs are dumb so the point of my post is to be able to answer truthfully without unnecessary tension and drama. Or create more negative feelings",
            "author": "Stingflare",
            "id": "gqjyjpp",
            "parent_id": "t1_gqjl1cj",
            "score": 3,
            "created_utc": 1615454263.0,
            "replies": []
        },
        {
            "body": "Yeah exactly. Though SDs still ask this question even though they already know the answer 🤷‍♂️",
            "author": "Stingflare",
            "id": "gqjgx09",
            "parent_id": "t1_gqjgrv8",
            "score": 11,
            "created_utc": 1615442554.0,
            "replies": [
                {
                    "body": "On the other side I've heard SBs wonder whether the SD would stay if she stopped fucking him. A lot of SBs are very reluctant to admit they're trading sex for money and vice versa.",
                    "author": null,
                    "id": "gqjhptg",
                    "parent_id": "t1_gqjgx09",
                    "score": 9,
                    "created_utc": 1615443066.0,
                    "replies": [
                        {
                            "body": "The difference is SBs will never ask “are you only seeing me just for sex?”\n\nGoes to show that most guys are just dumb 🤣",
                            "author": "Stingflare",
                            "id": "gqji3qe",
                            "parent_id": "t1_gqjhptg",
                            "score": 21,
                            "created_utc": 1615443290.0,
                            "replies": [
                                {
                                    "body": "Yeah no SB is under the delusion like \"You'll keep giving me money if I completely stop having sex w you or looking cute right\" lmao",
                                    "author": "ColdHeaux",
                                    "id": "gqjlu9i",
                                    "parent_id": "t1_gqji3qe",
                                    "score": 12,
                                    "created_utc": 1615445556.0,
                                    "replies": [
                                        {
                                            "body": "Yeah exactly",
                                            "author": "Stingflare",
                                            "id": "gqjoamx",
                                            "parent_id": "t1_gqjlu9i",
                                            "score": 5,
                                            "created_utc": 1615447120.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": ">The difference is SBs will never ask “are you only seeing me just for sex?”\n\nThey may not ask it, but if my SB asked me this, the answer would be a similar to your original post... not JUST for the sex. Yes, is the amazing sex with a woman out of my league the crucial part of this.... sure. That we enjoy hanging out, having dinner, watching movies, playing games, talking about anything and everything under the sun. It's not JUST the sex. If the sex was great, but  it lacked the overall chemistry and connection, I'm not sure I would want to continue.",
                                    "author": "BinghamtonSD",
                                    "id": "gqkbjfi",
                                    "parent_id": "t1_gqji3qe",
                                    "score": 5,
                                    "created_utc": 1615463808.0,
                                    "replies": [
                                        {
                                            "body": "Yeah definitely.",
                                            "author": "Stingflare",
                                            "id": "gqkc3ka",
                                            "parent_id": "t1_gqkbjfi",
                                            "score": 1,
                                            "created_utc": 1615464254.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "Or feel like they have a right to ask (entitlement). Most SBs wouldn't ask about if he'd date her if they didn't have sex because of the drama and emotional distress it could cause.",
                                    "author": null,
                                    "id": "gqjwft2",
                                    "parent_id": "t1_gqji3qe",
                                    "score": 4,
                                    "created_utc": 1615452733.0,
                                    "replies": []
                                },
                                {
                                    "body": "I guess sugar mamas don’t exist smh",
                                    "author": "Resident-Leader",
                                    "id": "gqki3ho",
                                    "parent_id": "t1_gqji3qe",
                                    "score": 0,
                                    "created_utc": 1615468457.0,
                                    "replies": [
                                        {
                                            "body": "They exist in the same sphere as unicorns",
                                            "author": "wildhorses6565",
                                            "id": "gqkkghz",
                                            "parent_id": "t1_gqki3ho",
                                            "score": 5,
                                            "created_utc": 1615469868.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "😂😂😂 I don’t have enough data on SMs to comment on that",
                                            "author": "Stingflare",
                                            "id": "gqkiv2v",
                                            "parent_id": "t1_gqki3ho",
                                            "score": 2,
                                            "created_utc": 1615468930.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "They definitely do exist but not on the online sphere",
                                            "author": null,
                                            "id": "gqkmxn0",
                                            "parent_id": "t1_gqki3ho",
                                            "score": 2,
                                            "created_utc": 1615471227.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "its shades of grey.  hard not to mix emotion with someone you enjoy being with regardless of how you met.",
            "author": "Buckeyechamp21",
            "id": "gqkqcxm",
            "parent_id": "t1_gqjgrv8",
            "score": 1,
            "created_utc": 1615472984.0,
            "replies": []
        },
        {
            "body": "Glad you found it useful :)",
            "author": "Stingflare",
            "id": "gqj6r9l",
            "parent_id": "t1_gqj36ss",
            "score": 8,
            "created_utc": 1615436426.0,
            "replies": []
        },
        {
            "body": "But you can give them both",
            "author": "Stingflare",
            "id": "gqkuri2",
            "parent_id": "t1_gqku7l3",
            "score": 1,
            "created_utc": 1615475087.0,
            "replies": []
        },
        {
            "body": "Sometimes SD found that they really like the SB (and may even have feelings for them) and would wish that they didn't give to keep giving financial support",
            "author": "Stingflare",
            "id": "gqj6j0e",
            "parent_id": "t1_gqj67xv",
            "score": 6,
            "created_utc": 1615436285.0,
            "replies": [
                {
                    "body": " and would wish that they ~~didn't give to keep giving financial support~~  could date their SBs vanilla\n\nThe problem is, they can't.  It's the same as a girl having an affair wishing her married guy finally gets a divorce and picks her.  It's 99.9999% fantasy.",
                    "author": "Gemini-Fox",
                    "id": "gqj6ziz",
                    "parent_id": "t1_gqj6j0e",
                    "score": 14,
                    "created_utc": 1615436565.0,
                    "replies": [
                        {
                            "body": "Yep. But probably also why they ask this question",
                            "author": "Stingflare",
                            "id": "gqj75em",
                            "parent_id": "t1_gqj6ziz",
                            "score": 5,
                            "created_utc": 1615436666.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "What if we enjoy helping out?\n\nWhen I’m in a “vanilla” relationship (whatever that is) I still get pretty sparkly things and take nice trips..  these new style SR are actually less expensive — trust me.",
                    "author": "daddoms",
                    "id": "gqj88t4",
                    "parent_id": "t1_gqj6j0e",
                    "score": 3,
                    "created_utc": 1615437347.0,
                    "replies": [
                        {
                            "body": "While this is a good point, I’m not in a SR to be gifted sparkly things and go on trips. Those things are very nice in addition to financial support, but if I had to choose, I’d much rather have the money to save, get ahead on bills, buy things I actually *need* and go after goals I have for myself. I know there are plenty of SBs out there that sugar in order to live lavish lifestyles, but there are also plenty of us that don’t prioritize that.\n\nI don’t enter a SR with a SD I don’t enjoy spending time with, talking to, or fucking. I just also want financial support.",
                            "author": "FoxyFreckles1989",
                            "id": "gqjlzec",
                            "parent_id": "t1_gqj88t4",
                            "score": 6,
                            "created_utc": 1615445656.0,
                            "replies": [
                                {
                                    "body": "Yep...I want that cash first and foremost. I can't pay rent with jewelry (but please, DO get jewelry as well after my allowance is taken care of!!).",
                                    "author": "Pixie_Lizard",
                                    "id": "gqkdm9f",
                                    "parent_id": "t1_gqjlzec",
                                    "score": 3,
                                    "created_utc": 1615465408.0,
                                    "replies": []
                                },
                                {
                                    "body": "That’s the point. I was referring to “vanilla” in quotes — from my point of view gifts and trips are just as expensive as allowance.\n\nThis question could be rephrased: “are you seeing me just for the trips to (nyc, paris, Disney, Croatia)?”\n\n“Are you seeing me just for rides in my Lamborghini?” — I don’t have one but dude, why are you flaunting money, for street cred with your bros?",
                                    "author": "daddoms",
                                    "id": "gqkiiqv",
                                    "parent_id": "t1_gqjlzec",
                                    "score": 2,
                                    "created_utc": 1615468722.0,
                                    "replies": [
                                        {
                                            "body": "Oh! Goodness. So you meant the *question* could be asked in a vanilla relationship? That would be a much more appropriate relationship *to* ask such a thing inside of!",
                                            "author": "FoxyFreckles1989",
                                            "id": "gqkmqwl",
                                            "parent_id": "t1_gqkiiqv",
                                            "score": 1,
                                            "created_utc": 1615471127.0,
                                            "replies": [
                                                {
                                                    "body": "If by “vanilla” we are talking about relationships where no prior arrangement is negotiated, expectations come up “are we headed toward marriage?” ... which includes financial support ...  “do you want to date me because of my social status?” etc etc etc",
                                                    "author": "daddoms",
                                                    "id": "gqkpw9d",
                                                    "parent_id": "t1_gqkmqwl",
                                                    "score": 2,
                                                    "created_utc": 1615472756.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Then there’s no issue at all right?",
                            "author": "Stingflare",
                            "id": "gqj8eiz",
                            "parent_id": "t1_gqj88t4",
                            "score": 3,
                            "created_utc": 1615437447.0,
                            "replies": [
                                {
                                    "body": "It’s all good.",
                                    "author": "daddoms",
                                    "id": "gqj9hdb",
                                    "parent_id": "t1_gqj8eiz",
                                    "score": 3,
                                    "created_utc": 1615438141.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "This is how I always sugared. It just happened naturally. I never had to negotiate an arrangement. Gifts, trips, and allowance just occurred.",
                            "author": null,
                            "id": "gqjwocf",
                            "parent_id": "t1_gqj88t4",
                            "score": 1,
                            "created_utc": 1615452911.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "While developing feelings is natural (and I would honestly be worried if neither party did, on some level, unless they’re very casual and just meet up once or twice a month for intimacy), “really liking,” the SB isn’t a reason to stop offering financial support. Almost every SR will remain just that, a *sugar relationship,* until it ends. Transitions to vanilla relationships are uncommon. If anything, a SR transitioning to something “more serious” will still involve financial support/gifts/trips etc., and the parties involved will become SBF/SGF. \n\nIf I “really like” my SD, is that a reason to stop being intimate? What if I decide I like him so much I’d marry him, and say, “now that we’re engaged I would like to save intimacy for our wedding night so it’s *special*?” Such an abrupt and extreme change would probably be unacceptable in the eyes of the SD. Same goes for financial support, in most cases.\n\nWhen the SR begins, terms and expectations from both sides should be thoroughly discussed and agreed to. Those terms should rarely be changed. In most cases, a change will mean more of something—a higher allowance from the SD and more time/dates/intimacy from the SB, for example. Not less. I have a friend who is happily married to her SD. He financially supports them, she raises their son, *and* he still gives her a monthly allowance (that’s quite generous).",
                    "author": "FoxyFreckles1989",
                    "id": "gqkn9ci",
                    "parent_id": "t1_gqj6j0e",
                    "score": 1,
                    "created_utc": 1615471404.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gqkriqm",
            "parent_id": "t1_gqj67xv",
            "score": 1,
            "created_utc": 1615473560.0,
            "replies": [
                {
                    "body": "1000 miles is 1609.34 km",
                    "author": "converter-bot",
                    "id": "gqkrji7",
                    "parent_id": "t1_gqkriqm",
                    "score": 1,
                    "created_utc": 1615473571.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I like this answer 😂 but it might create unnecessary tension",
            "author": "Stingflare",
            "id": "gqjyltf",
            "parent_id": "t1_gqjyj61",
            "score": 3,
            "created_utc": 1615454311.0,
            "replies": []
        },
        {
            "body": "Mental convolutions?",
            "author": "Stingflare",
            "id": "gqjf3m8",
            "parent_id": "t1_gqjexsp",
            "score": 2,
            "created_utc": 1615441487.0,
            "replies": []
        },
        {
            "body": "SBs are smarter than most SDs and probably won’t ask the question 😂",
            "author": "Stingflare",
            "id": "gqjofob",
            "parent_id": "t1_gqjmm4a",
            "score": 9,
            "created_utc": 1615447216.0,
            "replies": []
        },
        {
            "body": "Trust me, we know. I think for the most part we’re okay with it. Though I can’t speak for everyone. 🤷🏼‍♀️",
            "author": "christinamatteson",
            "id": "gqk56y4",
            "parent_id": "t1_gqjmm4a",
            "score": 5,
            "created_utc": 1615459358.0,
            "replies": []
        },
        {
            "body": "Yeah, we definitely know. For me, this is all about money. Anything else is secondary and supplemental. As I replied to on SD who seemed surprised I was looking for an allowance, \"Well, I'm on SA for a reason.\"\n\nDon't be so fucking thick. \n\nThe way I often respond to this question (which I agree is a ridiculous question to ask) is to say, \"Look, the money is really helpful, and it has helped make life much easier for me. But it's not ALL about the money. I do like you [for x, y, z, reasons] and love spending time with you, and the money helps me have a more comfortable lifestyle.\"\n\nBut really...don't ask SBs this question. You will either get your feelings hurt or lied to in some capacity.",
            "author": "Pixie_Lizard",
            "id": "gqkdcwk",
            "parent_id": "t1_gqjmm4a",
            "score": 5,
            "created_utc": 1615465217.0,
            "replies": [
                {
                    "body": "Yeah exactly my point",
                    "author": "Stingflare",
                    "id": "gqkjf2k",
                    "parent_id": "t1_gqkdcwk",
                    "score": 2,
                    "created_utc": 1615469265.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "While there’s really no point in asking this question, if the SD ever asks it, then there are responses that will cause even more unnecessary tension and drama. \n\nThe point of this post is to show that you can answer it truthfully while making the SD happy as well",
            "author": "Stingflare",
            "id": "gqjouea",
            "parent_id": "t1_gqjnb90",
            "score": 3,
            "created_utc": 1615447505.0,
            "replies": []
        },
        {
            "body": "Why are you even here 🤣🤣🤣",
            "author": "Stingflare",
            "id": "gqkk6tv",
            "parent_id": "t1_gqkjpp2",
            "score": 6,
            "created_utc": 1615469713.0,
            "replies": [
                {
                    "body": "Seems like a sarcastic post.  Person is just trying to be funny.  Who ever heard of a truly platonic sugar relationship?",
                    "author": "baronessblockage",
                    "id": "gql4g6f",
                    "parent_id": "t1_gqkk6tv",
                    "score": 0,
                    "created_utc": 1615479472.0,
                    "replies": [
                        {
                            "body": "There is such a thing try having some self respect and you might find one vice did a story on a dude from miami that has tons of sb’s it’s not about sexual shit at some point",
                            "author": "Resident-Leader",
                            "id": "gs1vhrf",
                            "parent_id": "t1_gql4g6f",
                            "score": 1,
                            "created_utc": 1616596112.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "That’s a good way to set expectations",
            "author": "Stingflare",
            "id": "gqkuun6",
            "parent_id": "t1_gqksl4t",
            "score": 1,
            "created_utc": 1615475127.0,
            "replies": []
        },
        {
            "body": "Sounds like your SD is a douche 🙃",
            "author": "Stingflare",
            "id": "gqrmj1j",
            "parent_id": "t1_gqkt05u",
            "score": 1,
            "created_utc": 1615607917.0,
            "replies": [
                {
                    "body": "Yes, he is.  Then after the lashing out, he will send me a gift.  He is quite immature.  I am getting sick of him and thinking of ending it.  He kind of senses this and whined that I am slipping from him.  Ya think?",
                    "author": "baronessblockage",
                    "id": "gqtbvms",
                    "parent_id": "t1_gqrmj1j",
                    "score": 1,
                    "created_utc": 1615655401.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Just tell them \"it started with the money, but now Im with you for the sex\".  You could skip all the ego boosting above!",
            "author": "redeye87",
            "id": "gqkn8p5",
            "parent_id": "t1_gqj3iiz",
            "score": -4,
            "created_utc": 1615471394.0,
            "replies": [
                {
                    "body": "This is the worst possible answer 😂 it would be giving the SD permission to say “alright then let’s just have sex without financial support”",
                    "author": "Stingflare",
                    "id": "gqkp0k0",
                    "parent_id": "t1_gqkn8p5",
                    "score": 27,
                    "created_utc": 1615472314.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Will you sill need me, will you still fed me, when I'm 64",
            "author": "BinghamtonSD",
            "id": "gqkb4pm",
            "parent_id": "t1_gqj6ggk",
            "score": 22,
            "created_utc": 1615463478.0,
            "replies": []
        },
        {
            "body": "there you go!",
            "author": "bluelunarmonkey",
            "id": "gqk3map",
            "parent_id": "t1_gqj6ggk",
            "score": 6,
            "created_utc": 1615458230.0,
            "replies": []
        },
        {
            "body": "On the other side I've heard SBs wonder whether the SD would stay if she stopped fucking him. A lot of SBs are very reluctant to admit they're trading sex for money and vice versa.",
            "author": null,
            "id": "gqjhptg",
            "parent_id": "t1_gqjgx09",
            "score": 9,
            "created_utc": 1615443066.0,
            "replies": [
                {
                    "body": "The difference is SBs will never ask “are you only seeing me just for sex?”\n\nGoes to show that most guys are just dumb 🤣",
                    "author": "Stingflare",
                    "id": "gqji3qe",
                    "parent_id": "t1_gqjhptg",
                    "score": 21,
                    "created_utc": 1615443290.0,
                    "replies": [
                        {
                            "body": "Yeah no SB is under the delusion like \"You'll keep giving me money if I completely stop having sex w you or looking cute right\" lmao",
                            "author": "ColdHeaux",
                            "id": "gqjlu9i",
                            "parent_id": "t1_gqji3qe",
                            "score": 12,
                            "created_utc": 1615445556.0,
                            "replies": [
                                {
                                    "body": "Yeah exactly",
                                    "author": "Stingflare",
                                    "id": "gqjoamx",
                                    "parent_id": "t1_gqjlu9i",
                                    "score": 5,
                                    "created_utc": 1615447120.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": ">The difference is SBs will never ask “are you only seeing me just for sex?”\n\nThey may not ask it, but if my SB asked me this, the answer would be a similar to your original post... not JUST for the sex. Yes, is the amazing sex with a woman out of my league the crucial part of this.... sure. That we enjoy hanging out, having dinner, watching movies, playing games, talking about anything and everything under the sun. It's not JUST the sex. If the sex was great, but  it lacked the overall chemistry and connection, I'm not sure I would want to continue.",
                            "author": "BinghamtonSD",
                            "id": "gqkbjfi",
                            "parent_id": "t1_gqji3qe",
                            "score": 5,
                            "created_utc": 1615463808.0,
                            "replies": [
                                {
                                    "body": "Yeah definitely.",
                                    "author": "Stingflare",
                                    "id": "gqkc3ka",
                                    "parent_id": "t1_gqkbjfi",
                                    "score": 1,
                                    "created_utc": 1615464254.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Or feel like they have a right to ask (entitlement). Most SBs wouldn't ask about if he'd date her if they didn't have sex because of the drama and emotional distress it could cause.",
                            "author": null,
                            "id": "gqjwft2",
                            "parent_id": "t1_gqji3qe",
                            "score": 4,
                            "created_utc": 1615452733.0,
                            "replies": []
                        },
                        {
                            "body": "I guess sugar mamas don’t exist smh",
                            "author": "Resident-Leader",
                            "id": "gqki3ho",
                            "parent_id": "t1_gqji3qe",
                            "score": 0,
                            "created_utc": 1615468457.0,
                            "replies": [
                                {
                                    "body": "They exist in the same sphere as unicorns",
                                    "author": "wildhorses6565",
                                    "id": "gqkkghz",
                                    "parent_id": "t1_gqki3ho",
                                    "score": 5,
                                    "created_utc": 1615469868.0,
                                    "replies": []
                                },
                                {
                                    "body": "😂😂😂 I don’t have enough data on SMs to comment on that",
                                    "author": "Stingflare",
                                    "id": "gqkiv2v",
                                    "parent_id": "t1_gqki3ho",
                                    "score": 2,
                                    "created_utc": 1615468930.0,
                                    "replies": []
                                },
                                {
                                    "body": "They definitely do exist but not on the online sphere",
                                    "author": null,
                                    "id": "gqkmxn0",
                                    "parent_id": "t1_gqki3ho",
                                    "score": 2,
                                    "created_utc": 1615471227.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": " and would wish that they ~~didn't give to keep giving financial support~~  could date their SBs vanilla\n\nThe problem is, they can't.  It's the same as a girl having an affair wishing her married guy finally gets a divorce and picks her.  It's 99.9999% fantasy.",
            "author": "Gemini-Fox",
            "id": "gqj6ziz",
            "parent_id": "t1_gqj6j0e",
            "score": 14,
            "created_utc": 1615436565.0,
            "replies": [
                {
                    "body": "Yep. But probably also why they ask this question",
                    "author": "Stingflare",
                    "id": "gqj75em",
                    "parent_id": "t1_gqj6ziz",
                    "score": 5,
                    "created_utc": 1615436666.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "What if we enjoy helping out?\n\nWhen I’m in a “vanilla” relationship (whatever that is) I still get pretty sparkly things and take nice trips..  these new style SR are actually less expensive — trust me.",
            "author": "daddoms",
            "id": "gqj88t4",
            "parent_id": "t1_gqj6j0e",
            "score": 3,
            "created_utc": 1615437347.0,
            "replies": [
                {
                    "body": "While this is a good point, I’m not in a SR to be gifted sparkly things and go on trips. Those things are very nice in addition to financial support, but if I had to choose, I’d much rather have the money to save, get ahead on bills, buy things I actually *need* and go after goals I have for myself. I know there are plenty of SBs out there that sugar in order to live lavish lifestyles, but there are also plenty of us that don’t prioritize that.\n\nI don’t enter a SR with a SD I don’t enjoy spending time with, talking to, or fucking. I just also want financial support.",
                    "author": "FoxyFreckles1989",
                    "id": "gqjlzec",
                    "parent_id": "t1_gqj88t4",
                    "score": 6,
                    "created_utc": 1615445656.0,
                    "replies": [
                        {
                            "body": "Yep...I want that cash first and foremost. I can't pay rent with jewelry (but please, DO get jewelry as well after my allowance is taken care of!!).",
                            "author": "Pixie_Lizard",
                            "id": "gqkdm9f",
                            "parent_id": "t1_gqjlzec",
                            "score": 3,
                            "created_utc": 1615465408.0,
                            "replies": []
                        },
                        {
                            "body": "That’s the point. I was referring to “vanilla” in quotes — from my point of view gifts and trips are just as expensive as allowance.\n\nThis question could be rephrased: “are you seeing me just for the trips to (nyc, paris, Disney, Croatia)?”\n\n“Are you seeing me just for rides in my Lamborghini?” — I don’t have one but dude, why are you flaunting money, for street cred with your bros?",
                            "author": "daddoms",
                            "id": "gqkiiqv",
                            "parent_id": "t1_gqjlzec",
                            "score": 2,
                            "created_utc": 1615468722.0,
                            "replies": [
                                {
                                    "body": "Oh! Goodness. So you meant the *question* could be asked in a vanilla relationship? That would be a much more appropriate relationship *to* ask such a thing inside of!",
                                    "author": "FoxyFreckles1989",
                                    "id": "gqkmqwl",
                                    "parent_id": "t1_gqkiiqv",
                                    "score": 1,
                                    "created_utc": 1615471127.0,
                                    "replies": [
                                        {
                                            "body": "If by “vanilla” we are talking about relationships where no prior arrangement is negotiated, expectations come up “are we headed toward marriage?” ... which includes financial support ...  “do you want to date me because of my social status?” etc etc etc",
                                            "author": "daddoms",
                                            "id": "gqkpw9d",
                                            "parent_id": "t1_gqkmqwl",
                                            "score": 2,
                                            "created_utc": 1615472756.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Then there’s no issue at all right?",
                    "author": "Stingflare",
                    "id": "gqj8eiz",
                    "parent_id": "t1_gqj88t4",
                    "score": 3,
                    "created_utc": 1615437447.0,
                    "replies": [
                        {
                            "body": "It’s all good.",
                            "author": "daddoms",
                            "id": "gqj9hdb",
                            "parent_id": "t1_gqj8eiz",
                            "score": 3,
                            "created_utc": 1615438141.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "This is how I always sugared. It just happened naturally. I never had to negotiate an arrangement. Gifts, trips, and allowance just occurred.",
                    "author": null,
                    "id": "gqjwocf",
                    "parent_id": "t1_gqj88t4",
                    "score": 1,
                    "created_utc": 1615452911.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "While developing feelings is natural (and I would honestly be worried if neither party did, on some level, unless they’re very casual and just meet up once or twice a month for intimacy), “really liking,” the SB isn’t a reason to stop offering financial support. Almost every SR will remain just that, a *sugar relationship,* until it ends. Transitions to vanilla relationships are uncommon. If anything, a SR transitioning to something “more serious” will still involve financial support/gifts/trips etc., and the parties involved will become SBF/SGF. \n\nIf I “really like” my SD, is that a reason to stop being intimate? What if I decide I like him so much I’d marry him, and say, “now that we’re engaged I would like to save intimacy for our wedding night so it’s *special*?” Such an abrupt and extreme change would probably be unacceptable in the eyes of the SD. Same goes for financial support, in most cases.\n\nWhen the SR begins, terms and expectations from both sides should be thoroughly discussed and agreed to. Those terms should rarely be changed. In most cases, a change will mean more of something—a higher allowance from the SD and more time/dates/intimacy from the SB, for example. Not less. I have a friend who is happily married to her SD. He financially supports them, she raises their son, *and* he still gives her a monthly allowance (that’s quite generous).",
            "author": "FoxyFreckles1989",
            "id": "gqkn9ci",
            "parent_id": "t1_gqj6j0e",
            "score": 1,
            "created_utc": 1615471404.0,
            "replies": []
        },
        {
            "body": "1000 miles is 1609.34 km",
            "author": "converter-bot",
            "id": "gqkrji7",
            "parent_id": "t1_gqkriqm",
            "score": 1,
            "created_utc": 1615473571.0,
            "replies": []
        },
        {
            "body": "Yeah exactly my point",
            "author": "Stingflare",
            "id": "gqkjf2k",
            "parent_id": "t1_gqkdcwk",
            "score": 2,
            "created_utc": 1615469265.0,
            "replies": []
        },
        {
            "body": "Seems like a sarcastic post.  Person is just trying to be funny.  Who ever heard of a truly platonic sugar relationship?",
            "author": "baronessblockage",
            "id": "gql4g6f",
            "parent_id": "t1_gqkk6tv",
            "score": 0,
            "created_utc": 1615479472.0,
            "replies": [
                {
                    "body": "There is such a thing try having some self respect and you might find one vice did a story on a dude from miami that has tons of sb’s it’s not about sexual shit at some point",
                    "author": "Resident-Leader",
                    "id": "gs1vhrf",
                    "parent_id": "t1_gql4g6f",
                    "score": 1,
                    "created_utc": 1616596112.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yes, he is.  Then after the lashing out, he will send me a gift.  He is quite immature.  I am getting sick of him and thinking of ending it.  He kind of senses this and whined that I am slipping from him.  Ya think?",
            "author": "baronessblockage",
            "id": "gqtbvms",
            "parent_id": "t1_gqrmj1j",
            "score": 1,
            "created_utc": 1615655401.0,
            "replies": []
        },
        {
            "body": "This is the worst possible answer 😂 it would be giving the SD permission to say “alright then let’s just have sex without financial support”",
            "author": "Stingflare",
            "id": "gqkp0k0",
            "parent_id": "t1_gqkn8p5",
            "score": 27,
            "created_utc": 1615472314.0,
            "replies": []
        },
        {
            "body": "The difference is SBs will never ask “are you only seeing me just for sex?”\n\nGoes to show that most guys are just dumb 🤣",
            "author": "Stingflare",
            "id": "gqji3qe",
            "parent_id": "t1_gqjhptg",
            "score": 21,
            "created_utc": 1615443290.0,
            "replies": [
                {
                    "body": "Yeah no SB is under the delusion like \"You'll keep giving me money if I completely stop having sex w you or looking cute right\" lmao",
                    "author": "ColdHeaux",
                    "id": "gqjlu9i",
                    "parent_id": "t1_gqji3qe",
                    "score": 12,
                    "created_utc": 1615445556.0,
                    "replies": [
                        {
                            "body": "Yeah exactly",
                            "author": "Stingflare",
                            "id": "gqjoamx",
                            "parent_id": "t1_gqjlu9i",
                            "score": 5,
                            "created_utc": 1615447120.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": ">The difference is SBs will never ask “are you only seeing me just for sex?”\n\nThey may not ask it, but if my SB asked me this, the answer would be a similar to your original post... not JUST for the sex. Yes, is the amazing sex with a woman out of my league the crucial part of this.... sure. That we enjoy hanging out, having dinner, watching movies, playing games, talking about anything and everything under the sun. It's not JUST the sex. If the sex was great, but  it lacked the overall chemistry and connection, I'm not sure I would want to continue.",
                    "author": "BinghamtonSD",
                    "id": "gqkbjfi",
                    "parent_id": "t1_gqji3qe",
                    "score": 5,
                    "created_utc": 1615463808.0,
                    "replies": [
                        {
                            "body": "Yeah definitely.",
                            "author": "Stingflare",
                            "id": "gqkc3ka",
                            "parent_id": "t1_gqkbjfi",
                            "score": 1,
                            "created_utc": 1615464254.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Or feel like they have a right to ask (entitlement). Most SBs wouldn't ask about if he'd date her if they didn't have sex because of the drama and emotional distress it could cause.",
                    "author": null,
                    "id": "gqjwft2",
                    "parent_id": "t1_gqji3qe",
                    "score": 4,
                    "created_utc": 1615452733.0,
                    "replies": []
                },
                {
                    "body": "I guess sugar mamas don’t exist smh",
                    "author": "Resident-Leader",
                    "id": "gqki3ho",
                    "parent_id": "t1_gqji3qe",
                    "score": 0,
                    "created_utc": 1615468457.0,
                    "replies": [
                        {
                            "body": "They exist in the same sphere as unicorns",
                            "author": "wildhorses6565",
                            "id": "gqkkghz",
                            "parent_id": "t1_gqki3ho",
                            "score": 5,
                            "created_utc": 1615469868.0,
                            "replies": []
                        },
                        {
                            "body": "😂😂😂 I don’t have enough data on SMs to comment on that",
                            "author": "Stingflare",
                            "id": "gqkiv2v",
                            "parent_id": "t1_gqki3ho",
                            "score": 2,
                            "created_utc": 1615468930.0,
                            "replies": []
                        },
                        {
                            "body": "They definitely do exist but not on the online sphere",
                            "author": null,
                            "id": "gqkmxn0",
                            "parent_id": "t1_gqki3ho",
                            "score": 2,
                            "created_utc": 1615471227.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yep. But probably also why they ask this question",
            "author": "Stingflare",
            "id": "gqj75em",
            "parent_id": "t1_gqj6ziz",
            "score": 5,
            "created_utc": 1615436666.0,
            "replies": []
        },
        {
            "body": "While this is a good point, I’m not in a SR to be gifted sparkly things and go on trips. Those things are very nice in addition to financial support, but if I had to choose, I’d much rather have the money to save, get ahead on bills, buy things I actually *need* and go after goals I have for myself. I know there are plenty of SBs out there that sugar in order to live lavish lifestyles, but there are also plenty of us that don’t prioritize that.\n\nI don’t enter a SR with a SD I don’t enjoy spending time with, talking to, or fucking. I just also want financial support.",
            "author": "FoxyFreckles1989",
            "id": "gqjlzec",
            "parent_id": "t1_gqj88t4",
            "score": 6,
            "created_utc": 1615445656.0,
            "replies": [
                {
                    "body": "Yep...I want that cash first and foremost. I can't pay rent with jewelry (but please, DO get jewelry as well after my allowance is taken care of!!).",
                    "author": "Pixie_Lizard",
                    "id": "gqkdm9f",
                    "parent_id": "t1_gqjlzec",
                    "score": 3,
                    "created_utc": 1615465408.0,
                    "replies": []
                },
                {
                    "body": "That’s the point. I was referring to “vanilla” in quotes — from my point of view gifts and trips are just as expensive as allowance.\n\nThis question could be rephrased: “are you seeing me just for the trips to (nyc, paris, Disney, Croatia)?”\n\n“Are you seeing me just for rides in my Lamborghini?” — I don’t have one but dude, why are you flaunting money, for street cred with your bros?",
                    "author": "daddoms",
                    "id": "gqkiiqv",
                    "parent_id": "t1_gqjlzec",
                    "score": 2,
                    "created_utc": 1615468722.0,
                    "replies": [
                        {
                            "body": "Oh! Goodness. So you meant the *question* could be asked in a vanilla relationship? That would be a much more appropriate relationship *to* ask such a thing inside of!",
                            "author": "FoxyFreckles1989",
                            "id": "gqkmqwl",
                            "parent_id": "t1_gqkiiqv",
                            "score": 1,
                            "created_utc": 1615471127.0,
                            "replies": [
                                {
                                    "body": "If by “vanilla” we are talking about relationships where no prior arrangement is negotiated, expectations come up “are we headed toward marriage?” ... which includes financial support ...  “do you want to date me because of my social status?” etc etc etc",
                                    "author": "daddoms",
                                    "id": "gqkpw9d",
                                    "parent_id": "t1_gqkmqwl",
                                    "score": 2,
                                    "created_utc": 1615472756.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Then there’s no issue at all right?",
            "author": "Stingflare",
            "id": "gqj8eiz",
            "parent_id": "t1_gqj88t4",
            "score": 3,
            "created_utc": 1615437447.0,
            "replies": [
                {
                    "body": "It’s all good.",
                    "author": "daddoms",
                    "id": "gqj9hdb",
                    "parent_id": "t1_gqj8eiz",
                    "score": 3,
                    "created_utc": 1615438141.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "This is how I always sugared. It just happened naturally. I never had to negotiate an arrangement. Gifts, trips, and allowance just occurred.",
            "author": null,
            "id": "gqjwocf",
            "parent_id": "t1_gqj88t4",
            "score": 1,
            "created_utc": 1615452911.0,
            "replies": []
        },
        {
            "body": "There is such a thing try having some self respect and you might find one vice did a story on a dude from miami that has tons of sb’s it’s not about sexual shit at some point",
            "author": "Resident-Leader",
            "id": "gs1vhrf",
            "parent_id": "t1_gql4g6f",
            "score": 1,
            "created_utc": 1616596112.0,
            "replies": []
        },
        {
            "body": "Yeah no SB is under the delusion like \"You'll keep giving me money if I completely stop having sex w you or looking cute right\" lmao",
            "author": "ColdHeaux",
            "id": "gqjlu9i",
            "parent_id": "t1_gqji3qe",
            "score": 12,
            "created_utc": 1615445556.0,
            "replies": [
                {
                    "body": "Yeah exactly",
                    "author": "Stingflare",
                    "id": "gqjoamx",
                    "parent_id": "t1_gqjlu9i",
                    "score": 5,
                    "created_utc": 1615447120.0,
                    "replies": []
                }
            ]
        },
        {
            "body": ">The difference is SBs will never ask “are you only seeing me just for sex?”\n\nThey may not ask it, but if my SB asked me this, the answer would be a similar to your original post... not JUST for the sex. Yes, is the amazing sex with a woman out of my league the crucial part of this.... sure. That we enjoy hanging out, having dinner, watching movies, playing games, talking about anything and everything under the sun. It's not JUST the sex. If the sex was great, but  it lacked the overall chemistry and connection, I'm not sure I would want to continue.",
            "author": "BinghamtonSD",
            "id": "gqkbjfi",
            "parent_id": "t1_gqji3qe",
            "score": 5,
            "created_utc": 1615463808.0,
            "replies": [
                {
                    "body": "Yeah definitely.",
                    "author": "Stingflare",
                    "id": "gqkc3ka",
                    "parent_id": "t1_gqkbjfi",
                    "score": 1,
                    "created_utc": 1615464254.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Or feel like they have a right to ask (entitlement). Most SBs wouldn't ask about if he'd date her if they didn't have sex because of the drama and emotional distress it could cause.",
            "author": null,
            "id": "gqjwft2",
            "parent_id": "t1_gqji3qe",
            "score": 4,
            "created_utc": 1615452733.0,
            "replies": []
        },
        {
            "body": "I guess sugar mamas don’t exist smh",
            "author": "Resident-Leader",
            "id": "gqki3ho",
            "parent_id": "t1_gqji3qe",
            "score": 0,
            "created_utc": 1615468457.0,
            "replies": [
                {
                    "body": "They exist in the same sphere as unicorns",
                    "author": "wildhorses6565",
                    "id": "gqkkghz",
                    "parent_id": "t1_gqki3ho",
                    "score": 5,
                    "created_utc": 1615469868.0,
                    "replies": []
                },
                {
                    "body": "😂😂😂 I don’t have enough data on SMs to comment on that",
                    "author": "Stingflare",
                    "id": "gqkiv2v",
                    "parent_id": "t1_gqki3ho",
                    "score": 2,
                    "created_utc": 1615468930.0,
                    "replies": []
                },
                {
                    "body": "They definitely do exist but not on the online sphere",
                    "author": null,
                    "id": "gqkmxn0",
                    "parent_id": "t1_gqki3ho",
                    "score": 2,
                    "created_utc": 1615471227.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yep...I want that cash first and foremost. I can't pay rent with jewelry (but please, DO get jewelry as well after my allowance is taken care of!!).",
            "author": "Pixie_Lizard",
            "id": "gqkdm9f",
            "parent_id": "t1_gqjlzec",
            "score": 3,
            "created_utc": 1615465408.0,
            "replies": []
        },
        {
            "body": "That’s the point. I was referring to “vanilla” in quotes — from my point of view gifts and trips are just as expensive as allowance.\n\nThis question could be rephrased: “are you seeing me just for the trips to (nyc, paris, Disney, Croatia)?”\n\n“Are you seeing me just for rides in my Lamborghini?” — I don’t have one but dude, why are you flaunting money, for street cred with your bros?",
            "author": "daddoms",
            "id": "gqkiiqv",
            "parent_id": "t1_gqjlzec",
            "score": 2,
            "created_utc": 1615468722.0,
            "replies": [
                {
                    "body": "Oh! Goodness. So you meant the *question* could be asked in a vanilla relationship? That would be a much more appropriate relationship *to* ask such a thing inside of!",
                    "author": "FoxyFreckles1989",
                    "id": "gqkmqwl",
                    "parent_id": "t1_gqkiiqv",
                    "score": 1,
                    "created_utc": 1615471127.0,
                    "replies": [
                        {
                            "body": "If by “vanilla” we are talking about relationships where no prior arrangement is negotiated, expectations come up “are we headed toward marriage?” ... which includes financial support ...  “do you want to date me because of my social status?” etc etc etc",
                            "author": "daddoms",
                            "id": "gqkpw9d",
                            "parent_id": "t1_gqkmqwl",
                            "score": 2,
                            "created_utc": 1615472756.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "It’s all good.",
            "author": "daddoms",
            "id": "gqj9hdb",
            "parent_id": "t1_gqj8eiz",
            "score": 3,
            "created_utc": 1615438141.0,
            "replies": []
        },
        {
            "body": "Yeah exactly",
            "author": "Stingflare",
            "id": "gqjoamx",
            "parent_id": "t1_gqjlu9i",
            "score": 5,
            "created_utc": 1615447120.0,
            "replies": []
        },
        {
            "body": "Yeah definitely.",
            "author": "Stingflare",
            "id": "gqkc3ka",
            "parent_id": "t1_gqkbjfi",
            "score": 1,
            "created_utc": 1615464254.0,
            "replies": []
        },
        {
            "body": "They exist in the same sphere as unicorns",
            "author": "wildhorses6565",
            "id": "gqkkghz",
            "parent_id": "t1_gqki3ho",
            "score": 5,
            "created_utc": 1615469868.0,
            "replies": []
        },
        {
            "body": "😂😂😂 I don’t have enough data on SMs to comment on that",
            "author": "Stingflare",
            "id": "gqkiv2v",
            "parent_id": "t1_gqki3ho",
            "score": 2,
            "created_utc": 1615468930.0,
            "replies": []
        },
        {
            "body": "They definitely do exist but not on the online sphere",
            "author": null,
            "id": "gqkmxn0",
            "parent_id": "t1_gqki3ho",
            "score": 2,
            "created_utc": 1615471227.0,
            "replies": []
        },
        {
            "body": "Oh! Goodness. So you meant the *question* could be asked in a vanilla relationship? That would be a much more appropriate relationship *to* ask such a thing inside of!",
            "author": "FoxyFreckles1989",
            "id": "gqkmqwl",
            "parent_id": "t1_gqkiiqv",
            "score": 1,
            "created_utc": 1615471127.0,
            "replies": [
                {
                    "body": "If by “vanilla” we are talking about relationships where no prior arrangement is negotiated, expectations come up “are we headed toward marriage?” ... which includes financial support ...  “do you want to date me because of my social status?” etc etc etc",
                    "author": "daddoms",
                    "id": "gqkpw9d",
                    "parent_id": "t1_gqkmqwl",
                    "score": 2,
                    "created_utc": 1615472756.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "If by “vanilla” we are talking about relationships where no prior arrangement is negotiated, expectations come up “are we headed toward marriage?” ... which includes financial support ...  “do you want to date me because of my social status?” etc etc etc",
            "author": "daddoms",
            "id": "gqkpw9d",
            "parent_id": "t1_gqkmqwl",
            "score": 2,
            "created_utc": 1615472756.0,
            "replies": []
        }
    ]
}