{
    "title": "How to Talk to Your Barber",
    "post_id": "34roov",
    "post_url": "https://www.reddit.com/r/malehairadvice/comments/34roov/how_to_talk_to_your_barber/",
    "author": null,
    "body": "I've seen a lot of guys on here confused about how to communicate with their barber.  I used to be a barber, and I can confirm that people struggle to communicate what they want.  So I figured I'd make a guide.\n\nMost guys want a simple haircut.  Nothing fancy.  If this is you, your task is pretty simple.  I need to know how short you want the sides, how long you want the top, and how you're going to style it.  Most guys get about a two (metal blades) on the sides, it's pretty short, but not so short that it shows skin (on most guys, some guys have thin hair so you see skin) and it's short enough that the sides look pretty clean for an entire month.  \n\nAs for the top, it really depends on your hair type.  A good length to start with is 2 inches.  It's long enough that you can comb it, part it, or whatever you want to do with it, but short enough to be maintainable if you don't want to comb it.  But this really depends on your hair type.  For example, I have soft fine hair, it's about two inches long on top right now, but I couldn't hold a part on it because it's too fine.  When I had a part and taper, my hair was probably 5 inches long on top, and it still didn't always do what I wanted.  On the flipside, some guys have really thick hair, and can part it with just an inch on top.\n\nThere's so much you can do with styling.  Let the barber know what you want to do with it on a usual day, and what product you'll be using.  Or, if you're not sure, bring in a picture, have him show you how to style it that way, and take recommendations for a product to use.  Feel free to buy the product right then, too!  I always recommended to my clients to wear the product for a day before they decided if they wanted it, but most ignored that advice.  Thankfully the shops I worked at were very low-pressure on product sales, which really helps.  I'd hate to have a client buy a product they don't love.  For products, make sure it does what you want for your hair, make sure it's water-soluble so it rinses out (better for your scalp!) and make sure you like the smell.  Or make sure your SO likes the smell, the SO usually cares about how you smell way more than you!\n\nIf you're looking for more than a simple haircut you need to know the name of the haircut you want.  This goes for things like an undercut, a slickback, high fades, low fades, pomps, whatever you find that you want.  I think this sub should have a list of popular men's hairstyles to choose from, that would be awesome!  Many of these cuts are very different to cut than a standard haircut, so your barber definitely needs to know this before he starts cutting.\n\nFinally, the nitpicky bits.  Some guys really know what they want, which is cool, but can be stressful for the barber.  Be cool if you're super nitpicky, and try not to be a know-it-all.  \nYour neckline:  If you go to a reputable barber, hopefully he is tapering your neckline by default.  Most guys look so much better with a tapered neckline.  [Here's](http://haircutsformen.org/buzz/graphics/necks.jpg) a picture that shows the difference:  Blocked on the left, tapered on the right.  The second set of pictures shows about a two week growout.  The tapered neckline still looks almost barber shop fresh, whereas the blocked one obviously looks fuzzy.  For most guys, a tapered neckline looks better for them, and on every guy the growout is so much better.\n\nSome guys want the part shaved in.  Every time a client asked for a carved part, I'd give them this same speech.\nIt looks really cool, really sharp for about two days. After that, little hairs start growing back and it looks messy and is even harder to style than before. It's better to go with a natural part and learn how to actually comb your hair.  But it is a cool look, so if a client really wants it, I'll do it.\n\nSideburns:  Basically, what length do you want.  If you don't care, that's totally cool.  I'll probably take them to about mid-ear, and taper them to fit into the haircut.\n\nOne of my biggest pet peeves when I was a barber was that people would bring in a picture of a badass haircut, and show me the picture and want something \"similar, but a little different.\"  At that point, there's no reason to bring in the picture.  Please, bring in a picture if you can't explain the haircut, but find a picture of the haircut you really want!  \n\nMore on pictures:  Bringing in a picture is a FANTASTIC idea!!!  I can look at the picture, look at your hair, and start cutting in 10 seconds, which is AWESOME!  But sometimes, people bring in pictures of haircuts that just won't work with their hair.  My favorite example of this, I had a white, blonde client with straight soft hair bring in a picture of Chris Brown.  Yea, sorry buddy, not happening.  What I do as a barber when this happens is I'll figure out something to do that is similar to the picture but works with the client's hair.  Please be cool if your barber says your hair won't do what's in a picture.  I've had guys get pissed at me for it before, and that's just dumb.  Makes them look stupid.\n\nOther annoying things people say:  \"Just take a little off/Just a trim.\"  OK, but how much is a little?  If you're a regular and I've cut you a bunch of times, no problem, but if it's your first time in, how am I supposed to figure out what to do?  \"Short on the sides, long on top.\"  Unless you're bald, this is how LITERALLY EVERY SINGLE HAIRCUT LOOKS!  Guaranteed, your barber will make fun of you afterwards if you say this.  I know because we always made fun of people for saying that.  Calling a part and taper a combover.  [Donald Trump](http://images.askmen.com/galleries/men/donald-trump/pictures/donald-trump-picture-1.jpg) has a combover, you want a part and taper, trust me.\n\nFinally, some etiquette.  Show up early for an appointment.  Being late makes it hard for the barber because he will make the tough choice or whether or not to cut your hair, it could set him back on his schedule for the entire day.  Obviously, shit happens.  If a client runs late once, but then he reschedules and leaves a big tip next time, we're cool.  DO NOT be the chronically late client, you will piss off your barber, guaranteed.  Be cool if they're running behind.  I worked at an appointment shop, and kept pretty good time.  But if I had to run behind to give a client what he wants, so be it.  Worst case, reschedule if you absolutely have to, but please be cool about it.  Barbers have to give everyone what they want, so understandably they run behind sometimes.  It's alright if you're not chatty, I didn't mind quiet clients because I could focus on my work!  But be polite, say thanks, even if you're not social, you can be polite.  There's a difference between shy and rude.  On the other hand, I also enjoy a good conversation!  Try not to be too controversial, and save the sob stories for your llama.  I've met some awesome people at my jobs before with interesting stories.  This should be self explanatory, but TIP!!!!  FOR CHRIST'S SAKES!  You don't want to be that client who doesn't tip.  We have to pay our bills, too, and I'm not going to spend as much time on a client who isn't tipping when I have so many who do.  It shows you care about the quality of your cut, and about your barber.  On a $20 cut, a $5 tip is expected, if a client tipped me $10 it made my day. \n\nAnd guys, go to a barber.  Even if you have long hair.  Barbers specialize in masculine cuts.  Most stylists don't even learn to cut men's hair in school, and have to learn on the job.  I did 250 men's cuts in school, and countless hundreds of neck line-ups, 200 face shaves, and a lot of beard trims.  Barbers know what they're doing when it comes to men's hair.   \n\n[Art of Manliness has a really good video](https://www.youtube.com/watch?v=Xw4JP3bEvng) about this.  I would avoid asking for a specific kind of texture unless you've been going to the same barber for a while.  Usually, I can figure out what texture to use from the client's hair type and what he wants.  Asking for a type of texture would come off as if the client thinks that I don't know what I'm doing.  And don't get high arches.  I especially like the part where the narrator says shut up and listen to your barber :)",
    "url": "https://www.reddit.com/r/malehairadvice/comments/34roov/how_to_talk_to_your_barber/",
    "score": 554,
    "upvote_ratio": 0.98,
    "created_utc": 1430697296.0,
    "num_comments": 54,
    "links": [
        [
            "http://haircutsformen.org/buzz/graphics/necks.jpg",
            "http://images.askmen.com/galleries/men/donald-trump/pictures/donald-trump-picture-1.jpg",
            "https://www.youtube.com/watch?v=Xw4JP3bEvng"
        ]
    ],
    "comments": [
        {
            "body": "Seriously, the Mod Team should add this to sidebar.",
            "author": "Waynenameyo1",
            "id": "cqxizvk",
            "parent_id": "t3_34roov",
            "score": 71,
            "created_utc": 1430705086.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "cqxow31",
            "parent_id": "t3_34roov",
            "score": 42,
            "created_utc": 1430716164.0,
            "replies": [
                {
                    "body": "At the shops I worked at, we never would have gotten upset if a stylist sent a client to a barbershop.  That's a shitton of honesty right there-you know you can't do a skinfade, and that's fair, that's not what you were taught to do in school.  Send 'em over.  \n\nActually, one of the shops I worked for has a sister salon, and they'd send people over to us all the time.  Just like we'd send women with long hair over to them.  I'm not afraid to cut a woman's long hair, but it'll look a hell of a lot better if she sees a stylist.",
                    "author": null,
                    "id": "cqxp45m",
                    "parent_id": "t1_cqxow31",
                    "score": 26,
                    "created_utc": 1430716802.0,
                    "replies": []
                },
                {
                    "body": "Honestly if you did that I'd probably tip you just for being honest and helping me make the best choice.",
                    "author": "ttchoubs",
                    "id": "cqy5kdv",
                    "parent_id": "t1_cqxow31",
                    "score": 1,
                    "created_utc": 1430761160.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "My buddy cuts my hair, and every damn thing you wrote here is confirmed. Half the time I'm in his chair, he's telling me these exact stories of first time clients. \n\nTip well, if you don't like the cut, say something, and for God sakes, don't go see a female stylist. \n\nTits in your face while you get a haircut every few weeks is great, but getting tits consistently in your life because you have a solid hair style is better. ",
            "author": "Imthecoolestdudeever",
            "id": "cqxq5ow",
            "parent_id": "t3_34roov",
            "score": 32,
            "created_utc": 1430719999.0,
            "replies": [
                {
                    "body": "I actually happen to know a female barber.  Best of both worlds, right?",
                    "author": null,
                    "id": "cqxq7k9",
                    "parent_id": "t1_cqxq5ow",
                    "score": 22,
                    "created_utc": 1430720164.0,
                    "replies": [
                        {
                            "body": "Definitely! It took me far too long to find a female who could deal with my hair type. (wavy, thick, 2 crowns) when I finally did, she moved away. Then went to see a buddy who went back to barber school, and I couldn't be happier. \n\nBest thing is to keep going back to the same person, develop a cut/style and keep on track. ",
                            "author": "Imthecoolestdudeever",
                            "id": "cqxql4z",
                            "parent_id": "t1_cqxq7k9",
                            "score": 6,
                            "created_utc": 1430721439.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Some of the best fades in my home town come from an ex-co worker of mine. She isn't a barber either, she's a cosmetologist. That girl can give the cleanest bald fades. She's been giving straight shaves to her boyfriend for years, so now that cosmetologists can do shaves in the salon, she gives some of the best edge ups. \n\nDon't choose to not go to someone because they're called a barber or a cosmetologist, or if they're a male or a female. You choose who to go to based off of reccomendations and the quality of the work that they put out \n\n\n\n",
                    "author": null,
                    "id": "cqy3map",
                    "parent_id": "t1_cqxq5ow",
                    "score": 6,
                    "created_utc": 1430758001.0,
                    "replies": [
                        {
                            "body": "I have a question for you, where are you from that you say bald fades?  That comes off kinda rude, but I totally don't mean it that way.  Everywhere I've gotten a haircut or cut hair, they were called skin fades or razor fades.  Im from NYC, also cut hair in Seattle.",
                            "author": null,
                            "id": "cqyalqs",
                            "parent_id": "t1_cqy3map",
                            "score": 4,
                            "created_utc": 1430769187.0,
                            "replies": [
                                {
                                    "body": "I live in Texas. More specifically within the greater Houston area. I've never heard it called a skin fade. I have heard razor fade before, but rarely. 9 times out of 10 I hear it referred to as a bald fade. Even some of the barbering educators we have had. ",
                                    "author": null,
                                    "id": "cqyb4nx",
                                    "parent_id": "t1_cqyalqs",
                                    "score": 1,
                                    "created_utc": 1430770014.0,
                                    "replies": [
                                        {
                                            "body": "You know, I've never been down south.  Perhaps that's how it's said down there?",
                                            "author": null,
                                            "id": "cqyb6b7",
                                            "parent_id": "t1_cqyb4nx",
                                            "score": 1,
                                            "created_utc": 1430770089.0,
                                            "replies": [
                                                {
                                                    "body": "I suppose so. You know, I just looked it up...our main barbering educator who I have heard say it the most is Josh Wagner who *is* from Kentucky....",
                                                    "author": null,
                                                    "id": "cqybmuz",
                                                    "parent_id": "t1_cqyb6b7",
                                                    "score": 1,
                                                    "created_utc": 1430770830.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "This is very valuable. I'm up voting and saving incase I ever run into a hairy situation. Thanks OP, you da' real MVP",
            "author": "SunShineImaDine",
            "id": "cqxgsc8",
            "parent_id": "t3_34roov",
            "score": 12,
            "created_utc": 1430700918.0,
            "replies": [
                {
                    "body": "As a barber, I'm here to help people with their hairy situations.  As long as it's on your head.",
                    "author": null,
                    "id": "cqxh3ss",
                    "parent_id": "t1_cqxgsc8",
                    "score": 16,
                    "created_utc": 1430701506.0,
                    "replies": [
                        {
                            "body": ":'(",
                            "author": "SunShineImaDine",
                            "id": "cqxh5ae",
                            "parent_id": "t1_cqxh3ss",
                            "score": 7,
                            "created_utc": 1430701585.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "cqxhtme",
            "parent_id": "t3_34roov",
            "score": 10,
            "created_utc": 1430702874.0,
            "replies": [
                {
                    "body": "You can tell by looking at it.  [This](http://content.latest-hairstyles.com/wp-content/uploads/2013/10/side-step-thick-hair-for-a-man.jpg) is thick hair, [this](http://pad3.whstatic.com/images/thumb/a/a2/Add-Volume-to-Hair-for-Men-Step-2.jpg/670px-Add-Volume-to-Hair-for-Men-Step-2.jpg) is thin hair.  Basically, how much hair is there on the head.  Fine vs. coarse would be how thick is each individual strand.",
                    "author": null,
                    "id": "cqxi5pe",
                    "parent_id": "t1_cqxhtme",
                    "score": 13,
                    "created_utc": 1430703516.0,
                    "replies": [
                        {
                            "body": "I actually made a post asking how you could tell, but no one answered and I'm still not too sure if I have thin or thick hair from those pictures. Here's a gallery of some pictures of my hair, hopefully you could give me an answer from the pictures ive provided. http://imgur.com/a/mVQkJ",
                            "author": null,
                            "id": "cqxj15g",
                            "parent_id": "t1_cqxi5pe",
                            "score": 4,
                            "created_utc": 1430705150.0,
                            "replies": [
                                {
                                    "body": "It's really hard to tell without being able to feel your hair.  It definitely looks thick.  It looks to be fairly fine, and soft.",
                                    "author": null,
                                    "id": "cqxjlor",
                                    "parent_id": "t1_cqxj15g",
                                    "score": 9,
                                    "created_utc": 1430706110.0,
                                    "replies": [
                                        {
                                            "body": "Thank you for the reply :)",
                                            "author": null,
                                            "id": "cqxjw8b",
                                            "parent_id": "t1_cqxjlor",
                                            "score": 2,
                                            "created_utc": 1430706623.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "Looks pretty thick, if you Post a picture of your Hair Wet it makes it easier to tell",
                                    "author": "triplee9",
                                    "id": "cqxjrsq",
                                    "parent_id": "t1_cqxj15g",
                                    "score": 4,
                                    "created_utc": 1430706407.0,
                                    "replies": [
                                        {
                                            "body": "Hold up, I'm gonna edit this comment after I take the picture.\n\nEdit- kinda sorta towel dried, how does it look now? http://imgur.com/a/rI44f",
                                            "author": null,
                                            "id": "cqxjwwq",
                                            "parent_id": "t1_cqxjrsq",
                                            "score": 3,
                                            "created_utc": 1430706654.0,
                                            "replies": [
                                                {
                                                    "body": "Yea its decently thick. You have good Hair dude. ",
                                                    "author": "triplee9",
                                                    "id": "cqxkw71",
                                                    "parent_id": "t1_cqxjwwq",
                                                    "score": 4,
                                                    "created_utc": 1430708342.0,
                                                    "replies": [
                                                        {
                                                            "body": "Thanks for the answer, I've been wondering for a while weather to grow out the top because I might try to do a quiff once schools out so if it looks bad, only my friends will see it and they won't give me shit and you need thick hair for a quiff so yeah. Thanks once again :).",
                                                            "author": null,
                                                            "id": "cqxl2sm",
                                                            "parent_id": "t1_cqxkw71",
                                                            "score": 2,
                                                            "created_utc": 1430708641.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Thanks man",
                            "author": "UnPawsed",
                            "id": "cqxixny",
                            "parent_id": "t1_cqxi5pe",
                            "score": 1,
                            "created_utc": 1430704976.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "More post like this need to be on this sub. Thanks for the info / Nice post",
            "author": "Rektun",
            "id": "cqxh8pz",
            "parent_id": "t3_34roov",
            "score": 21,
            "created_utc": 1430701767.0,
            "replies": []
        },
        {
            "body": "Great read. How would I go about finding a great barber in my area? I typically go to the walk in places since I don't know any better.",
            "author": "StasysPrime",
            "id": "cqxvoea",
            "parent_id": "t3_34roov",
            "score": 6,
            "created_utc": 1430742457.0,
            "replies": [
                {
                    "body": "There are some great walk-in shops.  I don't even like to bash great clips/supercuts too much because I know a barber who got started there, worked that job for 10 years then opened her own shop and she's one of the best barbers I know.  But unfortunately the majority of Great Clips/Supercuts workers are 1. stylists (only know women's hair) and/or 2. really don't give a shit.\n\nAnyway, the best way to find a barber is to ask people with good haircuts where they go.  Yelp is also a great resource, but you kinda have to wade through the shitty reviews to find truth.  Some of the best shops I've been to have 1 star reviews of dumbasses complaining about a long wait (the shop's fucking busy, sit yo ass down and shut up!) or about adult conversations at the barber shop.  We're dudes and yes sometimes we talk about pussies and say fuck.  We always tried to keep it clean if kids were in the shop but sometimes things slip out (ha!)  Instagram is a fantastic resource, most barber shops that really care about their product have an Instagram with pictures of the cuts they've done.  Which is great, because if you see something you like, you know they can do it!",
                    "author": null,
                    "id": "cqyauk3",
                    "parent_id": "t1_cqxvoea",
                    "score": 3,
                    "created_utc": 1430769576.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Whenever I go in I typically ask for something shorter, but to do whatever he thinks looks good. I've always been very pleased with my cuts.\n\n I'm probably just worrying too much, but now I'm worried that's too vague. What are your thoughts on this?",
            "author": "gandaf007",
            "id": "cqxru34",
            "parent_id": "t3_34roov",
            "score": 4,
            "created_utc": 1430726362.0,
            "replies": [
                {
                    "body": "Nothing wrong with that, if that's what you want.  I'd probably ask you how long it's been since your last cut, to gauge how short to go, and I'd ask how/if you style it.  Then I'd be set to go.",
                    "author": null,
                    "id": "cqxxqdy",
                    "parent_id": "t1_cqxru34",
                    "score": 4,
                    "created_utc": 1430747496.0,
                    "replies": []
                },
                {
                    "body": "Yeah, listen to your barber",
                    "author": "wojx",
                    "id": "cqxumjf",
                    "parent_id": "t1_cqxru34",
                    "score": 1,
                    "created_utc": 1430739020.0,
                    "replies": []
                }
            ]
        },
        {
            "body": ">And guys, go to a barber. Even if you have long hair. Barbers specialize in masculine cuts. Most stylists don't even learn to cut men's hair in school, and have to learn on the job. I did 250 men's cuts in school, and countless hundreds of neck line-ups, 200 face shaves, and a lot of beard trims. Barbers know what they're doing when it comes to men's hair.   \n\nWhat are you saying here? Do you say that i should go to my barber while im growing out my hair to make it look less messy? And if so, how do i say that, as i would like as little hair as possible cut?",
            "author": "TheBurningSoda",
            "id": "cqy4fox",
            "parent_id": "t3_34roov",
            "score": 4,
            "created_utc": 1430759329.0,
            "replies": [
                {
                    "body": "Yea we'd clean up clients who are doing a grow out all the time.  I'd just take a little off the sides and clean up and shave the nape.  Maybe, but rarely, if the top looked super sloppy I'd even it out a bit, but again it was pretty rare that I touched the top.  \n\nJust tell him you're growing it out, and tell him not to touch the top.  It shouldn't be a problem.",
                    "author": null,
                    "id": "cqyaikn",
                    "parent_id": "t1_cqy4fox",
                    "score": 4,
                    "created_utc": 1430769051.0,
                    "replies": []
                },
                {
                    "body": "Literally exactly what you just said. \"I'm growing my hair out but want it trimmed so it looks less messy. I'd like as little taken off as possible\". You could get into detail a little more if there was anything else specifically you wanted done or if the barber wanted further clarification, but that in itself is pretty good in terms of letting them know what exactly you're there for. ",
                    "author": "boganhobo",
                    "id": "cqyaetb",
                    "parent_id": "t1_cqy4fox",
                    "score": 3,
                    "created_utc": 1430768889.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "cqxulxu",
            "parent_id": "t3_34roov",
            "score": 3,
            "created_utc": 1430738960.0,
            "replies": [
                {
                    "body": "Barber's clientele is mostly people with simple cuts, short to very short, with generally alot of clipper work.\n\nHair stylist clientele is mostly people with complex cuts, longer hair, with alot of freehand work.\n\nJust because one barber on the internet is confident with longer hair with more texture work doesn't mean that any barber you rock up to is the same, more than likely they are not confident at all. The safer option is the hairstylist, always.",
                    "author": "genetalgiant",
                    "id": "cqxw1wu",
                    "parent_id": "t1_cqxulxu",
                    "score": 3,
                    "created_utc": 1430743490.0,
                    "replies": []
                },
                {
                    "body": "Asian hair is tricky to cut, but any well-trained and patient barber should be able to handle it.  Asian hair is thin, fine and soft so it tends to be more difficult to fade, and it is poofy so it doesn't do exactly what you want.  So yea he's being unreasonable.  Because on top of that, there's white guys that have the same type of hair.  My friends always make fun of me, a white guy, for having hair that is pretty much the same as Asian hair.",
                    "author": null,
                    "id": "cqxxm6l",
                    "parent_id": "t1_cqxulxu",
                    "score": 2,
                    "created_utc": 1430747248.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Mods yall better sticky this shit. This is exactly what we need. Nice post brother",
            "author": "Reptar_The_Almighty",
            "id": "cqxy7xi",
            "parent_id": "t3_34roov",
            "score": 3,
            "created_utc": 1430748507.0,
            "replies": []
        },
        {
            "body": "TLDR\n\nI just bring a picture in. ",
            "author": "timthetollman",
            "id": "cqy5n5v",
            "parent_id": "t3_34roov",
            "score": 3,
            "created_utc": 1430761284.0,
            "replies": [
                {
                    "body": "And be a cool client.  Pretty much sums it up.",
                    "author": null,
                    "id": "cqyawhi",
                    "parent_id": "t1_cqy5n5v",
                    "score": 2,
                    "created_utc": 1430769659.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "If you need that 5$ tip so bad just raise your price with  5. A tip should not be expected.",
            "author": "RENGARFML",
            "id": "i36lxa8",
            "parent_id": "t3_34roov",
            "score": 3,
            "created_utc": 1648957756.0,
            "replies": []
        },
        {
            "body": "Great stuff man! Where do you operate from? Please say Dallas Texas!",
            "author": "nandrizzle",
            "id": "cqxht6v",
            "parent_id": "t3_34roov",
            "score": 2,
            "created_utc": 1430702852.0,
            "replies": [
                {
                    "body": "Not Dallas haha, sorry...I'm not barbering right now anyways, I just started a new career in emergency medicine.  Unfortunately I don't know any shops in Dallas, otherwise I'd give you a recommendation!",
                    "author": null,
                    "id": "cqxi3cs",
                    "parent_id": "t1_cqxht6v",
                    "score": 6,
                    "created_utc": 1430703392.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "cqxjx43",
                            "parent_id": "t1_cqxi3cs",
                            "score": 1,
                            "created_utc": 1430706663.0,
                            "replies": [
                                {
                                    "body": "I have not spent more than a day in Chicago in my life, and I've never been to the barber there, so I feel a little underqualified, but I'll tell you Joe's Barbershop in Logan Circle is one of the most well-known shops in the country, and it's right in your backyard!  I really want to go there someday.",
                                    "author": null,
                                    "id": "cqxkd8a",
                                    "parent_id": "t1_cqxjx43",
                                    "score": 2,
                                    "created_utc": 1430707448.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Texas Fadez in Oak Cliff is a great place. Place can seem a little sketchy but those barbers know what the hell they are doing",
                            "author": "philleh87",
                            "id": "cqxkorb",
                            "parent_id": "t1_cqxi3cs",
                            "score": 1,
                            "created_utc": 1430708016.0,
                            "replies": []
                        },
                        {
                            "body": "Haha thanks!",
                            "author": "nandrizzle",
                            "id": "cqy4sqq",
                            "parent_id": "t1_cqxi3cs",
                            "score": 1,
                            "created_utc": 1430759910.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "You seem to be too good at your work so why did you leave that?",
            "author": "wildwise",
            "id": "cqy9jqm",
            "parent_id": "t3_34roov",
            "score": 2,
            "created_utc": 1430767546.0,
            "replies": [
                {
                    "body": "I wanted to do something with lights and sirens.  So now I'm an EMT.",
                    "author": null,
                    "id": "cqyax6v",
                    "parent_id": "t1_cqy9jqm",
                    "score": 10,
                    "created_utc": 1430769689.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Hey, \n\nI'm thinking of getting an undercut now except I'm worried the back will come out looking like Macklemore's.\n\nWhat do I say to get the hair on top of my head to slowly fade into the shaved back? Also, for the side part, if I were to get an undercut, could I just part randomly and have it turn out ok? Or would I need to leave a bit of hair there?",
            "author": "BR0DlN",
            "id": "cr4700w",
            "parent_id": "t3_34roov",
            "score": 2,
            "created_utc": 1431228456.0,
            "replies": []
        },
        {
            "body": "I have thin fine hair people say it feels like a baby's hair.  I also have a double crown on the top of my head which is annoying as heck.  Would you ever attempt an undercut? I feel when my hairs too long it just lies flat I'm trying to figure out what I should be styling it like.",
            "author": "justtryit",
            "id": "cqyc6wx",
            "parent_id": "t3_34roov",
            "score": 1,
            "created_utc": 1430771695.0,
            "replies": [
                {
                    "body": "Have you tried blow drying it?  If your hair lies flat when it's long, you can add a lot of volume and control by using a blow dryer.  Youtube that shit!\n\nAlso, mousse adds volume.",
                    "author": null,
                    "id": "cqyu4q0",
                    "parent_id": "t1_cqyc6wx",
                    "score": 1,
                    "created_utc": 1430805205.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "This is an awesome resource for this sub, so glad you shared. I grew up in a family full of female stylists and everything you said is spot on from what they would tell me when I was younger. \n\nAlso, just want to emphasize that the absolute best way is always a picture. Always. I remember when I first went to get my hair cut by someone other than family, I felt really awkward being like \"yeah this random dude with this haircut is what I want\". I think a lot of people who are new to this sub have similar feelings. But the stylist/barber would really just prefer you bring a picture. So do it. Always. \n\nAnd try not to have five pictures. One good picture of the cut you want is really all they need. ",
            "author": null,
            "id": "cqyfnaf",
            "parent_id": "t3_34roov",
            "score": 1,
            "created_utc": 1430777393.0,
            "replies": [
                {
                    "body": "A picture is a really good way, especially for someone who's unsure or who is trying something new.  But most of my clients could communicate what they wanted with words.  Either way works, I wouldn't say one way is better for every situation.  But there's some people who should definitely just bring in a picture haha...\n\nAnd you're right it's nothing to feel embarrassed about.  I never got why guys are like that, I don't judge you for bringing in a picture of a dude.  The only thing we'll talk about afterwards is 1. If it's a picture we've been seeing a lot of lately (we like to keep track of what's popular) or 2. if you're a white guy and bring in a picture of a black guy's haircut.",
                    "author": null,
                    "id": "cqyu641",
                    "parent_id": "t1_cqyfnaf",
                    "score": 1,
                    "created_utc": 1430805332.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "cr3nagc",
            "parent_id": "t3_34roov",
            "score": 1,
            "created_utc": 1431186749.0,
            "replies": [
                {
                    "body": "1.  NO!!!!  Do not come to the barber shop with product in your hair, that is a big no-no.  It clogs up our clippers, and we'll end up having to wash your hair (which we don't care to do.)\n\n2.  Yea, you could have them take the fade higher.  You could also do a \"disconnected\" haircut, which is when the sides aren't faded into the top, essentially an undercut.  As an example, [here](https://s-media-cache-ak0.pinimg.com/236x/d6/e2/9c/d6e29c3a06955a36d728b5bdb8d78d9c.jpg) is a disconnected faux hawk, and [here](https://s-media-cache-ak0.pinimg.com/236x/db/3c/c9/db3cc9ecd154f22c967c15e27897da75.jpg) is a blended (connected) faux hawk.  Either way, it would make that mid-section that you have to comb down be shorter, which will make it sit better.",
                    "author": null,
                    "id": "cr44pnp",
                    "parent_id": "t1_cr3nagc",
                    "score": 2,
                    "created_utc": 1431223274.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Great post!",
            "author": "xJuice",
            "id": "cvmfrhk",
            "parent_id": "t3_34roov",
            "score": 1,
            "created_utc": 1443842498.0,
            "replies": []
        },
        {
            "body": "At the shops I worked at, we never would have gotten upset if a stylist sent a client to a barbershop.  That's a shitton of honesty right there-you know you can't do a skinfade, and that's fair, that's not what you were taught to do in school.  Send 'em over.  \n\nActually, one of the shops I worked for has a sister salon, and they'd send people over to us all the time.  Just like we'd send women with long hair over to them.  I'm not afraid to cut a woman's long hair, but it'll look a hell of a lot better if she sees a stylist.",
            "author": null,
            "id": "cqxp45m",
            "parent_id": "t1_cqxow31",
            "score": 26,
            "created_utc": 1430716802.0,
            "replies": []
        },
        {
            "body": "Honestly if you did that I'd probably tip you just for being honest and helping me make the best choice.",
            "author": "ttchoubs",
            "id": "cqy5kdv",
            "parent_id": "t1_cqxow31",
            "score": 1,
            "created_utc": 1430761160.0,
            "replies": []
        },
        {
            "body": "I actually happen to know a female barber.  Best of both worlds, right?",
            "author": null,
            "id": "cqxq7k9",
            "parent_id": "t1_cqxq5ow",
            "score": 22,
            "created_utc": 1430720164.0,
            "replies": [
                {
                    "body": "Definitely! It took me far too long to find a female who could deal with my hair type. (wavy, thick, 2 crowns) when I finally did, she moved away. Then went to see a buddy who went back to barber school, and I couldn't be happier. \n\nBest thing is to keep going back to the same person, develop a cut/style and keep on track. ",
                    "author": "Imthecoolestdudeever",
                    "id": "cqxql4z",
                    "parent_id": "t1_cqxq7k9",
                    "score": 6,
                    "created_utc": 1430721439.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Some of the best fades in my home town come from an ex-co worker of mine. She isn't a barber either, she's a cosmetologist. That girl can give the cleanest bald fades. She's been giving straight shaves to her boyfriend for years, so now that cosmetologists can do shaves in the salon, she gives some of the best edge ups. \n\nDon't choose to not go to someone because they're called a barber or a cosmetologist, or if they're a male or a female. You choose who to go to based off of reccomendations and the quality of the work that they put out \n\n\n\n",
            "author": null,
            "id": "cqy3map",
            "parent_id": "t1_cqxq5ow",
            "score": 6,
            "created_utc": 1430758001.0,
            "replies": [
                {
                    "body": "I have a question for you, where are you from that you say bald fades?  That comes off kinda rude, but I totally don't mean it that way.  Everywhere I've gotten a haircut or cut hair, they were called skin fades or razor fades.  Im from NYC, also cut hair in Seattle.",
                    "author": null,
                    "id": "cqyalqs",
                    "parent_id": "t1_cqy3map",
                    "score": 4,
                    "created_utc": 1430769187.0,
                    "replies": [
                        {
                            "body": "I live in Texas. More specifically within the greater Houston area. I've never heard it called a skin fade. I have heard razor fade before, but rarely. 9 times out of 10 I hear it referred to as a bald fade. Even some of the barbering educators we have had. ",
                            "author": null,
                            "id": "cqyb4nx",
                            "parent_id": "t1_cqyalqs",
                            "score": 1,
                            "created_utc": 1430770014.0,
                            "replies": [
                                {
                                    "body": "You know, I've never been down south.  Perhaps that's how it's said down there?",
                                    "author": null,
                                    "id": "cqyb6b7",
                                    "parent_id": "t1_cqyb4nx",
                                    "score": 1,
                                    "created_utc": 1430770089.0,
                                    "replies": [
                                        {
                                            "body": "I suppose so. You know, I just looked it up...our main barbering educator who I have heard say it the most is Josh Wagner who *is* from Kentucky....",
                                            "author": null,
                                            "id": "cqybmuz",
                                            "parent_id": "t1_cqyb6b7",
                                            "score": 1,
                                            "created_utc": 1430770830.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "As a barber, I'm here to help people with their hairy situations.  As long as it's on your head.",
            "author": null,
            "id": "cqxh3ss",
            "parent_id": "t1_cqxgsc8",
            "score": 16,
            "created_utc": 1430701506.0,
            "replies": [
                {
                    "body": ":'(",
                    "author": "SunShineImaDine",
                    "id": "cqxh5ae",
                    "parent_id": "t1_cqxh3ss",
                    "score": 7,
                    "created_utc": 1430701585.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "You can tell by looking at it.  [This](http://content.latest-hairstyles.com/wp-content/uploads/2013/10/side-step-thick-hair-for-a-man.jpg) is thick hair, [this](http://pad3.whstatic.com/images/thumb/a/a2/Add-Volume-to-Hair-for-Men-Step-2.jpg/670px-Add-Volume-to-Hair-for-Men-Step-2.jpg) is thin hair.  Basically, how much hair is there on the head.  Fine vs. coarse would be how thick is each individual strand.",
            "author": null,
            "id": "cqxi5pe",
            "parent_id": "t1_cqxhtme",
            "score": 13,
            "created_utc": 1430703516.0,
            "replies": [
                {
                    "body": "I actually made a post asking how you could tell, but no one answered and I'm still not too sure if I have thin or thick hair from those pictures. Here's a gallery of some pictures of my hair, hopefully you could give me an answer from the pictures ive provided. http://imgur.com/a/mVQkJ",
                    "author": null,
                    "id": "cqxj15g",
                    "parent_id": "t1_cqxi5pe",
                    "score": 4,
                    "created_utc": 1430705150.0,
                    "replies": [
                        {
                            "body": "It's really hard to tell without being able to feel your hair.  It definitely looks thick.  It looks to be fairly fine, and soft.",
                            "author": null,
                            "id": "cqxjlor",
                            "parent_id": "t1_cqxj15g",
                            "score": 9,
                            "created_utc": 1430706110.0,
                            "replies": [
                                {
                                    "body": "Thank you for the reply :)",
                                    "author": null,
                                    "id": "cqxjw8b",
                                    "parent_id": "t1_cqxjlor",
                                    "score": 2,
                                    "created_utc": 1430706623.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Looks pretty thick, if you Post a picture of your Hair Wet it makes it easier to tell",
                            "author": "triplee9",
                            "id": "cqxjrsq",
                            "parent_id": "t1_cqxj15g",
                            "score": 4,
                            "created_utc": 1430706407.0,
                            "replies": [
                                {
                                    "body": "Hold up, I'm gonna edit this comment after I take the picture.\n\nEdit- kinda sorta towel dried, how does it look now? http://imgur.com/a/rI44f",
                                    "author": null,
                                    "id": "cqxjwwq",
                                    "parent_id": "t1_cqxjrsq",
                                    "score": 3,
                                    "created_utc": 1430706654.0,
                                    "replies": [
                                        {
                                            "body": "Yea its decently thick. You have good Hair dude. ",
                                            "author": "triplee9",
                                            "id": "cqxkw71",
                                            "parent_id": "t1_cqxjwwq",
                                            "score": 4,
                                            "created_utc": 1430708342.0,
                                            "replies": [
                                                {
                                                    "body": "Thanks for the answer, I've been wondering for a while weather to grow out the top because I might try to do a quiff once schools out so if it looks bad, only my friends will see it and they won't give me shit and you need thick hair for a quiff so yeah. Thanks once again :).",
                                                    "author": null,
                                                    "id": "cqxl2sm",
                                                    "parent_id": "t1_cqxkw71",
                                                    "score": 2,
                                                    "created_utc": 1430708641.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Thanks man",
                    "author": "UnPawsed",
                    "id": "cqxixny",
                    "parent_id": "t1_cqxi5pe",
                    "score": 1,
                    "created_utc": 1430704976.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "There are some great walk-in shops.  I don't even like to bash great clips/supercuts too much because I know a barber who got started there, worked that job for 10 years then opened her own shop and she's one of the best barbers I know.  But unfortunately the majority of Great Clips/Supercuts workers are 1. stylists (only know women's hair) and/or 2. really don't give a shit.\n\nAnyway, the best way to find a barber is to ask people with good haircuts where they go.  Yelp is also a great resource, but you kinda have to wade through the shitty reviews to find truth.  Some of the best shops I've been to have 1 star reviews of dumbasses complaining about a long wait (the shop's fucking busy, sit yo ass down and shut up!) or about adult conversations at the barber shop.  We're dudes and yes sometimes we talk about pussies and say fuck.  We always tried to keep it clean if kids were in the shop but sometimes things slip out (ha!)  Instagram is a fantastic resource, most barber shops that really care about their product have an Instagram with pictures of the cuts they've done.  Which is great, because if you see something you like, you know they can do it!",
            "author": null,
            "id": "cqyauk3",
            "parent_id": "t1_cqxvoea",
            "score": 3,
            "created_utc": 1430769576.0,
            "replies": []
        },
        {
            "body": "Nothing wrong with that, if that's what you want.  I'd probably ask you how long it's been since your last cut, to gauge how short to go, and I'd ask how/if you style it.  Then I'd be set to go.",
            "author": null,
            "id": "cqxxqdy",
            "parent_id": "t1_cqxru34",
            "score": 4,
            "created_utc": 1430747496.0,
            "replies": []
        },
        {
            "body": "Yeah, listen to your barber",
            "author": "wojx",
            "id": "cqxumjf",
            "parent_id": "t1_cqxru34",
            "score": 1,
            "created_utc": 1430739020.0,
            "replies": []
        },
        {
            "body": "Yea we'd clean up clients who are doing a grow out all the time.  I'd just take a little off the sides and clean up and shave the nape.  Maybe, but rarely, if the top looked super sloppy I'd even it out a bit, but again it was pretty rare that I touched the top.  \n\nJust tell him you're growing it out, and tell him not to touch the top.  It shouldn't be a problem.",
            "author": null,
            "id": "cqyaikn",
            "parent_id": "t1_cqy4fox",
            "score": 4,
            "created_utc": 1430769051.0,
            "replies": []
        },
        {
            "body": "Literally exactly what you just said. \"I'm growing my hair out but want it trimmed so it looks less messy. I'd like as little taken off as possible\". You could get into detail a little more if there was anything else specifically you wanted done or if the barber wanted further clarification, but that in itself is pretty good in terms of letting them know what exactly you're there for. ",
            "author": "boganhobo",
            "id": "cqyaetb",
            "parent_id": "t1_cqy4fox",
            "score": 3,
            "created_utc": 1430768889.0,
            "replies": []
        },
        {
            "body": "Barber's clientele is mostly people with simple cuts, short to very short, with generally alot of clipper work.\n\nHair stylist clientele is mostly people with complex cuts, longer hair, with alot of freehand work.\n\nJust because one barber on the internet is confident with longer hair with more texture work doesn't mean that any barber you rock up to is the same, more than likely they are not confident at all. The safer option is the hairstylist, always.",
            "author": "genetalgiant",
            "id": "cqxw1wu",
            "parent_id": "t1_cqxulxu",
            "score": 3,
            "created_utc": 1430743490.0,
            "replies": []
        },
        {
            "body": "Asian hair is tricky to cut, but any well-trained and patient barber should be able to handle it.  Asian hair is thin, fine and soft so it tends to be more difficult to fade, and it is poofy so it doesn't do exactly what you want.  So yea he's being unreasonable.  Because on top of that, there's white guys that have the same type of hair.  My friends always make fun of me, a white guy, for having hair that is pretty much the same as Asian hair.",
            "author": null,
            "id": "cqxxm6l",
            "parent_id": "t1_cqxulxu",
            "score": 2,
            "created_utc": 1430747248.0,
            "replies": []
        },
        {
            "body": "And be a cool client.  Pretty much sums it up.",
            "author": null,
            "id": "cqyawhi",
            "parent_id": "t1_cqy5n5v",
            "score": 2,
            "created_utc": 1430769659.0,
            "replies": []
        },
        {
            "body": "Not Dallas haha, sorry...I'm not barbering right now anyways, I just started a new career in emergency medicine.  Unfortunately I don't know any shops in Dallas, otherwise I'd give you a recommendation!",
            "author": null,
            "id": "cqxi3cs",
            "parent_id": "t1_cqxht6v",
            "score": 6,
            "created_utc": 1430703392.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "cqxjx43",
                    "parent_id": "t1_cqxi3cs",
                    "score": 1,
                    "created_utc": 1430706663.0,
                    "replies": [
                        {
                            "body": "I have not spent more than a day in Chicago in my life, and I've never been to the barber there, so I feel a little underqualified, but I'll tell you Joe's Barbershop in Logan Circle is one of the most well-known shops in the country, and it's right in your backyard!  I really want to go there someday.",
                            "author": null,
                            "id": "cqxkd8a",
                            "parent_id": "t1_cqxjx43",
                            "score": 2,
                            "created_utc": 1430707448.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Texas Fadez in Oak Cliff is a great place. Place can seem a little sketchy but those barbers know what the hell they are doing",
                    "author": "philleh87",
                    "id": "cqxkorb",
                    "parent_id": "t1_cqxi3cs",
                    "score": 1,
                    "created_utc": 1430708016.0,
                    "replies": []
                },
                {
                    "body": "Haha thanks!",
                    "author": "nandrizzle",
                    "id": "cqy4sqq",
                    "parent_id": "t1_cqxi3cs",
                    "score": 1,
                    "created_utc": 1430759910.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I wanted to do something with lights and sirens.  So now I'm an EMT.",
            "author": null,
            "id": "cqyax6v",
            "parent_id": "t1_cqy9jqm",
            "score": 10,
            "created_utc": 1430769689.0,
            "replies": []
        },
        {
            "body": "Have you tried blow drying it?  If your hair lies flat when it's long, you can add a lot of volume and control by using a blow dryer.  Youtube that shit!\n\nAlso, mousse adds volume.",
            "author": null,
            "id": "cqyu4q0",
            "parent_id": "t1_cqyc6wx",
            "score": 1,
            "created_utc": 1430805205.0,
            "replies": []
        },
        {
            "body": "A picture is a really good way, especially for someone who's unsure or who is trying something new.  But most of my clients could communicate what they wanted with words.  Either way works, I wouldn't say one way is better for every situation.  But there's some people who should definitely just bring in a picture haha...\n\nAnd you're right it's nothing to feel embarrassed about.  I never got why guys are like that, I don't judge you for bringing in a picture of a dude.  The only thing we'll talk about afterwards is 1. If it's a picture we've been seeing a lot of lately (we like to keep track of what's popular) or 2. if you're a white guy and bring in a picture of a black guy's haircut.",
            "author": null,
            "id": "cqyu641",
            "parent_id": "t1_cqyfnaf",
            "score": 1,
            "created_utc": 1430805332.0,
            "replies": []
        },
        {
            "body": "1.  NO!!!!  Do not come to the barber shop with product in your hair, that is a big no-no.  It clogs up our clippers, and we'll end up having to wash your hair (which we don't care to do.)\n\n2.  Yea, you could have them take the fade higher.  You could also do a \"disconnected\" haircut, which is when the sides aren't faded into the top, essentially an undercut.  As an example, [here](https://s-media-cache-ak0.pinimg.com/236x/d6/e2/9c/d6e29c3a06955a36d728b5bdb8d78d9c.jpg) is a disconnected faux hawk, and [here](https://s-media-cache-ak0.pinimg.com/236x/db/3c/c9/db3cc9ecd154f22c967c15e27897da75.jpg) is a blended (connected) faux hawk.  Either way, it would make that mid-section that you have to comb down be shorter, which will make it sit better.",
            "author": null,
            "id": "cr44pnp",
            "parent_id": "t1_cr3nagc",
            "score": 2,
            "created_utc": 1431223274.0,
            "replies": []
        },
        {
            "body": "Definitely! It took me far too long to find a female who could deal with my hair type. (wavy, thick, 2 crowns) when I finally did, she moved away. Then went to see a buddy who went back to barber school, and I couldn't be happier. \n\nBest thing is to keep going back to the same person, develop a cut/style and keep on track. ",
            "author": "Imthecoolestdudeever",
            "id": "cqxql4z",
            "parent_id": "t1_cqxq7k9",
            "score": 6,
            "created_utc": 1430721439.0,
            "replies": []
        },
        {
            "body": "I have a question for you, where are you from that you say bald fades?  That comes off kinda rude, but I totally don't mean it that way.  Everywhere I've gotten a haircut or cut hair, they were called skin fades or razor fades.  Im from NYC, also cut hair in Seattle.",
            "author": null,
            "id": "cqyalqs",
            "parent_id": "t1_cqy3map",
            "score": 4,
            "created_utc": 1430769187.0,
            "replies": [
                {
                    "body": "I live in Texas. More specifically within the greater Houston area. I've never heard it called a skin fade. I have heard razor fade before, but rarely. 9 times out of 10 I hear it referred to as a bald fade. Even some of the barbering educators we have had. ",
                    "author": null,
                    "id": "cqyb4nx",
                    "parent_id": "t1_cqyalqs",
                    "score": 1,
                    "created_utc": 1430770014.0,
                    "replies": [
                        {
                            "body": "You know, I've never been down south.  Perhaps that's how it's said down there?",
                            "author": null,
                            "id": "cqyb6b7",
                            "parent_id": "t1_cqyb4nx",
                            "score": 1,
                            "created_utc": 1430770089.0,
                            "replies": [
                                {
                                    "body": "I suppose so. You know, I just looked it up...our main barbering educator who I have heard say it the most is Josh Wagner who *is* from Kentucky....",
                                    "author": null,
                                    "id": "cqybmuz",
                                    "parent_id": "t1_cqyb6b7",
                                    "score": 1,
                                    "created_utc": 1430770830.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": ":'(",
            "author": "SunShineImaDine",
            "id": "cqxh5ae",
            "parent_id": "t1_cqxh3ss",
            "score": 7,
            "created_utc": 1430701585.0,
            "replies": []
        },
        {
            "body": "I actually made a post asking how you could tell, but no one answered and I'm still not too sure if I have thin or thick hair from those pictures. Here's a gallery of some pictures of my hair, hopefully you could give me an answer from the pictures ive provided. http://imgur.com/a/mVQkJ",
            "author": null,
            "id": "cqxj15g",
            "parent_id": "t1_cqxi5pe",
            "score": 4,
            "created_utc": 1430705150.0,
            "replies": [
                {
                    "body": "It's really hard to tell without being able to feel your hair.  It definitely looks thick.  It looks to be fairly fine, and soft.",
                    "author": null,
                    "id": "cqxjlor",
                    "parent_id": "t1_cqxj15g",
                    "score": 9,
                    "created_utc": 1430706110.0,
                    "replies": [
                        {
                            "body": "Thank you for the reply :)",
                            "author": null,
                            "id": "cqxjw8b",
                            "parent_id": "t1_cqxjlor",
                            "score": 2,
                            "created_utc": 1430706623.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Looks pretty thick, if you Post a picture of your Hair Wet it makes it easier to tell",
                    "author": "triplee9",
                    "id": "cqxjrsq",
                    "parent_id": "t1_cqxj15g",
                    "score": 4,
                    "created_utc": 1430706407.0,
                    "replies": [
                        {
                            "body": "Hold up, I'm gonna edit this comment after I take the picture.\n\nEdit- kinda sorta towel dried, how does it look now? http://imgur.com/a/rI44f",
                            "author": null,
                            "id": "cqxjwwq",
                            "parent_id": "t1_cqxjrsq",
                            "score": 3,
                            "created_utc": 1430706654.0,
                            "replies": [
                                {
                                    "body": "Yea its decently thick. You have good Hair dude. ",
                                    "author": "triplee9",
                                    "id": "cqxkw71",
                                    "parent_id": "t1_cqxjwwq",
                                    "score": 4,
                                    "created_utc": 1430708342.0,
                                    "replies": [
                                        {
                                            "body": "Thanks for the answer, I've been wondering for a while weather to grow out the top because I might try to do a quiff once schools out so if it looks bad, only my friends will see it and they won't give me shit and you need thick hair for a quiff so yeah. Thanks once again :).",
                                            "author": null,
                                            "id": "cqxl2sm",
                                            "parent_id": "t1_cqxkw71",
                                            "score": 2,
                                            "created_utc": 1430708641.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Thanks man",
            "author": "UnPawsed",
            "id": "cqxixny",
            "parent_id": "t1_cqxi5pe",
            "score": 1,
            "created_utc": 1430704976.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "cqxjx43",
            "parent_id": "t1_cqxi3cs",
            "score": 1,
            "created_utc": 1430706663.0,
            "replies": [
                {
                    "body": "I have not spent more than a day in Chicago in my life, and I've never been to the barber there, so I feel a little underqualified, but I'll tell you Joe's Barbershop in Logan Circle is one of the most well-known shops in the country, and it's right in your backyard!  I really want to go there someday.",
                    "author": null,
                    "id": "cqxkd8a",
                    "parent_id": "t1_cqxjx43",
                    "score": 2,
                    "created_utc": 1430707448.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Texas Fadez in Oak Cliff is a great place. Place can seem a little sketchy but those barbers know what the hell they are doing",
            "author": "philleh87",
            "id": "cqxkorb",
            "parent_id": "t1_cqxi3cs",
            "score": 1,
            "created_utc": 1430708016.0,
            "replies": []
        },
        {
            "body": "Haha thanks!",
            "author": "nandrizzle",
            "id": "cqy4sqq",
            "parent_id": "t1_cqxi3cs",
            "score": 1,
            "created_utc": 1430759910.0,
            "replies": []
        },
        {
            "body": "I live in Texas. More specifically within the greater Houston area. I've never heard it called a skin fade. I have heard razor fade before, but rarely. 9 times out of 10 I hear it referred to as a bald fade. Even some of the barbering educators we have had. ",
            "author": null,
            "id": "cqyb4nx",
            "parent_id": "t1_cqyalqs",
            "score": 1,
            "created_utc": 1430770014.0,
            "replies": [
                {
                    "body": "You know, I've never been down south.  Perhaps that's how it's said down there?",
                    "author": null,
                    "id": "cqyb6b7",
                    "parent_id": "t1_cqyb4nx",
                    "score": 1,
                    "created_utc": 1430770089.0,
                    "replies": [
                        {
                            "body": "I suppose so. You know, I just looked it up...our main barbering educator who I have heard say it the most is Josh Wagner who *is* from Kentucky....",
                            "author": null,
                            "id": "cqybmuz",
                            "parent_id": "t1_cqyb6b7",
                            "score": 1,
                            "created_utc": 1430770830.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "It's really hard to tell without being able to feel your hair.  It definitely looks thick.  It looks to be fairly fine, and soft.",
            "author": null,
            "id": "cqxjlor",
            "parent_id": "t1_cqxj15g",
            "score": 9,
            "created_utc": 1430706110.0,
            "replies": [
                {
                    "body": "Thank you for the reply :)",
                    "author": null,
                    "id": "cqxjw8b",
                    "parent_id": "t1_cqxjlor",
                    "score": 2,
                    "created_utc": 1430706623.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Looks pretty thick, if you Post a picture of your Hair Wet it makes it easier to tell",
            "author": "triplee9",
            "id": "cqxjrsq",
            "parent_id": "t1_cqxj15g",
            "score": 4,
            "created_utc": 1430706407.0,
            "replies": [
                {
                    "body": "Hold up, I'm gonna edit this comment after I take the picture.\n\nEdit- kinda sorta towel dried, how does it look now? http://imgur.com/a/rI44f",
                    "author": null,
                    "id": "cqxjwwq",
                    "parent_id": "t1_cqxjrsq",
                    "score": 3,
                    "created_utc": 1430706654.0,
                    "replies": [
                        {
                            "body": "Yea its decently thick. You have good Hair dude. ",
                            "author": "triplee9",
                            "id": "cqxkw71",
                            "parent_id": "t1_cqxjwwq",
                            "score": 4,
                            "created_utc": 1430708342.0,
                            "replies": [
                                {
                                    "body": "Thanks for the answer, I've been wondering for a while weather to grow out the top because I might try to do a quiff once schools out so if it looks bad, only my friends will see it and they won't give me shit and you need thick hair for a quiff so yeah. Thanks once again :).",
                                    "author": null,
                                    "id": "cqxl2sm",
                                    "parent_id": "t1_cqxkw71",
                                    "score": 2,
                                    "created_utc": 1430708641.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I have not spent more than a day in Chicago in my life, and I've never been to the barber there, so I feel a little underqualified, but I'll tell you Joe's Barbershop in Logan Circle is one of the most well-known shops in the country, and it's right in your backyard!  I really want to go there someday.",
            "author": null,
            "id": "cqxkd8a",
            "parent_id": "t1_cqxjx43",
            "score": 2,
            "created_utc": 1430707448.0,
            "replies": []
        },
        {
            "body": "You know, I've never been down south.  Perhaps that's how it's said down there?",
            "author": null,
            "id": "cqyb6b7",
            "parent_id": "t1_cqyb4nx",
            "score": 1,
            "created_utc": 1430770089.0,
            "replies": [
                {
                    "body": "I suppose so. You know, I just looked it up...our main barbering educator who I have heard say it the most is Josh Wagner who *is* from Kentucky....",
                    "author": null,
                    "id": "cqybmuz",
                    "parent_id": "t1_cqyb6b7",
                    "score": 1,
                    "created_utc": 1430770830.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Thank you for the reply :)",
            "author": null,
            "id": "cqxjw8b",
            "parent_id": "t1_cqxjlor",
            "score": 2,
            "created_utc": 1430706623.0,
            "replies": []
        },
        {
            "body": "Hold up, I'm gonna edit this comment after I take the picture.\n\nEdit- kinda sorta towel dried, how does it look now? http://imgur.com/a/rI44f",
            "author": null,
            "id": "cqxjwwq",
            "parent_id": "t1_cqxjrsq",
            "score": 3,
            "created_utc": 1430706654.0,
            "replies": [
                {
                    "body": "Yea its decently thick. You have good Hair dude. ",
                    "author": "triplee9",
                    "id": "cqxkw71",
                    "parent_id": "t1_cqxjwwq",
                    "score": 4,
                    "created_utc": 1430708342.0,
                    "replies": [
                        {
                            "body": "Thanks for the answer, I've been wondering for a while weather to grow out the top because I might try to do a quiff once schools out so if it looks bad, only my friends will see it and they won't give me shit and you need thick hair for a quiff so yeah. Thanks once again :).",
                            "author": null,
                            "id": "cqxl2sm",
                            "parent_id": "t1_cqxkw71",
                            "score": 2,
                            "created_utc": 1430708641.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I suppose so. You know, I just looked it up...our main barbering educator who I have heard say it the most is Josh Wagner who *is* from Kentucky....",
            "author": null,
            "id": "cqybmuz",
            "parent_id": "t1_cqyb6b7",
            "score": 1,
            "created_utc": 1430770830.0,
            "replies": []
        },
        {
            "body": "Yea its decently thick. You have good Hair dude. ",
            "author": "triplee9",
            "id": "cqxkw71",
            "parent_id": "t1_cqxjwwq",
            "score": 4,
            "created_utc": 1430708342.0,
            "replies": [
                {
                    "body": "Thanks for the answer, I've been wondering for a while weather to grow out the top because I might try to do a quiff once schools out so if it looks bad, only my friends will see it and they won't give me shit and you need thick hair for a quiff so yeah. Thanks once again :).",
                    "author": null,
                    "id": "cqxl2sm",
                    "parent_id": "t1_cqxkw71",
                    "score": 2,
                    "created_utc": 1430708641.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Thanks for the answer, I've been wondering for a while weather to grow out the top because I might try to do a quiff once schools out so if it looks bad, only my friends will see it and they won't give me shit and you need thick hair for a quiff so yeah. Thanks once again :).",
            "author": null,
            "id": "cqxl2sm",
            "parent_id": "t1_cqxkw71",
            "score": 2,
            "created_utc": 1430708641.0,
            "replies": []
        }
    ]
}