{
    "title": "I found my SD! 😍",
    "post_id": "df0eyw",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/df0eyw/i_found_my_sd/",
    "author": "GTSGF",
    "body": "I connected with a new guy via WhatsYourPrice on Sunday after he made a $150 offer for a date. We met at a restaurant of my choosing for dinner, and I had an amazing time being wined and dined by this really kind, humorous, interesting, successful guy who wasn’t weird about me being trans. Not a single red flag all night, and he slipped me the cash very discretely like a gentleman. We had such a good time, I forgot to even mention a potential arrangement, and I couldn’t help but kiss him after (turns out he’s a great kisser too).\n\nShortly after we parted ways, he texted me asking if I would like to come over for dinner at his place the very next night, and that he would like to cook for me. Normally, I would have said HELL NO, because that’s how you get drugged and raped or axe murdered. But I have a strong intuition, and everything about him read as genuine and well-intentioned.\n\nSo, I accepted, and it was incredible. I had one of the most romantic nights of my life, and I was in bliss. We both love seafood more than anything, and he made red snapper with curry, rice pilaf, scallops, and spinach on his outdoor stove inbetween snuggles. It was a new recipe he’d never tried before, and it turned out great! It was kind of adorable to watch him try and cook by candlelight to maintain the mood though 🤭\n\nBut, I wasn’t going to let myself be dazzled beyond discussing an allowance this time, so I brought it up as we finished eating. The conversation went smoothly, and he agreed to my per-meet proposal without protest. Things got pretty steamy on the couch from there. My only complaint is that he is tragically vanilla, but he’s a naturally dominant enough person that it worked out great. And he loves my body a lot, exactly the way it is, which is really reassuring when I’m normally fighting off the brain weasels of dysphoria.\n\nWe wrapped it up eventually, and he gave me my allowance without me having to ask. We kissed a lot, and I was honestly sad to go. I’m still stunned and amazed, and it’s all so surreal and exciting all at once. I let him know when I got home safely, and thanked him for the incredible night. I’m going to have to find some way to up my game next time lol.\n\nThis is all to say, I’m a trans girl in a small city, and if I can find someone genuine and amazing, so can you. 💖",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/df0eyw/i_found_my_sd/",
    "score": 258,
    "upvote_ratio": 0.94,
    "created_utc": 1570543506.0,
    "num_comments": 32,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "Congratulations on your successful arrangement.! You are proof that perseverance pays!",
            "author": "SDforreal",
            "id": "f302hrv",
            "parent_id": "t3_df0eyw",
            "score": 28,
            "created_utc": 1570544884.0,
            "replies": [
                {
                    "body": "Thanks! I’m patient and a little picky, so I knew I was in it for the long game from the start. Honestly, I’m surprised it only took a couple months.",
                    "author": "GTSGF",
                    "id": "f303kp5",
                    "parent_id": "t1_f302hrv",
                    "score": 12,
                    "created_utc": 1570545618.0,
                    "replies": [
                        {
                            "body": "you probably deserve to be picky! You sound like a great catch. :)",
                            "author": null,
                            "id": "f30r2tj",
                            "parent_id": "t1_f303kp5",
                            "score": 6,
                            "created_utc": 1570560548.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "1. Congrats!!!!! All the best wishes and kisses for you two\n2. I love the way you write. \"Brain weasles\" LOL.",
            "author": null,
            "id": "f30r1oo",
            "parent_id": "t3_df0eyw",
            "score": 9,
            "created_utc": 1570560529.0,
            "replies": []
        },
        {
            "body": "That's so fantastic, I'm always so happy to hear these success stories! Makes me hopeful for my future haha. \n\nI haven't heard of WhatsYourPrice, it seems like a great idea. I'm gonna make an account now! Anybody (OP or otherwise) have any impressions/experiences/tips from the site?",
            "author": "Tall-Hungg69",
            "id": "f31bir0",
            "parent_id": "t3_df0eyw",
            "score": 5,
            "created_utc": 1570571668.0,
            "replies": [
                {
                    "body": "WYP doesn’t have the same kind of premise as SA that there will be an arrangement involved, so you have to feel out your date’s intentions more and be ready to bring it up yourself. It also means more broke guys who are willing to drop $100 on a first date in search of a traditional relationship afterward as an icebreaker. There also appear to be a LOT less people on WYP in general, so the pool is a bit small and slow. I made a Successful account as well to look at the competition in my area, and it was immediately obvious how many girls had no clue what they were doing. If you have good photos and can stand out as someone serious, you’ll have a huge leg up on the rest, but I suppose that goes for any site.\n\nGood luck!",
                    "author": "GTSGF",
                    "id": "f31cq3t",
                    "parent_id": "t1_f31bir0",
                    "score": 7,
                    "created_utc": 1570572440.0,
                    "replies": []
                },
                {
                    "body": "I’ve actually had many lovely dates from WYP.  I am finding that there are many men interested in an arrangement, and I’ve had a few short term ones from that site, but as yet, no long-term arrangements.",
                    "author": "RealEarthAngel",
                    "id": "f48ipyc",
                    "parent_id": "t1_f31bir0",
                    "score": 1,
                    "created_utc": 1571439979.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Congratulations on your find. Sounds like you had a great time and that you are both on the same page. It's sweet he cooked for you.\n\nHope it continues ☺️",
            "author": null,
            "id": "f302ik6",
            "parent_id": "t3_df0eyw",
            "score": 7,
            "created_utc": 1570544898.0,
            "replies": [
                {
                    "body": "Thank you! I felt a little bad having money talk after he had just made me such a lovely meal, but we definitely had the same expectations in mind, and it worked out for both of us. ☺️ I’m going to have to find out what his favorite treat is and surprise him with it next time.",
                    "author": "GTSGF",
                    "id": "f303ulx",
                    "parent_id": "t1_f302ik6",
                    "score": 1,
                    "created_utc": 1570545793.0,
                    "replies": [
                        {
                            "body": "The other side of that is your bringing it up was probably  a wonderful signal to him that you were ready to proceed.  Thus ,  erasing any doubts which he might have been harboring .  Think of it as opening the floodgate rather than breaking the flow.",
                            "author": "pinotandsugar",
                            "id": "f311m9z",
                            "parent_id": "t1_f303ulx",
                            "score": 3,
                            "created_utc": 1570566377.0,
                            "replies": [
                                {
                                    "body": "That’s pretty good insight. We definitely let down some barriers after that discussion. Overall a good thing for sure.",
                                    "author": "GTSGF",
                                    "id": "f31itas",
                                    "parent_id": "t1_f311m9z",
                                    "score": 2,
                                    "created_utc": 1570576490.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "It is really awkward sometimes to break the genuine flow of connection. But everyone has their intentions and it should always be fine to voice them considering the platform you met on. \n\nI like to get it out the way as early as possible, the never really intend to mention it again. \n\nYou have both found an arrangement that makes you both happy and that's all that matters.",
                            "author": null,
                            "id": "f3044lc",
                            "parent_id": "t1_f303ulx",
                            "score": 2,
                            "created_utc": 1570545974.0,
                            "replies": [
                                {
                                    "body": "My thoughts exactly. He’s proven twice so far that he doesn’t need any reminding, so I plan on never bringing it up again and just enjoying and nurturing what we have.",
                                    "author": "GTSGF",
                                    "id": "f3057dd",
                                    "parent_id": "t1_f3044lc",
                                    "score": 1,
                                    "created_utc": 1570546673.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I am feeling that you both will fall in love with each other",
            "author": "fanaticCoder",
            "id": "f30r517",
            "parent_id": "t3_df0eyw",
            "score": 3,
            "created_utc": 1570560588.0,
            "replies": []
        },
        {
            "body": "I’m so happy for you!",
            "author": "skaikruu",
            "id": "f312tbg",
            "parent_id": "t3_df0eyw",
            "score": 2,
            "created_utc": 1570567019.0,
            "replies": []
        },
        {
            "body": "I hope everything continues to work out for you doll good luck! Xx",
            "author": "lillianxxx",
            "id": "f313tfo",
            "parent_id": "t3_df0eyw",
            "score": 2,
            "created_utc": 1570567544.0,
            "replies": []
        },
        {
            "body": "> Normally, I would have said HELL NO, because that’s how you get drugged and raped or axe murdered\n\nWhile I am always in favor of people taking precautions and I truly agree that you need to be careful about going to another's home, the overwhelming odds are against someone being murdered or drugged -- especially  murdered, which is just a rare thing period.\n\nThe biggest risk is sexual assault by someone who assumes consent when you enter their home and then doesn't respect boundaries, seek more consent, understand consent can be withdrawn.\n\nSadly, this can happen anywhere -- not just his home.\n\nAnyone who uses an app to meet someone and then murders them is getting caught. That is not the worry I'd focus on.\n\nSo glad things are looking great for you.",
            "author": "marker3000",
            "id": "f31ktew",
            "parent_id": "t3_df0eyw",
            "score": 2,
            "created_utc": 1570577941.0,
            "replies": [
                {
                    "body": "With trans panic defense rulings, I’m never at ease with that kind of stuff. I can be legally and defensibly murdered in most states, with precedented rulings to back it up. And the number of times my life has been threatened because of who I am is nothing to gloss over. I know it’s not something to worry about for most, but for me it’s a very harsh reality that I have to take precautions for.",
                    "author": "GTSGF",
                    "id": "f31lvs7",
                    "parent_id": "t1_f31ktew",
                    "score": 6,
                    "created_utc": 1570578717.0,
                    "replies": [
                        {
                            "body": "Again, I am 100% pro taking precautions. \n\nI presume any partners know ahead of time you're trans and accept you for being you. At least I hope so.",
                            "author": "marker3000",
                            "id": "f31m6qq",
                            "parent_id": "t1_f31lvs7",
                            "score": 2,
                            "created_utc": 1570578945.0,
                            "replies": [
                                {
                                    "body": "I have it on my profile. I’ve been baited on dates before by people with hateful intentions, though. Either not showing and then mocking me over messages for being so “gullible”, or actually showing up in person to tell me how disgusting they think I am. It’s wild the lengths people will go to to be awful.",
                                    "author": "GTSGF",
                                    "id": "f31ofm0",
                                    "parent_id": "t1_f31m6qq",
                                    "score": 3,
                                    "created_utc": 1570580595.0,
                                    "replies": [
                                        {
                                            "body": "Well f---- the haters. You be you. No apologies needed ever.",
                                            "author": "marker3000",
                                            "id": "f31pvwv",
                                            "parent_id": "t1_f31ofm0",
                                            "score": 2,
                                            "created_utc": 1570581655.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "So happy for you! Just wondering how your brought it up to him as I'm new to this and just gaging ways in which to have these conversations. 💕",
            "author": "amanita__muscaria",
            "id": "f32bbje",
            "parent_id": "t3_df0eyw",
            "score": 2,
            "created_utc": 1570600634.0,
            "replies": [
                {
                    "body": "“I’ve had a lovely evening, thank you so much for dinner! Would you be interested in turning this into a regular thing with an arrangement?”",
                    "author": "GTSGF",
                    "id": "f32nwcv",
                    "parent_id": "t1_f32bbje",
                    "score": 3,
                    "created_utc": 1570619757.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "That is lovely and I am so happy for you! Happiness does exist and so do genuinely sweet people who like every bit of you. All the best in your arrangement and who knows, if both of you would like it to progress further than all the best with that too.",
            "author": "heynobi",
            "id": "f30evt7",
            "parent_id": "t3_df0eyw",
            "score": 3,
            "created_utc": 1570552875.0,
            "replies": []
        },
        {
            "body": "What does \"tragically vanilla\" mean?",
            "author": "Ultra888",
            "id": "f5o5xrm",
            "parent_id": "t3_df0eyw",
            "score": 1,
            "created_utc": 1572310709.0,
            "replies": [
                {
                    "body": "Sorry, I’m heavily involved in my local BDSM community, and we use vanilla differently than folks seem to use it on this forum. By “tragically vanilla”, I meant that I was disappointed to find that he doesn’t really have any kinks. It’s just pretty boring for me when I’m so used to unusual and intense forms of intimacy.",
                    "author": "GTSGF",
                    "id": "f5o78a2",
                    "parent_id": "t1_f5o5xrm",
                    "score": 1,
                    "created_utc": 1572311505.0,
                    "replies": [
                        {
                            "body": "So things like eating ass, 69, licking toes, various positions and what not. Would this be considered vanilla? \n\nAsking for a friend.",
                            "author": "Ultra888",
                            "id": "f5o7ob9",
                            "parent_id": "t1_f5o78a2",
                            "score": 1,
                            "created_utc": 1572311775.0,
                            "replies": [
                                {
                                    "body": "It’s better than missionary and BJs, but it’s still pretty standard fare in my experience. The toes are at least seemingly related to a foot fetish, so you’ve got that going for you. But I couldn’t even get him to give my ass a smack while I was lying seductively over his lap with my ass in the air after swallowing his load. And that’s probably the least kinky thing I’m into.",
                                    "author": "GTSGF",
                                    "id": "f5o9rxz",
                                    "parent_id": "t1_f5o7ob9",
                                    "score": 1,
                                    "created_utc": 1572313082.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Oh I love seeing this!\nExactly how you should be treated. \nSo happy for you! 😊",
            "author": "Dressedtokillxxx",
            "id": "f6pavc4",
            "parent_id": "t3_df0eyw",
            "score": 1,
            "created_utc": 1573052050.0,
            "replies": [
                {
                    "body": "Unfortunately, this guy ghosted me 😓",
                    "author": "GTSGF",
                    "id": "f6pqgg0",
                    "parent_id": "t1_f6pavc4",
                    "score": 0,
                    "created_utc": 1573062058.0,
                    "replies": [
                        {
                            "body": "Oh no! \nUgh that's so disappointing, I'm sorry to hear that 😔",
                            "author": "Dressedtokillxxx",
                            "id": "f6q3l8p",
                            "parent_id": "t1_f6pqgg0",
                            "score": 1,
                            "created_utc": 1573070262.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Oh wow🤗so so happy for you😚this sounds amazing. Congrats 🥰",
            "author": null,
            "id": "f30nntp",
            "parent_id": "t3_df0eyw",
            "score": 1,
            "created_utc": 1570558373.0,
            "replies": []
        },
        {
            "body": "Thanks! I’m patient and a little picky, so I knew I was in it for the long game from the start. Honestly, I’m surprised it only took a couple months.",
            "author": "GTSGF",
            "id": "f303kp5",
            "parent_id": "t1_f302hrv",
            "score": 12,
            "created_utc": 1570545618.0,
            "replies": [
                {
                    "body": "you probably deserve to be picky! You sound like a great catch. :)",
                    "author": null,
                    "id": "f30r2tj",
                    "parent_id": "t1_f303kp5",
                    "score": 6,
                    "created_utc": 1570560548.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "WYP doesn’t have the same kind of premise as SA that there will be an arrangement involved, so you have to feel out your date’s intentions more and be ready to bring it up yourself. It also means more broke guys who are willing to drop $100 on a first date in search of a traditional relationship afterward as an icebreaker. There also appear to be a LOT less people on WYP in general, so the pool is a bit small and slow. I made a Successful account as well to look at the competition in my area, and it was immediately obvious how many girls had no clue what they were doing. If you have good photos and can stand out as someone serious, you’ll have a huge leg up on the rest, but I suppose that goes for any site.\n\nGood luck!",
            "author": "GTSGF",
            "id": "f31cq3t",
            "parent_id": "t1_f31bir0",
            "score": 7,
            "created_utc": 1570572440.0,
            "replies": []
        },
        {
            "body": "I’ve actually had many lovely dates from WYP.  I am finding that there are many men interested in an arrangement, and I’ve had a few short term ones from that site, but as yet, no long-term arrangements.",
            "author": "RealEarthAngel",
            "id": "f48ipyc",
            "parent_id": "t1_f31bir0",
            "score": 1,
            "created_utc": 1571439979.0,
            "replies": []
        },
        {
            "body": "Thank you! I felt a little bad having money talk after he had just made me such a lovely meal, but we definitely had the same expectations in mind, and it worked out for both of us. ☺️ I’m going to have to find out what his favorite treat is and surprise him with it next time.",
            "author": "GTSGF",
            "id": "f303ulx",
            "parent_id": "t1_f302ik6",
            "score": 1,
            "created_utc": 1570545793.0,
            "replies": [
                {
                    "body": "The other side of that is your bringing it up was probably  a wonderful signal to him that you were ready to proceed.  Thus ,  erasing any doubts which he might have been harboring .  Think of it as opening the floodgate rather than breaking the flow.",
                    "author": "pinotandsugar",
                    "id": "f311m9z",
                    "parent_id": "t1_f303ulx",
                    "score": 3,
                    "created_utc": 1570566377.0,
                    "replies": [
                        {
                            "body": "That’s pretty good insight. We definitely let down some barriers after that discussion. Overall a good thing for sure.",
                            "author": "GTSGF",
                            "id": "f31itas",
                            "parent_id": "t1_f311m9z",
                            "score": 2,
                            "created_utc": 1570576490.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "It is really awkward sometimes to break the genuine flow of connection. But everyone has their intentions and it should always be fine to voice them considering the platform you met on. \n\nI like to get it out the way as early as possible, the never really intend to mention it again. \n\nYou have both found an arrangement that makes you both happy and that's all that matters.",
                    "author": null,
                    "id": "f3044lc",
                    "parent_id": "t1_f303ulx",
                    "score": 2,
                    "created_utc": 1570545974.0,
                    "replies": [
                        {
                            "body": "My thoughts exactly. He’s proven twice so far that he doesn’t need any reminding, so I plan on never bringing it up again and just enjoying and nurturing what we have.",
                            "author": "GTSGF",
                            "id": "f3057dd",
                            "parent_id": "t1_f3044lc",
                            "score": 1,
                            "created_utc": 1570546673.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "With trans panic defense rulings, I’m never at ease with that kind of stuff. I can be legally and defensibly murdered in most states, with precedented rulings to back it up. And the number of times my life has been threatened because of who I am is nothing to gloss over. I know it’s not something to worry about for most, but for me it’s a very harsh reality that I have to take precautions for.",
            "author": "GTSGF",
            "id": "f31lvs7",
            "parent_id": "t1_f31ktew",
            "score": 6,
            "created_utc": 1570578717.0,
            "replies": [
                {
                    "body": "Again, I am 100% pro taking precautions. \n\nI presume any partners know ahead of time you're trans and accept you for being you. At least I hope so.",
                    "author": "marker3000",
                    "id": "f31m6qq",
                    "parent_id": "t1_f31lvs7",
                    "score": 2,
                    "created_utc": 1570578945.0,
                    "replies": [
                        {
                            "body": "I have it on my profile. I’ve been baited on dates before by people with hateful intentions, though. Either not showing and then mocking me over messages for being so “gullible”, or actually showing up in person to tell me how disgusting they think I am. It’s wild the lengths people will go to to be awful.",
                            "author": "GTSGF",
                            "id": "f31ofm0",
                            "parent_id": "t1_f31m6qq",
                            "score": 3,
                            "created_utc": 1570580595.0,
                            "replies": [
                                {
                                    "body": "Well f---- the haters. You be you. No apologies needed ever.",
                                    "author": "marker3000",
                                    "id": "f31pvwv",
                                    "parent_id": "t1_f31ofm0",
                                    "score": 2,
                                    "created_utc": 1570581655.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "“I’ve had a lovely evening, thank you so much for dinner! Would you be interested in turning this into a regular thing with an arrangement?”",
            "author": "GTSGF",
            "id": "f32nwcv",
            "parent_id": "t1_f32bbje",
            "score": 3,
            "created_utc": 1570619757.0,
            "replies": []
        },
        {
            "body": "Sorry, I’m heavily involved in my local BDSM community, and we use vanilla differently than folks seem to use it on this forum. By “tragically vanilla”, I meant that I was disappointed to find that he doesn’t really have any kinks. It’s just pretty boring for me when I’m so used to unusual and intense forms of intimacy.",
            "author": "GTSGF",
            "id": "f5o78a2",
            "parent_id": "t1_f5o5xrm",
            "score": 1,
            "created_utc": 1572311505.0,
            "replies": [
                {
                    "body": "So things like eating ass, 69, licking toes, various positions and what not. Would this be considered vanilla? \n\nAsking for a friend.",
                    "author": "Ultra888",
                    "id": "f5o7ob9",
                    "parent_id": "t1_f5o78a2",
                    "score": 1,
                    "created_utc": 1572311775.0,
                    "replies": [
                        {
                            "body": "It’s better than missionary and BJs, but it’s still pretty standard fare in my experience. The toes are at least seemingly related to a foot fetish, so you’ve got that going for you. But I couldn’t even get him to give my ass a smack while I was lying seductively over his lap with my ass in the air after swallowing his load. And that’s probably the least kinky thing I’m into.",
                            "author": "GTSGF",
                            "id": "f5o9rxz",
                            "parent_id": "t1_f5o7ob9",
                            "score": 1,
                            "created_utc": 1572313082.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Unfortunately, this guy ghosted me 😓",
            "author": "GTSGF",
            "id": "f6pqgg0",
            "parent_id": "t1_f6pavc4",
            "score": 0,
            "created_utc": 1573062058.0,
            "replies": [
                {
                    "body": "Oh no! \nUgh that's so disappointing, I'm sorry to hear that 😔",
                    "author": "Dressedtokillxxx",
                    "id": "f6q3l8p",
                    "parent_id": "t1_f6pqgg0",
                    "score": 1,
                    "created_utc": 1573070262.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "you probably deserve to be picky! You sound like a great catch. :)",
            "author": null,
            "id": "f30r2tj",
            "parent_id": "t1_f303kp5",
            "score": 6,
            "created_utc": 1570560548.0,
            "replies": []
        },
        {
            "body": "The other side of that is your bringing it up was probably  a wonderful signal to him that you were ready to proceed.  Thus ,  erasing any doubts which he might have been harboring .  Think of it as opening the floodgate rather than breaking the flow.",
            "author": "pinotandsugar",
            "id": "f311m9z",
            "parent_id": "t1_f303ulx",
            "score": 3,
            "created_utc": 1570566377.0,
            "replies": [
                {
                    "body": "That’s pretty good insight. We definitely let down some barriers after that discussion. Overall a good thing for sure.",
                    "author": "GTSGF",
                    "id": "f31itas",
                    "parent_id": "t1_f311m9z",
                    "score": 2,
                    "created_utc": 1570576490.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "It is really awkward sometimes to break the genuine flow of connection. But everyone has their intentions and it should always be fine to voice them considering the platform you met on. \n\nI like to get it out the way as early as possible, the never really intend to mention it again. \n\nYou have both found an arrangement that makes you both happy and that's all that matters.",
            "author": null,
            "id": "f3044lc",
            "parent_id": "t1_f303ulx",
            "score": 2,
            "created_utc": 1570545974.0,
            "replies": [
                {
                    "body": "My thoughts exactly. He’s proven twice so far that he doesn’t need any reminding, so I plan on never bringing it up again and just enjoying and nurturing what we have.",
                    "author": "GTSGF",
                    "id": "f3057dd",
                    "parent_id": "t1_f3044lc",
                    "score": 1,
                    "created_utc": 1570546673.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Again, I am 100% pro taking precautions. \n\nI presume any partners know ahead of time you're trans and accept you for being you. At least I hope so.",
            "author": "marker3000",
            "id": "f31m6qq",
            "parent_id": "t1_f31lvs7",
            "score": 2,
            "created_utc": 1570578945.0,
            "replies": [
                {
                    "body": "I have it on my profile. I’ve been baited on dates before by people with hateful intentions, though. Either not showing and then mocking me over messages for being so “gullible”, or actually showing up in person to tell me how disgusting they think I am. It’s wild the lengths people will go to to be awful.",
                    "author": "GTSGF",
                    "id": "f31ofm0",
                    "parent_id": "t1_f31m6qq",
                    "score": 3,
                    "created_utc": 1570580595.0,
                    "replies": [
                        {
                            "body": "Well f---- the haters. You be you. No apologies needed ever.",
                            "author": "marker3000",
                            "id": "f31pvwv",
                            "parent_id": "t1_f31ofm0",
                            "score": 2,
                            "created_utc": 1570581655.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "So things like eating ass, 69, licking toes, various positions and what not. Would this be considered vanilla? \n\nAsking for a friend.",
            "author": "Ultra888",
            "id": "f5o7ob9",
            "parent_id": "t1_f5o78a2",
            "score": 1,
            "created_utc": 1572311775.0,
            "replies": [
                {
                    "body": "It’s better than missionary and BJs, but it’s still pretty standard fare in my experience. The toes are at least seemingly related to a foot fetish, so you’ve got that going for you. But I couldn’t even get him to give my ass a smack while I was lying seductively over his lap with my ass in the air after swallowing his load. And that’s probably the least kinky thing I’m into.",
                    "author": "GTSGF",
                    "id": "f5o9rxz",
                    "parent_id": "t1_f5o7ob9",
                    "score": 1,
                    "created_utc": 1572313082.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Oh no! \nUgh that's so disappointing, I'm sorry to hear that 😔",
            "author": "Dressedtokillxxx",
            "id": "f6q3l8p",
            "parent_id": "t1_f6pqgg0",
            "score": 1,
            "created_utc": 1573070262.0,
            "replies": []
        },
        {
            "body": "That’s pretty good insight. We definitely let down some barriers after that discussion. Overall a good thing for sure.",
            "author": "GTSGF",
            "id": "f31itas",
            "parent_id": "t1_f311m9z",
            "score": 2,
            "created_utc": 1570576490.0,
            "replies": []
        },
        {
            "body": "My thoughts exactly. He’s proven twice so far that he doesn’t need any reminding, so I plan on never bringing it up again and just enjoying and nurturing what we have.",
            "author": "GTSGF",
            "id": "f3057dd",
            "parent_id": "t1_f3044lc",
            "score": 1,
            "created_utc": 1570546673.0,
            "replies": []
        },
        {
            "body": "I have it on my profile. I’ve been baited on dates before by people with hateful intentions, though. Either not showing and then mocking me over messages for being so “gullible”, or actually showing up in person to tell me how disgusting they think I am. It’s wild the lengths people will go to to be awful.",
            "author": "GTSGF",
            "id": "f31ofm0",
            "parent_id": "t1_f31m6qq",
            "score": 3,
            "created_utc": 1570580595.0,
            "replies": [
                {
                    "body": "Well f---- the haters. You be you. No apologies needed ever.",
                    "author": "marker3000",
                    "id": "f31pvwv",
                    "parent_id": "t1_f31ofm0",
                    "score": 2,
                    "created_utc": 1570581655.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "It’s better than missionary and BJs, but it’s still pretty standard fare in my experience. The toes are at least seemingly related to a foot fetish, so you’ve got that going for you. But I couldn’t even get him to give my ass a smack while I was lying seductively over his lap with my ass in the air after swallowing his load. And that’s probably the least kinky thing I’m into.",
            "author": "GTSGF",
            "id": "f5o9rxz",
            "parent_id": "t1_f5o7ob9",
            "score": 1,
            "created_utc": 1572313082.0,
            "replies": []
        },
        {
            "body": "Well f---- the haters. You be you. No apologies needed ever.",
            "author": "marker3000",
            "id": "f31pvwv",
            "parent_id": "t1_f31ofm0",
            "score": 2,
            "created_utc": 1570581655.0,
            "replies": []
        }
    ]
}