{
    "title": "For all the new people: what SDs say and what they actually mean.",
    "post_id": "j1cj0g",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/j1cj0g/for_all_the_new_people_what_sds_say_and_what_they/",
    "author": "KnocDown",
    "body": "“I don’t want it to feel transactional” = I don’t want to pay for sex and will just buy you cheap gifts \n\n“I want to send you money via wire transfer” = I’m a scammer who wants to steal your account info \n\n“Maybe we should slow things down” = I’ve already slept with you and am moving on\n\n“I don’t like girls who cause drama” = I’m going to cause you a ton of problems \n\n“I know it’s just the M&G, but Let’s go back to my place and chill” = I’m just trying to hook up with you\n\n“Your friend is cute” = I want to sleep with your friend \n\n“Do I need to take you shopping for nicer clothes?” = you dress like a hooker and need appropriate clothes \n\n“I really don’t like that type of restaurant” = it’s too expensive and I’m cheap \n\n“Maybe we should go somewhere less public” = I’m married and you are my side piece \n\nPlease feel free to add, just trying to help",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/j1cj0g/for_all_the_new_people_what_sds_say_and_what_they/",
    "score": 791,
    "upvote_ratio": 0.96,
    "created_utc": 1601301670.0,
    "num_comments": 162,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "Add \"Can you host?\" = I'm too cheap to pay for a hotel and pay you. Slash I'm married and that can't come up on my CC bill. \n\n\"I want you to take my money\" - I get off on the fantasy of findom. You won't actually get any money or shopping trips. There will only be back and forth texting.",
            "author": "secretactorian",
            "id": "g6z9hsb",
            "parent_id": "t3_j1cj0g",
            "score": 154,
            "created_utc": 1601317869.0,
            "replies": [
                {
                    "body": "Speaking as an SD who has no issues paying for a room, sometimes \"can you host\" has a different meaning.  Personally, I get off on being invited back to her place.  It makes it feel more like you seduced her and she's taking you to her place for a good time than what it actually is.",
                    "author": "okiedokie304",
                    "id": "g9d51xu",
                    "parent_id": "t1_g6z9hsb",
                    "score": 21,
                    "created_utc": 1603139421.0,
                    "replies": []
                },
                {
                    "body": ">Can you host?\" = I'm too cheap to pay for a hotel and pay you. Slash I'm married and that can't come up on my CC bill.  \n>  \n>\"I want you to take my money\" - I get off on the fantasy of findom. You won't actually get any money or shopping trips. There will only be back and forth texting.\n\nHaha yes!",
                    "author": null,
                    "id": "g736ok1",
                    "parent_id": "t1_g6z9hsb",
                    "score": 11,
                    "created_utc": 1601403221.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "My favorite rebuttal I’ve given to the SD saying “I don’t want something transactional” and “I want it to be more like a relationship”\n\nMe: “I’m so glad to hear that, I also feel it doesn’t make sense to limit our relationship when our connection is genuine. My last boyfriend gave me a key to his place and added me as a user to is AMEX so I didn’t feel restricted to a pre-determined allowance each month.” \n\nSometimes guys forget that the girlfriend/wife experience is FAR more expensive than an arrangement, so we have to remind them. 😊",
            "author": "LVSugarBebe",
            "id": "g6zi87z",
            "parent_id": "t3_j1cj0g",
            "score": 297,
            "created_utc": 1601321604.0,
            "replies": [
                {
                    "body": "Well played.  I like, respect and enjoy the boundaries in a sugar relationship and ironically because of that we often end up with deeper ties and connections.  It’s like,  because I don’t particularly want to meddle in their life for the first 4 months or so they are suddenly wanting my opinion on how to handle situations which then leads to more involvement.  I really wish to keep boundaries but I also hate seeing my girls struggle with things I can easily fix.  I’m a guy,  I’m wired to fix problems.  \n\nExample... I have nice size small business and I was looking at my cell phone bill.   I realized I had 7 current and past SB’s on my Verizon bill.   I have a few car leases for current SB’s (cheaper VW’s) .",
                    "author": "LotBuilder",
                    "id": "g6zr6rg",
                    "parent_id": "t1_g6zi87z",
                    "score": 22,
                    "created_utc": 1601325738.0,
                    "replies": [
                        {
                            "body": "I always wondered about that. How involved should one get without it getting to personal...or something like that.",
                            "author": "eshtahnohs",
                            "id": "g70l7w9",
                            "parent_id": "t1_g6zr6rg",
                            "score": 9,
                            "created_utc": 1601342681.0,
                            "replies": [
                                {
                                    "body": "I just follow the girls lead within what we want.  I’m adaptable.  I have had SB’s that stayed very private and secretive for years and I had another one where I was at her family BBQ about a month in.  They all are different.",
                                    "author": "LotBuilder",
                                    "id": "g70n53n",
                                    "parent_id": "t1_g70l7w9",
                                    "score": 15,
                                    "created_utc": 1601343697.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "g6zlwuy",
                    "parent_id": "t1_g6zi87z",
                    "score": 18,
                    "created_utc": 1601323168.0,
                    "replies": [
                        {
                            "body": "My other favorite rebuttal to “I don’t have a problem getting sex without paying for it”\n\nMe: “And I don’t have a problem finding a rich, attractive, and attentive young man to date/marry who will share all of his life with me.”",
                            "author": "LVSugarBebe",
                            "id": "g6znjur",
                            "parent_id": "t1_g6zlwuy",
                            "score": 51,
                            "created_utc": 1601323913.0,
                            "replies": [
                                {
                                    "body": "[removed]",
                                    "author": null,
                                    "id": "g70jz0b",
                                    "parent_id": "t1_g6znjur",
                                    "score": 11,
                                    "created_utc": 1601342001.0,
                                    "replies": [
                                        {
                                            "body": "Call me an idiot but maybe I just have a thing for older men with education, life experience, and emotional security and do not need marriage to feel a genuine and long-lasting connection with another person.",
                                            "author": "LVSugarBebe",
                                            "id": "g78ogfr",
                                            "parent_id": "t1_g70jz0b",
                                            "score": 3,
                                            "created_utc": 1601515238.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": ">“I don’t have a problem getting sex without paying for it”\n\nThey say this when they are on an arrangement website or dating website or in-person meeting? If an arrangement dating website that literally makes zero sense for him to say that!",
                                    "author": null,
                                    "id": "g736wv7",
                                    "parent_id": "t1_g6znjur",
                                    "score": 3,
                                    "created_utc": 1601403312.0,
                                    "replies": [
                                        {
                                            "body": "A guy will say this on a seeking site, I've seen it SEVERAL times in their profiles as well. Their justification is 'I'm too busy for a relationship so I'm on here.' More often than not you'll see it in profiles of men under 40. Sometimes they're attractive, sometimes they're not.  \n\n\nThey lead with 'I don't have a problem getting sex without paying for it' to either set an expectation anchor for the SB that she's not getting an allowance or to make them feel better about being on the site. Regardless, the conversation generally leads to the fact that they want to put in the minimum effort (paying for coffee/dinner) in order to get an on-demand booty-call girlfriend without any of the commitment or emotional expectation of an ongoing relationship.  \n\n\nThese guys may genuinely not have problems meeting women, but they want to get to sex as quickly as possible or lower the risk of multiple encounters with random women. My observation is that the really attractive and successful men have some other problem with their personality or lifestyle that prevents them from finding women who can fulfill this need in their vanilla dating life.",
                                            "author": "LVSugarBebe",
                                            "id": "g777x4u",
                                            "parent_id": "t1_g736wv7",
                                            "score": 1,
                                            "created_utc": 1601490348.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "I am having an experience that I think is deja vu? I'm not sure but its  like an out of body experience seeing your username and a comment I would say!",
                                    "author": "MJline",
                                    "id": "g70wd4s",
                                    "parent_id": "t1_g6znjur",
                                    "score": 2,
                                    "created_utc": 1601348897.0,
                                    "replies": []
                                },
                                {
                                    "body": ">Me: “And I don’t have a problem finding a rich, attractive, and attentive young man to date/marry who will share all of his life with me.”\n\nGood for you, but plenty of SBs do struggle with this. Rich men mostly marry rich women, specially because of the many assets that have to be shared.\n\nSo many women mistake having sex with a rich attractive guy for \"he will share all of his life with me\".\n\nThere just aren't enough rich men (not even countering attractive) for all the women that want to date one.",
                                    "author": "AdAlternative6041",
                                    "id": "g6zwvf9",
                                    "parent_id": "t1_g6znjur",
                                    "score": 6,
                                    "created_utc": 1601328658.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "True.\n\nBut that logic is also a double edged sword.",
                            "author": null,
                            "id": "g6zp3d1",
                            "parent_id": "t1_g6zlwuy",
                            "score": 7,
                            "created_utc": 1601324682.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": ">Sometimes guys forget that the girlfriend/wife experience is FAR more expensive than an arrangement, so we have to remind them\n\nTotally agree. Having a wife is so expensive!",
                    "author": null,
                    "id": "g70ujyg",
                    "parent_id": "t1_g6zi87z",
                    "score": 15,
                    "created_utc": 1601347862.0,
                    "replies": [
                        {
                            "body": "That's only if you're a weak man with low standards",
                            "author": "Status_Let_3850",
                            "id": "hrerxnx",
                            "parent_id": "t1_g70ujyg",
                            "score": 1,
                            "created_utc": 1641419701.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Lol. That’s the best! So true too! I never got the I don’t want to be transactional. For me I want the terms of the transaction beforehand you know? Like any deal. It’s nice to get it out of the way too so we both are at ease. That’s just me though.",
                    "author": "highjinx411",
                    "id": "g70h0mc",
                    "parent_id": "t1_g6zi87z",
                    "score": 11,
                    "created_utc": 1601340376.0,
                    "replies": []
                },
                {
                    "body": "The guy I'm dating right now (not an SD) has been way more generous than any SD I've been with. Seems like I've been getting a lot of Splenda.",
                    "author": "eshtahnohs",
                    "id": "g70kxbm",
                    "parent_id": "t1_g6zi87z",
                    "score": 11,
                    "created_utc": 1601342519.0,
                    "replies": []
                },
                {
                    "body": "This is gold",
                    "author": "luxlife0804",
                    "id": "glmlhyd",
                    "parent_id": "t1_g6zi87z",
                    "score": 3,
                    "created_utc": 1612202589.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "“How much would it cost to see you tonight” - I’m too prideful to get an escort, but I want to treat you like a hooker",
            "author": "AlinaAllure",
            "id": "g6zbash",
            "parent_id": "t3_j1cj0g",
            "score": 68,
            "created_utc": 1601318684.0,
            "replies": []
        },
        {
            "body": "\"I'm going to shower you with affection and gifts\" - I'm not going to, I just want to get in your pants.",
            "author": "macaroonqueen",
            "id": "g6yfjfh",
            "parent_id": "t3_j1cj0g",
            "score": 118,
            "created_utc": 1601304621.0,
            "replies": []
        },
        {
            "body": "“I’ve been divorced for 18months” = I got married 18 months ago.",
            "author": "Mlle_Courtesan",
            "id": "g6zpn65",
            "parent_id": "t3_j1cj0g",
            "score": 31,
            "created_utc": 1601324959.0,
            "replies": []
        },
        {
            "body": "I wouldn’t mind my SD taking me shopping! I’ll happily be his work of art. Decorating me in the image of his dreams.\n\nSome more quotes to add to the list are the ones that come from many young cubs that want to be SD, but do not feel they should pay:\n\n“Being with me is worth the experience.”\n\n“I don’t need to pay like this old men with little dicks.” (Oh you poor boy, you have no idea🤦🏼‍♀️)\n** Side note, I’d rather be with an impotent man who shows me his heart and shares an adventure with me. Finding sexual pleasure is not hard for me and I can certainly please myself if needed. But to make some statements like above, especially on SA and/or knowing I’m a SB is insulting to me and the men I have shared time with. Such statements are likely to leave that person lonely in their later years.\n\n“I want to be good friends, I don’t want to be like the other men in your life, what we have is special.” or “I will take care of your physical and emotional needs.” Translation: Can I get the friends and family discount or how about Free.\n\nOne more thing... It’s not really a double meaning, but a reaction to another statement.\n\n“I don’t usually pay, but I’ll help out with a bill or emergency.”. First off, I don’t think any woman should rely on SB or sex work in general to pay for a bill or housing. That’s a dangerous slope. One it puts the woman on an unlovely playing field. It may make her do things she’s not comfortable with just to pay the rent or utilities. Second, why does a girl have to be in need? Can’t she just be lovely to spend time and bring added value to your life? I really wish sex work was legal throughout America. There are women who do this out of sheer pleasure and to enhance their life. Not be dependent on it.\n\nWhew, that was a mouthful.\n\nAnd just to add, these lines are not every man... but 90% of the time if said, they mean what the SBs are writing. Furthermore, not every man would say such things in the first place. Thank you to the daddies who are honest and open!",
            "author": "Copperdelight",
            "id": "g6z1ja7",
            "parent_id": "t3_j1cj0g",
            "score": 58,
            "created_utc": 1601314457.0,
            "replies": []
        },
        {
            "body": "\"I've been thinking about you a lot and am starting to get genuine feelings for you!\"\n\nMeans: \"I've already lowered our ppm once in the year I've been seeing you and now I'm too cheap to keep paying it so let me fein feelings for you even though I haven't seen nor talked to you in months before the pandemic out of my own volition.\"\n\nI'm not bitter about it at all.",
            "author": "EvaExquisite",
            "id": "g6z8z77",
            "parent_id": "t3_j1cj0g",
            "score": 28,
            "created_utc": 1601317641.0,
            "replies": []
        },
        {
            "body": "\"I can't host bc of xyz (from an SD)\" without any talk of getting a hotel... Really means... \"I am too cheap to get a hotel AND pay you for sex.. So, let's just \"have fun and fuck in my car\"... (Get that shit outta here!)\n\n\"My last SB went CRAZY and was stalking me..\" Really means: \"the last girl I had a relationship with.. Asked for the money I owed her.. And I didn't have it.. So, she got pissed... And now is \"crazy and a stalker\" trying to get the money I owe her.\"🙄🙄 (Tell me more, Kevin...)\n\n\"I can pick you up\" Really means: \"DON'T BE STUPID.. TAKE AN UBER... CAB.. BIKE SHARE... Don't ever let a POT know where you live.. I don't care how \"trustworthy\" they seem beforehand..",
            "author": "NattyLiteSaber",
            "id": "g6yfkb9",
            "parent_id": "t3_j1cj0g",
            "score": 150,
            "created_utc": 1601304634.0,
            "replies": [
                {
                    "body": "I really want to hear from the SDs as to why guys keep offering to pick me up (instead of, for example, offering to pay the cab fare when I arrive).  It happens all the time, and usually from guys who are otherwise generally really chivalrous and nice.",
                    "author": "JustKittenxo",
                    "id": "g6zk75j",
                    "parent_id": "t1_g6yfkb9",
                    "score": 24,
                    "created_utc": 1601322441.0,
                    "replies": [
                        {
                            "body": "Cause they wanna take you home later and bang you on your couch without having to get a hotel... I dunno tho otherwise.  I just don't like new SDs knowing where I live bc I have had issues with stalkers in the past and I enjoy having that privacy.. Any guy I meet on SA that wants to come to my house and hang out strikes me as cheap.. We can hang out in a nice bar or hotel room.. Not my house. No way.",
                            "author": "NattyLiteSaber",
                            "id": "g6zkt4w",
                            "parent_id": "t1_g6zk75j",
                            "score": 21,
                            "created_utc": 1601322703.0,
                            "replies": [
                                {
                                    "body": "I don't like new SDs knowing where I live.  I let my one SD know where I lived after 4 months of consistent dating because he was so adamant on picking me up and dropping me off so I could drink with him (yeah, I know, I know).  He's always been super respectful about not inviting himself in (I made it clear it's never going to happen), and I don't think he'd stalk me.  But I still wish I'd never given in to the pressure.  He has absolutely zero concept of discretion.  When he shows up he tries to kiss me because \"I've missed you so much, I just can't wait for a kiss\"... right in front of my 80+ year old neighbour's living room window.  He's generally a great SD, reliable, generous, respectful, and he treats me really well. He just has absolutely no class or concept of the idea that maybe PDA isn't appropriate in the extremely conservative neighbourhood I live in, especially not in front of the nosiest neighbour on my street (she's retired and as far as I can tell has no friends or hobbies besides spying on the entire street, lol).",
                                    "author": "JustKittenxo",
                                    "id": "g6zlwa4",
                                    "parent_id": "t1_g6zkt4w",
                                    "score": 16,
                                    "created_utc": 1601323161.0,
                                    "replies": [
                                        {
                                            "body": "Girl... I live in a whole neighborhood of Bessie's like that! They would lose their shit...😂 I feel like they are judging me just because I am leaving after dark to go out like some wild woman..😂",
                                            "author": "NattyLiteSaber",
                                            "id": "g6zrwt2",
                                            "parent_id": "t1_g6zlwa4",
                                            "score": 15,
                                            "created_utc": 1601326095.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Scammers will often ask for gas or Uber money up front.  Then you get into the standoff of picking them up or sending an Uber from my account... but for their privacy they just want you to Venmo $50... blah blah blah.  It’s a pain.",
                            "author": "LotBuilder",
                            "id": "g6zld71",
                            "parent_id": "t1_g6zk75j",
                            "score": 15,
                            "created_utc": 1601322935.0,
                            "replies": [
                                {
                                    "body": "I can understand being worried about the scammers and not wanting to send money upfront.  I do wish they'd just offer to give a small gift when I arrive to cover travel expenses (or offer to meet me when I park and pay for it).  [By far my best M&G date was with a person who texted me while I was on my way there letting me know to just tell valet parking my name when I arrived and he'd already handled the cost... just such a sweet and thoughtful way to start off our first meeting and he was even sweeter and more thoughtful during the date.]",
                                    "author": "JustKittenxo",
                                    "id": "g6znpkv",
                                    "parent_id": "t1_g6zld71",
                                    "score": 28,
                                    "created_utc": 1601323993.0,
                                    "replies": [
                                        {
                                            "body": "I always tell them I will give them money when we meet but I don’t send cash to strangers.  Did it twice and both ghosted and blocked.  It’s a shame because I know there are honest girls out there that just don’t want to risk getting stood up and spending money they don’t have.",
                                            "author": "LotBuilder",
                                            "id": "g6zoibs",
                                            "parent_id": "t1_g6znpkv",
                                            "score": 11,
                                            "created_utc": 1601324394.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Perhaps it is just an old school thing? I think they forget that times are different nowadays and especially women need to have their guard up. In a perfect world, I would love to be offered a ride and feel safe accepting it. But better safe than sorry, right?",
                            "author": "w4termelonsug4r",
                            "id": "g700y7y",
                            "parent_id": "t1_g6zk75j",
                            "score": 5,
                            "created_utc": 1601330909.0,
                            "replies": []
                        },
                        {
                            "body": "Cheap",
                            "author": null,
                            "id": "g6zkl2f",
                            "parent_id": "t1_g6zk75j",
                            "score": 5,
                            "created_utc": 1601322604.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Yesssss this this this!",
                    "author": "prettylilprostitute",
                    "id": "g6yk25x",
                    "parent_id": "t1_g6yfkb9",
                    "score": 7,
                    "created_utc": 1601306821.0,
                    "replies": [
                        {
                            "body": "Lol... I think the SBs have far more experience with these bullshit lines and what they REALLY mean..🙄",
                            "author": "NattyLiteSaber",
                            "id": "g6ykpam",
                            "parent_id": "t1_g6yk25x",
                            "score": 5,
                            "created_utc": 1601307108.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": ">My last SB went CRAZY and was stalking me..\" Really means: \"the last girl I had a relationship with.. Asked for the money I owed her..\n\nThat's such an stupid assumption to make. You are basically saying no women can act crazy in the bowl, it must be all cheap SDs.\n\nAt least in my experience, the bowl has way more crazy than vanilla dating.",
                    "author": "AdAlternative6041",
                    "id": "g6zvnm8",
                    "parent_id": "t1_g6yfkb9",
                    "score": 1,
                    "created_utc": 1601328016.0,
                    "replies": [
                        {
                            "body": "I mean... Yeah there is plenty of crazy on both sides...but, most of the times that \"crazy\" gets triggered by one person not keeping up their end of things... I am sure the crazy, jealous side chick exists.. But, so does the 3-date-cheapskate-SD...",
                            "author": "NattyLiteSaber",
                            "id": "g6zvzaa",
                            "parent_id": "t1_g6zvnm8",
                            "score": 9,
                            "created_utc": 1601328186.0,
                            "replies": [
                                {
                                    "body": "That's not at all what you implied in your comment. You basically said that men can't be stalked, it must all be cheap SDs than ran off without paying.",
                                    "author": "AdAlternative6041",
                                    "id": "g704esq",
                                    "parent_id": "t1_g6zvzaa",
                                    "score": -1,
                                    "created_utc": 1601332889.0,
                                    "replies": [
                                        {
                                            "body": "I didn't imply anything.. I stated what I stated... Actually I didn't say a thing about guys being stalked... At all... Not one reference..\n\nI am talking about what an SD says to new prospective women when asked about their previous relationships... So... I don't really know why you're talking about men being stalked.. Pretty sure men get stalked, too.. 🤷 \n\n\nBUT, in, MY experience... That girl was not crazy OR a stalker... But, \"I was cheap and she got pissed when I didn't pay her what we discussed then blew my phone up.. So, I blocked her for trying to get money that was owed to her\"... That doesn't sound as good to a new girl to scam... So, they just call every girl they have been with in the past.. \"Crazy\" or \"A stalker\" bc they got ripped off by some douchebag....🙄",
                                            "author": "NattyLiteSaber",
                                            "id": "g70620g",
                                            "parent_id": "t1_g704esq",
                                            "score": 7,
                                            "created_utc": 1601333858.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "g6ym1a1",
            "parent_id": "t3_j1cj0g",
            "score": 83,
            "created_utc": 1601307685.0,
            "replies": [
                {
                    "body": "I’ve had that pulled on me once. Byebye salty!",
                    "author": null,
                    "id": "g6zjv96",
                    "parent_id": "t1_g6ym1a1",
                    "score": 10,
                    "created_utc": 1601322302.0,
                    "replies": [
                        {
                            "body": "Even single ones 😂😂",
                            "author": "PioneerExperience",
                            "id": "g70bord",
                            "parent_id": "t1_g6zjv96",
                            "score": 2,
                            "created_utc": 1601337274.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "“we can go on an overnight trip and i’ll buy you an outfit” = i’m going to book a 2 star hotel the next town over and take you shopping in forever 21",
            "author": "cocoabuttersugar",
            "id": "g70w2ff",
            "parent_id": "t3_j1cj0g",
            "score": 16,
            "created_utc": 1601348727.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "g6zu2k1",
            "parent_id": "t3_j1cj0g",
            "score": 18,
            "created_utc": 1601327184.0,
            "replies": [
                {
                    "body": "I don't understand the whole picture thing. \nSB has limited or obscured pics on her profile. I get it its for privacy.\n\n\nMessage back and forth, move to text. \nText exchange goes like this: \n\n\nSD: Hey can I see a pic or two since you know what I look like. \nSB: How much will you pay?\nSD: wouldn't an allowance be more help?\nSB: well I really need some cash for.....\nSD: bye\n\n\nEasiest way to weed a SB who will never meet.",
                    "author": "inafishbowl17",
                    "id": "g70ki87",
                    "parent_id": "t1_g6zu2k1",
                    "score": 5,
                    "created_utc": 1601342294.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "“I’m fixed so it’s cool if I cum in you.” = run",
            "author": "pygmalionsrose",
            "id": "g6zh6h5",
            "parent_id": "t3_j1cj0g",
            "score": 36,
            "created_utc": 1601321175.0,
            "replies": [
                {
                    "body": "This got very dark very fast o-o",
                    "author": "KnocDown",
                    "id": "g6zil27",
                    "parent_id": "t1_g6zh6h5",
                    "score": 9,
                    "created_utc": 1601321752.0,
                    "replies": [
                        {
                            "body": "Like the first five minutes of a Disney-Pixar film dark? Or Black Mirror dark?",
                            "author": "pygmalionsrose",
                            "id": "g6zqdqw",
                            "parent_id": "t1_g6zil27",
                            "score": 7,
                            "created_utc": 1601325331.0,
                            "replies": [
                                {
                                    "body": "Like end of season one of “the boys” dark, haven’t seen black mirror yet, now I’m curious",
                                    "author": "KnocDown",
                                    "id": "g6zqlbh",
                                    "parent_id": "t1_g6zqdqw",
                                    "score": 10,
                                    "created_utc": 1601325437.0,
                                    "replies": [
                                        {
                                            "body": "White Christmas is sooo good have you seen it yet?",
                                            "author": "jollifishe",
                                            "id": "i32i8bo",
                                            "parent_id": "t1_g6zqlbh",
                                            "score": 1,
                                            "created_utc": 1648870825.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Ah yep, had that happened before. He either was really fixed, or I'm super barren, but either way after him I never let that happen again. Too risky.",
                    "author": "sbgonebroke",
                    "id": "g72w7wi",
                    "parent_id": "t1_g6zh6h5",
                    "score": 2,
                    "created_utc": 1601398619.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "\"I love you.\" - Even though I don't even really know you, I am lonely and have a deep hole in my life that I want someone to fill, doesn't matter who as long as I can trap them by saying things they want to hear.",
            "author": "LoftDaddy",
            "id": "g6ykvzc",
            "parent_id": "t3_j1cj0g",
            "score": 43,
            "created_utc": 1601307193.0,
            "replies": [
                {
                    "body": "\"I love you\" =My dick loves your pussy",
                    "author": "GSSD",
                    "id": "g6yymrf",
                    "parent_id": "t1_g6ykvzc",
                    "score": 40,
                    "created_utc": 1601313171.0,
                    "replies": [
                        {
                            "body": "Ahh, is that why I only say it while in the throes?",
                            "author": null,
                            "id": "g70uxu8",
                            "parent_id": "t1_g6yymrf",
                            "score": 5,
                            "created_utc": 1601348079.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Oh, that's cold and dark.",
                    "author": null,
                    "id": "g70uvoq",
                    "parent_id": "t1_g6ykvzc",
                    "score": 6,
                    "created_utc": 1601348043.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Ahhh.. I thought of a good one...\n\n\nWhen your SD says: \"I love you and think you're the best thing that ever happened to me\"\n... \nWhat he really means: \"I really like fucking you, but this is getting too expensive.. So... Don't be a greedy bitch and have sex with me for free..\"🤷",
            "author": "NattyLiteSaber",
            "id": "g6z0idp",
            "parent_id": "t3_j1cj0g",
            "score": 14,
            "created_utc": 1601314012.0,
            "replies": []
        },
        {
            "body": "“Well, my last SB did [insert explicit or time consuming activity here]!” - my last SB left me because I was asking for too much",
            "author": "russianindianqueen",
            "id": "g6z7nvn",
            "parent_id": "t3_j1cj0g",
            "score": 11,
            "created_utc": 1601317075.0,
            "replies": []
        },
        {
            "body": "For me:\nI don’t want it to feel transactional = I’ll Venmo,cashapp,PayPal you every Friday (assuming we have met that week) to start and you can go on one of my companies payroll after things are established and going well.  Also means we meet at my house and only do hotels when traveling.   Handing cash to a girl I just banged at a hotel is the grimy transactional feeling I don’t want.",
            "author": "LotBuilder",
            "id": "g6zm7ct",
            "parent_id": "t3_j1cj0g",
            "score": 21,
            "created_utc": 1601323290.0,
            "replies": [
                {
                    "body": "Because you’re a nice guy who’s not a scumbag :)\n\nOthers use the line as “let’s have sex and I’ll pay a bill or buy you a purse later” \n\nI know it doesn’t apply to all but it’s painting a bad picture",
                    "author": "KnocDown",
                    "id": "g6zqbn5",
                    "parent_id": "t1_g6zm7ct",
                    "score": 13,
                    "created_utc": 1601325302.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Probably all useful guidelines for newbie SBs to judge POTs statements by in order to avoid scammers and predators, although from the mouth of a genuine SD some of these could be taken at face value.",
            "author": "roscoe7585",
            "id": "g6yn1xa",
            "parent_id": "t3_j1cj0g",
            "score": 6,
            "created_utc": 1601308121.0,
            "replies": []
        },
        {
            "body": "I always find things with some truth the absolute funniest. \n\nThis is hysterical.",
            "author": "BGDDDY1",
            "id": "g6ycgan",
            "parent_id": "t3_j1cj0g",
            "score": 16,
            "created_utc": 1601302919.0,
            "replies": []
        },
        {
            "body": "“Are you sure about that or is there just something you want that I can give to you” =  I’m a douchebag, I knew that I’d be paying for you, however, I feel like I should be getting you for free because I’m cheap.\n\n“I'm okay with being friends I can look elsewhere for a partner “ = I’m trying to push the limits and not respecting the boundaries you set and since I’m not getting my way, I’m going to threaten finding someone else. \n\n“Did you earn the money” = I want to treat you like a prostitute. \n\n “Is it a gift or is it a loan” = They’re too broke to pay you. \n\n“I’ll send you money later” = they don’t have the money and want the experience for free.",
            "author": "No-Ad6855",
            "id": "g70n9e7",
            "parent_id": "t3_j1cj0g",
            "score": 7,
            "created_utc": 1601343762.0,
            "replies": []
        },
        {
            "body": "“No vegans” = no vegans",
            "author": "LaGriffeDuLion",
            "id": "g6z60ss",
            "parent_id": "t3_j1cj0g",
            "score": 29,
            "created_utc": 1601316362.0,
            "replies": [
                {
                    "body": "Yes,  perfect",
                    "author": "LotBuilder",
                    "id": "g6zp8n9",
                    "parent_id": "t1_g6z60ss",
                    "score": 2,
                    "created_utc": 1601324756.0,
                    "replies": []
                },
                {
                    "body": "Lol",
                    "author": "windyorbits",
                    "id": "g6zky37",
                    "parent_id": "t1_g6z60ss",
                    "score": 1,
                    "created_utc": 1601322761.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "> “I really don’t like that type of restaurant” = it’s too expensive and I’m cheap\n\nAs someone who is a fairly picky eater, that's not necessarily true at all.\n\nI only call it out because the others feel like 100% spot on.  With one other update:\n\n> “Maybe we should slow things down” = I’ve already slept with you and am moving on\n\nAnd if you haven't slept with him yet - it means he has another POT he's more interested, and keeping you on the back burner.  OR trying to get free platonic dates out of it with no ability/able to provide, and is just lonlely.",
            "author": "SDstartingOut",
            "id": "g6yagdv",
            "parent_id": "t3_j1cj0g",
            "score": 37,
            "created_utc": 1601301778.0,
            "replies": [
                {
                    "body": "I forgot that one, thank you \n\nThat’s more “I’m really busy with work for the next few weeks” = I’ve found someone else but you’re my backup",
                    "author": "KnocDown",
                    "id": "g6yaxn0",
                    "parent_id": "t1_g6yagdv",
                    "score": 39,
                    "created_utc": 1601302055.0,
                    "replies": []
                }
            ]
        },
        {
            "body": " “I’ll spoil you with hugs and kisses” = CHEAPP AND A TIME WASTEF",
            "author": "citygurlll",
            "id": "g6zb01s",
            "parent_id": "t3_j1cj0g",
            "score": 12,
            "created_utc": 1601318547.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "g6ybfvr",
            "parent_id": "t3_j1cj0g",
            "score": 20,
            "created_utc": 1601302345.0,
            "replies": [
                {
                    "body": "Lots of men aren't as honest in these situations.. I make sure to ask every person I talk to if they are married, regardless of what their profile says... SO many put \"Single/Separated/Divorced\" and are actually married when you ask them.. I don't see why they hide it.. But, again, I just always ask so I know..",
                    "author": "throwaway517714",
                    "id": "g6ydfc3",
                    "parent_id": "t1_g6ybfvr",
                    "score": 21,
                    "created_utc": 1601303470.0,
                    "replies": []
                },
                {
                    "body": "Lots of men aren't as honest in these situations.. I make sure to ask every person I talk to if they are married, regardless of what their profile says... SO many put \"Single/Separated/Divorced\" and are actually married when you ask them.. I don't see why they hide it.. But, again, I just always ask so I know..",
                    "author": "throwaway517714",
                    "id": "g6ydhsb",
                    "parent_id": "t1_g6ybfvr",
                    "score": 7,
                    "created_utc": 1601303511.0,
                    "replies": []
                },
                {
                    "body": "Lots of men aren't as honest in these situations.. I make sure to ask every person I talk to if they are married, regardless of what their profile says... SO many put \"Single/Separated/Divorced\" and are actually married when you ask them.. I don't see why they hide it.. But, again, I just always ask so I know..",
                    "author": "throwaway517714",
                    "id": "g6ydiru",
                    "parent_id": "t1_g6ybfvr",
                    "score": 8,
                    "created_utc": 1601303523.0,
                    "replies": [
                        {
                            "body": "How many times are you going to type the same comment???",
                            "author": "genericMaker",
                            "id": "g6z3ko4",
                            "parent_id": "t1_g6ydiru",
                            "score": -8,
                            "created_utc": 1601315319.0,
                            "replies": [
                                {
                                    "body": "When you see a comment multiposted that's not the person who did it, it's reddit.",
                                    "author": "Sugarbeggar",
                                    "id": "g6z8lr5",
                                    "parent_id": "t1_g6z3ko4",
                                    "score": 15,
                                    "created_utc": 1601317484.0,
                                    "replies": []
                                },
                                {
                                    "body": "I dunno.. As many times as my phone told me \"Reddit had a problem adding your comment..\" \n\nWhy does it bother you so greatly? Obviously I didn't know it multi-posted.. The fuck with people sometimes..🙄😳",
                                    "author": "throwaway517714",
                                    "id": "g6z4e3c",
                                    "parent_id": "t1_g6z3ko4",
                                    "score": 10,
                                    "created_utc": 1601315662.0,
                                    "replies": [
                                        {
                                            "body": "A poor craftsman blames his tools.",
                                            "author": "genericMaker",
                                            "id": "g72gate",
                                            "parent_id": "t1_g6z4e3c",
                                            "score": 1,
                                            "created_utc": 1601392425.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": ">  First, am I alone, I don’t mind if you want to dress like a slut/hooker at all. In fact, please do.\n\nNot if we are going out to an upscale restaurant.",
                    "author": "SDstartingOut",
                    "id": "g6yhkyt",
                    "parent_id": "t1_g6ybfvr",
                    "score": 13,
                    "created_utc": 1601305653.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "g6yjuxr",
                            "parent_id": "t1_g6yhkyt",
                            "score": 8,
                            "created_utc": 1601306734.0,
                            "replies": [
                                {
                                    "body": "i’ll take the regular chicken THANK YOU",
                                    "author": null,
                                    "id": "g6youej",
                                    "parent_id": "t1_g6yjuxr",
                                    "score": 8,
                                    "created_utc": 1601308906.0,
                                    "replies": [
                                        {
                                            "body": "Ah, yeah, you wouldn't be my SB for long like that.",
                                            "author": "Sugarbeggar",
                                            "id": "g6z8pjb",
                                            "parent_id": "t1_g6youej",
                                            "score": 0,
                                            "created_utc": 1601317529.0,
                                            "replies": [
                                                {
                                                    "body": "it was a joke, have a sense of humor.",
                                                    "author": null,
                                                    "id": "g7024td",
                                                    "parent_id": "t1_g6z8pjb",
                                                    "score": 2,
                                                    "created_utc": 1601331577.0,
                                                    "replies": [
                                                        {
                                                            "body": "Some things you just don't joke about...",
                                                            "author": "Sugarbeggar",
                                                            "id": "g703wgj",
                                                            "parent_id": "t1_g7024td",
                                                            "score": 0,
                                                            "created_utc": 1601332588.0,
                                                            "replies": [
                                                                {
                                                                    "body": "summer down a little. i don’t like spicy food, it was nothing more than a harmless joke. sorry to have offended you",
                                                                    "author": null,
                                                                    "id": "g71i50k",
                                                                    "parent_id": "t1_g703wgj",
                                                                    "score": 2,
                                                                    "created_utc": 1601367588.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "he was being sarcastic i think",
                                                                            "author": "sbgonebroke",
                                                                            "id": "g72x1pb",
                                                                            "parent_id": "t1_g71i50k",
                                                                            "score": 1,
                                                                            "created_utc": 1601398952.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "Haha, the Baconator strikes again.",
                                    "author": "DFWCouple4SB",
                                    "id": "g6yls3h",
                                    "parent_id": "t1_g6yjuxr",
                                    "score": 3,
                                    "created_utc": 1601307580.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "I have never had any one complain about how I am dressed.. But have had more men \"request things they'd like me to wear\"... I try not to be TOO slutty-dressed for the M&G.. B.C. it can be a little \"desperate looking\"... Different strokes for different folks..🤷",
                    "author": "NattyLiteSaber",
                    "id": "g6z1vcr",
                    "parent_id": "t1_g6ybfvr",
                    "score": 5,
                    "created_utc": 1601314594.0,
                    "replies": [
                        {
                            "body": "I once had a guy keep saying he wanted me to dress \"classy and professional like a coworker so that the age difference doesn't turn heads\", and then upon me showing him some of my outfits, complained that each one was \"not a short enough skirt, got any mini skirts?\" or \"that doesn't show enough cleavage for me. got any more tight clothes?\"\n\nTemporary hit to my self esteem after buying so many more \"classy clothes\", but clearly the man wasn't aware that \"I don't want anyone to assume you're a sugar baby or think something sexual is going on, so dress like an intern, or a colleague\" and \"I want you to show up to dates wearing above thigh skirts/cleavage showing skin tight clothing\" are... two dramatically different statements.",
                            "author": "sbgonebroke",
                            "id": "g72wvvc",
                            "parent_id": "t1_g6z1vcr",
                            "score": 1,
                            "created_utc": 1601398887.0,
                            "replies": [
                                {
                                    "body": "Lol.. Yeah... Men and their porn ideas...🙄🙄🙄 \n\nSounds good. But doesn't work in reality...\n\nI'd be like.. So... Should I be professional or a slutty professional? The skirt hikes up the same no matter how short it is..🤷",
                                    "author": "NattyLiteSaber",
                                    "id": "g72yqy7",
                                    "parent_id": "t1_g72wvvc",
                                    "score": 1,
                                    "created_utc": 1601399672.0,
                                    "replies": []
                                },
                                {
                                    "body": "I just bring a change of clothes and once we get to a hotel room.. I can change... Lol... I've had one SD send me a list of all the outfits he'd like to see me in.. So.. I just pack a bag.. Aside from dinner and drinks we are usually in a hotel room anyways.",
                                    "author": "NattyLiteSaber",
                                    "id": "g72z6qp",
                                    "parent_id": "t1_g72wvvc",
                                    "score": 1,
                                    "created_utc": 1601399876.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Yes being honest about the married thing is the way to go.",
                    "author": "highjinx411",
                    "id": "g70hgmo",
                    "parent_id": "t1_g6ybfvr",
                    "score": 3,
                    "created_utc": 1601340635.0,
                    "replies": []
                }
            ]
        },
        {
            "body": ">“Maybe we should go somewhere less public” = I’m married and you are my side piece\n\nQuestion about that one. Is that generally an issue? I've been out of the SD world for a few years (starting to think about starting back up once COVID isn't a worry any more) I had three SBs at various points, one knew I was married, one didn't ask and a third must have known but she was out of town and only saw her on business trips and it never came up.\n\nBut is that generally something girls don't like? Something I should be up front about if I do try starting up again?",
            "author": "my_NSFW_posts",
            "id": "g6z424t",
            "parent_id": "t3_j1cj0g",
            "score": 6,
            "created_utc": 1601315524.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "g6zf96y",
                    "parent_id": "t1_g6z424t",
                    "score": 9,
                    "created_utc": 1601320362.0,
                    "replies": [
                        {
                            "body": "That's about what I expected. I guess the original comment was more \"what this really means\", and not automatically being against it.",
                            "author": "my_NSFW_posts",
                            "id": "g6zppkm",
                            "parent_id": "t1_g6zf96y",
                            "score": 2,
                            "created_utc": 1601324992.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "You're gonna get banned for it but I agree.",
            "author": "sakurarose20",
            "id": "g70och1",
            "parent_id": "t3_j1cj0g",
            "score": 7,
            "created_utc": 1601344343.0,
            "replies": []
        },
        {
            "body": "\"My schedule is insane these days\" = I make my own schedule.  You are insane and the sooner I get distance from you the better.\n\nShe says, \"I bought some new lingerie\" = You were the best SD I've ever had and I want you back.   I say, \"my schedule is still really insane\" = Turning me on was never the problem!",
            "author": "sdphilly",
            "id": "g72ykru",
            "parent_id": "t3_j1cj0g",
            "score": 4,
            "created_utc": 1601399596.0,
            "replies": [
                {
                    "body": "😂👏",
                    "author": "sugardad123",
                    "id": "j6nkj6z",
                    "parent_id": "t1_g72ykru",
                    "score": 1,
                    "created_utc": 1675182700.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "“I like to do coffee dates for the first meet” = I’m cheap and don’t have money to spend on a restaurant or something of substance",
            "author": "citygurlll",
            "id": "g6zahn3",
            "parent_id": "t3_j1cj0g",
            "score": 16,
            "created_utc": 1601318318.0,
            "replies": [
                {
                    "body": "See, I said this and I got trashed by this community. Apparently wanting to go to a nice dinner for a M&G is not acceptable in some cities (pre covid) and the “grab a coffee” date is like the new sugar speed dating go to event ....",
                    "author": "KnocDown",
                    "id": "g6zb3vm",
                    "parent_id": "t1_g6zahn3",
                    "score": 19,
                    "created_utc": 1601318597.0,
                    "replies": [
                        {
                            "body": ">I said this and I got trashed by this community.\n\nThat doesn't mean that you are wrong.",
                            "author": "denardos",
                            "id": "g6zhk9l",
                            "parent_id": "t1_g6zb3vm",
                            "score": 11,
                            "created_utc": 1601321328.0,
                            "replies": []
                        },
                        {
                            "body": "I don’t see why they would trash you. Coffee dates are low effort and if you are in this lifestyle as a woman you put a lot into your look on a date... just for it to be coffee? I prefer dinner or lunch but to each his own",
                            "author": "citygurlll",
                            "id": "g712myt",
                            "parent_id": "t1_g6zb3vm",
                            "score": 5,
                            "created_utc": 1601353072.0,
                            "replies": [
                                {
                                    "body": ">I don’t see why they would trash you. Coffee dates are low effort and if you are in this lifestyle as a woman you put a lot into your look on a date... just for it to be coffee? I prefer dinner or lunch but to each his own\n\nI generally agree, though the last two whales I went out with (one is now my amazing SD) both asked me on coffee dates. The way I made it worth my time was to book them on the same day I already had a dinner date with another POT so I didn't waste the time getting ready 'just for coffee'.",
                                    "author": "LVSugarBebe",
                                    "id": "g78n14p",
                                    "parent_id": "t1_g712myt",
                                    "score": 3,
                                    "created_utc": 1601514422.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "I think it's only sensible that the first meeting is something that can realistically be ended in 15-20 minutes should chemistry be completely bad or other issues (i.e. either or both parties lied in their profiles/photos and the initial interaction).  \nBut if it works for you...",
                            "author": "Lov3rm4n",
                            "id": "g6zgs3g",
                            "parent_id": "t1_g6zb3vm",
                            "score": 10,
                            "created_utc": 1601321014.0,
                            "replies": [
                                {
                                    "body": "You shouldn’t go in with that mindset. Even if chemistry is bad you can leave if it’s dinner or lunch lol no one should be holding you hostage.",
                                    "author": "citygurlll",
                                    "id": "g712qnr",
                                    "parent_id": "t1_g6zgs3g",
                                    "score": 6,
                                    "created_utc": 1601353146.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Only an in_group comment like this works. Imagine if an SB had posted - whew the blow back.\n\nDon’t agree with all but for sure there’s a lot of truth in the  OP.",
            "author": "solomon2609",
            "id": "g6zlaid",
            "parent_id": "t3_j1cj0g",
            "score": 5,
            "created_utc": 1601322904.0,
            "replies": []
        },
        {
            "body": "Thank you so much for that list. Of course, just as everyone says, there are exceptions to these situations, but for someone new in the SR world it’s absolutely helpful. Thanks to you I’ll know what should I pay attention to the most during my future experiences.",
            "author": "polyhedralspherical",
            "id": "g6yc1lf",
            "parent_id": "t3_j1cj0g",
            "score": 6,
            "created_utc": 1601302688.0,
            "replies": []
        },
        {
            "body": "What is a SD",
            "author": "volcanologists",
            "id": "g709wo1",
            "parent_id": "t3_j1cj0g",
            "score": 3,
            "created_utc": 1601336193.0,
            "replies": []
        },
        {
            "body": "Disagree with the transactional one.  All that means is I want to do allowance.  \n\nSlow things down = We started hot and heavy like any new relationship but I am going to be busy at work so chill for a bit. \n\nI don't like girls who cause drama = just that.. Don't get angry at me if some other girl that I used to know comes over and gives me a hug.  I can get murderous jealousy at home.   Also means -- I don't need to hear all the 17 times your cat is sick or the car broke down as hints for extra cash.  We agreed on an allowance, I am not going to ask you for extras, don't try to guilt me into same.  If you have a real one time need just discuss it with me and ask if I can help. \n\nYour friend is cute = yep that does mean that.",
            "author": "craa141",
            "id": "g6yoodo",
            "parent_id": "t3_j1cj0g",
            "score": 6,
            "created_utc": 1601308835.0,
            "replies": [
                {
                    "body": "The Daddies that say they don’t want to be transactional in my experience have offered to pay for unique experiences... then after one or two lunch outings I realize all we are doing is having sex.  I’m a SB to bring value added to my life as I bring it to their life. \n\nMy area seems to be PPM, even my regulars have refused an allowance even when I point out they may save money 🤷‍♀️ I have one SD I’ve been seeing off and on for over a year. He pays good each date. In his mind we meet every other week, but sometimes it’s 5 times a month. I’ve proposed X per month  which would equal to being less than 3 visits and he ended up taking a break🤦🏼‍♀️ Good news is he’s recently contacted me to meet soon.",
                    "author": "Copperdelight",
                    "id": "g6yz0xd",
                    "parent_id": "t1_g6yoodo",
                    "score": 4,
                    "created_utc": 1601313346.0,
                    "replies": [
                        {
                            "body": "It is a trust issue.  I usually start PPM but want to move to allowance as quickly as possible.  \n\nWith PPM you believe you won't be \"ripped off\" by prepaying.  You pay as you meet.  With allowance someone has to take the leap of faith and it should be the SD.  So you prepay for a period of time and hope the person lives up to their end of the agreement, whatever it is.",
                            "author": "craa141",
                            "id": "g7008my",
                            "parent_id": "t1_g6yz0xd",
                            "score": 6,
                            "created_utc": 1601330505.0,
                            "replies": [
                                {
                                    "body": "Thank you for giving me that perspective!",
                                    "author": "Copperdelight",
                                    "id": "g70ao5k",
                                    "parent_id": "t1_g7008my",
                                    "score": 3,
                                    "created_utc": 1601336660.0,
                                    "replies": [
                                        {
                                            "body": "I agree with the SD who replied. Also, consider proposing a bi-weekly or weekly allowance instead and then working up to monthly once trust is established. Inform him that 1) you just feel awkward with the envelope exchange during the date and 2) that it helps you to have something consistent, even if it's slightly less.\n\nThe other option is to try to set the same time each week with him and schedule in advance so it's on both of your schedules to look forward to, and you know you'll be taken care of.",
                                            "author": "LVSugarBebe",
                                            "id": "g78nqdh",
                                            "parent_id": "t1_g70ao5k",
                                            "score": 2,
                                            "created_utc": 1601514830.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "I see you may have posted a number which is most likely an amount in relations to an arrangement. If this is the case, you are violating Rule#4 - \"No dollar amounts that are in reference to allowance/PPM are allowed.\"\n\n\nIf you are curious about Allowances reported by SLF contributors please see the [Allowance Master Thread 2019-2020](https://www.reddit.com/r/sugarlifestyleforum/comments/dezl91/allowance_master_thread_20192020/?utm_source=reddit&utm_medium=usertext&utm_name=sugarlifestyleforum&utm_content=t3_dnk455)\n\nYour post will not be approved until you remove the amount.  Please read the sub [Rules](https://www.reddit.com/r/sugarlifestyleforum/comments/748zta/updated_and_clarified_rules_for_slf/) prior to posting anything else. \n\nIf you simply posted a number not referencing a monetary amount, please message the MODs to approve your post.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/sugarlifestyleforum) if you have any questions or concerns.*",
                            "author": "AutoModerator",
                            "id": "g6yz0z6",
                            "parent_id": "t1_g6yz0xd",
                            "score": 1,
                            "created_utc": 1601313346.0,
                            "replies": [
                                {
                                    "body": "I did not break rules",
                                    "author": "Copperdelight",
                                    "id": "gc0qitm",
                                    "parent_id": "t1_g6yz0z6",
                                    "score": 1,
                                    "created_utc": 1605164221.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Agreed about transactional. It means I don't want PPM and want to do allowance instead.\n\nAs for drama, I don't tell an SB I don't want someone who's dramatic, I just stop seeing her if it's too much. There's not much point in saying something. A dramatic person can't help it very much, that's just who they are.",
                    "author": "thothamon",
                    "id": "g6yvq8l",
                    "parent_id": "t1_g6yoodo",
                    "score": 4,
                    "created_utc": 1601311937.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I don’t like transactional...means I don’t want to keep handing over cash. Prefer allowance.\n\nFine dinning., unless a dam good chef fresh food I prefer not to.\nOnce in a while maybe prefer not to don’t see the value. Had a couple of terrible sea food hi end meals. Not even fresh 😢\n\nYou’re friend is cute .. guilty on that one though",
            "author": "SydSd1",
            "id": "g6zw6yq",
            "parent_id": "t3_j1cj0g",
            "score": 6,
            "created_utc": 1601328298.0,
            "replies": []
        },
        {
            "body": "*What you wrote rings true, but for me....*\n\n**“I don’t want it to feel transactional”**  \\-- I really don't. I also don't buy her cheap gifts except as extras on top of the allowance. I try to move from per meet to something like weekly or 2x a month ASAP.\n\n**“I don’t like girls who cause drama”  --** I really don't. I'll typically stop the SR if she causes drama.\n\n**“I really don’t like that type of restaurant” --** I really don't. I promise you when I tell you I don't like xxx food, I don't. But if you want to go to my favorite sushi place or a nice steak place, I'm not concerned about the price.\n\n**“Your friend is cute” = I want to sleep with your friend --** I really don't, but if she sends a pic with her friend I awkwardly also compliment the friend, while reminder her the friend is \"not as cute as you of course\".",
            "author": "marker3000",
            "id": "g6yl6e1",
            "parent_id": "t3_j1cj0g",
            "score": 12,
            "created_utc": 1601307321.0,
            "replies": [
                {
                    "body": "> “I don’t want it to feel transactional” -- I really don't\n\nSure, nobody does, but I think this is one of those phrases with special meaning in the sugar bowl, just like \"I know my worth\". There is nothing wrong with those, taken literally, but 99% of the time they're code for something else.",
                    "author": "SkepticalChallenge",
                    "id": "g6zjy74",
                    "parent_id": "t1_g6yl6e1",
                    "score": 7,
                    "created_utc": 1601322337.0,
                    "replies": [
                        {
                            "body": "I get that. There is no way for me to take \"I know my worth\" well, though. Whereas if I say to her \"I don't want this to be transactional\"... the next words out of my mouth will make it clear I'm sincere.",
                            "author": "marker3000",
                            "id": "g70cdyy",
                            "parent_id": "t1_g6zjy74",
                            "score": 2,
                            "created_utc": 1601337694.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "g6z8jha",
                    "parent_id": "t1_g6yl6e1",
                    "score": 5,
                    "created_utc": 1601317454.0,
                    "replies": [
                        {
                            "body": "For me certain cuisines are just not my favorites. I don't care if the restaurant is cheap or pricey in those cuisines!\n\nAnd, really, I have never wanted to sleep with her friend. Except one M&G where she brought the friend. And it wasn't close as to which one was the more attractive.",
                            "author": "marker3000",
                            "id": "g6zb6x6",
                            "parent_id": "t1_g6z8jha",
                            "score": 3,
                            "created_utc": 1601318635.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Agreed on all that, except I might well want to sleep with her cute friend. 😂",
                    "author": "thothamon",
                    "id": "g6ywbzy",
                    "parent_id": "t1_g6yl6e1",
                    "score": 0,
                    "created_utc": 1601312188.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I’m cackling 😂😭",
            "author": "ThatBrownSugarBabe",
            "id": "g701ydr",
            "parent_id": "t3_j1cj0g",
            "score": 2,
            "created_utc": 1601331477.0,
            "replies": []
        },
        {
            "body": "This is too funny 😂",
            "author": "lilkeptbitch",
            "id": "g706wbh",
            "parent_id": "t3_j1cj0g",
            "score": 2,
            "created_utc": 1601334365.0,
            "replies": []
        },
        {
            "body": "\"I've been struggling at work lately and need to lower our ppm\" = i either cannot afford the fantasy i instilled in you from the beginning, or i just wanna see if i can get the same thing with less money",
            "author": "sbgonebroke",
            "id": "g72ti50",
            "parent_id": "t3_j1cj0g",
            "score": 2,
            "created_utc": 1601397560.0,
            "replies": []
        },
        {
            "body": "I said the transactional one today but that was cause I genuinely like my SB and I want it to feel real. I also told her that if she ever needs money to just ask and I’ll give it to her no strings attached so hopefully that’s good enough",
            "author": "HotStool",
            "id": "gebn0t9",
            "parent_id": "t3_j1cj0g",
            "score": 2,
            "created_utc": 1606872912.0,
            "replies": []
        },
        {
            "body": "There should be one for what SBs say and what they actually mean as well",
            "author": "Rich_Wishbone",
            "id": "g6yhi5h",
            "parent_id": "t3_j1cj0g",
            "score": 6,
            "created_utc": 1601305616.0,
            "replies": [
                {
                    "body": "Make it!",
                    "author": "angelhair12",
                    "id": "g6ywbnd",
                    "parent_id": "t1_g6yhi5h",
                    "score": 7,
                    "created_utc": 1601312184.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Hold on now. If she suggests a vegan place, I literally dont like that type of restaurant. Happy to pay twice as much for meat.",
            "author": "TastySpermDispenser",
            "id": "g6ylcak",
            "parent_id": "t3_j1cj0g",
            "score": 4,
            "created_utc": 1601307391.0,
            "replies": [
                {
                    "body": "I don’t think anyone would ever confuse a Vegan place with being expensive :)",
                    "author": "KnocDown",
                    "id": "g6ylptk",
                    "parent_id": "t1_g6ylcak",
                    "score": 14,
                    "created_utc": 1601307554.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "g6z8ma0",
                            "parent_id": "t1_g6ylptk",
                            "score": 6,
                            "created_utc": 1601317490.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "g6zkcln",
                                    "parent_id": "t1_g6z8ma0",
                                    "score": -1,
                                    "created_utc": 1601322504.0,
                                    "replies": [
                                        {
                                            "body": "Your $80 tofu is served madam. \n\nI have gone a lot for the alt SBs. You somehow have to be both open to woke vegan restaurants and be willing to spend a lot to show you’re a serious SD. Oh the amount of meat substitutes I’ve eaten for sugar...",
                                            "author": null,
                                            "id": "g6znwhy",
                                            "parent_id": "t1_g6zkcln",
                                            "score": 2,
                                            "created_utc": 1601324088.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Love this post!",
            "author": "prettylilprostitute",
            "id": "g6yk6u7",
            "parent_id": "t3_j1cj0g",
            "score": 3,
            "created_utc": 1601306883.0,
            "replies": []
        },
        {
            "body": ">“Your friend is cute” = I want to sleep with your friend\n\nTruth.",
            "author": "gingerdaddy56",
            "id": "g704x5n",
            "parent_id": "t3_j1cj0g",
            "score": 4,
            "created_utc": 1601333188.0,
            "replies": []
        },
        {
            "body": "This seems overly salty. You don't want to be taken shopping? And since when is aversion to drama a big ask?",
            "author": "KeyToGramercy",
            "id": "g71dtz3",
            "parent_id": "t3_j1cj0g",
            "score": 2,
            "created_utc": 1601362974.0,
            "replies": []
        },
        {
            "body": "Well here comes the parody thread",
            "author": "UnearthlyDinosaur",
            "id": "g6yczqu",
            "parent_id": "t3_j1cj0g",
            "score": 2,
            "created_utc": 1601303219.0,
            "replies": []
        },
        {
            "body": "You people are fucking lunatics",
            "author": "Astro4220",
            "id": "g6yv1po",
            "parent_id": "t3_j1cj0g",
            "score": 0,
            "created_utc": 1601311642.0,
            "replies": []
        },
        {
            "body": "“I think you’re out of my league”: you come off as an escort",
            "author": "zenpelican",
            "id": "g702sil",
            "parent_id": "t3_j1cj0g",
            "score": 3,
            "created_utc": 1601331950.0,
            "replies": []
        },
        {
            "body": "Some of these are accurate and some are nonsense, but apparently hating on an entire gender is not against the sub rules, as long as that gender is male anyway.",
            "author": "UseTheForceRey",
            "id": "g6ys568",
            "parent_id": "t3_j1cj0g",
            "score": 2,
            "created_utc": 1601310368.0,
            "replies": [
                {
                    "body": "Do you use these lines and feel dirty now? Bc i assure you guys who are real SD find this post hilarious!",
                    "author": "angelhair12",
                    "id": "g6ywkd8",
                    "parent_id": "t1_g6ys568",
                    "score": 15,
                    "created_utc": 1601312285.0,
                    "replies": [
                        {
                            "body": "A hit dog will holler... 😏",
                            "author": "Consistent-Sorbet-51",
                            "id": "g6z1yf4",
                            "parent_id": "t1_g6ywkd8",
                            "score": 12,
                            "created_utc": 1601314630.0,
                            "replies": []
                        },
                        {
                            "body": "As a matter of fact, I have not used any of those lines, with the exception of the most ridiculous one there - “I don’t like that type of restaurant” - because believe it or not, there are some restaurants that I don’t like. \n\nWhile I haven’t used the phrase, no one in a real SR wants it to feel transactional.   While I haven’t done it myself, many people are intimate right after the M&G and go beyond a hookup.",
                            "author": "UseTheForceRey",
                            "id": "g6z433v",
                            "parent_id": "t1_g6ywkd8",
                            "score": 0,
                            "created_utc": 1601315536.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Btw you were outed by your own gender. Believe it or not OP is a man 😫",
                    "author": "angelhair12",
                    "id": "g6ywzez",
                    "parent_id": "t1_g6ys568",
                    "score": 12,
                    "created_utc": 1601312461.0,
                    "replies": [
                        {
                            "body": "I am aware that the poster is an SD, and I stand by my point.",
                            "author": "UseTheForceRey",
                            "id": "g6z3npt",
                            "parent_id": "t1_g6ywzez",
                            "score": 1,
                            "created_utc": 1601315355.0,
                            "replies": [
                                {
                                    "body": "You can’t teach an old dog new tricks.",
                                    "author": "angelhair12",
                                    "id": "g6z5lhb",
                                    "parent_id": "t1_g6z3npt",
                                    "score": 1,
                                    "created_utc": 1601316180.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "I think it's half-satire, and we could easily come up with a similar list for SBs. Having said that, I do share your distaste for smearing men as a group. If you wouldn't make a statement about Jews, African-Americans, or women because it would be a bigoted statement, then it's still bigoted if you say it about men.",
                    "author": "thothamon",
                    "id": "g6yw54n",
                    "parent_id": "t1_g6ys568",
                    "score": 0,
                    "created_utc": 1601312106.0,
                    "replies": []
                },
                {
                    "body": "lol so true",
                    "author": "UnearthlyDinosaur",
                    "id": "g6zcw6r",
                    "parent_id": "t1_g6ys568",
                    "score": 0,
                    "created_utc": 1601319362.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Thanks for this! I'm just getting started! I'm probably a little naive but trying to get a feel for it all...",
            "author": "ShyButtWilling",
            "id": "g7rpuil",
            "parent_id": "t3_j1cj0g",
            "score": 1,
            "created_utc": 1601889003.0,
            "replies": []
        },
        {
            "body": "A SD asking to send a SB money via a wire transfer isn’t necessarily a scam. It’s a legitimate way of transferring money. \n\nSome may prefer it and are use to it. I know there are apps like PayPal etc but they have limits and not everyone uses them or is familiar with them.",
            "author": "a1bells",
            "id": "g6znlba",
            "parent_id": "t3_j1cj0g",
            "score": -1,
            "created_utc": 1601323933.0,
            "replies": []
        },
        {
            "body": "I dont agree on restraunt or dress shopping\n\n\nI dont like every kind of foods, its not about the price, unless its unreasonable expensive...\n\n\nIn regards to clothes, I want to dress her the way i like",
            "author": "foxhom3",
            "id": "g6ycqdj",
            "parent_id": "t3_j1cj0g",
            "score": 0,
            "created_utc": 1601303077.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "g6yb83m",
            "parent_id": "t3_j1cj0g",
            "score": -6,
            "created_utc": 1601302223.0,
            "replies": [
                {
                    "body": "OP makes extreme conclusions that while can be truthful some of the time aren't truthful all the time. Not to mention he's a 9/11 truther.",
                    "author": "lemondropsman",
                    "id": "g6yeiy4",
                    "parent_id": "t1_g6yb83m",
                    "score": -3,
                    "created_utc": 1601304068.0,
                    "replies": [
                        {
                            "body": "While I have zero respect for 9/11 truthers, I think it’s okay to compartmentalize and view this post for what it was: one SD’s take on the phony lines often used by POTs to hoodwink naive SB POTs. I thought it was mostly humorous, with a kernel of truth buried in each line. \n\nThere have been so many new SB posts over the last couple of weeks, many telling stories that make a Bowl veteran’s skin crawl, that OP is providing a reasonable, somewhat humorous lampoon of the caricature of the crappy “SD wannabes” (or worse) who can make the Bowl treacherous, lecherous, and not so fun.",
                            "author": null,
                            "id": "g6yjn0q",
                            "parent_id": "t1_g6yeiy4",
                            "score": 9,
                            "created_utc": 1601306634.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "g6ztres",
            "parent_id": "t3_j1cj0g",
            "score": -8,
            "created_utc": 1601327020.0,
            "replies": [
                {
                    "body": "Knocdown is ...... ah nevermind you figure it out.",
                    "author": "highfructoseSD",
                    "id": "g71azs2",
                    "parent_id": "t1_g6ztres",
                    "score": 1,
                    "created_utc": 1601360213.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "This sure sounds like a hit piece against a specific SD you had that treated you like crap, and seeks to overly generalize against SD's who are actually looking for someone specific and special.\n\nI feel like I'd categorize this post more in line with the \"I've met a bunch of crappy SD's and here's what I heard when they talked\" caveat to this post, rather than grossly generalize across SD's who are genuinely seeking something special, but to each their own.",
            "author": "cleanandjerks19",
            "id": "g6ybgmr",
            "parent_id": "t3_j1cj0g",
            "score": -17,
            "created_utc": 1601302357.0,
            "replies": [
                {
                    "body": "I’m a guy and I’m feeling bad for all the new people in the forum these last 2 weeks that seem to be falling for all the classic lines or be taken advantage of \n\nBut please continue to complain like the other guy that you are special and use these lines without meaning harm",
                    "author": "KnocDown",
                    "id": "g6ybnou",
                    "parent_id": "t1_g6ybgmr",
                    "score": 33,
                    "created_utc": 1601302471.0,
                    "replies": [
                        {
                            "body": "No, this entire post is garbage.\n\nIf I was seeking something transactional, I'd hire an escort. The lack of transactional feels comment comes from handing straight cash to someone. I pay my SB's rent, and both of us have repeatedly said to one another we don't want things to feel transactional.\n\nMaybe we should slow things down is also something we both have said to one another, because the emotional connection is strong and catching feels is a bit dangerous. \n\nNot wanting a girl who causes drama is the hallmark of an effective SR for many men, who actively are married or have families/careers that a SB could jeopardize if their SR were to be made public.\n\nIf a SB decides on a M+G she wants to come back to a place, she should bring up $. \n\nI buy my SB very nice clothes. She doesn't dress like a hooker, she's giving her doctoral thesis, applying for jobs, and working. She literally needs nice clothes for her life to function correctly.\n\nI hate italian food. I tell my SB all the time I don't like \"that type\" of restaurant, yet we had a $1200 tab the last time we went out to eat.\n\nAnd yeah, less public SRs are pretty common.\n\n\nYour post grossly generalizes SDs. It's not helpful, it's deceitful, dishonest, and paints you like a SIMP.",
                            "author": "cleanandjerks19",
                            "id": "g6yc80z",
                            "parent_id": "t1_g6ybnou",
                            "score": -18,
                            "created_utc": 1601302789.0,
                            "replies": [
                                {
                                    "body": "JFC dude.  These are all extremely common. \n\nHe didn’t say anything about you, it wasn’t personal.  \n\nCalling him a simp..good job drama queen",
                                    "author": "BGDDDY1",
                                    "id": "g6ycqkn",
                                    "parent_id": "t1_g6yc80z",
                                    "score": 27,
                                    "created_utc": 1601303080.0,
                                    "replies": [
                                        {
                                            "body": "Sorry - did I say these weren't common? Of course they're common. They also grossly misrepresent what each individual means when they say them. They're also, oddly enough, things many SB's say to POT SD's. To suggest \"I don't like that kind of restaurant\" means \"I'm a cheap ass\" is silly. To suggest wanting a private SR is some type of sin, when nearly all effective SR's have some level of discretion and privacy, is a misrepresentation of SR dating to begin with.\n\nTo suggest not wanting something to feel transactional means anything other than both parties not wanting it to feel like prostitution is dishonest. This is the hallmark of SA, and literally any conversation I have ever had with POTs. Nobody wants it to feel transactional. \n\nSuggesting to your SB you want to buy her nice clothes doesn't mean you think she dresses like a hooker, it could just mean I want to buy you something nice. \n\nAnd again, I very specifically stated that OP was generalizing SD's. I never implied his post was an attack on me, in fact, HE implied his post was an attack on me.",
                                            "author": "cleanandjerks19",
                                            "id": "g6ydsn6",
                                            "parent_id": "t1_g6ycqkn",
                                            "score": -12,
                                            "created_utc": 1601303664.0,
                                            "replies": [
                                                {
                                                    "body": "The truth via “Tongue in cheek”..look it up & try putting on a sense of humor 🤷‍♂️",
                                                    "author": "BGDDDY1",
                                                    "id": "g6yecp4",
                                                    "parent_id": "t1_g6ydsn6",
                                                    "score": 11,
                                                    "created_utc": 1601303970.0,
                                                    "replies": [
                                                        {
                                                            "body": "OP has repeatedly suggested this is a list meant to be helpful. There's no tongue in cheek implied by the OP.",
                                                            "author": "cleanandjerks19",
                                                            "id": "g6yfdn4",
                                                            "parent_id": "t1_g6yecp4",
                                                            "score": 3,
                                                            "created_utc": 1601304535.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Guarantee you if we took a vote on whether you chuckled when you read post most would say yes.",
                                                                    "author": "BGDDDY1",
                                                                    "id": "g6yxpz3",
                                                                    "parent_id": "t1_g6yfdn4",
                                                                    "score": 2,
                                                                    "created_utc": 1601312777.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "You are literally the reason the other young lady inspired me to make my post :)",
                                    "author": "KnocDown",
                                    "id": "g6ycf01",
                                    "parent_id": "t1_g6yc80z",
                                    "score": 13,
                                    "created_utc": 1601302899.0,
                                    "replies": [
                                        {
                                            "body": "Odd. Going 3 years strong with an SB. She sure doesn't seem to mind almost any of the things you've posted. \n\nSure. Are there SDs who suck? Absolutely. All this post did was generalize SD's.",
                                            "author": "cleanandjerks19",
                                            "id": "g6ycnra",
                                            "parent_id": "t1_g6ycf01",
                                            "score": -3,
                                            "created_utc": 1601303035.0,
                                            "replies": [
                                                {
                                                    "body": "You are flexing way too hard, have a nice day",
                                                    "author": "KnocDown",
                                                    "id": "g6ycv5i",
                                                    "parent_id": "t1_g6ycnra",
                                                    "score": 21,
                                                    "created_utc": 1601303149.0,
                                                    "replies": [
                                                        {
                                                            "body": "😂😂😂",
                                                            "author": "macaroonqueen",
                                                            "id": "g6yf7zr",
                                                            "parent_id": "t1_g6ycv5i",
                                                            "score": 8,
                                                            "created_utc": 1601304451.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Speaking as an SD who has no issues paying for a room, sometimes \"can you host\" has a different meaning.  Personally, I get off on being invited back to her place.  It makes it feel more like you seduced her and she's taking you to her place for a good time than what it actually is.",
            "author": "okiedokie304",
            "id": "g9d51xu",
            "parent_id": "t1_g6z9hsb",
            "score": 21,
            "created_utc": 1603139421.0,
            "replies": []
        },
        {
            "body": ">Can you host?\" = I'm too cheap to pay for a hotel and pay you. Slash I'm married and that can't come up on my CC bill.  \n>  \n>\"I want you to take my money\" - I get off on the fantasy of findom. You won't actually get any money or shopping trips. There will only be back and forth texting.\n\nHaha yes!",
            "author": null,
            "id": "g736ok1",
            "parent_id": "t1_g6z9hsb",
            "score": 11,
            "created_utc": 1601403221.0,
            "replies": []
        },
        {
            "body": "Well played.  I like, respect and enjoy the boundaries in a sugar relationship and ironically because of that we often end up with deeper ties and connections.  It’s like,  because I don’t particularly want to meddle in their life for the first 4 months or so they are suddenly wanting my opinion on how to handle situations which then leads to more involvement.  I really wish to keep boundaries but I also hate seeing my girls struggle with things I can easily fix.  I’m a guy,  I’m wired to fix problems.  \n\nExample... I have nice size small business and I was looking at my cell phone bill.   I realized I had 7 current and past SB’s on my Verizon bill.   I have a few car leases for current SB’s (cheaper VW’s) .",
            "author": "LotBuilder",
            "id": "g6zr6rg",
            "parent_id": "t1_g6zi87z",
            "score": 22,
            "created_utc": 1601325738.0,
            "replies": [
                {
                    "body": "I always wondered about that. How involved should one get without it getting to personal...or something like that.",
                    "author": "eshtahnohs",
                    "id": "g70l7w9",
                    "parent_id": "t1_g6zr6rg",
                    "score": 9,
                    "created_utc": 1601342681.0,
                    "replies": [
                        {
                            "body": "I just follow the girls lead within what we want.  I’m adaptable.  I have had SB’s that stayed very private and secretive for years and I had another one where I was at her family BBQ about a month in.  They all are different.",
                            "author": "LotBuilder",
                            "id": "g70n53n",
                            "parent_id": "t1_g70l7w9",
                            "score": 15,
                            "created_utc": 1601343697.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "g6zlwuy",
            "parent_id": "t1_g6zi87z",
            "score": 18,
            "created_utc": 1601323168.0,
            "replies": [
                {
                    "body": "My other favorite rebuttal to “I don’t have a problem getting sex without paying for it”\n\nMe: “And I don’t have a problem finding a rich, attractive, and attentive young man to date/marry who will share all of his life with me.”",
                    "author": "LVSugarBebe",
                    "id": "g6znjur",
                    "parent_id": "t1_g6zlwuy",
                    "score": 51,
                    "created_utc": 1601323913.0,
                    "replies": [
                        {
                            "body": "[removed]",
                            "author": null,
                            "id": "g70jz0b",
                            "parent_id": "t1_g6znjur",
                            "score": 11,
                            "created_utc": 1601342001.0,
                            "replies": [
                                {
                                    "body": "Call me an idiot but maybe I just have a thing for older men with education, life experience, and emotional security and do not need marriage to feel a genuine and long-lasting connection with another person.",
                                    "author": "LVSugarBebe",
                                    "id": "g78ogfr",
                                    "parent_id": "t1_g70jz0b",
                                    "score": 3,
                                    "created_utc": 1601515238.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": ">“I don’t have a problem getting sex without paying for it”\n\nThey say this when they are on an arrangement website or dating website or in-person meeting? If an arrangement dating website that literally makes zero sense for him to say that!",
                            "author": null,
                            "id": "g736wv7",
                            "parent_id": "t1_g6znjur",
                            "score": 3,
                            "created_utc": 1601403312.0,
                            "replies": [
                                {
                                    "body": "A guy will say this on a seeking site, I've seen it SEVERAL times in their profiles as well. Their justification is 'I'm too busy for a relationship so I'm on here.' More often than not you'll see it in profiles of men under 40. Sometimes they're attractive, sometimes they're not.  \n\n\nThey lead with 'I don't have a problem getting sex without paying for it' to either set an expectation anchor for the SB that she's not getting an allowance or to make them feel better about being on the site. Regardless, the conversation generally leads to the fact that they want to put in the minimum effort (paying for coffee/dinner) in order to get an on-demand booty-call girlfriend without any of the commitment or emotional expectation of an ongoing relationship.  \n\n\nThese guys may genuinely not have problems meeting women, but they want to get to sex as quickly as possible or lower the risk of multiple encounters with random women. My observation is that the really attractive and successful men have some other problem with their personality or lifestyle that prevents them from finding women who can fulfill this need in their vanilla dating life.",
                                    "author": "LVSugarBebe",
                                    "id": "g777x4u",
                                    "parent_id": "t1_g736wv7",
                                    "score": 1,
                                    "created_utc": 1601490348.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "I am having an experience that I think is deja vu? I'm not sure but its  like an out of body experience seeing your username and a comment I would say!",
                            "author": "MJline",
                            "id": "g70wd4s",
                            "parent_id": "t1_g6znjur",
                            "score": 2,
                            "created_utc": 1601348897.0,
                            "replies": []
                        },
                        {
                            "body": ">Me: “And I don’t have a problem finding a rich, attractive, and attentive young man to date/marry who will share all of his life with me.”\n\nGood for you, but plenty of SBs do struggle with this. Rich men mostly marry rich women, specially because of the many assets that have to be shared.\n\nSo many women mistake having sex with a rich attractive guy for \"he will share all of his life with me\".\n\nThere just aren't enough rich men (not even countering attractive) for all the women that want to date one.",
                            "author": "AdAlternative6041",
                            "id": "g6zwvf9",
                            "parent_id": "t1_g6znjur",
                            "score": 6,
                            "created_utc": 1601328658.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "True.\n\nBut that logic is also a double edged sword.",
                    "author": null,
                    "id": "g6zp3d1",
                    "parent_id": "t1_g6zlwuy",
                    "score": 7,
                    "created_utc": 1601324682.0,
                    "replies": []
                }
            ]
        },
        {
            "body": ">Sometimes guys forget that the girlfriend/wife experience is FAR more expensive than an arrangement, so we have to remind them\n\nTotally agree. Having a wife is so expensive!",
            "author": null,
            "id": "g70ujyg",
            "parent_id": "t1_g6zi87z",
            "score": 15,
            "created_utc": 1601347862.0,
            "replies": [
                {
                    "body": "That's only if you're a weak man with low standards",
                    "author": "Status_Let_3850",
                    "id": "hrerxnx",
                    "parent_id": "t1_g70ujyg",
                    "score": 1,
                    "created_utc": 1641419701.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Lol. That’s the best! So true too! I never got the I don’t want to be transactional. For me I want the terms of the transaction beforehand you know? Like any deal. It’s nice to get it out of the way too so we both are at ease. That’s just me though.",
            "author": "highjinx411",
            "id": "g70h0mc",
            "parent_id": "t1_g6zi87z",
            "score": 11,
            "created_utc": 1601340376.0,
            "replies": []
        },
        {
            "body": "The guy I'm dating right now (not an SD) has been way more generous than any SD I've been with. Seems like I've been getting a lot of Splenda.",
            "author": "eshtahnohs",
            "id": "g70kxbm",
            "parent_id": "t1_g6zi87z",
            "score": 11,
            "created_utc": 1601342519.0,
            "replies": []
        },
        {
            "body": "This is gold",
            "author": "luxlife0804",
            "id": "glmlhyd",
            "parent_id": "t1_g6zi87z",
            "score": 3,
            "created_utc": 1612202589.0,
            "replies": []
        },
        {
            "body": "I really want to hear from the SDs as to why guys keep offering to pick me up (instead of, for example, offering to pay the cab fare when I arrive).  It happens all the time, and usually from guys who are otherwise generally really chivalrous and nice.",
            "author": "JustKittenxo",
            "id": "g6zk75j",
            "parent_id": "t1_g6yfkb9",
            "score": 24,
            "created_utc": 1601322441.0,
            "replies": [
                {
                    "body": "Cause they wanna take you home later and bang you on your couch without having to get a hotel... I dunno tho otherwise.  I just don't like new SDs knowing where I live bc I have had issues with stalkers in the past and I enjoy having that privacy.. Any guy I meet on SA that wants to come to my house and hang out strikes me as cheap.. We can hang out in a nice bar or hotel room.. Not my house. No way.",
                    "author": "NattyLiteSaber",
                    "id": "g6zkt4w",
                    "parent_id": "t1_g6zk75j",
                    "score": 21,
                    "created_utc": 1601322703.0,
                    "replies": [
                        {
                            "body": "I don't like new SDs knowing where I live.  I let my one SD know where I lived after 4 months of consistent dating because he was so adamant on picking me up and dropping me off so I could drink with him (yeah, I know, I know).  He's always been super respectful about not inviting himself in (I made it clear it's never going to happen), and I don't think he'd stalk me.  But I still wish I'd never given in to the pressure.  He has absolutely zero concept of discretion.  When he shows up he tries to kiss me because \"I've missed you so much, I just can't wait for a kiss\"... right in front of my 80+ year old neighbour's living room window.  He's generally a great SD, reliable, generous, respectful, and he treats me really well. He just has absolutely no class or concept of the idea that maybe PDA isn't appropriate in the extremely conservative neighbourhood I live in, especially not in front of the nosiest neighbour on my street (she's retired and as far as I can tell has no friends or hobbies besides spying on the entire street, lol).",
                            "author": "JustKittenxo",
                            "id": "g6zlwa4",
                            "parent_id": "t1_g6zkt4w",
                            "score": 16,
                            "created_utc": 1601323161.0,
                            "replies": [
                                {
                                    "body": "Girl... I live in a whole neighborhood of Bessie's like that! They would lose their shit...😂 I feel like they are judging me just because I am leaving after dark to go out like some wild woman..😂",
                                    "author": "NattyLiteSaber",
                                    "id": "g6zrwt2",
                                    "parent_id": "t1_g6zlwa4",
                                    "score": 15,
                                    "created_utc": 1601326095.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Scammers will often ask for gas or Uber money up front.  Then you get into the standoff of picking them up or sending an Uber from my account... but for their privacy they just want you to Venmo $50... blah blah blah.  It’s a pain.",
                    "author": "LotBuilder",
                    "id": "g6zld71",
                    "parent_id": "t1_g6zk75j",
                    "score": 15,
                    "created_utc": 1601322935.0,
                    "replies": [
                        {
                            "body": "I can understand being worried about the scammers and not wanting to send money upfront.  I do wish they'd just offer to give a small gift when I arrive to cover travel expenses (or offer to meet me when I park and pay for it).  [By far my best M&G date was with a person who texted me while I was on my way there letting me know to just tell valet parking my name when I arrived and he'd already handled the cost... just such a sweet and thoughtful way to start off our first meeting and he was even sweeter and more thoughtful during the date.]",
                            "author": "JustKittenxo",
                            "id": "g6znpkv",
                            "parent_id": "t1_g6zld71",
                            "score": 28,
                            "created_utc": 1601323993.0,
                            "replies": [
                                {
                                    "body": "I always tell them I will give them money when we meet but I don’t send cash to strangers.  Did it twice and both ghosted and blocked.  It’s a shame because I know there are honest girls out there that just don’t want to risk getting stood up and spending money they don’t have.",
                                    "author": "LotBuilder",
                                    "id": "g6zoibs",
                                    "parent_id": "t1_g6znpkv",
                                    "score": 11,
                                    "created_utc": 1601324394.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Perhaps it is just an old school thing? I think they forget that times are different nowadays and especially women need to have their guard up. In a perfect world, I would love to be offered a ride and feel safe accepting it. But better safe than sorry, right?",
                    "author": "w4termelonsug4r",
                    "id": "g700y7y",
                    "parent_id": "t1_g6zk75j",
                    "score": 5,
                    "created_utc": 1601330909.0,
                    "replies": []
                },
                {
                    "body": "Cheap",
                    "author": null,
                    "id": "g6zkl2f",
                    "parent_id": "t1_g6zk75j",
                    "score": 5,
                    "created_utc": 1601322604.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yesssss this this this!",
            "author": "prettylilprostitute",
            "id": "g6yk25x",
            "parent_id": "t1_g6yfkb9",
            "score": 7,
            "created_utc": 1601306821.0,
            "replies": [
                {
                    "body": "Lol... I think the SBs have far more experience with these bullshit lines and what they REALLY mean..🙄",
                    "author": "NattyLiteSaber",
                    "id": "g6ykpam",
                    "parent_id": "t1_g6yk25x",
                    "score": 5,
                    "created_utc": 1601307108.0,
                    "replies": []
                }
            ]
        },
        {
            "body": ">My last SB went CRAZY and was stalking me..\" Really means: \"the last girl I had a relationship with.. Asked for the money I owed her..\n\nThat's such an stupid assumption to make. You are basically saying no women can act crazy in the bowl, it must be all cheap SDs.\n\nAt least in my experience, the bowl has way more crazy than vanilla dating.",
            "author": "AdAlternative6041",
            "id": "g6zvnm8",
            "parent_id": "t1_g6yfkb9",
            "score": 1,
            "created_utc": 1601328016.0,
            "replies": [
                {
                    "body": "I mean... Yeah there is plenty of crazy on both sides...but, most of the times that \"crazy\" gets triggered by one person not keeping up their end of things... I am sure the crazy, jealous side chick exists.. But, so does the 3-date-cheapskate-SD...",
                    "author": "NattyLiteSaber",
                    "id": "g6zvzaa",
                    "parent_id": "t1_g6zvnm8",
                    "score": 9,
                    "created_utc": 1601328186.0,
                    "replies": [
                        {
                            "body": "That's not at all what you implied in your comment. You basically said that men can't be stalked, it must all be cheap SDs than ran off without paying.",
                            "author": "AdAlternative6041",
                            "id": "g704esq",
                            "parent_id": "t1_g6zvzaa",
                            "score": -1,
                            "created_utc": 1601332889.0,
                            "replies": [
                                {
                                    "body": "I didn't imply anything.. I stated what I stated... Actually I didn't say a thing about guys being stalked... At all... Not one reference..\n\nI am talking about what an SD says to new prospective women when asked about their previous relationships... So... I don't really know why you're talking about men being stalked.. Pretty sure men get stalked, too.. 🤷 \n\n\nBUT, in, MY experience... That girl was not crazy OR a stalker... But, \"I was cheap and she got pissed when I didn't pay her what we discussed then blew my phone up.. So, I blocked her for trying to get money that was owed to her\"... That doesn't sound as good to a new girl to scam... So, they just call every girl they have been with in the past.. \"Crazy\" or \"A stalker\" bc they got ripped off by some douchebag....🙄",
                                    "author": "NattyLiteSaber",
                                    "id": "g70620g",
                                    "parent_id": "t1_g704esq",
                                    "score": 7,
                                    "created_utc": 1601333858.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I’ve had that pulled on me once. Byebye salty!",
            "author": null,
            "id": "g6zjv96",
            "parent_id": "t1_g6ym1a1",
            "score": 10,
            "created_utc": 1601322302.0,
            "replies": [
                {
                    "body": "Even single ones 😂😂",
                    "author": "PioneerExperience",
                    "id": "g70bord",
                    "parent_id": "t1_g6zjv96",
                    "score": 2,
                    "created_utc": 1601337274.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I don't understand the whole picture thing. \nSB has limited or obscured pics on her profile. I get it its for privacy.\n\n\nMessage back and forth, move to text. \nText exchange goes like this: \n\n\nSD: Hey can I see a pic or two since you know what I look like. \nSB: How much will you pay?\nSD: wouldn't an allowance be more help?\nSB: well I really need some cash for.....\nSD: bye\n\n\nEasiest way to weed a SB who will never meet.",
            "author": "inafishbowl17",
            "id": "g70ki87",
            "parent_id": "t1_g6zu2k1",
            "score": 5,
            "created_utc": 1601342294.0,
            "replies": []
        },
        {
            "body": "This got very dark very fast o-o",
            "author": "KnocDown",
            "id": "g6zil27",
            "parent_id": "t1_g6zh6h5",
            "score": 9,
            "created_utc": 1601321752.0,
            "replies": [
                {
                    "body": "Like the first five minutes of a Disney-Pixar film dark? Or Black Mirror dark?",
                    "author": "pygmalionsrose",
                    "id": "g6zqdqw",
                    "parent_id": "t1_g6zil27",
                    "score": 7,
                    "created_utc": 1601325331.0,
                    "replies": [
                        {
                            "body": "Like end of season one of “the boys” dark, haven’t seen black mirror yet, now I’m curious",
                            "author": "KnocDown",
                            "id": "g6zqlbh",
                            "parent_id": "t1_g6zqdqw",
                            "score": 10,
                            "created_utc": 1601325437.0,
                            "replies": [
                                {
                                    "body": "White Christmas is sooo good have you seen it yet?",
                                    "author": "jollifishe",
                                    "id": "i32i8bo",
                                    "parent_id": "t1_g6zqlbh",
                                    "score": 1,
                                    "created_utc": 1648870825.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Ah yep, had that happened before. He either was really fixed, or I'm super barren, but either way after him I never let that happen again. Too risky.",
            "author": "sbgonebroke",
            "id": "g72w7wi",
            "parent_id": "t1_g6zh6h5",
            "score": 2,
            "created_utc": 1601398619.0,
            "replies": []
        },
        {
            "body": "\"I love you\" =My dick loves your pussy",
            "author": "GSSD",
            "id": "g6yymrf",
            "parent_id": "t1_g6ykvzc",
            "score": 40,
            "created_utc": 1601313171.0,
            "replies": [
                {
                    "body": "Ahh, is that why I only say it while in the throes?",
                    "author": null,
                    "id": "g70uxu8",
                    "parent_id": "t1_g6yymrf",
                    "score": 5,
                    "created_utc": 1601348079.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Oh, that's cold and dark.",
            "author": null,
            "id": "g70uvoq",
            "parent_id": "t1_g6ykvzc",
            "score": 6,
            "created_utc": 1601348043.0,
            "replies": []
        },
        {
            "body": "Because you’re a nice guy who’s not a scumbag :)\n\nOthers use the line as “let’s have sex and I’ll pay a bill or buy you a purse later” \n\nI know it doesn’t apply to all but it’s painting a bad picture",
            "author": "KnocDown",
            "id": "g6zqbn5",
            "parent_id": "t1_g6zm7ct",
            "score": 13,
            "created_utc": 1601325302.0,
            "replies": []
        },
        {
            "body": "Yes,  perfect",
            "author": "LotBuilder",
            "id": "g6zp8n9",
            "parent_id": "t1_g6z60ss",
            "score": 2,
            "created_utc": 1601324756.0,
            "replies": []
        },
        {
            "body": "Lol",
            "author": "windyorbits",
            "id": "g6zky37",
            "parent_id": "t1_g6z60ss",
            "score": 1,
            "created_utc": 1601322761.0,
            "replies": []
        },
        {
            "body": "I forgot that one, thank you \n\nThat’s more “I’m really busy with work for the next few weeks” = I’ve found someone else but you’re my backup",
            "author": "KnocDown",
            "id": "g6yaxn0",
            "parent_id": "t1_g6yagdv",
            "score": 39,
            "created_utc": 1601302055.0,
            "replies": []
        },
        {
            "body": "Lots of men aren't as honest in these situations.. I make sure to ask every person I talk to if they are married, regardless of what their profile says... SO many put \"Single/Separated/Divorced\" and are actually married when you ask them.. I don't see why they hide it.. But, again, I just always ask so I know..",
            "author": "throwaway517714",
            "id": "g6ydfc3",
            "parent_id": "t1_g6ybfvr",
            "score": 21,
            "created_utc": 1601303470.0,
            "replies": []
        },
        {
            "body": "Lots of men aren't as honest in these situations.. I make sure to ask every person I talk to if they are married, regardless of what their profile says... SO many put \"Single/Separated/Divorced\" and are actually married when you ask them.. I don't see why they hide it.. But, again, I just always ask so I know..",
            "author": "throwaway517714",
            "id": "g6ydhsb",
            "parent_id": "t1_g6ybfvr",
            "score": 7,
            "created_utc": 1601303511.0,
            "replies": []
        },
        {
            "body": "Lots of men aren't as honest in these situations.. I make sure to ask every person I talk to if they are married, regardless of what their profile says... SO many put \"Single/Separated/Divorced\" and are actually married when you ask them.. I don't see why they hide it.. But, again, I just always ask so I know..",
            "author": "throwaway517714",
            "id": "g6ydiru",
            "parent_id": "t1_g6ybfvr",
            "score": 8,
            "created_utc": 1601303523.0,
            "replies": [
                {
                    "body": "How many times are you going to type the same comment???",
                    "author": "genericMaker",
                    "id": "g6z3ko4",
                    "parent_id": "t1_g6ydiru",
                    "score": -8,
                    "created_utc": 1601315319.0,
                    "replies": [
                        {
                            "body": "When you see a comment multiposted that's not the person who did it, it's reddit.",
                            "author": "Sugarbeggar",
                            "id": "g6z8lr5",
                            "parent_id": "t1_g6z3ko4",
                            "score": 15,
                            "created_utc": 1601317484.0,
                            "replies": []
                        },
                        {
                            "body": "I dunno.. As many times as my phone told me \"Reddit had a problem adding your comment..\" \n\nWhy does it bother you so greatly? Obviously I didn't know it multi-posted.. The fuck with people sometimes..🙄😳",
                            "author": "throwaway517714",
                            "id": "g6z4e3c",
                            "parent_id": "t1_g6z3ko4",
                            "score": 10,
                            "created_utc": 1601315662.0,
                            "replies": [
                                {
                                    "body": "A poor craftsman blames his tools.",
                                    "author": "genericMaker",
                                    "id": "g72gate",
                                    "parent_id": "t1_g6z4e3c",
                                    "score": 1,
                                    "created_utc": 1601392425.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": ">  First, am I alone, I don’t mind if you want to dress like a slut/hooker at all. In fact, please do.\n\nNot if we are going out to an upscale restaurant.",
            "author": "SDstartingOut",
            "id": "g6yhkyt",
            "parent_id": "t1_g6ybfvr",
            "score": 13,
            "created_utc": 1601305653.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "g6yjuxr",
                    "parent_id": "t1_g6yhkyt",
                    "score": 8,
                    "created_utc": 1601306734.0,
                    "replies": [
                        {
                            "body": "i’ll take the regular chicken THANK YOU",
                            "author": null,
                            "id": "g6youej",
                            "parent_id": "t1_g6yjuxr",
                            "score": 8,
                            "created_utc": 1601308906.0,
                            "replies": [
                                {
                                    "body": "Ah, yeah, you wouldn't be my SB for long like that.",
                                    "author": "Sugarbeggar",
                                    "id": "g6z8pjb",
                                    "parent_id": "t1_g6youej",
                                    "score": 0,
                                    "created_utc": 1601317529.0,
                                    "replies": [
                                        {
                                            "body": "it was a joke, have a sense of humor.",
                                            "author": null,
                                            "id": "g7024td",
                                            "parent_id": "t1_g6z8pjb",
                                            "score": 2,
                                            "created_utc": 1601331577.0,
                                            "replies": [
                                                {
                                                    "body": "Some things you just don't joke about...",
                                                    "author": "Sugarbeggar",
                                                    "id": "g703wgj",
                                                    "parent_id": "t1_g7024td",
                                                    "score": 0,
                                                    "created_utc": 1601332588.0,
                                                    "replies": [
                                                        {
                                                            "body": "summer down a little. i don’t like spicy food, it was nothing more than a harmless joke. sorry to have offended you",
                                                            "author": null,
                                                            "id": "g71i50k",
                                                            "parent_id": "t1_g703wgj",
                                                            "score": 2,
                                                            "created_utc": 1601367588.0,
                                                            "replies": [
                                                                {
                                                                    "body": "he was being sarcastic i think",
                                                                    "author": "sbgonebroke",
                                                                    "id": "g72x1pb",
                                                                    "parent_id": "t1_g71i50k",
                                                                    "score": 1,
                                                                    "created_utc": 1601398952.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Haha, the Baconator strikes again.",
                            "author": "DFWCouple4SB",
                            "id": "g6yls3h",
                            "parent_id": "t1_g6yjuxr",
                            "score": 3,
                            "created_utc": 1601307580.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I have never had any one complain about how I am dressed.. But have had more men \"request things they'd like me to wear\"... I try not to be TOO slutty-dressed for the M&G.. B.C. it can be a little \"desperate looking\"... Different strokes for different folks..🤷",
            "author": "NattyLiteSaber",
            "id": "g6z1vcr",
            "parent_id": "t1_g6ybfvr",
            "score": 5,
            "created_utc": 1601314594.0,
            "replies": [
                {
                    "body": "I once had a guy keep saying he wanted me to dress \"classy and professional like a coworker so that the age difference doesn't turn heads\", and then upon me showing him some of my outfits, complained that each one was \"not a short enough skirt, got any mini skirts?\" or \"that doesn't show enough cleavage for me. got any more tight clothes?\"\n\nTemporary hit to my self esteem after buying so many more \"classy clothes\", but clearly the man wasn't aware that \"I don't want anyone to assume you're a sugar baby or think something sexual is going on, so dress like an intern, or a colleague\" and \"I want you to show up to dates wearing above thigh skirts/cleavage showing skin tight clothing\" are... two dramatically different statements.",
                    "author": "sbgonebroke",
                    "id": "g72wvvc",
                    "parent_id": "t1_g6z1vcr",
                    "score": 1,
                    "created_utc": 1601398887.0,
                    "replies": [
                        {
                            "body": "Lol.. Yeah... Men and their porn ideas...🙄🙄🙄 \n\nSounds good. But doesn't work in reality...\n\nI'd be like.. So... Should I be professional or a slutty professional? The skirt hikes up the same no matter how short it is..🤷",
                            "author": "NattyLiteSaber",
                            "id": "g72yqy7",
                            "parent_id": "t1_g72wvvc",
                            "score": 1,
                            "created_utc": 1601399672.0,
                            "replies": []
                        },
                        {
                            "body": "I just bring a change of clothes and once we get to a hotel room.. I can change... Lol... I've had one SD send me a list of all the outfits he'd like to see me in.. So.. I just pack a bag.. Aside from dinner and drinks we are usually in a hotel room anyways.",
                            "author": "NattyLiteSaber",
                            "id": "g72z6qp",
                            "parent_id": "t1_g72wvvc",
                            "score": 1,
                            "created_utc": 1601399876.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yes being honest about the married thing is the way to go.",
            "author": "highjinx411",
            "id": "g70hgmo",
            "parent_id": "t1_g6ybfvr",
            "score": 3,
            "created_utc": 1601340635.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "g6zf96y",
            "parent_id": "t1_g6z424t",
            "score": 9,
            "created_utc": 1601320362.0,
            "replies": [
                {
                    "body": "That's about what I expected. I guess the original comment was more \"what this really means\", and not automatically being against it.",
                    "author": "my_NSFW_posts",
                    "id": "g6zppkm",
                    "parent_id": "t1_g6zf96y",
                    "score": 2,
                    "created_utc": 1601324992.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "😂👏",
            "author": "sugardad123",
            "id": "j6nkj6z",
            "parent_id": "t1_g72ykru",
            "score": 1,
            "created_utc": 1675182700.0,
            "replies": []
        },
        {
            "body": "See, I said this and I got trashed by this community. Apparently wanting to go to a nice dinner for a M&G is not acceptable in some cities (pre covid) and the “grab a coffee” date is like the new sugar speed dating go to event ....",
            "author": "KnocDown",
            "id": "g6zb3vm",
            "parent_id": "t1_g6zahn3",
            "score": 19,
            "created_utc": 1601318597.0,
            "replies": [
                {
                    "body": ">I said this and I got trashed by this community.\n\nThat doesn't mean that you are wrong.",
                    "author": "denardos",
                    "id": "g6zhk9l",
                    "parent_id": "t1_g6zb3vm",
                    "score": 11,
                    "created_utc": 1601321328.0,
                    "replies": []
                },
                {
                    "body": "I don’t see why they would trash you. Coffee dates are low effort and if you are in this lifestyle as a woman you put a lot into your look on a date... just for it to be coffee? I prefer dinner or lunch but to each his own",
                    "author": "citygurlll",
                    "id": "g712myt",
                    "parent_id": "t1_g6zb3vm",
                    "score": 5,
                    "created_utc": 1601353072.0,
                    "replies": [
                        {
                            "body": ">I don’t see why they would trash you. Coffee dates are low effort and if you are in this lifestyle as a woman you put a lot into your look on a date... just for it to be coffee? I prefer dinner or lunch but to each his own\n\nI generally agree, though the last two whales I went out with (one is now my amazing SD) both asked me on coffee dates. The way I made it worth my time was to book them on the same day I already had a dinner date with another POT so I didn't waste the time getting ready 'just for coffee'.",
                            "author": "LVSugarBebe",
                            "id": "g78n14p",
                            "parent_id": "t1_g712myt",
                            "score": 3,
                            "created_utc": 1601514422.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "I think it's only sensible that the first meeting is something that can realistically be ended in 15-20 minutes should chemistry be completely bad or other issues (i.e. either or both parties lied in their profiles/photos and the initial interaction).  \nBut if it works for you...",
                    "author": "Lov3rm4n",
                    "id": "g6zgs3g",
                    "parent_id": "t1_g6zb3vm",
                    "score": 10,
                    "created_utc": 1601321014.0,
                    "replies": [
                        {
                            "body": "You shouldn’t go in with that mindset. Even if chemistry is bad you can leave if it’s dinner or lunch lol no one should be holding you hostage.",
                            "author": "citygurlll",
                            "id": "g712qnr",
                            "parent_id": "t1_g6zgs3g",
                            "score": 6,
                            "created_utc": 1601353146.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "The Daddies that say they don’t want to be transactional in my experience have offered to pay for unique experiences... then after one or two lunch outings I realize all we are doing is having sex.  I’m a SB to bring value added to my life as I bring it to their life. \n\nMy area seems to be PPM, even my regulars have refused an allowance even when I point out they may save money 🤷‍♀️ I have one SD I’ve been seeing off and on for over a year. He pays good each date. In his mind we meet every other week, but sometimes it’s 5 times a month. I’ve proposed X per month  which would equal to being less than 3 visits and he ended up taking a break🤦🏼‍♀️ Good news is he’s recently contacted me to meet soon.",
            "author": "Copperdelight",
            "id": "g6yz0xd",
            "parent_id": "t1_g6yoodo",
            "score": 4,
            "created_utc": 1601313346.0,
            "replies": [
                {
                    "body": "It is a trust issue.  I usually start PPM but want to move to allowance as quickly as possible.  \n\nWith PPM you believe you won't be \"ripped off\" by prepaying.  You pay as you meet.  With allowance someone has to take the leap of faith and it should be the SD.  So you prepay for a period of time and hope the person lives up to their end of the agreement, whatever it is.",
                    "author": "craa141",
                    "id": "g7008my",
                    "parent_id": "t1_g6yz0xd",
                    "score": 6,
                    "created_utc": 1601330505.0,
                    "replies": [
                        {
                            "body": "Thank you for giving me that perspective!",
                            "author": "Copperdelight",
                            "id": "g70ao5k",
                            "parent_id": "t1_g7008my",
                            "score": 3,
                            "created_utc": 1601336660.0,
                            "replies": [
                                {
                                    "body": "I agree with the SD who replied. Also, consider proposing a bi-weekly or weekly allowance instead and then working up to monthly once trust is established. Inform him that 1) you just feel awkward with the envelope exchange during the date and 2) that it helps you to have something consistent, even if it's slightly less.\n\nThe other option is to try to set the same time each week with him and schedule in advance so it's on both of your schedules to look forward to, and you know you'll be taken care of.",
                                    "author": "LVSugarBebe",
                                    "id": "g78nqdh",
                                    "parent_id": "t1_g70ao5k",
                                    "score": 2,
                                    "created_utc": 1601514830.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "I see you may have posted a number which is most likely an amount in relations to an arrangement. If this is the case, you are violating Rule#4 - \"No dollar amounts that are in reference to allowance/PPM are allowed.\"\n\n\nIf you are curious about Allowances reported by SLF contributors please see the [Allowance Master Thread 2019-2020](https://www.reddit.com/r/sugarlifestyleforum/comments/dezl91/allowance_master_thread_20192020/?utm_source=reddit&utm_medium=usertext&utm_name=sugarlifestyleforum&utm_content=t3_dnk455)\n\nYour post will not be approved until you remove the amount.  Please read the sub [Rules](https://www.reddit.com/r/sugarlifestyleforum/comments/748zta/updated_and_clarified_rules_for_slf/) prior to posting anything else. \n\nIf you simply posted a number not referencing a monetary amount, please message the MODs to approve your post.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/sugarlifestyleforum) if you have any questions or concerns.*",
                    "author": "AutoModerator",
                    "id": "g6yz0z6",
                    "parent_id": "t1_g6yz0xd",
                    "score": 1,
                    "created_utc": 1601313346.0,
                    "replies": [
                        {
                            "body": "I did not break rules",
                            "author": "Copperdelight",
                            "id": "gc0qitm",
                            "parent_id": "t1_g6yz0z6",
                            "score": 1,
                            "created_utc": 1605164221.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Agreed about transactional. It means I don't want PPM and want to do allowance instead.\n\nAs for drama, I don't tell an SB I don't want someone who's dramatic, I just stop seeing her if it's too much. There's not much point in saying something. A dramatic person can't help it very much, that's just who they are.",
            "author": "thothamon",
            "id": "g6yvq8l",
            "parent_id": "t1_g6yoodo",
            "score": 4,
            "created_utc": 1601311937.0,
            "replies": []
        },
        {
            "body": "> “I don’t want it to feel transactional” -- I really don't\n\nSure, nobody does, but I think this is one of those phrases with special meaning in the sugar bowl, just like \"I know my worth\". There is nothing wrong with those, taken literally, but 99% of the time they're code for something else.",
            "author": "SkepticalChallenge",
            "id": "g6zjy74",
            "parent_id": "t1_g6yl6e1",
            "score": 7,
            "created_utc": 1601322337.0,
            "replies": [
                {
                    "body": "I get that. There is no way for me to take \"I know my worth\" well, though. Whereas if I say to her \"I don't want this to be transactional\"... the next words out of my mouth will make it clear I'm sincere.",
                    "author": "marker3000",
                    "id": "g70cdyy",
                    "parent_id": "t1_g6zjy74",
                    "score": 2,
                    "created_utc": 1601337694.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "g6z8jha",
            "parent_id": "t1_g6yl6e1",
            "score": 5,
            "created_utc": 1601317454.0,
            "replies": [
                {
                    "body": "For me certain cuisines are just not my favorites. I don't care if the restaurant is cheap or pricey in those cuisines!\n\nAnd, really, I have never wanted to sleep with her friend. Except one M&G where she brought the friend. And it wasn't close as to which one was the more attractive.",
                    "author": "marker3000",
                    "id": "g6zb6x6",
                    "parent_id": "t1_g6z8jha",
                    "score": 3,
                    "created_utc": 1601318635.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Agreed on all that, except I might well want to sleep with her cute friend. 😂",
            "author": "thothamon",
            "id": "g6ywbzy",
            "parent_id": "t1_g6yl6e1",
            "score": 0,
            "created_utc": 1601312188.0,
            "replies": []
        },
        {
            "body": "Make it!",
            "author": "angelhair12",
            "id": "g6ywbnd",
            "parent_id": "t1_g6yhi5h",
            "score": 7,
            "created_utc": 1601312184.0,
            "replies": []
        },
        {
            "body": "I don’t think anyone would ever confuse a Vegan place with being expensive :)",
            "author": "KnocDown",
            "id": "g6ylptk",
            "parent_id": "t1_g6ylcak",
            "score": 14,
            "created_utc": 1601307554.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "g6z8ma0",
                    "parent_id": "t1_g6ylptk",
                    "score": 6,
                    "created_utc": 1601317490.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "g6zkcln",
                            "parent_id": "t1_g6z8ma0",
                            "score": -1,
                            "created_utc": 1601322504.0,
                            "replies": [
                                {
                                    "body": "Your $80 tofu is served madam. \n\nI have gone a lot for the alt SBs. You somehow have to be both open to woke vegan restaurants and be willing to spend a lot to show you’re a serious SD. Oh the amount of meat substitutes I’ve eaten for sugar...",
                                    "author": null,
                                    "id": "g6znwhy",
                                    "parent_id": "t1_g6zkcln",
                                    "score": 2,
                                    "created_utc": 1601324088.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Do you use these lines and feel dirty now? Bc i assure you guys who are real SD find this post hilarious!",
            "author": "angelhair12",
            "id": "g6ywkd8",
            "parent_id": "t1_g6ys568",
            "score": 15,
            "created_utc": 1601312285.0,
            "replies": [
                {
                    "body": "A hit dog will holler... 😏",
                    "author": "Consistent-Sorbet-51",
                    "id": "g6z1yf4",
                    "parent_id": "t1_g6ywkd8",
                    "score": 12,
                    "created_utc": 1601314630.0,
                    "replies": []
                },
                {
                    "body": "As a matter of fact, I have not used any of those lines, with the exception of the most ridiculous one there - “I don’t like that type of restaurant” - because believe it or not, there are some restaurants that I don’t like. \n\nWhile I haven’t used the phrase, no one in a real SR wants it to feel transactional.   While I haven’t done it myself, many people are intimate right after the M&G and go beyond a hookup.",
                    "author": "UseTheForceRey",
                    "id": "g6z433v",
                    "parent_id": "t1_g6ywkd8",
                    "score": 0,
                    "created_utc": 1601315536.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Btw you were outed by your own gender. Believe it or not OP is a man 😫",
            "author": "angelhair12",
            "id": "g6ywzez",
            "parent_id": "t1_g6ys568",
            "score": 12,
            "created_utc": 1601312461.0,
            "replies": [
                {
                    "body": "I am aware that the poster is an SD, and I stand by my point.",
                    "author": "UseTheForceRey",
                    "id": "g6z3npt",
                    "parent_id": "t1_g6ywzez",
                    "score": 1,
                    "created_utc": 1601315355.0,
                    "replies": [
                        {
                            "body": "You can’t teach an old dog new tricks.",
                            "author": "angelhair12",
                            "id": "g6z5lhb",
                            "parent_id": "t1_g6z3npt",
                            "score": 1,
                            "created_utc": 1601316180.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I think it's half-satire, and we could easily come up with a similar list for SBs. Having said that, I do share your distaste for smearing men as a group. If you wouldn't make a statement about Jews, African-Americans, or women because it would be a bigoted statement, then it's still bigoted if you say it about men.",
            "author": "thothamon",
            "id": "g6yw54n",
            "parent_id": "t1_g6ys568",
            "score": 0,
            "created_utc": 1601312106.0,
            "replies": []
        },
        {
            "body": "lol so true",
            "author": "UnearthlyDinosaur",
            "id": "g6zcw6r",
            "parent_id": "t1_g6ys568",
            "score": 0,
            "created_utc": 1601319362.0,
            "replies": []
        },
        {
            "body": "OP makes extreme conclusions that while can be truthful some of the time aren't truthful all the time. Not to mention he's a 9/11 truther.",
            "author": "lemondropsman",
            "id": "g6yeiy4",
            "parent_id": "t1_g6yb83m",
            "score": -3,
            "created_utc": 1601304068.0,
            "replies": [
                {
                    "body": "While I have zero respect for 9/11 truthers, I think it’s okay to compartmentalize and view this post for what it was: one SD’s take on the phony lines often used by POTs to hoodwink naive SB POTs. I thought it was mostly humorous, with a kernel of truth buried in each line. \n\nThere have been so many new SB posts over the last couple of weeks, many telling stories that make a Bowl veteran’s skin crawl, that OP is providing a reasonable, somewhat humorous lampoon of the caricature of the crappy “SD wannabes” (or worse) who can make the Bowl treacherous, lecherous, and not so fun.",
                    "author": null,
                    "id": "g6yjn0q",
                    "parent_id": "t1_g6yeiy4",
                    "score": 9,
                    "created_utc": 1601306634.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Knocdown is ...... ah nevermind you figure it out.",
            "author": "highfructoseSD",
            "id": "g71azs2",
            "parent_id": "t1_g6ztres",
            "score": 1,
            "created_utc": 1601360213.0,
            "replies": []
        },
        {
            "body": "I’m a guy and I’m feeling bad for all the new people in the forum these last 2 weeks that seem to be falling for all the classic lines or be taken advantage of \n\nBut please continue to complain like the other guy that you are special and use these lines without meaning harm",
            "author": "KnocDown",
            "id": "g6ybnou",
            "parent_id": "t1_g6ybgmr",
            "score": 33,
            "created_utc": 1601302471.0,
            "replies": [
                {
                    "body": "No, this entire post is garbage.\n\nIf I was seeking something transactional, I'd hire an escort. The lack of transactional feels comment comes from handing straight cash to someone. I pay my SB's rent, and both of us have repeatedly said to one another we don't want things to feel transactional.\n\nMaybe we should slow things down is also something we both have said to one another, because the emotional connection is strong and catching feels is a bit dangerous. \n\nNot wanting a girl who causes drama is the hallmark of an effective SR for many men, who actively are married or have families/careers that a SB could jeopardize if their SR were to be made public.\n\nIf a SB decides on a M+G she wants to come back to a place, she should bring up $. \n\nI buy my SB very nice clothes. She doesn't dress like a hooker, she's giving her doctoral thesis, applying for jobs, and working. She literally needs nice clothes for her life to function correctly.\n\nI hate italian food. I tell my SB all the time I don't like \"that type\" of restaurant, yet we had a $1200 tab the last time we went out to eat.\n\nAnd yeah, less public SRs are pretty common.\n\n\nYour post grossly generalizes SDs. It's not helpful, it's deceitful, dishonest, and paints you like a SIMP.",
                    "author": "cleanandjerks19",
                    "id": "g6yc80z",
                    "parent_id": "t1_g6ybnou",
                    "score": -18,
                    "created_utc": 1601302789.0,
                    "replies": [
                        {
                            "body": "JFC dude.  These are all extremely common. \n\nHe didn’t say anything about you, it wasn’t personal.  \n\nCalling him a simp..good job drama queen",
                            "author": "BGDDDY1",
                            "id": "g6ycqkn",
                            "parent_id": "t1_g6yc80z",
                            "score": 27,
                            "created_utc": 1601303080.0,
                            "replies": [
                                {
                                    "body": "Sorry - did I say these weren't common? Of course they're common. They also grossly misrepresent what each individual means when they say them. They're also, oddly enough, things many SB's say to POT SD's. To suggest \"I don't like that kind of restaurant\" means \"I'm a cheap ass\" is silly. To suggest wanting a private SR is some type of sin, when nearly all effective SR's have some level of discretion and privacy, is a misrepresentation of SR dating to begin with.\n\nTo suggest not wanting something to feel transactional means anything other than both parties not wanting it to feel like prostitution is dishonest. This is the hallmark of SA, and literally any conversation I have ever had with POTs. Nobody wants it to feel transactional. \n\nSuggesting to your SB you want to buy her nice clothes doesn't mean you think she dresses like a hooker, it could just mean I want to buy you something nice. \n\nAnd again, I very specifically stated that OP was generalizing SD's. I never implied his post was an attack on me, in fact, HE implied his post was an attack on me.",
                                    "author": "cleanandjerks19",
                                    "id": "g6ydsn6",
                                    "parent_id": "t1_g6ycqkn",
                                    "score": -12,
                                    "created_utc": 1601303664.0,
                                    "replies": [
                                        {
                                            "body": "The truth via “Tongue in cheek”..look it up & try putting on a sense of humor 🤷‍♂️",
                                            "author": "BGDDDY1",
                                            "id": "g6yecp4",
                                            "parent_id": "t1_g6ydsn6",
                                            "score": 11,
                                            "created_utc": 1601303970.0,
                                            "replies": [
                                                {
                                                    "body": "OP has repeatedly suggested this is a list meant to be helpful. There's no tongue in cheek implied by the OP.",
                                                    "author": "cleanandjerks19",
                                                    "id": "g6yfdn4",
                                                    "parent_id": "t1_g6yecp4",
                                                    "score": 3,
                                                    "created_utc": 1601304535.0,
                                                    "replies": [
                                                        {
                                                            "body": "Guarantee you if we took a vote on whether you chuckled when you read post most would say yes.",
                                                            "author": "BGDDDY1",
                                                            "id": "g6yxpz3",
                                                            "parent_id": "t1_g6yfdn4",
                                                            "score": 2,
                                                            "created_utc": 1601312777.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "You are literally the reason the other young lady inspired me to make my post :)",
                            "author": "KnocDown",
                            "id": "g6ycf01",
                            "parent_id": "t1_g6yc80z",
                            "score": 13,
                            "created_utc": 1601302899.0,
                            "replies": [
                                {
                                    "body": "Odd. Going 3 years strong with an SB. She sure doesn't seem to mind almost any of the things you've posted. \n\nSure. Are there SDs who suck? Absolutely. All this post did was generalize SD's.",
                                    "author": "cleanandjerks19",
                                    "id": "g6ycnra",
                                    "parent_id": "t1_g6ycf01",
                                    "score": -3,
                                    "created_utc": 1601303035.0,
                                    "replies": [
                                        {
                                            "body": "You are flexing way too hard, have a nice day",
                                            "author": "KnocDown",
                                            "id": "g6ycv5i",
                                            "parent_id": "t1_g6ycnra",
                                            "score": 21,
                                            "created_utc": 1601303149.0,
                                            "replies": [
                                                {
                                                    "body": "😂😂😂",
                                                    "author": "macaroonqueen",
                                                    "id": "g6yf7zr",
                                                    "parent_id": "t1_g6ycv5i",
                                                    "score": 8,
                                                    "created_utc": 1601304451.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I always wondered about that. How involved should one get without it getting to personal...or something like that.",
            "author": "eshtahnohs",
            "id": "g70l7w9",
            "parent_id": "t1_g6zr6rg",
            "score": 9,
            "created_utc": 1601342681.0,
            "replies": [
                {
                    "body": "I just follow the girls lead within what we want.  I’m adaptable.  I have had SB’s that stayed very private and secretive for years and I had another one where I was at her family BBQ about a month in.  They all are different.",
                    "author": "LotBuilder",
                    "id": "g70n53n",
                    "parent_id": "t1_g70l7w9",
                    "score": 15,
                    "created_utc": 1601343697.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "My other favorite rebuttal to “I don’t have a problem getting sex without paying for it”\n\nMe: “And I don’t have a problem finding a rich, attractive, and attentive young man to date/marry who will share all of his life with me.”",
            "author": "LVSugarBebe",
            "id": "g6znjur",
            "parent_id": "t1_g6zlwuy",
            "score": 51,
            "created_utc": 1601323913.0,
            "replies": [
                {
                    "body": "[removed]",
                    "author": null,
                    "id": "g70jz0b",
                    "parent_id": "t1_g6znjur",
                    "score": 11,
                    "created_utc": 1601342001.0,
                    "replies": [
                        {
                            "body": "Call me an idiot but maybe I just have a thing for older men with education, life experience, and emotional security and do not need marriage to feel a genuine and long-lasting connection with another person.",
                            "author": "LVSugarBebe",
                            "id": "g78ogfr",
                            "parent_id": "t1_g70jz0b",
                            "score": 3,
                            "created_utc": 1601515238.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": ">“I don’t have a problem getting sex without paying for it”\n\nThey say this when they are on an arrangement website or dating website or in-person meeting? If an arrangement dating website that literally makes zero sense for him to say that!",
                    "author": null,
                    "id": "g736wv7",
                    "parent_id": "t1_g6znjur",
                    "score": 3,
                    "created_utc": 1601403312.0,
                    "replies": [
                        {
                            "body": "A guy will say this on a seeking site, I've seen it SEVERAL times in their profiles as well. Their justification is 'I'm too busy for a relationship so I'm on here.' More often than not you'll see it in profiles of men under 40. Sometimes they're attractive, sometimes they're not.  \n\n\nThey lead with 'I don't have a problem getting sex without paying for it' to either set an expectation anchor for the SB that she's not getting an allowance or to make them feel better about being on the site. Regardless, the conversation generally leads to the fact that they want to put in the minimum effort (paying for coffee/dinner) in order to get an on-demand booty-call girlfriend without any of the commitment or emotional expectation of an ongoing relationship.  \n\n\nThese guys may genuinely not have problems meeting women, but they want to get to sex as quickly as possible or lower the risk of multiple encounters with random women. My observation is that the really attractive and successful men have some other problem with their personality or lifestyle that prevents them from finding women who can fulfill this need in their vanilla dating life.",
                            "author": "LVSugarBebe",
                            "id": "g777x4u",
                            "parent_id": "t1_g736wv7",
                            "score": 1,
                            "created_utc": 1601490348.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "I am having an experience that I think is deja vu? I'm not sure but its  like an out of body experience seeing your username and a comment I would say!",
                    "author": "MJline",
                    "id": "g70wd4s",
                    "parent_id": "t1_g6znjur",
                    "score": 2,
                    "created_utc": 1601348897.0,
                    "replies": []
                },
                {
                    "body": ">Me: “And I don’t have a problem finding a rich, attractive, and attentive young man to date/marry who will share all of his life with me.”\n\nGood for you, but plenty of SBs do struggle with this. Rich men mostly marry rich women, specially because of the many assets that have to be shared.\n\nSo many women mistake having sex with a rich attractive guy for \"he will share all of his life with me\".\n\nThere just aren't enough rich men (not even countering attractive) for all the women that want to date one.",
                    "author": "AdAlternative6041",
                    "id": "g6zwvf9",
                    "parent_id": "t1_g6znjur",
                    "score": 6,
                    "created_utc": 1601328658.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "True.\n\nBut that logic is also a double edged sword.",
            "author": null,
            "id": "g6zp3d1",
            "parent_id": "t1_g6zlwuy",
            "score": 7,
            "created_utc": 1601324682.0,
            "replies": []
        },
        {
            "body": "That's only if you're a weak man with low standards",
            "author": "Status_Let_3850",
            "id": "hrerxnx",
            "parent_id": "t1_g70ujyg",
            "score": 1,
            "created_utc": 1641419701.0,
            "replies": []
        },
        {
            "body": "Cause they wanna take you home later and bang you on your couch without having to get a hotel... I dunno tho otherwise.  I just don't like new SDs knowing where I live bc I have had issues with stalkers in the past and I enjoy having that privacy.. Any guy I meet on SA that wants to come to my house and hang out strikes me as cheap.. We can hang out in a nice bar or hotel room.. Not my house. No way.",
            "author": "NattyLiteSaber",
            "id": "g6zkt4w",
            "parent_id": "t1_g6zk75j",
            "score": 21,
            "created_utc": 1601322703.0,
            "replies": [
                {
                    "body": "I don't like new SDs knowing where I live.  I let my one SD know where I lived after 4 months of consistent dating because he was so adamant on picking me up and dropping me off so I could drink with him (yeah, I know, I know).  He's always been super respectful about not inviting himself in (I made it clear it's never going to happen), and I don't think he'd stalk me.  But I still wish I'd never given in to the pressure.  He has absolutely zero concept of discretion.  When he shows up he tries to kiss me because \"I've missed you so much, I just can't wait for a kiss\"... right in front of my 80+ year old neighbour's living room window.  He's generally a great SD, reliable, generous, respectful, and he treats me really well. He just has absolutely no class or concept of the idea that maybe PDA isn't appropriate in the extremely conservative neighbourhood I live in, especially not in front of the nosiest neighbour on my street (she's retired and as far as I can tell has no friends or hobbies besides spying on the entire street, lol).",
                    "author": "JustKittenxo",
                    "id": "g6zlwa4",
                    "parent_id": "t1_g6zkt4w",
                    "score": 16,
                    "created_utc": 1601323161.0,
                    "replies": [
                        {
                            "body": "Girl... I live in a whole neighborhood of Bessie's like that! They would lose their shit...😂 I feel like they are judging me just because I am leaving after dark to go out like some wild woman..😂",
                            "author": "NattyLiteSaber",
                            "id": "g6zrwt2",
                            "parent_id": "t1_g6zlwa4",
                            "score": 15,
                            "created_utc": 1601326095.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Scammers will often ask for gas or Uber money up front.  Then you get into the standoff of picking them up or sending an Uber from my account... but for their privacy they just want you to Venmo $50... blah blah blah.  It’s a pain.",
            "author": "LotBuilder",
            "id": "g6zld71",
            "parent_id": "t1_g6zk75j",
            "score": 15,
            "created_utc": 1601322935.0,
            "replies": [
                {
                    "body": "I can understand being worried about the scammers and not wanting to send money upfront.  I do wish they'd just offer to give a small gift when I arrive to cover travel expenses (or offer to meet me when I park and pay for it).  [By far my best M&G date was with a person who texted me while I was on my way there letting me know to just tell valet parking my name when I arrived and he'd already handled the cost... just such a sweet and thoughtful way to start off our first meeting and he was even sweeter and more thoughtful during the date.]",
                    "author": "JustKittenxo",
                    "id": "g6znpkv",
                    "parent_id": "t1_g6zld71",
                    "score": 28,
                    "created_utc": 1601323993.0,
                    "replies": [
                        {
                            "body": "I always tell them I will give them money when we meet but I don’t send cash to strangers.  Did it twice and both ghosted and blocked.  It’s a shame because I know there are honest girls out there that just don’t want to risk getting stood up and spending money they don’t have.",
                            "author": "LotBuilder",
                            "id": "g6zoibs",
                            "parent_id": "t1_g6znpkv",
                            "score": 11,
                            "created_utc": 1601324394.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Perhaps it is just an old school thing? I think they forget that times are different nowadays and especially women need to have their guard up. In a perfect world, I would love to be offered a ride and feel safe accepting it. But better safe than sorry, right?",
            "author": "w4termelonsug4r",
            "id": "g700y7y",
            "parent_id": "t1_g6zk75j",
            "score": 5,
            "created_utc": 1601330909.0,
            "replies": []
        },
        {
            "body": "Cheap",
            "author": null,
            "id": "g6zkl2f",
            "parent_id": "t1_g6zk75j",
            "score": 5,
            "created_utc": 1601322604.0,
            "replies": []
        },
        {
            "body": "Lol... I think the SBs have far more experience with these bullshit lines and what they REALLY mean..🙄",
            "author": "NattyLiteSaber",
            "id": "g6ykpam",
            "parent_id": "t1_g6yk25x",
            "score": 5,
            "created_utc": 1601307108.0,
            "replies": []
        },
        {
            "body": "I mean... Yeah there is plenty of crazy on both sides...but, most of the times that \"crazy\" gets triggered by one person not keeping up their end of things... I am sure the crazy, jealous side chick exists.. But, so does the 3-date-cheapskate-SD...",
            "author": "NattyLiteSaber",
            "id": "g6zvzaa",
            "parent_id": "t1_g6zvnm8",
            "score": 9,
            "created_utc": 1601328186.0,
            "replies": [
                {
                    "body": "That's not at all what you implied in your comment. You basically said that men can't be stalked, it must all be cheap SDs than ran off without paying.",
                    "author": "AdAlternative6041",
                    "id": "g704esq",
                    "parent_id": "t1_g6zvzaa",
                    "score": -1,
                    "created_utc": 1601332889.0,
                    "replies": [
                        {
                            "body": "I didn't imply anything.. I stated what I stated... Actually I didn't say a thing about guys being stalked... At all... Not one reference..\n\nI am talking about what an SD says to new prospective women when asked about their previous relationships... So... I don't really know why you're talking about men being stalked.. Pretty sure men get stalked, too.. 🤷 \n\n\nBUT, in, MY experience... That girl was not crazy OR a stalker... But, \"I was cheap and she got pissed when I didn't pay her what we discussed then blew my phone up.. So, I blocked her for trying to get money that was owed to her\"... That doesn't sound as good to a new girl to scam... So, they just call every girl they have been with in the past.. \"Crazy\" or \"A stalker\" bc they got ripped off by some douchebag....🙄",
                            "author": "NattyLiteSaber",
                            "id": "g70620g",
                            "parent_id": "t1_g704esq",
                            "score": 7,
                            "created_utc": 1601333858.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Even single ones 😂😂",
            "author": "PioneerExperience",
            "id": "g70bord",
            "parent_id": "t1_g6zjv96",
            "score": 2,
            "created_utc": 1601337274.0,
            "replies": []
        },
        {
            "body": "Like the first five minutes of a Disney-Pixar film dark? Or Black Mirror dark?",
            "author": "pygmalionsrose",
            "id": "g6zqdqw",
            "parent_id": "t1_g6zil27",
            "score": 7,
            "created_utc": 1601325331.0,
            "replies": [
                {
                    "body": "Like end of season one of “the boys” dark, haven’t seen black mirror yet, now I’m curious",
                    "author": "KnocDown",
                    "id": "g6zqlbh",
                    "parent_id": "t1_g6zqdqw",
                    "score": 10,
                    "created_utc": 1601325437.0,
                    "replies": [
                        {
                            "body": "White Christmas is sooo good have you seen it yet?",
                            "author": "jollifishe",
                            "id": "i32i8bo",
                            "parent_id": "t1_g6zqlbh",
                            "score": 1,
                            "created_utc": 1648870825.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Ahh, is that why I only say it while in the throes?",
            "author": null,
            "id": "g70uxu8",
            "parent_id": "t1_g6yymrf",
            "score": 5,
            "created_utc": 1601348079.0,
            "replies": []
        },
        {
            "body": "How many times are you going to type the same comment???",
            "author": "genericMaker",
            "id": "g6z3ko4",
            "parent_id": "t1_g6ydiru",
            "score": -8,
            "created_utc": 1601315319.0,
            "replies": [
                {
                    "body": "When you see a comment multiposted that's not the person who did it, it's reddit.",
                    "author": "Sugarbeggar",
                    "id": "g6z8lr5",
                    "parent_id": "t1_g6z3ko4",
                    "score": 15,
                    "created_utc": 1601317484.0,
                    "replies": []
                },
                {
                    "body": "I dunno.. As many times as my phone told me \"Reddit had a problem adding your comment..\" \n\nWhy does it bother you so greatly? Obviously I didn't know it multi-posted.. The fuck with people sometimes..🙄😳",
                    "author": "throwaway517714",
                    "id": "g6z4e3c",
                    "parent_id": "t1_g6z3ko4",
                    "score": 10,
                    "created_utc": 1601315662.0,
                    "replies": [
                        {
                            "body": "A poor craftsman blames his tools.",
                            "author": "genericMaker",
                            "id": "g72gate",
                            "parent_id": "t1_g6z4e3c",
                            "score": 1,
                            "created_utc": 1601392425.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "g6yjuxr",
            "parent_id": "t1_g6yhkyt",
            "score": 8,
            "created_utc": 1601306734.0,
            "replies": [
                {
                    "body": "i’ll take the regular chicken THANK YOU",
                    "author": null,
                    "id": "g6youej",
                    "parent_id": "t1_g6yjuxr",
                    "score": 8,
                    "created_utc": 1601308906.0,
                    "replies": [
                        {
                            "body": "Ah, yeah, you wouldn't be my SB for long like that.",
                            "author": "Sugarbeggar",
                            "id": "g6z8pjb",
                            "parent_id": "t1_g6youej",
                            "score": 0,
                            "created_utc": 1601317529.0,
                            "replies": [
                                {
                                    "body": "it was a joke, have a sense of humor.",
                                    "author": null,
                                    "id": "g7024td",
                                    "parent_id": "t1_g6z8pjb",
                                    "score": 2,
                                    "created_utc": 1601331577.0,
                                    "replies": [
                                        {
                                            "body": "Some things you just don't joke about...",
                                            "author": "Sugarbeggar",
                                            "id": "g703wgj",
                                            "parent_id": "t1_g7024td",
                                            "score": 0,
                                            "created_utc": 1601332588.0,
                                            "replies": [
                                                {
                                                    "body": "summer down a little. i don’t like spicy food, it was nothing more than a harmless joke. sorry to have offended you",
                                                    "author": null,
                                                    "id": "g71i50k",
                                                    "parent_id": "t1_g703wgj",
                                                    "score": 2,
                                                    "created_utc": 1601367588.0,
                                                    "replies": [
                                                        {
                                                            "body": "he was being sarcastic i think",
                                                            "author": "sbgonebroke",
                                                            "id": "g72x1pb",
                                                            "parent_id": "t1_g71i50k",
                                                            "score": 1,
                                                            "created_utc": 1601398952.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Haha, the Baconator strikes again.",
                    "author": "DFWCouple4SB",
                    "id": "g6yls3h",
                    "parent_id": "t1_g6yjuxr",
                    "score": 3,
                    "created_utc": 1601307580.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I once had a guy keep saying he wanted me to dress \"classy and professional like a coworker so that the age difference doesn't turn heads\", and then upon me showing him some of my outfits, complained that each one was \"not a short enough skirt, got any mini skirts?\" or \"that doesn't show enough cleavage for me. got any more tight clothes?\"\n\nTemporary hit to my self esteem after buying so many more \"classy clothes\", but clearly the man wasn't aware that \"I don't want anyone to assume you're a sugar baby or think something sexual is going on, so dress like an intern, or a colleague\" and \"I want you to show up to dates wearing above thigh skirts/cleavage showing skin tight clothing\" are... two dramatically different statements.",
            "author": "sbgonebroke",
            "id": "g72wvvc",
            "parent_id": "t1_g6z1vcr",
            "score": 1,
            "created_utc": 1601398887.0,
            "replies": [
                {
                    "body": "Lol.. Yeah... Men and their porn ideas...🙄🙄🙄 \n\nSounds good. But doesn't work in reality...\n\nI'd be like.. So... Should I be professional or a slutty professional? The skirt hikes up the same no matter how short it is..🤷",
                    "author": "NattyLiteSaber",
                    "id": "g72yqy7",
                    "parent_id": "t1_g72wvvc",
                    "score": 1,
                    "created_utc": 1601399672.0,
                    "replies": []
                },
                {
                    "body": "I just bring a change of clothes and once we get to a hotel room.. I can change... Lol... I've had one SD send me a list of all the outfits he'd like to see me in.. So.. I just pack a bag.. Aside from dinner and drinks we are usually in a hotel room anyways.",
                    "author": "NattyLiteSaber",
                    "id": "g72z6qp",
                    "parent_id": "t1_g72wvvc",
                    "score": 1,
                    "created_utc": 1601399876.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "That's about what I expected. I guess the original comment was more \"what this really means\", and not automatically being against it.",
            "author": "my_NSFW_posts",
            "id": "g6zppkm",
            "parent_id": "t1_g6zf96y",
            "score": 2,
            "created_utc": 1601324992.0,
            "replies": []
        },
        {
            "body": ">I said this and I got trashed by this community.\n\nThat doesn't mean that you are wrong.",
            "author": "denardos",
            "id": "g6zhk9l",
            "parent_id": "t1_g6zb3vm",
            "score": 11,
            "created_utc": 1601321328.0,
            "replies": []
        },
        {
            "body": "I don’t see why they would trash you. Coffee dates are low effort and if you are in this lifestyle as a woman you put a lot into your look on a date... just for it to be coffee? I prefer dinner or lunch but to each his own",
            "author": "citygurlll",
            "id": "g712myt",
            "parent_id": "t1_g6zb3vm",
            "score": 5,
            "created_utc": 1601353072.0,
            "replies": [
                {
                    "body": ">I don’t see why they would trash you. Coffee dates are low effort and if you are in this lifestyle as a woman you put a lot into your look on a date... just for it to be coffee? I prefer dinner or lunch but to each his own\n\nI generally agree, though the last two whales I went out with (one is now my amazing SD) both asked me on coffee dates. The way I made it worth my time was to book them on the same day I already had a dinner date with another POT so I didn't waste the time getting ready 'just for coffee'.",
                    "author": "LVSugarBebe",
                    "id": "g78n14p",
                    "parent_id": "t1_g712myt",
                    "score": 3,
                    "created_utc": 1601514422.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I think it's only sensible that the first meeting is something that can realistically be ended in 15-20 minutes should chemistry be completely bad or other issues (i.e. either or both parties lied in their profiles/photos and the initial interaction).  \nBut if it works for you...",
            "author": "Lov3rm4n",
            "id": "g6zgs3g",
            "parent_id": "t1_g6zb3vm",
            "score": 10,
            "created_utc": 1601321014.0,
            "replies": [
                {
                    "body": "You shouldn’t go in with that mindset. Even if chemistry is bad you can leave if it’s dinner or lunch lol no one should be holding you hostage.",
                    "author": "citygurlll",
                    "id": "g712qnr",
                    "parent_id": "t1_g6zgs3g",
                    "score": 6,
                    "created_utc": 1601353146.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "It is a trust issue.  I usually start PPM but want to move to allowance as quickly as possible.  \n\nWith PPM you believe you won't be \"ripped off\" by prepaying.  You pay as you meet.  With allowance someone has to take the leap of faith and it should be the SD.  So you prepay for a period of time and hope the person lives up to their end of the agreement, whatever it is.",
            "author": "craa141",
            "id": "g7008my",
            "parent_id": "t1_g6yz0xd",
            "score": 6,
            "created_utc": 1601330505.0,
            "replies": [
                {
                    "body": "Thank you for giving me that perspective!",
                    "author": "Copperdelight",
                    "id": "g70ao5k",
                    "parent_id": "t1_g7008my",
                    "score": 3,
                    "created_utc": 1601336660.0,
                    "replies": [
                        {
                            "body": "I agree with the SD who replied. Also, consider proposing a bi-weekly or weekly allowance instead and then working up to monthly once trust is established. Inform him that 1) you just feel awkward with the envelope exchange during the date and 2) that it helps you to have something consistent, even if it's slightly less.\n\nThe other option is to try to set the same time each week with him and schedule in advance so it's on both of your schedules to look forward to, and you know you'll be taken care of.",
                            "author": "LVSugarBebe",
                            "id": "g78nqdh",
                            "parent_id": "t1_g70ao5k",
                            "score": 2,
                            "created_utc": 1601514830.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I see you may have posted a number which is most likely an amount in relations to an arrangement. If this is the case, you are violating Rule#4 - \"No dollar amounts that are in reference to allowance/PPM are allowed.\"\n\n\nIf you are curious about Allowances reported by SLF contributors please see the [Allowance Master Thread 2019-2020](https://www.reddit.com/r/sugarlifestyleforum/comments/dezl91/allowance_master_thread_20192020/?utm_source=reddit&utm_medium=usertext&utm_name=sugarlifestyleforum&utm_content=t3_dnk455)\n\nYour post will not be approved until you remove the amount.  Please read the sub [Rules](https://www.reddit.com/r/sugarlifestyleforum/comments/748zta/updated_and_clarified_rules_for_slf/) prior to posting anything else. \n\nIf you simply posted a number not referencing a monetary amount, please message the MODs to approve your post.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/sugarlifestyleforum) if you have any questions or concerns.*",
            "author": "AutoModerator",
            "id": "g6yz0z6",
            "parent_id": "t1_g6yz0xd",
            "score": 1,
            "created_utc": 1601313346.0,
            "replies": [
                {
                    "body": "I did not break rules",
                    "author": "Copperdelight",
                    "id": "gc0qitm",
                    "parent_id": "t1_g6yz0z6",
                    "score": 1,
                    "created_utc": 1605164221.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I get that. There is no way for me to take \"I know my worth\" well, though. Whereas if I say to her \"I don't want this to be transactional\"... the next words out of my mouth will make it clear I'm sincere.",
            "author": "marker3000",
            "id": "g70cdyy",
            "parent_id": "t1_g6zjy74",
            "score": 2,
            "created_utc": 1601337694.0,
            "replies": []
        },
        {
            "body": "For me certain cuisines are just not my favorites. I don't care if the restaurant is cheap or pricey in those cuisines!\n\nAnd, really, I have never wanted to sleep with her friend. Except one M&G where she brought the friend. And it wasn't close as to which one was the more attractive.",
            "author": "marker3000",
            "id": "g6zb6x6",
            "parent_id": "t1_g6z8jha",
            "score": 3,
            "created_utc": 1601318635.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "g6z8ma0",
            "parent_id": "t1_g6ylptk",
            "score": 6,
            "created_utc": 1601317490.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "g6zkcln",
                    "parent_id": "t1_g6z8ma0",
                    "score": -1,
                    "created_utc": 1601322504.0,
                    "replies": [
                        {
                            "body": "Your $80 tofu is served madam. \n\nI have gone a lot for the alt SBs. You somehow have to be both open to woke vegan restaurants and be willing to spend a lot to show you’re a serious SD. Oh the amount of meat substitutes I’ve eaten for sugar...",
                            "author": null,
                            "id": "g6znwhy",
                            "parent_id": "t1_g6zkcln",
                            "score": 2,
                            "created_utc": 1601324088.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "A hit dog will holler... 😏",
            "author": "Consistent-Sorbet-51",
            "id": "g6z1yf4",
            "parent_id": "t1_g6ywkd8",
            "score": 12,
            "created_utc": 1601314630.0,
            "replies": []
        },
        {
            "body": "As a matter of fact, I have not used any of those lines, with the exception of the most ridiculous one there - “I don’t like that type of restaurant” - because believe it or not, there are some restaurants that I don’t like. \n\nWhile I haven’t used the phrase, no one in a real SR wants it to feel transactional.   While I haven’t done it myself, many people are intimate right after the M&G and go beyond a hookup.",
            "author": "UseTheForceRey",
            "id": "g6z433v",
            "parent_id": "t1_g6ywkd8",
            "score": 0,
            "created_utc": 1601315536.0,
            "replies": []
        },
        {
            "body": "I am aware that the poster is an SD, and I stand by my point.",
            "author": "UseTheForceRey",
            "id": "g6z3npt",
            "parent_id": "t1_g6ywzez",
            "score": 1,
            "created_utc": 1601315355.0,
            "replies": [
                {
                    "body": "You can’t teach an old dog new tricks.",
                    "author": "angelhair12",
                    "id": "g6z5lhb",
                    "parent_id": "t1_g6z3npt",
                    "score": 1,
                    "created_utc": 1601316180.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "While I have zero respect for 9/11 truthers, I think it’s okay to compartmentalize and view this post for what it was: one SD’s take on the phony lines often used by POTs to hoodwink naive SB POTs. I thought it was mostly humorous, with a kernel of truth buried in each line. \n\nThere have been so many new SB posts over the last couple of weeks, many telling stories that make a Bowl veteran’s skin crawl, that OP is providing a reasonable, somewhat humorous lampoon of the caricature of the crappy “SD wannabes” (or worse) who can make the Bowl treacherous, lecherous, and not so fun.",
            "author": null,
            "id": "g6yjn0q",
            "parent_id": "t1_g6yeiy4",
            "score": 9,
            "created_utc": 1601306634.0,
            "replies": []
        },
        {
            "body": "No, this entire post is garbage.\n\nIf I was seeking something transactional, I'd hire an escort. The lack of transactional feels comment comes from handing straight cash to someone. I pay my SB's rent, and both of us have repeatedly said to one another we don't want things to feel transactional.\n\nMaybe we should slow things down is also something we both have said to one another, because the emotional connection is strong and catching feels is a bit dangerous. \n\nNot wanting a girl who causes drama is the hallmark of an effective SR for many men, who actively are married or have families/careers that a SB could jeopardize if their SR were to be made public.\n\nIf a SB decides on a M+G she wants to come back to a place, she should bring up $. \n\nI buy my SB very nice clothes. She doesn't dress like a hooker, she's giving her doctoral thesis, applying for jobs, and working. She literally needs nice clothes for her life to function correctly.\n\nI hate italian food. I tell my SB all the time I don't like \"that type\" of restaurant, yet we had a $1200 tab the last time we went out to eat.\n\nAnd yeah, less public SRs are pretty common.\n\n\nYour post grossly generalizes SDs. It's not helpful, it's deceitful, dishonest, and paints you like a SIMP.",
            "author": "cleanandjerks19",
            "id": "g6yc80z",
            "parent_id": "t1_g6ybnou",
            "score": -18,
            "created_utc": 1601302789.0,
            "replies": [
                {
                    "body": "JFC dude.  These are all extremely common. \n\nHe didn’t say anything about you, it wasn’t personal.  \n\nCalling him a simp..good job drama queen",
                    "author": "BGDDDY1",
                    "id": "g6ycqkn",
                    "parent_id": "t1_g6yc80z",
                    "score": 27,
                    "created_utc": 1601303080.0,
                    "replies": [
                        {
                            "body": "Sorry - did I say these weren't common? Of course they're common. They also grossly misrepresent what each individual means when they say them. They're also, oddly enough, things many SB's say to POT SD's. To suggest \"I don't like that kind of restaurant\" means \"I'm a cheap ass\" is silly. To suggest wanting a private SR is some type of sin, when nearly all effective SR's have some level of discretion and privacy, is a misrepresentation of SR dating to begin with.\n\nTo suggest not wanting something to feel transactional means anything other than both parties not wanting it to feel like prostitution is dishonest. This is the hallmark of SA, and literally any conversation I have ever had with POTs. Nobody wants it to feel transactional. \n\nSuggesting to your SB you want to buy her nice clothes doesn't mean you think she dresses like a hooker, it could just mean I want to buy you something nice. \n\nAnd again, I very specifically stated that OP was generalizing SD's. I never implied his post was an attack on me, in fact, HE implied his post was an attack on me.",
                            "author": "cleanandjerks19",
                            "id": "g6ydsn6",
                            "parent_id": "t1_g6ycqkn",
                            "score": -12,
                            "created_utc": 1601303664.0,
                            "replies": [
                                {
                                    "body": "The truth via “Tongue in cheek”..look it up & try putting on a sense of humor 🤷‍♂️",
                                    "author": "BGDDDY1",
                                    "id": "g6yecp4",
                                    "parent_id": "t1_g6ydsn6",
                                    "score": 11,
                                    "created_utc": 1601303970.0,
                                    "replies": [
                                        {
                                            "body": "OP has repeatedly suggested this is a list meant to be helpful. There's no tongue in cheek implied by the OP.",
                                            "author": "cleanandjerks19",
                                            "id": "g6yfdn4",
                                            "parent_id": "t1_g6yecp4",
                                            "score": 3,
                                            "created_utc": 1601304535.0,
                                            "replies": [
                                                {
                                                    "body": "Guarantee you if we took a vote on whether you chuckled when you read post most would say yes.",
                                                    "author": "BGDDDY1",
                                                    "id": "g6yxpz3",
                                                    "parent_id": "t1_g6yfdn4",
                                                    "score": 2,
                                                    "created_utc": 1601312777.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "You are literally the reason the other young lady inspired me to make my post :)",
                    "author": "KnocDown",
                    "id": "g6ycf01",
                    "parent_id": "t1_g6yc80z",
                    "score": 13,
                    "created_utc": 1601302899.0,
                    "replies": [
                        {
                            "body": "Odd. Going 3 years strong with an SB. She sure doesn't seem to mind almost any of the things you've posted. \n\nSure. Are there SDs who suck? Absolutely. All this post did was generalize SD's.",
                            "author": "cleanandjerks19",
                            "id": "g6ycnra",
                            "parent_id": "t1_g6ycf01",
                            "score": -3,
                            "created_utc": 1601303035.0,
                            "replies": [
                                {
                                    "body": "You are flexing way too hard, have a nice day",
                                    "author": "KnocDown",
                                    "id": "g6ycv5i",
                                    "parent_id": "t1_g6ycnra",
                                    "score": 21,
                                    "created_utc": 1601303149.0,
                                    "replies": [
                                        {
                                            "body": "😂😂😂",
                                            "author": "macaroonqueen",
                                            "id": "g6yf7zr",
                                            "parent_id": "t1_g6ycv5i",
                                            "score": 8,
                                            "created_utc": 1601304451.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I just follow the girls lead within what we want.  I’m adaptable.  I have had SB’s that stayed very private and secretive for years and I had another one where I was at her family BBQ about a month in.  They all are different.",
            "author": "LotBuilder",
            "id": "g70n53n",
            "parent_id": "t1_g70l7w9",
            "score": 15,
            "created_utc": 1601343697.0,
            "replies": []
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "g70jz0b",
            "parent_id": "t1_g6znjur",
            "score": 11,
            "created_utc": 1601342001.0,
            "replies": [
                {
                    "body": "Call me an idiot but maybe I just have a thing for older men with education, life experience, and emotional security and do not need marriage to feel a genuine and long-lasting connection with another person.",
                    "author": "LVSugarBebe",
                    "id": "g78ogfr",
                    "parent_id": "t1_g70jz0b",
                    "score": 3,
                    "created_utc": 1601515238.0,
                    "replies": []
                }
            ]
        },
        {
            "body": ">“I don’t have a problem getting sex without paying for it”\n\nThey say this when they are on an arrangement website or dating website or in-person meeting? If an arrangement dating website that literally makes zero sense for him to say that!",
            "author": null,
            "id": "g736wv7",
            "parent_id": "t1_g6znjur",
            "score": 3,
            "created_utc": 1601403312.0,
            "replies": [
                {
                    "body": "A guy will say this on a seeking site, I've seen it SEVERAL times in their profiles as well. Their justification is 'I'm too busy for a relationship so I'm on here.' More often than not you'll see it in profiles of men under 40. Sometimes they're attractive, sometimes they're not.  \n\n\nThey lead with 'I don't have a problem getting sex without paying for it' to either set an expectation anchor for the SB that she's not getting an allowance or to make them feel better about being on the site. Regardless, the conversation generally leads to the fact that they want to put in the minimum effort (paying for coffee/dinner) in order to get an on-demand booty-call girlfriend without any of the commitment or emotional expectation of an ongoing relationship.  \n\n\nThese guys may genuinely not have problems meeting women, but they want to get to sex as quickly as possible or lower the risk of multiple encounters with random women. My observation is that the really attractive and successful men have some other problem with their personality or lifestyle that prevents them from finding women who can fulfill this need in their vanilla dating life.",
                    "author": "LVSugarBebe",
                    "id": "g777x4u",
                    "parent_id": "t1_g736wv7",
                    "score": 1,
                    "created_utc": 1601490348.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I am having an experience that I think is deja vu? I'm not sure but its  like an out of body experience seeing your username and a comment I would say!",
            "author": "MJline",
            "id": "g70wd4s",
            "parent_id": "t1_g6znjur",
            "score": 2,
            "created_utc": 1601348897.0,
            "replies": []
        },
        {
            "body": ">Me: “And I don’t have a problem finding a rich, attractive, and attentive young man to date/marry who will share all of his life with me.”\n\nGood for you, but plenty of SBs do struggle with this. Rich men mostly marry rich women, specially because of the many assets that have to be shared.\n\nSo many women mistake having sex with a rich attractive guy for \"he will share all of his life with me\".\n\nThere just aren't enough rich men (not even countering attractive) for all the women that want to date one.",
            "author": "AdAlternative6041",
            "id": "g6zwvf9",
            "parent_id": "t1_g6znjur",
            "score": 6,
            "created_utc": 1601328658.0,
            "replies": []
        },
        {
            "body": "I don't like new SDs knowing where I live.  I let my one SD know where I lived after 4 months of consistent dating because he was so adamant on picking me up and dropping me off so I could drink with him (yeah, I know, I know).  He's always been super respectful about not inviting himself in (I made it clear it's never going to happen), and I don't think he'd stalk me.  But I still wish I'd never given in to the pressure.  He has absolutely zero concept of discretion.  When he shows up he tries to kiss me because \"I've missed you so much, I just can't wait for a kiss\"... right in front of my 80+ year old neighbour's living room window.  He's generally a great SD, reliable, generous, respectful, and he treats me really well. He just has absolutely no class or concept of the idea that maybe PDA isn't appropriate in the extremely conservative neighbourhood I live in, especially not in front of the nosiest neighbour on my street (she's retired and as far as I can tell has no friends or hobbies besides spying on the entire street, lol).",
            "author": "JustKittenxo",
            "id": "g6zlwa4",
            "parent_id": "t1_g6zkt4w",
            "score": 16,
            "created_utc": 1601323161.0,
            "replies": [
                {
                    "body": "Girl... I live in a whole neighborhood of Bessie's like that! They would lose their shit...😂 I feel like they are judging me just because I am leaving after dark to go out like some wild woman..😂",
                    "author": "NattyLiteSaber",
                    "id": "g6zrwt2",
                    "parent_id": "t1_g6zlwa4",
                    "score": 15,
                    "created_utc": 1601326095.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I can understand being worried about the scammers and not wanting to send money upfront.  I do wish they'd just offer to give a small gift when I arrive to cover travel expenses (or offer to meet me when I park and pay for it).  [By far my best M&G date was with a person who texted me while I was on my way there letting me know to just tell valet parking my name when I arrived and he'd already handled the cost... just such a sweet and thoughtful way to start off our first meeting and he was even sweeter and more thoughtful during the date.]",
            "author": "JustKittenxo",
            "id": "g6znpkv",
            "parent_id": "t1_g6zld71",
            "score": 28,
            "created_utc": 1601323993.0,
            "replies": [
                {
                    "body": "I always tell them I will give them money when we meet but I don’t send cash to strangers.  Did it twice and both ghosted and blocked.  It’s a shame because I know there are honest girls out there that just don’t want to risk getting stood up and spending money they don’t have.",
                    "author": "LotBuilder",
                    "id": "g6zoibs",
                    "parent_id": "t1_g6znpkv",
                    "score": 11,
                    "created_utc": 1601324394.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "That's not at all what you implied in your comment. You basically said that men can't be stalked, it must all be cheap SDs than ran off without paying.",
            "author": "AdAlternative6041",
            "id": "g704esq",
            "parent_id": "t1_g6zvzaa",
            "score": -1,
            "created_utc": 1601332889.0,
            "replies": [
                {
                    "body": "I didn't imply anything.. I stated what I stated... Actually I didn't say a thing about guys being stalked... At all... Not one reference..\n\nI am talking about what an SD says to new prospective women when asked about their previous relationships... So... I don't really know why you're talking about men being stalked.. Pretty sure men get stalked, too.. 🤷 \n\n\nBUT, in, MY experience... That girl was not crazy OR a stalker... But, \"I was cheap and she got pissed when I didn't pay her what we discussed then blew my phone up.. So, I blocked her for trying to get money that was owed to her\"... That doesn't sound as good to a new girl to scam... So, they just call every girl they have been with in the past.. \"Crazy\" or \"A stalker\" bc they got ripped off by some douchebag....🙄",
                    "author": "NattyLiteSaber",
                    "id": "g70620g",
                    "parent_id": "t1_g704esq",
                    "score": 7,
                    "created_utc": 1601333858.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Like end of season one of “the boys” dark, haven’t seen black mirror yet, now I’m curious",
            "author": "KnocDown",
            "id": "g6zqlbh",
            "parent_id": "t1_g6zqdqw",
            "score": 10,
            "created_utc": 1601325437.0,
            "replies": [
                {
                    "body": "White Christmas is sooo good have you seen it yet?",
                    "author": "jollifishe",
                    "id": "i32i8bo",
                    "parent_id": "t1_g6zqlbh",
                    "score": 1,
                    "created_utc": 1648870825.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "When you see a comment multiposted that's not the person who did it, it's reddit.",
            "author": "Sugarbeggar",
            "id": "g6z8lr5",
            "parent_id": "t1_g6z3ko4",
            "score": 15,
            "created_utc": 1601317484.0,
            "replies": []
        },
        {
            "body": "I dunno.. As many times as my phone told me \"Reddit had a problem adding your comment..\" \n\nWhy does it bother you so greatly? Obviously I didn't know it multi-posted.. The fuck with people sometimes..🙄😳",
            "author": "throwaway517714",
            "id": "g6z4e3c",
            "parent_id": "t1_g6z3ko4",
            "score": 10,
            "created_utc": 1601315662.0,
            "replies": [
                {
                    "body": "A poor craftsman blames his tools.",
                    "author": "genericMaker",
                    "id": "g72gate",
                    "parent_id": "t1_g6z4e3c",
                    "score": 1,
                    "created_utc": 1601392425.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "i’ll take the regular chicken THANK YOU",
            "author": null,
            "id": "g6youej",
            "parent_id": "t1_g6yjuxr",
            "score": 8,
            "created_utc": 1601308906.0,
            "replies": [
                {
                    "body": "Ah, yeah, you wouldn't be my SB for long like that.",
                    "author": "Sugarbeggar",
                    "id": "g6z8pjb",
                    "parent_id": "t1_g6youej",
                    "score": 0,
                    "created_utc": 1601317529.0,
                    "replies": [
                        {
                            "body": "it was a joke, have a sense of humor.",
                            "author": null,
                            "id": "g7024td",
                            "parent_id": "t1_g6z8pjb",
                            "score": 2,
                            "created_utc": 1601331577.0,
                            "replies": [
                                {
                                    "body": "Some things you just don't joke about...",
                                    "author": "Sugarbeggar",
                                    "id": "g703wgj",
                                    "parent_id": "t1_g7024td",
                                    "score": 0,
                                    "created_utc": 1601332588.0,
                                    "replies": [
                                        {
                                            "body": "summer down a little. i don’t like spicy food, it was nothing more than a harmless joke. sorry to have offended you",
                                            "author": null,
                                            "id": "g71i50k",
                                            "parent_id": "t1_g703wgj",
                                            "score": 2,
                                            "created_utc": 1601367588.0,
                                            "replies": [
                                                {
                                                    "body": "he was being sarcastic i think",
                                                    "author": "sbgonebroke",
                                                    "id": "g72x1pb",
                                                    "parent_id": "t1_g71i50k",
                                                    "score": 1,
                                                    "created_utc": 1601398952.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Haha, the Baconator strikes again.",
            "author": "DFWCouple4SB",
            "id": "g6yls3h",
            "parent_id": "t1_g6yjuxr",
            "score": 3,
            "created_utc": 1601307580.0,
            "replies": []
        },
        {
            "body": "Lol.. Yeah... Men and their porn ideas...🙄🙄🙄 \n\nSounds good. But doesn't work in reality...\n\nI'd be like.. So... Should I be professional or a slutty professional? The skirt hikes up the same no matter how short it is..🤷",
            "author": "NattyLiteSaber",
            "id": "g72yqy7",
            "parent_id": "t1_g72wvvc",
            "score": 1,
            "created_utc": 1601399672.0,
            "replies": []
        },
        {
            "body": "I just bring a change of clothes and once we get to a hotel room.. I can change... Lol... I've had one SD send me a list of all the outfits he'd like to see me in.. So.. I just pack a bag.. Aside from dinner and drinks we are usually in a hotel room anyways.",
            "author": "NattyLiteSaber",
            "id": "g72z6qp",
            "parent_id": "t1_g72wvvc",
            "score": 1,
            "created_utc": 1601399876.0,
            "replies": []
        },
        {
            "body": ">I don’t see why they would trash you. Coffee dates are low effort and if you are in this lifestyle as a woman you put a lot into your look on a date... just for it to be coffee? I prefer dinner or lunch but to each his own\n\nI generally agree, though the last two whales I went out with (one is now my amazing SD) both asked me on coffee dates. The way I made it worth my time was to book them on the same day I already had a dinner date with another POT so I didn't waste the time getting ready 'just for coffee'.",
            "author": "LVSugarBebe",
            "id": "g78n14p",
            "parent_id": "t1_g712myt",
            "score": 3,
            "created_utc": 1601514422.0,
            "replies": []
        },
        {
            "body": "You shouldn’t go in with that mindset. Even if chemistry is bad you can leave if it’s dinner or lunch lol no one should be holding you hostage.",
            "author": "citygurlll",
            "id": "g712qnr",
            "parent_id": "t1_g6zgs3g",
            "score": 6,
            "created_utc": 1601353146.0,
            "replies": []
        },
        {
            "body": "Thank you for giving me that perspective!",
            "author": "Copperdelight",
            "id": "g70ao5k",
            "parent_id": "t1_g7008my",
            "score": 3,
            "created_utc": 1601336660.0,
            "replies": [
                {
                    "body": "I agree with the SD who replied. Also, consider proposing a bi-weekly or weekly allowance instead and then working up to monthly once trust is established. Inform him that 1) you just feel awkward with the envelope exchange during the date and 2) that it helps you to have something consistent, even if it's slightly less.\n\nThe other option is to try to set the same time each week with him and schedule in advance so it's on both of your schedules to look forward to, and you know you'll be taken care of.",
                    "author": "LVSugarBebe",
                    "id": "g78nqdh",
                    "parent_id": "t1_g70ao5k",
                    "score": 2,
                    "created_utc": 1601514830.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I did not break rules",
            "author": "Copperdelight",
            "id": "gc0qitm",
            "parent_id": "t1_g6yz0z6",
            "score": 1,
            "created_utc": 1605164221.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "g6zkcln",
            "parent_id": "t1_g6z8ma0",
            "score": -1,
            "created_utc": 1601322504.0,
            "replies": [
                {
                    "body": "Your $80 tofu is served madam. \n\nI have gone a lot for the alt SBs. You somehow have to be both open to woke vegan restaurants and be willing to spend a lot to show you’re a serious SD. Oh the amount of meat substitutes I’ve eaten for sugar...",
                    "author": null,
                    "id": "g6znwhy",
                    "parent_id": "t1_g6zkcln",
                    "score": 2,
                    "created_utc": 1601324088.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "You can’t teach an old dog new tricks.",
            "author": "angelhair12",
            "id": "g6z5lhb",
            "parent_id": "t1_g6z3npt",
            "score": 1,
            "created_utc": 1601316180.0,
            "replies": []
        },
        {
            "body": "JFC dude.  These are all extremely common. \n\nHe didn’t say anything about you, it wasn’t personal.  \n\nCalling him a simp..good job drama queen",
            "author": "BGDDDY1",
            "id": "g6ycqkn",
            "parent_id": "t1_g6yc80z",
            "score": 27,
            "created_utc": 1601303080.0,
            "replies": [
                {
                    "body": "Sorry - did I say these weren't common? Of course they're common. They also grossly misrepresent what each individual means when they say them. They're also, oddly enough, things many SB's say to POT SD's. To suggest \"I don't like that kind of restaurant\" means \"I'm a cheap ass\" is silly. To suggest wanting a private SR is some type of sin, when nearly all effective SR's have some level of discretion and privacy, is a misrepresentation of SR dating to begin with.\n\nTo suggest not wanting something to feel transactional means anything other than both parties not wanting it to feel like prostitution is dishonest. This is the hallmark of SA, and literally any conversation I have ever had with POTs. Nobody wants it to feel transactional. \n\nSuggesting to your SB you want to buy her nice clothes doesn't mean you think she dresses like a hooker, it could just mean I want to buy you something nice. \n\nAnd again, I very specifically stated that OP was generalizing SD's. I never implied his post was an attack on me, in fact, HE implied his post was an attack on me.",
                    "author": "cleanandjerks19",
                    "id": "g6ydsn6",
                    "parent_id": "t1_g6ycqkn",
                    "score": -12,
                    "created_utc": 1601303664.0,
                    "replies": [
                        {
                            "body": "The truth via “Tongue in cheek”..look it up & try putting on a sense of humor 🤷‍♂️",
                            "author": "BGDDDY1",
                            "id": "g6yecp4",
                            "parent_id": "t1_g6ydsn6",
                            "score": 11,
                            "created_utc": 1601303970.0,
                            "replies": [
                                {
                                    "body": "OP has repeatedly suggested this is a list meant to be helpful. There's no tongue in cheek implied by the OP.",
                                    "author": "cleanandjerks19",
                                    "id": "g6yfdn4",
                                    "parent_id": "t1_g6yecp4",
                                    "score": 3,
                                    "created_utc": 1601304535.0,
                                    "replies": [
                                        {
                                            "body": "Guarantee you if we took a vote on whether you chuckled when you read post most would say yes.",
                                            "author": "BGDDDY1",
                                            "id": "g6yxpz3",
                                            "parent_id": "t1_g6yfdn4",
                                            "score": 2,
                                            "created_utc": 1601312777.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "You are literally the reason the other young lady inspired me to make my post :)",
            "author": "KnocDown",
            "id": "g6ycf01",
            "parent_id": "t1_g6yc80z",
            "score": 13,
            "created_utc": 1601302899.0,
            "replies": [
                {
                    "body": "Odd. Going 3 years strong with an SB. She sure doesn't seem to mind almost any of the things you've posted. \n\nSure. Are there SDs who suck? Absolutely. All this post did was generalize SD's.",
                    "author": "cleanandjerks19",
                    "id": "g6ycnra",
                    "parent_id": "t1_g6ycf01",
                    "score": -3,
                    "created_utc": 1601303035.0,
                    "replies": [
                        {
                            "body": "You are flexing way too hard, have a nice day",
                            "author": "KnocDown",
                            "id": "g6ycv5i",
                            "parent_id": "t1_g6ycnra",
                            "score": 21,
                            "created_utc": 1601303149.0,
                            "replies": [
                                {
                                    "body": "😂😂😂",
                                    "author": "macaroonqueen",
                                    "id": "g6yf7zr",
                                    "parent_id": "t1_g6ycv5i",
                                    "score": 8,
                                    "created_utc": 1601304451.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Call me an idiot but maybe I just have a thing for older men with education, life experience, and emotional security and do not need marriage to feel a genuine and long-lasting connection with another person.",
            "author": "LVSugarBebe",
            "id": "g78ogfr",
            "parent_id": "t1_g70jz0b",
            "score": 3,
            "created_utc": 1601515238.0,
            "replies": []
        },
        {
            "body": "A guy will say this on a seeking site, I've seen it SEVERAL times in their profiles as well. Their justification is 'I'm too busy for a relationship so I'm on here.' More often than not you'll see it in profiles of men under 40. Sometimes they're attractive, sometimes they're not.  \n\n\nThey lead with 'I don't have a problem getting sex without paying for it' to either set an expectation anchor for the SB that she's not getting an allowance or to make them feel better about being on the site. Regardless, the conversation generally leads to the fact that they want to put in the minimum effort (paying for coffee/dinner) in order to get an on-demand booty-call girlfriend without any of the commitment or emotional expectation of an ongoing relationship.  \n\n\nThese guys may genuinely not have problems meeting women, but they want to get to sex as quickly as possible or lower the risk of multiple encounters with random women. My observation is that the really attractive and successful men have some other problem with their personality or lifestyle that prevents them from finding women who can fulfill this need in their vanilla dating life.",
            "author": "LVSugarBebe",
            "id": "g777x4u",
            "parent_id": "t1_g736wv7",
            "score": 1,
            "created_utc": 1601490348.0,
            "replies": []
        },
        {
            "body": "Girl... I live in a whole neighborhood of Bessie's like that! They would lose their shit...😂 I feel like they are judging me just because I am leaving after dark to go out like some wild woman..😂",
            "author": "NattyLiteSaber",
            "id": "g6zrwt2",
            "parent_id": "t1_g6zlwa4",
            "score": 15,
            "created_utc": 1601326095.0,
            "replies": []
        },
        {
            "body": "I always tell them I will give them money when we meet but I don’t send cash to strangers.  Did it twice and both ghosted and blocked.  It’s a shame because I know there are honest girls out there that just don’t want to risk getting stood up and spending money they don’t have.",
            "author": "LotBuilder",
            "id": "g6zoibs",
            "parent_id": "t1_g6znpkv",
            "score": 11,
            "created_utc": 1601324394.0,
            "replies": []
        },
        {
            "body": "I didn't imply anything.. I stated what I stated... Actually I didn't say a thing about guys being stalked... At all... Not one reference..\n\nI am talking about what an SD says to new prospective women when asked about their previous relationships... So... I don't really know why you're talking about men being stalked.. Pretty sure men get stalked, too.. 🤷 \n\n\nBUT, in, MY experience... That girl was not crazy OR a stalker... But, \"I was cheap and she got pissed when I didn't pay her what we discussed then blew my phone up.. So, I blocked her for trying to get money that was owed to her\"... That doesn't sound as good to a new girl to scam... So, they just call every girl they have been with in the past.. \"Crazy\" or \"A stalker\" bc they got ripped off by some douchebag....🙄",
            "author": "NattyLiteSaber",
            "id": "g70620g",
            "parent_id": "t1_g704esq",
            "score": 7,
            "created_utc": 1601333858.0,
            "replies": []
        },
        {
            "body": "White Christmas is sooo good have you seen it yet?",
            "author": "jollifishe",
            "id": "i32i8bo",
            "parent_id": "t1_g6zqlbh",
            "score": 1,
            "created_utc": 1648870825.0,
            "replies": []
        },
        {
            "body": "A poor craftsman blames his tools.",
            "author": "genericMaker",
            "id": "g72gate",
            "parent_id": "t1_g6z4e3c",
            "score": 1,
            "created_utc": 1601392425.0,
            "replies": []
        },
        {
            "body": "Ah, yeah, you wouldn't be my SB for long like that.",
            "author": "Sugarbeggar",
            "id": "g6z8pjb",
            "parent_id": "t1_g6youej",
            "score": 0,
            "created_utc": 1601317529.0,
            "replies": [
                {
                    "body": "it was a joke, have a sense of humor.",
                    "author": null,
                    "id": "g7024td",
                    "parent_id": "t1_g6z8pjb",
                    "score": 2,
                    "created_utc": 1601331577.0,
                    "replies": [
                        {
                            "body": "Some things you just don't joke about...",
                            "author": "Sugarbeggar",
                            "id": "g703wgj",
                            "parent_id": "t1_g7024td",
                            "score": 0,
                            "created_utc": 1601332588.0,
                            "replies": [
                                {
                                    "body": "summer down a little. i don’t like spicy food, it was nothing more than a harmless joke. sorry to have offended you",
                                    "author": null,
                                    "id": "g71i50k",
                                    "parent_id": "t1_g703wgj",
                                    "score": 2,
                                    "created_utc": 1601367588.0,
                                    "replies": [
                                        {
                                            "body": "he was being sarcastic i think",
                                            "author": "sbgonebroke",
                                            "id": "g72x1pb",
                                            "parent_id": "t1_g71i50k",
                                            "score": 1,
                                            "created_utc": 1601398952.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I agree with the SD who replied. Also, consider proposing a bi-weekly or weekly allowance instead and then working up to monthly once trust is established. Inform him that 1) you just feel awkward with the envelope exchange during the date and 2) that it helps you to have something consistent, even if it's slightly less.\n\nThe other option is to try to set the same time each week with him and schedule in advance so it's on both of your schedules to look forward to, and you know you'll be taken care of.",
            "author": "LVSugarBebe",
            "id": "g78nqdh",
            "parent_id": "t1_g70ao5k",
            "score": 2,
            "created_utc": 1601514830.0,
            "replies": []
        },
        {
            "body": "Your $80 tofu is served madam. \n\nI have gone a lot for the alt SBs. You somehow have to be both open to woke vegan restaurants and be willing to spend a lot to show you’re a serious SD. Oh the amount of meat substitutes I’ve eaten for sugar...",
            "author": null,
            "id": "g6znwhy",
            "parent_id": "t1_g6zkcln",
            "score": 2,
            "created_utc": 1601324088.0,
            "replies": []
        },
        {
            "body": "Sorry - did I say these weren't common? Of course they're common. They also grossly misrepresent what each individual means when they say them. They're also, oddly enough, things many SB's say to POT SD's. To suggest \"I don't like that kind of restaurant\" means \"I'm a cheap ass\" is silly. To suggest wanting a private SR is some type of sin, when nearly all effective SR's have some level of discretion and privacy, is a misrepresentation of SR dating to begin with.\n\nTo suggest not wanting something to feel transactional means anything other than both parties not wanting it to feel like prostitution is dishonest. This is the hallmark of SA, and literally any conversation I have ever had with POTs. Nobody wants it to feel transactional. \n\nSuggesting to your SB you want to buy her nice clothes doesn't mean you think she dresses like a hooker, it could just mean I want to buy you something nice. \n\nAnd again, I very specifically stated that OP was generalizing SD's. I never implied his post was an attack on me, in fact, HE implied his post was an attack on me.",
            "author": "cleanandjerks19",
            "id": "g6ydsn6",
            "parent_id": "t1_g6ycqkn",
            "score": -12,
            "created_utc": 1601303664.0,
            "replies": [
                {
                    "body": "The truth via “Tongue in cheek”..look it up & try putting on a sense of humor 🤷‍♂️",
                    "author": "BGDDDY1",
                    "id": "g6yecp4",
                    "parent_id": "t1_g6ydsn6",
                    "score": 11,
                    "created_utc": 1601303970.0,
                    "replies": [
                        {
                            "body": "OP has repeatedly suggested this is a list meant to be helpful. There's no tongue in cheek implied by the OP.",
                            "author": "cleanandjerks19",
                            "id": "g6yfdn4",
                            "parent_id": "t1_g6yecp4",
                            "score": 3,
                            "created_utc": 1601304535.0,
                            "replies": [
                                {
                                    "body": "Guarantee you if we took a vote on whether you chuckled when you read post most would say yes.",
                                    "author": "BGDDDY1",
                                    "id": "g6yxpz3",
                                    "parent_id": "t1_g6yfdn4",
                                    "score": 2,
                                    "created_utc": 1601312777.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Odd. Going 3 years strong with an SB. She sure doesn't seem to mind almost any of the things you've posted. \n\nSure. Are there SDs who suck? Absolutely. All this post did was generalize SD's.",
            "author": "cleanandjerks19",
            "id": "g6ycnra",
            "parent_id": "t1_g6ycf01",
            "score": -3,
            "created_utc": 1601303035.0,
            "replies": [
                {
                    "body": "You are flexing way too hard, have a nice day",
                    "author": "KnocDown",
                    "id": "g6ycv5i",
                    "parent_id": "t1_g6ycnra",
                    "score": 21,
                    "created_utc": 1601303149.0,
                    "replies": [
                        {
                            "body": "😂😂😂",
                            "author": "macaroonqueen",
                            "id": "g6yf7zr",
                            "parent_id": "t1_g6ycv5i",
                            "score": 8,
                            "created_utc": 1601304451.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "it was a joke, have a sense of humor.",
            "author": null,
            "id": "g7024td",
            "parent_id": "t1_g6z8pjb",
            "score": 2,
            "created_utc": 1601331577.0,
            "replies": [
                {
                    "body": "Some things you just don't joke about...",
                    "author": "Sugarbeggar",
                    "id": "g703wgj",
                    "parent_id": "t1_g7024td",
                    "score": 0,
                    "created_utc": 1601332588.0,
                    "replies": [
                        {
                            "body": "summer down a little. i don’t like spicy food, it was nothing more than a harmless joke. sorry to have offended you",
                            "author": null,
                            "id": "g71i50k",
                            "parent_id": "t1_g703wgj",
                            "score": 2,
                            "created_utc": 1601367588.0,
                            "replies": [
                                {
                                    "body": "he was being sarcastic i think",
                                    "author": "sbgonebroke",
                                    "id": "g72x1pb",
                                    "parent_id": "t1_g71i50k",
                                    "score": 1,
                                    "created_utc": 1601398952.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "The truth via “Tongue in cheek”..look it up & try putting on a sense of humor 🤷‍♂️",
            "author": "BGDDDY1",
            "id": "g6yecp4",
            "parent_id": "t1_g6ydsn6",
            "score": 11,
            "created_utc": 1601303970.0,
            "replies": [
                {
                    "body": "OP has repeatedly suggested this is a list meant to be helpful. There's no tongue in cheek implied by the OP.",
                    "author": "cleanandjerks19",
                    "id": "g6yfdn4",
                    "parent_id": "t1_g6yecp4",
                    "score": 3,
                    "created_utc": 1601304535.0,
                    "replies": [
                        {
                            "body": "Guarantee you if we took a vote on whether you chuckled when you read post most would say yes.",
                            "author": "BGDDDY1",
                            "id": "g6yxpz3",
                            "parent_id": "t1_g6yfdn4",
                            "score": 2,
                            "created_utc": 1601312777.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "You are flexing way too hard, have a nice day",
            "author": "KnocDown",
            "id": "g6ycv5i",
            "parent_id": "t1_g6ycnra",
            "score": 21,
            "created_utc": 1601303149.0,
            "replies": [
                {
                    "body": "😂😂😂",
                    "author": "macaroonqueen",
                    "id": "g6yf7zr",
                    "parent_id": "t1_g6ycv5i",
                    "score": 8,
                    "created_utc": 1601304451.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Some things you just don't joke about...",
            "author": "Sugarbeggar",
            "id": "g703wgj",
            "parent_id": "t1_g7024td",
            "score": 0,
            "created_utc": 1601332588.0,
            "replies": [
                {
                    "body": "summer down a little. i don’t like spicy food, it was nothing more than a harmless joke. sorry to have offended you",
                    "author": null,
                    "id": "g71i50k",
                    "parent_id": "t1_g703wgj",
                    "score": 2,
                    "created_utc": 1601367588.0,
                    "replies": [
                        {
                            "body": "he was being sarcastic i think",
                            "author": "sbgonebroke",
                            "id": "g72x1pb",
                            "parent_id": "t1_g71i50k",
                            "score": 1,
                            "created_utc": 1601398952.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "OP has repeatedly suggested this is a list meant to be helpful. There's no tongue in cheek implied by the OP.",
            "author": "cleanandjerks19",
            "id": "g6yfdn4",
            "parent_id": "t1_g6yecp4",
            "score": 3,
            "created_utc": 1601304535.0,
            "replies": [
                {
                    "body": "Guarantee you if we took a vote on whether you chuckled when you read post most would say yes.",
                    "author": "BGDDDY1",
                    "id": "g6yxpz3",
                    "parent_id": "t1_g6yfdn4",
                    "score": 2,
                    "created_utc": 1601312777.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "😂😂😂",
            "author": "macaroonqueen",
            "id": "g6yf7zr",
            "parent_id": "t1_g6ycv5i",
            "score": 8,
            "created_utc": 1601304451.0,
            "replies": []
        },
        {
            "body": "summer down a little. i don’t like spicy food, it was nothing more than a harmless joke. sorry to have offended you",
            "author": null,
            "id": "g71i50k",
            "parent_id": "t1_g703wgj",
            "score": 2,
            "created_utc": 1601367588.0,
            "replies": [
                {
                    "body": "he was being sarcastic i think",
                    "author": "sbgonebroke",
                    "id": "g72x1pb",
                    "parent_id": "t1_g71i50k",
                    "score": 1,
                    "created_utc": 1601398952.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Guarantee you if we took a vote on whether you chuckled when you read post most would say yes.",
            "author": "BGDDDY1",
            "id": "g6yxpz3",
            "parent_id": "t1_g6yfdn4",
            "score": 2,
            "created_utc": 1601312777.0,
            "replies": []
        },
        {
            "body": "he was being sarcastic i think",
            "author": "sbgonebroke",
            "id": "g72x1pb",
            "parent_id": "t1_g71i50k",
            "score": 1,
            "created_utc": 1601398952.0,
            "replies": []
        }
    ]
}