{
    "title": "White Daddy/Black Daddy",
    "post_id": "c394bm",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/c394bm/white_daddyblack_daddy/",
    "author": "the_great_blacksby",
    "body": "I’m a long time lurker. I see a lot of SBs asking if it’s harder for black SBs and other minorities. I’m on the SD side and black. Not Drake or Obama black....Akon and Jamie Foxx black!\n\nMy experience is as follows:\n\n- Black, Latin, and Mixed babies almost exclusively make the first move with me. My inbox stays flooded with inbound requests from them, 5 to 10 a day, sometimes as high as 20.\n\n- Most range from average to the very hot (and normally out of my league). But there are some very unattractive, out of shape, POTs who seem to think people will literally date anything. It makes me wonder if they are just used to (black) men who have no standards.\n\n- I only have to use the search to do outbound if I’m looking for White, Asian or South East Asian babies. They never reach out (to me) first. The response rate from these groups is very low. I have only managed to get a handful to respond and they just flat out told me they don’t want a black SD. (Not complaining, I could care less, not begging anyone to money from me, lol)\n\n- In other cases they will deflect, ANYTHING I say seems to put them on edge. For instance there have been situations where they’ve objected to my using words like PPM, Allowance, Date, M and G, Arrangement, Sugar...even Hello. Not all at once, different words, different messages, to different people. It’s all bowl language I learned from this forum, so I don’t think it’s the words themselves. It seems to be defensiveness I can only chalk up to racial perception. ‘Sugar’ from a ‘black man’ automatically makes them feel differently about it all than sugar from others. Sugar from me seems to imply ‘pimp’ or ‘John’. Sugar from someone else is ‘oh my god my SD is so generous and wonderful’.\n\n- Let me clarify, this is in the South. On the West Coast all these behavior patterns are obliterated. Anything goes out there. North East is not as different from the South as I’d have expected. I’ve never been in the Midwest long enough to SD, so no information \n\n- I will also do outbound searches to reach out to some of the Black, Latin, and Mixed babies that don’t reach out to me. 50% of these  also seem to be holding out for white guys or they say as much on their profile. (I find this one to be a bit of head scratcher, but same as above.) The other 50% are skeptical that ‘I’m’ real....in other words they perpetuate a stereotype that probably is pervasive throughout the bowl (that there are no, or few, genuine Black SDs). \n\n- Stereotypes usually have some truth to them, so I get that I may be a black unicorn. But I like sugar relationships. I like them long term and I like to help my SBs with whatever they might need help with.l from bills, to rent, to equinox.\n\n- Every SB I’ve met comments on how rare it is to meet a black SD who is legitimately interested in an ongoing SR.\n\n- At first I thought I was meeting a lot of rinsers, but there’s some interesting social patterns here too. Some SBs seem to want to ‘test’ my individual wealth by asking for things and favors right away that i presume they wouldn’t get away with others. I call this the ‘Black Daddy Tax’, paying for a bunch of superfluous bullshit in the first few dates just so they can be sure I’m not pulling a fast one with my tax return money. This stuff above and beyond the allowance, fancy dinners, and hotels but before we’ve had time to settle into a long term arrangement where I’d be fine with any expense.\n\n- While it doesn’t do anything for me, I did sugar once with someone who wanted online-only. She sent me some semi-naughty pics for a few weeks until I told her it wasn’t for me. I wasn’t interested in anything naughtier, the pics were just useless to me. I tried it because a handful of SBs have said that there is this thriving online-only world of SDs and I wanted to see if maybe I was missing out on something.\n\n- I’ve learned that I do not have the privilege of ever doing a low-key M and G in a really casual setting. I made the mistake of asking a first time SB to meet me at a divvy sports bar for a first meet. Usually I only do the best restaurants in the city for a first meet. However, as soon as I said the name of this place she laughed on the phone and hung up. I assume she took the invite as ‘my idea of wining and dining’ her. I was just pressed for time and the place was close. Coffee shops don’t work either. I’ve done it, but those M and Gs never progress. I’ve decided it’s because it doesn’t pass whatever ‘wealth test’ that the SB may be consciously or subconsciously measuring me against.\n\n- Also, I know that my friends in the bowl have told me occasionally they get away with ‘Mentorship’ and ‘Experiences’ as part of what the SB is seeking from them. Not me. Show them the money or the shopping! These are guys with my same career and friend groups (private equity) so I find that hilarious knowing what they can get away with. Good branding is everything!\n\nDon’t read this as my complaining! But don’t delude yourself into believing the world is the same for Black Daddies either. \n\nEven the name sounds suspect - ‘Black Daddy’ sounds like he just got out of Rikers for hustling crack. ‘White Daddy’ sounds like he may have done some federal time but still runs a $400M enterprise that pays no taxes.\n\nI’m just trying to objectively offer what my experience has been in the bowl!\n\nAlso, I’m impressed by how much play my White brethren are getting out here! Maybe one day I will pull an Eddie Murphy and try the bowl in full-on whiteface makeup to get a glimpse of how crazy it can be!",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/c394bm/white_daddyblack_daddy/",
    "score": 124,
    "upvote_ratio": 0.89,
    "created_utc": 1561114323.0,
    "num_comments": 140,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "[deleted]",
            "author": null,
            "id": "erph3q0",
            "parent_id": "t3_c394bm",
            "score": 42,
            "created_utc": 1561117166.0,
            "replies": [
                {
                    "body": "I'm somewhere between Keenan and Kel. We're all a dude!",
                    "author": "the_great_blacksby",
                    "id": "ers50ks",
                    "parent_id": "t1_erph3q0",
                    "score": 6,
                    "created_utc": 1561200254.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Nice write up and a good view of your experience as a Black SD.  \n\nI'm a mid-50s white SD who prefers black SBs.  Several have complained that there aren't more genuine black SDs so l would expect you to be popular with black SBs.  It is interesting about the differences you see in messaging with different ethnicities.",
            "author": "willfromvb",
            "id": "erplqb3",
            "parent_id": "t3_c394bm",
            "score": 17,
            "created_utc": 1561121718.0,
            "replies": [
                {
                    "body": "I'm a black sb and I don't mess with BM at all. It's due to bad experiences and just like a lot of SDs have black SBs explictly excluded in their profile for personal reasons so do SBs.\nIt's not fair but neither is life. BM will have a hard time with escorts and pros as well. It's just how it is. There's many articles and youtube content on the subject.",
                    "author": "JanStrick",
                    "id": "erq6sh8",
                    "parent_id": "t1_erplqb3",
                    "score": 11,
                    "created_utc": 1561136495.0,
                    "replies": [
                        {
                            "body": "I've heard that too. Even the black SBs that complaimed that there weren't more genuine black SDs emphasized the \"genuine\" part and told how they had bad experiences with black men claiming to be SDs, not wanting to provide an allowance, expecting a discount because they were black or wanted to be their pimp and get them to escort.  \n\nI also know a few local black men that are SDs that I know through other forums that take pride in their pick up artist skills and brag about how many SBs they get for free or cheap.  These same guys complain about escorts and SBs with NBA (No Blacks Allowed) policies. They hurt their own case.  \n\nI also know a few very well off genuine black SDs who treat women very well.  One is an ex NFL player and the women love him.",
                            "author": "willfromvb",
                            "id": "erqdmqs",
                            "parent_id": "t1_erq6sh8",
                            "score": 5,
                            "created_utc": 1561140909.0,
                            "replies": [
                                {
                                    "body": "Regarding the pickup artists, they are as diverse as there are SBs. While, it doesn't exactly help their case, to be fair to them, the black ones are also just trying to fit in to a community and do what people of other races do. In that case it's just a community of emotionally abusive assholes",
                                    "author": "the_great_blacksby",
                                    "id": "ers4ed5",
                                    "parent_id": "t1_erqdmqs",
                                    "score": 5,
                                    "created_utc": 1561199280.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "'No AA men' is the new 'No shirt, no shoes, no service'\n\nIt's a shame but that's only some girls who have probably been deeply hurt by a lot of men who look like me. Can't be mad at them for not wanting to be hurt anymore\n\nLuckily, in the bowl there are enough women of color who aren't jaded yet that I still have a great time. Not without its problems (I'm aware I only shared the problems) but plenty of wins\n\nI do not look down on any black or brown woman who has a preference for white or other. Just trying to get my shots in where I can anyway!!!!",
                            "author": "the_great_blacksby",
                            "id": "ers48m9",
                            "parent_id": "t1_erq6sh8",
                            "score": 7,
                            "created_utc": 1561199023.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "This is really interesting. Thanks for sharing your thoughts. I'm a white SB and have a black SD. (We're not exclusive. My other SD is white; I don't know if he's seeing anyone else at the moment but I think he's sugar dated both white and non white girls.) \n\nOn our first date he pointed out that we were the only mixed couple in the restaurant. I pointed out the only lesbian couple at the bar, and the only white bus boy to see if he'd noticed the other outliers - he hadn't. So I said, it's not likely they've noticed or would even care about us. He seemed to like that. 🤷‍♀️\n\nDisclaimer - large, liberal city. I'm sure people would have noticed in my backwoods hometown.",
            "author": "deep-blue-nothing",
            "id": "erpi9rr",
            "parent_id": "t3_c394bm",
            "score": 23,
            "created_utc": 1561118438.0,
            "replies": [
                {
                    "body": "That's a great story. I like that you helped him see he was maybe being blind to other people's 'otherness' \n\n> Large, liberal, city\n\nAre you in Portlandia?",
                    "author": "the_great_blacksby",
                    "id": "ers4zil",
                    "parent_id": "t1_erpi9rr",
                    "score": 1,
                    "created_utc": 1561200206.0,
                    "replies": []
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "errapcl",
                    "parent_id": "t1_erpi9rr",
                    "score": 1,
                    "created_utc": 1561165019.0,
                    "replies": [
                        {
                            "body": "> I miss that SB.\n\nI keep a Dropbox of pics and videos of SBs past. Sometimes I scroll through and marvel at the amazing women I'd never have met if it weren't for the bowl!",
                            "author": "the_great_blacksby",
                            "id": "ers6b93",
                            "parent_id": "t1_errapcl",
                            "score": 1,
                            "created_utc": 1561202244.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "This is why I've never discounted any race. Humor is the sexiest thing a man has. Also West Coaster reporting in. \n\n\nI'm mixed race but pass completely as white. Blonde hair, pale, green eyes. West coast and Europe men find it fascinating that I'm mixed race when they find out. \n\n\nI've had southern men POT SD and professionally tell me totally seriously \"you don't seem like you'd be that! Are you sure your dad is your dad?!!?\" When they find out my father is a different ethnicity than my white mother. \n\n\nInteresting to hear it from your perspective. I know my brother who looks like my father has had struggles that I have not. For all our advancement, racism is still alive and well even if people don't realize it.",
            "author": "SFASB",
            "id": "erpsh4t",
            "parent_id": "t3_c394bm",
            "score": 8,
            "created_utc": 1561126911.0,
            "replies": [
                {
                    "body": "Are you Rashida Jones!? I'd give two kidneys and one testicle for that woman.",
                    "author": "the_great_blacksby",
                    "id": "ers3e1t",
                    "parent_id": "t1_erpsh4t",
                    "score": 1,
                    "created_utc": 1561197652.0,
                    "replies": [
                        {
                            "body": "While she's played a nurse I'm actually a real one. \n\n\nI sugar for cash only. Organ harvesting is for professional reasons only. \n\n\n😉\n\n\nBut with that ball I could become a baby mama and get child support for 18 years.... Choices choices....",
                            "author": "SFASB",
                            "id": "erti0u6",
                            "parent_id": "t1_ers3e1t",
                            "score": 2,
                            "created_utc": 1561242973.0,
                            "replies": [
                                {
                                    "body": "I. Am. Intrigued.",
                                    "author": "the_great_blacksby",
                                    "id": "ertpblq",
                                    "parent_id": "t1_erti0u6",
                                    "score": 1,
                                    "created_utc": 1561249120.0,
                                    "replies": [
                                        {
                                            "body": "Hi Intrigued, I'm SFASB!\n\n\nThese are the types of jokes that you could make if I take you up on the ball thing.",
                                            "author": "SFASB",
                                            "id": "erubpqk",
                                            "parent_id": "t1_ertpblq",
                                            "score": 2,
                                            "created_utc": 1561271176.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "\nWhile being in SA myself, I kind of have leaned towards not interacting with black SD’s as well because they usually offer mentorship, or more often than not try to shame me for wanting sugar. \n\nAs a dancer, particularly here in the DC area, black men are probably the most generous customers. They have tipped me the best, and honestly have been the most respectful.\n\nSo sex work with black men is mixed for me as a latina",
            "author": "cornycatlady",
            "id": "erppx4z",
            "parent_id": "t3_c394bm",
            "score": 16,
            "created_utc": 1561125075.0,
            "replies": [
                {
                    "body": "I would be too embarrassed to ever offer mentorship to anyone in the bowl. i was absolutely floored to learn that some SDs basically get solicited for it! Good for them\n\nDC is among the weirdest places for strip clubs. Soooooo many rules.",
                    "author": "the_great_blacksby",
                    "id": "ers3i90",
                    "parent_id": "t1_erppx4z",
                    "score": 3,
                    "created_utc": 1561197841.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I died at ‘Black Daddy sounds like he got out of Rikers’\n\nI would very much enjoy lovingly referring to my SD as my Black Daddy, no drug references necessary. I would giggle every time.\n\nI’d like to point out though that using terms from this forum can make someone come across as ‘seasoned’ or even a ‘serial sugar dater’. I’ve nexted guys who’ve used terminology too much because they came across as very ‘by the book’. No one wants to be constrained, even by the sometimes necessary (yet very narrow) rules of this forum. \n\nJust my two cents.",
            "author": null,
            "id": "erpih40",
            "parent_id": "t3_c394bm",
            "score": 20,
            "created_utc": 1561118650.0,
            "replies": [
                {
                    "body": "Black Daddy sounds hot tbh but I'm gonna disagree about using terms. Personally I like to know we're on the same page.",
                    "author": "Mopsydoll",
                    "id": "erqombf",
                    "parent_id": "t1_erpih40",
                    "score": 6,
                    "created_utc": 1561148298.0,
                    "replies": []
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "erru49m",
                    "parent_id": "t1_erpih40",
                    "score": 2,
                    "created_utc": 1561183573.0,
                    "replies": [
                        {
                            "body": "Interesting",
                            "author": "the_great_blacksby",
                            "id": "ers4ujd",
                            "parent_id": "t1_erru49m",
                            "score": 1,
                            "created_utc": 1561199992.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "That's a good point. I mean I guess I am a serial sugar dater but that's because I've been in and out of the bowl for many years and also, not all m and gs turn into  1-2 year SRs or SRs at all.\n\nFuck, I'm using the terms! I can't stop!!!",
                    "author": "the_great_blacksby",
                    "id": "ers4wjj",
                    "parent_id": "t1_erpih40",
                    "score": 1,
                    "created_utc": 1561200080.0,
                    "replies": []
                },
                {
                    "body": "Ab, I agree with you 100%. I also next SB that sound too seasoned using sugar lingo that is common on SLF.",
                    "author": "ruphun",
                    "id": "erpu4f1",
                    "parent_id": "t1_erpih40",
                    "score": 1,
                    "created_utc": 1561128055.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Location is plenty important! Don't you just love the South /s\n\n🙂 I actually live within 100mi of a sundown town, it boggles my mind how such places still exist in this day & age.",
            "author": "bsbdfw",
            "id": "erpxmu8",
            "parent_id": "t3_c394bm",
            "score": 8,
            "created_utc": 1561130428.0,
            "replies": [
                {
                    "body": "Yes, I was shocked at how different things are in California. I was almost afraid to respond to some messages! \"You know we ain't supposed to be making eyes in public, lady!!!!!\"",
                    "author": "the_great_blacksby",
                    "id": "ers2u1w",
                    "parent_id": "t1_erpxmu8",
                    "score": 3,
                    "created_utc": 1561196747.0,
                    "replies": []
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "erqgx1q",
                    "parent_id": "t1_erpxmu8",
                    "score": 4,
                    "created_utc": 1561143094.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "erqic6v",
                            "parent_id": "t1_erqgx1q",
                            "score": 4,
                            "created_utc": 1561144049.0,
                            "replies": [
                                {
                                    "body": "I live in the southeast and even I didnt know what that term was. That's absolutely terrible!",
                                    "author": "Mopsydoll",
                                    "id": "erqp0er",
                                    "parent_id": "t1_erqic6v",
                                    "score": 2,
                                    "created_utc": 1561148562.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Wow, as one of the complaining black SB's, I found it very resourceful to here from your point of view. And as unfortunate as it is that we have these slight dilemmas it is refreshing to know it's not just the black babies who have a difficult time.\n\n&#x200B;\n\nIt's gotten to the point I've scheduled cosmetic surgery to enhance my body in ways that fit what a white SD (Because they are the majority in the bowl) is expecting from a black SB. \n\n&#x200B;\n\nIt sounds shitty when I write it out but it's just the reality. Also shitty but when I run across a black SD I do pass them up even though I'd prefer them, I've encountered many who really low ball me or expect the most and give nothing in return so I tend to just avoid them unless I meet them out.\n\n&#x200B;\n\nAnyhow, I have hope for us just takes a little more effort than the rest :)",
            "author": "PrettynLavish",
            "id": "erq7vzy",
            "parent_id": "t3_c394bm",
            "score": 7,
            "created_utc": 1561137200.0,
            "replies": [
                {
                    "body": "Do what you feel is best for your sugaring. Nothing wrong with that!\n\nThere's no filter for SDs getting into the bowl so a lot of dudes try to apply normal dating logic and behaviors. Others have an ego issue where they think paying is a sign of weakness. I'm not an SB so I don't know how hard it is to screen for dudes like that",
                    "author": "the_great_blacksby",
                    "id": "ers1qm4",
                    "parent_id": "t1_erq7vzy",
                    "score": 2,
                    "created_utc": 1561194923.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "erqfgrk",
            "parent_id": "t3_c394bm",
            "score": 5,
            "created_utc": 1561142129.0,
            "replies": [
                {
                    "body": "Where did I judge anyone? Please copy and paste the exact words so I can point out where you misread what I wrote or where you projected something else entirely.\n\nSecondly, I don't see where I complained. I love every minute of being in the bowl. That doesn't mean I can't share the bad with the good.",
                    "author": "the_great_blacksby",
                    "id": "ers1dxu",
                    "parent_id": "t1_erqfgrk",
                    "score": 2,
                    "created_utc": 1561194342.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I'm a black SB and I've had bad experiences with black sugar daddies. LIKE REALLY AWFUL. I too live in the South. You have to understand that a lot blacks down here act unfavorably and the stereotype reflects badly on all of us. Also there is an STD problem among black men in the South. I only respond to white SDs. I definitely don't blame the SBs it's just something we have to deal with. I would recommend making yourself stand out of much of possible and also appearing \"presentable\", high class and clean in photos. You have to shake off the stereotype.",
            "author": "Kayakklay",
            "id": "erq6yk0",
            "parent_id": "t3_c394bm",
            "score": 10,
            "created_utc": 1561136605.0,
            "replies": [
                {
                    "body": "I’m a black sb and had poor experiences with black sds and it’s sad because I love black men but I’m always going to go where I’m celebrated and it’s not with them sadly...",
                    "author": null,
                    "id": "erqfflc",
                    "parent_id": "t1_erq6yk0",
                    "score": 9,
                    "created_utc": 1561142107.0,
                    "replies": [
                        {
                            "body": "Exactly! I feel the same way",
                            "author": "Kayakklay",
                            "id": "erspdg6",
                            "parent_id": "t1_erqfflc",
                            "score": 1,
                            "created_utc": 1561220628.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "The assumption that I don't appear high-class, clean or presentable is actually the problem. It doesn't matter if I do, can't wash off my skin. (Well, Michael Jackson did. Maybe that is an option....)\n\nThat said, I didn't write this post for pity. I'm rich, have a great life and many good times. \n\nA lot of people think like you've pointed out and act accordingly. Nothing wrong with that and nothing I can do to change it.",
                    "author": "the_great_blacksby",
                    "id": "ers1vll",
                    "parent_id": "t1_erq6yk0",
                    "score": 8,
                    "created_utc": 1561195155.0,
                    "replies": [
                        {
                            "body": "My assumption was just based on the black SD profiles I've seen. because you're on the other side you may not see what their profiles are. They usually not good with really bad photos and they look like they just want an escort. Unfortunately these are just stereotypes that both black SDs and black SB have to overcome.",
                            "author": "Kayakklay",
                            "id": "erspiy7",
                            "parent_id": "t1_ers1vll",
                            "score": 1,
                            "created_utc": 1561220747.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "As a black woman in the DC area....I cannot stand black men. They’re stingy and always want the most for the least....I’ve tried to date black men on and off, but now I strictly date white guys because they treat me better. I also find that they’re scammers sometimes or try to get over on me some how, Actually dating black men has been great for me, but sugaring has been a no go.",
            "author": "PinkCookies223",
            "id": "errpmhc",
            "parent_id": "t3_c394bm",
            "score": 5,
            "created_utc": 1561178385.0,
            "replies": [
                {
                    "body": "That's a really sad outcome. That people did that to you, and that that's the conclusion it lead to.",
                    "author": "the_great_blacksby",
                    "id": "erry2x0",
                    "parent_id": "t1_errpmhc",
                    "score": 2,
                    "created_utc": 1561189034.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "ertghyz",
                            "parent_id": "t1_erry2x0",
                            "score": 3,
                            "created_utc": 1561241719.0,
                            "replies": [
                                {
                                    "body": "This is so true! We are carrying generational and racial mindset of poverty!",
                                    "author": null,
                                    "id": "eu5j7r0",
                                    "parent_id": "t1_ertghyz",
                                    "score": 2,
                                    "created_utc": 1563478721.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "erv1pmu",
                    "parent_id": "t1_errpmhc",
                    "score": 1,
                    "created_utc": 1561303950.0,
                    "replies": [
                        {
                            "body": "Who says I don’t hold white men accountable? And who says i don’t STILL try to date black men even though I’m fed up? You sound mad and you don’t even know me lol. Ask better questions that aren’t based off of assumptions next time.",
                            "author": "PinkCookies223",
                            "id": "erv2hk5",
                            "parent_id": "t1_erv1pmu",
                            "score": 2,
                            "created_utc": 1561304581.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "erv3gd3",
                                    "parent_id": "t1_erv2hk5",
                                    "score": 1,
                                    "created_utc": 1561305342.0,
                                    "replies": [
                                        {
                                            "body": "Most black women aren’t any better either I’ve heard horror stories from both black and white men. The people I date don’t know I have these presumptions telling them that would be a major turn off the same way it is for me.",
                                            "author": "PinkCookies223",
                                            "id": "erv4o6q",
                                            "parent_id": "t1_erv3gd3",
                                            "score": 2,
                                            "created_utc": 1561306307.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I have only seen like three or four black daddies ever on SA, to my dismay. What are your thoughts on Oregon specifically? I went out with one black guy that was cool, but it didnt work out. He wanted multiple babies at the same time and that's just not my vibe. Thank you for sharing, I wish you were here to play with me :).",
            "author": "CosmicSynergy",
            "id": "erpwv8h",
            "parent_id": "t3_c394bm",
            "score": 4,
            "created_utc": 1561129912.0,
            "replies": [
                {
                    "body": "My thoughts on Oregon are, *damn that's a white state*!!!! J/K I've never been and would love to come. Is that an invitation! :-)",
                    "author": "the_great_blacksby",
                    "id": "ers2w13",
                    "parent_id": "t1_erpwv8h",
                    "score": 2,
                    "created_utc": 1561196836.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "South East Asian SBs here. Thank you for sharing your experience. My black and mixed daddies have been the best in my experience, and I wish there were more of them :)",
            "author": "shuttingsen",
            "id": "erqv3tt",
            "parent_id": "t3_c394bm",
            "score": 4,
            "created_utc": 1561152824.0,
            "replies": [
                {
                    "body": "I wish there were more of you! Tell your daddies to share! j/k",
                    "author": "the_great_blacksby",
                    "id": "erryvvs",
                    "parent_id": "t1_erqv3tt",
                    "score": 2,
                    "created_utc": 1561190265.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I would go heavy on the education & occupational field - off the top of my head a Ph.D. in Mathematics from a top 10 University, former computational biologist now a consultant to big pharma. \n\nA SB seeing serious credentials is more likely to view you as someone who is established and has the means to provide.",
            "author": "whatshouldIdonow8907",
            "id": "err4xjm",
            "parent_id": "t3_c394bm",
            "score": 4,
            "created_utc": 1561160378.0,
            "replies": []
        },
        {
            "body": "Very interesting read. I come from a country full of black people so black sugar daddies are the norm and they are usually very generous, not just to their SBs but also to SB friends who tag along. Also, the sugar Daddy relationship is more open and out there with at least 25% of  college aged people having an SD.",
            "author": "cricketrmgss",
            "id": "erqeram",
            "parent_id": "t3_c394bm",
            "score": 3,
            "created_utc": 1561141656.0,
            "replies": [
                {
                    "body": "Nigeria?",
                    "author": "the_great_blacksby",
                    "id": "ers1en5",
                    "parent_id": "t1_erqeram",
                    "score": 1,
                    "created_utc": 1561194373.0,
                    "replies": [
                        {
                            "body": "Lololol. \nI love & hate that you mentioned my fatherland but that was my first guess as well.",
                            "author": "bsbdfw",
                            "id": "erujtn0",
                            "parent_id": "t1_ers1en5",
                            "score": 3,
                            "created_utc": 1561284091.0,
                            "replies": [
                                {
                                    "body": "I've only my been once but that description sounds just like it, lol",
                                    "author": "the_great_blacksby",
                                    "id": "esttj75",
                                    "parent_id": "t1_erujtn0",
                                    "score": 2,
                                    "created_utc": 1562273247.0,
                                    "replies": [
                                        {
                                            "body": "The African sugar bowl beats western region any day of the week. Almost makes me wish I went there for college.",
                                            "author": "bsbdfw",
                                            "id": "estu6ve",
                                            "parent_id": "t1_esttj75",
                                            "score": 2,
                                            "created_utc": 1562273513.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Thank you for sharing your experience. In my mind you sound like Joshua Johnson from that NPR show 1A😂, that's a good thing btw. \n\nI am extremely new to the bowl and feel like your commentary should go under Sugar Tips for just starting out. I'm 30 years old, Black of Carribbean descent, already educated, and I work full-time, just starting out. I position myself as someone particularly nontraditional. I keep an open mind and I move at my own pace in the bowl. \n\nI firmly believe there is someone for everyone. I always look my best and that may not be for everyone. But traditionally a SB evolves with the companionship and support of her SD. So how I start out must be different then my goal. I search for Black SD because I want them to be a part of that evolution, to have a hand in it. Because the black tax goes both ways, the sizing up to see how far you will go and for the least support or influence is felt in this side of things. Why not stop the tax and enjoy each other! \n\nThanks for the insight and I'm rooting for everybody Black🤷🏾‍♀️",
            "author": "AbsoluteMyr",
            "id": "es0qh76",
            "parent_id": "t3_c394bm",
            "score": 3,
            "created_utc": 1561481014.0,
            "replies": [
                {
                    "body": "Thanks!",
                    "author": "the_great_blacksby",
                    "id": "estsnen",
                    "parent_id": "t1_es0qh76",
                    "score": 1,
                    "created_utc": 1562272909.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I'm a white SB and sex worker in Texas. I LOVE black men! My experience has been that black men are more respectful (especially of sex workers) and less misogynistic than white men. They're nicer, more respectful of my boundaries, better communicators, more generous and considerate lovers... obviously, not ALL, but I've seen enough very notable differences to have developed a preference.",
            "author": "AffectionateTowel9",
            "id": "erqbcga",
            "parent_id": "t3_c394bm",
            "score": 6,
            "created_utc": 1561139405.0,
            "replies": [
                {
                    "body": "Damn, maybe I need to move to Texas",
                    "author": "Mopsydoll",
                    "id": "erqp4za",
                    "parent_id": "t1_erqbcga",
                    "score": 2,
                    "created_utc": 1561148648.0,
                    "replies": []
                },
                {
                    "body": "Where in TX are you?",
                    "author": "platinumsugargirl45",
                    "id": "err73f1",
                    "parent_id": "t1_erqbcga",
                    "score": 1,
                    "created_utc": 1561162134.0,
                    "replies": [
                        {
                            "body": "North Texas, just north of DFW",
                            "author": "AffectionateTowel9",
                            "id": "ersbvxb",
                            "parent_id": "t1_err73f1",
                            "score": 1,
                            "created_utc": 1561208991.0,
                            "replies": [
                                {
                                    "body": "Cool. I'm in Dallas",
                                    "author": "platinumsugargirl45",
                                    "id": "ersby08",
                                    "parent_id": "t1_ersbvxb",
                                    "score": 1,
                                    "created_utc": 1561209053.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "*Hat tip*",
                    "author": "the_great_blacksby",
                    "id": "ers1fx2",
                    "parent_id": "t1_erqbcga",
                    "score": 1,
                    "created_utc": 1561194428.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "erpj9j8",
            "parent_id": "t3_c394bm",
            "score": 6,
            "created_utc": 1561119448.0,
            "replies": [
                {
                    "body": "Im sure it is desperation but it’s beyond me how an out of shape unattractive woman in her 40’s think she’s going to sugar date someone close to her age, who is in way better shape then her, and also get an allowance too.",
                    "author": "ruphun",
                    "id": "erpunzu",
                    "parent_id": "t1_erpj9j8",
                    "score": 3,
                    "created_utc": 1561128425.0,
                    "replies": [
                        {
                            "body": "Yeah, it's more this that I was confused by. Like zero issue if you want to reach 'out of your league' on any other dating site (it may be insensitive) but it's hard to believe they really think they also have the expectation of being paid and 'kept' like\n\nBut I'm sure there's an SD out there for them too",
                            "author": "the_great_blacksby",
                            "id": "ers56d0",
                            "parent_id": "t1_erpunzu",
                            "score": 1,
                            "created_utc": 1561200504.0,
                            "replies": [
                                {
                                    "body": "> But I'm sure there's an SD out there for them too\n\nI'm sure there are, but they may have to jump up to 60 or 70 year old men, and stop trying for guys close to their age.",
                                    "author": "ruphun",
                                    "id": "erumfgr",
                                    "parent_id": "t1_ers56d0",
                                    "score": 2,
                                    "created_utc": 1561288179.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "erpvnnb",
            "parent_id": "t3_c394bm",
            "score": 3,
            "created_utc": 1561129094.0,
            "replies": [
                {
                    "body": "Totally agree with this. This is why I tried not to come across as blaming people for any of these situations. It just is what it is. \n\nI only know what the 'white SD experience' is like from friends who I love (SBs and SDs), who share stories with me.\n\nI literally cannot complain about anything. I'm living the American dream in many ways. In fact, my biggest insecurity is that sometimes I feel I'm exploiting the misfortune of poor SBs in the bowl. That's not a race insecurity but a class one.",
                    "author": "the_great_blacksby",
                    "id": "ers32gt",
                    "parent_id": "t1_erpvnnb",
                    "score": 3,
                    "created_utc": 1561197128.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Enjoyed your post a lot! Thank you!",
            "author": "professorxc",
            "id": "erpj866",
            "parent_id": "t3_c394bm",
            "score": 2,
            "created_utc": 1561119408.0,
            "replies": []
        },
        {
            "body": "Thank you for the insight! I appreciated the post.",
            "author": "SBLina",
            "id": "err9c22",
            "parent_id": "t3_c394bm",
            "score": 2,
            "created_utc": 1561163915.0,
            "replies": []
        },
        {
            "body": "There are assumptions, of course. You made a comprehensive list.  I'll add two. \n\nOne is that you have a plethora of women ready to screw you, if you are attractive, courteous and have $$$ to spare. A smiling, generous, laid back guy with good looks is always on the list. Akon looks better than Drake, so hey. \n\nSecond is that there is a steady woman (wife or live-in girlfriend) hanging off you and no one wants to fight with her over you, when the news gets out. You will marry her whenever, as you know she will wait, so while she is crying and stalking, you can go out and have your pick of the pretty flowers in the field. \n\nI cannot extend it to all but I have yet to meet a truly single, as in really single, hot black dude with $$$. There was a woman in the midst who was refuting the fact that just because there wasn't a marriage certificate, didn't mean she was his Mrs. \n\nPeople make assumptions of the future based on the past, so some will allow their past experiences to push them to overlook you or seriously doubt you.",
            "author": "SpentHis_MilfMoney",
            "id": "eruspgn",
            "parent_id": "t3_c394bm",
            "score": 2,
            "created_utc": 1561296030.0,
            "replies": [
                {
                    "body": "True. I don't think I'm hot but I think I qualify for all the rest. I guess I'm the last black unicorn like Tiffany Haddish!",
                    "author": "the_great_blacksby",
                    "id": "estt8eh",
                    "parent_id": "t1_eruspgn",
                    "score": 1,
                    "created_utc": 1562273140.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "As a dark skinned SB I think it's deftinely tough all around. Since I have dated any race because for me there has to be attraction, race was never an issue. I understand most see us as loud, always complaining, mean, but it's not true for myself. Most of my SD have been with white or Asian men to be honest but that has more to do with either reaching out.",
            "author": "sandalwood87",
            "id": "erwf48c",
            "parent_id": "t3_c394bm",
            "score": 2,
            "created_utc": 1561341765.0,
            "replies": [
                {
                    "body": "Nothing wrong with that!",
                    "author": "the_great_blacksby",
                    "id": "estszz3",
                    "parent_id": "t1_erwf48c",
                    "score": 1,
                    "created_utc": 1562273044.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Great write up and insight. I am pretty new to the bowl and live in a very white area of western Canada (I am white myself). I wish we had more diversity here, I prefer Eddy Murphy over Ryan Reynolds any day.",
            "author": "Ashleede",
            "id": "erpyge9",
            "parent_id": "t3_c394bm",
            "score": 3,
            "created_utc": 1561130976.0,
            "replies": [
                {
                    "body": "I've been to Montreal and dated there for a while. I've been to Whistler once but didn't have time to explore the scene. :-(",
                    "author": "the_great_blacksby",
                    "id": "ers2r94",
                    "parent_id": "t1_erpyge9",
                    "score": 1,
                    "created_utc": 1561196617.0,
                    "replies": [
                        {
                            "body": "I am near Vancouver! If you’re up here some time in the future, or plan to be, let me know ☺️",
                            "author": "Ashleede",
                            "id": "erzom60",
                            "parent_id": "t1_ers2r94",
                            "score": 2,
                            "created_utc": 1561443861.0,
                            "replies": [
                                {
                                    "body": "Will do",
                                    "author": "the_great_blacksby",
                                    "id": "estspt9",
                                    "parent_id": "t1_erzom60",
                                    "score": 1,
                                    "created_utc": 1562272934.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I’m in the south and as an SB I’ve tried Black SDs time and time again and they are just normally trash which is extremely disappointing because I’d really like a good black SD. You do seem like a unicorn if your position is true but your counterparts make Black SDs look very bad in the bowl generally. It’s gotten so bad I know many black SBs who wont deal with black SDs because of the past experiences they have constantly had. \n\nBlack SDs are usually not naturally generous, they like to “test” the product before paying, they are flakey, they are mean, they are easily jaded, they are very cheap, they go on SA not looking for an escort but then talk to SBs like escorts. The list just goes on and on and on. I’ve had a POT Black SD tell me he only provided money on a “as need” basis not ppm or monthly allowance 😑. Another one told me that he was looking to save someone from the “sugar life” and that since he wasn’t a wrinkled old white man he didn’t have to “pay for sex”. Lastly I had a black US Senator SD who was a complete flake after hounding me down to give him the time of day. \n\nI say all that to say that your perception is valid but what you maybe experiencing is due to your peers. It’s not your responsibility to fix it but hopefully understanding where it stems from gives you some solace. \n\nBlack Sbs also fave their own issues in the bowl so hopefully you are giving those black SBs that you are attracted to a chance at an arrangement. 😊",
            "author": "kynoir",
            "id": "erptvb6",
            "parent_id": "t3_c394bm",
            "score": 1,
            "created_utc": 1561127882.0,
            "replies": []
        },
        {
            "body": "Great post.",
            "author": "YourExoticBabe",
            "id": "erqexv7",
            "parent_id": "t3_c394bm",
            "score": 1,
            "created_utc": 1561141779.0,
            "replies": []
        },
        {
            "body": "Very interesting read, many thanks OP. Lot of readers here verify your experience. \n\nAs person of color I'd been lucky to find an SB, who was too good and I didn't need more.\n\nGood luck, persistence will pay. Luckily for you there's a tax refund every year. Just kidding. F my tax bracket.",
            "author": "OrnierThanU",
            "id": "erqy1fg",
            "parent_id": "t3_c394bm",
            "score": 1,
            "created_utc": 1561154973.0,
            "replies": [
                {
                    "body": "Lol, respect!",
                    "author": "the_great_blacksby",
                    "id": "erryopf",
                    "parent_id": "t1_erqy1fg",
                    "score": 1,
                    "created_utc": 1561189949.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "In general I see nothing wrong with a daddy or any race, I'm attracted to all sorts of men rofl. My hubby is black as well so honestly I would probably be more comfortable with a black sugar daddy",
            "author": null,
            "id": "erqyen9",
            "parent_id": "t3_c394bm",
            "score": 1,
            "created_utc": 1561155250.0,
            "replies": [
                {
                    "body": "You have a husband and you sugar? That is so hot. Lol",
                    "author": "the_great_blacksby",
                    "id": "erryo21",
                    "parent_id": "t1_erqyen9",
                    "score": 1,
                    "created_utc": 1561189921.0,
                    "replies": [
                        {
                            "body": "Yeah well want to sugar, so far I haven't met the right SD, so working on improving me and losing weight.",
                            "author": null,
                            "id": "es0u1vy",
                            "parent_id": "t1_erryo21",
                            "score": 2,
                            "created_utc": 1561483046.0,
                            "replies": [
                                {
                                    "body": "Good luck, I recently lost some weight and it feels great",
                                    "author": "the_great_blacksby",
                                    "id": "estsjiy",
                                    "parent_id": "t1_es0u1vy",
                                    "score": 1,
                                    "created_utc": 1562272863.0,
                                    "replies": [
                                        {
                                            "body": "Ty! So far it's going great and every pound that comes off feels like heaven hehehe",
                                            "author": null,
                                            "id": "esyvqap",
                                            "parent_id": "t1_estsjiy",
                                            "score": 1,
                                            "created_utc": 1562350529.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I'd love to find a good black SD. I live in the south and I've had bad experiences with the black guys I meet here. My black POTs either we tax season ballin or just trying to finesse. Even the White POTs who had horrible personalities, were more respectful. Its disappointing.",
            "author": "Sbabynaomi76",
            "id": "err4zqh",
            "parent_id": "t3_c394bm",
            "score": 1,
            "created_utc": 1561160427.0,
            "replies": [
                {
                    "body": "What part of the South? I hear the bowl in Florida is brutal but Georgia seems okay.",
                    "author": "the_great_blacksby",
                    "id": "erryn7v",
                    "parent_id": "t1_err4zqh",
                    "score": 1,
                    "created_utc": 1561189885.0,
                    "replies": [
                        {
                            "body": "I'm in Florida, unfortunately.",
                            "author": "Sbabynaomi76",
                            "id": "erurla9",
                            "parent_id": "t1_erryn7v",
                            "score": 1,
                            "created_utc": 1561294841.0,
                            "replies": [
                                {
                                    "body": "Bummer....for many reasons",
                                    "author": "the_great_blacksby",
                                    "id": "esttbgn",
                                    "parent_id": "t1_erurla9",
                                    "score": 1,
                                    "created_utc": 1562273172.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I’m a lurker now but,\n\nI like all races of men but, honestly, I never had any interaction from a  real black sugar daddy. Lots of Splenda/Salt daddies. Genuine ones are  wayyy more difficult to come by. Shoot!! It is difficult to come across a sugar daddy that you mesh with in general regardless of race. Black daddies are like looking for a needle in a big stack of hay.\n\nIf I do see a legit black daddy, I will assume that he is into other races of women so, I don’t even bother. Most of the time, it is implied that he prefers racially ambiguous/ other races of women. It’s easier to find white daddies they seem to be more into black women. At least from my experience. \n\nIf I was in the bowl, the black daddies I would look for would be darker skinned. For some reason, I’m not into light-skinned black men. Lol!",
            "author": "fairiesandhearts",
            "id": "errf4r4",
            "parent_id": "t3_c394bm",
            "score": 1,
            "created_utc": 1561168670.0,
            "replies": [
                {
                    "body": "I can't say I haven't come to same conclusion, but I do prefer darker skinned black women. Gabriel Union is like my perfect 'type'. Well-spoken, slim but not silly thin, and af-am features. \n\nAs discussed above, I've dated mixed girls and Latina's too. White girls, it really depends, but I usually don't bother because of the bs above. Asians and Indians I've had zero success with in the bowl. Well, I met one SE Asian girl for dinner once but her whole vibe was like she'd hit rock bottom, I think she was sad she wasn't getting hit up by anyone else in the bowl other than me. I took her to a nice dinner and then we parted ways. Didn't really need to make it my job to make her feel better about me as an option.",
                    "author": "the_great_blacksby",
                    "id": "erryksp",
                    "parent_id": "t1_errf4r4",
                    "score": 4,
                    "created_utc": 1561189776.0,
                    "replies": [
                        {
                            "body": "I think Gabby is one of those people who are objectively attractive. She has all of the traits that most people regard as attractive. Nice skin, good body, great hair, nice teeth, nice proportions, intelligent, that sort of thing. She is super pretty and pleasant. \n\nShe does have money which helps her further achieve and keep up her specific look but, that’s beside the point. \n\nYeah, I have noticed that as well. In general dating with both non-black men and  non- black women.  They only entertain having a black person as a spouse if they are not having luck with other races.  A lot of the time they are low-quality and you can understand why no one wants them.  \n\nIt’s partially our fault, black folks are known for putting people with non-black phenotypes on some sort of pedestal and those people have noticed. This is why they think they can feed us sh*t and call it sugar. \n\nI know all people don’t have this mindset set but, many people do.\n\n\nIt will happen but, the only way to fight it is to call it out and keep your standards high. Don’t accept anything less than what you want.If you feel like you are someone last option or desperate attempt then politely decline.",
                            "author": "fairiesandhearts",
                            "id": "ersiubt",
                            "parent_id": "t1_erryksp",
                            "score": 5,
                            "created_utc": 1561215344.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yup",
            "author": "cricketrmgss",
            "id": "ert6laz",
            "parent_id": "t3_c394bm",
            "score": 1,
            "created_utc": 1561233857.0,
            "replies": []
        },
        {
            "body": "Thank you for sharing your experiences!\n\nI would love a black SD. I tried it once and he was a terrible person. I would gladly give it another go.",
            "author": "Brownsugaredbrat",
            "id": "ertqykd",
            "parent_id": "t3_c394bm",
            "score": 1,
            "created_utc": 1561250555.0,
            "replies": [
                {
                    "body": "Black and terrible. Sounds like my dad!",
                    "author": "the_great_blacksby",
                    "id": "estuf3c",
                    "parent_id": "t1_ertqykd",
                    "score": 1,
                    "created_utc": 1562273603.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "OP has made my entire day! Great way to make a very touchy subject more palatable, and appropriately humorous!  I'm new to the bowl in the south and appreciate all of this honesty bc it seems hard to come by at this point. Your experiences are interesting bc I would have thought it would be much easier. Nothing to really add to the conversation, but You're a dream. Everyone else's input definitely gives me a different perspective of the bowl in general 😊 so much to gain with posts like this one.",
            "author": "kaasetgira",
            "id": "erts5c6",
            "parent_id": "t3_c394bm",
            "score": 1,
            "created_utc": 1561251599.0,
            "replies": [
                {
                    "body": "The easiest place seems to be California, specifically LA. People are just used to so much mixing there that race is almost an after thought (on the dating scene) it's still kinda weird in professional circles",
                    "author": "the_great_blacksby",
                    "id": "esttu2l",
                    "parent_id": "t1_erts5c6",
                    "score": 1,
                    "created_utc": 1562273371.0,
                    "replies": [
                        {
                            "body": "Oh, that makes so much sense. You're definitely right, but I had no idea that it's kinda weird in professional circles. That's interesting to me....makes me wonder if that shows in the type of SBs that are out there as well. Well, now it's clear to me why some people choose to travel to other areas. It's a preference thing, but there should always be respect.",
                            "author": "kaasetgira",
                            "id": "esztw7g",
                            "parent_id": "t1_esttu2l",
                            "score": 2,
                            "created_utc": 1562367789.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "How are y’all different than hookers and johns?",
            "author": "NicoleKidmansNewChin",
            "id": "erx4rjn",
            "parent_id": "t3_c394bm",
            "score": 1,
            "created_utc": 1561371926.0,
            "replies": [
                {
                    "body": "To most people outside this community, it's not different. \n\nTo people who do it, there are a lot of differences.",
                    "author": "the_great_blacksby",
                    "id": "estsx68",
                    "parent_id": "t1_erx4rjn",
                    "score": 3,
                    "created_utc": 1562273011.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Thank you for sharing your experience. In my mind you sound like Joshua Johnson from that NPR show 1A😂, that's a good thing btw. \n\nI am extremely new to the bowl and feel like your commentary should go under Sugar Tips for just starting out. I'm 30 years old, Black of Carribbean decent, already educated, and I work full-time, just starting out. I position myself as someone particularly nontraditional. I keep an open mind and I move at my own pace in the bowl. \n\nI firmly believe there is someone for everyone. I always look my best and that may not be for everyone. But traditionally a SB evolves with the companionship and support of her SD. So how I start out must be different then my goal. I search for Black SD because I want them to be a part of that evolution, to have a hand in it. Because the black tax goes both ways, the sizing up to see how far you will go and for the least support or influence is felt in this side of things. Why not so the tax and enjoy each other! \n\nThanks for the insight and I'm rooting for everybody Black🤷🏾‍♀️",
            "author": "AbsoluteMyr",
            "id": "erzujiw",
            "parent_id": "t3_c394bm",
            "score": 1,
            "created_utc": 1561452319.0,
            "replies": []
        },
        {
            "body": "I really appreciated your perspective and now I know yes it's racism and I'm just not unattractive. I'm having such a hard time finding an SD. I didn't like how you said \"oh don't get me wrong, I'm not complaining and saying it's different for black ppl\"  but this whole post was about it being different for us... Please don't tiptoe around the truth:/",
            "author": null,
            "id": "eu4ew3h",
            "parent_id": "t3_c394bm",
            "score": 1,
            "created_utc": 1563451625.0,
            "replies": [
                {
                    "body": "I think you misread that. I actually said the opposite, “I’m not complaining but don’t pretend it isn’t different for black people.”",
                    "author": "the_great_blacksby",
                    "id": "evf1jtn",
                    "parent_id": "t1_eu4ew3h",
                    "score": 1,
                    "created_utc": 1564485986.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "> Most range from average to the very hot (and normally out of my league). But there are some very unattractive, out of shape, POTs who seem to think people will literally date anything. It makes me wonder if they are just used to (black) men who have no standards.\n\nWhile a bit crass in your wording it is accurate, but not specific to black men. I'm about as white as they come in all aspects and get messages from overweight, unnatractive girls.\n\nUnfortunately you will find the midwest to be closer to the south than the west when it comes to race relations. We are very much a mix of south, NE, and West, but in this area we are backwards like the south. It's all quiet and behind the scenes and not horrible, but it exists. I've dated a couple black women vanilla and between my experiences with them and their stories it was saddening.",
            "author": "sexviewer",
            "id": "erq25t5",
            "parent_id": "t3_c394bm",
            "score": 1,
            "created_utc": 1561133460.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "errdfpg",
                    "parent_id": "t1_erq25t5",
                    "score": 4,
                    "created_utc": 1561167262.0,
                    "replies": [
                        {
                            "body": "Lol, I mean that wasn't what I meant. I've met some bbws. Not trying to fat shame anyone",
                            "author": "the_great_blacksby",
                            "id": "ers2lqy",
                            "parent_id": "t1_errdfpg",
                            "score": 1,
                            "created_utc": 1561196366.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "ersn8pf",
                                    "parent_id": "t1_ers2lqy",
                                    "score": 1,
                                    "created_utc": 1561218929.0,
                                    "replies": [
                                        {
                                            "body": "Look at me, just negroing the place up!",
                                            "author": "the_great_blacksby",
                                            "id": "estv75a",
                                            "parent_id": "t1_ersn8pf",
                                            "score": 1,
                                            "created_utc": 1562273907.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Yes, crass but unintended. \n\nI think I didn't come across with what I actually meant there. Not the best example and I have no problem with bigger women.",
                    "author": "the_great_blacksby",
                    "id": "ers2nn0",
                    "parent_id": "t1_erq25t5",
                    "score": 2,
                    "created_utc": 1561196451.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I’m a white SB, but my recent vanilla dating history has been black men. I honestly get really excited when I see black SDs on SA. For me it would be more comfortable/familiar of a dynamic since I haven’t been romantically/intimately involved with a white man in awhile. \n\nBut there are very few black SDs on SA in my area. I’ve only interacted with one and he as a total asshat (but so are the majority of SDs).",
            "author": "MASugarBaby",
            "id": "erpsuio",
            "parent_id": "t3_c394bm",
            "score": 1,
            "created_utc": 1561127175.0,
            "replies": [
                {
                    "body": "Lol. Tell brother asshat he's messing up the game for the rest of us!",
                    "author": "the_great_blacksby",
                    "id": "ers3ctf",
                    "parent_id": "t1_erpsuio",
                    "score": 1,
                    "created_utc": 1561197599.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "This post is superb, OP. One of the best I've seen here. Thank you.",
            "author": "slfalt",
            "id": "erqvytw",
            "parent_id": "t3_c394bm",
            "score": 1,
            "created_utc": 1561153445.0,
            "replies": [
                {
                    "body": "Really? Thanks!",
                    "author": "the_great_blacksby",
                    "id": "erryp7s",
                    "parent_id": "t1_erqvytw",
                    "score": 1,
                    "created_utc": 1561189971.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "OP stop.\n\nA lot of the problems you're facing are not because you're a black SD, it's because of your self deafrting mindset!!\n\nLike for example, you said coffee shop meets never work bc given you're black, SBs will assume you're broke. Lmao I'm black. I only ever do M&Gs at Starbucks. I've had 3 long term SRs this past year as well as a few other sugar flings. Has nothing to do with the color of your skin, my guy",
            "author": "ForrestAlpha",
            "id": "ers8rfw",
            "parent_id": "t3_c394bm",
            "score": 0,
            "created_utc": 1561205517.0,
            "replies": [
                {
                    "body": "I don't think you read the post. I've been sugaring for years, and love it. That doesn't mean I don't observe common patterns that aren't great. I shared those patterns because other people aren't having my same experience. Some are unique to being black, some aren't.\n\nThat's like if you did the same and shared only the parts of the bowl that are problematic for you and someone responds, \"You have a self defeating mindset.\" \n\nLike what are you even taking about!? \n\nAcknowledging *some* specific problems and calling them out for others means there's *only* problems? \n\nNo, that's not what that means at all.",
                    "author": "the_great_blacksby",
                    "id": "ersdkr1",
                    "parent_id": "t1_ers8rfw",
                    "score": 3,
                    "created_utc": 1561210684.0,
                    "replies": [
                        {
                            "body": "Of course I didn't read your post. It's like a novel, that how long it is! Who has time for that \n\nI read one part and that's what i responded to.  The part where  you're complaining coffee shop M&Gs  \"NEVER work bc I'm black\"......lol dude",
                            "author": "ForrestAlpha",
                            "id": "erslj6a",
                            "parent_id": "t1_ersdkr1",
                            "score": 0,
                            "created_utc": 1561217570.0,
                            "replies": [
                                {
                                    "body": "Lol, well at least you're honest. To be fair, if didn't write it, I probably wouldn't have read it either.",
                                    "author": "the_great_blacksby",
                                    "id": "estv0zo",
                                    "parent_id": "t1_erslj6a",
                                    "score": 2,
                                    "created_utc": 1562273838.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "\"But there are some very unattractive, out of shape, POTs who seem to think people will literally date anything. It makes me wonder if they are just used to (black) men who have no standards.\"\n\nHonestly fuck off with this. If someone isn't for you, move on. Why are you mad they are shooting their shot? There's a lid for every pot and they probably have to message more people to find someone who is into their thing. There's nothing wrong with a simple intro message to see if you might happen to be into them. I think this is your own insecurity about being black coming out (and I'm sorry we live in a racist world and you have to deal with that) but referring to a human as \"anything\" is gross. In your very next point you talk about shooting your shot with girls who usually don't return the attraction, what if they talked about you this way? Let's all agree there's no harm done with a nice intro message and move on without shaming people.",
            "author": null,
            "id": "erq613g",
            "parent_id": "t3_c394bm",
            "score": -2,
            "created_utc": 1561136006.0,
            "replies": [
                {
                    "body": "You're argumentative and needlessly sensitive. \n\nSo I have standards about health and beauty in the women I date. Glad to hear that you don't. Is that what you're trying to say?\n\nAlso, thanks for telling me to \"fuck right off\" for sharing that preference on a forum where....people share things for you to read. I didn't know I needed to watch out for the PC police. Next time I'll remove all the thoughts that you personally can't tolerate because they trigger you.\n\nSecondly, you seem to think this post reads insecurity about anything. I never said I cared whether white, Asian or Indian girls write back. I just reported to you that they don't. In other words, to share my experience in the bowl and inform others.\n\nFinally, you asked 'what if POTs talked like that about you'. Uh, they do, did you not read the middle of the post. Totally up to them to live and insult people as they want. You too, triggered internet person!",
                    "author": "the_great_blacksby",
                    "id": "ers2777",
                    "parent_id": "t1_erq613g",
                    "score": 4,
                    "created_utc": 1561195693.0,
                    "replies": [
                        {
                            "body": "I just don't understand why you get mad over a message. I get unwanted messages on all kinds of dating/social apps all the time. I can't be mad at people for trying.",
                            "author": null,
                            "id": "ert0dz4",
                            "parent_id": "t1_ers2777",
                            "score": 1,
                            "created_utc": 1561229010.0,
                            "replies": [
                                {
                                    "body": "Not mad and not mad at them. Just a poor choice of words on my part above",
                                    "author": "the_great_blacksby",
                                    "id": "estvmjq",
                                    "parent_id": "t1_ert0dz4",
                                    "score": 1,
                                    "created_utc": 1562274059.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "erq9t1r",
                    "parent_id": "t1_erq613g",
                    "score": -1,
                    "created_utc": 1561138423.0,
                    "replies": [
                        {
                            "body": "that’s also bad?",
                            "author": null,
                            "id": "erqalzu",
                            "parent_id": "t1_erq9t1r",
                            "score": 2,
                            "created_utc": 1561138939.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": ">There's a lid for every pot\n\nThat is a cruel lie. Even in vanilla, the statistics show a move away from both marriage and relationships. A lot of people who never date, never have sex, and it's growing. As pornography and artificial intelligence mix, that trend will accelerate. More and more people will live (and die) alone.\n\nIn sugar, I'm \"poor\" relative to a lot of guys who post here, and I've literally got my pick of amazing looking women just because I'm able to provide a not-totally-shitty allowance. Women who are older and out of shape have no idea what they are competing against. Women who are older and in shape and happy -- they've got a real chance. But the women the OP described in his post are wasting their time, and they would serve themselves better by gonig to the gym for whatever period of time each day they are checking SA. That's the stone cold truth.",
                    "author": "slfalt",
                    "id": "erqwhsq",
                    "parent_id": "t1_erq613g",
                    "score": -1,
                    "created_utc": 1561153832.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "erssfmg",
                            "parent_id": "t1_erqwhsq",
                            "score": 3,
                            "created_utc": 1561222960.0,
                            "replies": [
                                {
                                    "body": "I don't see any reason to believe that. Much more likely, based on vanilla online dating trends, that the two groups say no to each other. But suppose you are right. Does that strike you as a way for a woman to improve her self-respect and mental health?",
                                    "author": "slfalt",
                                    "id": "ersszyk",
                                    "parent_id": "t1_erssfmg",
                                    "score": 2,
                                    "created_utc": 1561223392.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Two paragraphs and not a single part of it relates to why there isn't a lid for every pot. You say you have a lot of selection, great! I'm glad you personally can pick your preference. But what you don't say is anything about how you know these women are not getting any matches at all or \"not dating/having sex\". IDK what marriage even has to do with this conversation, there are lots of people who happily have relationships without the goal being marriage and I'd guess people who have dabbled in sugar are going to be these kind of people.",
                            "author": null,
                            "id": "err1evp",
                            "parent_id": "t1_erqwhsq",
                            "score": 1,
                            "created_utc": 1561157569.0,
                            "replies": [
                                {
                                    "body": "> Two paragraphs and not a single part of it relates to why there isn't a lid for every pot\n\nIt's an extremely well known trend, often studied in the context of the rise of childlessness. Here's an example that is not behind a paywall. Note that the biggest reason, by far, is, \"I live alone and do not have a steady partner.\" \"No steady partner\" is rising along with childlessness.\n\nhttps://onlinelibrary.wiley.com/doi/full/10.1111/j.1475-6781.2008.00110.x",
                                    "author": "slfalt",
                                    "id": "err21fs",
                                    "parent_id": "t1_err1evp",
                                    "score": 2,
                                    "created_utc": 1561158061.0,
                                    "replies": [
                                        {
                                            "body": "Do those people want a partner and have been rejected by everyone? Or are they people who weren't successful in their younger years and simply decided to go it alone? The narrative I have heard about this is that people give up. We are talking about women who are on a dating site actively messaging people. I do think there is a lid for every pot (or at least, the vast majority of pots) and you can find it if you try.  I'm super happy you are using your resources to get what you want, but your tastes just aren't everyone's taste. It's not just good-looking couples that are going on dates or having sex. If these women aren't getting messaged back, they'll get off the platform. It's a problem that takes care of itself and the only think OP is accomplishing by shaming them is trying to shut them down from talking to someone who might be happy to talk to them back.",
                                            "author": null,
                                            "id": "err3ti4",
                                            "parent_id": "t1_err21fs",
                                            "score": 3,
                                            "created_utc": 1561159482.0,
                                            "replies": [
                                                {
                                                    "body": ">If these women aren't getting messaged back, they'll get off the platform\n\nNot if people on the internet say there's a lid for every pot, chin up you can do it. That's why comments like yours concern me. You are selling snake oil, instead of helping people figure things out.",
                                                    "author": "slfalt",
                                                    "id": "err50vj",
                                                    "parent_id": "t1_err3ti4",
                                                    "score": 0,
                                                    "created_utc": 1561160453.0,
                                                    "replies": [
                                                        {
                                                            "body": "I don't think I am. This is something I've thought about, talked to my therapist about, read about, read reddit comments about, and listened to people talk about A Lot because I used to think no one would ever date me even in vanilla. Once I got through therapy and wasn't an insecure, shame filled mess suddenly I went from having no dates to having really great relationships w quality men. My physical appearance did not change. I just think you don't have experience with men who aren't you while I do. I also think, it's a harmless hello you can scroll past. I can't get mad about every man on every app that messages me that I'm not interested in. I mean, i could, but my quality of life would be worse for it.",
                                                            "author": null,
                                                            "id": "err5gxj",
                                                            "parent_id": "t1_err50vj",
                                                            "score": 3,
                                                            "created_utc": 1561160812.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "erpolpu",
            "parent_id": "t3_c394bm",
            "score": 1,
            "created_utc": 1561124076.0,
            "replies": [
                {
                    "body": "If I wrote 'tech' it's a typo.",
                    "author": "the_great_blacksby",
                    "id": "ers42b0",
                    "parent_id": "t1_erpolpu",
                    "score": 1,
                    "created_utc": 1561198739.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Interesting post ! Im a mixed sd. Ive had quite a few sbs, ironically none of them were white. I feel like a good mix reach out to me, but then again i have no pics up on my profile. All of my srs have been with hispanic, middle eastern, asian. My allowances are much lower than your average sd, but i dont pay the old sd / black sd tax.",
            "author": "dade_murphy1",
            "id": "erq9irt",
            "parent_id": "t3_c394bm",
            "score": 1,
            "created_utc": 1561138237.0,
            "replies": [
                {
                    "body": "How do you get SBs with no pics? People don't think your trying to scam them at first?",
                    "author": "the_great_blacksby",
                    "id": "ers1hwr",
                    "parent_id": "t1_erq9irt",
                    "score": 1,
                    "created_utc": 1561194518.0,
                    "replies": [
                        {
                            "body": "I send pics after we start talking, but i need discretion initially. I make sure my profile us very well written, and interesting.",
                            "author": "dade_murphy1",
                            "id": "ertdzv4",
                            "parent_id": "t1_ers1hwr",
                            "score": 1,
                            "created_utc": 1561239717.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I enjoyed reading your post ! Thanks for the perspective.",
            "author": "GSSD",
            "id": "erqdcln",
            "parent_id": "t3_c394bm",
            "score": 1,
            "created_utc": 1561140722.0,
            "replies": []
        },
        {
            "body": "I’m in the south and as an SB I’ve tried Black SDs time and time again and they are just normally trash which is extremely disappointing because I’d really like a good black SD. You do seem like a unicorn if your position is true but your counterparts make Black SDs look very bad in the bowl generally. It’s gotten so bad I know many black SBs who wont deal with black SDs because of the past experiences they have constantly had. \n\nBlack SDs are usually not naturally generous, they like to “test” the product before paying, they are flakey, they are mean, they are easily jaded, they are very cheap, they go on SA not looking for an escort but then talk to SBs like escorts. The list just goes on and on and on. I’ve had a POT Black SD tell me he only provided money on a “as need” basis not ppm or monthly allowance 😑. Another one told me that he was looking to save someone from the “sugar life” and that since he wasn’t a wrinkled old white man he didn’t have to “pay for sex”. Lastly I had a black US Senator SD who was a complete flake after hounding me down to give him the time of day. \n\nI say all that to say that your perception is valid but what you maybe experiencing is due to your peers. It’s not your responsibility to fix it but hopefully understanding where it stems from gives you some solace. \n\nBlack Sbs also face their own issues in the bowl so hopefully you are giving those black SBs that you are attracted who teach out a chance at an arrangement. 😊",
            "author": "kynoir",
            "id": "erptvb7",
            "parent_id": "t3_c394bm",
            "score": -1,
            "created_utc": 1561127882.0,
            "replies": [
                {
                    "body": "It's definitely due to my peers, it's also due to inexperience and misunderstanding what SDing is (not unique to any race), and other wider societal problems that the bowl didn't create and damn sure won't fix. \n\nJust sharing my experience and what it's been like. Not complaining or casting blame in any place.\n\nI'm a content, well-honeyed SD",
                    "author": "the_great_blacksby",
                    "id": "ers3a5c",
                    "parent_id": "t1_erptvb7",
                    "score": 3,
                    "created_utc": 1561197477.0,
                    "replies": []
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "erqoj8c",
                    "parent_id": "t1_erptvb7",
                    "score": 2,
                    "created_utc": 1561148240.0,
                    "replies": [
                        {
                            "body": "Probably a State Senator. If it's a US Senator that's a very short list and juicy as fuck, if true. Lol",
                            "author": "the_great_blacksby",
                            "id": "ers36bz",
                            "parent_id": "t1_erqoj8c",
                            "score": 3,
                            "created_utc": 1561197305.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": ">  Not Blake or Obama black....Akon and Jamie Foxx black! \n\nI actually lol'd at this. At least you're not Wesley Snipes black. \n\n&#x200B;\n\nIn all seriousness though, thanks for your perspective on this. I'm not white either, I'm of Hispanic descent but my look is very non hispanic in pics. I can look more middle eastern to certain eyes, and very much so in pictures. I've gotten a mix of \"no, you don't look middle eastern at all, you look Hispanic\" to \"oh yeah, for sure i thought you were middle eastern due to the pics. You look better in person.\"  So i know that this fact kills some prospects for me; however nowhere near what you experience is like. \n\n&#x200B;\n\nthe fact that you have to pay the \"Black daddy tax\" as you called it does suck, but get it how you can my man. Also not surprising the South is where you see more of this. I fear for my safety sometimes when i travel to remote parts of towns in southern states.",
            "author": "pintodinosaur",
            "id": "erppa3e",
            "parent_id": "t3_c394bm",
            "score": 0,
            "created_utc": 1561124594.0,
            "replies": [
                {
                    "body": "> I actually lol'd at this. At least you're not Wesley Snipes black.\n\n Hahaha! That's funny but I gotta give props to him too, I was struggling in the 80s until he made it sexy to be chocolate. Then he tried to make it sexy to go to jail for tax fraud and I was out!\n\n> the fact that you have to pay the \"Black daddy tax\" as you called it does suck, but get it how you can my man. \n\nI don't mind paying it. Par for the course. I just am not oblivious to the fact that that's what it is, lol\n\n> Also not surprising the South is where you see more of this. I fear for my safety sometimes when i travel to remote parts of towns in southern states.\n\nI don't even take out the trash at night at my grandma's house (she lives in cross-burning Georgia)",
                    "author": "the_great_blacksby",
                    "id": "ers416s",
                    "parent_id": "t1_erppa3e",
                    "score": 3,
                    "created_utc": 1561198689.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Funny, because the banner to this subreddit has a black man and an Asian woman. And the side banner is also of a black man and Asian woman. I wonder if this was don't to purposely make it diverse. Personally I find it very stereotypical of the Asian SB.",
            "author": "sf_degen",
            "id": "erq47z9",
            "parent_id": "t3_c394bm",
            "score": 0,
            "created_utc": 1561134828.0,
            "replies": [
                {
                    "body": "Interesting observation. To use a different example,  Google often has black people in its workforce ads but less than 3% of their staff is black. Pics and marketing and reality don't always match. Nor do they need to, sometimes it's the company trying to attract people.\n\nAlso, the founder of SA is Asian and I'm sure his experience is interesting even as the creator.\n\nIn any case, I was just sharing what it's like for me. The bowl didn't create these behaviors, norms, or issues and it won't change them",
                    "author": "the_great_blacksby",
                    "id": "ers2jm1",
                    "parent_id": "t1_erq47z9",
                    "score": 2,
                    "created_utc": 1561196269.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "erpikxk",
            "parent_id": "t3_c394bm",
            "score": -8,
            "created_utc": 1561118764.0,
            "replies": [
                {
                    "body": "I kept striking out with American Asian SBs so I just took my ass to South Korea and Japan...mind blown. Korea is basically a physical sugar bowl! It's so the norm there I didn't even need Seeking to find a wonderful college aged SB who I dated (six months) and still keep in touch with. \n\nThere they call them 'Juicy Juicy Girls'. Like a mix between a stripper, escort, and poor college girl. Hard to explain but it was as culturally  accepted as stripping is in most places (so not totally but somewhat).",
                    "author": "the_great_blacksby",
                    "id": "ers4n4l",
                    "parent_id": "t1_erpikxk",
                    "score": 2,
                    "created_utc": 1561199664.0,
                    "replies": []
                },
                {
                    "body": ">So if you're looking for white or asian, go for it but be patient.  There are some out there for you. Ball out bro.\n\n&#x200B;\n\nI agree. OP will just have to look a little harder but they are out there. As i stated, i do notice that have a little harder time myself with the Caucasian women, but I have been able to click with a couple. As stated once we meet in person, it goes way better. Getting to the meet is the hard part.",
                    "author": "pintodinosaur",
                    "id": "erppsjc",
                    "parent_id": "t1_erpikxk",
                    "score": 0,
                    "created_utc": 1561124981.0,
                    "replies": [
                        {
                            "body": "Agreed. Most people's 'preference' is a poorly constructed image based on past bad experiences and what they've heard or assumed. So getting in front of someone can make all the difference.\n\nI've dated girls in the past who were in the same friend group that would have previously said things like 'I don't date black guys'. But in the right situation, the right conversation or good time and they become more interested and less guarded. Same with me, I never knew I had a thing for SE Asian girls until I became friends with a lot of them. Then Schwing!!!!!",
                            "author": "the_great_blacksby",
                            "id": "ers4tj6",
                            "parent_id": "t1_erppsjc",
                            "score": 2,
                            "created_utc": 1561199947.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Interesting write-up, thanks for posting it!  There are some things there that don't surprise me, e.g., the reprehensible practice of putting racial preferences on profiles, and racial groups you get more or fewer responses from.  I have one black friend who has inconsistently been in the bowl, and he tells me the same things (along with a lot of the other things you experienced, such as his enormous popularity with black POTs, skepticism that he has the $, etc).  There's also a few areas where I'm not sure whether you're just experiencing what we all go through, or are experiencing something different.  3 examples: \n\n>  But there are some very unattractive, out of shape, POTs who seem to think people will literally date anything. \n\nAs far as SBs who contact me first, I'd say an enormous percentage of them (upwards of 80%, maybe) are either escorts, or well below average in looks for the bowl.  It makes sense that that people with fewer options, and people who are professionals, will be hunting more.  \n\n> Some SBs seem to want to ‘test’ my individual wealth by asking for things and favors right away that i presume they wouldn’t get away with others.  \n\nThis is a pretty universal experience that SDs discuss a lot.   I learned early on that as soon as a POT makes an inappropriate request, even a small one, it's best to just move on completely.  I call it the Hustler Interview -- that first small (but inappropriate, at this phase of relationship) request is to see if you're spineless or naive enough to give in; if you \"pass\" the test, her requests will escalate quickly.   Not saying you might not be getting these \"tests\" more than me, just that there is an element of this happening to all SDs.  The point, maybe, is that it's so common, I have name for it.  That said, for me, it's always clearly a Hustler Interview rather than a wealth test, as best I can tell.\n\n> I’ve learned that I do not have the privilege of ever doing a low-key M and G in a really casual setting. I made the mistake of asking a first time SB to meet me at a divvy sports bar for a first meet. \n\nI don't have much to compare to here, because even though I enjoy dive bars, I've never tried to set up a M&G at one; unless I know in advance she loves dives bars, I think it's a clearly inappropriate place to propose we meet.  Is it possible this was less about privilege, than about you setting up a M&G at an inappropriate venue, and a savvy and confident SB calling you on it?  I've never set up a M&G at a dive because I feel like what happened to you, is exactly what might happen to me.  Being pressed for time and the place was close isn't an excuse -- I either set up the M&G at an appropriate place, or if I can't do that because I'm pressed for time, put the M&G off.  In addition, I no longer do coffee M&Gs at all, because like you, I think they too often don't lead things to progress.  Although for me, the explanation is that coffee is the most contrived, least romantic first meeting place ever, and much harder (at least for me) to make a connection.  It could be we have the same conclusion (coffee M&Gs don't work) for completely different reasons.\n\nAnyway, good stuff, thanks for sharing it",
            "author": "Azurecole",
            "id": "erppdkm",
            "parent_id": "t3_c394bm",
            "score": -1,
            "created_utc": 1561124669.0,
            "replies": [
                {
                    "body": "Thanks for your post. You make a lot of great and valid observations.\n\n1. I tried to be candid and share my whole experience. So you are correct that a lot of it has nothing to do with race.\n\n2. i read through a lot of forum posts that describe 'escort' 'rinser' or 'pro' tendencies and I have to be completely honest it always lines up like 98% of how many of the black POT SBs approach me. So I'm less harsh because it's hard to tell if they are doing that because they are pros or because they are having  a hard time in the bowl. I find that generally black, Latina and mixed SBs can be more aggressive really as a defense mechanism because of how the world treats them elsewhere\n\n3. A dive bar is probably inappropriate. But I know a lot of guys who suggest coffee shops. So I tried it and had poor results. If the first meet is a nice restaurant, there's almost always at least some courting that follows and sometimes that turns into a long term SR. Anyways I was just pointing out the expectional situations, those are not the norm for me. I stick to the nice restaurants",
                    "author": "the_great_blacksby",
                    "id": "ers3t86",
                    "parent_id": "t1_erppdkm",
                    "score": 3,
                    "created_utc": 1561198340.0,
                    "replies": [
                        {
                            "body": "Definitely with you on coffee shops -- perhaps you and I just aren't coffee shop guys.  I absolutely hate it as a M&G venue.  I actually won't do coffee in my romantic life either.  With both a potential date, and a POT SB, if she digs in and insists on coffee, I always just pass.  Luckily, very few women do this.\n\nNice restaurants definitely work better.  But I also find things a bit formal, you're sitting across the table from each other, etc. My favorite is to find an upscale bar or restaurant/bar for drinks and small plates.  This can still signal (to some extent) wealth and taste to the SB (do you have any idea what a boulevardier costs in a fancy bar??), but in an atmosphere that is already looser and more fun, and when it comes to eating, nothing is more romantic than sitting on the couch next to each other, knees touching, and sharing tapas (or keep more distance if the chemistry isn't there yet).   Anyway, just giving you an idea for another option, since you and I both seem to have the \"no coffee shops\" thing going!",
                            "author": "Azurecole",
                            "id": "erse8wf",
                            "parent_id": "t1_ers3t86",
                            "score": 2,
                            "created_utc": 1561211320.0,
                            "replies": [
                                {
                                    "body": "Great advice!",
                                    "author": "the_great_blacksby",
                                    "id": "ersf0u4",
                                    "parent_id": "t1_erse8wf",
                                    "score": 1,
                                    "created_utc": 1561212036.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "erqoeho",
            "parent_id": "t3_c394bm",
            "score": -2,
            "created_utc": 1561148152.0,
            "replies": [
                {
                    "body": "Are we talking NY Slice, Philly Cheesesteak or Boston Chowda east coast? :-)",
                    "author": "the_great_blacksby",
                    "id": "erryyo2",
                    "parent_id": "t1_erqoeho",
                    "score": 1,
                    "created_utc": 1561190386.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "This is an old post so I'm not sure if you still are on here but I'm a Black SD and I appreciate you sharing. I can relate to just about all of it.",
            "author": "TheStoicbrother",
            "id": "j9ecka4",
            "parent_id": "t3_c394bm",
            "score": 1,
            "created_utc": 1676967743.0,
            "replies": []
        },
        {
            "body": "I'm somewhere between Keenan and Kel. We're all a dude!",
            "author": "the_great_blacksby",
            "id": "ers50ks",
            "parent_id": "t1_erph3q0",
            "score": 6,
            "created_utc": 1561200254.0,
            "replies": []
        },
        {
            "body": "I'm a black sb and I don't mess with BM at all. It's due to bad experiences and just like a lot of SDs have black SBs explictly excluded in their profile for personal reasons so do SBs.\nIt's not fair but neither is life. BM will have a hard time with escorts and pros as well. It's just how it is. There's many articles and youtube content on the subject.",
            "author": "JanStrick",
            "id": "erq6sh8",
            "parent_id": "t1_erplqb3",
            "score": 11,
            "created_utc": 1561136495.0,
            "replies": [
                {
                    "body": "I've heard that too. Even the black SBs that complaimed that there weren't more genuine black SDs emphasized the \"genuine\" part and told how they had bad experiences with black men claiming to be SDs, not wanting to provide an allowance, expecting a discount because they were black or wanted to be their pimp and get them to escort.  \n\nI also know a few local black men that are SDs that I know through other forums that take pride in their pick up artist skills and brag about how many SBs they get for free or cheap.  These same guys complain about escorts and SBs with NBA (No Blacks Allowed) policies. They hurt their own case.  \n\nI also know a few very well off genuine black SDs who treat women very well.  One is an ex NFL player and the women love him.",
                    "author": "willfromvb",
                    "id": "erqdmqs",
                    "parent_id": "t1_erq6sh8",
                    "score": 5,
                    "created_utc": 1561140909.0,
                    "replies": [
                        {
                            "body": "Regarding the pickup artists, they are as diverse as there are SBs. While, it doesn't exactly help their case, to be fair to them, the black ones are also just trying to fit in to a community and do what people of other races do. In that case it's just a community of emotionally abusive assholes",
                            "author": "the_great_blacksby",
                            "id": "ers4ed5",
                            "parent_id": "t1_erqdmqs",
                            "score": 5,
                            "created_utc": 1561199280.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "'No AA men' is the new 'No shirt, no shoes, no service'\n\nIt's a shame but that's only some girls who have probably been deeply hurt by a lot of men who look like me. Can't be mad at them for not wanting to be hurt anymore\n\nLuckily, in the bowl there are enough women of color who aren't jaded yet that I still have a great time. Not without its problems (I'm aware I only shared the problems) but plenty of wins\n\nI do not look down on any black or brown woman who has a preference for white or other. Just trying to get my shots in where I can anyway!!!!",
                    "author": "the_great_blacksby",
                    "id": "ers48m9",
                    "parent_id": "t1_erq6sh8",
                    "score": 7,
                    "created_utc": 1561199023.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "That's a great story. I like that you helped him see he was maybe being blind to other people's 'otherness' \n\n> Large, liberal, city\n\nAre you in Portlandia?",
            "author": "the_great_blacksby",
            "id": "ers4zil",
            "parent_id": "t1_erpi9rr",
            "score": 1,
            "created_utc": 1561200206.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "errapcl",
            "parent_id": "t1_erpi9rr",
            "score": 1,
            "created_utc": 1561165019.0,
            "replies": [
                {
                    "body": "> I miss that SB.\n\nI keep a Dropbox of pics and videos of SBs past. Sometimes I scroll through and marvel at the amazing women I'd never have met if it weren't for the bowl!",
                    "author": "the_great_blacksby",
                    "id": "ers6b93",
                    "parent_id": "t1_errapcl",
                    "score": 1,
                    "created_utc": 1561202244.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Are you Rashida Jones!? I'd give two kidneys and one testicle for that woman.",
            "author": "the_great_blacksby",
            "id": "ers3e1t",
            "parent_id": "t1_erpsh4t",
            "score": 1,
            "created_utc": 1561197652.0,
            "replies": [
                {
                    "body": "While she's played a nurse I'm actually a real one. \n\n\nI sugar for cash only. Organ harvesting is for professional reasons only. \n\n\n😉\n\n\nBut with that ball I could become a baby mama and get child support for 18 years.... Choices choices....",
                    "author": "SFASB",
                    "id": "erti0u6",
                    "parent_id": "t1_ers3e1t",
                    "score": 2,
                    "created_utc": 1561242973.0,
                    "replies": [
                        {
                            "body": "I. Am. Intrigued.",
                            "author": "the_great_blacksby",
                            "id": "ertpblq",
                            "parent_id": "t1_erti0u6",
                            "score": 1,
                            "created_utc": 1561249120.0,
                            "replies": [
                                {
                                    "body": "Hi Intrigued, I'm SFASB!\n\n\nThese are the types of jokes that you could make if I take you up on the ball thing.",
                                    "author": "SFASB",
                                    "id": "erubpqk",
                                    "parent_id": "t1_ertpblq",
                                    "score": 2,
                                    "created_utc": 1561271176.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I would be too embarrassed to ever offer mentorship to anyone in the bowl. i was absolutely floored to learn that some SDs basically get solicited for it! Good for them\n\nDC is among the weirdest places for strip clubs. Soooooo many rules.",
            "author": "the_great_blacksby",
            "id": "ers3i90",
            "parent_id": "t1_erppx4z",
            "score": 3,
            "created_utc": 1561197841.0,
            "replies": []
        },
        {
            "body": "Black Daddy sounds hot tbh but I'm gonna disagree about using terms. Personally I like to know we're on the same page.",
            "author": "Mopsydoll",
            "id": "erqombf",
            "parent_id": "t1_erpih40",
            "score": 6,
            "created_utc": 1561148298.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "erru49m",
            "parent_id": "t1_erpih40",
            "score": 2,
            "created_utc": 1561183573.0,
            "replies": [
                {
                    "body": "Interesting",
                    "author": "the_great_blacksby",
                    "id": "ers4ujd",
                    "parent_id": "t1_erru49m",
                    "score": 1,
                    "created_utc": 1561199992.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "That's a good point. I mean I guess I am a serial sugar dater but that's because I've been in and out of the bowl for many years and also, not all m and gs turn into  1-2 year SRs or SRs at all.\n\nFuck, I'm using the terms! I can't stop!!!",
            "author": "the_great_blacksby",
            "id": "ers4wjj",
            "parent_id": "t1_erpih40",
            "score": 1,
            "created_utc": 1561200080.0,
            "replies": []
        },
        {
            "body": "Ab, I agree with you 100%. I also next SB that sound too seasoned using sugar lingo that is common on SLF.",
            "author": "ruphun",
            "id": "erpu4f1",
            "parent_id": "t1_erpih40",
            "score": 1,
            "created_utc": 1561128055.0,
            "replies": []
        },
        {
            "body": "Yes, I was shocked at how different things are in California. I was almost afraid to respond to some messages! \"You know we ain't supposed to be making eyes in public, lady!!!!!\"",
            "author": "the_great_blacksby",
            "id": "ers2u1w",
            "parent_id": "t1_erpxmu8",
            "score": 3,
            "created_utc": 1561196747.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "erqgx1q",
            "parent_id": "t1_erpxmu8",
            "score": 4,
            "created_utc": 1561143094.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "erqic6v",
                    "parent_id": "t1_erqgx1q",
                    "score": 4,
                    "created_utc": 1561144049.0,
                    "replies": [
                        {
                            "body": "I live in the southeast and even I didnt know what that term was. That's absolutely terrible!",
                            "author": "Mopsydoll",
                            "id": "erqp0er",
                            "parent_id": "t1_erqic6v",
                            "score": 2,
                            "created_utc": 1561148562.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Do what you feel is best for your sugaring. Nothing wrong with that!\n\nThere's no filter for SDs getting into the bowl so a lot of dudes try to apply normal dating logic and behaviors. Others have an ego issue where they think paying is a sign of weakness. I'm not an SB so I don't know how hard it is to screen for dudes like that",
            "author": "the_great_blacksby",
            "id": "ers1qm4",
            "parent_id": "t1_erq7vzy",
            "score": 2,
            "created_utc": 1561194923.0,
            "replies": []
        },
        {
            "body": "Where did I judge anyone? Please copy and paste the exact words so I can point out where you misread what I wrote or where you projected something else entirely.\n\nSecondly, I don't see where I complained. I love every minute of being in the bowl. That doesn't mean I can't share the bad with the good.",
            "author": "the_great_blacksby",
            "id": "ers1dxu",
            "parent_id": "t1_erqfgrk",
            "score": 2,
            "created_utc": 1561194342.0,
            "replies": []
        },
        {
            "body": "I’m a black sb and had poor experiences with black sds and it’s sad because I love black men but I’m always going to go where I’m celebrated and it’s not with them sadly...",
            "author": null,
            "id": "erqfflc",
            "parent_id": "t1_erq6yk0",
            "score": 9,
            "created_utc": 1561142107.0,
            "replies": [
                {
                    "body": "Exactly! I feel the same way",
                    "author": "Kayakklay",
                    "id": "erspdg6",
                    "parent_id": "t1_erqfflc",
                    "score": 1,
                    "created_utc": 1561220628.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "The assumption that I don't appear high-class, clean or presentable is actually the problem. It doesn't matter if I do, can't wash off my skin. (Well, Michael Jackson did. Maybe that is an option....)\n\nThat said, I didn't write this post for pity. I'm rich, have a great life and many good times. \n\nA lot of people think like you've pointed out and act accordingly. Nothing wrong with that and nothing I can do to change it.",
            "author": "the_great_blacksby",
            "id": "ers1vll",
            "parent_id": "t1_erq6yk0",
            "score": 8,
            "created_utc": 1561195155.0,
            "replies": [
                {
                    "body": "My assumption was just based on the black SD profiles I've seen. because you're on the other side you may not see what their profiles are. They usually not good with really bad photos and they look like they just want an escort. Unfortunately these are just stereotypes that both black SDs and black SB have to overcome.",
                    "author": "Kayakklay",
                    "id": "erspiy7",
                    "parent_id": "t1_ers1vll",
                    "score": 1,
                    "created_utc": 1561220747.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "That's a really sad outcome. That people did that to you, and that that's the conclusion it lead to.",
            "author": "the_great_blacksby",
            "id": "erry2x0",
            "parent_id": "t1_errpmhc",
            "score": 2,
            "created_utc": 1561189034.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "ertghyz",
                    "parent_id": "t1_erry2x0",
                    "score": 3,
                    "created_utc": 1561241719.0,
                    "replies": [
                        {
                            "body": "This is so true! We are carrying generational and racial mindset of poverty!",
                            "author": null,
                            "id": "eu5j7r0",
                            "parent_id": "t1_ertghyz",
                            "score": 2,
                            "created_utc": 1563478721.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "erv1pmu",
            "parent_id": "t1_errpmhc",
            "score": 1,
            "created_utc": 1561303950.0,
            "replies": [
                {
                    "body": "Who says I don’t hold white men accountable? And who says i don’t STILL try to date black men even though I’m fed up? You sound mad and you don’t even know me lol. Ask better questions that aren’t based off of assumptions next time.",
                    "author": "PinkCookies223",
                    "id": "erv2hk5",
                    "parent_id": "t1_erv1pmu",
                    "score": 2,
                    "created_utc": 1561304581.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "erv3gd3",
                            "parent_id": "t1_erv2hk5",
                            "score": 1,
                            "created_utc": 1561305342.0,
                            "replies": [
                                {
                                    "body": "Most black women aren’t any better either I’ve heard horror stories from both black and white men. The people I date don’t know I have these presumptions telling them that would be a major turn off the same way it is for me.",
                                    "author": "PinkCookies223",
                                    "id": "erv4o6q",
                                    "parent_id": "t1_erv3gd3",
                                    "score": 2,
                                    "created_utc": 1561306307.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "My thoughts on Oregon are, *damn that's a white state*!!!! J/K I've never been and would love to come. Is that an invitation! :-)",
            "author": "the_great_blacksby",
            "id": "ers2w13",
            "parent_id": "t1_erpwv8h",
            "score": 2,
            "created_utc": 1561196836.0,
            "replies": []
        },
        {
            "body": "I wish there were more of you! Tell your daddies to share! j/k",
            "author": "the_great_blacksby",
            "id": "erryvvs",
            "parent_id": "t1_erqv3tt",
            "score": 2,
            "created_utc": 1561190265.0,
            "replies": []
        },
        {
            "body": "Nigeria?",
            "author": "the_great_blacksby",
            "id": "ers1en5",
            "parent_id": "t1_erqeram",
            "score": 1,
            "created_utc": 1561194373.0,
            "replies": [
                {
                    "body": "Lololol. \nI love & hate that you mentioned my fatherland but that was my first guess as well.",
                    "author": "bsbdfw",
                    "id": "erujtn0",
                    "parent_id": "t1_ers1en5",
                    "score": 3,
                    "created_utc": 1561284091.0,
                    "replies": [
                        {
                            "body": "I've only my been once but that description sounds just like it, lol",
                            "author": "the_great_blacksby",
                            "id": "esttj75",
                            "parent_id": "t1_erujtn0",
                            "score": 2,
                            "created_utc": 1562273247.0,
                            "replies": [
                                {
                                    "body": "The African sugar bowl beats western region any day of the week. Almost makes me wish I went there for college.",
                                    "author": "bsbdfw",
                                    "id": "estu6ve",
                                    "parent_id": "t1_esttj75",
                                    "score": 2,
                                    "created_utc": 1562273513.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Thanks!",
            "author": "the_great_blacksby",
            "id": "estsnen",
            "parent_id": "t1_es0qh76",
            "score": 1,
            "created_utc": 1562272909.0,
            "replies": []
        },
        {
            "body": "Damn, maybe I need to move to Texas",
            "author": "Mopsydoll",
            "id": "erqp4za",
            "parent_id": "t1_erqbcga",
            "score": 2,
            "created_utc": 1561148648.0,
            "replies": []
        },
        {
            "body": "Where in TX are you?",
            "author": "platinumsugargirl45",
            "id": "err73f1",
            "parent_id": "t1_erqbcga",
            "score": 1,
            "created_utc": 1561162134.0,
            "replies": [
                {
                    "body": "North Texas, just north of DFW",
                    "author": "AffectionateTowel9",
                    "id": "ersbvxb",
                    "parent_id": "t1_err73f1",
                    "score": 1,
                    "created_utc": 1561208991.0,
                    "replies": [
                        {
                            "body": "Cool. I'm in Dallas",
                            "author": "platinumsugargirl45",
                            "id": "ersby08",
                            "parent_id": "t1_ersbvxb",
                            "score": 1,
                            "created_utc": 1561209053.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "*Hat tip*",
            "author": "the_great_blacksby",
            "id": "ers1fx2",
            "parent_id": "t1_erqbcga",
            "score": 1,
            "created_utc": 1561194428.0,
            "replies": []
        },
        {
            "body": "Im sure it is desperation but it’s beyond me how an out of shape unattractive woman in her 40’s think she’s going to sugar date someone close to her age, who is in way better shape then her, and also get an allowance too.",
            "author": "ruphun",
            "id": "erpunzu",
            "parent_id": "t1_erpj9j8",
            "score": 3,
            "created_utc": 1561128425.0,
            "replies": [
                {
                    "body": "Yeah, it's more this that I was confused by. Like zero issue if you want to reach 'out of your league' on any other dating site (it may be insensitive) but it's hard to believe they really think they also have the expectation of being paid and 'kept' like\n\nBut I'm sure there's an SD out there for them too",
                    "author": "the_great_blacksby",
                    "id": "ers56d0",
                    "parent_id": "t1_erpunzu",
                    "score": 1,
                    "created_utc": 1561200504.0,
                    "replies": [
                        {
                            "body": "> But I'm sure there's an SD out there for them too\n\nI'm sure there are, but they may have to jump up to 60 or 70 year old men, and stop trying for guys close to their age.",
                            "author": "ruphun",
                            "id": "erumfgr",
                            "parent_id": "t1_ers56d0",
                            "score": 2,
                            "created_utc": 1561288179.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Totally agree with this. This is why I tried not to come across as blaming people for any of these situations. It just is what it is. \n\nI only know what the 'white SD experience' is like from friends who I love (SBs and SDs), who share stories with me.\n\nI literally cannot complain about anything. I'm living the American dream in many ways. In fact, my biggest insecurity is that sometimes I feel I'm exploiting the misfortune of poor SBs in the bowl. That's not a race insecurity but a class one.",
            "author": "the_great_blacksby",
            "id": "ers32gt",
            "parent_id": "t1_erpvnnb",
            "score": 3,
            "created_utc": 1561197128.0,
            "replies": []
        },
        {
            "body": "True. I don't think I'm hot but I think I qualify for all the rest. I guess I'm the last black unicorn like Tiffany Haddish!",
            "author": "the_great_blacksby",
            "id": "estt8eh",
            "parent_id": "t1_eruspgn",
            "score": 1,
            "created_utc": 1562273140.0,
            "replies": []
        },
        {
            "body": "Nothing wrong with that!",
            "author": "the_great_blacksby",
            "id": "estszz3",
            "parent_id": "t1_erwf48c",
            "score": 1,
            "created_utc": 1562273044.0,
            "replies": []
        },
        {
            "body": "I've been to Montreal and dated there for a while. I've been to Whistler once but didn't have time to explore the scene. :-(",
            "author": "the_great_blacksby",
            "id": "ers2r94",
            "parent_id": "t1_erpyge9",
            "score": 1,
            "created_utc": 1561196617.0,
            "replies": [
                {
                    "body": "I am near Vancouver! If you’re up here some time in the future, or plan to be, let me know ☺️",
                    "author": "Ashleede",
                    "id": "erzom60",
                    "parent_id": "t1_ers2r94",
                    "score": 2,
                    "created_utc": 1561443861.0,
                    "replies": [
                        {
                            "body": "Will do",
                            "author": "the_great_blacksby",
                            "id": "estspt9",
                            "parent_id": "t1_erzom60",
                            "score": 1,
                            "created_utc": 1562272934.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Lol, respect!",
            "author": "the_great_blacksby",
            "id": "erryopf",
            "parent_id": "t1_erqy1fg",
            "score": 1,
            "created_utc": 1561189949.0,
            "replies": []
        },
        {
            "body": "You have a husband and you sugar? That is so hot. Lol",
            "author": "the_great_blacksby",
            "id": "erryo21",
            "parent_id": "t1_erqyen9",
            "score": 1,
            "created_utc": 1561189921.0,
            "replies": [
                {
                    "body": "Yeah well want to sugar, so far I haven't met the right SD, so working on improving me and losing weight.",
                    "author": null,
                    "id": "es0u1vy",
                    "parent_id": "t1_erryo21",
                    "score": 2,
                    "created_utc": 1561483046.0,
                    "replies": [
                        {
                            "body": "Good luck, I recently lost some weight and it feels great",
                            "author": "the_great_blacksby",
                            "id": "estsjiy",
                            "parent_id": "t1_es0u1vy",
                            "score": 1,
                            "created_utc": 1562272863.0,
                            "replies": [
                                {
                                    "body": "Ty! So far it's going great and every pound that comes off feels like heaven hehehe",
                                    "author": null,
                                    "id": "esyvqap",
                                    "parent_id": "t1_estsjiy",
                                    "score": 1,
                                    "created_utc": 1562350529.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "What part of the South? I hear the bowl in Florida is brutal but Georgia seems okay.",
            "author": "the_great_blacksby",
            "id": "erryn7v",
            "parent_id": "t1_err4zqh",
            "score": 1,
            "created_utc": 1561189885.0,
            "replies": [
                {
                    "body": "I'm in Florida, unfortunately.",
                    "author": "Sbabynaomi76",
                    "id": "erurla9",
                    "parent_id": "t1_erryn7v",
                    "score": 1,
                    "created_utc": 1561294841.0,
                    "replies": [
                        {
                            "body": "Bummer....for many reasons",
                            "author": "the_great_blacksby",
                            "id": "esttbgn",
                            "parent_id": "t1_erurla9",
                            "score": 1,
                            "created_utc": 1562273172.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I can't say I haven't come to same conclusion, but I do prefer darker skinned black women. Gabriel Union is like my perfect 'type'. Well-spoken, slim but not silly thin, and af-am features. \n\nAs discussed above, I've dated mixed girls and Latina's too. White girls, it really depends, but I usually don't bother because of the bs above. Asians and Indians I've had zero success with in the bowl. Well, I met one SE Asian girl for dinner once but her whole vibe was like she'd hit rock bottom, I think she was sad she wasn't getting hit up by anyone else in the bowl other than me. I took her to a nice dinner and then we parted ways. Didn't really need to make it my job to make her feel better about me as an option.",
            "author": "the_great_blacksby",
            "id": "erryksp",
            "parent_id": "t1_errf4r4",
            "score": 4,
            "created_utc": 1561189776.0,
            "replies": [
                {
                    "body": "I think Gabby is one of those people who are objectively attractive. She has all of the traits that most people regard as attractive. Nice skin, good body, great hair, nice teeth, nice proportions, intelligent, that sort of thing. She is super pretty and pleasant. \n\nShe does have money which helps her further achieve and keep up her specific look but, that’s beside the point. \n\nYeah, I have noticed that as well. In general dating with both non-black men and  non- black women.  They only entertain having a black person as a spouse if they are not having luck with other races.  A lot of the time they are low-quality and you can understand why no one wants them.  \n\nIt’s partially our fault, black folks are known for putting people with non-black phenotypes on some sort of pedestal and those people have noticed. This is why they think they can feed us sh*t and call it sugar. \n\nI know all people don’t have this mindset set but, many people do.\n\n\nIt will happen but, the only way to fight it is to call it out and keep your standards high. Don’t accept anything less than what you want.If you feel like you are someone last option or desperate attempt then politely decline.",
                    "author": "fairiesandhearts",
                    "id": "ersiubt",
                    "parent_id": "t1_erryksp",
                    "score": 5,
                    "created_utc": 1561215344.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Black and terrible. Sounds like my dad!",
            "author": "the_great_blacksby",
            "id": "estuf3c",
            "parent_id": "t1_ertqykd",
            "score": 1,
            "created_utc": 1562273603.0,
            "replies": []
        },
        {
            "body": "The easiest place seems to be California, specifically LA. People are just used to so much mixing there that race is almost an after thought (on the dating scene) it's still kinda weird in professional circles",
            "author": "the_great_blacksby",
            "id": "esttu2l",
            "parent_id": "t1_erts5c6",
            "score": 1,
            "created_utc": 1562273371.0,
            "replies": [
                {
                    "body": "Oh, that makes so much sense. You're definitely right, but I had no idea that it's kinda weird in professional circles. That's interesting to me....makes me wonder if that shows in the type of SBs that are out there as well. Well, now it's clear to me why some people choose to travel to other areas. It's a preference thing, but there should always be respect.",
                    "author": "kaasetgira",
                    "id": "esztw7g",
                    "parent_id": "t1_esttu2l",
                    "score": 2,
                    "created_utc": 1562367789.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "To most people outside this community, it's not different. \n\nTo people who do it, there are a lot of differences.",
            "author": "the_great_blacksby",
            "id": "estsx68",
            "parent_id": "t1_erx4rjn",
            "score": 3,
            "created_utc": 1562273011.0,
            "replies": []
        },
        {
            "body": "I think you misread that. I actually said the opposite, “I’m not complaining but don’t pretend it isn’t different for black people.”",
            "author": "the_great_blacksby",
            "id": "evf1jtn",
            "parent_id": "t1_eu4ew3h",
            "score": 1,
            "created_utc": 1564485986.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "errdfpg",
            "parent_id": "t1_erq25t5",
            "score": 4,
            "created_utc": 1561167262.0,
            "replies": [
                {
                    "body": "Lol, I mean that wasn't what I meant. I've met some bbws. Not trying to fat shame anyone",
                    "author": "the_great_blacksby",
                    "id": "ers2lqy",
                    "parent_id": "t1_errdfpg",
                    "score": 1,
                    "created_utc": 1561196366.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "ersn8pf",
                            "parent_id": "t1_ers2lqy",
                            "score": 1,
                            "created_utc": 1561218929.0,
                            "replies": [
                                {
                                    "body": "Look at me, just negroing the place up!",
                                    "author": "the_great_blacksby",
                                    "id": "estv75a",
                                    "parent_id": "t1_ersn8pf",
                                    "score": 1,
                                    "created_utc": 1562273907.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yes, crass but unintended. \n\nI think I didn't come across with what I actually meant there. Not the best example and I have no problem with bigger women.",
            "author": "the_great_blacksby",
            "id": "ers2nn0",
            "parent_id": "t1_erq25t5",
            "score": 2,
            "created_utc": 1561196451.0,
            "replies": []
        },
        {
            "body": "Lol. Tell brother asshat he's messing up the game for the rest of us!",
            "author": "the_great_blacksby",
            "id": "ers3ctf",
            "parent_id": "t1_erpsuio",
            "score": 1,
            "created_utc": 1561197599.0,
            "replies": []
        },
        {
            "body": "Really? Thanks!",
            "author": "the_great_blacksby",
            "id": "erryp7s",
            "parent_id": "t1_erqvytw",
            "score": 1,
            "created_utc": 1561189971.0,
            "replies": []
        },
        {
            "body": "I don't think you read the post. I've been sugaring for years, and love it. That doesn't mean I don't observe common patterns that aren't great. I shared those patterns because other people aren't having my same experience. Some are unique to being black, some aren't.\n\nThat's like if you did the same and shared only the parts of the bowl that are problematic for you and someone responds, \"You have a self defeating mindset.\" \n\nLike what are you even taking about!? \n\nAcknowledging *some* specific problems and calling them out for others means there's *only* problems? \n\nNo, that's not what that means at all.",
            "author": "the_great_blacksby",
            "id": "ersdkr1",
            "parent_id": "t1_ers8rfw",
            "score": 3,
            "created_utc": 1561210684.0,
            "replies": [
                {
                    "body": "Of course I didn't read your post. It's like a novel, that how long it is! Who has time for that \n\nI read one part and that's what i responded to.  The part where  you're complaining coffee shop M&Gs  \"NEVER work bc I'm black\"......lol dude",
                    "author": "ForrestAlpha",
                    "id": "erslj6a",
                    "parent_id": "t1_ersdkr1",
                    "score": 0,
                    "created_utc": 1561217570.0,
                    "replies": [
                        {
                            "body": "Lol, well at least you're honest. To be fair, if didn't write it, I probably wouldn't have read it either.",
                            "author": "the_great_blacksby",
                            "id": "estv0zo",
                            "parent_id": "t1_erslj6a",
                            "score": 2,
                            "created_utc": 1562273838.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "You're argumentative and needlessly sensitive. \n\nSo I have standards about health and beauty in the women I date. Glad to hear that you don't. Is that what you're trying to say?\n\nAlso, thanks for telling me to \"fuck right off\" for sharing that preference on a forum where....people share things for you to read. I didn't know I needed to watch out for the PC police. Next time I'll remove all the thoughts that you personally can't tolerate because they trigger you.\n\nSecondly, you seem to think this post reads insecurity about anything. I never said I cared whether white, Asian or Indian girls write back. I just reported to you that they don't. In other words, to share my experience in the bowl and inform others.\n\nFinally, you asked 'what if POTs talked like that about you'. Uh, they do, did you not read the middle of the post. Totally up to them to live and insult people as they want. You too, triggered internet person!",
            "author": "the_great_blacksby",
            "id": "ers2777",
            "parent_id": "t1_erq613g",
            "score": 4,
            "created_utc": 1561195693.0,
            "replies": [
                {
                    "body": "I just don't understand why you get mad over a message. I get unwanted messages on all kinds of dating/social apps all the time. I can't be mad at people for trying.",
                    "author": null,
                    "id": "ert0dz4",
                    "parent_id": "t1_ers2777",
                    "score": 1,
                    "created_utc": 1561229010.0,
                    "replies": [
                        {
                            "body": "Not mad and not mad at them. Just a poor choice of words on my part above",
                            "author": "the_great_blacksby",
                            "id": "estvmjq",
                            "parent_id": "t1_ert0dz4",
                            "score": 1,
                            "created_utc": 1562274059.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "erq9t1r",
            "parent_id": "t1_erq613g",
            "score": -1,
            "created_utc": 1561138423.0,
            "replies": [
                {
                    "body": "that’s also bad?",
                    "author": null,
                    "id": "erqalzu",
                    "parent_id": "t1_erq9t1r",
                    "score": 2,
                    "created_utc": 1561138939.0,
                    "replies": []
                }
            ]
        },
        {
            "body": ">There's a lid for every pot\n\nThat is a cruel lie. Even in vanilla, the statistics show a move away from both marriage and relationships. A lot of people who never date, never have sex, and it's growing. As pornography and artificial intelligence mix, that trend will accelerate. More and more people will live (and die) alone.\n\nIn sugar, I'm \"poor\" relative to a lot of guys who post here, and I've literally got my pick of amazing looking women just because I'm able to provide a not-totally-shitty allowance. Women who are older and out of shape have no idea what they are competing against. Women who are older and in shape and happy -- they've got a real chance. But the women the OP described in his post are wasting their time, and they would serve themselves better by gonig to the gym for whatever period of time each day they are checking SA. That's the stone cold truth.",
            "author": "slfalt",
            "id": "erqwhsq",
            "parent_id": "t1_erq613g",
            "score": -1,
            "created_utc": 1561153832.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "erssfmg",
                    "parent_id": "t1_erqwhsq",
                    "score": 3,
                    "created_utc": 1561222960.0,
                    "replies": [
                        {
                            "body": "I don't see any reason to believe that. Much more likely, based on vanilla online dating trends, that the two groups say no to each other. But suppose you are right. Does that strike you as a way for a woman to improve her self-respect and mental health?",
                            "author": "slfalt",
                            "id": "ersszyk",
                            "parent_id": "t1_erssfmg",
                            "score": 2,
                            "created_utc": 1561223392.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Two paragraphs and not a single part of it relates to why there isn't a lid for every pot. You say you have a lot of selection, great! I'm glad you personally can pick your preference. But what you don't say is anything about how you know these women are not getting any matches at all or \"not dating/having sex\". IDK what marriage even has to do with this conversation, there are lots of people who happily have relationships without the goal being marriage and I'd guess people who have dabbled in sugar are going to be these kind of people.",
                    "author": null,
                    "id": "err1evp",
                    "parent_id": "t1_erqwhsq",
                    "score": 1,
                    "created_utc": 1561157569.0,
                    "replies": [
                        {
                            "body": "> Two paragraphs and not a single part of it relates to why there isn't a lid for every pot\n\nIt's an extremely well known trend, often studied in the context of the rise of childlessness. Here's an example that is not behind a paywall. Note that the biggest reason, by far, is, \"I live alone and do not have a steady partner.\" \"No steady partner\" is rising along with childlessness.\n\nhttps://onlinelibrary.wiley.com/doi/full/10.1111/j.1475-6781.2008.00110.x",
                            "author": "slfalt",
                            "id": "err21fs",
                            "parent_id": "t1_err1evp",
                            "score": 2,
                            "created_utc": 1561158061.0,
                            "replies": [
                                {
                                    "body": "Do those people want a partner and have been rejected by everyone? Or are they people who weren't successful in their younger years and simply decided to go it alone? The narrative I have heard about this is that people give up. We are talking about women who are on a dating site actively messaging people. I do think there is a lid for every pot (or at least, the vast majority of pots) and you can find it if you try.  I'm super happy you are using your resources to get what you want, but your tastes just aren't everyone's taste. It's not just good-looking couples that are going on dates or having sex. If these women aren't getting messaged back, they'll get off the platform. It's a problem that takes care of itself and the only think OP is accomplishing by shaming them is trying to shut them down from talking to someone who might be happy to talk to them back.",
                                    "author": null,
                                    "id": "err3ti4",
                                    "parent_id": "t1_err21fs",
                                    "score": 3,
                                    "created_utc": 1561159482.0,
                                    "replies": [
                                        {
                                            "body": ">If these women aren't getting messaged back, they'll get off the platform\n\nNot if people on the internet say there's a lid for every pot, chin up you can do it. That's why comments like yours concern me. You are selling snake oil, instead of helping people figure things out.",
                                            "author": "slfalt",
                                            "id": "err50vj",
                                            "parent_id": "t1_err3ti4",
                                            "score": 0,
                                            "created_utc": 1561160453.0,
                                            "replies": [
                                                {
                                                    "body": "I don't think I am. This is something I've thought about, talked to my therapist about, read about, read reddit comments about, and listened to people talk about A Lot because I used to think no one would ever date me even in vanilla. Once I got through therapy and wasn't an insecure, shame filled mess suddenly I went from having no dates to having really great relationships w quality men. My physical appearance did not change. I just think you don't have experience with men who aren't you while I do. I also think, it's a harmless hello you can scroll past. I can't get mad about every man on every app that messages me that I'm not interested in. I mean, i could, but my quality of life would be worse for it.",
                                                    "author": null,
                                                    "id": "err5gxj",
                                                    "parent_id": "t1_err50vj",
                                                    "score": 3,
                                                    "created_utc": 1561160812.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "If I wrote 'tech' it's a typo.",
            "author": "the_great_blacksby",
            "id": "ers42b0",
            "parent_id": "t1_erpolpu",
            "score": 1,
            "created_utc": 1561198739.0,
            "replies": []
        },
        {
            "body": "How do you get SBs with no pics? People don't think your trying to scam them at first?",
            "author": "the_great_blacksby",
            "id": "ers1hwr",
            "parent_id": "t1_erq9irt",
            "score": 1,
            "created_utc": 1561194518.0,
            "replies": [
                {
                    "body": "I send pics after we start talking, but i need discretion initially. I make sure my profile us very well written, and interesting.",
                    "author": "dade_murphy1",
                    "id": "ertdzv4",
                    "parent_id": "t1_ers1hwr",
                    "score": 1,
                    "created_utc": 1561239717.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "It's definitely due to my peers, it's also due to inexperience and misunderstanding what SDing is (not unique to any race), and other wider societal problems that the bowl didn't create and damn sure won't fix. \n\nJust sharing my experience and what it's been like. Not complaining or casting blame in any place.\n\nI'm a content, well-honeyed SD",
            "author": "the_great_blacksby",
            "id": "ers3a5c",
            "parent_id": "t1_erptvb7",
            "score": 3,
            "created_utc": 1561197477.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "erqoj8c",
            "parent_id": "t1_erptvb7",
            "score": 2,
            "created_utc": 1561148240.0,
            "replies": [
                {
                    "body": "Probably a State Senator. If it's a US Senator that's a very short list and juicy as fuck, if true. Lol",
                    "author": "the_great_blacksby",
                    "id": "ers36bz",
                    "parent_id": "t1_erqoj8c",
                    "score": 3,
                    "created_utc": 1561197305.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "> I actually lol'd at this. At least you're not Wesley Snipes black.\n\n Hahaha! That's funny but I gotta give props to him too, I was struggling in the 80s until he made it sexy to be chocolate. Then he tried to make it sexy to go to jail for tax fraud and I was out!\n\n> the fact that you have to pay the \"Black daddy tax\" as you called it does suck, but get it how you can my man. \n\nI don't mind paying it. Par for the course. I just am not oblivious to the fact that that's what it is, lol\n\n> Also not surprising the South is where you see more of this. I fear for my safety sometimes when i travel to remote parts of towns in southern states.\n\nI don't even take out the trash at night at my grandma's house (she lives in cross-burning Georgia)",
            "author": "the_great_blacksby",
            "id": "ers416s",
            "parent_id": "t1_erppa3e",
            "score": 3,
            "created_utc": 1561198689.0,
            "replies": []
        },
        {
            "body": "Interesting observation. To use a different example,  Google often has black people in its workforce ads but less than 3% of their staff is black. Pics and marketing and reality don't always match. Nor do they need to, sometimes it's the company trying to attract people.\n\nAlso, the founder of SA is Asian and I'm sure his experience is interesting even as the creator.\n\nIn any case, I was just sharing what it's like for me. The bowl didn't create these behaviors, norms, or issues and it won't change them",
            "author": "the_great_blacksby",
            "id": "ers2jm1",
            "parent_id": "t1_erq47z9",
            "score": 2,
            "created_utc": 1561196269.0,
            "replies": []
        },
        {
            "body": "I kept striking out with American Asian SBs so I just took my ass to South Korea and Japan...mind blown. Korea is basically a physical sugar bowl! It's so the norm there I didn't even need Seeking to find a wonderful college aged SB who I dated (six months) and still keep in touch with. \n\nThere they call them 'Juicy Juicy Girls'. Like a mix between a stripper, escort, and poor college girl. Hard to explain but it was as culturally  accepted as stripping is in most places (so not totally but somewhat).",
            "author": "the_great_blacksby",
            "id": "ers4n4l",
            "parent_id": "t1_erpikxk",
            "score": 2,
            "created_utc": 1561199664.0,
            "replies": []
        },
        {
            "body": ">So if you're looking for white or asian, go for it but be patient.  There are some out there for you. Ball out bro.\n\n&#x200B;\n\nI agree. OP will just have to look a little harder but they are out there. As i stated, i do notice that have a little harder time myself with the Caucasian women, but I have been able to click with a couple. As stated once we meet in person, it goes way better. Getting to the meet is the hard part.",
            "author": "pintodinosaur",
            "id": "erppsjc",
            "parent_id": "t1_erpikxk",
            "score": 0,
            "created_utc": 1561124981.0,
            "replies": [
                {
                    "body": "Agreed. Most people's 'preference' is a poorly constructed image based on past bad experiences and what they've heard or assumed. So getting in front of someone can make all the difference.\n\nI've dated girls in the past who were in the same friend group that would have previously said things like 'I don't date black guys'. But in the right situation, the right conversation or good time and they become more interested and less guarded. Same with me, I never knew I had a thing for SE Asian girls until I became friends with a lot of them. Then Schwing!!!!!",
                    "author": "the_great_blacksby",
                    "id": "ers4tj6",
                    "parent_id": "t1_erppsjc",
                    "score": 2,
                    "created_utc": 1561199947.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Thanks for your post. You make a lot of great and valid observations.\n\n1. I tried to be candid and share my whole experience. So you are correct that a lot of it has nothing to do with race.\n\n2. i read through a lot of forum posts that describe 'escort' 'rinser' or 'pro' tendencies and I have to be completely honest it always lines up like 98% of how many of the black POT SBs approach me. So I'm less harsh because it's hard to tell if they are doing that because they are pros or because they are having  a hard time in the bowl. I find that generally black, Latina and mixed SBs can be more aggressive really as a defense mechanism because of how the world treats them elsewhere\n\n3. A dive bar is probably inappropriate. But I know a lot of guys who suggest coffee shops. So I tried it and had poor results. If the first meet is a nice restaurant, there's almost always at least some courting that follows and sometimes that turns into a long term SR. Anyways I was just pointing out the expectional situations, those are not the norm for me. I stick to the nice restaurants",
            "author": "the_great_blacksby",
            "id": "ers3t86",
            "parent_id": "t1_erppdkm",
            "score": 3,
            "created_utc": 1561198340.0,
            "replies": [
                {
                    "body": "Definitely with you on coffee shops -- perhaps you and I just aren't coffee shop guys.  I absolutely hate it as a M&G venue.  I actually won't do coffee in my romantic life either.  With both a potential date, and a POT SB, if she digs in and insists on coffee, I always just pass.  Luckily, very few women do this.\n\nNice restaurants definitely work better.  But I also find things a bit formal, you're sitting across the table from each other, etc. My favorite is to find an upscale bar or restaurant/bar for drinks and small plates.  This can still signal (to some extent) wealth and taste to the SB (do you have any idea what a boulevardier costs in a fancy bar??), but in an atmosphere that is already looser and more fun, and when it comes to eating, nothing is more romantic than sitting on the couch next to each other, knees touching, and sharing tapas (or keep more distance if the chemistry isn't there yet).   Anyway, just giving you an idea for another option, since you and I both seem to have the \"no coffee shops\" thing going!",
                    "author": "Azurecole",
                    "id": "erse8wf",
                    "parent_id": "t1_ers3t86",
                    "score": 2,
                    "created_utc": 1561211320.0,
                    "replies": [
                        {
                            "body": "Great advice!",
                            "author": "the_great_blacksby",
                            "id": "ersf0u4",
                            "parent_id": "t1_erse8wf",
                            "score": 1,
                            "created_utc": 1561212036.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Are we talking NY Slice, Philly Cheesesteak or Boston Chowda east coast? :-)",
            "author": "the_great_blacksby",
            "id": "erryyo2",
            "parent_id": "t1_erqoeho",
            "score": 1,
            "created_utc": 1561190386.0,
            "replies": []
        },
        {
            "body": "I've heard that too. Even the black SBs that complaimed that there weren't more genuine black SDs emphasized the \"genuine\" part and told how they had bad experiences with black men claiming to be SDs, not wanting to provide an allowance, expecting a discount because they were black or wanted to be their pimp and get them to escort.  \n\nI also know a few local black men that are SDs that I know through other forums that take pride in their pick up artist skills and brag about how many SBs they get for free or cheap.  These same guys complain about escorts and SBs with NBA (No Blacks Allowed) policies. They hurt their own case.  \n\nI also know a few very well off genuine black SDs who treat women very well.  One is an ex NFL player and the women love him.",
            "author": "willfromvb",
            "id": "erqdmqs",
            "parent_id": "t1_erq6sh8",
            "score": 5,
            "created_utc": 1561140909.0,
            "replies": [
                {
                    "body": "Regarding the pickup artists, they are as diverse as there are SBs. While, it doesn't exactly help their case, to be fair to them, the black ones are also just trying to fit in to a community and do what people of other races do. In that case it's just a community of emotionally abusive assholes",
                    "author": "the_great_blacksby",
                    "id": "ers4ed5",
                    "parent_id": "t1_erqdmqs",
                    "score": 5,
                    "created_utc": 1561199280.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "'No AA men' is the new 'No shirt, no shoes, no service'\n\nIt's a shame but that's only some girls who have probably been deeply hurt by a lot of men who look like me. Can't be mad at them for not wanting to be hurt anymore\n\nLuckily, in the bowl there are enough women of color who aren't jaded yet that I still have a great time. Not without its problems (I'm aware I only shared the problems) but plenty of wins\n\nI do not look down on any black or brown woman who has a preference for white or other. Just trying to get my shots in where I can anyway!!!!",
            "author": "the_great_blacksby",
            "id": "ers48m9",
            "parent_id": "t1_erq6sh8",
            "score": 7,
            "created_utc": 1561199023.0,
            "replies": []
        },
        {
            "body": "> I miss that SB.\n\nI keep a Dropbox of pics and videos of SBs past. Sometimes I scroll through and marvel at the amazing women I'd never have met if it weren't for the bowl!",
            "author": "the_great_blacksby",
            "id": "ers6b93",
            "parent_id": "t1_errapcl",
            "score": 1,
            "created_utc": 1561202244.0,
            "replies": []
        },
        {
            "body": "While she's played a nurse I'm actually a real one. \n\n\nI sugar for cash only. Organ harvesting is for professional reasons only. \n\n\n😉\n\n\nBut with that ball I could become a baby mama and get child support for 18 years.... Choices choices....",
            "author": "SFASB",
            "id": "erti0u6",
            "parent_id": "t1_ers3e1t",
            "score": 2,
            "created_utc": 1561242973.0,
            "replies": [
                {
                    "body": "I. Am. Intrigued.",
                    "author": "the_great_blacksby",
                    "id": "ertpblq",
                    "parent_id": "t1_erti0u6",
                    "score": 1,
                    "created_utc": 1561249120.0,
                    "replies": [
                        {
                            "body": "Hi Intrigued, I'm SFASB!\n\n\nThese are the types of jokes that you could make if I take you up on the ball thing.",
                            "author": "SFASB",
                            "id": "erubpqk",
                            "parent_id": "t1_ertpblq",
                            "score": 2,
                            "created_utc": 1561271176.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Interesting",
            "author": "the_great_blacksby",
            "id": "ers4ujd",
            "parent_id": "t1_erru49m",
            "score": 1,
            "created_utc": 1561199992.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "erqic6v",
            "parent_id": "t1_erqgx1q",
            "score": 4,
            "created_utc": 1561144049.0,
            "replies": [
                {
                    "body": "I live in the southeast and even I didnt know what that term was. That's absolutely terrible!",
                    "author": "Mopsydoll",
                    "id": "erqp0er",
                    "parent_id": "t1_erqic6v",
                    "score": 2,
                    "created_utc": 1561148562.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Exactly! I feel the same way",
            "author": "Kayakklay",
            "id": "erspdg6",
            "parent_id": "t1_erqfflc",
            "score": 1,
            "created_utc": 1561220628.0,
            "replies": []
        },
        {
            "body": "My assumption was just based on the black SD profiles I've seen. because you're on the other side you may not see what their profiles are. They usually not good with really bad photos and they look like they just want an escort. Unfortunately these are just stereotypes that both black SDs and black SB have to overcome.",
            "author": "Kayakklay",
            "id": "erspiy7",
            "parent_id": "t1_ers1vll",
            "score": 1,
            "created_utc": 1561220747.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "ertghyz",
            "parent_id": "t1_erry2x0",
            "score": 3,
            "created_utc": 1561241719.0,
            "replies": [
                {
                    "body": "This is so true! We are carrying generational and racial mindset of poverty!",
                    "author": null,
                    "id": "eu5j7r0",
                    "parent_id": "t1_ertghyz",
                    "score": 2,
                    "created_utc": 1563478721.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Who says I don’t hold white men accountable? And who says i don’t STILL try to date black men even though I’m fed up? You sound mad and you don’t even know me lol. Ask better questions that aren’t based off of assumptions next time.",
            "author": "PinkCookies223",
            "id": "erv2hk5",
            "parent_id": "t1_erv1pmu",
            "score": 2,
            "created_utc": 1561304581.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "erv3gd3",
                    "parent_id": "t1_erv2hk5",
                    "score": 1,
                    "created_utc": 1561305342.0,
                    "replies": [
                        {
                            "body": "Most black women aren’t any better either I’ve heard horror stories from both black and white men. The people I date don’t know I have these presumptions telling them that would be a major turn off the same way it is for me.",
                            "author": "PinkCookies223",
                            "id": "erv4o6q",
                            "parent_id": "t1_erv3gd3",
                            "score": 2,
                            "created_utc": 1561306307.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Lololol. \nI love & hate that you mentioned my fatherland but that was my first guess as well.",
            "author": "bsbdfw",
            "id": "erujtn0",
            "parent_id": "t1_ers1en5",
            "score": 3,
            "created_utc": 1561284091.0,
            "replies": [
                {
                    "body": "I've only my been once but that description sounds just like it, lol",
                    "author": "the_great_blacksby",
                    "id": "esttj75",
                    "parent_id": "t1_erujtn0",
                    "score": 2,
                    "created_utc": 1562273247.0,
                    "replies": [
                        {
                            "body": "The African sugar bowl beats western region any day of the week. Almost makes me wish I went there for college.",
                            "author": "bsbdfw",
                            "id": "estu6ve",
                            "parent_id": "t1_esttj75",
                            "score": 2,
                            "created_utc": 1562273513.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "North Texas, just north of DFW",
            "author": "AffectionateTowel9",
            "id": "ersbvxb",
            "parent_id": "t1_err73f1",
            "score": 1,
            "created_utc": 1561208991.0,
            "replies": [
                {
                    "body": "Cool. I'm in Dallas",
                    "author": "platinumsugargirl45",
                    "id": "ersby08",
                    "parent_id": "t1_ersbvxb",
                    "score": 1,
                    "created_utc": 1561209053.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yeah, it's more this that I was confused by. Like zero issue if you want to reach 'out of your league' on any other dating site (it may be insensitive) but it's hard to believe they really think they also have the expectation of being paid and 'kept' like\n\nBut I'm sure there's an SD out there for them too",
            "author": "the_great_blacksby",
            "id": "ers56d0",
            "parent_id": "t1_erpunzu",
            "score": 1,
            "created_utc": 1561200504.0,
            "replies": [
                {
                    "body": "> But I'm sure there's an SD out there for them too\n\nI'm sure there are, but they may have to jump up to 60 or 70 year old men, and stop trying for guys close to their age.",
                    "author": "ruphun",
                    "id": "erumfgr",
                    "parent_id": "t1_ers56d0",
                    "score": 2,
                    "created_utc": 1561288179.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I am near Vancouver! If you’re up here some time in the future, or plan to be, let me know ☺️",
            "author": "Ashleede",
            "id": "erzom60",
            "parent_id": "t1_ers2r94",
            "score": 2,
            "created_utc": 1561443861.0,
            "replies": [
                {
                    "body": "Will do",
                    "author": "the_great_blacksby",
                    "id": "estspt9",
                    "parent_id": "t1_erzom60",
                    "score": 1,
                    "created_utc": 1562272934.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yeah well want to sugar, so far I haven't met the right SD, so working on improving me and losing weight.",
            "author": null,
            "id": "es0u1vy",
            "parent_id": "t1_erryo21",
            "score": 2,
            "created_utc": 1561483046.0,
            "replies": [
                {
                    "body": "Good luck, I recently lost some weight and it feels great",
                    "author": "the_great_blacksby",
                    "id": "estsjiy",
                    "parent_id": "t1_es0u1vy",
                    "score": 1,
                    "created_utc": 1562272863.0,
                    "replies": [
                        {
                            "body": "Ty! So far it's going great and every pound that comes off feels like heaven hehehe",
                            "author": null,
                            "id": "esyvqap",
                            "parent_id": "t1_estsjiy",
                            "score": 1,
                            "created_utc": 1562350529.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I'm in Florida, unfortunately.",
            "author": "Sbabynaomi76",
            "id": "erurla9",
            "parent_id": "t1_erryn7v",
            "score": 1,
            "created_utc": 1561294841.0,
            "replies": [
                {
                    "body": "Bummer....for many reasons",
                    "author": "the_great_blacksby",
                    "id": "esttbgn",
                    "parent_id": "t1_erurla9",
                    "score": 1,
                    "created_utc": 1562273172.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I think Gabby is one of those people who are objectively attractive. She has all of the traits that most people regard as attractive. Nice skin, good body, great hair, nice teeth, nice proportions, intelligent, that sort of thing. She is super pretty and pleasant. \n\nShe does have money which helps her further achieve and keep up her specific look but, that’s beside the point. \n\nYeah, I have noticed that as well. In general dating with both non-black men and  non- black women.  They only entertain having a black person as a spouse if they are not having luck with other races.  A lot of the time they are low-quality and you can understand why no one wants them.  \n\nIt’s partially our fault, black folks are known for putting people with non-black phenotypes on some sort of pedestal and those people have noticed. This is why they think they can feed us sh*t and call it sugar. \n\nI know all people don’t have this mindset set but, many people do.\n\n\nIt will happen but, the only way to fight it is to call it out and keep your standards high. Don’t accept anything less than what you want.If you feel like you are someone last option or desperate attempt then politely decline.",
            "author": "fairiesandhearts",
            "id": "ersiubt",
            "parent_id": "t1_erryksp",
            "score": 5,
            "created_utc": 1561215344.0,
            "replies": []
        },
        {
            "body": "Oh, that makes so much sense. You're definitely right, but I had no idea that it's kinda weird in professional circles. That's interesting to me....makes me wonder if that shows in the type of SBs that are out there as well. Well, now it's clear to me why some people choose to travel to other areas. It's a preference thing, but there should always be respect.",
            "author": "kaasetgira",
            "id": "esztw7g",
            "parent_id": "t1_esttu2l",
            "score": 2,
            "created_utc": 1562367789.0,
            "replies": []
        },
        {
            "body": "Lol, I mean that wasn't what I meant. I've met some bbws. Not trying to fat shame anyone",
            "author": "the_great_blacksby",
            "id": "ers2lqy",
            "parent_id": "t1_errdfpg",
            "score": 1,
            "created_utc": 1561196366.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "ersn8pf",
                    "parent_id": "t1_ers2lqy",
                    "score": 1,
                    "created_utc": 1561218929.0,
                    "replies": [
                        {
                            "body": "Look at me, just negroing the place up!",
                            "author": "the_great_blacksby",
                            "id": "estv75a",
                            "parent_id": "t1_ersn8pf",
                            "score": 1,
                            "created_utc": 1562273907.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Of course I didn't read your post. It's like a novel, that how long it is! Who has time for that \n\nI read one part and that's what i responded to.  The part where  you're complaining coffee shop M&Gs  \"NEVER work bc I'm black\"......lol dude",
            "author": "ForrestAlpha",
            "id": "erslj6a",
            "parent_id": "t1_ersdkr1",
            "score": 0,
            "created_utc": 1561217570.0,
            "replies": [
                {
                    "body": "Lol, well at least you're honest. To be fair, if didn't write it, I probably wouldn't have read it either.",
                    "author": "the_great_blacksby",
                    "id": "estv0zo",
                    "parent_id": "t1_erslj6a",
                    "score": 2,
                    "created_utc": 1562273838.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I just don't understand why you get mad over a message. I get unwanted messages on all kinds of dating/social apps all the time. I can't be mad at people for trying.",
            "author": null,
            "id": "ert0dz4",
            "parent_id": "t1_ers2777",
            "score": 1,
            "created_utc": 1561229010.0,
            "replies": [
                {
                    "body": "Not mad and not mad at them. Just a poor choice of words on my part above",
                    "author": "the_great_blacksby",
                    "id": "estvmjq",
                    "parent_id": "t1_ert0dz4",
                    "score": 1,
                    "created_utc": 1562274059.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "that’s also bad?",
            "author": null,
            "id": "erqalzu",
            "parent_id": "t1_erq9t1r",
            "score": 2,
            "created_utc": 1561138939.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "erssfmg",
            "parent_id": "t1_erqwhsq",
            "score": 3,
            "created_utc": 1561222960.0,
            "replies": [
                {
                    "body": "I don't see any reason to believe that. Much more likely, based on vanilla online dating trends, that the two groups say no to each other. But suppose you are right. Does that strike you as a way for a woman to improve her self-respect and mental health?",
                    "author": "slfalt",
                    "id": "ersszyk",
                    "parent_id": "t1_erssfmg",
                    "score": 2,
                    "created_utc": 1561223392.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Two paragraphs and not a single part of it relates to why there isn't a lid for every pot. You say you have a lot of selection, great! I'm glad you personally can pick your preference. But what you don't say is anything about how you know these women are not getting any matches at all or \"not dating/having sex\". IDK what marriage even has to do with this conversation, there are lots of people who happily have relationships without the goal being marriage and I'd guess people who have dabbled in sugar are going to be these kind of people.",
            "author": null,
            "id": "err1evp",
            "parent_id": "t1_erqwhsq",
            "score": 1,
            "created_utc": 1561157569.0,
            "replies": [
                {
                    "body": "> Two paragraphs and not a single part of it relates to why there isn't a lid for every pot\n\nIt's an extremely well known trend, often studied in the context of the rise of childlessness. Here's an example that is not behind a paywall. Note that the biggest reason, by far, is, \"I live alone and do not have a steady partner.\" \"No steady partner\" is rising along with childlessness.\n\nhttps://onlinelibrary.wiley.com/doi/full/10.1111/j.1475-6781.2008.00110.x",
                    "author": "slfalt",
                    "id": "err21fs",
                    "parent_id": "t1_err1evp",
                    "score": 2,
                    "created_utc": 1561158061.0,
                    "replies": [
                        {
                            "body": "Do those people want a partner and have been rejected by everyone? Or are they people who weren't successful in their younger years and simply decided to go it alone? The narrative I have heard about this is that people give up. We are talking about women who are on a dating site actively messaging people. I do think there is a lid for every pot (or at least, the vast majority of pots) and you can find it if you try.  I'm super happy you are using your resources to get what you want, but your tastes just aren't everyone's taste. It's not just good-looking couples that are going on dates or having sex. If these women aren't getting messaged back, they'll get off the platform. It's a problem that takes care of itself and the only think OP is accomplishing by shaming them is trying to shut them down from talking to someone who might be happy to talk to them back.",
                            "author": null,
                            "id": "err3ti4",
                            "parent_id": "t1_err21fs",
                            "score": 3,
                            "created_utc": 1561159482.0,
                            "replies": [
                                {
                                    "body": ">If these women aren't getting messaged back, they'll get off the platform\n\nNot if people on the internet say there's a lid for every pot, chin up you can do it. That's why comments like yours concern me. You are selling snake oil, instead of helping people figure things out.",
                                    "author": "slfalt",
                                    "id": "err50vj",
                                    "parent_id": "t1_err3ti4",
                                    "score": 0,
                                    "created_utc": 1561160453.0,
                                    "replies": [
                                        {
                                            "body": "I don't think I am. This is something I've thought about, talked to my therapist about, read about, read reddit comments about, and listened to people talk about A Lot because I used to think no one would ever date me even in vanilla. Once I got through therapy and wasn't an insecure, shame filled mess suddenly I went from having no dates to having really great relationships w quality men. My physical appearance did not change. I just think you don't have experience with men who aren't you while I do. I also think, it's a harmless hello you can scroll past. I can't get mad about every man on every app that messages me that I'm not interested in. I mean, i could, but my quality of life would be worse for it.",
                                            "author": null,
                                            "id": "err5gxj",
                                            "parent_id": "t1_err50vj",
                                            "score": 3,
                                            "created_utc": 1561160812.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I send pics after we start talking, but i need discretion initially. I make sure my profile us very well written, and interesting.",
            "author": "dade_murphy1",
            "id": "ertdzv4",
            "parent_id": "t1_ers1hwr",
            "score": 1,
            "created_utc": 1561239717.0,
            "replies": []
        },
        {
            "body": "Probably a State Senator. If it's a US Senator that's a very short list and juicy as fuck, if true. Lol",
            "author": "the_great_blacksby",
            "id": "ers36bz",
            "parent_id": "t1_erqoj8c",
            "score": 3,
            "created_utc": 1561197305.0,
            "replies": []
        },
        {
            "body": "Agreed. Most people's 'preference' is a poorly constructed image based on past bad experiences and what they've heard or assumed. So getting in front of someone can make all the difference.\n\nI've dated girls in the past who were in the same friend group that would have previously said things like 'I don't date black guys'. But in the right situation, the right conversation or good time and they become more interested and less guarded. Same with me, I never knew I had a thing for SE Asian girls until I became friends with a lot of them. Then Schwing!!!!!",
            "author": "the_great_blacksby",
            "id": "ers4tj6",
            "parent_id": "t1_erppsjc",
            "score": 2,
            "created_utc": 1561199947.0,
            "replies": []
        },
        {
            "body": "Definitely with you on coffee shops -- perhaps you and I just aren't coffee shop guys.  I absolutely hate it as a M&G venue.  I actually won't do coffee in my romantic life either.  With both a potential date, and a POT SB, if she digs in and insists on coffee, I always just pass.  Luckily, very few women do this.\n\nNice restaurants definitely work better.  But I also find things a bit formal, you're sitting across the table from each other, etc. My favorite is to find an upscale bar or restaurant/bar for drinks and small plates.  This can still signal (to some extent) wealth and taste to the SB (do you have any idea what a boulevardier costs in a fancy bar??), but in an atmosphere that is already looser and more fun, and when it comes to eating, nothing is more romantic than sitting on the couch next to each other, knees touching, and sharing tapas (or keep more distance if the chemistry isn't there yet).   Anyway, just giving you an idea for another option, since you and I both seem to have the \"no coffee shops\" thing going!",
            "author": "Azurecole",
            "id": "erse8wf",
            "parent_id": "t1_ers3t86",
            "score": 2,
            "created_utc": 1561211320.0,
            "replies": [
                {
                    "body": "Great advice!",
                    "author": "the_great_blacksby",
                    "id": "ersf0u4",
                    "parent_id": "t1_erse8wf",
                    "score": 1,
                    "created_utc": 1561212036.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Regarding the pickup artists, they are as diverse as there are SBs. While, it doesn't exactly help their case, to be fair to them, the black ones are also just trying to fit in to a community and do what people of other races do. In that case it's just a community of emotionally abusive assholes",
            "author": "the_great_blacksby",
            "id": "ers4ed5",
            "parent_id": "t1_erqdmqs",
            "score": 5,
            "created_utc": 1561199280.0,
            "replies": []
        },
        {
            "body": "I. Am. Intrigued.",
            "author": "the_great_blacksby",
            "id": "ertpblq",
            "parent_id": "t1_erti0u6",
            "score": 1,
            "created_utc": 1561249120.0,
            "replies": [
                {
                    "body": "Hi Intrigued, I'm SFASB!\n\n\nThese are the types of jokes that you could make if I take you up on the ball thing.",
                    "author": "SFASB",
                    "id": "erubpqk",
                    "parent_id": "t1_ertpblq",
                    "score": 2,
                    "created_utc": 1561271176.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I live in the southeast and even I didnt know what that term was. That's absolutely terrible!",
            "author": "Mopsydoll",
            "id": "erqp0er",
            "parent_id": "t1_erqic6v",
            "score": 2,
            "created_utc": 1561148562.0,
            "replies": []
        },
        {
            "body": "This is so true! We are carrying generational and racial mindset of poverty!",
            "author": null,
            "id": "eu5j7r0",
            "parent_id": "t1_ertghyz",
            "score": 2,
            "created_utc": 1563478721.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "erv3gd3",
            "parent_id": "t1_erv2hk5",
            "score": 1,
            "created_utc": 1561305342.0,
            "replies": [
                {
                    "body": "Most black women aren’t any better either I’ve heard horror stories from both black and white men. The people I date don’t know I have these presumptions telling them that would be a major turn off the same way it is for me.",
                    "author": "PinkCookies223",
                    "id": "erv4o6q",
                    "parent_id": "t1_erv3gd3",
                    "score": 2,
                    "created_utc": 1561306307.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I've only my been once but that description sounds just like it, lol",
            "author": "the_great_blacksby",
            "id": "esttj75",
            "parent_id": "t1_erujtn0",
            "score": 2,
            "created_utc": 1562273247.0,
            "replies": [
                {
                    "body": "The African sugar bowl beats western region any day of the week. Almost makes me wish I went there for college.",
                    "author": "bsbdfw",
                    "id": "estu6ve",
                    "parent_id": "t1_esttj75",
                    "score": 2,
                    "created_utc": 1562273513.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Cool. I'm in Dallas",
            "author": "platinumsugargirl45",
            "id": "ersby08",
            "parent_id": "t1_ersbvxb",
            "score": 1,
            "created_utc": 1561209053.0,
            "replies": []
        },
        {
            "body": "> But I'm sure there's an SD out there for them too\n\nI'm sure there are, but they may have to jump up to 60 or 70 year old men, and stop trying for guys close to their age.",
            "author": "ruphun",
            "id": "erumfgr",
            "parent_id": "t1_ers56d0",
            "score": 2,
            "created_utc": 1561288179.0,
            "replies": []
        },
        {
            "body": "Will do",
            "author": "the_great_blacksby",
            "id": "estspt9",
            "parent_id": "t1_erzom60",
            "score": 1,
            "created_utc": 1562272934.0,
            "replies": []
        },
        {
            "body": "Good luck, I recently lost some weight and it feels great",
            "author": "the_great_blacksby",
            "id": "estsjiy",
            "parent_id": "t1_es0u1vy",
            "score": 1,
            "created_utc": 1562272863.0,
            "replies": [
                {
                    "body": "Ty! So far it's going great and every pound that comes off feels like heaven hehehe",
                    "author": null,
                    "id": "esyvqap",
                    "parent_id": "t1_estsjiy",
                    "score": 1,
                    "created_utc": 1562350529.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Bummer....for many reasons",
            "author": "the_great_blacksby",
            "id": "esttbgn",
            "parent_id": "t1_erurla9",
            "score": 1,
            "created_utc": 1562273172.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "ersn8pf",
            "parent_id": "t1_ers2lqy",
            "score": 1,
            "created_utc": 1561218929.0,
            "replies": [
                {
                    "body": "Look at me, just negroing the place up!",
                    "author": "the_great_blacksby",
                    "id": "estv75a",
                    "parent_id": "t1_ersn8pf",
                    "score": 1,
                    "created_utc": 1562273907.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Lol, well at least you're honest. To be fair, if didn't write it, I probably wouldn't have read it either.",
            "author": "the_great_blacksby",
            "id": "estv0zo",
            "parent_id": "t1_erslj6a",
            "score": 2,
            "created_utc": 1562273838.0,
            "replies": []
        },
        {
            "body": "Not mad and not mad at them. Just a poor choice of words on my part above",
            "author": "the_great_blacksby",
            "id": "estvmjq",
            "parent_id": "t1_ert0dz4",
            "score": 1,
            "created_utc": 1562274059.0,
            "replies": []
        },
        {
            "body": "I don't see any reason to believe that. Much more likely, based on vanilla online dating trends, that the two groups say no to each other. But suppose you are right. Does that strike you as a way for a woman to improve her self-respect and mental health?",
            "author": "slfalt",
            "id": "ersszyk",
            "parent_id": "t1_erssfmg",
            "score": 2,
            "created_utc": 1561223392.0,
            "replies": []
        },
        {
            "body": "> Two paragraphs and not a single part of it relates to why there isn't a lid for every pot\n\nIt's an extremely well known trend, often studied in the context of the rise of childlessness. Here's an example that is not behind a paywall. Note that the biggest reason, by far, is, \"I live alone and do not have a steady partner.\" \"No steady partner\" is rising along with childlessness.\n\nhttps://onlinelibrary.wiley.com/doi/full/10.1111/j.1475-6781.2008.00110.x",
            "author": "slfalt",
            "id": "err21fs",
            "parent_id": "t1_err1evp",
            "score": 2,
            "created_utc": 1561158061.0,
            "replies": [
                {
                    "body": "Do those people want a partner and have been rejected by everyone? Or are they people who weren't successful in their younger years and simply decided to go it alone? The narrative I have heard about this is that people give up. We are talking about women who are on a dating site actively messaging people. I do think there is a lid for every pot (or at least, the vast majority of pots) and you can find it if you try.  I'm super happy you are using your resources to get what you want, but your tastes just aren't everyone's taste. It's not just good-looking couples that are going on dates or having sex. If these women aren't getting messaged back, they'll get off the platform. It's a problem that takes care of itself and the only think OP is accomplishing by shaming them is trying to shut them down from talking to someone who might be happy to talk to them back.",
                    "author": null,
                    "id": "err3ti4",
                    "parent_id": "t1_err21fs",
                    "score": 3,
                    "created_utc": 1561159482.0,
                    "replies": [
                        {
                            "body": ">If these women aren't getting messaged back, they'll get off the platform\n\nNot if people on the internet say there's a lid for every pot, chin up you can do it. That's why comments like yours concern me. You are selling snake oil, instead of helping people figure things out.",
                            "author": "slfalt",
                            "id": "err50vj",
                            "parent_id": "t1_err3ti4",
                            "score": 0,
                            "created_utc": 1561160453.0,
                            "replies": [
                                {
                                    "body": "I don't think I am. This is something I've thought about, talked to my therapist about, read about, read reddit comments about, and listened to people talk about A Lot because I used to think no one would ever date me even in vanilla. Once I got through therapy and wasn't an insecure, shame filled mess suddenly I went from having no dates to having really great relationships w quality men. My physical appearance did not change. I just think you don't have experience with men who aren't you while I do. I also think, it's a harmless hello you can scroll past. I can't get mad about every man on every app that messages me that I'm not interested in. I mean, i could, but my quality of life would be worse for it.",
                                    "author": null,
                                    "id": "err5gxj",
                                    "parent_id": "t1_err50vj",
                                    "score": 3,
                                    "created_utc": 1561160812.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Great advice!",
            "author": "the_great_blacksby",
            "id": "ersf0u4",
            "parent_id": "t1_erse8wf",
            "score": 1,
            "created_utc": 1561212036.0,
            "replies": []
        },
        {
            "body": "Hi Intrigued, I'm SFASB!\n\n\nThese are the types of jokes that you could make if I take you up on the ball thing.",
            "author": "SFASB",
            "id": "erubpqk",
            "parent_id": "t1_ertpblq",
            "score": 2,
            "created_utc": 1561271176.0,
            "replies": []
        },
        {
            "body": "Most black women aren’t any better either I’ve heard horror stories from both black and white men. The people I date don’t know I have these presumptions telling them that would be a major turn off the same way it is for me.",
            "author": "PinkCookies223",
            "id": "erv4o6q",
            "parent_id": "t1_erv3gd3",
            "score": 2,
            "created_utc": 1561306307.0,
            "replies": []
        },
        {
            "body": "The African sugar bowl beats western region any day of the week. Almost makes me wish I went there for college.",
            "author": "bsbdfw",
            "id": "estu6ve",
            "parent_id": "t1_esttj75",
            "score": 2,
            "created_utc": 1562273513.0,
            "replies": []
        },
        {
            "body": "Ty! So far it's going great and every pound that comes off feels like heaven hehehe",
            "author": null,
            "id": "esyvqap",
            "parent_id": "t1_estsjiy",
            "score": 1,
            "created_utc": 1562350529.0,
            "replies": []
        },
        {
            "body": "Look at me, just negroing the place up!",
            "author": "the_great_blacksby",
            "id": "estv75a",
            "parent_id": "t1_ersn8pf",
            "score": 1,
            "created_utc": 1562273907.0,
            "replies": []
        },
        {
            "body": "Do those people want a partner and have been rejected by everyone? Or are they people who weren't successful in their younger years and simply decided to go it alone? The narrative I have heard about this is that people give up. We are talking about women who are on a dating site actively messaging people. I do think there is a lid for every pot (or at least, the vast majority of pots) and you can find it if you try.  I'm super happy you are using your resources to get what you want, but your tastes just aren't everyone's taste. It's not just good-looking couples that are going on dates or having sex. If these women aren't getting messaged back, they'll get off the platform. It's a problem that takes care of itself and the only think OP is accomplishing by shaming them is trying to shut them down from talking to someone who might be happy to talk to them back.",
            "author": null,
            "id": "err3ti4",
            "parent_id": "t1_err21fs",
            "score": 3,
            "created_utc": 1561159482.0,
            "replies": [
                {
                    "body": ">If these women aren't getting messaged back, they'll get off the platform\n\nNot if people on the internet say there's a lid for every pot, chin up you can do it. That's why comments like yours concern me. You are selling snake oil, instead of helping people figure things out.",
                    "author": "slfalt",
                    "id": "err50vj",
                    "parent_id": "t1_err3ti4",
                    "score": 0,
                    "created_utc": 1561160453.0,
                    "replies": [
                        {
                            "body": "I don't think I am. This is something I've thought about, talked to my therapist about, read about, read reddit comments about, and listened to people talk about A Lot because I used to think no one would ever date me even in vanilla. Once I got through therapy and wasn't an insecure, shame filled mess suddenly I went from having no dates to having really great relationships w quality men. My physical appearance did not change. I just think you don't have experience with men who aren't you while I do. I also think, it's a harmless hello you can scroll past. I can't get mad about every man on every app that messages me that I'm not interested in. I mean, i could, but my quality of life would be worse for it.",
                            "author": null,
                            "id": "err5gxj",
                            "parent_id": "t1_err50vj",
                            "score": 3,
                            "created_utc": 1561160812.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": ">If these women aren't getting messaged back, they'll get off the platform\n\nNot if people on the internet say there's a lid for every pot, chin up you can do it. That's why comments like yours concern me. You are selling snake oil, instead of helping people figure things out.",
            "author": "slfalt",
            "id": "err50vj",
            "parent_id": "t1_err3ti4",
            "score": 0,
            "created_utc": 1561160453.0,
            "replies": [
                {
                    "body": "I don't think I am. This is something I've thought about, talked to my therapist about, read about, read reddit comments about, and listened to people talk about A Lot because I used to think no one would ever date me even in vanilla. Once I got through therapy and wasn't an insecure, shame filled mess suddenly I went from having no dates to having really great relationships w quality men. My physical appearance did not change. I just think you don't have experience with men who aren't you while I do. I also think, it's a harmless hello you can scroll past. I can't get mad about every man on every app that messages me that I'm not interested in. I mean, i could, but my quality of life would be worse for it.",
                    "author": null,
                    "id": "err5gxj",
                    "parent_id": "t1_err50vj",
                    "score": 3,
                    "created_utc": 1561160812.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I don't think I am. This is something I've thought about, talked to my therapist about, read about, read reddit comments about, and listened to people talk about A Lot because I used to think no one would ever date me even in vanilla. Once I got through therapy and wasn't an insecure, shame filled mess suddenly I went from having no dates to having really great relationships w quality men. My physical appearance did not change. I just think you don't have experience with men who aren't you while I do. I also think, it's a harmless hello you can scroll past. I can't get mad about every man on every app that messages me that I'm not interested in. I mean, i could, but my quality of life would be worse for it.",
            "author": null,
            "id": "err5gxj",
            "parent_id": "t1_err50vj",
            "score": 3,
            "created_utc": 1561160812.0,
            "replies": []
        }
    ]
}