{
    "title": "So who wants a to hear a funny story...",
    "post_id": "axpg8x",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/axpg8x/so_who_wants_a_to_hear_a_funny_story/",
    "author": "captainIsBack4u",
    "body": "A shy friend of mine, who I recently introduced to bowl, just shared this with me but this happened last Friday. Took him this long to get over it. I tried to walk him through most aspects of the process and how not to get scammed. How to never pay someone till you meet in person yada yada.\n\nSo this girl he met on SA, who he says was super hot, went on his 1st M&G with her, tells me they didnt connect all that much. Not much came out of that meeting. But the girl called him few days later and suggests that she is open to an arrangement at $X/ppm. $X is about 2x the average in this area. Of course not thinking with the right head, he is all over that. So they meet up for dinner. He makes hotel reservations. After dinner, she asks him, she is not comfortable riding in his car. How about they drive in her car to the hotel. No harm no foul. Friend gets in her car and while they are pulling in to the hotel parking lot, she asks for her PPM, saying she would feel comfortable getting it now, and leaving it in the car as she has been scammed before. Friend hands over the cash. :).\n\nRight before turning into a parking spot, she tells him, the parking spot is tight, why dont you step out while I park. Need I finish?  I am dying laughing my ass off.",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/axpg8x/so_who_wants_a_to_hear_a_funny_story/",
    "score": 102,
    "upvote_ratio": 0.94,
    "created_utc": 1551815878.0,
    "num_comments": 67,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "Damn, that sucks. \n\nBut I can't feel too bad for him; fate already gave him a hint when they didn't hit if off in the M&G.",
            "author": "bsbdfw",
            "id": "ehvir4z",
            "parent_id": "t3_axpg8x",
            "score": 18,
            "created_utc": 1551825788.0,
            "replies": [
                {
                    "body": "👌 totally agree. ",
                    "author": "MasterAcct2020",
                    "id": "ehvwtlx",
                    "parent_id": "t1_ehvir4z",
                    "score": 7,
                    "created_utc": 1551836610.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I give my friends shit all the time, but getting scammed like that feels like shit. Even if the money is low enough to not matter it can be pretty rough. If the amount is a reasonable amount for him then it's even worse.\n\nI'm not sure if I'd be laughing at my friend in this situation. ",
            "author": "sexviewer",
            "id": "ehv45df",
            "parent_id": "t3_axpg8x",
            "score": 39,
            "created_utc": 1551816223.0,
            "replies": [
                {
                    "body": "Dont get me wrong. I have had my share of stupidities. You gotto pay the piper to learn the ways of the bowl.",
                    "author": "captainIsBack4u",
                    "id": "ehv4c74",
                    "parent_id": "t1_ehv45df",
                    "score": 14,
                    "created_utc": 1551816353.0,
                    "replies": [
                        {
                            "body": "Many years ago , she came to my door we talked , had a glass of wine, money changed hands,  she gasped  she had forgotten the parking meter,  did I have a couple of quarters.........   Zooom Zooom Zooom ",
                            "author": "pinotandsugar",
                            "id": "ehv9lpy",
                            "parent_id": "t1_ehv4c74",
                            "score": 10,
                            "created_utc": 1551819794.0,
                            "replies": [
                                {
                                    "body": "Shoot. Taken for $500.50!",
                                    "author": "HipsterHighwayman",
                                    "id": "ehvau2p",
                                    "parent_id": "t1_ehv9lpy",
                                    "score": 17,
                                    "created_utc": 1551820629.0,
                                    "replies": [
                                        {
                                            "body": "It was a cheap lesson that never left ",
                                            "author": "pinotandsugar",
                                            "id": "ehvn3mt",
                                            "parent_id": "t1_ehvau2p",
                                            "score": 3,
                                            "created_utc": 1551828995.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "> she had forgotten the parking meter, did I have a couple of quarters\n\n:). you have to be a man to accept it.\n\n",
                                    "author": "captainIsBack4u",
                                    "id": "ehvag8l",
                                    "parent_id": "t1_ehv9lpy",
                                    "score": 3,
                                    "created_utc": 1551820372.0,
                                    "replies": []
                                },
                                {
                                    "body": "Damn... who would know a Person in Sugaring business could have such low professional ethics.",
                                    "author": null,
                                    "id": "ehws496",
                                    "parent_id": "t1_ehv9lpy",
                                    "score": 2,
                                    "created_utc": 1551872897.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "You really don't, especially when you have the help of a friend that is experienced in how everything works.",
                            "author": "sexviewer",
                            "id": "ehv579x",
                            "parent_id": "t1_ehv4c74",
                            "score": 8,
                            "created_utc": 1551816936.0,
                            "replies": [
                                {
                                    "body": "I humbly disagree. You do. No matter how much advice one is given, some things are learnt the hard way. After all the advice I got here from some very good people, I handed my first SB $1500 next day. And she ghosted instantaneously. I was told exactly that. I wear that experience proudly. ",
                                    "author": "captainIsBack4u",
                                    "id": "ehv6a7t",
                                    "parent_id": "t1_ehv579x",
                                    "score": 17,
                                    "created_utc": 1551817629.0,
                                    "replies": [
                                        {
                                            "body": ">I wear that experience proudly.\n\nyou have to learn to laugh at yourself. Mine took the PPM, then we went to dinner,. She snuck out after the appetizer using the old \"powder room scam\" The best part was 45 minutes later when the guy sitting at the next table , leaned over and whispered \"I don't think she's coming back\"  LOL\n\nMeanest little size 00, I ever met.",
                                            "author": "TooOldForSD",
                                            "id": "ehvqmv0",
                                            "parent_id": "t1_ehv6a7t",
                                            "score": 11,
                                            "created_utc": 1551831760.0,
                                            "replies": [
                                                {
                                                    "body": "So what do you do now when a girl asks for her ppm before the fun,  because that is standard advice here?\n\n&#x200B;",
                                                    "author": null,
                                                    "id": "ehwapsy",
                                                    "parent_id": "t1_ehvqmv0",
                                                    "score": 4,
                                                    "created_utc": 1551847760.0,
                                                    "replies": [
                                                        {
                                                            "body": "Standard advice is NOT to give the money before you're alone together while still in public. That's a rookie error. It is to give it once you're both behind closed doors.",
                                                            "author": "yourgirlfriday99",
                                                            "id": "ehwroft",
                                                            "parent_id": "t1_ehwapsy",
                                                            "score": 4,
                                                            "created_utc": 1551872275.0,
                                                            "replies": [
                                                                {
                                                                    "body": "[deleted]",
                                                                    "author": null,
                                                                    "id": "ehxn5h4",
                                                                    "parent_id": "t1_ehwroft",
                                                                    "score": 3,
                                                                    "created_utc": 1551897315.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "I'm a SB... I was correcting the user on what the actual standard advice here is.",
                                                                            "author": "yourgirlfriday99",
                                                                            "id": "ehxn72z",
                                                                            "parent_id": "t1_ehxn5h4",
                                                                            "score": 2,
                                                                            "created_utc": 1551897345.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "body": ">before you're alone together \n\n we met in a hotel room before dinner.  I suggested a naughty interlude before we went. When she agreed  and approached me, I figured, OK she's here for real,  so at my suggestion, we skipped it until later. That's when I gave her the sugar to have her feel at ease.  We also had tickets to a show  later, leaving little time for dinner, if we had too much  playtime first we'd be too hurried.  It was a \"high sugar\" overnight date. Not the way to start I guess. \n\nA few months later, I did sugar incrementally but made a hide and seek game of it. Arrival, at dinner, back in the room. that worked out much better. We had  discussed mutual protection against scams a head of time  and both had been victims. ",
                                                                    "author": "TooOldForSD",
                                                                    "id": "ehx4smt",
                                                                    "parent_id": "t1_ehwroft",
                                                                    "score": 2,
                                                                    "created_utc": 1551884923.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "body": "I never give PPM before the fun. If we're both undressed and in the room, sure..but if we're having lunch or being casual and don't have any trust built (haven't been together several times) you're not getting anything from me upfront. ",
                                                            "author": "SugarPieHunnieBunch",
                                                            "id": "ehwd6vn",
                                                            "parent_id": "t1_ehwapsy",
                                                            "score": -1,
                                                            "created_utc": 1551850255.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "body": "The guy was pretty nice though.. ;D",
                                                    "author": null,
                                                    "id": "ehws5s9",
                                                    "parent_id": "t1_ehvqmv0",
                                                    "score": 1,
                                                    "created_utc": 1551872959.0,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "body": "Then how do so many people enter the bowl and never get scammed like that? There is also a difference between advice from random internet strangers and having a friend introduce you to something and offer to help you stay safe.\n\nEven when people here get scammed after ignoring all standard advice you see most people offer sympathy not laughs and that is for strangers.",
                                            "author": "sexviewer",
                                            "id": "ehv8icp",
                                            "parent_id": "t1_ehv6a7t",
                                            "score": 3,
                                            "created_utc": 1551819078.0,
                                            "replies": [
                                                {
                                                    "body": "[deleted]",
                                                    "author": null,
                                                    "id": "ehvcmx4",
                                                    "parent_id": "t1_ehv8icp",
                                                    "score": 3,
                                                    "created_utc": 1551821731.0,
                                                    "replies": [
                                                        {
                                                            "body": "My main point is the guy has a friend helping him stay safe. While the friend can't be there to handle every situation, I'd say covering things like this is the most important thing to go over when telling a guy how to stay safe. He apparently did a pretty shitty job of preparing the guy and is now laughing at him.",
                                                            "author": "sexviewer",
                                                            "id": "ehvd0z3",
                                                            "parent_id": "t1_ehvcmx4",
                                                            "score": 1,
                                                            "created_utc": 1551821984.0,
                                                            "replies": [
                                                                {
                                                                    "body": "My friend and moi are both laughing. But if you need to win this argument, you win!",
                                                                    "author": "captainIsBack4u",
                                                                    "id": "ehvdruy",
                                                                    "parent_id": "t1_ehvd0z3",
                                                                    "score": 3,
                                                                    "created_utc": 1551822458.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "I didn't realize there was a winner or loser when discussing random shit on reddit. But way to try to imply I want or care about something I don't. ",
                                                                            "author": "sexviewer",
                                                                            "id": "ehvf3ld",
                                                                            "parent_id": "t1_ehvdruy",
                                                                            "score": -3,
                                                                            "created_utc": 1551823292.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "Well.. you are busting my balls for something both me and my friend found funny. I dont know what else to tell you. Shit happens. You laugh it off and move on. Sometimes its a good joke. We cant share this IRL, so here we are!",
                                                                                    "author": "captainIsBack4u",
                                                                                    "id": "ehvfmt2",
                                                                                    "parent_id": "t1_ehvf3ld",
                                                                                    "score": 6,
                                                                                    "created_utc": 1551823643.0,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "body": "So what do you do now when a girl asks for her ppm before the fun,  because that is standard advice here?",
                                            "author": null,
                                            "id": "ehwapaa",
                                            "parent_id": "t1_ehv6a7t",
                                            "score": 1,
                                            "created_utc": 1551847747.0,
                                            "replies": [
                                                {
                                                    "body": "You pay before fun bc that is standard but make sure you’re both in the room & not a parking lot or restaurant lol. ",
                                                    "author": "BStonedxoxo",
                                                    "id": "ehwe0od",
                                                    "parent_id": "t1_ehwapaa",
                                                    "score": 5,
                                                    "created_utc": 1551851134.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Based on many stories I heard there’s always a first time. It doesn’t matter how many years you know the business or being male or female.",
            "author": "AKA_Mr_X",
            "id": "ehvcua9",
            "parent_id": "t3_axpg8x",
            "score": 6,
            "created_utc": 1551821863.0,
            "replies": [
                {
                    "body": "Agree... 100%... there is always a first time. If this girl would have been an Ace, someone else down the road would have taught him the lesson. I trust and like to be trusted and have been scammed a few times, every time different modus operandi. But now I can sense it. It took time and money to learn it. Bowl is nothing like vanilla, or any other business transaction. You are dealing with a beautiful women, and the guard comes down easy at least to start with. ",
                    "author": "captainIsBack4u",
                    "id": "ehveawa",
                    "parent_id": "t1_ehvcua9",
                    "score": 2,
                    "created_utc": 1551822797.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Oh wow, looks like quite a bit of planning went into that heist. Not sure I'd call it scamming though. \n\nAt least he just lost some money. This could have gone a lot worse if she had an accomplice. It's just dumb to get into a stranger's car, even if you are a guy. ",
            "author": "denardos",
            "id": "ehvfdv0",
            "parent_id": "t3_axpg8x",
            "score": 4,
            "created_utc": 1551823480.0,
            "replies": [
                {
                    "body": "Sounds scammy to me.  In a loose definition for sugaring context.",
                    "author": "CentralUSGal",
                    "id": "ehvg8ol",
                    "parent_id": "t1_ehvfdv0",
                    "score": -1,
                    "created_utc": 1551824049.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "ehvcta7",
            "parent_id": "t3_axpg8x",
            "score": 6,
            "created_utc": 1551821845.0,
            "replies": [
                {
                    "body": "> stole my TV\n\nI think I read her profile \" Likes snuggling up and watching someone elses TV\"  Now I get it.",
                    "author": "TooOldForSD",
                    "id": "ehvr1pn",
                    "parent_id": "t1_ehvcta7",
                    "score": 5,
                    "created_utc": 1551832089.0,
                    "replies": []
                },
                {
                    "body": "😳 story time?",
                    "author": null,
                    "id": "ehvjyad",
                    "parent_id": "t1_ehvcta7",
                    "score": 1,
                    "created_utc": 1551826650.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "ehw2gqr",
                            "parent_id": "t1_ehvjyad",
                            "score": 0,
                            "created_utc": 1551840895.0,
                            "replies": [
                                {
                                    "body": "Almost the same thing happened to me, except the SB walked away with my refrigerator. There were a lot of gourmet meals in there too. Well she came from a poor family so I don't blame her.",
                                    "author": "highfructoseSD",
                                    "id": "ehzh377",
                                    "parent_id": "t1_ehw2gqr",
                                    "score": 2,
                                    "created_utc": 1551954091.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": " She basically robbed him",
            "author": "Jamesthesage",
            "id": "ehvaf5m",
            "parent_id": "t3_axpg8x",
            "score": 7,
            "created_utc": 1551820352.0,
            "replies": [
                {
                    "body": "Scammed! Robbed is bit too strong. He willingly handed over the monies.",
                    "author": "captainIsBack4u",
                    "id": "ehvd1mt",
                    "parent_id": "t1_ehvaf5m",
                    "score": 7,
                    "created_utc": 1551821996.0,
                    "replies": [
                        {
                            "body": "If this is robbed, an SB not being paid is raped.  Either is probably a stretch.  Definitely a dick move and unscrupulous either way.  ",
                            "author": "CentralUSGal",
                            "id": "ehvguok",
                            "parent_id": "t1_ehvd1mt",
                            "score": 13,
                            "created_utc": 1551824459.0,
                            "replies": [
                                {
                                    "body": "Very nice analogy!",
                                    "author": "captainIsBack4u",
                                    "id": "ehx1wh3",
                                    "parent_id": "t1_ehvguok",
                                    "score": 1,
                                    "created_utc": 1551882718.0,
                                    "replies": []
                                },
                                {
                                    "body": "I think you mean regret...when you throw in \"rape\" so casually AFTER consent has taken place..you are committing a crime. ",
                                    "author": "SugarPieHunnieBunch",
                                    "id": "ehwd0u6",
                                    "parent_id": "t1_ehvguok",
                                    "score": -4,
                                    "created_utc": 1551850077.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "oH MY GOD. Your poor friend. I'm so sorry this happened. She's so shitty for scamming you like that but I think a lot of girls will scam SDs and if it works once, they'll continue to do it .",
            "author": "happylilegg",
            "id": "ehv5agn",
            "parent_id": "t3_axpg8x",
            "score": 2,
            "created_utc": 1551816995.0,
            "replies": []
        },
        {
            "body": "why didn't they drive separate cars???",
            "author": "lcsugar",
            "id": "ehv9qlh",
            "parent_id": "t3_axpg8x",
            "score": 2,
            "created_utc": 1551819887.0,
            "replies": [
                {
                    "body": "She wanted to make sure he wouldn't be able to give chase. She left him stranded at the hotel and his car at the original meet location. I do wonder what her plan B would've been if he had insisted on driving himself though. I'm sure she had one.",
                    "author": "LaSirene23",
                    "id": "ehvd2k2",
                    "parent_id": "t1_ehv9qlh",
                    "score": 2,
                    "created_utc": 1551822013.0,
                    "replies": [
                        {
                            "body": "i don't buy this story.  Filing it under Creative Writing.",
                            "author": "lcsugar",
                            "id": "ehvg8na",
                            "parent_id": "t1_ehvd2k2",
                            "score": 4,
                            "created_utc": 1551824048.0,
                            "replies": [
                                {
                                    "body": ">i don't buy this story.  Filing it under Creative Writing\n\nLmao",
                                    "author": "pintodinosaur",
                                    "id": "ehxlw6y",
                                    "parent_id": "t1_ehvg8na",
                                    "score": 1,
                                    "created_utc": 1551896479.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Poor guy :O That was devious! Took his money and.. bye!",
            "author": null,
            "id": "ehws1lz",
            "parent_id": "t3_axpg8x",
            "score": 1,
            "created_utc": 1551872795.0,
            "replies": []
        },
        {
            "body": "Wouldn't it be more reasonable to handover 50% before and 50% after..? In the first few interactions of course...",
            "author": null,
            "id": "ehws8bq",
            "parent_id": "t3_axpg8x",
            "score": 1,
            "created_utc": 1551873053.0,
            "replies": []
        },
        {
            "body": "That's a pretty ballsy move on her part. She's definitely a pro con artist. Lucky he only lost a few hundred bucks, sounds like she could have played him along for a larger take.",
            "author": "SD-ofNote",
            "id": "ehxv0ot",
            "parent_id": "t3_axpg8x",
            "score": 1,
            "created_utc": 1551902462.0,
            "replies": []
        },
        {
            "body": "It's a funny old thing - For every time you see on here \"get the money first girlfriend - no money, no honey\"\n\nI am sure there is one of these stories.\n\nOnce that money changes hands that girl has every right to just walk away, You try and stop her and\n\nyou go to jail. I've had this happen in a hotel lobby - except she had her boyfriend come in and walk her out.\n\nSo we do need to trust each other a bit (trust through screening and M&Gs - IDK)",
            "author": "tankbinding",
            "id": "ehvbqfw",
            "parent_id": "t3_axpg8x",
            "score": 1,
            "created_utc": 1551821190.0,
            "replies": []
        },
        {
            "body": "lol....HE IS NOT A LONE!  been there myself lol, though I had a different ending. I wasn't willing to let go and the police got involved--- I got all my money back and she learned a lesson- hope she is reading this and remembering me ;p   ",
            "author": "Jakcoll",
            "id": "ehvs425",
            "parent_id": "t3_axpg8x",
            "score": 1,
            "created_utc": 1551832923.0,
            "replies": [
                {
                    "body": "Would like to hear how that went?  LE view on the situation etc.",
                    "author": "rogerthatonce",
                    "id": "ehvvlz0",
                    "parent_id": "t1_ehvs425",
                    "score": 3,
                    "created_utc": 1551835696.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Ugg this wasn’t funny at all but I’m glad you guys are finding humor in it. I’m starting to think me and my SB just got lucky. Both of us never had a SR so it was a bit awkward.  I’m realizing we both made a bunch of mistakes that are frowned upon in the bowl but somehow we are now together. \n\nI have sent her money through Zelle for textbooks and uber fare before even meeting her. We had sex right after our M&G before any arrangement was formally made, no real schedule was set up etc. \n\nIt’s more awkward to try and establish them after the fact.  I do hope this lasts since I really like her but those mistakes early on are coming to bear now. ",
            "author": "magabag",
            "id": "ehvoopb",
            "parent_id": "t3_axpg8x",
            "score": 1,
            "created_utc": 1551830214.0,
            "replies": []
        },
        {
            "body": "Poor guy. Got hit with a cost of doing buiness charge first time in. Smh.",
            "author": "TastySpermDispenser",
            "id": "ehvr5rz",
            "parent_id": "t3_axpg8x",
            "score": 1,
            "created_utc": 1551832175.0,
            "replies": []
        },
        {
            "body": "I've been in the bowl 5 years. I've been scammed and also lost money through poor judgement, when there wasn't an intent to commit outright fraud (polite way of saying \\`thinking with my dick'). That's part of life in the bowl and its best that one uses it as a learning experience. I attribute my success in the bowl - in a country with a conservative culture, where SD's outnumber SBs,to taking calculated risks.   \n",
            "author": "Dean_46",
            "id": "ehw8puk",
            "parent_id": "t3_axpg8x",
            "score": 1,
            "created_utc": 1551845946.0,
            "replies": [
                {
                    "body": "So what do you do now when a girl asks for her ppm before the fun,  because that is standard advice for SB's.   Any tips appreciated.",
                    "author": null,
                    "id": "ehwaw3k",
                    "parent_id": "t1_ehw8puk",
                    "score": 0,
                    "created_utc": 1551847925.0,
                    "replies": [
                        {
                            "body": "Say that you would give it to her just before getting intimate - once you are alone and in the bedroom. Show her the envelope to reassure her. ",
                            "author": "Dean_46",
                            "id": "ehz3nj6",
                            "parent_id": "t1_ehwaw3k",
                            "score": 1,
                            "created_utc": 1551935388.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Pretty ballsy.   With a little effort it would be easy to track the thief down.  Not sure I could let something like that go easily. ",
            "author": "VitaMixSD",
            "id": "ehvsept",
            "parent_id": "t3_axpg8x",
            "score": 0,
            "created_utc": 1551833161.0,
            "replies": []
        },
        {
            "body": "Sounds like you owe your friend the 2X ppm . . . ",
            "author": null,
            "id": "ehv4e4m",
            "parent_id": "t3_axpg8x",
            "score": -1,
            "created_utc": 1551816390.0,
            "replies": [
                {
                    "body": "+dinner +hotel reservation. Ouch!",
                    "author": "captainIsBack4u",
                    "id": "ehvetmo",
                    "parent_id": "t1_ehv4e4m",
                    "score": 1,
                    "created_utc": 1551823113.0,
                    "replies": [
                        {
                            "body": "How did he get back to his car, could be some transportation costs also?",
                            "author": "rogerthatonce",
                            "id": "ehvvs27",
                            "parent_id": "t1_ehvetmo",
                            "score": 1,
                            "created_utc": 1551835829.0,
                            "replies": [
                                {
                                    "body": "Tells me he walked back 3 miles or so. Weather was good, he had some time to kill and ponder over the meaning of life ;)",
                                    "author": "captainIsBack4u",
                                    "id": "ehx3f1b",
                                    "parent_id": "t1_ehvvs27",
                                    "score": 1,
                                    "created_utc": 1551883893.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "ehva1xu",
            "parent_id": "t3_axpg8x",
            "score": -1,
            "created_utc": 1551820104.0,
            "replies": [
                {
                    "body": "Yes. I should have been in that car.",
                    "author": "captainIsBack4u",
                    "id": "ehvam1d",
                    "parent_id": "t1_ehva1xu",
                    "score": 1,
                    "created_utc": 1551820480.0,
                    "replies": []
                },
                {
                    "body": "Oh come on. There are so many \"never ever\"s that it would be impossible to rattle them all off. Especially if you've never been the victim of one particular flavor of the cash and dash. ",
                    "author": "This_is_Not_My_Handl",
                    "id": "ehvd6dx",
                    "parent_id": "t1_ehva1xu",
                    "score": 1,
                    "created_utc": 1551822081.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Hahaha - wonder how often this happens",
            "author": null,
            "id": "ehviesh",
            "parent_id": "t3_axpg8x",
            "score": 0,
            "created_utc": 1551825546.0,
            "replies": []
        },
        {
            "body": "So what do you experienced SD's do now when a girl asks for her ppm before the fun?   because that is standard advice for SB's here to avoid being scammed?   Only hand it to her in the hotel room after the blouse comes off? lol",
            "author": null,
            "id": "ehwasum",
            "parent_id": "t3_axpg8x",
            "score": 0,
            "created_utc": 1551847840.0,
            "replies": []
        },
        {
            "body": "Hopefully this is a fantasy story",
            "author": "alphadawg26",
            "id": "ehv3vje",
            "parent_id": "t3_axpg8x",
            "score": -4,
            "created_utc": 1551816036.0,
            "replies": [
                {
                    "body": "Nope! honest to god truth! Or atleast what he told me.",
                    "author": "captainIsBack4u",
                    "id": "ehv400b",
                    "parent_id": "t1_ehv3vje",
                    "score": 1,
                    "created_utc": 1551816120.0,
                    "replies": [
                        {
                            "body": "Betas gonna beta\n\nCant fix these beta males. Its genetic I think.",
                            "author": "alphadawg26",
                            "id": "ehv45ig",
                            "parent_id": "t1_ehv400b",
                            "score": -15,
                            "created_utc": 1551816226.0,
                            "replies": [
                                {
                                    "body": "Ironically, the only people I ever hear talk about alpha and beta males fit the definition they use for beta perfectly. See: the red pill",
                                    "author": "sexviewer",
                                    "id": "ehv5dh6",
                                    "parent_id": "t1_ehv45ig",
                                    "score": 18,
                                    "created_utc": 1551817050.0,
                                    "replies": [
                                        {
                                            "body": "LOL cool story bro\n\n&#x200B;\n\nI truly dont think you can fix these betas because they are born suckers.   \n\n&#x200B;\n\n&#x200B;",
                                            "author": "alphadawg26",
                                            "id": "ehvkabo",
                                            "parent_id": "t1_ehv5dh6",
                                            "score": -5,
                                            "created_utc": 1551826896.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "👌 totally agree. ",
            "author": "MasterAcct2020",
            "id": "ehvwtlx",
            "parent_id": "t1_ehvir4z",
            "score": 7,
            "created_utc": 1551836610.0,
            "replies": []
        },
        {
            "body": "Dont get me wrong. I have had my share of stupidities. You gotto pay the piper to learn the ways of the bowl.",
            "author": "captainIsBack4u",
            "id": "ehv4c74",
            "parent_id": "t1_ehv45df",
            "score": 14,
            "created_utc": 1551816353.0,
            "replies": [
                {
                    "body": "Many years ago , she came to my door we talked , had a glass of wine, money changed hands,  she gasped  she had forgotten the parking meter,  did I have a couple of quarters.........   Zooom Zooom Zooom ",
                    "author": "pinotandsugar",
                    "id": "ehv9lpy",
                    "parent_id": "t1_ehv4c74",
                    "score": 10,
                    "created_utc": 1551819794.0,
                    "replies": [
                        {
                            "body": "Shoot. Taken for $500.50!",
                            "author": "HipsterHighwayman",
                            "id": "ehvau2p",
                            "parent_id": "t1_ehv9lpy",
                            "score": 17,
                            "created_utc": 1551820629.0,
                            "replies": [
                                {
                                    "body": "It was a cheap lesson that never left ",
                                    "author": "pinotandsugar",
                                    "id": "ehvn3mt",
                                    "parent_id": "t1_ehvau2p",
                                    "score": 3,
                                    "created_utc": 1551828995.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "> she had forgotten the parking meter, did I have a couple of quarters\n\n:). you have to be a man to accept it.\n\n",
                            "author": "captainIsBack4u",
                            "id": "ehvag8l",
                            "parent_id": "t1_ehv9lpy",
                            "score": 3,
                            "created_utc": 1551820372.0,
                            "replies": []
                        },
                        {
                            "body": "Damn... who would know a Person in Sugaring business could have such low professional ethics.",
                            "author": null,
                            "id": "ehws496",
                            "parent_id": "t1_ehv9lpy",
                            "score": 2,
                            "created_utc": 1551872897.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "You really don't, especially when you have the help of a friend that is experienced in how everything works.",
                    "author": "sexviewer",
                    "id": "ehv579x",
                    "parent_id": "t1_ehv4c74",
                    "score": 8,
                    "created_utc": 1551816936.0,
                    "replies": [
                        {
                            "body": "I humbly disagree. You do. No matter how much advice one is given, some things are learnt the hard way. After all the advice I got here from some very good people, I handed my first SB $1500 next day. And she ghosted instantaneously. I was told exactly that. I wear that experience proudly. ",
                            "author": "captainIsBack4u",
                            "id": "ehv6a7t",
                            "parent_id": "t1_ehv579x",
                            "score": 17,
                            "created_utc": 1551817629.0,
                            "replies": [
                                {
                                    "body": ">I wear that experience proudly.\n\nyou have to learn to laugh at yourself. Mine took the PPM, then we went to dinner,. She snuck out after the appetizer using the old \"powder room scam\" The best part was 45 minutes later when the guy sitting at the next table , leaned over and whispered \"I don't think she's coming back\"  LOL\n\nMeanest little size 00, I ever met.",
                                    "author": "TooOldForSD",
                                    "id": "ehvqmv0",
                                    "parent_id": "t1_ehv6a7t",
                                    "score": 11,
                                    "created_utc": 1551831760.0,
                                    "replies": [
                                        {
                                            "body": "So what do you do now when a girl asks for her ppm before the fun,  because that is standard advice here?\n\n&#x200B;",
                                            "author": null,
                                            "id": "ehwapsy",
                                            "parent_id": "t1_ehvqmv0",
                                            "score": 4,
                                            "created_utc": 1551847760.0,
                                            "replies": [
                                                {
                                                    "body": "Standard advice is NOT to give the money before you're alone together while still in public. That's a rookie error. It is to give it once you're both behind closed doors.",
                                                    "author": "yourgirlfriday99",
                                                    "id": "ehwroft",
                                                    "parent_id": "t1_ehwapsy",
                                                    "score": 4,
                                                    "created_utc": 1551872275.0,
                                                    "replies": [
                                                        {
                                                            "body": "[deleted]",
                                                            "author": null,
                                                            "id": "ehxn5h4",
                                                            "parent_id": "t1_ehwroft",
                                                            "score": 3,
                                                            "created_utc": 1551897315.0,
                                                            "replies": [
                                                                {
                                                                    "body": "I'm a SB... I was correcting the user on what the actual standard advice here is.",
                                                                    "author": "yourgirlfriday99",
                                                                    "id": "ehxn72z",
                                                                    "parent_id": "t1_ehxn5h4",
                                                                    "score": 2,
                                                                    "created_utc": 1551897345.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "body": ">before you're alone together \n\n we met in a hotel room before dinner.  I suggested a naughty interlude before we went. When she agreed  and approached me, I figured, OK she's here for real,  so at my suggestion, we skipped it until later. That's when I gave her the sugar to have her feel at ease.  We also had tickets to a show  later, leaving little time for dinner, if we had too much  playtime first we'd be too hurried.  It was a \"high sugar\" overnight date. Not the way to start I guess. \n\nA few months later, I did sugar incrementally but made a hide and seek game of it. Arrival, at dinner, back in the room. that worked out much better. We had  discussed mutual protection against scams a head of time  and both had been victims. ",
                                                            "author": "TooOldForSD",
                                                            "id": "ehx4smt",
                                                            "parent_id": "t1_ehwroft",
                                                            "score": 2,
                                                            "created_utc": 1551884923.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "body": "I never give PPM before the fun. If we're both undressed and in the room, sure..but if we're having lunch or being casual and don't have any trust built (haven't been together several times) you're not getting anything from me upfront. ",
                                                    "author": "SugarPieHunnieBunch",
                                                    "id": "ehwd6vn",
                                                    "parent_id": "t1_ehwapsy",
                                                    "score": -1,
                                                    "created_utc": 1551850255.0,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "body": "The guy was pretty nice though.. ;D",
                                            "author": null,
                                            "id": "ehws5s9",
                                            "parent_id": "t1_ehvqmv0",
                                            "score": 1,
                                            "created_utc": 1551872959.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "Then how do so many people enter the bowl and never get scammed like that? There is also a difference between advice from random internet strangers and having a friend introduce you to something and offer to help you stay safe.\n\nEven when people here get scammed after ignoring all standard advice you see most people offer sympathy not laughs and that is for strangers.",
                                    "author": "sexviewer",
                                    "id": "ehv8icp",
                                    "parent_id": "t1_ehv6a7t",
                                    "score": 3,
                                    "created_utc": 1551819078.0,
                                    "replies": [
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "ehvcmx4",
                                            "parent_id": "t1_ehv8icp",
                                            "score": 3,
                                            "created_utc": 1551821731.0,
                                            "replies": [
                                                {
                                                    "body": "My main point is the guy has a friend helping him stay safe. While the friend can't be there to handle every situation, I'd say covering things like this is the most important thing to go over when telling a guy how to stay safe. He apparently did a pretty shitty job of preparing the guy and is now laughing at him.",
                                                    "author": "sexviewer",
                                                    "id": "ehvd0z3",
                                                    "parent_id": "t1_ehvcmx4",
                                                    "score": 1,
                                                    "created_utc": 1551821984.0,
                                                    "replies": [
                                                        {
                                                            "body": "My friend and moi are both laughing. But if you need to win this argument, you win!",
                                                            "author": "captainIsBack4u",
                                                            "id": "ehvdruy",
                                                            "parent_id": "t1_ehvd0z3",
                                                            "score": 3,
                                                            "created_utc": 1551822458.0,
                                                            "replies": [
                                                                {
                                                                    "body": "I didn't realize there was a winner or loser when discussing random shit on reddit. But way to try to imply I want or care about something I don't. ",
                                                                    "author": "sexviewer",
                                                                    "id": "ehvf3ld",
                                                                    "parent_id": "t1_ehvdruy",
                                                                    "score": -3,
                                                                    "created_utc": 1551823292.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "Well.. you are busting my balls for something both me and my friend found funny. I dont know what else to tell you. Shit happens. You laugh it off and move on. Sometimes its a good joke. We cant share this IRL, so here we are!",
                                                                            "author": "captainIsBack4u",
                                                                            "id": "ehvfmt2",
                                                                            "parent_id": "t1_ehvf3ld",
                                                                            "score": 6,
                                                                            "created_utc": 1551823643.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "So what do you do now when a girl asks for her ppm before the fun,  because that is standard advice here?",
                                    "author": null,
                                    "id": "ehwapaa",
                                    "parent_id": "t1_ehv6a7t",
                                    "score": 1,
                                    "created_utc": 1551847747.0,
                                    "replies": [
                                        {
                                            "body": "You pay before fun bc that is standard but make sure you’re both in the room & not a parking lot or restaurant lol. ",
                                            "author": "BStonedxoxo",
                                            "id": "ehwe0od",
                                            "parent_id": "t1_ehwapaa",
                                            "score": 5,
                                            "created_utc": 1551851134.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Agree... 100%... there is always a first time. If this girl would have been an Ace, someone else down the road would have taught him the lesson. I trust and like to be trusted and have been scammed a few times, every time different modus operandi. But now I can sense it. It took time and money to learn it. Bowl is nothing like vanilla, or any other business transaction. You are dealing with a beautiful women, and the guard comes down easy at least to start with. ",
            "author": "captainIsBack4u",
            "id": "ehveawa",
            "parent_id": "t1_ehvcua9",
            "score": 2,
            "created_utc": 1551822797.0,
            "replies": []
        },
        {
            "body": "Sounds scammy to me.  In a loose definition for sugaring context.",
            "author": "CentralUSGal",
            "id": "ehvg8ol",
            "parent_id": "t1_ehvfdv0",
            "score": -1,
            "created_utc": 1551824049.0,
            "replies": []
        },
        {
            "body": "> stole my TV\n\nI think I read her profile \" Likes snuggling up and watching someone elses TV\"  Now I get it.",
            "author": "TooOldForSD",
            "id": "ehvr1pn",
            "parent_id": "t1_ehvcta7",
            "score": 5,
            "created_utc": 1551832089.0,
            "replies": []
        },
        {
            "body": "😳 story time?",
            "author": null,
            "id": "ehvjyad",
            "parent_id": "t1_ehvcta7",
            "score": 1,
            "created_utc": 1551826650.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "ehw2gqr",
                    "parent_id": "t1_ehvjyad",
                    "score": 0,
                    "created_utc": 1551840895.0,
                    "replies": [
                        {
                            "body": "Almost the same thing happened to me, except the SB walked away with my refrigerator. There were a lot of gourmet meals in there too. Well she came from a poor family so I don't blame her.",
                            "author": "highfructoseSD",
                            "id": "ehzh377",
                            "parent_id": "t1_ehw2gqr",
                            "score": 2,
                            "created_utc": 1551954091.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Scammed! Robbed is bit too strong. He willingly handed over the monies.",
            "author": "captainIsBack4u",
            "id": "ehvd1mt",
            "parent_id": "t1_ehvaf5m",
            "score": 7,
            "created_utc": 1551821996.0,
            "replies": [
                {
                    "body": "If this is robbed, an SB not being paid is raped.  Either is probably a stretch.  Definitely a dick move and unscrupulous either way.  ",
                    "author": "CentralUSGal",
                    "id": "ehvguok",
                    "parent_id": "t1_ehvd1mt",
                    "score": 13,
                    "created_utc": 1551824459.0,
                    "replies": [
                        {
                            "body": "Very nice analogy!",
                            "author": "captainIsBack4u",
                            "id": "ehx1wh3",
                            "parent_id": "t1_ehvguok",
                            "score": 1,
                            "created_utc": 1551882718.0,
                            "replies": []
                        },
                        {
                            "body": "I think you mean regret...when you throw in \"rape\" so casually AFTER consent has taken place..you are committing a crime. ",
                            "author": "SugarPieHunnieBunch",
                            "id": "ehwd0u6",
                            "parent_id": "t1_ehvguok",
                            "score": -4,
                            "created_utc": 1551850077.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "She wanted to make sure he wouldn't be able to give chase. She left him stranded at the hotel and his car at the original meet location. I do wonder what her plan B would've been if he had insisted on driving himself though. I'm sure she had one.",
            "author": "LaSirene23",
            "id": "ehvd2k2",
            "parent_id": "t1_ehv9qlh",
            "score": 2,
            "created_utc": 1551822013.0,
            "replies": [
                {
                    "body": "i don't buy this story.  Filing it under Creative Writing.",
                    "author": "lcsugar",
                    "id": "ehvg8na",
                    "parent_id": "t1_ehvd2k2",
                    "score": 4,
                    "created_utc": 1551824048.0,
                    "replies": [
                        {
                            "body": ">i don't buy this story.  Filing it under Creative Writing\n\nLmao",
                            "author": "pintodinosaur",
                            "id": "ehxlw6y",
                            "parent_id": "t1_ehvg8na",
                            "score": 1,
                            "created_utc": 1551896479.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Would like to hear how that went?  LE view on the situation etc.",
            "author": "rogerthatonce",
            "id": "ehvvlz0",
            "parent_id": "t1_ehvs425",
            "score": 3,
            "created_utc": 1551835696.0,
            "replies": []
        },
        {
            "body": "So what do you do now when a girl asks for her ppm before the fun,  because that is standard advice for SB's.   Any tips appreciated.",
            "author": null,
            "id": "ehwaw3k",
            "parent_id": "t1_ehw8puk",
            "score": 0,
            "created_utc": 1551847925.0,
            "replies": [
                {
                    "body": "Say that you would give it to her just before getting intimate - once you are alone and in the bedroom. Show her the envelope to reassure her. ",
                    "author": "Dean_46",
                    "id": "ehz3nj6",
                    "parent_id": "t1_ehwaw3k",
                    "score": 1,
                    "created_utc": 1551935388.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "+dinner +hotel reservation. Ouch!",
            "author": "captainIsBack4u",
            "id": "ehvetmo",
            "parent_id": "t1_ehv4e4m",
            "score": 1,
            "created_utc": 1551823113.0,
            "replies": [
                {
                    "body": "How did he get back to his car, could be some transportation costs also?",
                    "author": "rogerthatonce",
                    "id": "ehvvs27",
                    "parent_id": "t1_ehvetmo",
                    "score": 1,
                    "created_utc": 1551835829.0,
                    "replies": [
                        {
                            "body": "Tells me he walked back 3 miles or so. Weather was good, he had some time to kill and ponder over the meaning of life ;)",
                            "author": "captainIsBack4u",
                            "id": "ehx3f1b",
                            "parent_id": "t1_ehvvs27",
                            "score": 1,
                            "created_utc": 1551883893.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yes. I should have been in that car.",
            "author": "captainIsBack4u",
            "id": "ehvam1d",
            "parent_id": "t1_ehva1xu",
            "score": 1,
            "created_utc": 1551820480.0,
            "replies": []
        },
        {
            "body": "Oh come on. There are so many \"never ever\"s that it would be impossible to rattle them all off. Especially if you've never been the victim of one particular flavor of the cash and dash. ",
            "author": "This_is_Not_My_Handl",
            "id": "ehvd6dx",
            "parent_id": "t1_ehva1xu",
            "score": 1,
            "created_utc": 1551822081.0,
            "replies": []
        },
        {
            "body": "Nope! honest to god truth! Or atleast what he told me.",
            "author": "captainIsBack4u",
            "id": "ehv400b",
            "parent_id": "t1_ehv3vje",
            "score": 1,
            "created_utc": 1551816120.0,
            "replies": [
                {
                    "body": "Betas gonna beta\n\nCant fix these beta males. Its genetic I think.",
                    "author": "alphadawg26",
                    "id": "ehv45ig",
                    "parent_id": "t1_ehv400b",
                    "score": -15,
                    "created_utc": 1551816226.0,
                    "replies": [
                        {
                            "body": "Ironically, the only people I ever hear talk about alpha and beta males fit the definition they use for beta perfectly. See: the red pill",
                            "author": "sexviewer",
                            "id": "ehv5dh6",
                            "parent_id": "t1_ehv45ig",
                            "score": 18,
                            "created_utc": 1551817050.0,
                            "replies": [
                                {
                                    "body": "LOL cool story bro\n\n&#x200B;\n\nI truly dont think you can fix these betas because they are born suckers.   \n\n&#x200B;\n\n&#x200B;",
                                    "author": "alphadawg26",
                                    "id": "ehvkabo",
                                    "parent_id": "t1_ehv5dh6",
                                    "score": -5,
                                    "created_utc": 1551826896.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Many years ago , she came to my door we talked , had a glass of wine, money changed hands,  she gasped  she had forgotten the parking meter,  did I have a couple of quarters.........   Zooom Zooom Zooom ",
            "author": "pinotandsugar",
            "id": "ehv9lpy",
            "parent_id": "t1_ehv4c74",
            "score": 10,
            "created_utc": 1551819794.0,
            "replies": [
                {
                    "body": "Shoot. Taken for $500.50!",
                    "author": "HipsterHighwayman",
                    "id": "ehvau2p",
                    "parent_id": "t1_ehv9lpy",
                    "score": 17,
                    "created_utc": 1551820629.0,
                    "replies": [
                        {
                            "body": "It was a cheap lesson that never left ",
                            "author": "pinotandsugar",
                            "id": "ehvn3mt",
                            "parent_id": "t1_ehvau2p",
                            "score": 3,
                            "created_utc": 1551828995.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "> she had forgotten the parking meter, did I have a couple of quarters\n\n:). you have to be a man to accept it.\n\n",
                    "author": "captainIsBack4u",
                    "id": "ehvag8l",
                    "parent_id": "t1_ehv9lpy",
                    "score": 3,
                    "created_utc": 1551820372.0,
                    "replies": []
                },
                {
                    "body": "Damn... who would know a Person in Sugaring business could have such low professional ethics.",
                    "author": null,
                    "id": "ehws496",
                    "parent_id": "t1_ehv9lpy",
                    "score": 2,
                    "created_utc": 1551872897.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "You really don't, especially when you have the help of a friend that is experienced in how everything works.",
            "author": "sexviewer",
            "id": "ehv579x",
            "parent_id": "t1_ehv4c74",
            "score": 8,
            "created_utc": 1551816936.0,
            "replies": [
                {
                    "body": "I humbly disagree. You do. No matter how much advice one is given, some things are learnt the hard way. After all the advice I got here from some very good people, I handed my first SB $1500 next day. And she ghosted instantaneously. I was told exactly that. I wear that experience proudly. ",
                    "author": "captainIsBack4u",
                    "id": "ehv6a7t",
                    "parent_id": "t1_ehv579x",
                    "score": 17,
                    "created_utc": 1551817629.0,
                    "replies": [
                        {
                            "body": ">I wear that experience proudly.\n\nyou have to learn to laugh at yourself. Mine took the PPM, then we went to dinner,. She snuck out after the appetizer using the old \"powder room scam\" The best part was 45 minutes later when the guy sitting at the next table , leaned over and whispered \"I don't think she's coming back\"  LOL\n\nMeanest little size 00, I ever met.",
                            "author": "TooOldForSD",
                            "id": "ehvqmv0",
                            "parent_id": "t1_ehv6a7t",
                            "score": 11,
                            "created_utc": 1551831760.0,
                            "replies": [
                                {
                                    "body": "So what do you do now when a girl asks for her ppm before the fun,  because that is standard advice here?\n\n&#x200B;",
                                    "author": null,
                                    "id": "ehwapsy",
                                    "parent_id": "t1_ehvqmv0",
                                    "score": 4,
                                    "created_utc": 1551847760.0,
                                    "replies": [
                                        {
                                            "body": "Standard advice is NOT to give the money before you're alone together while still in public. That's a rookie error. It is to give it once you're both behind closed doors.",
                                            "author": "yourgirlfriday99",
                                            "id": "ehwroft",
                                            "parent_id": "t1_ehwapsy",
                                            "score": 4,
                                            "created_utc": 1551872275.0,
                                            "replies": [
                                                {
                                                    "body": "[deleted]",
                                                    "author": null,
                                                    "id": "ehxn5h4",
                                                    "parent_id": "t1_ehwroft",
                                                    "score": 3,
                                                    "created_utc": 1551897315.0,
                                                    "replies": [
                                                        {
                                                            "body": "I'm a SB... I was correcting the user on what the actual standard advice here is.",
                                                            "author": "yourgirlfriday99",
                                                            "id": "ehxn72z",
                                                            "parent_id": "t1_ehxn5h4",
                                                            "score": 2,
                                                            "created_utc": 1551897345.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "body": ">before you're alone together \n\n we met in a hotel room before dinner.  I suggested a naughty interlude before we went. When she agreed  and approached me, I figured, OK she's here for real,  so at my suggestion, we skipped it until later. That's when I gave her the sugar to have her feel at ease.  We also had tickets to a show  later, leaving little time for dinner, if we had too much  playtime first we'd be too hurried.  It was a \"high sugar\" overnight date. Not the way to start I guess. \n\nA few months later, I did sugar incrementally but made a hide and seek game of it. Arrival, at dinner, back in the room. that worked out much better. We had  discussed mutual protection against scams a head of time  and both had been victims. ",
                                                    "author": "TooOldForSD",
                                                    "id": "ehx4smt",
                                                    "parent_id": "t1_ehwroft",
                                                    "score": 2,
                                                    "created_utc": 1551884923.0,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "body": "I never give PPM before the fun. If we're both undressed and in the room, sure..but if we're having lunch or being casual and don't have any trust built (haven't been together several times) you're not getting anything from me upfront. ",
                                            "author": "SugarPieHunnieBunch",
                                            "id": "ehwd6vn",
                                            "parent_id": "t1_ehwapsy",
                                            "score": -1,
                                            "created_utc": 1551850255.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "The guy was pretty nice though.. ;D",
                                    "author": null,
                                    "id": "ehws5s9",
                                    "parent_id": "t1_ehvqmv0",
                                    "score": 1,
                                    "created_utc": 1551872959.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Then how do so many people enter the bowl and never get scammed like that? There is also a difference between advice from random internet strangers and having a friend introduce you to something and offer to help you stay safe.\n\nEven when people here get scammed after ignoring all standard advice you see most people offer sympathy not laughs and that is for strangers.",
                            "author": "sexviewer",
                            "id": "ehv8icp",
                            "parent_id": "t1_ehv6a7t",
                            "score": 3,
                            "created_utc": 1551819078.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "ehvcmx4",
                                    "parent_id": "t1_ehv8icp",
                                    "score": 3,
                                    "created_utc": 1551821731.0,
                                    "replies": [
                                        {
                                            "body": "My main point is the guy has a friend helping him stay safe. While the friend can't be there to handle every situation, I'd say covering things like this is the most important thing to go over when telling a guy how to stay safe. He apparently did a pretty shitty job of preparing the guy and is now laughing at him.",
                                            "author": "sexviewer",
                                            "id": "ehvd0z3",
                                            "parent_id": "t1_ehvcmx4",
                                            "score": 1,
                                            "created_utc": 1551821984.0,
                                            "replies": [
                                                {
                                                    "body": "My friend and moi are both laughing. But if you need to win this argument, you win!",
                                                    "author": "captainIsBack4u",
                                                    "id": "ehvdruy",
                                                    "parent_id": "t1_ehvd0z3",
                                                    "score": 3,
                                                    "created_utc": 1551822458.0,
                                                    "replies": [
                                                        {
                                                            "body": "I didn't realize there was a winner or loser when discussing random shit on reddit. But way to try to imply I want or care about something I don't. ",
                                                            "author": "sexviewer",
                                                            "id": "ehvf3ld",
                                                            "parent_id": "t1_ehvdruy",
                                                            "score": -3,
                                                            "created_utc": 1551823292.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Well.. you are busting my balls for something both me and my friend found funny. I dont know what else to tell you. Shit happens. You laugh it off and move on. Sometimes its a good joke. We cant share this IRL, so here we are!",
                                                                    "author": "captainIsBack4u",
                                                                    "id": "ehvfmt2",
                                                                    "parent_id": "t1_ehvf3ld",
                                                                    "score": 6,
                                                                    "created_utc": 1551823643.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "So what do you do now when a girl asks for her ppm before the fun,  because that is standard advice here?",
                            "author": null,
                            "id": "ehwapaa",
                            "parent_id": "t1_ehv6a7t",
                            "score": 1,
                            "created_utc": 1551847747.0,
                            "replies": [
                                {
                                    "body": "You pay before fun bc that is standard but make sure you’re both in the room & not a parking lot or restaurant lol. ",
                                    "author": "BStonedxoxo",
                                    "id": "ehwe0od",
                                    "parent_id": "t1_ehwapaa",
                                    "score": 5,
                                    "created_utc": 1551851134.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "ehw2gqr",
            "parent_id": "t1_ehvjyad",
            "score": 0,
            "created_utc": 1551840895.0,
            "replies": [
                {
                    "body": "Almost the same thing happened to me, except the SB walked away with my refrigerator. There were a lot of gourmet meals in there too. Well she came from a poor family so I don't blame her.",
                    "author": "highfructoseSD",
                    "id": "ehzh377",
                    "parent_id": "t1_ehw2gqr",
                    "score": 2,
                    "created_utc": 1551954091.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "If this is robbed, an SB not being paid is raped.  Either is probably a stretch.  Definitely a dick move and unscrupulous either way.  ",
            "author": "CentralUSGal",
            "id": "ehvguok",
            "parent_id": "t1_ehvd1mt",
            "score": 13,
            "created_utc": 1551824459.0,
            "replies": [
                {
                    "body": "Very nice analogy!",
                    "author": "captainIsBack4u",
                    "id": "ehx1wh3",
                    "parent_id": "t1_ehvguok",
                    "score": 1,
                    "created_utc": 1551882718.0,
                    "replies": []
                },
                {
                    "body": "I think you mean regret...when you throw in \"rape\" so casually AFTER consent has taken place..you are committing a crime. ",
                    "author": "SugarPieHunnieBunch",
                    "id": "ehwd0u6",
                    "parent_id": "t1_ehvguok",
                    "score": -4,
                    "created_utc": 1551850077.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "i don't buy this story.  Filing it under Creative Writing.",
            "author": "lcsugar",
            "id": "ehvg8na",
            "parent_id": "t1_ehvd2k2",
            "score": 4,
            "created_utc": 1551824048.0,
            "replies": [
                {
                    "body": ">i don't buy this story.  Filing it under Creative Writing\n\nLmao",
                    "author": "pintodinosaur",
                    "id": "ehxlw6y",
                    "parent_id": "t1_ehvg8na",
                    "score": 1,
                    "created_utc": 1551896479.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Say that you would give it to her just before getting intimate - once you are alone and in the bedroom. Show her the envelope to reassure her. ",
            "author": "Dean_46",
            "id": "ehz3nj6",
            "parent_id": "t1_ehwaw3k",
            "score": 1,
            "created_utc": 1551935388.0,
            "replies": []
        },
        {
            "body": "How did he get back to his car, could be some transportation costs also?",
            "author": "rogerthatonce",
            "id": "ehvvs27",
            "parent_id": "t1_ehvetmo",
            "score": 1,
            "created_utc": 1551835829.0,
            "replies": [
                {
                    "body": "Tells me he walked back 3 miles or so. Weather was good, he had some time to kill and ponder over the meaning of life ;)",
                    "author": "captainIsBack4u",
                    "id": "ehx3f1b",
                    "parent_id": "t1_ehvvs27",
                    "score": 1,
                    "created_utc": 1551883893.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Betas gonna beta\n\nCant fix these beta males. Its genetic I think.",
            "author": "alphadawg26",
            "id": "ehv45ig",
            "parent_id": "t1_ehv400b",
            "score": -15,
            "created_utc": 1551816226.0,
            "replies": [
                {
                    "body": "Ironically, the only people I ever hear talk about alpha and beta males fit the definition they use for beta perfectly. See: the red pill",
                    "author": "sexviewer",
                    "id": "ehv5dh6",
                    "parent_id": "t1_ehv45ig",
                    "score": 18,
                    "created_utc": 1551817050.0,
                    "replies": [
                        {
                            "body": "LOL cool story bro\n\n&#x200B;\n\nI truly dont think you can fix these betas because they are born suckers.   \n\n&#x200B;\n\n&#x200B;",
                            "author": "alphadawg26",
                            "id": "ehvkabo",
                            "parent_id": "t1_ehv5dh6",
                            "score": -5,
                            "created_utc": 1551826896.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Shoot. Taken for $500.50!",
            "author": "HipsterHighwayman",
            "id": "ehvau2p",
            "parent_id": "t1_ehv9lpy",
            "score": 17,
            "created_utc": 1551820629.0,
            "replies": [
                {
                    "body": "It was a cheap lesson that never left ",
                    "author": "pinotandsugar",
                    "id": "ehvn3mt",
                    "parent_id": "t1_ehvau2p",
                    "score": 3,
                    "created_utc": 1551828995.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "> she had forgotten the parking meter, did I have a couple of quarters\n\n:). you have to be a man to accept it.\n\n",
            "author": "captainIsBack4u",
            "id": "ehvag8l",
            "parent_id": "t1_ehv9lpy",
            "score": 3,
            "created_utc": 1551820372.0,
            "replies": []
        },
        {
            "body": "Damn... who would know a Person in Sugaring business could have such low professional ethics.",
            "author": null,
            "id": "ehws496",
            "parent_id": "t1_ehv9lpy",
            "score": 2,
            "created_utc": 1551872897.0,
            "replies": []
        },
        {
            "body": "I humbly disagree. You do. No matter how much advice one is given, some things are learnt the hard way. After all the advice I got here from some very good people, I handed my first SB $1500 next day. And she ghosted instantaneously. I was told exactly that. I wear that experience proudly. ",
            "author": "captainIsBack4u",
            "id": "ehv6a7t",
            "parent_id": "t1_ehv579x",
            "score": 17,
            "created_utc": 1551817629.0,
            "replies": [
                {
                    "body": ">I wear that experience proudly.\n\nyou have to learn to laugh at yourself. Mine took the PPM, then we went to dinner,. She snuck out after the appetizer using the old \"powder room scam\" The best part was 45 minutes later when the guy sitting at the next table , leaned over and whispered \"I don't think she's coming back\"  LOL\n\nMeanest little size 00, I ever met.",
                    "author": "TooOldForSD",
                    "id": "ehvqmv0",
                    "parent_id": "t1_ehv6a7t",
                    "score": 11,
                    "created_utc": 1551831760.0,
                    "replies": [
                        {
                            "body": "So what do you do now when a girl asks for her ppm before the fun,  because that is standard advice here?\n\n&#x200B;",
                            "author": null,
                            "id": "ehwapsy",
                            "parent_id": "t1_ehvqmv0",
                            "score": 4,
                            "created_utc": 1551847760.0,
                            "replies": [
                                {
                                    "body": "Standard advice is NOT to give the money before you're alone together while still in public. That's a rookie error. It is to give it once you're both behind closed doors.",
                                    "author": "yourgirlfriday99",
                                    "id": "ehwroft",
                                    "parent_id": "t1_ehwapsy",
                                    "score": 4,
                                    "created_utc": 1551872275.0,
                                    "replies": [
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "ehxn5h4",
                                            "parent_id": "t1_ehwroft",
                                            "score": 3,
                                            "created_utc": 1551897315.0,
                                            "replies": [
                                                {
                                                    "body": "I'm a SB... I was correcting the user on what the actual standard advice here is.",
                                                    "author": "yourgirlfriday99",
                                                    "id": "ehxn72z",
                                                    "parent_id": "t1_ehxn5h4",
                                                    "score": 2,
                                                    "created_utc": 1551897345.0,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "body": ">before you're alone together \n\n we met in a hotel room before dinner.  I suggested a naughty interlude before we went. When she agreed  and approached me, I figured, OK she's here for real,  so at my suggestion, we skipped it until later. That's when I gave her the sugar to have her feel at ease.  We also had tickets to a show  later, leaving little time for dinner, if we had too much  playtime first we'd be too hurried.  It was a \"high sugar\" overnight date. Not the way to start I guess. \n\nA few months later, I did sugar incrementally but made a hide and seek game of it. Arrival, at dinner, back in the room. that worked out much better. We had  discussed mutual protection against scams a head of time  and both had been victims. ",
                                            "author": "TooOldForSD",
                                            "id": "ehx4smt",
                                            "parent_id": "t1_ehwroft",
                                            "score": 2,
                                            "created_utc": 1551884923.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "I never give PPM before the fun. If we're both undressed and in the room, sure..but if we're having lunch or being casual and don't have any trust built (haven't been together several times) you're not getting anything from me upfront. ",
                                    "author": "SugarPieHunnieBunch",
                                    "id": "ehwd6vn",
                                    "parent_id": "t1_ehwapsy",
                                    "score": -1,
                                    "created_utc": 1551850255.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "The guy was pretty nice though.. ;D",
                            "author": null,
                            "id": "ehws5s9",
                            "parent_id": "t1_ehvqmv0",
                            "score": 1,
                            "created_utc": 1551872959.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Then how do so many people enter the bowl and never get scammed like that? There is also a difference between advice from random internet strangers and having a friend introduce you to something and offer to help you stay safe.\n\nEven when people here get scammed after ignoring all standard advice you see most people offer sympathy not laughs and that is for strangers.",
                    "author": "sexviewer",
                    "id": "ehv8icp",
                    "parent_id": "t1_ehv6a7t",
                    "score": 3,
                    "created_utc": 1551819078.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "ehvcmx4",
                            "parent_id": "t1_ehv8icp",
                            "score": 3,
                            "created_utc": 1551821731.0,
                            "replies": [
                                {
                                    "body": "My main point is the guy has a friend helping him stay safe. While the friend can't be there to handle every situation, I'd say covering things like this is the most important thing to go over when telling a guy how to stay safe. He apparently did a pretty shitty job of preparing the guy and is now laughing at him.",
                                    "author": "sexviewer",
                                    "id": "ehvd0z3",
                                    "parent_id": "t1_ehvcmx4",
                                    "score": 1,
                                    "created_utc": 1551821984.0,
                                    "replies": [
                                        {
                                            "body": "My friend and moi are both laughing. But if you need to win this argument, you win!",
                                            "author": "captainIsBack4u",
                                            "id": "ehvdruy",
                                            "parent_id": "t1_ehvd0z3",
                                            "score": 3,
                                            "created_utc": 1551822458.0,
                                            "replies": [
                                                {
                                                    "body": "I didn't realize there was a winner or loser when discussing random shit on reddit. But way to try to imply I want or care about something I don't. ",
                                                    "author": "sexviewer",
                                                    "id": "ehvf3ld",
                                                    "parent_id": "t1_ehvdruy",
                                                    "score": -3,
                                                    "created_utc": 1551823292.0,
                                                    "replies": [
                                                        {
                                                            "body": "Well.. you are busting my balls for something both me and my friend found funny. I dont know what else to tell you. Shit happens. You laugh it off and move on. Sometimes its a good joke. We cant share this IRL, so here we are!",
                                                            "author": "captainIsBack4u",
                                                            "id": "ehvfmt2",
                                                            "parent_id": "t1_ehvf3ld",
                                                            "score": 6,
                                                            "created_utc": 1551823643.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "So what do you do now when a girl asks for her ppm before the fun,  because that is standard advice here?",
                    "author": null,
                    "id": "ehwapaa",
                    "parent_id": "t1_ehv6a7t",
                    "score": 1,
                    "created_utc": 1551847747.0,
                    "replies": [
                        {
                            "body": "You pay before fun bc that is standard but make sure you’re both in the room & not a parking lot or restaurant lol. ",
                            "author": "BStonedxoxo",
                            "id": "ehwe0od",
                            "parent_id": "t1_ehwapaa",
                            "score": 5,
                            "created_utc": 1551851134.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Almost the same thing happened to me, except the SB walked away with my refrigerator. There were a lot of gourmet meals in there too. Well she came from a poor family so I don't blame her.",
            "author": "highfructoseSD",
            "id": "ehzh377",
            "parent_id": "t1_ehw2gqr",
            "score": 2,
            "created_utc": 1551954091.0,
            "replies": []
        },
        {
            "body": "Very nice analogy!",
            "author": "captainIsBack4u",
            "id": "ehx1wh3",
            "parent_id": "t1_ehvguok",
            "score": 1,
            "created_utc": 1551882718.0,
            "replies": []
        },
        {
            "body": "I think you mean regret...when you throw in \"rape\" so casually AFTER consent has taken place..you are committing a crime. ",
            "author": "SugarPieHunnieBunch",
            "id": "ehwd0u6",
            "parent_id": "t1_ehvguok",
            "score": -4,
            "created_utc": 1551850077.0,
            "replies": []
        },
        {
            "body": ">i don't buy this story.  Filing it under Creative Writing\n\nLmao",
            "author": "pintodinosaur",
            "id": "ehxlw6y",
            "parent_id": "t1_ehvg8na",
            "score": 1,
            "created_utc": 1551896479.0,
            "replies": []
        },
        {
            "body": "Tells me he walked back 3 miles or so. Weather was good, he had some time to kill and ponder over the meaning of life ;)",
            "author": "captainIsBack4u",
            "id": "ehx3f1b",
            "parent_id": "t1_ehvvs27",
            "score": 1,
            "created_utc": 1551883893.0,
            "replies": []
        },
        {
            "body": "Ironically, the only people I ever hear talk about alpha and beta males fit the definition they use for beta perfectly. See: the red pill",
            "author": "sexviewer",
            "id": "ehv5dh6",
            "parent_id": "t1_ehv45ig",
            "score": 18,
            "created_utc": 1551817050.0,
            "replies": [
                {
                    "body": "LOL cool story bro\n\n&#x200B;\n\nI truly dont think you can fix these betas because they are born suckers.   \n\n&#x200B;\n\n&#x200B;",
                    "author": "alphadawg26",
                    "id": "ehvkabo",
                    "parent_id": "t1_ehv5dh6",
                    "score": -5,
                    "created_utc": 1551826896.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "It was a cheap lesson that never left ",
            "author": "pinotandsugar",
            "id": "ehvn3mt",
            "parent_id": "t1_ehvau2p",
            "score": 3,
            "created_utc": 1551828995.0,
            "replies": []
        },
        {
            "body": ">I wear that experience proudly.\n\nyou have to learn to laugh at yourself. Mine took the PPM, then we went to dinner,. She snuck out after the appetizer using the old \"powder room scam\" The best part was 45 minutes later when the guy sitting at the next table , leaned over and whispered \"I don't think she's coming back\"  LOL\n\nMeanest little size 00, I ever met.",
            "author": "TooOldForSD",
            "id": "ehvqmv0",
            "parent_id": "t1_ehv6a7t",
            "score": 11,
            "created_utc": 1551831760.0,
            "replies": [
                {
                    "body": "So what do you do now when a girl asks for her ppm before the fun,  because that is standard advice here?\n\n&#x200B;",
                    "author": null,
                    "id": "ehwapsy",
                    "parent_id": "t1_ehvqmv0",
                    "score": 4,
                    "created_utc": 1551847760.0,
                    "replies": [
                        {
                            "body": "Standard advice is NOT to give the money before you're alone together while still in public. That's a rookie error. It is to give it once you're both behind closed doors.",
                            "author": "yourgirlfriday99",
                            "id": "ehwroft",
                            "parent_id": "t1_ehwapsy",
                            "score": 4,
                            "created_utc": 1551872275.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "ehxn5h4",
                                    "parent_id": "t1_ehwroft",
                                    "score": 3,
                                    "created_utc": 1551897315.0,
                                    "replies": [
                                        {
                                            "body": "I'm a SB... I was correcting the user on what the actual standard advice here is.",
                                            "author": "yourgirlfriday99",
                                            "id": "ehxn72z",
                                            "parent_id": "t1_ehxn5h4",
                                            "score": 2,
                                            "created_utc": 1551897345.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": ">before you're alone together \n\n we met in a hotel room before dinner.  I suggested a naughty interlude before we went. When she agreed  and approached me, I figured, OK she's here for real,  so at my suggestion, we skipped it until later. That's when I gave her the sugar to have her feel at ease.  We also had tickets to a show  later, leaving little time for dinner, if we had too much  playtime first we'd be too hurried.  It was a \"high sugar\" overnight date. Not the way to start I guess. \n\nA few months later, I did sugar incrementally but made a hide and seek game of it. Arrival, at dinner, back in the room. that worked out much better. We had  discussed mutual protection against scams a head of time  and both had been victims. ",
                                    "author": "TooOldForSD",
                                    "id": "ehx4smt",
                                    "parent_id": "t1_ehwroft",
                                    "score": 2,
                                    "created_utc": 1551884923.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "I never give PPM before the fun. If we're both undressed and in the room, sure..but if we're having lunch or being casual and don't have any trust built (haven't been together several times) you're not getting anything from me upfront. ",
                            "author": "SugarPieHunnieBunch",
                            "id": "ehwd6vn",
                            "parent_id": "t1_ehwapsy",
                            "score": -1,
                            "created_utc": 1551850255.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "The guy was pretty nice though.. ;D",
                    "author": null,
                    "id": "ehws5s9",
                    "parent_id": "t1_ehvqmv0",
                    "score": 1,
                    "created_utc": 1551872959.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Then how do so many people enter the bowl and never get scammed like that? There is also a difference between advice from random internet strangers and having a friend introduce you to something and offer to help you stay safe.\n\nEven when people here get scammed after ignoring all standard advice you see most people offer sympathy not laughs and that is for strangers.",
            "author": "sexviewer",
            "id": "ehv8icp",
            "parent_id": "t1_ehv6a7t",
            "score": 3,
            "created_utc": 1551819078.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "ehvcmx4",
                    "parent_id": "t1_ehv8icp",
                    "score": 3,
                    "created_utc": 1551821731.0,
                    "replies": [
                        {
                            "body": "My main point is the guy has a friend helping him stay safe. While the friend can't be there to handle every situation, I'd say covering things like this is the most important thing to go over when telling a guy how to stay safe. He apparently did a pretty shitty job of preparing the guy and is now laughing at him.",
                            "author": "sexviewer",
                            "id": "ehvd0z3",
                            "parent_id": "t1_ehvcmx4",
                            "score": 1,
                            "created_utc": 1551821984.0,
                            "replies": [
                                {
                                    "body": "My friend and moi are both laughing. But if you need to win this argument, you win!",
                                    "author": "captainIsBack4u",
                                    "id": "ehvdruy",
                                    "parent_id": "t1_ehvd0z3",
                                    "score": 3,
                                    "created_utc": 1551822458.0,
                                    "replies": [
                                        {
                                            "body": "I didn't realize there was a winner or loser when discussing random shit on reddit. But way to try to imply I want or care about something I don't. ",
                                            "author": "sexviewer",
                                            "id": "ehvf3ld",
                                            "parent_id": "t1_ehvdruy",
                                            "score": -3,
                                            "created_utc": 1551823292.0,
                                            "replies": [
                                                {
                                                    "body": "Well.. you are busting my balls for something both me and my friend found funny. I dont know what else to tell you. Shit happens. You laugh it off and move on. Sometimes its a good joke. We cant share this IRL, so here we are!",
                                                    "author": "captainIsBack4u",
                                                    "id": "ehvfmt2",
                                                    "parent_id": "t1_ehvf3ld",
                                                    "score": 6,
                                                    "created_utc": 1551823643.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "So what do you do now when a girl asks for her ppm before the fun,  because that is standard advice here?",
            "author": null,
            "id": "ehwapaa",
            "parent_id": "t1_ehv6a7t",
            "score": 1,
            "created_utc": 1551847747.0,
            "replies": [
                {
                    "body": "You pay before fun bc that is standard but make sure you’re both in the room & not a parking lot or restaurant lol. ",
                    "author": "BStonedxoxo",
                    "id": "ehwe0od",
                    "parent_id": "t1_ehwapaa",
                    "score": 5,
                    "created_utc": 1551851134.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "LOL cool story bro\n\n&#x200B;\n\nI truly dont think you can fix these betas because they are born suckers.   \n\n&#x200B;\n\n&#x200B;",
            "author": "alphadawg26",
            "id": "ehvkabo",
            "parent_id": "t1_ehv5dh6",
            "score": -5,
            "created_utc": 1551826896.0,
            "replies": []
        },
        {
            "body": "So what do you do now when a girl asks for her ppm before the fun,  because that is standard advice here?\n\n&#x200B;",
            "author": null,
            "id": "ehwapsy",
            "parent_id": "t1_ehvqmv0",
            "score": 4,
            "created_utc": 1551847760.0,
            "replies": [
                {
                    "body": "Standard advice is NOT to give the money before you're alone together while still in public. That's a rookie error. It is to give it once you're both behind closed doors.",
                    "author": "yourgirlfriday99",
                    "id": "ehwroft",
                    "parent_id": "t1_ehwapsy",
                    "score": 4,
                    "created_utc": 1551872275.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "ehxn5h4",
                            "parent_id": "t1_ehwroft",
                            "score": 3,
                            "created_utc": 1551897315.0,
                            "replies": [
                                {
                                    "body": "I'm a SB... I was correcting the user on what the actual standard advice here is.",
                                    "author": "yourgirlfriday99",
                                    "id": "ehxn72z",
                                    "parent_id": "t1_ehxn5h4",
                                    "score": 2,
                                    "created_utc": 1551897345.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": ">before you're alone together \n\n we met in a hotel room before dinner.  I suggested a naughty interlude before we went. When she agreed  and approached me, I figured, OK she's here for real,  so at my suggestion, we skipped it until later. That's when I gave her the sugar to have her feel at ease.  We also had tickets to a show  later, leaving little time for dinner, if we had too much  playtime first we'd be too hurried.  It was a \"high sugar\" overnight date. Not the way to start I guess. \n\nA few months later, I did sugar incrementally but made a hide and seek game of it. Arrival, at dinner, back in the room. that worked out much better. We had  discussed mutual protection against scams a head of time  and both had been victims. ",
                            "author": "TooOldForSD",
                            "id": "ehx4smt",
                            "parent_id": "t1_ehwroft",
                            "score": 2,
                            "created_utc": 1551884923.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "I never give PPM before the fun. If we're both undressed and in the room, sure..but if we're having lunch or being casual and don't have any trust built (haven't been together several times) you're not getting anything from me upfront. ",
                    "author": "SugarPieHunnieBunch",
                    "id": "ehwd6vn",
                    "parent_id": "t1_ehwapsy",
                    "score": -1,
                    "created_utc": 1551850255.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "The guy was pretty nice though.. ;D",
            "author": null,
            "id": "ehws5s9",
            "parent_id": "t1_ehvqmv0",
            "score": 1,
            "created_utc": 1551872959.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "ehvcmx4",
            "parent_id": "t1_ehv8icp",
            "score": 3,
            "created_utc": 1551821731.0,
            "replies": [
                {
                    "body": "My main point is the guy has a friend helping him stay safe. While the friend can't be there to handle every situation, I'd say covering things like this is the most important thing to go over when telling a guy how to stay safe. He apparently did a pretty shitty job of preparing the guy and is now laughing at him.",
                    "author": "sexviewer",
                    "id": "ehvd0z3",
                    "parent_id": "t1_ehvcmx4",
                    "score": 1,
                    "created_utc": 1551821984.0,
                    "replies": [
                        {
                            "body": "My friend and moi are both laughing. But if you need to win this argument, you win!",
                            "author": "captainIsBack4u",
                            "id": "ehvdruy",
                            "parent_id": "t1_ehvd0z3",
                            "score": 3,
                            "created_utc": 1551822458.0,
                            "replies": [
                                {
                                    "body": "I didn't realize there was a winner or loser when discussing random shit on reddit. But way to try to imply I want or care about something I don't. ",
                                    "author": "sexviewer",
                                    "id": "ehvf3ld",
                                    "parent_id": "t1_ehvdruy",
                                    "score": -3,
                                    "created_utc": 1551823292.0,
                                    "replies": [
                                        {
                                            "body": "Well.. you are busting my balls for something both me and my friend found funny. I dont know what else to tell you. Shit happens. You laugh it off and move on. Sometimes its a good joke. We cant share this IRL, so here we are!",
                                            "author": "captainIsBack4u",
                                            "id": "ehvfmt2",
                                            "parent_id": "t1_ehvf3ld",
                                            "score": 6,
                                            "created_utc": 1551823643.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "You pay before fun bc that is standard but make sure you’re both in the room & not a parking lot or restaurant lol. ",
            "author": "BStonedxoxo",
            "id": "ehwe0od",
            "parent_id": "t1_ehwapaa",
            "score": 5,
            "created_utc": 1551851134.0,
            "replies": []
        },
        {
            "body": "Standard advice is NOT to give the money before you're alone together while still in public. That's a rookie error. It is to give it once you're both behind closed doors.",
            "author": "yourgirlfriday99",
            "id": "ehwroft",
            "parent_id": "t1_ehwapsy",
            "score": 4,
            "created_utc": 1551872275.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "ehxn5h4",
                    "parent_id": "t1_ehwroft",
                    "score": 3,
                    "created_utc": 1551897315.0,
                    "replies": [
                        {
                            "body": "I'm a SB... I was correcting the user on what the actual standard advice here is.",
                            "author": "yourgirlfriday99",
                            "id": "ehxn72z",
                            "parent_id": "t1_ehxn5h4",
                            "score": 2,
                            "created_utc": 1551897345.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": ">before you're alone together \n\n we met in a hotel room before dinner.  I suggested a naughty interlude before we went. When she agreed  and approached me, I figured, OK she's here for real,  so at my suggestion, we skipped it until later. That's when I gave her the sugar to have her feel at ease.  We also had tickets to a show  later, leaving little time for dinner, if we had too much  playtime first we'd be too hurried.  It was a \"high sugar\" overnight date. Not the way to start I guess. \n\nA few months later, I did sugar incrementally but made a hide and seek game of it. Arrival, at dinner, back in the room. that worked out much better. We had  discussed mutual protection against scams a head of time  and both had been victims. ",
                    "author": "TooOldForSD",
                    "id": "ehx4smt",
                    "parent_id": "t1_ehwroft",
                    "score": 2,
                    "created_utc": 1551884923.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I never give PPM before the fun. If we're both undressed and in the room, sure..but if we're having lunch or being casual and don't have any trust built (haven't been together several times) you're not getting anything from me upfront. ",
            "author": "SugarPieHunnieBunch",
            "id": "ehwd6vn",
            "parent_id": "t1_ehwapsy",
            "score": -1,
            "created_utc": 1551850255.0,
            "replies": []
        },
        {
            "body": "My main point is the guy has a friend helping him stay safe. While the friend can't be there to handle every situation, I'd say covering things like this is the most important thing to go over when telling a guy how to stay safe. He apparently did a pretty shitty job of preparing the guy and is now laughing at him.",
            "author": "sexviewer",
            "id": "ehvd0z3",
            "parent_id": "t1_ehvcmx4",
            "score": 1,
            "created_utc": 1551821984.0,
            "replies": [
                {
                    "body": "My friend and moi are both laughing. But if you need to win this argument, you win!",
                    "author": "captainIsBack4u",
                    "id": "ehvdruy",
                    "parent_id": "t1_ehvd0z3",
                    "score": 3,
                    "created_utc": 1551822458.0,
                    "replies": [
                        {
                            "body": "I didn't realize there was a winner or loser when discussing random shit on reddit. But way to try to imply I want or care about something I don't. ",
                            "author": "sexviewer",
                            "id": "ehvf3ld",
                            "parent_id": "t1_ehvdruy",
                            "score": -3,
                            "created_utc": 1551823292.0,
                            "replies": [
                                {
                                    "body": "Well.. you are busting my balls for something both me and my friend found funny. I dont know what else to tell you. Shit happens. You laugh it off and move on. Sometimes its a good joke. We cant share this IRL, so here we are!",
                                    "author": "captainIsBack4u",
                                    "id": "ehvfmt2",
                                    "parent_id": "t1_ehvf3ld",
                                    "score": 6,
                                    "created_utc": 1551823643.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "ehxn5h4",
            "parent_id": "t1_ehwroft",
            "score": 3,
            "created_utc": 1551897315.0,
            "replies": [
                {
                    "body": "I'm a SB... I was correcting the user on what the actual standard advice here is.",
                    "author": "yourgirlfriday99",
                    "id": "ehxn72z",
                    "parent_id": "t1_ehxn5h4",
                    "score": 2,
                    "created_utc": 1551897345.0,
                    "replies": []
                }
            ]
        },
        {
            "body": ">before you're alone together \n\n we met in a hotel room before dinner.  I suggested a naughty interlude before we went. When she agreed  and approached me, I figured, OK she's here for real,  so at my suggestion, we skipped it until later. That's when I gave her the sugar to have her feel at ease.  We also had tickets to a show  later, leaving little time for dinner, if we had too much  playtime first we'd be too hurried.  It was a \"high sugar\" overnight date. Not the way to start I guess. \n\nA few months later, I did sugar incrementally but made a hide and seek game of it. Arrival, at dinner, back in the room. that worked out much better. We had  discussed mutual protection against scams a head of time  and both had been victims. ",
            "author": "TooOldForSD",
            "id": "ehx4smt",
            "parent_id": "t1_ehwroft",
            "score": 2,
            "created_utc": 1551884923.0,
            "replies": []
        },
        {
            "body": "My friend and moi are both laughing. But if you need to win this argument, you win!",
            "author": "captainIsBack4u",
            "id": "ehvdruy",
            "parent_id": "t1_ehvd0z3",
            "score": 3,
            "created_utc": 1551822458.0,
            "replies": [
                {
                    "body": "I didn't realize there was a winner or loser when discussing random shit on reddit. But way to try to imply I want or care about something I don't. ",
                    "author": "sexviewer",
                    "id": "ehvf3ld",
                    "parent_id": "t1_ehvdruy",
                    "score": -3,
                    "created_utc": 1551823292.0,
                    "replies": [
                        {
                            "body": "Well.. you are busting my balls for something both me and my friend found funny. I dont know what else to tell you. Shit happens. You laugh it off and move on. Sometimes its a good joke. We cant share this IRL, so here we are!",
                            "author": "captainIsBack4u",
                            "id": "ehvfmt2",
                            "parent_id": "t1_ehvf3ld",
                            "score": 6,
                            "created_utc": 1551823643.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I'm a SB... I was correcting the user on what the actual standard advice here is.",
            "author": "yourgirlfriday99",
            "id": "ehxn72z",
            "parent_id": "t1_ehxn5h4",
            "score": 2,
            "created_utc": 1551897345.0,
            "replies": []
        },
        {
            "body": "I didn't realize there was a winner or loser when discussing random shit on reddit. But way to try to imply I want or care about something I don't. ",
            "author": "sexviewer",
            "id": "ehvf3ld",
            "parent_id": "t1_ehvdruy",
            "score": -3,
            "created_utc": 1551823292.0,
            "replies": [
                {
                    "body": "Well.. you are busting my balls for something both me and my friend found funny. I dont know what else to tell you. Shit happens. You laugh it off and move on. Sometimes its a good joke. We cant share this IRL, so here we are!",
                    "author": "captainIsBack4u",
                    "id": "ehvfmt2",
                    "parent_id": "t1_ehvf3ld",
                    "score": 6,
                    "created_utc": 1551823643.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Well.. you are busting my balls for something both me and my friend found funny. I dont know what else to tell you. Shit happens. You laugh it off and move on. Sometimes its a good joke. We cant share this IRL, so here we are!",
            "author": "captainIsBack4u",
            "id": "ehvfmt2",
            "parent_id": "t1_ehvf3ld",
            "score": 6,
            "created_utc": 1551823643.0,
            "replies": []
        }
    ]
}