{
    "title": "Struck gold",
    "post_id": "l1jb57",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/l1jb57/struck_gold/",
    "author": "ComplexAlternative10",
    "body": "I’m new to the bowl, a little more than 3 months.  First POT SB was a disaster.  We had M&G that went ok, then intimate date after agreeing to a monthly allowance.   She then began pestering for gift after gift, more than 2x allowance.  I quickly moved on.  \n\nStruck gold with 2nd.  We didn’t do M&G cuz CoVid.  First date at my place for full PPM (intimate) or half PPM (platonic), her choice.  She chose intimate and we had a great time.  Second date was planned for intimacy but we talked and talked and ran out of time for intimacy before the driver showed up to take her home.\n\nSince then we’ve been seeing each other 2x week, dates lasting 24-36 hours.  Sometime her little one comes, sometimes he doesn’t.  Every date is a sleepover and we talk or text every day.  She is more SGF than SB, and doesn’t like talking about allowance.  I’ve leased her an apartment and now she’ll be 5 minutes away instead of 45 and we’re having a blast picking out furniture.  Between apartment and spending money, I give her 10x PPM and it’s the best money I’ve ever spent.  \n\nFor me, sugaring was a way to develop real intimacy quickly, not just sex but emotionally. I am 60 SD and she is 27 SB and age is a complete non-issue. We feel like we were made for each other.  It’s been wonderful!",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/l1jb57/struck_gold/",
    "score": 194,
    "upvote_ratio": 0.92,
    "created_utc": 1611178959.0,
    "num_comments": 109,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "She’s bringing her child on dates? Sleepover dates? That is actually quite alarming to me.\n\nThe apartment thing is neither here nor there; it’s a personal decision I’d advise against so soon, but it’s your choice to make. The fact that you already know and have presumably bonded with her child, however, is something I’m having a hard time with. I truly hope it lasts, for the sake of the kid.",
            "author": "FoxyFreckles1989",
            "id": "gk0vivz",
            "parent_id": "t3_l1jb57",
            "score": 44,
            "created_utc": 1611199986.0,
            "replies": [
                {
                    "body": "Agree. This sounds like a honeymoon phase that can steer wrong at any given moment. If this plummets, it will do so fast and will be a disaster seeing how much is invested at this point. \n\nI’m happy for OP but I feel this is a little immature or irresponsible on both parties.",
                    "author": "avanirvana",
                    "id": "gk2e40o",
                    "parent_id": "t1_gk0vivz",
                    "score": 8,
                    "created_utc": 1611241286.0,
                    "replies": []
                },
                {
                    "body": "What a terrible idea. How is this not a red flag from the get go? Bad parenting.",
                    "author": "clair-cummings",
                    "id": "gk2r1b9",
                    "parent_id": "t1_gk0vivz",
                    "score": 8,
                    "created_utc": 1611247320.0,
                    "replies": []
                },
                {
                    "body": "Thank you. I’m sensitive to the issues of having a child involved.  I have a child too.",
                    "author": "ComplexAlternative10",
                    "id": "gk193wy",
                    "parent_id": "t1_gk0vivz",
                    "score": 3,
                    "created_utc": 1611208207.0,
                    "replies": [
                        {
                            "body": "I’m not a fan of bringing kids around new partners in general. I don’t judge; I don’t like it. In this situation, the fact that OP is paying for the apartment etc. and the SB is bringing her child on overnight dates just makes me very uncomfortable. If this ends any time soon, will he still pay the rent until she can do it herself? That is also a child’s home now and he made himself responsible for it. He put her in a position where she’s entirely reliant on him, and so is her kid. I just really hope things continue going well.",
                            "author": "FoxyFreckles1989",
                            "id": "gk1fsrb",
                            "parent_id": "t1_gk193wy",
                            "score": 18,
                            "created_utc": 1611213680.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gjzv47n",
            "parent_id": "t3_l1jb57",
            "score": 48,
            "created_utc": 1611181588.0,
            "replies": [
                {
                    "body": "I think he has already calculated the risk. If it doesn’t work out, he’s stuck with a year of rent. But if it does work out, having her place so close to him and her being comfortable and happy is priceless. So all-in-all, it’s a good move, until things fall apart.\n\nFrom experience, signing a lease early on helps make things work that otherwise might not. \n\nI hope this pans out great!!",
                    "author": "RealisticSD",
                    "id": "gk01eqe",
                    "parent_id": "t1_gjzv47n",
                    "score": 20,
                    "created_utc": 1611184671.0,
                    "replies": [
                        {
                            "body": "A year of rent plus eviction fees from the apartment complex, thousands in damages, a boyfriend moving in and supporting both of them, etc etc lol",
                            "author": "MsDReid",
                            "id": "gk1j86c",
                            "parent_id": "t1_gk01eqe",
                            "score": 3,
                            "created_utc": 1611216893.0,
                            "replies": [
                                {
                                    "body": "Again, all risks that can be solved with money. Just depends on how rich the SD is and how willing he is to gamble",
                                    "author": "RealisticSD",
                                    "id": "gk2mb6c",
                                    "parent_id": "t1_gk1j86c",
                                    "score": 1,
                                    "created_utc": 1611245198.0,
                                    "replies": [
                                        {
                                            "body": "Eh. I know a guy who was sued for sexual harassment because he stopped paying a girls rent because she would no longer have sex with him. It’s really not that simple. Especially since this chick also has a little kid she is bringing to sugar dates and shit.",
                                            "author": "MsDReid",
                                            "id": "gk2qqyq",
                                            "parent_id": "t1_gk2mb6c",
                                            "score": 4,
                                            "created_utc": 1611247194.0,
                                            "replies": [
                                                {
                                                    "body": "What a disaster in the making. I'm honestly astonished people can be this dumb. But I guess I shouldn't be 🤦‍♀️",
                                                    "author": "clair-cummings",
                                                    "id": "gk2rb8h",
                                                    "parent_id": "t1_gk2qqyq",
                                                    "score": 2,
                                                    "created_utc": 1611247440.0,
                                                    "replies": []
                                                },
                                                {
                                                    "body": "As I said, he’d be stuck paying rent for the duration of the lease. I don’t see how she can sue him to renew the lease.",
                                                    "author": "RealisticSD",
                                                    "id": "gk470zi",
                                                    "parent_id": "t1_gk2qqyq",
                                                    "score": 1,
                                                    "created_utc": 1611270906.0,
                                                    "replies": [
                                                        {
                                                            "body": "She cant.\n\nShe can sue him for sexual harassment.",
                                                            "author": "MsDReid",
                                                            "id": "gk4f7by",
                                                            "parent_id": "t1_gk470zi",
                                                            "score": 1,
                                                            "created_utc": 1611275230.0,
                                                            "replies": [
                                                                {
                                                                    "body": "In that situation I’d just cancel the lease the same day the threatens a lawsuit. It costs 4 months of rent; 2 for the 60 days of notice required and 2 for the penalty for breaking a lease. The girl will be evicted in exactly 60 days, lawsuit or not.\n\nIt’s not sexual harassment to harass your girlfriend for sex and break up if she doesn’t sleep with you.\n\nAnyways, I’d afford good lawyers that she never could. Plus, she’s not standing on much ground.",
                                                                    "author": "RealisticSD",
                                                                    "id": "gk4kcce",
                                                                    "parent_id": "t1_gk4f7by",
                                                                    "score": 0,
                                                                    "created_utc": 1611278014.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "Cool.",
                                                                            "author": "MsDReid",
                                                                            "id": "gk4qtt3",
                                                                            "parent_id": "t1_gk4kcce",
                                                                            "score": 3,
                                                                            "created_utc": 1611281509.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "> If it doesn’t work out, he’s stuck with a year of rent. \n\nAssuming the SD is successful a year of rent on an apartment for a great SB  is a far lower risk/lower cost activity than owning an airplane, large boat, divorce, race car, or sexual harassment at work claim.  \n\nBetter yet, a great SB can be a very profitable  productivity  enhancement investment",
                            "author": "pinotandsugar",
                            "id": "gk0yov1",
                            "parent_id": "t1_gk01eqe",
                            "score": 4,
                            "created_utc": 1611201709.0,
                            "replies": []
                        },
                        {
                            "body": "The apartment should solve more problems than it causes. So far, it’s all good.",
                            "author": "ComplexAlternative10",
                            "id": "gk18emx",
                            "parent_id": "t1_gk01eqe",
                            "score": 2,
                            "created_utc": 1611207706.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "I appreciate your words of caution.  In this case, I’m very optimistic it will work out for the best.  If she said we’re done tomorrow, I wouldn’t begrudge her anything or regret anything I’ve done, but I don’t think that will happen, nor do I want it to.   We talk as if both of us expect this to Last years.  The apartment move was hastened because she is in a very untenable living situation",
                    "author": "ComplexAlternative10",
                    "id": "gjzzagd",
                    "parent_id": "t1_gjzv47n",
                    "score": 16,
                    "created_utc": 1611183603.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Please don’t meet sugar babies’/sugar daddies young kids after just 3 months for the kids sake !",
            "author": "Disastrous_Author638",
            "id": "gjzyqyt",
            "parent_id": "t3_l1jb57",
            "score": 40,
            "created_utc": 1611183339.0,
            "replies": [
                {
                    "body": "I agree. In theory. But there are exceptions.. my kids have seen my friends, colleagues, couchsurfers etc. I'm not overly social person, but I really have wide range of contacts and for example a long distance SD I initially told kids is just one couchsurfer more. Limits the caring behaviour, but kids bought it of course and were happily playing board games with him while I was making pancakes to all.",
                    "author": "EstrellaDulce",
                    "id": "gk023k3",
                    "parent_id": "t1_gjzyqyt",
                    "score": 3,
                    "created_utc": 1611185011.0,
                    "replies": [
                        {
                            "body": "I think that’s ok. I am also wary bc a lot of men seek out vulnerable single moms to take advantage of their kids . Yes that’s rare but we gotta watch out !",
                            "author": "Disastrous_Author638",
                            "id": "gk02ldt",
                            "parent_id": "t1_gk023k3",
                            "score": 17,
                            "created_utc": 1611185257.0,
                            "replies": [
                                {
                                    "body": "It’s not that rare. Unfortunately.",
                                    "author": "MsDReid",
                                    "id": "gk1jczl",
                                    "parent_id": "t1_gk02ldt",
                                    "score": 7,
                                    "created_utc": 1611217018.0,
                                    "replies": [
                                        {
                                            "body": "Seconding MsDReid. It's much more common than people might think and ranges from the less insidious to the dangerous.",
                                            "author": "This-Organization-11",
                                            "id": "gk24na6",
                                            "parent_id": "t1_gk1jczl",
                                            "score": 6,
                                            "created_utc": 1611236070.0,
                                            "replies": [
                                                {
                                                    "body": "Yep. Squatting in a for sale home or one he literally has zero ties to. So the whole “he wouldn’t give me HIS address if he was going to hurt me.”\n\nI would be shocked if it was actually his home.",
                                                    "author": "MsDReid",
                                                    "id": "gk2qyvj",
                                                    "parent_id": "t1_gk24na6",
                                                    "score": 2,
                                                    "created_utc": 1611247290.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "That happened sooner than I’d have thought.  Heightened emotion around holiday time plus the living situation accelerated that.  I am careful and accustomed to these situations from vanilla dating.",
                    "author": "ComplexAlternative10",
                    "id": "gk18nl3",
                    "parent_id": "t1_gjzyqyt",
                    "score": 3,
                    "created_utc": 1611207882.0,
                    "replies": []
                },
                {
                    "body": "I’ve twice had SBs bring little ones to m&g. One was 5 weeks old, the other was 2.",
                    "author": "RealisticSD",
                    "id": "gk01gf0",
                    "parent_id": "t1_gjzyqyt",
                    "score": -2,
                    "created_utc": 1611184694.0,
                    "replies": [
                        {
                            "body": "Five weeks?!?!? I don’t know if I should be disgusted or impressed that someone went on a sugar M&G five weeks after giving birth. Damn.",
                            "author": null,
                            "id": "gk01y5l",
                            "parent_id": "t1_gk01gf0",
                            "score": 25,
                            "created_utc": 1611184936.0,
                            "replies": [
                                {
                                    "body": "Movin and shakin right there",
                                    "author": "BillMurraysMom",
                                    "id": "gk191of",
                                    "parent_id": "t1_gk01y5l",
                                    "score": 4,
                                    "created_utc": 1611208161.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "That is gross behavior.  I am a single mom and I get it . It’s hard to juggle childcare but come on . Don’t be so desperate you bring your child to meet a strange man . I don’t think it’s bad if the child is introduced after 6 months or so of serious stable “dating” but you need to understand that a kid doesn’t need to meet a guy after a couple months. Have some discretion",
                            "author": "Disastrous_Author638",
                            "id": "gk02cvo",
                            "parent_id": "t1_gk01gf0",
                            "score": 30,
                            "created_utc": 1611185140.0,
                            "replies": [
                                {
                                    "body": "Yeah no, children should not ever be involved in sugar situations. I have full custody, and would spend whatever I needed to in childcare to make sure my kid wasn’t getting confused by my personal life. 😕",
                                    "author": "SarahBellum404",
                                    "id": "gk0s56f",
                                    "parent_id": "t1_gk02cvo",
                                    "score": 17,
                                    "created_utc": 1611198235.0,
                                    "replies": [
                                        {
                                            "body": "You are a good mom ! It’s so sad to think this we need to tell people this . I give the benefit of the doubt like a guy dropping mom off is just a friend but anythinb more is gross",
                                            "author": "Disastrous_Author638",
                                            "id": "gk15ksr",
                                            "parent_id": "t1_gk0s56f",
                                            "score": 9,
                                            "created_utc": 1611205814.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "That’s disgusting",
                            "author": "MsDReid",
                            "id": "gk1jdu6",
                            "parent_id": "t1_gk01gf0",
                            "score": 7,
                            "created_utc": 1611217040.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "10x PPM, her child coming on your dates, an apartment leased for her in your name and you’ve only known her a couple months. What could go wrong....?",
            "author": "MsDReid",
            "id": "gk1j60u",
            "parent_id": "t3_l1jb57",
            "score": 8,
            "created_utc": 1611216835.0,
            "replies": [
                {
                    "body": "Right? I smell a disaster in the making lol",
                    "author": "clair-cummings",
                    "id": "gk2sjhr",
                    "parent_id": "t1_gk1j60u",
                    "score": 3,
                    "created_utc": 1611247961.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Amazing to think that if your first SB would’ve just not bugged you for gifts, that you were willing to spend  10 x PPM on her. I wish more SB’s realized this. The less you ask for, the more you will receive.",
            "author": "Fun_Focus8159",
            "id": "gjzs6px",
            "parent_id": "t3_l1jb57",
            "score": 26,
            "created_utc": 1611180230.0,
            "replies": [
                {
                    "body": "So from the other perspective - there are plenty of SD’s who will not give more. Daresay, a majority share of SDs. So if a SB is sitting around hoping for that eventual windfall, they gonna be getting bedsores from sitting so long. \n\nThere’s nothing wrong with a SB communicating their desires/needs to their partner. And if their SD/SM can’t or doesn’t want to fulfill those needs - that’s well within their right to do so.",
                    "author": "puppynipples",
                    "id": "gk06adk",
                    "parent_id": "t1_gjzs6px",
                    "score": 36,
                    "created_utc": 1611187132.0,
                    "replies": []
                },
                {
                    "body": "So true!  My SGF does not come from money and has very little.  She wants very little too.  I wanted to take her on a shopping spree for Xmas.  We went to a mall with Nordstrom’s, Saks, and other fine stores.  She couldn’t stomach the prices and asked me to take her to Burlington where she filled up a huge shopping cart with clothes that collectively added to a third of what I’d planned to spend and she was very happy and grateful.",
                    "author": "ComplexAlternative10",
                    "id": "gjzsld5",
                    "parent_id": "t1_gjzs6px",
                    "score": 20,
                    "created_utc": 1611180419.0,
                    "replies": [
                        {
                            "body": "Honestly, I don't blame her. I'm not sure I could take them either...lol!",
                            "author": "ShaArt5",
                            "id": "gk088q3",
                            "parent_id": "t1_gjzsld5",
                            "score": 11,
                            "created_utc": 1611188143.0,
                            "replies": []
                        },
                        {
                            "body": "Thats awesome man. Those are the best SB’s. The ones that would rather go to Marshall’s than Nordstrom’s. The ones that would rather eat at a cheap burger place than a fancy steakhouse. \n\nMy current SB has been asking for very expensive gifts on top of her PPM, and it’s such a turn off. Makes me not want to give her anything lol.",
                            "author": "Fun_Focus8159",
                            "id": "gjztjtz",
                            "parent_id": "t1_gjzsld5",
                            "score": -1,
                            "created_utc": 1611180861.0,
                            "replies": [
                                {
                                    "body": "My last SB (3 1/2 years) was married and made $150k - $200k a year based on her commissions and her husband made six figures too. \n\nShe loved expensive shoes and other stuff. \n\nI met her “in the wild” and all she wanted was gifts.  She’d send me pics of her trying on shit with a simple “yes or no?”\n\nI’d always send her $$$s and she’d wear whatever it was when we saw each other.   \n\nI even paid for her boob job lol. \n\nBut damn did she make an effort. She was a total sex freak and would surprise me in every way & all the time. \n\nThe only SB I ever fell for too.",
                                    "author": "BGDDDY1",
                                    "id": "gk05y72",
                                    "parent_id": "t1_gjztjtz",
                                    "score": 13,
                                    "created_utc": 1611186959.0,
                                    "replies": [
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "gk0kvy8",
                                            "parent_id": "t1_gk05y72",
                                            "score": 6,
                                            "created_utc": 1611194621.0,
                                            "replies": [
                                                {
                                                    "body": "Every single SD & SB are unique and that makes each SR (or vanilla for that matter) unique.  \n\nHaving a firm idea of what your looking for going into it, and being able to communicate it, gives you the best chance of ultimately finding what you’re looking for.",
                                                    "author": "BGDDDY1",
                                                    "id": "gk0ngdf",
                                                    "parent_id": "t1_gk0kvy8",
                                                    "score": 3,
                                                    "created_utc": 1611195923.0,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "body": "High end shoes are my favorite. Louboutins are what I'm known for.",
                                            "author": "clair-cummings",
                                            "id": "gk2ru80",
                                            "parent_id": "t1_gk05y72",
                                            "score": 2,
                                            "created_utc": 1611247666.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "See that’s not bad if all she wanted were gifts. But if she expects PPM + expensive gifts that’s a no no lol.",
                                            "author": "Fun_Focus8159",
                                            "id": "gk08fbg",
                                            "parent_id": "t1_gk05y72",
                                            "score": -3,
                                            "created_utc": 1611188238.0,
                                            "replies": [
                                                {
                                                    "body": "She’s the only one I ever gave regular gifts to. \n\nBeen doing this for over 10 years and the other 5 SBs I’ve had were $$$s only.  \n\nFirst one ever was allowance and the rest were ppm.  I’d give an extra ppm on bdays and around Christmas time.",
                                                    "author": "BGDDDY1",
                                                    "id": "gk0arje",
                                                    "parent_id": "t1_gk08fbg",
                                                    "score": 1,
                                                    "created_utc": 1611189436.0,
                                                    "replies": [
                                                        {
                                                            "body": "Omg were do I find one in  Australia",
                                                            "author": "angeleyes_playful",
                                                            "id": "goga7fr",
                                                            "parent_id": "t1_gk0arje",
                                                            "score": 1,
                                                            "created_utc": 1614081973.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Right my current SB never asks for anything but gets everything.",
                    "author": null,
                    "id": "gjzvgll",
                    "parent_id": "t1_gjzs6px",
                    "score": 8,
                    "created_utc": 1611181752.0,
                    "replies": [
                        {
                            "body": "Those that don’t ask, receive.   My SBs favorite Xmas gift from me was a $20 box of bath bombs.",
                            "author": "ComplexAlternative10",
                            "id": "gk236xm",
                            "parent_id": "t1_gjzvgll",
                            "score": 0,
                            "created_utc": 1611235127.0,
                            "replies": []
                        },
                        {
                            "body": "Where are all the SD in Australia",
                            "author": "angeleyes_playful",
                            "id": "goga94d",
                            "parent_id": "t1_gjzvgll",
                            "score": 1,
                            "created_utc": 1614082007.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "I wish more SBs were like this too bcuz it hurts the ones like me that aren't. I'm passed by sometimes bcuz guys will think I'm like other girls who demand or want, when I like the relationship just as much as the support.",
                    "author": "Ezlynn_Rayne",
                    "id": "gk0aud2",
                    "parent_id": "t1_gjzs6px",
                    "score": 2,
                    "created_utc": 1611189476.0,
                    "replies": []
                },
                {
                    "body": "I can't agree with this more.",
                    "author": "spoilyou255",
                    "id": "gk0clfj",
                    "parent_id": "t1_gjzs6px",
                    "score": 1,
                    "created_utc": 1611190370.0,
                    "replies": []
                },
                {
                    "body": "It's the old story of the young bull and the older bull standing on a hill overlooking a field of cows. Young bull says let's run down there and screw a cow. The older bull says let's walk down and screw them all.",
                    "author": "wildhorses6565",
                    "id": "gk0gp64",
                    "parent_id": "t1_gjzs6px",
                    "score": -1,
                    "created_utc": 1611192488.0,
                    "replies": []
                },
                {
                    "body": "Yes, pestering for money and gifts will feel to the SB like she’s getting a better deal, but all it does is expedite the breakup and make her worse off in the big picture.\n\nGirls who pester for money generally overestimate their own position.",
                    "author": "RealisticSD",
                    "id": "gk01mue",
                    "parent_id": "t1_gjzs6px",
                    "score": -3,
                    "created_utc": 1611184781.0,
                    "replies": [
                        {
                            "body": "There is a way to ask for what one wants... and a way not to.  I would never “pester” my SD for gifts, I would just ask... and if I did, I would hope he would want to give to me.  I would hope that it would make him happy to know that his gift made me happy.  I’ve been involved in several different arrangements, and the ones that were the happiest were the ones in which he was the most generous and I was the most appreciative.  I’ve only had one SD who begrudged me what I wanted, but I later found out he had a personality disorder with narcissistic tendencies, and he had pretty deep emotional wounds of his own.\nMost men who truly care about a woman are happy to find ways to make her happy... remember,  one of the five Love Languages is “Receiving Gifts“, and it is a very valid way of feeling loved, valued, and cared for... and for some women like me, it’s our number one love language... so just because you have to spend some extra money to make a woman happy doesn’t mean she’s trying to take advantage of you. It could mean she just wants to feel loved by you. Trust me, most women who get into arrangements have daddy issues of some sort, and this is one way for you to help her heal them. But if you behave the way her father did, by refusing to show her love in a way that she recognizes, you’re not helping her... you’re actually hurting her, albeit unknowingly.  Oftentimes, when it looks like a SB seems to be asking a lot of you, it’s really because she wants tangible proof that you care about her.  It’s all very emotionally based... and many of us are not even conscious of these issues because they began in our childhood, but affect us into our adulthood.  \nThen again, if a SD is hesitant to buy his SB a gift that would easily make her happy just because he is afraid of being taken advantage of, that could indicate that he has some issues of his own that he needs to address.  The dynamic of older SD, younger SB can be a place to heal wounds... or re-open them. \n\nAnd yes, all of this is the therapist in me talking... sometimes I just can’t help myself. But I hope it helps us all understand this type of situation a little better.",
                            "author": "RealEarthAngel",
                            "id": "gk1ea85",
                            "parent_id": "t1_gk01mue",
                            "score": 9,
                            "created_utc": 1611212322.0,
                            "replies": [
                                {
                                    "body": "Don’t worry you are talking to cheap guys who specifically go after naive women who don’t understand the lifestyle . Most real SD’s love to spoil",
                                    "author": "Disastrous_Author638",
                                    "id": "gk21d6h",
                                    "parent_id": "t1_gk1ea85",
                                    "score": 9,
                                    "created_utc": 1611233878.0,
                                    "replies": [
                                        {
                                            "body": "Exactly.",
                                            "author": "RealEarthAngel",
                                            "id": "gk2jjxe",
                                            "parent_id": "t1_gk21d6h",
                                            "score": 4,
                                            "created_utc": 1611243924.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "This. A lot of cheap men here that call themselves SD's. Not even close 🤦‍♀️",
                                            "author": "clair-cummings",
                                            "id": "gk2s6n1",
                                            "parent_id": "t1_gk21d6h",
                                            "score": 3,
                                            "created_utc": 1611247809.0,
                                            "replies": [
                                                {
                                                    "body": "How can u rag on men for being cheap lol. Talk about entitlement",
                                                    "author": "solatAPI",
                                                    "id": "gnysfhj",
                                                    "parent_id": "t1_gk2s6n1",
                                                    "score": 0,
                                                    "created_utc": 1613704378.0,
                                                    "replies": [
                                                        {
                                                            "body": "Awwww, you're in the wrong group hon. Go back to the little boy hole you climbed out of. Maybe some day you will understand the things adults talk about.",
                                                            "author": "clair-cummings",
                                                            "id": "gnze7wz",
                                                            "parent_id": "t1_gnysfhj",
                                                            "score": 2,
                                                            "created_utc": 1613718422.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "body": "And where in Australia would I find a SD thats genuine",
                                            "author": "angeleyes_playful",
                                            "id": "gogae9t",
                                            "parent_id": "t1_gk21d6h",
                                            "score": 1,
                                            "created_utc": 1614082108.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "This is all so true. Unfortunately there’s a lot of “brat” SB’s who love to ask for things. Not realizing it’s a turn off to the SD.",
                            "author": "Fun_Focus8159",
                            "id": "gk092n9",
                            "parent_id": "t1_gk01mue",
                            "score": -2,
                            "created_utc": 1611188575.0,
                            "replies": []
                        },
                        {
                            "body": "Your last sentence seems to be a universal truth in this lifestyle.  \n\nPestering for $$$s and gifts nixes any chance of a ltr for most of us.",
                            "author": "BGDDDY1",
                            "id": "gk068uf",
                            "parent_id": "t1_gk01mue",
                            "score": -1,
                            "created_utc": 1611187110.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Most SBs don’t understand this.  A lot of SBs are in dire financial situations and adopt fleecing tactics.  For me, it’s the girl next door types that have a job to cover the basics, maybe a roommate - are the most appealing.  Much easier to relate to and invest in for the long-term.",
                    "author": "DaddyFlying",
                    "id": "gk0heqe",
                    "parent_id": "t1_gjzs6px",
                    "score": -1,
                    "created_utc": 1611192854.0,
                    "replies": [
                        {
                            "body": "Same here. Or they live at home with their parents and don’t really need much money since everything is covered already.",
                            "author": "Fun_Focus8159",
                            "id": "gk0hj82",
                            "parent_id": "t1_gk0heqe",
                            "score": -4,
                            "created_utc": 1611192918.0,
                            "replies": [
                                {
                                    "body": "Bc you look for literal teens . If you ever want to date a woman then be prepared to spend more . Women  gain more money and power out of real SD SB dynamic relationship than a young guy bemoaning a present .",
                                    "author": "Disastrous_Author638",
                                    "id": "gk15vzq",
                                    "parent_id": "t1_gk0hj82",
                                    "score": 15,
                                    "created_utc": 1611206013.0,
                                    "replies": [
                                        {
                                            "body": "Yes gorgeous teens :)",
                                            "author": "Fun_Focus8159",
                                            "id": "gk161y7",
                                            "parent_id": "t1_gk15vzq",
                                            "score": -4,
                                            "created_utc": 1611206120.0,
                                            "replies": [
                                                {
                                                    "body": "Your post history explains clearly why you fuck  with teens . Enjoy though 🤣",
                                                    "author": "Disastrous_Author638",
                                                    "id": "gk17fso",
                                                    "parent_id": "t1_gk161y7",
                                                    "score": 8,
                                                    "created_utc": 1611207031.0,
                                                    "replies": [
                                                        {
                                                            "body": "Thanks, I will! :)",
                                                            "author": "Fun_Focus8159",
                                                            "id": "gk17i6f",
                                                            "parent_id": "t1_gk17fso",
                                                            "score": -4,
                                                            "created_utc": 1611207077.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Ok it def looks like you aren’t and having issues . You’re young and have a cocky attitude that doesn’t align with the way you explain you compensate women . You obviously have somewhat limited funds bc money is a big part to you. It’s ok. The older men I have loved have never once thought about how much they give.  They give too much to keep track. You’re a young guy who needs teens to pretend they don’t want the money bc you can’t accept the fact tour on a site dedicated to men who can’t score women for  a burger and an a beer . Cheers my teen lover . After a certain age that is a felony 🤔",
                                                                    "author": "Disastrous_Author638",
                                                                    "id": "gk1861q",
                                                                    "parent_id": "t1_gk17i6f",
                                                                    "score": 10,
                                                                    "created_utc": 1611207537.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "Sounds like you’re old and bitter. It’s ok, I probably wouldn’t go for someone like you anyway. Stick with your older men who are desperate so they pay you whatever you want. \n\nI’ll keep going for my beautiful model looking college girls. Have one coming over tomorrow 😉",
                                                                            "author": "Fun_Focus8159",
                                                                            "id": "gk18iko",
                                                                            "parent_id": "t1_gk1861q",
                                                                            "score": 1,
                                                                            "created_utc": 1611207784.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "I am your age and have a stable long term relationship. You seem to brag about multiple teen girls every time you post . Seems like you’re a John . Fucking women off SA randomly is ho behavior . Wear a condom please Johnny boy . Sex work sub Reddit’s are easy to find . Go post on there. Not shaming you",
                                                                                    "author": "Disastrous_Author638",
                                                                                    "id": "gk18t4x",
                                                                                    "parent_id": "t1_gk18iko",
                                                                                    "score": 8,
                                                                                    "created_utc": 1611207992.0,
                                                                                    "replies": [
                                                                                        {
                                                                                            "body": "The escorts lovingly pass this creep back to you guys. They don’t want him either lol",
                                                                                            "author": "MsDReid",
                                                                                            "id": "gk1jlku",
                                                                                            "parent_id": "t1_gk18t4x",
                                                                                            "score": 7,
                                                                                            "created_utc": 1611217245.0,
                                                                                            "replies": []
                                                                                        },
                                                                                        {
                                                                                            "body": "Ah yep, too old for me. I don’t date women my age. Too many issues and baggage.",
                                                                                            "author": "Fun_Focus8159",
                                                                                            "id": "gk18v1t",
                                                                                            "parent_id": "t1_gk18t4x",
                                                                                            "score": 1,
                                                                                            "created_utc": 1611208030.0,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "body": "[deleted]",
                                                                                                    "author": null,
                                                                                                    "id": "gk18yov",
                                                                                                    "parent_id": "t1_gk18v1t",
                                                                                                    "score": 2,
                                                                                                    "created_utc": 1611208102.0,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "body": "Lol please stop responding to me. You sound like an escort. Sorry, not my style.",
                                                                                                            "author": "Fun_Focus8159",
                                                                                                            "id": "gk198ej",
                                                                                                            "parent_id": "t1_gk18yov",
                                                                                                            "score": 0,
                                                                                                            "created_utc": 1611208299.0,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "body": "Please stop 🛑 Johnny boy! I’m not a barely legal teen who knows nothing and needs to sleep with you to get a Sephora shopping spree . Ugh young men who need escorts are kind of odd. I’m not your property and will never do what you say Z go on and manipulate teens .",
                                                                                                                    "author": "Disastrous_Author638",
                                                                                                                    "id": "gk19ht3",
                                                                                                                    "parent_id": "t1_gk198ej",
                                                                                                                    "score": 5,
                                                                                                                    "created_utc": 1611208489.0,
                                                                                                                    "replies": [
                                                                                                                        {
                                                                                                                            "body": "Lol oh you got me! 😉",
                                                                                                                            "author": "Fun_Focus8159",
                                                                                                                            "id": "gk19mmn",
                                                                                                                            "parent_id": "t1_gk19ht3",
                                                                                                                            "score": 0,
                                                                                                                            "created_utc": 1611208585.0,
                                                                                                                            "replies": [
                                                                                                                                {
                                                                                                                                    "body": "Stop responding. I don’t want men who solicit sex workers to be associated with my profile . You’re bad news",
                                                                                                                                    "author": "Disastrous_Author638",
                                                                                                                                    "id": "gk19qnu",
                                                                                                                                    "parent_id": "t1_gk19mmn",
                                                                                                                                    "score": 5,
                                                                                                                                    "created_utc": 1611208667.0,
                                                                                                                                    "replies": [
                                                                                                                                        {
                                                                                                                                            "body": "Lol you don’t even make sense. Wed workers? Just please stop.",
                                                                                                                                            "author": "Fun_Focus8159",
                                                                                                                                            "id": "gk19tfg",
                                                                                                                                            "parent_id": "t1_gk19qnu",
                                                                                                                                            "score": 0,
                                                                                                                                            "created_utc": 1611208723.0,
                                                                                                                                            "replies": []
                                                                                                                                        }
                                                                                                                                    ]
                                                                                                                                }
                                                                                                                            ]
                                                                                                                        }
                                                                                                                    ]
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "It's always great finding someone you vibe with. Keep treating each other well!",
            "author": "Cledaddy23",
            "id": "gjzrngr",
            "parent_id": "t3_l1jb57",
            "score": 5,
            "created_utc": 1611179986.0,
            "replies": [
                {
                    "body": "We do.  Honestly, best relationship of my life",
                    "author": "ComplexAlternative10",
                    "id": "gjzrra3",
                    "parent_id": "t1_gjzrngr",
                    "score": 8,
                    "created_utc": 1611180033.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "You are 60. She is 27. Neither the intimacy nor the platonic relationship is real. I am glad you’re happy but you are an old fool.",
            "author": "Wall-Street-Wizzard",
            "id": "gk2629c",
            "parent_id": "t3_l1jb57",
            "score": 6,
            "created_utc": 1611236930.0,
            "replies": [
                {
                    "body": "name calling not needed.  What is actually happening here is a rare true SD/SB relationship.  True, we could argue the honesty of the feelings or the wisdom of how quickly the relationship developed, but she's become a true courtesan or \"sugar baby in modern times\".  \n\nIf any warnings were to be given, it should be to her for becoming so dependent on her SD so quickly.  Now she could find herself \"enslaved\" or a better word, \"locked in\" to her current SD.  Think about it, could she realistically expect to host other SD's at her apartment since its paid for by her current SD?\n\nWhile there are some potential red flags, that's true of any relationship.  I say, let him have his fun, let the relationship run its course, they're both enjoying themselves and getting what they need and want out of the sugar relationship.\n\n&#x200B;\n\nI say more power to them. :)",
                    "author": "SDlovesu2",
                    "id": "gk29gna",
                    "parent_id": "t1_gk2629c",
                    "score": -1,
                    "created_utc": 1611238872.0,
                    "replies": [
                        {
                            "body": "I couldn’t agree with you more. I say God love them both and let them be happy. But I stand by what I say. He is foolish because he thinks the relationship is something it isn’t. That doesn’t mean it isn’t good for him, just means he has a distorted sense of reality. He is old enough to be her grandfather. That’s why I like escorts better. PFP.",
                            "author": "Wall-Street-Wizzard",
                            "id": "gk2e1o9",
                            "parent_id": "t1_gk29gna",
                            "score": 3,
                            "created_utc": 1611241254.0,
                            "replies": [
                                {
                                    "body": "I know what I’m getting into. So does she.  We’re enjoying what we have.",
                                    "author": "ComplexAlternative10",
                                    "id": "gk2on0u",
                                    "parent_id": "t1_gk2e1o9",
                                    "score": 1,
                                    "created_utc": 1611246259.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "We are both going into this eyes wide open.  No illusions here.   We have agreed to be exclusive.",
                            "author": "ComplexAlternative10",
                            "id": "gk2ojk2",
                            "parent_id": "t1_gk29gna",
                            "score": 2,
                            "created_utc": 1611246216.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "When you say 10X PPM, do you mean 10x the usual rate, or 10 meets per month?",
            "author": "smallbluecat",
            "id": "gk08lm1",
            "parent_id": "t3_l1jb57",
            "score": 2,
            "created_utc": 1611188329.0,
            "replies": [
                {
                    "body": "10x the rate.  We’ve been meeting 8x month, it will be more often with apartment, but no specified number. We really enjoy one another’s company and plan on spending lots of time together",
                    "author": "ComplexAlternative10",
                    "id": "gk08vpu",
                    "parent_id": "t1_gk08lm1",
                    "score": 3,
                    "created_utc": 1611188475.0,
                    "replies": [
                        {
                            "body": "That's great! Happy for you and her :)",
                            "author": "smallbluecat",
                            "id": "gk091bm",
                            "parent_id": "t1_gk08vpu",
                            "score": 2,
                            "created_utc": 1611188556.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I aspire to have the sugar relationship you guys do! That sounds awesome! I have found nothing but a bunch of scammers, although I've only recently been looking.",
            "author": "CrystalRenae85",
            "id": "gk0exeu",
            "parent_id": "t3_l1jb57",
            "score": 2,
            "created_utc": 1611191578.0,
            "replies": [
                {
                    "body": "I hope you find someone you can enjoy and grow with",
                    "author": "ComplexAlternative10",
                    "id": "gk19oma",
                    "parent_id": "t1_gk0exeu",
                    "score": 0,
                    "created_utc": 1611208626.0,
                    "replies": [
                        {
                            "body": "Thanks",
                            "author": "CrystalRenae85",
                            "id": "gk19qbr",
                            "parent_id": "t1_gk19oma",
                            "score": 0,
                            "created_utc": 1611208659.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "What an awesome story. So glad to hear that. why not enjoy yourself while you can.   From experience, the age gap sounds perfect!",
            "author": "HappyBear1952",
            "id": "gk07jj5",
            "parent_id": "t3_l1jb57",
            "score": 1,
            "created_utc": 1611187780.0,
            "replies": [
                {
                    "body": "May I ask how you get a SD, sorry for being straight to the point ...",
                    "author": "angeleyes_playful",
                    "id": "gktakuo",
                    "parent_id": "t1_gk07jj5",
                    "score": 1,
                    "created_utc": 1611660279.0,
                    "replies": [
                        {
                            "body": "By doing the work to become that ideal women for him.  You can get extensive info by doing a thorough research of this forum.",
                            "author": "HappyBear1952",
                            "id": "gkv31r8",
                            "parent_id": "t1_gktakuo",
                            "score": 1,
                            "created_utc": 1611692052.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "That's fantastic! Thanks for sharing and hope things continue to go well.",
            "author": "Teejaynj",
            "id": "gk07l11",
            "parent_id": "t3_l1jb57",
            "score": 1,
            "created_utc": 1611187802.0,
            "replies": []
        },
        {
            "body": "That is so awesome and gives me hope that I too can find someone so sweet and have a great relationship with. Good luck to ya'll 😊",
            "author": "Ezlynn_Rayne",
            "id": "gk0adr1",
            "parent_id": "t3_l1jb57",
            "score": 0,
            "created_utc": 1611189242.0,
            "replies": []
        },
        {
            "body": "Did you meet your SB on seeking?",
            "author": "afropaparazzi",
            "id": "gk0e8e0",
            "parent_id": "t3_l1jb57",
            "score": 0,
            "created_utc": 1611191218.0,
            "replies": [
                {
                    "body": "Yes I did.",
                    "author": "ComplexAlternative10",
                    "id": "gk1964c",
                    "parent_id": "t1_gk0e8e0",
                    "score": 1,
                    "created_utc": 1611208253.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Happiness counts. We can always make.more money . One can't always find happiness . Well done.",
            "author": "Guardi100",
            "id": "gk0lm3t",
            "parent_id": "t3_l1jb57",
            "score": 0,
            "created_utc": 1611194992.0,
            "replies": [
                {
                    "body": "It’s all about happiness and we’re both quite happy with how it’s going.",
                    "author": "ComplexAlternative10",
                    "id": "gk197ow",
                    "parent_id": "t1_gk0lm3t",
                    "score": 1,
                    "created_utc": 1611208285.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Congratulations on the find! The whole point of making money is to be able to spend it on fulfillment.  I'm sure we've all lost a lot more on a lot less than what you've got going on 👍",
            "author": "akbbgtc",
            "id": "gk0s2sf",
            "parent_id": "t3_l1jb57",
            "score": 0,
            "created_utc": 1611198201.0,
            "replies": [
                {
                    "body": "The amount of money is a huge deal to her and honestly, it’s not much to me.  I gave away more to charity last year.  The money I spend on her brings me joy because I can instantly see how it is contributing to a better life for her.  She is an incredible woman who has come through more than her share of adversity.  I admire her strength and it’s what attracted me to her.  I can’t wait to see who she becomes with more stability and positive influence in her life.",
                    "author": "ComplexAlternative10",
                    "id": "gk19it5",
                    "parent_id": "t1_gk0s2sf",
                    "score": 3,
                    "created_utc": 1611208510.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Sounds like you both struck gold. Happy for you both!",
            "author": "Cowabunajules",
            "id": "gk1cy14",
            "parent_id": "t3_l1jb57",
            "score": 0,
            "created_utc": 1611211191.0,
            "replies": []
        },
        {
            "body": "60 yr old SD are the best, she stuck good also",
            "author": "PsychologicalMud9673",
            "id": "gk0wwti",
            "parent_id": "t3_l1jb57",
            "score": -1,
            "created_utc": 1611200725.0,
            "replies": [
                {
                    "body": "The age difference is not an issue.  We don’t think about it or talk about it much. I am single and have no need for discretion.  We go out in public without a care.  She’s more cautious than me due to a troublesome Ex.  We even announced our relationship on social media recently.",
                    "author": "ComplexAlternative10",
                    "id": "gk23kce",
                    "parent_id": "t1_gk0wwti",
                    "score": 2,
                    "created_utc": 1611235372.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "gk28mcu",
                            "parent_id": "t1_gk23kce",
                            "score": 0,
                            "created_utc": 1611238410.0,
                            "replies": [
                                {
                                    "body": "Lol.  Not at all. She wanted to do it.  I went along.",
                                    "author": "ComplexAlternative10",
                                    "id": "gk2opk3",
                                    "parent_id": "t1_gk28mcu",
                                    "score": 1,
                                    "created_utc": 1611246290.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Good luck!! 🍀 I’m looking forward to my first real SD and this sounds like a lovely connection, though I’m sure I would rather not involve kids, my POT is a distance away, and is aware of my child I know it would take me a while to warming up to him tagging along for any event.",
            "author": "420snowbunnyx",
            "id": "gk2vnk0",
            "parent_id": "t3_l1jb57",
            "score": 1,
            "created_utc": 1611249308.0,
            "replies": []
        },
        {
            "body": "24-36 hours?  Holy blue balls Batman!",
            "author": "MidwestAmMan",
            "id": "gk53zrj",
            "parent_id": "t3_l1jb57",
            "score": 1,
            "created_utc": 1611288806.0,
            "replies": [
                {
                    "body": "Lol",
                    "author": "ComplexAlternative10",
                    "id": "gk9c20c",
                    "parent_id": "t1_gk53zrj",
                    "score": 1,
                    "created_utc": 1611358578.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Omg how do I get a SD",
            "author": "angeleyes_playful",
            "id": "gktae7t",
            "parent_id": "t3_l1jb57",
            "score": 1,
            "created_utc": 1611660110.0,
            "replies": []
        },
        {
            "body": "Agree. This sounds like a honeymoon phase that can steer wrong at any given moment. If this plummets, it will do so fast and will be a disaster seeing how much is invested at this point. \n\nI’m happy for OP but I feel this is a little immature or irresponsible on both parties.",
            "author": "avanirvana",
            "id": "gk2e40o",
            "parent_id": "t1_gk0vivz",
            "score": 8,
            "created_utc": 1611241286.0,
            "replies": []
        },
        {
            "body": "What a terrible idea. How is this not a red flag from the get go? Bad parenting.",
            "author": "clair-cummings",
            "id": "gk2r1b9",
            "parent_id": "t1_gk0vivz",
            "score": 8,
            "created_utc": 1611247320.0,
            "replies": []
        },
        {
            "body": "Thank you. I’m sensitive to the issues of having a child involved.  I have a child too.",
            "author": "ComplexAlternative10",
            "id": "gk193wy",
            "parent_id": "t1_gk0vivz",
            "score": 3,
            "created_utc": 1611208207.0,
            "replies": [
                {
                    "body": "I’m not a fan of bringing kids around new partners in general. I don’t judge; I don’t like it. In this situation, the fact that OP is paying for the apartment etc. and the SB is bringing her child on overnight dates just makes me very uncomfortable. If this ends any time soon, will he still pay the rent until she can do it herself? That is also a child’s home now and he made himself responsible for it. He put her in a position where she’s entirely reliant on him, and so is her kid. I just really hope things continue going well.",
                    "author": "FoxyFreckles1989",
                    "id": "gk1fsrb",
                    "parent_id": "t1_gk193wy",
                    "score": 18,
                    "created_utc": 1611213680.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I think he has already calculated the risk. If it doesn’t work out, he’s stuck with a year of rent. But if it does work out, having her place so close to him and her being comfortable and happy is priceless. So all-in-all, it’s a good move, until things fall apart.\n\nFrom experience, signing a lease early on helps make things work that otherwise might not. \n\nI hope this pans out great!!",
            "author": "RealisticSD",
            "id": "gk01eqe",
            "parent_id": "t1_gjzv47n",
            "score": 20,
            "created_utc": 1611184671.0,
            "replies": [
                {
                    "body": "A year of rent plus eviction fees from the apartment complex, thousands in damages, a boyfriend moving in and supporting both of them, etc etc lol",
                    "author": "MsDReid",
                    "id": "gk1j86c",
                    "parent_id": "t1_gk01eqe",
                    "score": 3,
                    "created_utc": 1611216893.0,
                    "replies": [
                        {
                            "body": "Again, all risks that can be solved with money. Just depends on how rich the SD is and how willing he is to gamble",
                            "author": "RealisticSD",
                            "id": "gk2mb6c",
                            "parent_id": "t1_gk1j86c",
                            "score": 1,
                            "created_utc": 1611245198.0,
                            "replies": [
                                {
                                    "body": "Eh. I know a guy who was sued for sexual harassment because he stopped paying a girls rent because she would no longer have sex with him. It’s really not that simple. Especially since this chick also has a little kid she is bringing to sugar dates and shit.",
                                    "author": "MsDReid",
                                    "id": "gk2qqyq",
                                    "parent_id": "t1_gk2mb6c",
                                    "score": 4,
                                    "created_utc": 1611247194.0,
                                    "replies": [
                                        {
                                            "body": "What a disaster in the making. I'm honestly astonished people can be this dumb. But I guess I shouldn't be 🤦‍♀️",
                                            "author": "clair-cummings",
                                            "id": "gk2rb8h",
                                            "parent_id": "t1_gk2qqyq",
                                            "score": 2,
                                            "created_utc": 1611247440.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "As I said, he’d be stuck paying rent for the duration of the lease. I don’t see how she can sue him to renew the lease.",
                                            "author": "RealisticSD",
                                            "id": "gk470zi",
                                            "parent_id": "t1_gk2qqyq",
                                            "score": 1,
                                            "created_utc": 1611270906.0,
                                            "replies": [
                                                {
                                                    "body": "She cant.\n\nShe can sue him for sexual harassment.",
                                                    "author": "MsDReid",
                                                    "id": "gk4f7by",
                                                    "parent_id": "t1_gk470zi",
                                                    "score": 1,
                                                    "created_utc": 1611275230.0,
                                                    "replies": [
                                                        {
                                                            "body": "In that situation I’d just cancel the lease the same day the threatens a lawsuit. It costs 4 months of rent; 2 for the 60 days of notice required and 2 for the penalty for breaking a lease. The girl will be evicted in exactly 60 days, lawsuit or not.\n\nIt’s not sexual harassment to harass your girlfriend for sex and break up if she doesn’t sleep with you.\n\nAnyways, I’d afford good lawyers that she never could. Plus, she’s not standing on much ground.",
                                                            "author": "RealisticSD",
                                                            "id": "gk4kcce",
                                                            "parent_id": "t1_gk4f7by",
                                                            "score": 0,
                                                            "created_utc": 1611278014.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Cool.",
                                                                    "author": "MsDReid",
                                                                    "id": "gk4qtt3",
                                                                    "parent_id": "t1_gk4kcce",
                                                                    "score": 3,
                                                                    "created_utc": 1611281509.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "> If it doesn’t work out, he’s stuck with a year of rent. \n\nAssuming the SD is successful a year of rent on an apartment for a great SB  is a far lower risk/lower cost activity than owning an airplane, large boat, divorce, race car, or sexual harassment at work claim.  \n\nBetter yet, a great SB can be a very profitable  productivity  enhancement investment",
                    "author": "pinotandsugar",
                    "id": "gk0yov1",
                    "parent_id": "t1_gk01eqe",
                    "score": 4,
                    "created_utc": 1611201709.0,
                    "replies": []
                },
                {
                    "body": "The apartment should solve more problems than it causes. So far, it’s all good.",
                    "author": "ComplexAlternative10",
                    "id": "gk18emx",
                    "parent_id": "t1_gk01eqe",
                    "score": 2,
                    "created_utc": 1611207706.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I appreciate your words of caution.  In this case, I’m very optimistic it will work out for the best.  If she said we’re done tomorrow, I wouldn’t begrudge her anything or regret anything I’ve done, but I don’t think that will happen, nor do I want it to.   We talk as if both of us expect this to Last years.  The apartment move was hastened because she is in a very untenable living situation",
            "author": "ComplexAlternative10",
            "id": "gjzzagd",
            "parent_id": "t1_gjzv47n",
            "score": 16,
            "created_utc": 1611183603.0,
            "replies": []
        },
        {
            "body": "I agree. In theory. But there are exceptions.. my kids have seen my friends, colleagues, couchsurfers etc. I'm not overly social person, but I really have wide range of contacts and for example a long distance SD I initially told kids is just one couchsurfer more. Limits the caring behaviour, but kids bought it of course and were happily playing board games with him while I was making pancakes to all.",
            "author": "EstrellaDulce",
            "id": "gk023k3",
            "parent_id": "t1_gjzyqyt",
            "score": 3,
            "created_utc": 1611185011.0,
            "replies": [
                {
                    "body": "I think that’s ok. I am also wary bc a lot of men seek out vulnerable single moms to take advantage of their kids . Yes that’s rare but we gotta watch out !",
                    "author": "Disastrous_Author638",
                    "id": "gk02ldt",
                    "parent_id": "t1_gk023k3",
                    "score": 17,
                    "created_utc": 1611185257.0,
                    "replies": [
                        {
                            "body": "It’s not that rare. Unfortunately.",
                            "author": "MsDReid",
                            "id": "gk1jczl",
                            "parent_id": "t1_gk02ldt",
                            "score": 7,
                            "created_utc": 1611217018.0,
                            "replies": [
                                {
                                    "body": "Seconding MsDReid. It's much more common than people might think and ranges from the less insidious to the dangerous.",
                                    "author": "This-Organization-11",
                                    "id": "gk24na6",
                                    "parent_id": "t1_gk1jczl",
                                    "score": 6,
                                    "created_utc": 1611236070.0,
                                    "replies": [
                                        {
                                            "body": "Yep. Squatting in a for sale home or one he literally has zero ties to. So the whole “he wouldn’t give me HIS address if he was going to hurt me.”\n\nI would be shocked if it was actually his home.",
                                            "author": "MsDReid",
                                            "id": "gk2qyvj",
                                            "parent_id": "t1_gk24na6",
                                            "score": 2,
                                            "created_utc": 1611247290.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "That happened sooner than I’d have thought.  Heightened emotion around holiday time plus the living situation accelerated that.  I am careful and accustomed to these situations from vanilla dating.",
            "author": "ComplexAlternative10",
            "id": "gk18nl3",
            "parent_id": "t1_gjzyqyt",
            "score": 3,
            "created_utc": 1611207882.0,
            "replies": []
        },
        {
            "body": "I’ve twice had SBs bring little ones to m&g. One was 5 weeks old, the other was 2.",
            "author": "RealisticSD",
            "id": "gk01gf0",
            "parent_id": "t1_gjzyqyt",
            "score": -2,
            "created_utc": 1611184694.0,
            "replies": [
                {
                    "body": "Five weeks?!?!? I don’t know if I should be disgusted or impressed that someone went on a sugar M&G five weeks after giving birth. Damn.",
                    "author": null,
                    "id": "gk01y5l",
                    "parent_id": "t1_gk01gf0",
                    "score": 25,
                    "created_utc": 1611184936.0,
                    "replies": [
                        {
                            "body": "Movin and shakin right there",
                            "author": "BillMurraysMom",
                            "id": "gk191of",
                            "parent_id": "t1_gk01y5l",
                            "score": 4,
                            "created_utc": 1611208161.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "That is gross behavior.  I am a single mom and I get it . It’s hard to juggle childcare but come on . Don’t be so desperate you bring your child to meet a strange man . I don’t think it’s bad if the child is introduced after 6 months or so of serious stable “dating” but you need to understand that a kid doesn’t need to meet a guy after a couple months. Have some discretion",
                    "author": "Disastrous_Author638",
                    "id": "gk02cvo",
                    "parent_id": "t1_gk01gf0",
                    "score": 30,
                    "created_utc": 1611185140.0,
                    "replies": [
                        {
                            "body": "Yeah no, children should not ever be involved in sugar situations. I have full custody, and would spend whatever I needed to in childcare to make sure my kid wasn’t getting confused by my personal life. 😕",
                            "author": "SarahBellum404",
                            "id": "gk0s56f",
                            "parent_id": "t1_gk02cvo",
                            "score": 17,
                            "created_utc": 1611198235.0,
                            "replies": [
                                {
                                    "body": "You are a good mom ! It’s so sad to think this we need to tell people this . I give the benefit of the doubt like a guy dropping mom off is just a friend but anythinb more is gross",
                                    "author": "Disastrous_Author638",
                                    "id": "gk15ksr",
                                    "parent_id": "t1_gk0s56f",
                                    "score": 9,
                                    "created_utc": 1611205814.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "That’s disgusting",
                    "author": "MsDReid",
                    "id": "gk1jdu6",
                    "parent_id": "t1_gk01gf0",
                    "score": 7,
                    "created_utc": 1611217040.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Right? I smell a disaster in the making lol",
            "author": "clair-cummings",
            "id": "gk2sjhr",
            "parent_id": "t1_gk1j60u",
            "score": 3,
            "created_utc": 1611247961.0,
            "replies": []
        },
        {
            "body": "So from the other perspective - there are plenty of SD’s who will not give more. Daresay, a majority share of SDs. So if a SB is sitting around hoping for that eventual windfall, they gonna be getting bedsores from sitting so long. \n\nThere’s nothing wrong with a SB communicating their desires/needs to their partner. And if their SD/SM can’t or doesn’t want to fulfill those needs - that’s well within their right to do so.",
            "author": "puppynipples",
            "id": "gk06adk",
            "parent_id": "t1_gjzs6px",
            "score": 36,
            "created_utc": 1611187132.0,
            "replies": []
        },
        {
            "body": "So true!  My SGF does not come from money and has very little.  She wants very little too.  I wanted to take her on a shopping spree for Xmas.  We went to a mall with Nordstrom’s, Saks, and other fine stores.  She couldn’t stomach the prices and asked me to take her to Burlington where she filled up a huge shopping cart with clothes that collectively added to a third of what I’d planned to spend and she was very happy and grateful.",
            "author": "ComplexAlternative10",
            "id": "gjzsld5",
            "parent_id": "t1_gjzs6px",
            "score": 20,
            "created_utc": 1611180419.0,
            "replies": [
                {
                    "body": "Honestly, I don't blame her. I'm not sure I could take them either...lol!",
                    "author": "ShaArt5",
                    "id": "gk088q3",
                    "parent_id": "t1_gjzsld5",
                    "score": 11,
                    "created_utc": 1611188143.0,
                    "replies": []
                },
                {
                    "body": "Thats awesome man. Those are the best SB’s. The ones that would rather go to Marshall’s than Nordstrom’s. The ones that would rather eat at a cheap burger place than a fancy steakhouse. \n\nMy current SB has been asking for very expensive gifts on top of her PPM, and it’s such a turn off. Makes me not want to give her anything lol.",
                    "author": "Fun_Focus8159",
                    "id": "gjztjtz",
                    "parent_id": "t1_gjzsld5",
                    "score": -1,
                    "created_utc": 1611180861.0,
                    "replies": [
                        {
                            "body": "My last SB (3 1/2 years) was married and made $150k - $200k a year based on her commissions and her husband made six figures too. \n\nShe loved expensive shoes and other stuff. \n\nI met her “in the wild” and all she wanted was gifts.  She’d send me pics of her trying on shit with a simple “yes or no?”\n\nI’d always send her $$$s and she’d wear whatever it was when we saw each other.   \n\nI even paid for her boob job lol. \n\nBut damn did she make an effort. She was a total sex freak and would surprise me in every way & all the time. \n\nThe only SB I ever fell for too.",
                            "author": "BGDDDY1",
                            "id": "gk05y72",
                            "parent_id": "t1_gjztjtz",
                            "score": 13,
                            "created_utc": 1611186959.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "gk0kvy8",
                                    "parent_id": "t1_gk05y72",
                                    "score": 6,
                                    "created_utc": 1611194621.0,
                                    "replies": [
                                        {
                                            "body": "Every single SD & SB are unique and that makes each SR (or vanilla for that matter) unique.  \n\nHaving a firm idea of what your looking for going into it, and being able to communicate it, gives you the best chance of ultimately finding what you’re looking for.",
                                            "author": "BGDDDY1",
                                            "id": "gk0ngdf",
                                            "parent_id": "t1_gk0kvy8",
                                            "score": 3,
                                            "created_utc": 1611195923.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "High end shoes are my favorite. Louboutins are what I'm known for.",
                                    "author": "clair-cummings",
                                    "id": "gk2ru80",
                                    "parent_id": "t1_gk05y72",
                                    "score": 2,
                                    "created_utc": 1611247666.0,
                                    "replies": []
                                },
                                {
                                    "body": "See that’s not bad if all she wanted were gifts. But if she expects PPM + expensive gifts that’s a no no lol.",
                                    "author": "Fun_Focus8159",
                                    "id": "gk08fbg",
                                    "parent_id": "t1_gk05y72",
                                    "score": -3,
                                    "created_utc": 1611188238.0,
                                    "replies": [
                                        {
                                            "body": "She’s the only one I ever gave regular gifts to. \n\nBeen doing this for over 10 years and the other 5 SBs I’ve had were $$$s only.  \n\nFirst one ever was allowance and the rest were ppm.  I’d give an extra ppm on bdays and around Christmas time.",
                                            "author": "BGDDDY1",
                                            "id": "gk0arje",
                                            "parent_id": "t1_gk08fbg",
                                            "score": 1,
                                            "created_utc": 1611189436.0,
                                            "replies": [
                                                {
                                                    "body": "Omg were do I find one in  Australia",
                                                    "author": "angeleyes_playful",
                                                    "id": "goga7fr",
                                                    "parent_id": "t1_gk0arje",
                                                    "score": 1,
                                                    "created_utc": 1614081973.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Right my current SB never asks for anything but gets everything.",
            "author": null,
            "id": "gjzvgll",
            "parent_id": "t1_gjzs6px",
            "score": 8,
            "created_utc": 1611181752.0,
            "replies": [
                {
                    "body": "Those that don’t ask, receive.   My SBs favorite Xmas gift from me was a $20 box of bath bombs.",
                    "author": "ComplexAlternative10",
                    "id": "gk236xm",
                    "parent_id": "t1_gjzvgll",
                    "score": 0,
                    "created_utc": 1611235127.0,
                    "replies": []
                },
                {
                    "body": "Where are all the SD in Australia",
                    "author": "angeleyes_playful",
                    "id": "goga94d",
                    "parent_id": "t1_gjzvgll",
                    "score": 1,
                    "created_utc": 1614082007.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I wish more SBs were like this too bcuz it hurts the ones like me that aren't. I'm passed by sometimes bcuz guys will think I'm like other girls who demand or want, when I like the relationship just as much as the support.",
            "author": "Ezlynn_Rayne",
            "id": "gk0aud2",
            "parent_id": "t1_gjzs6px",
            "score": 2,
            "created_utc": 1611189476.0,
            "replies": []
        },
        {
            "body": "I can't agree with this more.",
            "author": "spoilyou255",
            "id": "gk0clfj",
            "parent_id": "t1_gjzs6px",
            "score": 1,
            "created_utc": 1611190370.0,
            "replies": []
        },
        {
            "body": "It's the old story of the young bull and the older bull standing on a hill overlooking a field of cows. Young bull says let's run down there and screw a cow. The older bull says let's walk down and screw them all.",
            "author": "wildhorses6565",
            "id": "gk0gp64",
            "parent_id": "t1_gjzs6px",
            "score": -1,
            "created_utc": 1611192488.0,
            "replies": []
        },
        {
            "body": "Yes, pestering for money and gifts will feel to the SB like she’s getting a better deal, but all it does is expedite the breakup and make her worse off in the big picture.\n\nGirls who pester for money generally overestimate their own position.",
            "author": "RealisticSD",
            "id": "gk01mue",
            "parent_id": "t1_gjzs6px",
            "score": -3,
            "created_utc": 1611184781.0,
            "replies": [
                {
                    "body": "There is a way to ask for what one wants... and a way not to.  I would never “pester” my SD for gifts, I would just ask... and if I did, I would hope he would want to give to me.  I would hope that it would make him happy to know that his gift made me happy.  I’ve been involved in several different arrangements, and the ones that were the happiest were the ones in which he was the most generous and I was the most appreciative.  I’ve only had one SD who begrudged me what I wanted, but I later found out he had a personality disorder with narcissistic tendencies, and he had pretty deep emotional wounds of his own.\nMost men who truly care about a woman are happy to find ways to make her happy... remember,  one of the five Love Languages is “Receiving Gifts“, and it is a very valid way of feeling loved, valued, and cared for... and for some women like me, it’s our number one love language... so just because you have to spend some extra money to make a woman happy doesn’t mean she’s trying to take advantage of you. It could mean she just wants to feel loved by you. Trust me, most women who get into arrangements have daddy issues of some sort, and this is one way for you to help her heal them. But if you behave the way her father did, by refusing to show her love in a way that she recognizes, you’re not helping her... you’re actually hurting her, albeit unknowingly.  Oftentimes, when it looks like a SB seems to be asking a lot of you, it’s really because she wants tangible proof that you care about her.  It’s all very emotionally based... and many of us are not even conscious of these issues because they began in our childhood, but affect us into our adulthood.  \nThen again, if a SD is hesitant to buy his SB a gift that would easily make her happy just because he is afraid of being taken advantage of, that could indicate that he has some issues of his own that he needs to address.  The dynamic of older SD, younger SB can be a place to heal wounds... or re-open them. \n\nAnd yes, all of this is the therapist in me talking... sometimes I just can’t help myself. But I hope it helps us all understand this type of situation a little better.",
                    "author": "RealEarthAngel",
                    "id": "gk1ea85",
                    "parent_id": "t1_gk01mue",
                    "score": 9,
                    "created_utc": 1611212322.0,
                    "replies": [
                        {
                            "body": "Don’t worry you are talking to cheap guys who specifically go after naive women who don’t understand the lifestyle . Most real SD’s love to spoil",
                            "author": "Disastrous_Author638",
                            "id": "gk21d6h",
                            "parent_id": "t1_gk1ea85",
                            "score": 9,
                            "created_utc": 1611233878.0,
                            "replies": [
                                {
                                    "body": "Exactly.",
                                    "author": "RealEarthAngel",
                                    "id": "gk2jjxe",
                                    "parent_id": "t1_gk21d6h",
                                    "score": 4,
                                    "created_utc": 1611243924.0,
                                    "replies": []
                                },
                                {
                                    "body": "This. A lot of cheap men here that call themselves SD's. Not even close 🤦‍♀️",
                                    "author": "clair-cummings",
                                    "id": "gk2s6n1",
                                    "parent_id": "t1_gk21d6h",
                                    "score": 3,
                                    "created_utc": 1611247809.0,
                                    "replies": [
                                        {
                                            "body": "How can u rag on men for being cheap lol. Talk about entitlement",
                                            "author": "solatAPI",
                                            "id": "gnysfhj",
                                            "parent_id": "t1_gk2s6n1",
                                            "score": 0,
                                            "created_utc": 1613704378.0,
                                            "replies": [
                                                {
                                                    "body": "Awwww, you're in the wrong group hon. Go back to the little boy hole you climbed out of. Maybe some day you will understand the things adults talk about.",
                                                    "author": "clair-cummings",
                                                    "id": "gnze7wz",
                                                    "parent_id": "t1_gnysfhj",
                                                    "score": 2,
                                                    "created_utc": 1613718422.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "And where in Australia would I find a SD thats genuine",
                                    "author": "angeleyes_playful",
                                    "id": "gogae9t",
                                    "parent_id": "t1_gk21d6h",
                                    "score": 1,
                                    "created_utc": 1614082108.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "This is all so true. Unfortunately there’s a lot of “brat” SB’s who love to ask for things. Not realizing it’s a turn off to the SD.",
                    "author": "Fun_Focus8159",
                    "id": "gk092n9",
                    "parent_id": "t1_gk01mue",
                    "score": -2,
                    "created_utc": 1611188575.0,
                    "replies": []
                },
                {
                    "body": "Your last sentence seems to be a universal truth in this lifestyle.  \n\nPestering for $$$s and gifts nixes any chance of a ltr for most of us.",
                    "author": "BGDDDY1",
                    "id": "gk068uf",
                    "parent_id": "t1_gk01mue",
                    "score": -1,
                    "created_utc": 1611187110.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Most SBs don’t understand this.  A lot of SBs are in dire financial situations and adopt fleecing tactics.  For me, it’s the girl next door types that have a job to cover the basics, maybe a roommate - are the most appealing.  Much easier to relate to and invest in for the long-term.",
            "author": "DaddyFlying",
            "id": "gk0heqe",
            "parent_id": "t1_gjzs6px",
            "score": -1,
            "created_utc": 1611192854.0,
            "replies": [
                {
                    "body": "Same here. Or they live at home with their parents and don’t really need much money since everything is covered already.",
                    "author": "Fun_Focus8159",
                    "id": "gk0hj82",
                    "parent_id": "t1_gk0heqe",
                    "score": -4,
                    "created_utc": 1611192918.0,
                    "replies": [
                        {
                            "body": "Bc you look for literal teens . If you ever want to date a woman then be prepared to spend more . Women  gain more money and power out of real SD SB dynamic relationship than a young guy bemoaning a present .",
                            "author": "Disastrous_Author638",
                            "id": "gk15vzq",
                            "parent_id": "t1_gk0hj82",
                            "score": 15,
                            "created_utc": 1611206013.0,
                            "replies": [
                                {
                                    "body": "Yes gorgeous teens :)",
                                    "author": "Fun_Focus8159",
                                    "id": "gk161y7",
                                    "parent_id": "t1_gk15vzq",
                                    "score": -4,
                                    "created_utc": 1611206120.0,
                                    "replies": [
                                        {
                                            "body": "Your post history explains clearly why you fuck  with teens . Enjoy though 🤣",
                                            "author": "Disastrous_Author638",
                                            "id": "gk17fso",
                                            "parent_id": "t1_gk161y7",
                                            "score": 8,
                                            "created_utc": 1611207031.0,
                                            "replies": [
                                                {
                                                    "body": "Thanks, I will! :)",
                                                    "author": "Fun_Focus8159",
                                                    "id": "gk17i6f",
                                                    "parent_id": "t1_gk17fso",
                                                    "score": -4,
                                                    "created_utc": 1611207077.0,
                                                    "replies": [
                                                        {
                                                            "body": "Ok it def looks like you aren’t and having issues . You’re young and have a cocky attitude that doesn’t align with the way you explain you compensate women . You obviously have somewhat limited funds bc money is a big part to you. It’s ok. The older men I have loved have never once thought about how much they give.  They give too much to keep track. You’re a young guy who needs teens to pretend they don’t want the money bc you can’t accept the fact tour on a site dedicated to men who can’t score women for  a burger and an a beer . Cheers my teen lover . After a certain age that is a felony 🤔",
                                                            "author": "Disastrous_Author638",
                                                            "id": "gk1861q",
                                                            "parent_id": "t1_gk17i6f",
                                                            "score": 10,
                                                            "created_utc": 1611207537.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Sounds like you’re old and bitter. It’s ok, I probably wouldn’t go for someone like you anyway. Stick with your older men who are desperate so they pay you whatever you want. \n\nI’ll keep going for my beautiful model looking college girls. Have one coming over tomorrow 😉",
                                                                    "author": "Fun_Focus8159",
                                                                    "id": "gk18iko",
                                                                    "parent_id": "t1_gk1861q",
                                                                    "score": 1,
                                                                    "created_utc": 1611207784.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "I am your age and have a stable long term relationship. You seem to brag about multiple teen girls every time you post . Seems like you’re a John . Fucking women off SA randomly is ho behavior . Wear a condom please Johnny boy . Sex work sub Reddit’s are easy to find . Go post on there. Not shaming you",
                                                                            "author": "Disastrous_Author638",
                                                                            "id": "gk18t4x",
                                                                            "parent_id": "t1_gk18iko",
                                                                            "score": 8,
                                                                            "created_utc": 1611207992.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "The escorts lovingly pass this creep back to you guys. They don’t want him either lol",
                                                                                    "author": "MsDReid",
                                                                                    "id": "gk1jlku",
                                                                                    "parent_id": "t1_gk18t4x",
                                                                                    "score": 7,
                                                                                    "created_utc": 1611217245.0,
                                                                                    "replies": []
                                                                                },
                                                                                {
                                                                                    "body": "Ah yep, too old for me. I don’t date women my age. Too many issues and baggage.",
                                                                                    "author": "Fun_Focus8159",
                                                                                    "id": "gk18v1t",
                                                                                    "parent_id": "t1_gk18t4x",
                                                                                    "score": 1,
                                                                                    "created_utc": 1611208030.0,
                                                                                    "replies": [
                                                                                        {
                                                                                            "body": "[deleted]",
                                                                                            "author": null,
                                                                                            "id": "gk18yov",
                                                                                            "parent_id": "t1_gk18v1t",
                                                                                            "score": 2,
                                                                                            "created_utc": 1611208102.0,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "body": "Lol please stop responding to me. You sound like an escort. Sorry, not my style.",
                                                                                                    "author": "Fun_Focus8159",
                                                                                                    "id": "gk198ej",
                                                                                                    "parent_id": "t1_gk18yov",
                                                                                                    "score": 0,
                                                                                                    "created_utc": 1611208299.0,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "body": "Please stop 🛑 Johnny boy! I’m not a barely legal teen who knows nothing and needs to sleep with you to get a Sephora shopping spree . Ugh young men who need escorts are kind of odd. I’m not your property and will never do what you say Z go on and manipulate teens .",
                                                                                                            "author": "Disastrous_Author638",
                                                                                                            "id": "gk19ht3",
                                                                                                            "parent_id": "t1_gk198ej",
                                                                                                            "score": 5,
                                                                                                            "created_utc": 1611208489.0,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "body": "Lol oh you got me! 😉",
                                                                                                                    "author": "Fun_Focus8159",
                                                                                                                    "id": "gk19mmn",
                                                                                                                    "parent_id": "t1_gk19ht3",
                                                                                                                    "score": 0,
                                                                                                                    "created_utc": 1611208585.0,
                                                                                                                    "replies": [
                                                                                                                        {
                                                                                                                            "body": "Stop responding. I don’t want men who solicit sex workers to be associated with my profile . You’re bad news",
                                                                                                                            "author": "Disastrous_Author638",
                                                                                                                            "id": "gk19qnu",
                                                                                                                            "parent_id": "t1_gk19mmn",
                                                                                                                            "score": 5,
                                                                                                                            "created_utc": 1611208667.0,
                                                                                                                            "replies": [
                                                                                                                                {
                                                                                                                                    "body": "Lol you don’t even make sense. Wed workers? Just please stop.",
                                                                                                                                    "author": "Fun_Focus8159",
                                                                                                                                    "id": "gk19tfg",
                                                                                                                                    "parent_id": "t1_gk19qnu",
                                                                                                                                    "score": 0,
                                                                                                                                    "created_utc": 1611208723.0,
                                                                                                                                    "replies": []
                                                                                                                                }
                                                                                                                            ]
                                                                                                                        }
                                                                                                                    ]
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "We do.  Honestly, best relationship of my life",
            "author": "ComplexAlternative10",
            "id": "gjzrra3",
            "parent_id": "t1_gjzrngr",
            "score": 8,
            "created_utc": 1611180033.0,
            "replies": []
        },
        {
            "body": "name calling not needed.  What is actually happening here is a rare true SD/SB relationship.  True, we could argue the honesty of the feelings or the wisdom of how quickly the relationship developed, but she's become a true courtesan or \"sugar baby in modern times\".  \n\nIf any warnings were to be given, it should be to her for becoming so dependent on her SD so quickly.  Now she could find herself \"enslaved\" or a better word, \"locked in\" to her current SD.  Think about it, could she realistically expect to host other SD's at her apartment since its paid for by her current SD?\n\nWhile there are some potential red flags, that's true of any relationship.  I say, let him have his fun, let the relationship run its course, they're both enjoying themselves and getting what they need and want out of the sugar relationship.\n\n&#x200B;\n\nI say more power to them. :)",
            "author": "SDlovesu2",
            "id": "gk29gna",
            "parent_id": "t1_gk2629c",
            "score": -1,
            "created_utc": 1611238872.0,
            "replies": [
                {
                    "body": "I couldn’t agree with you more. I say God love them both and let them be happy. But I stand by what I say. He is foolish because he thinks the relationship is something it isn’t. That doesn’t mean it isn’t good for him, just means he has a distorted sense of reality. He is old enough to be her grandfather. That’s why I like escorts better. PFP.",
                    "author": "Wall-Street-Wizzard",
                    "id": "gk2e1o9",
                    "parent_id": "t1_gk29gna",
                    "score": 3,
                    "created_utc": 1611241254.0,
                    "replies": [
                        {
                            "body": "I know what I’m getting into. So does she.  We’re enjoying what we have.",
                            "author": "ComplexAlternative10",
                            "id": "gk2on0u",
                            "parent_id": "t1_gk2e1o9",
                            "score": 1,
                            "created_utc": 1611246259.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "We are both going into this eyes wide open.  No illusions here.   We have agreed to be exclusive.",
                    "author": "ComplexAlternative10",
                    "id": "gk2ojk2",
                    "parent_id": "t1_gk29gna",
                    "score": 2,
                    "created_utc": 1611246216.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "10x the rate.  We’ve been meeting 8x month, it will be more often with apartment, but no specified number. We really enjoy one another’s company and plan on spending lots of time together",
            "author": "ComplexAlternative10",
            "id": "gk08vpu",
            "parent_id": "t1_gk08lm1",
            "score": 3,
            "created_utc": 1611188475.0,
            "replies": [
                {
                    "body": "That's great! Happy for you and her :)",
                    "author": "smallbluecat",
                    "id": "gk091bm",
                    "parent_id": "t1_gk08vpu",
                    "score": 2,
                    "created_utc": 1611188556.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I hope you find someone you can enjoy and grow with",
            "author": "ComplexAlternative10",
            "id": "gk19oma",
            "parent_id": "t1_gk0exeu",
            "score": 0,
            "created_utc": 1611208626.0,
            "replies": [
                {
                    "body": "Thanks",
                    "author": "CrystalRenae85",
                    "id": "gk19qbr",
                    "parent_id": "t1_gk19oma",
                    "score": 0,
                    "created_utc": 1611208659.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "May I ask how you get a SD, sorry for being straight to the point ...",
            "author": "angeleyes_playful",
            "id": "gktakuo",
            "parent_id": "t1_gk07jj5",
            "score": 1,
            "created_utc": 1611660279.0,
            "replies": [
                {
                    "body": "By doing the work to become that ideal women for him.  You can get extensive info by doing a thorough research of this forum.",
                    "author": "HappyBear1952",
                    "id": "gkv31r8",
                    "parent_id": "t1_gktakuo",
                    "score": 1,
                    "created_utc": 1611692052.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yes I did.",
            "author": "ComplexAlternative10",
            "id": "gk1964c",
            "parent_id": "t1_gk0e8e0",
            "score": 1,
            "created_utc": 1611208253.0,
            "replies": []
        },
        {
            "body": "It’s all about happiness and we’re both quite happy with how it’s going.",
            "author": "ComplexAlternative10",
            "id": "gk197ow",
            "parent_id": "t1_gk0lm3t",
            "score": 1,
            "created_utc": 1611208285.0,
            "replies": []
        },
        {
            "body": "The amount of money is a huge deal to her and honestly, it’s not much to me.  I gave away more to charity last year.  The money I spend on her brings me joy because I can instantly see how it is contributing to a better life for her.  She is an incredible woman who has come through more than her share of adversity.  I admire her strength and it’s what attracted me to her.  I can’t wait to see who she becomes with more stability and positive influence in her life.",
            "author": "ComplexAlternative10",
            "id": "gk19it5",
            "parent_id": "t1_gk0s2sf",
            "score": 3,
            "created_utc": 1611208510.0,
            "replies": []
        },
        {
            "body": "The age difference is not an issue.  We don’t think about it or talk about it much. I am single and have no need for discretion.  We go out in public without a care.  She’s more cautious than me due to a troublesome Ex.  We even announced our relationship on social media recently.",
            "author": "ComplexAlternative10",
            "id": "gk23kce",
            "parent_id": "t1_gk0wwti",
            "score": 2,
            "created_utc": 1611235372.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "gk28mcu",
                    "parent_id": "t1_gk23kce",
                    "score": 0,
                    "created_utc": 1611238410.0,
                    "replies": [
                        {
                            "body": "Lol.  Not at all. She wanted to do it.  I went along.",
                            "author": "ComplexAlternative10",
                            "id": "gk2opk3",
                            "parent_id": "t1_gk28mcu",
                            "score": 1,
                            "created_utc": 1611246290.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Lol",
            "author": "ComplexAlternative10",
            "id": "gk9c20c",
            "parent_id": "t1_gk53zrj",
            "score": 1,
            "created_utc": 1611358578.0,
            "replies": []
        },
        {
            "body": "I’m not a fan of bringing kids around new partners in general. I don’t judge; I don’t like it. In this situation, the fact that OP is paying for the apartment etc. and the SB is bringing her child on overnight dates just makes me very uncomfortable. If this ends any time soon, will he still pay the rent until she can do it herself? That is also a child’s home now and he made himself responsible for it. He put her in a position where she’s entirely reliant on him, and so is her kid. I just really hope things continue going well.",
            "author": "FoxyFreckles1989",
            "id": "gk1fsrb",
            "parent_id": "t1_gk193wy",
            "score": 18,
            "created_utc": 1611213680.0,
            "replies": []
        },
        {
            "body": "A year of rent plus eviction fees from the apartment complex, thousands in damages, a boyfriend moving in and supporting both of them, etc etc lol",
            "author": "MsDReid",
            "id": "gk1j86c",
            "parent_id": "t1_gk01eqe",
            "score": 3,
            "created_utc": 1611216893.0,
            "replies": [
                {
                    "body": "Again, all risks that can be solved with money. Just depends on how rich the SD is and how willing he is to gamble",
                    "author": "RealisticSD",
                    "id": "gk2mb6c",
                    "parent_id": "t1_gk1j86c",
                    "score": 1,
                    "created_utc": 1611245198.0,
                    "replies": [
                        {
                            "body": "Eh. I know a guy who was sued for sexual harassment because he stopped paying a girls rent because she would no longer have sex with him. It’s really not that simple. Especially since this chick also has a little kid she is bringing to sugar dates and shit.",
                            "author": "MsDReid",
                            "id": "gk2qqyq",
                            "parent_id": "t1_gk2mb6c",
                            "score": 4,
                            "created_utc": 1611247194.0,
                            "replies": [
                                {
                                    "body": "What a disaster in the making. I'm honestly astonished people can be this dumb. But I guess I shouldn't be 🤦‍♀️",
                                    "author": "clair-cummings",
                                    "id": "gk2rb8h",
                                    "parent_id": "t1_gk2qqyq",
                                    "score": 2,
                                    "created_utc": 1611247440.0,
                                    "replies": []
                                },
                                {
                                    "body": "As I said, he’d be stuck paying rent for the duration of the lease. I don’t see how she can sue him to renew the lease.",
                                    "author": "RealisticSD",
                                    "id": "gk470zi",
                                    "parent_id": "t1_gk2qqyq",
                                    "score": 1,
                                    "created_utc": 1611270906.0,
                                    "replies": [
                                        {
                                            "body": "She cant.\n\nShe can sue him for sexual harassment.",
                                            "author": "MsDReid",
                                            "id": "gk4f7by",
                                            "parent_id": "t1_gk470zi",
                                            "score": 1,
                                            "created_utc": 1611275230.0,
                                            "replies": [
                                                {
                                                    "body": "In that situation I’d just cancel the lease the same day the threatens a lawsuit. It costs 4 months of rent; 2 for the 60 days of notice required and 2 for the penalty for breaking a lease. The girl will be evicted in exactly 60 days, lawsuit or not.\n\nIt’s not sexual harassment to harass your girlfriend for sex and break up if she doesn’t sleep with you.\n\nAnyways, I’d afford good lawyers that she never could. Plus, she’s not standing on much ground.",
                                                    "author": "RealisticSD",
                                                    "id": "gk4kcce",
                                                    "parent_id": "t1_gk4f7by",
                                                    "score": 0,
                                                    "created_utc": 1611278014.0,
                                                    "replies": [
                                                        {
                                                            "body": "Cool.",
                                                            "author": "MsDReid",
                                                            "id": "gk4qtt3",
                                                            "parent_id": "t1_gk4kcce",
                                                            "score": 3,
                                                            "created_utc": 1611281509.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "> If it doesn’t work out, he’s stuck with a year of rent. \n\nAssuming the SD is successful a year of rent on an apartment for a great SB  is a far lower risk/lower cost activity than owning an airplane, large boat, divorce, race car, or sexual harassment at work claim.  \n\nBetter yet, a great SB can be a very profitable  productivity  enhancement investment",
            "author": "pinotandsugar",
            "id": "gk0yov1",
            "parent_id": "t1_gk01eqe",
            "score": 4,
            "created_utc": 1611201709.0,
            "replies": []
        },
        {
            "body": "The apartment should solve more problems than it causes. So far, it’s all good.",
            "author": "ComplexAlternative10",
            "id": "gk18emx",
            "parent_id": "t1_gk01eqe",
            "score": 2,
            "created_utc": 1611207706.0,
            "replies": []
        },
        {
            "body": "I think that’s ok. I am also wary bc a lot of men seek out vulnerable single moms to take advantage of their kids . Yes that’s rare but we gotta watch out !",
            "author": "Disastrous_Author638",
            "id": "gk02ldt",
            "parent_id": "t1_gk023k3",
            "score": 17,
            "created_utc": 1611185257.0,
            "replies": [
                {
                    "body": "It’s not that rare. Unfortunately.",
                    "author": "MsDReid",
                    "id": "gk1jczl",
                    "parent_id": "t1_gk02ldt",
                    "score": 7,
                    "created_utc": 1611217018.0,
                    "replies": [
                        {
                            "body": "Seconding MsDReid. It's much more common than people might think and ranges from the less insidious to the dangerous.",
                            "author": "This-Organization-11",
                            "id": "gk24na6",
                            "parent_id": "t1_gk1jczl",
                            "score": 6,
                            "created_utc": 1611236070.0,
                            "replies": [
                                {
                                    "body": "Yep. Squatting in a for sale home or one he literally has zero ties to. So the whole “he wouldn’t give me HIS address if he was going to hurt me.”\n\nI would be shocked if it was actually his home.",
                                    "author": "MsDReid",
                                    "id": "gk2qyvj",
                                    "parent_id": "t1_gk24na6",
                                    "score": 2,
                                    "created_utc": 1611247290.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Five weeks?!?!? I don’t know if I should be disgusted or impressed that someone went on a sugar M&G five weeks after giving birth. Damn.",
            "author": null,
            "id": "gk01y5l",
            "parent_id": "t1_gk01gf0",
            "score": 25,
            "created_utc": 1611184936.0,
            "replies": [
                {
                    "body": "Movin and shakin right there",
                    "author": "BillMurraysMom",
                    "id": "gk191of",
                    "parent_id": "t1_gk01y5l",
                    "score": 4,
                    "created_utc": 1611208161.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "That is gross behavior.  I am a single mom and I get it . It’s hard to juggle childcare but come on . Don’t be so desperate you bring your child to meet a strange man . I don’t think it’s bad if the child is introduced after 6 months or so of serious stable “dating” but you need to understand that a kid doesn’t need to meet a guy after a couple months. Have some discretion",
            "author": "Disastrous_Author638",
            "id": "gk02cvo",
            "parent_id": "t1_gk01gf0",
            "score": 30,
            "created_utc": 1611185140.0,
            "replies": [
                {
                    "body": "Yeah no, children should not ever be involved in sugar situations. I have full custody, and would spend whatever I needed to in childcare to make sure my kid wasn’t getting confused by my personal life. 😕",
                    "author": "SarahBellum404",
                    "id": "gk0s56f",
                    "parent_id": "t1_gk02cvo",
                    "score": 17,
                    "created_utc": 1611198235.0,
                    "replies": [
                        {
                            "body": "You are a good mom ! It’s so sad to think this we need to tell people this . I give the benefit of the doubt like a guy dropping mom off is just a friend but anythinb more is gross",
                            "author": "Disastrous_Author638",
                            "id": "gk15ksr",
                            "parent_id": "t1_gk0s56f",
                            "score": 9,
                            "created_utc": 1611205814.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "That’s disgusting",
            "author": "MsDReid",
            "id": "gk1jdu6",
            "parent_id": "t1_gk01gf0",
            "score": 7,
            "created_utc": 1611217040.0,
            "replies": []
        },
        {
            "body": "Honestly, I don't blame her. I'm not sure I could take them either...lol!",
            "author": "ShaArt5",
            "id": "gk088q3",
            "parent_id": "t1_gjzsld5",
            "score": 11,
            "created_utc": 1611188143.0,
            "replies": []
        },
        {
            "body": "Thats awesome man. Those are the best SB’s. The ones that would rather go to Marshall’s than Nordstrom’s. The ones that would rather eat at a cheap burger place than a fancy steakhouse. \n\nMy current SB has been asking for very expensive gifts on top of her PPM, and it’s such a turn off. Makes me not want to give her anything lol.",
            "author": "Fun_Focus8159",
            "id": "gjztjtz",
            "parent_id": "t1_gjzsld5",
            "score": -1,
            "created_utc": 1611180861.0,
            "replies": [
                {
                    "body": "My last SB (3 1/2 years) was married and made $150k - $200k a year based on her commissions and her husband made six figures too. \n\nShe loved expensive shoes and other stuff. \n\nI met her “in the wild” and all she wanted was gifts.  She’d send me pics of her trying on shit with a simple “yes or no?”\n\nI’d always send her $$$s and she’d wear whatever it was when we saw each other.   \n\nI even paid for her boob job lol. \n\nBut damn did she make an effort. She was a total sex freak and would surprise me in every way & all the time. \n\nThe only SB I ever fell for too.",
                    "author": "BGDDDY1",
                    "id": "gk05y72",
                    "parent_id": "t1_gjztjtz",
                    "score": 13,
                    "created_utc": 1611186959.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "gk0kvy8",
                            "parent_id": "t1_gk05y72",
                            "score": 6,
                            "created_utc": 1611194621.0,
                            "replies": [
                                {
                                    "body": "Every single SD & SB are unique and that makes each SR (or vanilla for that matter) unique.  \n\nHaving a firm idea of what your looking for going into it, and being able to communicate it, gives you the best chance of ultimately finding what you’re looking for.",
                                    "author": "BGDDDY1",
                                    "id": "gk0ngdf",
                                    "parent_id": "t1_gk0kvy8",
                                    "score": 3,
                                    "created_utc": 1611195923.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "High end shoes are my favorite. Louboutins are what I'm known for.",
                            "author": "clair-cummings",
                            "id": "gk2ru80",
                            "parent_id": "t1_gk05y72",
                            "score": 2,
                            "created_utc": 1611247666.0,
                            "replies": []
                        },
                        {
                            "body": "See that’s not bad if all she wanted were gifts. But if she expects PPM + expensive gifts that’s a no no lol.",
                            "author": "Fun_Focus8159",
                            "id": "gk08fbg",
                            "parent_id": "t1_gk05y72",
                            "score": -3,
                            "created_utc": 1611188238.0,
                            "replies": [
                                {
                                    "body": "She’s the only one I ever gave regular gifts to. \n\nBeen doing this for over 10 years and the other 5 SBs I’ve had were $$$s only.  \n\nFirst one ever was allowance and the rest were ppm.  I’d give an extra ppm on bdays and around Christmas time.",
                                    "author": "BGDDDY1",
                                    "id": "gk0arje",
                                    "parent_id": "t1_gk08fbg",
                                    "score": 1,
                                    "created_utc": 1611189436.0,
                                    "replies": [
                                        {
                                            "body": "Omg were do I find one in  Australia",
                                            "author": "angeleyes_playful",
                                            "id": "goga7fr",
                                            "parent_id": "t1_gk0arje",
                                            "score": 1,
                                            "created_utc": 1614081973.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Those that don’t ask, receive.   My SBs favorite Xmas gift from me was a $20 box of bath bombs.",
            "author": "ComplexAlternative10",
            "id": "gk236xm",
            "parent_id": "t1_gjzvgll",
            "score": 0,
            "created_utc": 1611235127.0,
            "replies": []
        },
        {
            "body": "Where are all the SD in Australia",
            "author": "angeleyes_playful",
            "id": "goga94d",
            "parent_id": "t1_gjzvgll",
            "score": 1,
            "created_utc": 1614082007.0,
            "replies": []
        },
        {
            "body": "There is a way to ask for what one wants... and a way not to.  I would never “pester” my SD for gifts, I would just ask... and if I did, I would hope he would want to give to me.  I would hope that it would make him happy to know that his gift made me happy.  I’ve been involved in several different arrangements, and the ones that were the happiest were the ones in which he was the most generous and I was the most appreciative.  I’ve only had one SD who begrudged me what I wanted, but I later found out he had a personality disorder with narcissistic tendencies, and he had pretty deep emotional wounds of his own.\nMost men who truly care about a woman are happy to find ways to make her happy... remember,  one of the five Love Languages is “Receiving Gifts“, and it is a very valid way of feeling loved, valued, and cared for... and for some women like me, it’s our number one love language... so just because you have to spend some extra money to make a woman happy doesn’t mean she’s trying to take advantage of you. It could mean she just wants to feel loved by you. Trust me, most women who get into arrangements have daddy issues of some sort, and this is one way for you to help her heal them. But if you behave the way her father did, by refusing to show her love in a way that she recognizes, you’re not helping her... you’re actually hurting her, albeit unknowingly.  Oftentimes, when it looks like a SB seems to be asking a lot of you, it’s really because she wants tangible proof that you care about her.  It’s all very emotionally based... and many of us are not even conscious of these issues because they began in our childhood, but affect us into our adulthood.  \nThen again, if a SD is hesitant to buy his SB a gift that would easily make her happy just because he is afraid of being taken advantage of, that could indicate that he has some issues of his own that he needs to address.  The dynamic of older SD, younger SB can be a place to heal wounds... or re-open them. \n\nAnd yes, all of this is the therapist in me talking... sometimes I just can’t help myself. But I hope it helps us all understand this type of situation a little better.",
            "author": "RealEarthAngel",
            "id": "gk1ea85",
            "parent_id": "t1_gk01mue",
            "score": 9,
            "created_utc": 1611212322.0,
            "replies": [
                {
                    "body": "Don’t worry you are talking to cheap guys who specifically go after naive women who don’t understand the lifestyle . Most real SD’s love to spoil",
                    "author": "Disastrous_Author638",
                    "id": "gk21d6h",
                    "parent_id": "t1_gk1ea85",
                    "score": 9,
                    "created_utc": 1611233878.0,
                    "replies": [
                        {
                            "body": "Exactly.",
                            "author": "RealEarthAngel",
                            "id": "gk2jjxe",
                            "parent_id": "t1_gk21d6h",
                            "score": 4,
                            "created_utc": 1611243924.0,
                            "replies": []
                        },
                        {
                            "body": "This. A lot of cheap men here that call themselves SD's. Not even close 🤦‍♀️",
                            "author": "clair-cummings",
                            "id": "gk2s6n1",
                            "parent_id": "t1_gk21d6h",
                            "score": 3,
                            "created_utc": 1611247809.0,
                            "replies": [
                                {
                                    "body": "How can u rag on men for being cheap lol. Talk about entitlement",
                                    "author": "solatAPI",
                                    "id": "gnysfhj",
                                    "parent_id": "t1_gk2s6n1",
                                    "score": 0,
                                    "created_utc": 1613704378.0,
                                    "replies": [
                                        {
                                            "body": "Awwww, you're in the wrong group hon. Go back to the little boy hole you climbed out of. Maybe some day you will understand the things adults talk about.",
                                            "author": "clair-cummings",
                                            "id": "gnze7wz",
                                            "parent_id": "t1_gnysfhj",
                                            "score": 2,
                                            "created_utc": 1613718422.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "And where in Australia would I find a SD thats genuine",
                            "author": "angeleyes_playful",
                            "id": "gogae9t",
                            "parent_id": "t1_gk21d6h",
                            "score": 1,
                            "created_utc": 1614082108.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "This is all so true. Unfortunately there’s a lot of “brat” SB’s who love to ask for things. Not realizing it’s a turn off to the SD.",
            "author": "Fun_Focus8159",
            "id": "gk092n9",
            "parent_id": "t1_gk01mue",
            "score": -2,
            "created_utc": 1611188575.0,
            "replies": []
        },
        {
            "body": "Your last sentence seems to be a universal truth in this lifestyle.  \n\nPestering for $$$s and gifts nixes any chance of a ltr for most of us.",
            "author": "BGDDDY1",
            "id": "gk068uf",
            "parent_id": "t1_gk01mue",
            "score": -1,
            "created_utc": 1611187110.0,
            "replies": []
        },
        {
            "body": "Same here. Or they live at home with their parents and don’t really need much money since everything is covered already.",
            "author": "Fun_Focus8159",
            "id": "gk0hj82",
            "parent_id": "t1_gk0heqe",
            "score": -4,
            "created_utc": 1611192918.0,
            "replies": [
                {
                    "body": "Bc you look for literal teens . If you ever want to date a woman then be prepared to spend more . Women  gain more money and power out of real SD SB dynamic relationship than a young guy bemoaning a present .",
                    "author": "Disastrous_Author638",
                    "id": "gk15vzq",
                    "parent_id": "t1_gk0hj82",
                    "score": 15,
                    "created_utc": 1611206013.0,
                    "replies": [
                        {
                            "body": "Yes gorgeous teens :)",
                            "author": "Fun_Focus8159",
                            "id": "gk161y7",
                            "parent_id": "t1_gk15vzq",
                            "score": -4,
                            "created_utc": 1611206120.0,
                            "replies": [
                                {
                                    "body": "Your post history explains clearly why you fuck  with teens . Enjoy though 🤣",
                                    "author": "Disastrous_Author638",
                                    "id": "gk17fso",
                                    "parent_id": "t1_gk161y7",
                                    "score": 8,
                                    "created_utc": 1611207031.0,
                                    "replies": [
                                        {
                                            "body": "Thanks, I will! :)",
                                            "author": "Fun_Focus8159",
                                            "id": "gk17i6f",
                                            "parent_id": "t1_gk17fso",
                                            "score": -4,
                                            "created_utc": 1611207077.0,
                                            "replies": [
                                                {
                                                    "body": "Ok it def looks like you aren’t and having issues . You’re young and have a cocky attitude that doesn’t align with the way you explain you compensate women . You obviously have somewhat limited funds bc money is a big part to you. It’s ok. The older men I have loved have never once thought about how much they give.  They give too much to keep track. You’re a young guy who needs teens to pretend they don’t want the money bc you can’t accept the fact tour on a site dedicated to men who can’t score women for  a burger and an a beer . Cheers my teen lover . After a certain age that is a felony 🤔",
                                                    "author": "Disastrous_Author638",
                                                    "id": "gk1861q",
                                                    "parent_id": "t1_gk17i6f",
                                                    "score": 10,
                                                    "created_utc": 1611207537.0,
                                                    "replies": [
                                                        {
                                                            "body": "Sounds like you’re old and bitter. It’s ok, I probably wouldn’t go for someone like you anyway. Stick with your older men who are desperate so they pay you whatever you want. \n\nI’ll keep going for my beautiful model looking college girls. Have one coming over tomorrow 😉",
                                                            "author": "Fun_Focus8159",
                                                            "id": "gk18iko",
                                                            "parent_id": "t1_gk1861q",
                                                            "score": 1,
                                                            "created_utc": 1611207784.0,
                                                            "replies": [
                                                                {
                                                                    "body": "I am your age and have a stable long term relationship. You seem to brag about multiple teen girls every time you post . Seems like you’re a John . Fucking women off SA randomly is ho behavior . Wear a condom please Johnny boy . Sex work sub Reddit’s are easy to find . Go post on there. Not shaming you",
                                                                    "author": "Disastrous_Author638",
                                                                    "id": "gk18t4x",
                                                                    "parent_id": "t1_gk18iko",
                                                                    "score": 8,
                                                                    "created_utc": 1611207992.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "The escorts lovingly pass this creep back to you guys. They don’t want him either lol",
                                                                            "author": "MsDReid",
                                                                            "id": "gk1jlku",
                                                                            "parent_id": "t1_gk18t4x",
                                                                            "score": 7,
                                                                            "created_utc": 1611217245.0,
                                                                            "replies": []
                                                                        },
                                                                        {
                                                                            "body": "Ah yep, too old for me. I don’t date women my age. Too many issues and baggage.",
                                                                            "author": "Fun_Focus8159",
                                                                            "id": "gk18v1t",
                                                                            "parent_id": "t1_gk18t4x",
                                                                            "score": 1,
                                                                            "created_utc": 1611208030.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "[deleted]",
                                                                                    "author": null,
                                                                                    "id": "gk18yov",
                                                                                    "parent_id": "t1_gk18v1t",
                                                                                    "score": 2,
                                                                                    "created_utc": 1611208102.0,
                                                                                    "replies": [
                                                                                        {
                                                                                            "body": "Lol please stop responding to me. You sound like an escort. Sorry, not my style.",
                                                                                            "author": "Fun_Focus8159",
                                                                                            "id": "gk198ej",
                                                                                            "parent_id": "t1_gk18yov",
                                                                                            "score": 0,
                                                                                            "created_utc": 1611208299.0,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "body": "Please stop 🛑 Johnny boy! I’m not a barely legal teen who knows nothing and needs to sleep with you to get a Sephora shopping spree . Ugh young men who need escorts are kind of odd. I’m not your property and will never do what you say Z go on and manipulate teens .",
                                                                                                    "author": "Disastrous_Author638",
                                                                                                    "id": "gk19ht3",
                                                                                                    "parent_id": "t1_gk198ej",
                                                                                                    "score": 5,
                                                                                                    "created_utc": 1611208489.0,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "body": "Lol oh you got me! 😉",
                                                                                                            "author": "Fun_Focus8159",
                                                                                                            "id": "gk19mmn",
                                                                                                            "parent_id": "t1_gk19ht3",
                                                                                                            "score": 0,
                                                                                                            "created_utc": 1611208585.0,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "body": "Stop responding. I don’t want men who solicit sex workers to be associated with my profile . You’re bad news",
                                                                                                                    "author": "Disastrous_Author638",
                                                                                                                    "id": "gk19qnu",
                                                                                                                    "parent_id": "t1_gk19mmn",
                                                                                                                    "score": 5,
                                                                                                                    "created_utc": 1611208667.0,
                                                                                                                    "replies": [
                                                                                                                        {
                                                                                                                            "body": "Lol you don’t even make sense. Wed workers? Just please stop.",
                                                                                                                            "author": "Fun_Focus8159",
                                                                                                                            "id": "gk19tfg",
                                                                                                                            "parent_id": "t1_gk19qnu",
                                                                                                                            "score": 0,
                                                                                                                            "created_utc": 1611208723.0,
                                                                                                                            "replies": []
                                                                                                                        }
                                                                                                                    ]
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I couldn’t agree with you more. I say God love them both and let them be happy. But I stand by what I say. He is foolish because he thinks the relationship is something it isn’t. That doesn’t mean it isn’t good for him, just means he has a distorted sense of reality. He is old enough to be her grandfather. That’s why I like escorts better. PFP.",
            "author": "Wall-Street-Wizzard",
            "id": "gk2e1o9",
            "parent_id": "t1_gk29gna",
            "score": 3,
            "created_utc": 1611241254.0,
            "replies": [
                {
                    "body": "I know what I’m getting into. So does she.  We’re enjoying what we have.",
                    "author": "ComplexAlternative10",
                    "id": "gk2on0u",
                    "parent_id": "t1_gk2e1o9",
                    "score": 1,
                    "created_utc": 1611246259.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "We are both going into this eyes wide open.  No illusions here.   We have agreed to be exclusive.",
            "author": "ComplexAlternative10",
            "id": "gk2ojk2",
            "parent_id": "t1_gk29gna",
            "score": 2,
            "created_utc": 1611246216.0,
            "replies": []
        },
        {
            "body": "That's great! Happy for you and her :)",
            "author": "smallbluecat",
            "id": "gk091bm",
            "parent_id": "t1_gk08vpu",
            "score": 2,
            "created_utc": 1611188556.0,
            "replies": []
        },
        {
            "body": "Thanks",
            "author": "CrystalRenae85",
            "id": "gk19qbr",
            "parent_id": "t1_gk19oma",
            "score": 0,
            "created_utc": 1611208659.0,
            "replies": []
        },
        {
            "body": "By doing the work to become that ideal women for him.  You can get extensive info by doing a thorough research of this forum.",
            "author": "HappyBear1952",
            "id": "gkv31r8",
            "parent_id": "t1_gktakuo",
            "score": 1,
            "created_utc": 1611692052.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gk28mcu",
            "parent_id": "t1_gk23kce",
            "score": 0,
            "created_utc": 1611238410.0,
            "replies": [
                {
                    "body": "Lol.  Not at all. She wanted to do it.  I went along.",
                    "author": "ComplexAlternative10",
                    "id": "gk2opk3",
                    "parent_id": "t1_gk28mcu",
                    "score": 1,
                    "created_utc": 1611246290.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Again, all risks that can be solved with money. Just depends on how rich the SD is and how willing he is to gamble",
            "author": "RealisticSD",
            "id": "gk2mb6c",
            "parent_id": "t1_gk1j86c",
            "score": 1,
            "created_utc": 1611245198.0,
            "replies": [
                {
                    "body": "Eh. I know a guy who was sued for sexual harassment because he stopped paying a girls rent because she would no longer have sex with him. It’s really not that simple. Especially since this chick also has a little kid she is bringing to sugar dates and shit.",
                    "author": "MsDReid",
                    "id": "gk2qqyq",
                    "parent_id": "t1_gk2mb6c",
                    "score": 4,
                    "created_utc": 1611247194.0,
                    "replies": [
                        {
                            "body": "What a disaster in the making. I'm honestly astonished people can be this dumb. But I guess I shouldn't be 🤦‍♀️",
                            "author": "clair-cummings",
                            "id": "gk2rb8h",
                            "parent_id": "t1_gk2qqyq",
                            "score": 2,
                            "created_utc": 1611247440.0,
                            "replies": []
                        },
                        {
                            "body": "As I said, he’d be stuck paying rent for the duration of the lease. I don’t see how she can sue him to renew the lease.",
                            "author": "RealisticSD",
                            "id": "gk470zi",
                            "parent_id": "t1_gk2qqyq",
                            "score": 1,
                            "created_utc": 1611270906.0,
                            "replies": [
                                {
                                    "body": "She cant.\n\nShe can sue him for sexual harassment.",
                                    "author": "MsDReid",
                                    "id": "gk4f7by",
                                    "parent_id": "t1_gk470zi",
                                    "score": 1,
                                    "created_utc": 1611275230.0,
                                    "replies": [
                                        {
                                            "body": "In that situation I’d just cancel the lease the same day the threatens a lawsuit. It costs 4 months of rent; 2 for the 60 days of notice required and 2 for the penalty for breaking a lease. The girl will be evicted in exactly 60 days, lawsuit or not.\n\nIt’s not sexual harassment to harass your girlfriend for sex and break up if she doesn’t sleep with you.\n\nAnyways, I’d afford good lawyers that she never could. Plus, she’s not standing on much ground.",
                                            "author": "RealisticSD",
                                            "id": "gk4kcce",
                                            "parent_id": "t1_gk4f7by",
                                            "score": 0,
                                            "created_utc": 1611278014.0,
                                            "replies": [
                                                {
                                                    "body": "Cool.",
                                                    "author": "MsDReid",
                                                    "id": "gk4qtt3",
                                                    "parent_id": "t1_gk4kcce",
                                                    "score": 3,
                                                    "created_utc": 1611281509.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "It’s not that rare. Unfortunately.",
            "author": "MsDReid",
            "id": "gk1jczl",
            "parent_id": "t1_gk02ldt",
            "score": 7,
            "created_utc": 1611217018.0,
            "replies": [
                {
                    "body": "Seconding MsDReid. It's much more common than people might think and ranges from the less insidious to the dangerous.",
                    "author": "This-Organization-11",
                    "id": "gk24na6",
                    "parent_id": "t1_gk1jczl",
                    "score": 6,
                    "created_utc": 1611236070.0,
                    "replies": [
                        {
                            "body": "Yep. Squatting in a for sale home or one he literally has zero ties to. So the whole “he wouldn’t give me HIS address if he was going to hurt me.”\n\nI would be shocked if it was actually his home.",
                            "author": "MsDReid",
                            "id": "gk2qyvj",
                            "parent_id": "t1_gk24na6",
                            "score": 2,
                            "created_utc": 1611247290.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Movin and shakin right there",
            "author": "BillMurraysMom",
            "id": "gk191of",
            "parent_id": "t1_gk01y5l",
            "score": 4,
            "created_utc": 1611208161.0,
            "replies": []
        },
        {
            "body": "Yeah no, children should not ever be involved in sugar situations. I have full custody, and would spend whatever I needed to in childcare to make sure my kid wasn’t getting confused by my personal life. 😕",
            "author": "SarahBellum404",
            "id": "gk0s56f",
            "parent_id": "t1_gk02cvo",
            "score": 17,
            "created_utc": 1611198235.0,
            "replies": [
                {
                    "body": "You are a good mom ! It’s so sad to think this we need to tell people this . I give the benefit of the doubt like a guy dropping mom off is just a friend but anythinb more is gross",
                    "author": "Disastrous_Author638",
                    "id": "gk15ksr",
                    "parent_id": "t1_gk0s56f",
                    "score": 9,
                    "created_utc": 1611205814.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "My last SB (3 1/2 years) was married and made $150k - $200k a year based on her commissions and her husband made six figures too. \n\nShe loved expensive shoes and other stuff. \n\nI met her “in the wild” and all she wanted was gifts.  She’d send me pics of her trying on shit with a simple “yes or no?”\n\nI’d always send her $$$s and she’d wear whatever it was when we saw each other.   \n\nI even paid for her boob job lol. \n\nBut damn did she make an effort. She was a total sex freak and would surprise me in every way & all the time. \n\nThe only SB I ever fell for too.",
            "author": "BGDDDY1",
            "id": "gk05y72",
            "parent_id": "t1_gjztjtz",
            "score": 13,
            "created_utc": 1611186959.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "gk0kvy8",
                    "parent_id": "t1_gk05y72",
                    "score": 6,
                    "created_utc": 1611194621.0,
                    "replies": [
                        {
                            "body": "Every single SD & SB are unique and that makes each SR (or vanilla for that matter) unique.  \n\nHaving a firm idea of what your looking for going into it, and being able to communicate it, gives you the best chance of ultimately finding what you’re looking for.",
                            "author": "BGDDDY1",
                            "id": "gk0ngdf",
                            "parent_id": "t1_gk0kvy8",
                            "score": 3,
                            "created_utc": 1611195923.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "High end shoes are my favorite. Louboutins are what I'm known for.",
                    "author": "clair-cummings",
                    "id": "gk2ru80",
                    "parent_id": "t1_gk05y72",
                    "score": 2,
                    "created_utc": 1611247666.0,
                    "replies": []
                },
                {
                    "body": "See that’s not bad if all she wanted were gifts. But if she expects PPM + expensive gifts that’s a no no lol.",
                    "author": "Fun_Focus8159",
                    "id": "gk08fbg",
                    "parent_id": "t1_gk05y72",
                    "score": -3,
                    "created_utc": 1611188238.0,
                    "replies": [
                        {
                            "body": "She’s the only one I ever gave regular gifts to. \n\nBeen doing this for over 10 years and the other 5 SBs I’ve had were $$$s only.  \n\nFirst one ever was allowance and the rest were ppm.  I’d give an extra ppm on bdays and around Christmas time.",
                            "author": "BGDDDY1",
                            "id": "gk0arje",
                            "parent_id": "t1_gk08fbg",
                            "score": 1,
                            "created_utc": 1611189436.0,
                            "replies": [
                                {
                                    "body": "Omg were do I find one in  Australia",
                                    "author": "angeleyes_playful",
                                    "id": "goga7fr",
                                    "parent_id": "t1_gk0arje",
                                    "score": 1,
                                    "created_utc": 1614081973.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Don’t worry you are talking to cheap guys who specifically go after naive women who don’t understand the lifestyle . Most real SD’s love to spoil",
            "author": "Disastrous_Author638",
            "id": "gk21d6h",
            "parent_id": "t1_gk1ea85",
            "score": 9,
            "created_utc": 1611233878.0,
            "replies": [
                {
                    "body": "Exactly.",
                    "author": "RealEarthAngel",
                    "id": "gk2jjxe",
                    "parent_id": "t1_gk21d6h",
                    "score": 4,
                    "created_utc": 1611243924.0,
                    "replies": []
                },
                {
                    "body": "This. A lot of cheap men here that call themselves SD's. Not even close 🤦‍♀️",
                    "author": "clair-cummings",
                    "id": "gk2s6n1",
                    "parent_id": "t1_gk21d6h",
                    "score": 3,
                    "created_utc": 1611247809.0,
                    "replies": [
                        {
                            "body": "How can u rag on men for being cheap lol. Talk about entitlement",
                            "author": "solatAPI",
                            "id": "gnysfhj",
                            "parent_id": "t1_gk2s6n1",
                            "score": 0,
                            "created_utc": 1613704378.0,
                            "replies": [
                                {
                                    "body": "Awwww, you're in the wrong group hon. Go back to the little boy hole you climbed out of. Maybe some day you will understand the things adults talk about.",
                                    "author": "clair-cummings",
                                    "id": "gnze7wz",
                                    "parent_id": "t1_gnysfhj",
                                    "score": 2,
                                    "created_utc": 1613718422.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "And where in Australia would I find a SD thats genuine",
                    "author": "angeleyes_playful",
                    "id": "gogae9t",
                    "parent_id": "t1_gk21d6h",
                    "score": 1,
                    "created_utc": 1614082108.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Bc you look for literal teens . If you ever want to date a woman then be prepared to spend more . Women  gain more money and power out of real SD SB dynamic relationship than a young guy bemoaning a present .",
            "author": "Disastrous_Author638",
            "id": "gk15vzq",
            "parent_id": "t1_gk0hj82",
            "score": 15,
            "created_utc": 1611206013.0,
            "replies": [
                {
                    "body": "Yes gorgeous teens :)",
                    "author": "Fun_Focus8159",
                    "id": "gk161y7",
                    "parent_id": "t1_gk15vzq",
                    "score": -4,
                    "created_utc": 1611206120.0,
                    "replies": [
                        {
                            "body": "Your post history explains clearly why you fuck  with teens . Enjoy though 🤣",
                            "author": "Disastrous_Author638",
                            "id": "gk17fso",
                            "parent_id": "t1_gk161y7",
                            "score": 8,
                            "created_utc": 1611207031.0,
                            "replies": [
                                {
                                    "body": "Thanks, I will! :)",
                                    "author": "Fun_Focus8159",
                                    "id": "gk17i6f",
                                    "parent_id": "t1_gk17fso",
                                    "score": -4,
                                    "created_utc": 1611207077.0,
                                    "replies": [
                                        {
                                            "body": "Ok it def looks like you aren’t and having issues . You’re young and have a cocky attitude that doesn’t align with the way you explain you compensate women . You obviously have somewhat limited funds bc money is a big part to you. It’s ok. The older men I have loved have never once thought about how much they give.  They give too much to keep track. You’re a young guy who needs teens to pretend they don’t want the money bc you can’t accept the fact tour on a site dedicated to men who can’t score women for  a burger and an a beer . Cheers my teen lover . After a certain age that is a felony 🤔",
                                            "author": "Disastrous_Author638",
                                            "id": "gk1861q",
                                            "parent_id": "t1_gk17i6f",
                                            "score": 10,
                                            "created_utc": 1611207537.0,
                                            "replies": [
                                                {
                                                    "body": "Sounds like you’re old and bitter. It’s ok, I probably wouldn’t go for someone like you anyway. Stick with your older men who are desperate so they pay you whatever you want. \n\nI’ll keep going for my beautiful model looking college girls. Have one coming over tomorrow 😉",
                                                    "author": "Fun_Focus8159",
                                                    "id": "gk18iko",
                                                    "parent_id": "t1_gk1861q",
                                                    "score": 1,
                                                    "created_utc": 1611207784.0,
                                                    "replies": [
                                                        {
                                                            "body": "I am your age and have a stable long term relationship. You seem to brag about multiple teen girls every time you post . Seems like you’re a John . Fucking women off SA randomly is ho behavior . Wear a condom please Johnny boy . Sex work sub Reddit’s are easy to find . Go post on there. Not shaming you",
                                                            "author": "Disastrous_Author638",
                                                            "id": "gk18t4x",
                                                            "parent_id": "t1_gk18iko",
                                                            "score": 8,
                                                            "created_utc": 1611207992.0,
                                                            "replies": [
                                                                {
                                                                    "body": "The escorts lovingly pass this creep back to you guys. They don’t want him either lol",
                                                                    "author": "MsDReid",
                                                                    "id": "gk1jlku",
                                                                    "parent_id": "t1_gk18t4x",
                                                                    "score": 7,
                                                                    "created_utc": 1611217245.0,
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "body": "Ah yep, too old for me. I don’t date women my age. Too many issues and baggage.",
                                                                    "author": "Fun_Focus8159",
                                                                    "id": "gk18v1t",
                                                                    "parent_id": "t1_gk18t4x",
                                                                    "score": 1,
                                                                    "created_utc": 1611208030.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "[deleted]",
                                                                            "author": null,
                                                                            "id": "gk18yov",
                                                                            "parent_id": "t1_gk18v1t",
                                                                            "score": 2,
                                                                            "created_utc": 1611208102.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "Lol please stop responding to me. You sound like an escort. Sorry, not my style.",
                                                                                    "author": "Fun_Focus8159",
                                                                                    "id": "gk198ej",
                                                                                    "parent_id": "t1_gk18yov",
                                                                                    "score": 0,
                                                                                    "created_utc": 1611208299.0,
                                                                                    "replies": [
                                                                                        {
                                                                                            "body": "Please stop 🛑 Johnny boy! I’m not a barely legal teen who knows nothing and needs to sleep with you to get a Sephora shopping spree . Ugh young men who need escorts are kind of odd. I’m not your property and will never do what you say Z go on and manipulate teens .",
                                                                                            "author": "Disastrous_Author638",
                                                                                            "id": "gk19ht3",
                                                                                            "parent_id": "t1_gk198ej",
                                                                                            "score": 5,
                                                                                            "created_utc": 1611208489.0,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "body": "Lol oh you got me! 😉",
                                                                                                    "author": "Fun_Focus8159",
                                                                                                    "id": "gk19mmn",
                                                                                                    "parent_id": "t1_gk19ht3",
                                                                                                    "score": 0,
                                                                                                    "created_utc": 1611208585.0,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "body": "Stop responding. I don’t want men who solicit sex workers to be associated with my profile . You’re bad news",
                                                                                                            "author": "Disastrous_Author638",
                                                                                                            "id": "gk19qnu",
                                                                                                            "parent_id": "t1_gk19mmn",
                                                                                                            "score": 5,
                                                                                                            "created_utc": 1611208667.0,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "body": "Lol you don’t even make sense. Wed workers? Just please stop.",
                                                                                                                    "author": "Fun_Focus8159",
                                                                                                                    "id": "gk19tfg",
                                                                                                                    "parent_id": "t1_gk19qnu",
                                                                                                                    "score": 0,
                                                                                                                    "created_utc": 1611208723.0,
                                                                                                                    "replies": []
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I know what I’m getting into. So does she.  We’re enjoying what we have.",
            "author": "ComplexAlternative10",
            "id": "gk2on0u",
            "parent_id": "t1_gk2e1o9",
            "score": 1,
            "created_utc": 1611246259.0,
            "replies": []
        },
        {
            "body": "Lol.  Not at all. She wanted to do it.  I went along.",
            "author": "ComplexAlternative10",
            "id": "gk2opk3",
            "parent_id": "t1_gk28mcu",
            "score": 1,
            "created_utc": 1611246290.0,
            "replies": []
        },
        {
            "body": "Eh. I know a guy who was sued for sexual harassment because he stopped paying a girls rent because she would no longer have sex with him. It’s really not that simple. Especially since this chick also has a little kid she is bringing to sugar dates and shit.",
            "author": "MsDReid",
            "id": "gk2qqyq",
            "parent_id": "t1_gk2mb6c",
            "score": 4,
            "created_utc": 1611247194.0,
            "replies": [
                {
                    "body": "What a disaster in the making. I'm honestly astonished people can be this dumb. But I guess I shouldn't be 🤦‍♀️",
                    "author": "clair-cummings",
                    "id": "gk2rb8h",
                    "parent_id": "t1_gk2qqyq",
                    "score": 2,
                    "created_utc": 1611247440.0,
                    "replies": []
                },
                {
                    "body": "As I said, he’d be stuck paying rent for the duration of the lease. I don’t see how she can sue him to renew the lease.",
                    "author": "RealisticSD",
                    "id": "gk470zi",
                    "parent_id": "t1_gk2qqyq",
                    "score": 1,
                    "created_utc": 1611270906.0,
                    "replies": [
                        {
                            "body": "She cant.\n\nShe can sue him for sexual harassment.",
                            "author": "MsDReid",
                            "id": "gk4f7by",
                            "parent_id": "t1_gk470zi",
                            "score": 1,
                            "created_utc": 1611275230.0,
                            "replies": [
                                {
                                    "body": "In that situation I’d just cancel the lease the same day the threatens a lawsuit. It costs 4 months of rent; 2 for the 60 days of notice required and 2 for the penalty for breaking a lease. The girl will be evicted in exactly 60 days, lawsuit or not.\n\nIt’s not sexual harassment to harass your girlfriend for sex and break up if she doesn’t sleep with you.\n\nAnyways, I’d afford good lawyers that she never could. Plus, she’s not standing on much ground.",
                                    "author": "RealisticSD",
                                    "id": "gk4kcce",
                                    "parent_id": "t1_gk4f7by",
                                    "score": 0,
                                    "created_utc": 1611278014.0,
                                    "replies": [
                                        {
                                            "body": "Cool.",
                                            "author": "MsDReid",
                                            "id": "gk4qtt3",
                                            "parent_id": "t1_gk4kcce",
                                            "score": 3,
                                            "created_utc": 1611281509.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Seconding MsDReid. It's much more common than people might think and ranges from the less insidious to the dangerous.",
            "author": "This-Organization-11",
            "id": "gk24na6",
            "parent_id": "t1_gk1jczl",
            "score": 6,
            "created_utc": 1611236070.0,
            "replies": [
                {
                    "body": "Yep. Squatting in a for sale home or one he literally has zero ties to. So the whole “he wouldn’t give me HIS address if he was going to hurt me.”\n\nI would be shocked if it was actually his home.",
                    "author": "MsDReid",
                    "id": "gk2qyvj",
                    "parent_id": "t1_gk24na6",
                    "score": 2,
                    "created_utc": 1611247290.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "You are a good mom ! It’s so sad to think this we need to tell people this . I give the benefit of the doubt like a guy dropping mom off is just a friend but anythinb more is gross",
            "author": "Disastrous_Author638",
            "id": "gk15ksr",
            "parent_id": "t1_gk0s56f",
            "score": 9,
            "created_utc": 1611205814.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gk0kvy8",
            "parent_id": "t1_gk05y72",
            "score": 6,
            "created_utc": 1611194621.0,
            "replies": [
                {
                    "body": "Every single SD & SB are unique and that makes each SR (or vanilla for that matter) unique.  \n\nHaving a firm idea of what your looking for going into it, and being able to communicate it, gives you the best chance of ultimately finding what you’re looking for.",
                    "author": "BGDDDY1",
                    "id": "gk0ngdf",
                    "parent_id": "t1_gk0kvy8",
                    "score": 3,
                    "created_utc": 1611195923.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "High end shoes are my favorite. Louboutins are what I'm known for.",
            "author": "clair-cummings",
            "id": "gk2ru80",
            "parent_id": "t1_gk05y72",
            "score": 2,
            "created_utc": 1611247666.0,
            "replies": []
        },
        {
            "body": "See that’s not bad if all she wanted were gifts. But if she expects PPM + expensive gifts that’s a no no lol.",
            "author": "Fun_Focus8159",
            "id": "gk08fbg",
            "parent_id": "t1_gk05y72",
            "score": -3,
            "created_utc": 1611188238.0,
            "replies": [
                {
                    "body": "She’s the only one I ever gave regular gifts to. \n\nBeen doing this for over 10 years and the other 5 SBs I’ve had were $$$s only.  \n\nFirst one ever was allowance and the rest were ppm.  I’d give an extra ppm on bdays and around Christmas time.",
                    "author": "BGDDDY1",
                    "id": "gk0arje",
                    "parent_id": "t1_gk08fbg",
                    "score": 1,
                    "created_utc": 1611189436.0,
                    "replies": [
                        {
                            "body": "Omg were do I find one in  Australia",
                            "author": "angeleyes_playful",
                            "id": "goga7fr",
                            "parent_id": "t1_gk0arje",
                            "score": 1,
                            "created_utc": 1614081973.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Exactly.",
            "author": "RealEarthAngel",
            "id": "gk2jjxe",
            "parent_id": "t1_gk21d6h",
            "score": 4,
            "created_utc": 1611243924.0,
            "replies": []
        },
        {
            "body": "This. A lot of cheap men here that call themselves SD's. Not even close 🤦‍♀️",
            "author": "clair-cummings",
            "id": "gk2s6n1",
            "parent_id": "t1_gk21d6h",
            "score": 3,
            "created_utc": 1611247809.0,
            "replies": [
                {
                    "body": "How can u rag on men for being cheap lol. Talk about entitlement",
                    "author": "solatAPI",
                    "id": "gnysfhj",
                    "parent_id": "t1_gk2s6n1",
                    "score": 0,
                    "created_utc": 1613704378.0,
                    "replies": [
                        {
                            "body": "Awwww, you're in the wrong group hon. Go back to the little boy hole you climbed out of. Maybe some day you will understand the things adults talk about.",
                            "author": "clair-cummings",
                            "id": "gnze7wz",
                            "parent_id": "t1_gnysfhj",
                            "score": 2,
                            "created_utc": 1613718422.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "And where in Australia would I find a SD thats genuine",
            "author": "angeleyes_playful",
            "id": "gogae9t",
            "parent_id": "t1_gk21d6h",
            "score": 1,
            "created_utc": 1614082108.0,
            "replies": []
        },
        {
            "body": "Yes gorgeous teens :)",
            "author": "Fun_Focus8159",
            "id": "gk161y7",
            "parent_id": "t1_gk15vzq",
            "score": -4,
            "created_utc": 1611206120.0,
            "replies": [
                {
                    "body": "Your post history explains clearly why you fuck  with teens . Enjoy though 🤣",
                    "author": "Disastrous_Author638",
                    "id": "gk17fso",
                    "parent_id": "t1_gk161y7",
                    "score": 8,
                    "created_utc": 1611207031.0,
                    "replies": [
                        {
                            "body": "Thanks, I will! :)",
                            "author": "Fun_Focus8159",
                            "id": "gk17i6f",
                            "parent_id": "t1_gk17fso",
                            "score": -4,
                            "created_utc": 1611207077.0,
                            "replies": [
                                {
                                    "body": "Ok it def looks like you aren’t and having issues . You’re young and have a cocky attitude that doesn’t align with the way you explain you compensate women . You obviously have somewhat limited funds bc money is a big part to you. It’s ok. The older men I have loved have never once thought about how much they give.  They give too much to keep track. You’re a young guy who needs teens to pretend they don’t want the money bc you can’t accept the fact tour on a site dedicated to men who can’t score women for  a burger and an a beer . Cheers my teen lover . After a certain age that is a felony 🤔",
                                    "author": "Disastrous_Author638",
                                    "id": "gk1861q",
                                    "parent_id": "t1_gk17i6f",
                                    "score": 10,
                                    "created_utc": 1611207537.0,
                                    "replies": [
                                        {
                                            "body": "Sounds like you’re old and bitter. It’s ok, I probably wouldn’t go for someone like you anyway. Stick with your older men who are desperate so they pay you whatever you want. \n\nI’ll keep going for my beautiful model looking college girls. Have one coming over tomorrow 😉",
                                            "author": "Fun_Focus8159",
                                            "id": "gk18iko",
                                            "parent_id": "t1_gk1861q",
                                            "score": 1,
                                            "created_utc": 1611207784.0,
                                            "replies": [
                                                {
                                                    "body": "I am your age and have a stable long term relationship. You seem to brag about multiple teen girls every time you post . Seems like you’re a John . Fucking women off SA randomly is ho behavior . Wear a condom please Johnny boy . Sex work sub Reddit’s are easy to find . Go post on there. Not shaming you",
                                                    "author": "Disastrous_Author638",
                                                    "id": "gk18t4x",
                                                    "parent_id": "t1_gk18iko",
                                                    "score": 8,
                                                    "created_utc": 1611207992.0,
                                                    "replies": [
                                                        {
                                                            "body": "The escorts lovingly pass this creep back to you guys. They don’t want him either lol",
                                                            "author": "MsDReid",
                                                            "id": "gk1jlku",
                                                            "parent_id": "t1_gk18t4x",
                                                            "score": 7,
                                                            "created_utc": 1611217245.0,
                                                            "replies": []
                                                        },
                                                        {
                                                            "body": "Ah yep, too old for me. I don’t date women my age. Too many issues and baggage.",
                                                            "author": "Fun_Focus8159",
                                                            "id": "gk18v1t",
                                                            "parent_id": "t1_gk18t4x",
                                                            "score": 1,
                                                            "created_utc": 1611208030.0,
                                                            "replies": [
                                                                {
                                                                    "body": "[deleted]",
                                                                    "author": null,
                                                                    "id": "gk18yov",
                                                                    "parent_id": "t1_gk18v1t",
                                                                    "score": 2,
                                                                    "created_utc": 1611208102.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "Lol please stop responding to me. You sound like an escort. Sorry, not my style.",
                                                                            "author": "Fun_Focus8159",
                                                                            "id": "gk198ej",
                                                                            "parent_id": "t1_gk18yov",
                                                                            "score": 0,
                                                                            "created_utc": 1611208299.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "Please stop 🛑 Johnny boy! I’m not a barely legal teen who knows nothing and needs to sleep with you to get a Sephora shopping spree . Ugh young men who need escorts are kind of odd. I’m not your property and will never do what you say Z go on and manipulate teens .",
                                                                                    "author": "Disastrous_Author638",
                                                                                    "id": "gk19ht3",
                                                                                    "parent_id": "t1_gk198ej",
                                                                                    "score": 5,
                                                                                    "created_utc": 1611208489.0,
                                                                                    "replies": [
                                                                                        {
                                                                                            "body": "Lol oh you got me! 😉",
                                                                                            "author": "Fun_Focus8159",
                                                                                            "id": "gk19mmn",
                                                                                            "parent_id": "t1_gk19ht3",
                                                                                            "score": 0,
                                                                                            "created_utc": 1611208585.0,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "body": "Stop responding. I don’t want men who solicit sex workers to be associated with my profile . You’re bad news",
                                                                                                    "author": "Disastrous_Author638",
                                                                                                    "id": "gk19qnu",
                                                                                                    "parent_id": "t1_gk19mmn",
                                                                                                    "score": 5,
                                                                                                    "created_utc": 1611208667.0,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "body": "Lol you don’t even make sense. Wed workers? Just please stop.",
                                                                                                            "author": "Fun_Focus8159",
                                                                                                            "id": "gk19tfg",
                                                                                                            "parent_id": "t1_gk19qnu",
                                                                                                            "score": 0,
                                                                                                            "created_utc": 1611208723.0,
                                                                                                            "replies": []
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "What a disaster in the making. I'm honestly astonished people can be this dumb. But I guess I shouldn't be 🤦‍♀️",
            "author": "clair-cummings",
            "id": "gk2rb8h",
            "parent_id": "t1_gk2qqyq",
            "score": 2,
            "created_utc": 1611247440.0,
            "replies": []
        },
        {
            "body": "As I said, he’d be stuck paying rent for the duration of the lease. I don’t see how she can sue him to renew the lease.",
            "author": "RealisticSD",
            "id": "gk470zi",
            "parent_id": "t1_gk2qqyq",
            "score": 1,
            "created_utc": 1611270906.0,
            "replies": [
                {
                    "body": "She cant.\n\nShe can sue him for sexual harassment.",
                    "author": "MsDReid",
                    "id": "gk4f7by",
                    "parent_id": "t1_gk470zi",
                    "score": 1,
                    "created_utc": 1611275230.0,
                    "replies": [
                        {
                            "body": "In that situation I’d just cancel the lease the same day the threatens a lawsuit. It costs 4 months of rent; 2 for the 60 days of notice required and 2 for the penalty for breaking a lease. The girl will be evicted in exactly 60 days, lawsuit or not.\n\nIt’s not sexual harassment to harass your girlfriend for sex and break up if she doesn’t sleep with you.\n\nAnyways, I’d afford good lawyers that she never could. Plus, she’s not standing on much ground.",
                            "author": "RealisticSD",
                            "id": "gk4kcce",
                            "parent_id": "t1_gk4f7by",
                            "score": 0,
                            "created_utc": 1611278014.0,
                            "replies": [
                                {
                                    "body": "Cool.",
                                    "author": "MsDReid",
                                    "id": "gk4qtt3",
                                    "parent_id": "t1_gk4kcce",
                                    "score": 3,
                                    "created_utc": 1611281509.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yep. Squatting in a for sale home or one he literally has zero ties to. So the whole “he wouldn’t give me HIS address if he was going to hurt me.”\n\nI would be shocked if it was actually his home.",
            "author": "MsDReid",
            "id": "gk2qyvj",
            "parent_id": "t1_gk24na6",
            "score": 2,
            "created_utc": 1611247290.0,
            "replies": []
        },
        {
            "body": "Every single SD & SB are unique and that makes each SR (or vanilla for that matter) unique.  \n\nHaving a firm idea of what your looking for going into it, and being able to communicate it, gives you the best chance of ultimately finding what you’re looking for.",
            "author": "BGDDDY1",
            "id": "gk0ngdf",
            "parent_id": "t1_gk0kvy8",
            "score": 3,
            "created_utc": 1611195923.0,
            "replies": []
        },
        {
            "body": "She’s the only one I ever gave regular gifts to. \n\nBeen doing this for over 10 years and the other 5 SBs I’ve had were $$$s only.  \n\nFirst one ever was allowance and the rest were ppm.  I’d give an extra ppm on bdays and around Christmas time.",
            "author": "BGDDDY1",
            "id": "gk0arje",
            "parent_id": "t1_gk08fbg",
            "score": 1,
            "created_utc": 1611189436.0,
            "replies": [
                {
                    "body": "Omg were do I find one in  Australia",
                    "author": "angeleyes_playful",
                    "id": "goga7fr",
                    "parent_id": "t1_gk0arje",
                    "score": 1,
                    "created_utc": 1614081973.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "How can u rag on men for being cheap lol. Talk about entitlement",
            "author": "solatAPI",
            "id": "gnysfhj",
            "parent_id": "t1_gk2s6n1",
            "score": 0,
            "created_utc": 1613704378.0,
            "replies": [
                {
                    "body": "Awwww, you're in the wrong group hon. Go back to the little boy hole you climbed out of. Maybe some day you will understand the things adults talk about.",
                    "author": "clair-cummings",
                    "id": "gnze7wz",
                    "parent_id": "t1_gnysfhj",
                    "score": 2,
                    "created_utc": 1613718422.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Your post history explains clearly why you fuck  with teens . Enjoy though 🤣",
            "author": "Disastrous_Author638",
            "id": "gk17fso",
            "parent_id": "t1_gk161y7",
            "score": 8,
            "created_utc": 1611207031.0,
            "replies": [
                {
                    "body": "Thanks, I will! :)",
                    "author": "Fun_Focus8159",
                    "id": "gk17i6f",
                    "parent_id": "t1_gk17fso",
                    "score": -4,
                    "created_utc": 1611207077.0,
                    "replies": [
                        {
                            "body": "Ok it def looks like you aren’t and having issues . You’re young and have a cocky attitude that doesn’t align with the way you explain you compensate women . You obviously have somewhat limited funds bc money is a big part to you. It’s ok. The older men I have loved have never once thought about how much they give.  They give too much to keep track. You’re a young guy who needs teens to pretend they don’t want the money bc you can’t accept the fact tour on a site dedicated to men who can’t score women for  a burger and an a beer . Cheers my teen lover . After a certain age that is a felony 🤔",
                            "author": "Disastrous_Author638",
                            "id": "gk1861q",
                            "parent_id": "t1_gk17i6f",
                            "score": 10,
                            "created_utc": 1611207537.0,
                            "replies": [
                                {
                                    "body": "Sounds like you’re old and bitter. It’s ok, I probably wouldn’t go for someone like you anyway. Stick with your older men who are desperate so they pay you whatever you want. \n\nI’ll keep going for my beautiful model looking college girls. Have one coming over tomorrow 😉",
                                    "author": "Fun_Focus8159",
                                    "id": "gk18iko",
                                    "parent_id": "t1_gk1861q",
                                    "score": 1,
                                    "created_utc": 1611207784.0,
                                    "replies": [
                                        {
                                            "body": "I am your age and have a stable long term relationship. You seem to brag about multiple teen girls every time you post . Seems like you’re a John . Fucking women off SA randomly is ho behavior . Wear a condom please Johnny boy . Sex work sub Reddit’s are easy to find . Go post on there. Not shaming you",
                                            "author": "Disastrous_Author638",
                                            "id": "gk18t4x",
                                            "parent_id": "t1_gk18iko",
                                            "score": 8,
                                            "created_utc": 1611207992.0,
                                            "replies": [
                                                {
                                                    "body": "The escorts lovingly pass this creep back to you guys. They don’t want him either lol",
                                                    "author": "MsDReid",
                                                    "id": "gk1jlku",
                                                    "parent_id": "t1_gk18t4x",
                                                    "score": 7,
                                                    "created_utc": 1611217245.0,
                                                    "replies": []
                                                },
                                                {
                                                    "body": "Ah yep, too old for me. I don’t date women my age. Too many issues and baggage.",
                                                    "author": "Fun_Focus8159",
                                                    "id": "gk18v1t",
                                                    "parent_id": "t1_gk18t4x",
                                                    "score": 1,
                                                    "created_utc": 1611208030.0,
                                                    "replies": [
                                                        {
                                                            "body": "[deleted]",
                                                            "author": null,
                                                            "id": "gk18yov",
                                                            "parent_id": "t1_gk18v1t",
                                                            "score": 2,
                                                            "created_utc": 1611208102.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Lol please stop responding to me. You sound like an escort. Sorry, not my style.",
                                                                    "author": "Fun_Focus8159",
                                                                    "id": "gk198ej",
                                                                    "parent_id": "t1_gk18yov",
                                                                    "score": 0,
                                                                    "created_utc": 1611208299.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "Please stop 🛑 Johnny boy! I’m not a barely legal teen who knows nothing and needs to sleep with you to get a Sephora shopping spree . Ugh young men who need escorts are kind of odd. I’m not your property and will never do what you say Z go on and manipulate teens .",
                                                                            "author": "Disastrous_Author638",
                                                                            "id": "gk19ht3",
                                                                            "parent_id": "t1_gk198ej",
                                                                            "score": 5,
                                                                            "created_utc": 1611208489.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "Lol oh you got me! 😉",
                                                                                    "author": "Fun_Focus8159",
                                                                                    "id": "gk19mmn",
                                                                                    "parent_id": "t1_gk19ht3",
                                                                                    "score": 0,
                                                                                    "created_utc": 1611208585.0,
                                                                                    "replies": [
                                                                                        {
                                                                                            "body": "Stop responding. I don’t want men who solicit sex workers to be associated with my profile . You’re bad news",
                                                                                            "author": "Disastrous_Author638",
                                                                                            "id": "gk19qnu",
                                                                                            "parent_id": "t1_gk19mmn",
                                                                                            "score": 5,
                                                                                            "created_utc": 1611208667.0,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "body": "Lol you don’t even make sense. Wed workers? Just please stop.",
                                                                                                    "author": "Fun_Focus8159",
                                                                                                    "id": "gk19tfg",
                                                                                                    "parent_id": "t1_gk19qnu",
                                                                                                    "score": 0,
                                                                                                    "created_utc": 1611208723.0,
                                                                                                    "replies": []
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "She cant.\n\nShe can sue him for sexual harassment.",
            "author": "MsDReid",
            "id": "gk4f7by",
            "parent_id": "t1_gk470zi",
            "score": 1,
            "created_utc": 1611275230.0,
            "replies": [
                {
                    "body": "In that situation I’d just cancel the lease the same day the threatens a lawsuit. It costs 4 months of rent; 2 for the 60 days of notice required and 2 for the penalty for breaking a lease. The girl will be evicted in exactly 60 days, lawsuit or not.\n\nIt’s not sexual harassment to harass your girlfriend for sex and break up if she doesn’t sleep with you.\n\nAnyways, I’d afford good lawyers that she never could. Plus, she’s not standing on much ground.",
                    "author": "RealisticSD",
                    "id": "gk4kcce",
                    "parent_id": "t1_gk4f7by",
                    "score": 0,
                    "created_utc": 1611278014.0,
                    "replies": [
                        {
                            "body": "Cool.",
                            "author": "MsDReid",
                            "id": "gk4qtt3",
                            "parent_id": "t1_gk4kcce",
                            "score": 3,
                            "created_utc": 1611281509.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Omg were do I find one in  Australia",
            "author": "angeleyes_playful",
            "id": "goga7fr",
            "parent_id": "t1_gk0arje",
            "score": 1,
            "created_utc": 1614081973.0,
            "replies": []
        },
        {
            "body": "Awwww, you're in the wrong group hon. Go back to the little boy hole you climbed out of. Maybe some day you will understand the things adults talk about.",
            "author": "clair-cummings",
            "id": "gnze7wz",
            "parent_id": "t1_gnysfhj",
            "score": 2,
            "created_utc": 1613718422.0,
            "replies": []
        },
        {
            "body": "Thanks, I will! :)",
            "author": "Fun_Focus8159",
            "id": "gk17i6f",
            "parent_id": "t1_gk17fso",
            "score": -4,
            "created_utc": 1611207077.0,
            "replies": [
                {
                    "body": "Ok it def looks like you aren’t and having issues . You’re young and have a cocky attitude that doesn’t align with the way you explain you compensate women . You obviously have somewhat limited funds bc money is a big part to you. It’s ok. The older men I have loved have never once thought about how much they give.  They give too much to keep track. You’re a young guy who needs teens to pretend they don’t want the money bc you can’t accept the fact tour on a site dedicated to men who can’t score women for  a burger and an a beer . Cheers my teen lover . After a certain age that is a felony 🤔",
                    "author": "Disastrous_Author638",
                    "id": "gk1861q",
                    "parent_id": "t1_gk17i6f",
                    "score": 10,
                    "created_utc": 1611207537.0,
                    "replies": [
                        {
                            "body": "Sounds like you’re old and bitter. It’s ok, I probably wouldn’t go for someone like you anyway. Stick with your older men who are desperate so they pay you whatever you want. \n\nI’ll keep going for my beautiful model looking college girls. Have one coming over tomorrow 😉",
                            "author": "Fun_Focus8159",
                            "id": "gk18iko",
                            "parent_id": "t1_gk1861q",
                            "score": 1,
                            "created_utc": 1611207784.0,
                            "replies": [
                                {
                                    "body": "I am your age and have a stable long term relationship. You seem to brag about multiple teen girls every time you post . Seems like you’re a John . Fucking women off SA randomly is ho behavior . Wear a condom please Johnny boy . Sex work sub Reddit’s are easy to find . Go post on there. Not shaming you",
                                    "author": "Disastrous_Author638",
                                    "id": "gk18t4x",
                                    "parent_id": "t1_gk18iko",
                                    "score": 8,
                                    "created_utc": 1611207992.0,
                                    "replies": [
                                        {
                                            "body": "The escorts lovingly pass this creep back to you guys. They don’t want him either lol",
                                            "author": "MsDReid",
                                            "id": "gk1jlku",
                                            "parent_id": "t1_gk18t4x",
                                            "score": 7,
                                            "created_utc": 1611217245.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "Ah yep, too old for me. I don’t date women my age. Too many issues and baggage.",
                                            "author": "Fun_Focus8159",
                                            "id": "gk18v1t",
                                            "parent_id": "t1_gk18t4x",
                                            "score": 1,
                                            "created_utc": 1611208030.0,
                                            "replies": [
                                                {
                                                    "body": "[deleted]",
                                                    "author": null,
                                                    "id": "gk18yov",
                                                    "parent_id": "t1_gk18v1t",
                                                    "score": 2,
                                                    "created_utc": 1611208102.0,
                                                    "replies": [
                                                        {
                                                            "body": "Lol please stop responding to me. You sound like an escort. Sorry, not my style.",
                                                            "author": "Fun_Focus8159",
                                                            "id": "gk198ej",
                                                            "parent_id": "t1_gk18yov",
                                                            "score": 0,
                                                            "created_utc": 1611208299.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Please stop 🛑 Johnny boy! I’m not a barely legal teen who knows nothing and needs to sleep with you to get a Sephora shopping spree . Ugh young men who need escorts are kind of odd. I’m not your property and will never do what you say Z go on and manipulate teens .",
                                                                    "author": "Disastrous_Author638",
                                                                    "id": "gk19ht3",
                                                                    "parent_id": "t1_gk198ej",
                                                                    "score": 5,
                                                                    "created_utc": 1611208489.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "Lol oh you got me! 😉",
                                                                            "author": "Fun_Focus8159",
                                                                            "id": "gk19mmn",
                                                                            "parent_id": "t1_gk19ht3",
                                                                            "score": 0,
                                                                            "created_utc": 1611208585.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "Stop responding. I don’t want men who solicit sex workers to be associated with my profile . You’re bad news",
                                                                                    "author": "Disastrous_Author638",
                                                                                    "id": "gk19qnu",
                                                                                    "parent_id": "t1_gk19mmn",
                                                                                    "score": 5,
                                                                                    "created_utc": 1611208667.0,
                                                                                    "replies": [
                                                                                        {
                                                                                            "body": "Lol you don’t even make sense. Wed workers? Just please stop.",
                                                                                            "author": "Fun_Focus8159",
                                                                                            "id": "gk19tfg",
                                                                                            "parent_id": "t1_gk19qnu",
                                                                                            "score": 0,
                                                                                            "created_utc": 1611208723.0,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "In that situation I’d just cancel the lease the same day the threatens a lawsuit. It costs 4 months of rent; 2 for the 60 days of notice required and 2 for the penalty for breaking a lease. The girl will be evicted in exactly 60 days, lawsuit or not.\n\nIt’s not sexual harassment to harass your girlfriend for sex and break up if she doesn’t sleep with you.\n\nAnyways, I’d afford good lawyers that she never could. Plus, she’s not standing on much ground.",
            "author": "RealisticSD",
            "id": "gk4kcce",
            "parent_id": "t1_gk4f7by",
            "score": 0,
            "created_utc": 1611278014.0,
            "replies": [
                {
                    "body": "Cool.",
                    "author": "MsDReid",
                    "id": "gk4qtt3",
                    "parent_id": "t1_gk4kcce",
                    "score": 3,
                    "created_utc": 1611281509.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Ok it def looks like you aren’t and having issues . You’re young and have a cocky attitude that doesn’t align with the way you explain you compensate women . You obviously have somewhat limited funds bc money is a big part to you. It’s ok. The older men I have loved have never once thought about how much they give.  They give too much to keep track. You’re a young guy who needs teens to pretend they don’t want the money bc you can’t accept the fact tour on a site dedicated to men who can’t score women for  a burger and an a beer . Cheers my teen lover . After a certain age that is a felony 🤔",
            "author": "Disastrous_Author638",
            "id": "gk1861q",
            "parent_id": "t1_gk17i6f",
            "score": 10,
            "created_utc": 1611207537.0,
            "replies": [
                {
                    "body": "Sounds like you’re old and bitter. It’s ok, I probably wouldn’t go for someone like you anyway. Stick with your older men who are desperate so they pay you whatever you want. \n\nI’ll keep going for my beautiful model looking college girls. Have one coming over tomorrow 😉",
                    "author": "Fun_Focus8159",
                    "id": "gk18iko",
                    "parent_id": "t1_gk1861q",
                    "score": 1,
                    "created_utc": 1611207784.0,
                    "replies": [
                        {
                            "body": "I am your age and have a stable long term relationship. You seem to brag about multiple teen girls every time you post . Seems like you’re a John . Fucking women off SA randomly is ho behavior . Wear a condom please Johnny boy . Sex work sub Reddit’s are easy to find . Go post on there. Not shaming you",
                            "author": "Disastrous_Author638",
                            "id": "gk18t4x",
                            "parent_id": "t1_gk18iko",
                            "score": 8,
                            "created_utc": 1611207992.0,
                            "replies": [
                                {
                                    "body": "The escorts lovingly pass this creep back to you guys. They don’t want him either lol",
                                    "author": "MsDReid",
                                    "id": "gk1jlku",
                                    "parent_id": "t1_gk18t4x",
                                    "score": 7,
                                    "created_utc": 1611217245.0,
                                    "replies": []
                                },
                                {
                                    "body": "Ah yep, too old for me. I don’t date women my age. Too many issues and baggage.",
                                    "author": "Fun_Focus8159",
                                    "id": "gk18v1t",
                                    "parent_id": "t1_gk18t4x",
                                    "score": 1,
                                    "created_utc": 1611208030.0,
                                    "replies": [
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "gk18yov",
                                            "parent_id": "t1_gk18v1t",
                                            "score": 2,
                                            "created_utc": 1611208102.0,
                                            "replies": [
                                                {
                                                    "body": "Lol please stop responding to me. You sound like an escort. Sorry, not my style.",
                                                    "author": "Fun_Focus8159",
                                                    "id": "gk198ej",
                                                    "parent_id": "t1_gk18yov",
                                                    "score": 0,
                                                    "created_utc": 1611208299.0,
                                                    "replies": [
                                                        {
                                                            "body": "Please stop 🛑 Johnny boy! I’m not a barely legal teen who knows nothing and needs to sleep with you to get a Sephora shopping spree . Ugh young men who need escorts are kind of odd. I’m not your property and will never do what you say Z go on and manipulate teens .",
                                                            "author": "Disastrous_Author638",
                                                            "id": "gk19ht3",
                                                            "parent_id": "t1_gk198ej",
                                                            "score": 5,
                                                            "created_utc": 1611208489.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Lol oh you got me! 😉",
                                                                    "author": "Fun_Focus8159",
                                                                    "id": "gk19mmn",
                                                                    "parent_id": "t1_gk19ht3",
                                                                    "score": 0,
                                                                    "created_utc": 1611208585.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "Stop responding. I don’t want men who solicit sex workers to be associated with my profile . You’re bad news",
                                                                            "author": "Disastrous_Author638",
                                                                            "id": "gk19qnu",
                                                                            "parent_id": "t1_gk19mmn",
                                                                            "score": 5,
                                                                            "created_utc": 1611208667.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "Lol you don’t even make sense. Wed workers? Just please stop.",
                                                                                    "author": "Fun_Focus8159",
                                                                                    "id": "gk19tfg",
                                                                                    "parent_id": "t1_gk19qnu",
                                                                                    "score": 0,
                                                                                    "created_utc": 1611208723.0,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Cool.",
            "author": "MsDReid",
            "id": "gk4qtt3",
            "parent_id": "t1_gk4kcce",
            "score": 3,
            "created_utc": 1611281509.0,
            "replies": []
        },
        {
            "body": "Sounds like you’re old and bitter. It’s ok, I probably wouldn’t go for someone like you anyway. Stick with your older men who are desperate so they pay you whatever you want. \n\nI’ll keep going for my beautiful model looking college girls. Have one coming over tomorrow 😉",
            "author": "Fun_Focus8159",
            "id": "gk18iko",
            "parent_id": "t1_gk1861q",
            "score": 1,
            "created_utc": 1611207784.0,
            "replies": [
                {
                    "body": "I am your age and have a stable long term relationship. You seem to brag about multiple teen girls every time you post . Seems like you’re a John . Fucking women off SA randomly is ho behavior . Wear a condom please Johnny boy . Sex work sub Reddit’s are easy to find . Go post on there. Not shaming you",
                    "author": "Disastrous_Author638",
                    "id": "gk18t4x",
                    "parent_id": "t1_gk18iko",
                    "score": 8,
                    "created_utc": 1611207992.0,
                    "replies": [
                        {
                            "body": "The escorts lovingly pass this creep back to you guys. They don’t want him either lol",
                            "author": "MsDReid",
                            "id": "gk1jlku",
                            "parent_id": "t1_gk18t4x",
                            "score": 7,
                            "created_utc": 1611217245.0,
                            "replies": []
                        },
                        {
                            "body": "Ah yep, too old for me. I don’t date women my age. Too many issues and baggage.",
                            "author": "Fun_Focus8159",
                            "id": "gk18v1t",
                            "parent_id": "t1_gk18t4x",
                            "score": 1,
                            "created_utc": 1611208030.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "gk18yov",
                                    "parent_id": "t1_gk18v1t",
                                    "score": 2,
                                    "created_utc": 1611208102.0,
                                    "replies": [
                                        {
                                            "body": "Lol please stop responding to me. You sound like an escort. Sorry, not my style.",
                                            "author": "Fun_Focus8159",
                                            "id": "gk198ej",
                                            "parent_id": "t1_gk18yov",
                                            "score": 0,
                                            "created_utc": 1611208299.0,
                                            "replies": [
                                                {
                                                    "body": "Please stop 🛑 Johnny boy! I’m not a barely legal teen who knows nothing and needs to sleep with you to get a Sephora shopping spree . Ugh young men who need escorts are kind of odd. I’m not your property and will never do what you say Z go on and manipulate teens .",
                                                    "author": "Disastrous_Author638",
                                                    "id": "gk19ht3",
                                                    "parent_id": "t1_gk198ej",
                                                    "score": 5,
                                                    "created_utc": 1611208489.0,
                                                    "replies": [
                                                        {
                                                            "body": "Lol oh you got me! 😉",
                                                            "author": "Fun_Focus8159",
                                                            "id": "gk19mmn",
                                                            "parent_id": "t1_gk19ht3",
                                                            "score": 0,
                                                            "created_utc": 1611208585.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Stop responding. I don’t want men who solicit sex workers to be associated with my profile . You’re bad news",
                                                                    "author": "Disastrous_Author638",
                                                                    "id": "gk19qnu",
                                                                    "parent_id": "t1_gk19mmn",
                                                                    "score": 5,
                                                                    "created_utc": 1611208667.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "Lol you don’t even make sense. Wed workers? Just please stop.",
                                                                            "author": "Fun_Focus8159",
                                                                            "id": "gk19tfg",
                                                                            "parent_id": "t1_gk19qnu",
                                                                            "score": 0,
                                                                            "created_utc": 1611208723.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I am your age and have a stable long term relationship. You seem to brag about multiple teen girls every time you post . Seems like you’re a John . Fucking women off SA randomly is ho behavior . Wear a condom please Johnny boy . Sex work sub Reddit’s are easy to find . Go post on there. Not shaming you",
            "author": "Disastrous_Author638",
            "id": "gk18t4x",
            "parent_id": "t1_gk18iko",
            "score": 8,
            "created_utc": 1611207992.0,
            "replies": [
                {
                    "body": "The escorts lovingly pass this creep back to you guys. They don’t want him either lol",
                    "author": "MsDReid",
                    "id": "gk1jlku",
                    "parent_id": "t1_gk18t4x",
                    "score": 7,
                    "created_utc": 1611217245.0,
                    "replies": []
                },
                {
                    "body": "Ah yep, too old for me. I don’t date women my age. Too many issues and baggage.",
                    "author": "Fun_Focus8159",
                    "id": "gk18v1t",
                    "parent_id": "t1_gk18t4x",
                    "score": 1,
                    "created_utc": 1611208030.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "gk18yov",
                            "parent_id": "t1_gk18v1t",
                            "score": 2,
                            "created_utc": 1611208102.0,
                            "replies": [
                                {
                                    "body": "Lol please stop responding to me. You sound like an escort. Sorry, not my style.",
                                    "author": "Fun_Focus8159",
                                    "id": "gk198ej",
                                    "parent_id": "t1_gk18yov",
                                    "score": 0,
                                    "created_utc": 1611208299.0,
                                    "replies": [
                                        {
                                            "body": "Please stop 🛑 Johnny boy! I’m not a barely legal teen who knows nothing and needs to sleep with you to get a Sephora shopping spree . Ugh young men who need escorts are kind of odd. I’m not your property and will never do what you say Z go on and manipulate teens .",
                                            "author": "Disastrous_Author638",
                                            "id": "gk19ht3",
                                            "parent_id": "t1_gk198ej",
                                            "score": 5,
                                            "created_utc": 1611208489.0,
                                            "replies": [
                                                {
                                                    "body": "Lol oh you got me! 😉",
                                                    "author": "Fun_Focus8159",
                                                    "id": "gk19mmn",
                                                    "parent_id": "t1_gk19ht3",
                                                    "score": 0,
                                                    "created_utc": 1611208585.0,
                                                    "replies": [
                                                        {
                                                            "body": "Stop responding. I don’t want men who solicit sex workers to be associated with my profile . You’re bad news",
                                                            "author": "Disastrous_Author638",
                                                            "id": "gk19qnu",
                                                            "parent_id": "t1_gk19mmn",
                                                            "score": 5,
                                                            "created_utc": 1611208667.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Lol you don’t even make sense. Wed workers? Just please stop.",
                                                                    "author": "Fun_Focus8159",
                                                                    "id": "gk19tfg",
                                                                    "parent_id": "t1_gk19qnu",
                                                                    "score": 0,
                                                                    "created_utc": 1611208723.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "The escorts lovingly pass this creep back to you guys. They don’t want him either lol",
            "author": "MsDReid",
            "id": "gk1jlku",
            "parent_id": "t1_gk18t4x",
            "score": 7,
            "created_utc": 1611217245.0,
            "replies": []
        },
        {
            "body": "Ah yep, too old for me. I don’t date women my age. Too many issues and baggage.",
            "author": "Fun_Focus8159",
            "id": "gk18v1t",
            "parent_id": "t1_gk18t4x",
            "score": 1,
            "created_utc": 1611208030.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "gk18yov",
                    "parent_id": "t1_gk18v1t",
                    "score": 2,
                    "created_utc": 1611208102.0,
                    "replies": [
                        {
                            "body": "Lol please stop responding to me. You sound like an escort. Sorry, not my style.",
                            "author": "Fun_Focus8159",
                            "id": "gk198ej",
                            "parent_id": "t1_gk18yov",
                            "score": 0,
                            "created_utc": 1611208299.0,
                            "replies": [
                                {
                                    "body": "Please stop 🛑 Johnny boy! I’m not a barely legal teen who knows nothing and needs to sleep with you to get a Sephora shopping spree . Ugh young men who need escorts are kind of odd. I’m not your property and will never do what you say Z go on and manipulate teens .",
                                    "author": "Disastrous_Author638",
                                    "id": "gk19ht3",
                                    "parent_id": "t1_gk198ej",
                                    "score": 5,
                                    "created_utc": 1611208489.0,
                                    "replies": [
                                        {
                                            "body": "Lol oh you got me! 😉",
                                            "author": "Fun_Focus8159",
                                            "id": "gk19mmn",
                                            "parent_id": "t1_gk19ht3",
                                            "score": 0,
                                            "created_utc": 1611208585.0,
                                            "replies": [
                                                {
                                                    "body": "Stop responding. I don’t want men who solicit sex workers to be associated with my profile . You’re bad news",
                                                    "author": "Disastrous_Author638",
                                                    "id": "gk19qnu",
                                                    "parent_id": "t1_gk19mmn",
                                                    "score": 5,
                                                    "created_utc": 1611208667.0,
                                                    "replies": [
                                                        {
                                                            "body": "Lol you don’t even make sense. Wed workers? Just please stop.",
                                                            "author": "Fun_Focus8159",
                                                            "id": "gk19tfg",
                                                            "parent_id": "t1_gk19qnu",
                                                            "score": 0,
                                                            "created_utc": 1611208723.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gk18yov",
            "parent_id": "t1_gk18v1t",
            "score": 2,
            "created_utc": 1611208102.0,
            "replies": [
                {
                    "body": "Lol please stop responding to me. You sound like an escort. Sorry, not my style.",
                    "author": "Fun_Focus8159",
                    "id": "gk198ej",
                    "parent_id": "t1_gk18yov",
                    "score": 0,
                    "created_utc": 1611208299.0,
                    "replies": [
                        {
                            "body": "Please stop 🛑 Johnny boy! I’m not a barely legal teen who knows nothing and needs to sleep with you to get a Sephora shopping spree . Ugh young men who need escorts are kind of odd. I’m not your property and will never do what you say Z go on and manipulate teens .",
                            "author": "Disastrous_Author638",
                            "id": "gk19ht3",
                            "parent_id": "t1_gk198ej",
                            "score": 5,
                            "created_utc": 1611208489.0,
                            "replies": [
                                {
                                    "body": "Lol oh you got me! 😉",
                                    "author": "Fun_Focus8159",
                                    "id": "gk19mmn",
                                    "parent_id": "t1_gk19ht3",
                                    "score": 0,
                                    "created_utc": 1611208585.0,
                                    "replies": [
                                        {
                                            "body": "Stop responding. I don’t want men who solicit sex workers to be associated with my profile . You’re bad news",
                                            "author": "Disastrous_Author638",
                                            "id": "gk19qnu",
                                            "parent_id": "t1_gk19mmn",
                                            "score": 5,
                                            "created_utc": 1611208667.0,
                                            "replies": [
                                                {
                                                    "body": "Lol you don’t even make sense. Wed workers? Just please stop.",
                                                    "author": "Fun_Focus8159",
                                                    "id": "gk19tfg",
                                                    "parent_id": "t1_gk19qnu",
                                                    "score": 0,
                                                    "created_utc": 1611208723.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Lol please stop responding to me. You sound like an escort. Sorry, not my style.",
            "author": "Fun_Focus8159",
            "id": "gk198ej",
            "parent_id": "t1_gk18yov",
            "score": 0,
            "created_utc": 1611208299.0,
            "replies": [
                {
                    "body": "Please stop 🛑 Johnny boy! I’m not a barely legal teen who knows nothing and needs to sleep with you to get a Sephora shopping spree . Ugh young men who need escorts are kind of odd. I’m not your property and will never do what you say Z go on and manipulate teens .",
                    "author": "Disastrous_Author638",
                    "id": "gk19ht3",
                    "parent_id": "t1_gk198ej",
                    "score": 5,
                    "created_utc": 1611208489.0,
                    "replies": [
                        {
                            "body": "Lol oh you got me! 😉",
                            "author": "Fun_Focus8159",
                            "id": "gk19mmn",
                            "parent_id": "t1_gk19ht3",
                            "score": 0,
                            "created_utc": 1611208585.0,
                            "replies": [
                                {
                                    "body": "Stop responding. I don’t want men who solicit sex workers to be associated with my profile . You’re bad news",
                                    "author": "Disastrous_Author638",
                                    "id": "gk19qnu",
                                    "parent_id": "t1_gk19mmn",
                                    "score": 5,
                                    "created_utc": 1611208667.0,
                                    "replies": [
                                        {
                                            "body": "Lol you don’t even make sense. Wed workers? Just please stop.",
                                            "author": "Fun_Focus8159",
                                            "id": "gk19tfg",
                                            "parent_id": "t1_gk19qnu",
                                            "score": 0,
                                            "created_utc": 1611208723.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Please stop 🛑 Johnny boy! I’m not a barely legal teen who knows nothing and needs to sleep with you to get a Sephora shopping spree . Ugh young men who need escorts are kind of odd. I’m not your property and will never do what you say Z go on and manipulate teens .",
            "author": "Disastrous_Author638",
            "id": "gk19ht3",
            "parent_id": "t1_gk198ej",
            "score": 5,
            "created_utc": 1611208489.0,
            "replies": [
                {
                    "body": "Lol oh you got me! 😉",
                    "author": "Fun_Focus8159",
                    "id": "gk19mmn",
                    "parent_id": "t1_gk19ht3",
                    "score": 0,
                    "created_utc": 1611208585.0,
                    "replies": [
                        {
                            "body": "Stop responding. I don’t want men who solicit sex workers to be associated with my profile . You’re bad news",
                            "author": "Disastrous_Author638",
                            "id": "gk19qnu",
                            "parent_id": "t1_gk19mmn",
                            "score": 5,
                            "created_utc": 1611208667.0,
                            "replies": [
                                {
                                    "body": "Lol you don’t even make sense. Wed workers? Just please stop.",
                                    "author": "Fun_Focus8159",
                                    "id": "gk19tfg",
                                    "parent_id": "t1_gk19qnu",
                                    "score": 0,
                                    "created_utc": 1611208723.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Lol oh you got me! 😉",
            "author": "Fun_Focus8159",
            "id": "gk19mmn",
            "parent_id": "t1_gk19ht3",
            "score": 0,
            "created_utc": 1611208585.0,
            "replies": [
                {
                    "body": "Stop responding. I don’t want men who solicit sex workers to be associated with my profile . You’re bad news",
                    "author": "Disastrous_Author638",
                    "id": "gk19qnu",
                    "parent_id": "t1_gk19mmn",
                    "score": 5,
                    "created_utc": 1611208667.0,
                    "replies": [
                        {
                            "body": "Lol you don’t even make sense. Wed workers? Just please stop.",
                            "author": "Fun_Focus8159",
                            "id": "gk19tfg",
                            "parent_id": "t1_gk19qnu",
                            "score": 0,
                            "created_utc": 1611208723.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Stop responding. I don’t want men who solicit sex workers to be associated with my profile . You’re bad news",
            "author": "Disastrous_Author638",
            "id": "gk19qnu",
            "parent_id": "t1_gk19mmn",
            "score": 5,
            "created_utc": 1611208667.0,
            "replies": [
                {
                    "body": "Lol you don’t even make sense. Wed workers? Just please stop.",
                    "author": "Fun_Focus8159",
                    "id": "gk19tfg",
                    "parent_id": "t1_gk19qnu",
                    "score": 0,
                    "created_utc": 1611208723.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Lol you don’t even make sense. Wed workers? Just please stop.",
            "author": "Fun_Focus8159",
            "id": "gk19tfg",
            "parent_id": "t1_gk19qnu",
            "score": 0,
            "created_utc": 1611208723.0,
            "replies": []
        }
    ]
}