{
    "title": "This is how you lose your SB real quick",
    "post_id": "vnwl5u",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/vnwl5u/this_is_how_you_lose_your_sb_real_quick/",
    "author": "Iooklike_my_pictures",
    "body": "Some SDs believe that if they spoil too much their SB, they might leave once they get what they want. WRONG! Spoiling is a way of showing that you value your SB and you appreciate her. Devaluing her is the quickest way to lose her and she will definitely replace you to someone better. Women are easy. Treat us right and we will treat you better.\nI really hate this kind of mindset of an SD! Like sir, you are missing out.\n\nEdit 1: some “SDs” got butthurt. Peace y’all\n\nEdit 2: Spoiling does NOT necessarily mean luxury!!! Spoiling can be done through wisdom, knowledge, replying fast, your time and yes it can be paying for nails or a little gift that reminds of your SB. Stop talking with your stingy a**",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/vnwl5u/this_is_how_you_lose_your_sb_real_quick/",
    "score": 199,
    "upvote_ratio": 0.8,
    "created_utc": 1656554349.0,
    "num_comments": 186,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "Do you think luxury creep doesnt apply to relationships?  If I like the marriot and start staying at the four seasons the marriot will start to suck.  Anything we do becomes the new normal.  Escalation gets us very fleeting delight.\n\nMy whole life is based around this principle - I live in my 3rd nicest property that I own outright.",
            "author": "JDMultralight",
            "id": "iebqbbm",
            "parent_id": "t3_vnwl5u",
            "score": 15,
            "created_utc": 1656601052.0,
            "replies": [
                {
                    "body": "Getting to choose between varying modes of privilege and luxury must be nice. You must be slumming it in that starter home.",
                    "author": "Rivergirl2878",
                    "id": "igedrb9",
                    "parent_id": "t1_iebqbbm",
                    "score": 4,
                    "created_utc": 1657982288.0,
                    "replies": [
                        {
                            "body": "You know it’s less slumming it and more that Im incredibly attached to the little townhouse with my section 8 family next door because Ive lived here my whole adult life - and watched the kids grow into college-age (theyre so cute).",
                            "author": "JDMultralight",
                            "id": "ighkc94",
                            "parent_id": "t1_igedrb9",
                            "score": 1,
                            "created_utc": 1658037227.0,
                            "replies": [
                                {
                                    "body": "The self-awareness to live a simpler life and appreciate the simple joy of liking your neighbors is a path to happiness.",
                                    "author": "SantaBSB",
                                    "id": "ign44ac",
                                    "parent_id": "t1_ighkc94",
                                    "score": 3,
                                    "created_utc": 1658151989.0,
                                    "replies": [
                                        {
                                            "body": "Thats such a sweet thing to say!  Really nice to hear\n\nSome of the people close to me think my approach to life is weirdly an egotistical flourish - like Im trying to be special or put on a costume to look interesting.  Its nice to hear positive feedback",
                                            "author": "JDMultralight",
                                            "id": "igo7a75",
                                            "parent_id": "t1_ign44ac",
                                            "score": 2,
                                            "created_utc": 1658167885.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "That does sound nice. It’s cool that you’re so close with your neighbors. Sorry if I came off rude.",
                                    "author": "Rivergirl2878",
                                    "id": "jcbe3cy",
                                    "parent_id": "t1_ighkc94",
                                    "score": 1,
                                    "created_utc": 1678899799.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "All the SBs I spoiled without limits ended up undervaluing me. Start small and increase if she is good with me, that's what has been working for me.",
            "author": "TonyGTO",
            "id": "ie9zfos",
            "parent_id": "t3_vnwl5u",
            "score": 63,
            "created_utc": 1656561355.0,
            "replies": [
                {
                    "body": "I agree with the smart small then amp it up as time flows. Plus, it is also about what your SB and you value. Is it things or experiences or cash.\n\nI think there are no ground rules here besides being kind, respectful and generous BUT not stupid and foolish and get taken advantage of or display yourself as an ATM who can be screwed over in a big way and taken for granted. \n\nI think SD's who are in long standing SR's know very well how to balance those two aspects. Regardless in the end SD's can only control so much because SB's will do what they want to do. Some will screw over SD's even if he is nice and generous and some will stay loyal. \n\nLike I said they only ground rules are to stay kind and generous without being stupid, foolish or getting taken advantage of.",
                    "author": null,
                    "id": "iebbzvi",
                    "parent_id": "t1_ie9zfos",
                    "score": 9,
                    "created_utc": 1656594862.0,
                    "replies": []
                },
                {
                    "body": "Investing in the right person who isn’t a “user” is important for both SBs and SDs.",
                    "author": null,
                    "id": "iebz61e",
                    "parent_id": "t1_ie9zfos",
                    "score": 5,
                    "created_utc": 1656604590.0,
                    "replies": []
                },
                {
                    "body": "Hmm any chance you're still looking for sb??",
                    "author": "Sweetie_Avee",
                    "id": "ieavhyq",
                    "parent_id": "t1_ie9zfos",
                    "score": -2,
                    "created_utc": 1656585106.0,
                    "replies": [
                        {
                            "body": ";]",
                            "author": "malcolm_reyn0lds",
                            "id": "ieaxiut",
                            "parent_id": "t1_ieavhyq",
                            "score": -1,
                            "created_utc": 1656586603.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I’m pretty sure many SDs can say the same for their SBs. If you find a good sugar partner, don’t take them for granted. Treat them well and be fair.",
            "author": "Foreign-Concern436",
            "id": "iea5uoe",
            "parent_id": "t3_vnwl5u",
            "score": 23,
            "created_utc": 1656565163.0,
            "replies": [
                {
                    "body": "Agree. I always hold back to positively reinforce.",
                    "author": "GlucoseGuardians",
                    "id": "iec4n7j",
                    "parent_id": "t1_iea5uoe",
                    "score": 1,
                    "created_utc": 1656606734.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "It's a two way street. Once I feel unappreciated I'm a vapor trail.",
            "author": "SD1070",
            "id": "ieb2mfk",
            "parent_id": "t3_vnwl5u",
            "score": 32,
            "created_utc": 1656589889.0,
            "replies": [
                {
                    "body": "You and me both.",
                    "author": null,
                    "id": "iedqk85",
                    "parent_id": "t1_ieb2mfk",
                    "score": 3,
                    "created_utc": 1656629704.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Ironically, it seems in my case the more I gave the less they would treat me right. Then act surprised when I leave. I've only had one exception to this experience, and it is with the GF. I spoil her, but she is appreciative and grateful, and doesn't ask for much... which means I want to spoil more. It's like a catch 22. But in the past I truly helped SBs and SGFs out, and over time they expected the above and beyond, while they grew more distant/ bitchy / less appreciative etc...",
            "author": "BigBearSD",
            "id": "ie9n8dq",
            "parent_id": "t3_vnwl5u",
            "score": 51,
            "created_utc": 1656555071.0,
            "replies": [
                {
                    "body": "My recently separated SB kept asking for more the more I gave her.  \n\nExcessive generosity at the beginning isn't always smart.....IME.",
                    "author": "Pitkin_SD",
                    "id": "ie9uwn6",
                    "parent_id": "t1_ie9n8dq",
                    "score": 20,
                    "created_utc": 1656558904.0,
                    "replies": []
                },
                {
                    "body": "90% of the time, you are right! In general, the more generous outside allowance I am, 2 things or both happen:\n\n1. She keeps asking for more and more to a point that when we meet, I spend more time thinking about what she would ask for next. \n2. She give less and less thinking that I am in love (which I am not, just appreciative of her).",
                    "author": "SD_AU",
                    "id": "iea4zy7",
                    "parent_id": "t1_ie9n8dq",
                    "score": 16,
                    "created_utc": 1656564617.0,
                    "replies": []
                },
                {
                    "body": ">the more I gave the less they would treat me right.\n\nI'd like to believe I'm not like this, but when I look around my friends, co-workers, etc - this \\^ is what I see, not the OP's comments:\n\n>Treat us right and we will treat you better.\n\nThe better women I know get treated, the worse they treat the guy. I am talking about friends that are (afaik) in vanilla, not sugar, relationships.",
                    "author": "NoLimitLexa",
                    "id": "ie9oz0j",
                    "parent_id": "t1_ie9n8dq",
                    "score": 24,
                    "created_utc": 1656555912.0,
                    "replies": [
                        {
                            "body": "Women are attracted to dominant men, not people pleasers. An unfortunate reality for the nice guys out there.",
                            "author": "SDinAsia",
                            "id": "ie9xi7b",
                            "parent_id": "t1_ie9oz0j",
                            "score": 6,
                            "created_utc": 1656560290.0,
                            "replies": [
                                {
                                    "body": "The implication that dominance and kindness can’t coexist is odd. Also, women are attracted to a variety of men, women, and non-binary people, and a whole spectrum of personalities. Personally, I prefer emotionally intelligent guys, regardless of “dominance.” I’m also attracted to *gasp* submissive men.",
                                    "author": "KetoSeaweed",
                                    "id": "ieivub4",
                                    "parent_id": "t1_ie9xi7b",
                                    "score": 6,
                                    "created_utc": 1656724071.0,
                                    "replies": []
                                },
                                {
                                    "body": "Better way to say that there are lots of things about dominant men that are attractive.  But if you actually go through the relationships in your whole extended friend group what you’ll find is that literally every kind of strength is thoroughly rewarded.\n\nNice guys do really well.  I don’t mean “nice guys” - Which means guys who dont know how to ever be assertive, and who women burden in subtle ways.\n\nAs far as the dominance relation between the man and woman, not letting her push you around is pretty much all you have to do.  That said, there are so many super hot women who marry guys and push them around or have a strong tendency to date guys they can push around.",
                                    "author": "JDMultralight",
                                    "id": "iebov62",
                                    "parent_id": "t1_ie9xi7b",
                                    "score": 3,
                                    "created_utc": 1656600472.0,
                                    "replies": []
                                },
                                {
                                    "body": "Some, not all. I’ve found plenty of exceptions.",
                                    "author": null,
                                    "id": "iea8r2c",
                                    "parent_id": "t1_ie9xi7b",
                                    "score": 1,
                                    "created_utc": 1656567072.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Same  experience tbh.",
                    "author": "thereadinessisall",
                    "id": "ie9otla",
                    "parent_id": "t1_ie9n8dq",
                    "score": 13,
                    "created_utc": 1656555838.0,
                    "replies": []
                },
                {
                    "body": "We always chase after what we don't have. It's that simple. I learned it the hard way. Keep it simple and fair then you are alright. That moment you slip and go full throttle then you will lose her fast.",
                    "author": "Orange_Overlord",
                    "id": "iee4skj",
                    "parent_id": "t1_ie9n8dq",
                    "score": 2,
                    "created_utc": 1656636211.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I treated my SB right and she lied and made excuses to make time for me. I never stopped giving her an allowance and gifts. I had to snoop to find the truth and when I didn't believe her obviously bs she got mad at me and ended it. Even though there was a lot she agreed to make up to me for. But I'm glad it happened bc I found a new SB who appreciates me more than I could hope for.",
            "author": "KanyeAsada420Grower",
            "id": "ie9qepo",
            "parent_id": "t3_vnwl5u",
            "score": 24,
            "created_utc": 1656556619.0,
            "replies": [
                {
                    "body": "not trying to invalidate here, but as a SB who has had SDs/boyfriends snoop through my stuff - once you start to doubt things just trust your gut and leave instead of trying to prove a point by snooping for evidence. even if she is lying it doesn’t give you the right to invade her personal privacy just to be able to prove that you’re right. it’s super invasive and disrespectful, not to mention unhealthy. just something to consider. sorry that you had a bad experience with a BS-er though, not fair to you either.",
                    "author": "dumpst3rj3di",
                    "id": "iedgfo8",
                    "parent_id": "t1_ie9qepo",
                    "score": 7,
                    "created_utc": 1656625509.0,
                    "replies": [
                        {
                            "body": "I totally agree with you. The first time it happen it should've been enough for me to end it. It was just tough. Her father had passed and when I tried leaving she guilt tripped me by saying all the guys in her life either die or leave her. She was very manipulative and we had history. 2.5 year relationship. I should've left when I wasn't getting what I expected.",
                            "author": "KanyeAsada420Grower",
                            "id": "iedhe24",
                            "parent_id": "t1_iedgfo8",
                            "score": 2,
                            "created_utc": 1656625898.0,
                            "replies": [
                                {
                                    "body": "yikes! i’m so sorry you had to deal with that. some SBs just are not emotionally healthy enough for relationships at all, let alone sugar dating and it winds up negatively impacting their partners and leaves everyone with a bad taste. live and learn though, none of us are perfect and i know from experience that it takes time to learn how to stop ignoring red flags early on lol",
                                    "author": "dumpst3rj3di",
                                    "id": "iedip6f",
                                    "parent_id": "t1_iedhe24",
                                    "score": 2,
                                    "created_utc": 1656626434.0,
                                    "replies": [
                                        {
                                            "body": "Appreciate it. I totally agree with you 💯 thanks for your comments and insight. I feel like I hit the lotto with my current sb. She's amazing and we have great chemistry. She has a heart or gold",
                                            "author": "KanyeAsada420Grower",
                                            "id": "iedjpjd",
                                            "parent_id": "t1_iedip6f",
                                            "score": 2,
                                            "created_utc": 1656626833.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "It hurt finding out that she would tell the truth to complete strangers on tiktok live, but couldn't be honest with me. I should've cut her off sooner.",
                            "author": "KanyeAsada420Grower",
                            "id": "iedk264",
                            "parent_id": "t1_iedgfo8",
                            "score": 1,
                            "created_utc": 1656626976.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "So do you treat your new SB right and provide allowance and gifts?",
                    "author": null,
                    "id": "iea1o4s",
                    "parent_id": "t1_ie9qepo",
                    "score": 5,
                    "created_utc": 1656562599.0,
                    "replies": [
                        {
                            "body": "We are starting out on a PPM then once I trust her ill provide her an allowance. We talk everyday. And yes providing gifts.",
                            "author": "KanyeAsada420Grower",
                            "id": "iea23te",
                            "parent_id": "t1_iea1o4s",
                            "score": 5,
                            "created_utc": 1656562856.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I personally am not looking for anything beyond allowance, I just want consistency, kindness, respect, and someone who is chill and fun to be around. I don't need/want gifts.",
            "author": null,
            "id": "ie9mvx1",
            "parent_id": "t3_vnwl5u",
            "score": 32,
            "created_utc": 1656554906.0,
            "replies": [
                {
                    "body": "So seek vanilla dating because you’re honestly warping the bowl for the rest of us. “Sbs” like this are why I get offered 2 hundos for penetration in their car. Yeah, no thank you sir. You talk about all this money you get and this is your offer to me and others? Erm. Hard pass. Problem with you girlie is you’re legit seeking vanilla relationship and the sds don’t have the time or desire to give what you want. They’d prefer the lowball ppm and end it after several meet ups.\n\nAll they see in what you want is free. In the end you’ll have wasted time and nothing to show for it. But hey, at least they’re upvoting you haha.\n\nEdit: My bad haha, definitely read it as you don’t want an allowance. Now I’m seeing you most definitely want an allowance. Make sure to know your worth and don’t take these crap offers so many are offering 2022.",
                    "author": "Whoisthatgirlleah",
                    "id": "ieo8sov",
                    "parent_id": "t1_ie9mvx1",
                    "score": 3,
                    "created_utc": 1656833615.0,
                    "replies": []
                },
                {
                    "body": "You are just the type I go for! And often find! Some women in this lifestyle only see the money (as some guys only see the sex) but for those of us who want a connection and a relationship (of some kind) it’s different. Kindness, humour, intellect, shared interests etc become as important as the money/sex. Sometimes more important.",
                    "author": null,
                    "id": "iea92dy",
                    "parent_id": "t1_ie9mvx1",
                    "score": 7,
                    "created_utc": 1656567283.0,
                    "replies": []
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "ie9zwur",
                    "parent_id": "t1_ie9mvx1",
                    "score": -5,
                    "created_utc": 1656561622.0,
                    "replies": [
                        {
                            "body": "She said ‘anything beyond allowance’.",
                            "author": null,
                            "id": "iea7ic3",
                            "parent_id": "t1_ie9zwur",
                            "score": 5,
                            "created_utc": 1656566244.0,
                            "replies": []
                        },
                        {
                            "body": "How do you figure?",
                            "author": null,
                            "id": "iea0lq2",
                            "parent_id": "t1_ie9zwur",
                            "score": 2,
                            "created_utc": 1656562014.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "iea3ci8",
                                    "parent_id": "t1_iea0lq2",
                                    "score": -7,
                                    "created_utc": 1656563605.0,
                                    "replies": [
                                        {
                                            "body": "Right... Which is what I said in my comment.",
                                            "author": null,
                                            "id": "iea3ebx",
                                            "parent_id": "t1_iea3ci8",
                                            "score": 11,
                                            "created_utc": 1656563636.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "That's called a Sugar BoyFriend (SBF) and it's pretty normal.  All of my SRs have been this way.",
                            "author": "SD1971",
                            "id": "ieas0mc",
                            "parent_id": "t1_ie9zwur",
                            "score": 2,
                            "created_utc": 1656582346.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Most SB's I meet are exactly like you but it is rare to see those types on SLF.",
                    "author": null,
                    "id": "iebceeu",
                    "parent_id": "t1_ie9mvx1",
                    "score": 1,
                    "created_utc": 1656595057.0,
                    "replies": [
                        {
                            "body": "Exactly brother - I feel like im living in an alternate universe on SLF.\n\nI’ve literally never met one IRL who expects gifts, i dont sell going out for luxury lifestyle stuff at all (just basically tell them we wont roll super cheap - like if we go out we can do whatever you want - but Im mostly an outdoor/home guy). \n\nI offer an above-average PPM and foreground a few of my advantages (low demands about time and extracurricular contact unless it progresses, understanding of boundaries, previous experiences that went well).\n\nI have never been refused an MG based on that.",
                            "author": "JDMultralight",
                            "id": "ieliku4",
                            "parent_id": "t1_iebceeu",
                            "score": 1,
                            "created_utc": 1656781790.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "By this logic, CEOs, professional athletes and movie stars work much harder than construction workers, prosecutors, and baristas.  I think this is much more likely to be individualistic in nature and not a useful general rule.",
            "author": "TastySpermDispenser",
            "id": "ie9uu8y",
            "parent_id": "t3_vnwl5u",
            "score": 10,
            "created_utc": 1656558869.0,
            "replies": [
                {
                    "body": "I think you’re ultimately right but I think CEOS Athletes and movie stars are on the extreme end of hard workers.\n\nOnly tangentially related but there was some surprising sociological work done on contemporary elite families in NYC and the researcher found that the overwhelming trend in these families - if you measure the amount of time spending doing work-like things they’re through the fucking roof.  She described it as a “cult of work”.",
                    "author": "JDMultralight",
                    "id": "ieljuuq",
                    "parent_id": "t1_ie9uu8y",
                    "score": 2,
                    "created_utc": 1656782344.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Sounds like someone is just entering the bowl",
            "author": "ricemom999",
            "id": "ie9z0ni",
            "parent_id": "t3_vnwl5u",
            "score": 9,
            "created_utc": 1656561120.0,
            "replies": []
        },
        {
            "body": "Not everybody has the same viewpoint of what spoiling is.we all don't fit in that box. For me I would be appauled if he spent thousands on a purse.Id view spoiling as sit down I'm going to give you some money and let me show you some good investments to put it in and why. Or my dream date a vanilla milkshake and a bookstore!I would lose my mind lol. I think you should know your value of what you want and need but there's a difference between that and just draining somebody. There's joy in giving as well. So I will try to do little things as acts of giving..it makes me feel good and honestly it makes your partner feel good and in the end both end up putting in more. And if he doesn't ...well then you don't have to stay; but you can walk away knowing you were damn good to him and for him and he'll know it to.he can't say you were just using him. There's no give without take its a full circle. Know your worth to not accept less and walk away when needed.  but be so fierce that you can give in world of take.",
            "author": "fleurdelunaholistics",
            "id": "ie9tdkg",
            "parent_id": "t3_vnwl5u",
            "score": 16,
            "created_utc": 1656558115.0,
            "replies": [
                {
                    "body": "Bookstore 📚!? Nice! Wish I could spoil a SB in a bookstore or at least buy off her Amazon wish-list of selected books.",
                    "author": "genericMaker",
                    "id": "iec2qfj",
                    "parent_id": "t1_ie9tdkg",
                    "score": 4,
                    "created_utc": 1656605989.0,
                    "replies": []
                },
                {
                    "body": "Thank you. People are so absolutist in their thinking these days. Not everything has to be uniform; there is a lot of nuance to life, culture, humans, etc.",
                    "author": "TimeIsFractal",
                    "id": "iea7bpv",
                    "parent_id": "t1_ie9tdkg",
                    "score": 6,
                    "created_utc": 1656566122.0,
                    "replies": [
                        {
                            "body": "Exactly. I had a SD who loved that I played violin so on our first date he brought me tickets to an amazing orchestra. Something that I used to love to do outside of playing. It hands down was one of the best gifts I received and we went together. Not to costly for him but the consideration and attention to my likes and the effort and the childhood memories that act simply did was huge to me. So to me spoiling goes outside of designers . Getting spoiled emotionally and mentally is vital and sometimes can be better. Lol",
                            "author": "fleurdelunaholistics",
                            "id": "iea8r0o",
                            "parent_id": "t1_iea7bpv",
                            "score": 6,
                            "created_utc": 1656567071.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "She never talked about a 4-5 figure purse but about going beyond the allowance. The man you're describing is definitely spoiling you and he is above the average SD here",
                    "author": "WiseRequirement9277",
                    "id": "iebkazk",
                    "parent_id": "t1_ie9tdkg",
                    "score": 3,
                    "created_utc": 1656598586.0,
                    "replies": [
                        {
                            "body": "You might want to reread what I said. I don't accept 4 figure purses. What I was saying was alot of sbs in general feel that extravagant gifts and 5 star trips and extra money  is the preferred way of spoiling.",
                            "author": "fleurdelunaholistics",
                            "id": "iebm3l2",
                            "parent_id": "t1_iebkazk",
                            "score": 0,
                            "created_utc": 1656599334.0,
                            "replies": [
                                {
                                    "body": "Because that's their preferred one. Yours is investment. Both are valid and still spoiling",
                                    "author": "WiseRequirement9277",
                                    "id": "iebnb42",
                                    "parent_id": "t1_iebm3l2",
                                    "score": 4,
                                    "created_utc": 1656599836.0,
                                    "replies": []
                                },
                                {
                                    "body": "I think you’re getting confused. This post isn’t about how to spoil, just that it should happen. Yours is happening. It’s not to argue the type of spoiling, just the existence. :)",
                                    "author": "Cdnsugarr",
                                    "id": "iebr9ma",
                                    "parent_id": "t1_iebm3l2",
                                    "score": 3,
                                    "created_utc": 1656601439.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I agree to an extent, but disagree if taken to the nth degree. Like everything in life, there is a happy medium. There is an inflection point, which differs for every SB, where giving any more increases her sense of entitlement and emboldens an anything goes attitude where she feels she has too much power, and giving less causes her to look elsewhere for a new relationship.\n\nRichard Kipling's IF poem, a particular favorite of mine, seems particularly apt for how to think about this. Maybe he just forgot the last few lines, which probably went something like this:\n\nIF you can help your SB with her car payment on top of her allowance, and not have her feel emboldened to ask for a new car for her best friend.\nIF you can pay for your SB's child's emergency appendectomy, but she not ask for a boob job for all her friends.\nIF you can assist your SB with airfare to see her dying mother, and avoid taking advantage of her by requesting a BJ on the way to the airport.\nIF you can help your SB with her must haves, but avoid being a POS SIMP.\nThen yours is the earth my friend and the SR will last longer than your last one, or until she gets sick of you old hairy ass.\nTHE END",
            "author": "patienceisavirtue5",
            "id": "iea59cd",
            "parent_id": "t3_vnwl5u",
            "score": 9,
            "created_utc": 1656564780.0,
            "replies": [
                {
                    "body": "Rudyard, sorry had to.",
                    "author": "sparky_SD16",
                    "id": "ieb4xgg",
                    "parent_id": "t1_iea59cd",
                    "score": 1,
                    "created_utc": 1656591227.0,
                    "replies": [
                        {
                            "body": "Thanks, inadvertantly added to the humor maybe?😂",
                            "author": "patienceisavirtue5",
                            "id": "iebd6sl",
                            "parent_id": "t1_ieb4xgg",
                            "score": 1,
                            "created_utc": 1656595432.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Brilliant!",
                    "author": "Stickley1",
                    "id": "iecb1mi",
                    "parent_id": "t1_iea59cd",
                    "score": 1,
                    "created_utc": 1656609250.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "The thing with sbs is you give an inch and they take the mile,I prefer to to spoil in a consistent manner,the best sbs i ever had are the ones who are to busy to get a job,so im their only source of income therefore negotiation doesn’t become a threat",
            "author": "MundaneRecognition2",
            "id": "iea0myz",
            "parent_id": "t3_vnwl5u",
            "score": 4,
            "created_utc": 1656562033.0,
            "replies": [
                {
                    "body": "Ew",
                    "author": "Stella_bby554",
                    "id": "iep7vxg",
                    "parent_id": "t1_iea0myz",
                    "score": 3,
                    "created_utc": 1656858548.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "\"Women are easy\"\n\nLol. If this was true I wouldnt be sugaring.",
            "author": "CanOfWoody",
            "id": "iea9jxz",
            "parent_id": "t3_vnwl5u",
            "score": 9,
            "created_utc": 1656567615.0,
            "replies": [
                {
                    "body": "Maybe the ugly ones, but no hot younger woman is easy",
                    "author": null,
                    "id": "ieaas8p",
                    "parent_id": "t1_iea9jxz",
                    "score": 5,
                    "created_utc": 1656568460.0,
                    "replies": []
                },
                {
                    "body": "Wait till you start considering relationships.  We’re not attuned to the same things they are so they get upset.  Makes sense when they verbalize whats going on but good fucking luck anticipating these things.  Women are a labyrinth of turn offs and hot buttons - men are impenetrable walls of stupid.",
                    "author": "JDMultralight",
                    "id": "iebpwwa",
                    "parent_id": "t1_iea9jxz",
                    "score": 2,
                    "created_utc": 1656600892.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "So, an SD not agreeing with your entitled nonsense means he is “butthurt”?\nYou are in need of a reality check",
            "author": "gapaf",
            "id": "ie9ro3h",
            "parent_id": "t3_vnwl5u",
            "score": 24,
            "created_utc": 1656557242.0,
            "replies": [
                {
                    "body": "Well said, guarantee the OP does not \"treat you better\" when \"spoiled right\".",
                    "author": "JohnnyKemmer009",
                    "id": "iecqri7",
                    "parent_id": "t1_ie9ro3h",
                    "score": 5,
                    "created_utc": 1656615463.0,
                    "replies": []
                },
                {
                    "body": "OP sounds like a mean person",
                    "author": "UnearthlyDinosaur",
                    "id": "iec8eaw",
                    "parent_id": "t1_ie9ro3h",
                    "score": 4,
                    "created_utc": 1656608200.0,
                    "replies": [
                        {
                            "body": "Correct. Have an upvote.",
                            "author": "JohnnyKemmer009",
                            "id": "iecqsi1",
                            "parent_id": "t1_iec8eaw",
                            "score": 1,
                            "created_utc": 1656615473.0,
                            "replies": []
                        },
                        {
                            "body": "Right, feeling entitled to basic respect is just so mean. How dare these women demand to be treated like human beings? \n\n/s",
                            "author": "oliviamc99",
                            "id": "iectfix",
                            "parent_id": "t1_iec8eaw",
                            "score": 1,
                            "created_utc": 1656616492.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I have a feeling you won’t find better but he will",
            "author": "RealisticSD",
            "id": "ie9tyn6",
            "parent_id": "t3_vnwl5u",
            "score": 21,
            "created_utc": 1656558411.0,
            "replies": [
                {
                    "body": "Lol , i had the exact same thought",
                    "author": "OCbird22",
                    "id": "iea01jw",
                    "parent_id": "t1_ie9tyn6",
                    "score": 5,
                    "created_utc": 1656561695.0,
                    "replies": []
                },
                {
                    "body": "It goes both ways",
                    "author": "Iooklike_my_pictures",
                    "id": "ieaft30",
                    "parent_id": "t1_ie9tyn6",
                    "score": -1,
                    "created_utc": 1656572189.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I adore spoiling my SB but there is a downside for me.  I have a need for affirmation and thrive under a reward system.  I’ve rarely had a SB actually go out of her way to show an enthusiastic thank you.  Doesn’t stop me trying but there’s a sadness when the spoiling is one-sided.  Ultimately the strength of the SR isn’t the treats as much as the consistency of support so I get past my “butthurt” and enjoy what we have",
            "author": "Alienrite",
            "id": "iebcwz2",
            "parent_id": "t3_vnwl5u",
            "score": 6,
            "created_utc": 1656595302.0,
            "replies": [
                {
                    "body": "Wait that’s so sad 🥲 hopefully one day you’ll find someone who is as enthusiastic as you are about her!",
                    "author": "Sugarcookie54321_",
                    "id": "iebe26j",
                    "parent_id": "t1_iebcwz2",
                    "score": 1,
                    "created_utc": 1656595840.0,
                    "replies": [
                        {
                            "body": "My SRs have all been long and enjoyable.  The spoiling discrepancy is something that while consistent doesn’t detract from the overall relationship.",
                            "author": "Alienrite",
                            "id": "iebeduc",
                            "parent_id": "t1_iebe26j",
                            "score": 1,
                            "created_utc": 1656595992.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Let her know how you feel.  My SD told me he doesn't want me thanking him for money.  He says he gives it to me because he wants to and doesn't want to be thanked.",
                    "author": "OldCommand4010",
                    "id": "iecl6rx",
                    "parent_id": "t1_iebcwz2",
                    "score": 1,
                    "created_utc": 1656613256.0,
                    "replies": [
                        {
                            "body": "I understand that dynamic…it’s nice to separate $ from the dating and mostly we don’t talk about the allowance except to acknowledge it’s been received.  \n\nI’m in a quandary about asking because then her spoiling me is not given but taken.   But relationships are only as good as the communication so I’ll work on finding a kind and appropriate way to speak about it.   \n\nThank you",
                            "author": "Alienrite",
                            "id": "iecuvnz",
                            "parent_id": "t1_iecl6rx",
                            "score": 1,
                            "created_utc": 1656617044.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "This sounds like a great soundbite, but doesn't hold up to 10 years of being a SD.\n\nNearly every time I went up in sugar or even when I start monthly up front allowance the dynamic changes.\n\nI become secondary to things that suddenly pop up. They are innocent, but they weren't there before.\n\nExperience says SDs should expect diminishing margins of return.\n\nMore means more flexibility and independence... which also means more things higher priority than me.",
            "author": "GlucoseGuardians",
            "id": "iec48o4",
            "parent_id": "t3_vnwl5u",
            "score": 6,
            "created_utc": 1656606576.0,
            "replies": []
        },
        {
            "body": "OP's probably not on the same track as the SB searching in my area that only wants a SD that will also get her a brand new car right off the bat, but I'm drawing parallels here when i read this.\n\n&#x200B;\n\nOP, what are you doing to go above and beyond?",
            "author": "jerdle",
            "id": "ie9o8gz",
            "parent_id": "t3_vnwl5u",
            "score": 6,
            "created_utc": 1656555552.0,
            "replies": [
                {
                    "body": "You know I hear this sometimes, and it's like... You guys are wanting to date women who you normally would not be able to date, without the financial part right? SO WHAT EXTRA ARE YOU WANTING FROM THEM BESIDES THE DATING WOMEN THAT YOU NORMALLY WOULD NOT BE ABLE TO DATE PARTS? They're DATING YOU, all things included of dating, when they normally WOULD NOT, because you are providing an allowance. \n\n&#x200B;\n\nAre we talking you need your car detailed, you want us to shine your shoes, organize your filing cabinet, sharpen all your pencils, cut the grass, plan out a meal calendar for the month? What above and beyond are we talking about here?",
                    "author": null,
                    "id": "ie9qcoh",
                    "parent_id": "t1_ie9o8gz",
                    "score": 12,
                    "created_utc": 1656556590.0,
                    "replies": [
                        {
                            "body": "What don't you get? The allowance covers everything under the dating umbrella. That is the point isn't it? If you feel like the allowance doesn't suffice for the gap in vanilla compatibility, then you've done a poor job at selecting him.\n\nIf you are expecting someone to provide you with extras such as a new car, then the question really is to ask yourself if you are making similar gestures. Are you going on overnights without expecting anything? Are you making extra time for him? Are you doing thoughtful gestures like cooking or baking randomly?\n\nThere are many ways to express yourself and to put in extra effort into being a good sugar partner without expecting sex or money in return. That is what we mean by it. If you are the type to only motivate yourself to make an effort when the allowance is at play, then you are unlikely to be the type someone wants to spoil above and beyond. \n\nTake that coming from someone who provides an allowance 4-5 times the area average and who provides experiences with vacations and high cost dates all the time. If you specifically want something outside the agreement that is enjoyable only to you personally, you need to make effort to do things that the other person finds enjoyable.",
                            "author": "YlangScent",
                            "id": "ieb07pa",
                            "parent_id": "t1_ie9qcoh",
                            "score": 3,
                            "created_utc": 1656588414.0,
                            "replies": [
                                {
                                    "body": "I don't get what more could be \"above and beyond\" besides the normal things in dating, which encompasses the things you've listed. I guess that is not typically happening for you guys in your experiences, but it is typical for me when I'm dating someone.",
                                    "author": null,
                                    "id": "ieb0mww",
                                    "parent_id": "t1_ieb07pa",
                                    "score": 2,
                                    "created_utc": 1656588687.0,
                                    "replies": [
                                        {
                                            "body": "The problem is that you are probably a good egg.\n\nBy nature of that, you don't quite understand how bad some of your peers are because you don't have to deal with them. \n\nI am lucky in the regard that I am fairly young and being with me apparently isn't that big of a stretch. But I still had to learn to really filter properly to find the women like you. \n\nThere are a whole bunch of 'SBs' out there who are simply on the clock and out to just drain you rather than to have you improve their life in a relationship style connection.\n\nThey feel entitled to your wealth and expect all of it without putting in any effort at all. I mean damn woman, I am giving you a 5 digit allowance and just paid for your tuition, yet you still want to 'charge' me for a lunch when you were near a conference I was attending?\n\nSome people are highly motivated by greed and just think that because you own something, they should constantly be leeching it. The entitlement is a turn off and it took me quite a while to accept that it is best to just hold off on generosity above and beyond till it becomes clear she is the same type of person.",
                                            "author": "YlangScent",
                                            "id": "ieb46e9",
                                            "parent_id": "t1_ieb0mww",
                                            "score": 3,
                                            "created_utc": 1656590798.0,
                                            "replies": [
                                                {
                                                    "body": "[removed]",
                                                    "author": null,
                                                    "id": "ieb5cy1",
                                                    "parent_id": "t1_ieb46e9",
                                                    "score": 1,
                                                    "created_utc": 1656591464.0,
                                                    "replies": [
                                                        {
                                                            "body": "I think that is a lot of effort from your side and to be honest not something I can understand not giving support for. It clearly cost you a bunch of cash for gas and the sitter at the very least.\n\nI can't speak to him as a person of course, but for the record, that isn't what I personally would consider above and beyond. This clearly cost you a tangible amount of money after all.\n\nAbove and beyond for me would be if you decided to write me a lovely note, craft me something or even bake me a cookie or whatever. It's the thought that counts.",
                                                            "author": "YlangScent",
                                                            "id": "iebcpnz",
                                                            "parent_id": "t1_ieb5cy1",
                                                            "score": 1,
                                                            "created_utc": 1656595205.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Would you like a list of examples? While on an allowance, ask:\n\n  \n\\-if you can do overnights\n\n\\-if you can see him more than you normally would\n\n\\-if he would like to do a mini-vacation over an extended weekend\n\nBasically, take all the things that you would normally think about expecting a guy to provide more for, and do something from that list with no expectation for more.  You know, the opposite of what OP is asking - to have the SB spoil the SD beyond the agreement.",
                            "author": "jerdle",
                            "id": "ie9wu62",
                            "parent_id": "t1_ie9qcoh",
                            "score": 7,
                            "created_utc": 1656559926.0,
                            "replies": [
                                {
                                    "body": "You know what completely boggles my mind.... everything you listed is so simple and so obvious. Why does it completely escape your average SB (and woman)?",
                                    "author": "AustinMetz18",
                                    "id": "ie9zbcl",
                                    "parent_id": "t1_ie9wu62",
                                    "score": 7,
                                    "created_utc": 1656561287.0,
                                    "replies": []
                                },
                                {
                                    "body": "Those things are encompassed in \"dating\".",
                                    "author": null,
                                    "id": "iea0qs4",
                                    "parent_id": "t1_ie9wu62",
                                    "score": 3,
                                    "created_utc": 1656562094.0,
                                    "replies": [
                                        {
                                            "body": "In 5 years of sugar dating, #1 and #3 were never approached from the SB first.  #2 has happened with one SB.  The 'all aspects of dating' is NOT the norm.  The norm is 'kinda-sorta' dating.",
                                            "author": "jerdle",
                                            "id": "iea77ub",
                                            "parent_id": "t1_iea0qs4",
                                            "score": 5,
                                            "created_utc": 1656566049.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Anal and threesome\nAnd giving them one fuck free for 4 paid",
                            "author": "WiseRequirement9277",
                            "id": "iebky4p",
                            "parent_id": "t1_ie9qcoh",
                            "score": 1,
                            "created_utc": 1656598852.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Hotwheels",
                    "author": "timrid",
                    "id": "ie9sfzl",
                    "parent_id": "t1_ie9o8gz",
                    "score": 2,
                    "created_utc": 1656557637.0,
                    "replies": [
                        {
                            "body": "Oh no, she explicitly calls out for it to be a $30,000 car and if you tell her no you're \"not for her at all\"",
                            "author": "jerdle",
                            "id": "ie9x0lm",
                            "parent_id": "t1_ie9sfzl",
                            "score": 2,
                            "created_utc": 1656560023.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": ">OP, what are you doing to go above and beyond?\n\nShe's having sex with someone ***SHE*** normally wouldn't go for. That's above and beyond. There's POT SDs out there and I've personally became asthmatic when I heard they getting sex AND they were married because.....HOW? Lol. It sounds mean, but I'm truly not trying to be mean.\n\nAnd their PPM isn't enough to shake the table, so I get flabbergasted at times.",
                    "author": "DottiesHotSake",
                    "id": "ie9x8v8",
                    "parent_id": "t1_ie9o8gz",
                    "score": 1,
                    "created_utc": 1656560146.0,
                    "replies": [
                        {
                            "body": "> she’s having sex with someone she normally wouldn’t go for \n\nAndddd he’s paying for that opportunity when most men wouldn’t. Seems pretty well balanced. \n\nThe question is why spoil her extra. Is she spoiling _him_ extra?",
                            "author": null,
                            "id": "ieaamkn",
                            "parent_id": "t1_ie9x8v8",
                            "score": 4,
                            "created_utc": 1656568350.0,
                            "replies": [
                                {
                                    "body": "It will NEVER be balanced in a situation where the SD makes more than her and has the access to multiple women using his money.\n\nThe most I've heard men want women to do for them is to have great sex as spoiling and if she's doing that, then what more does he want? I'm not being calloused or insensitive, but I truly don't get what a married man who I won't have for a long time really wants.\n\nIf she's giving him sleepovers, texting, calling, being attentive to his needy ass, monogamy, coddling him, what ELSE does he want since he's not divorcing his wife??",
                                    "author": "DottiesHotSake",
                                    "id": "iec1y1k",
                                    "parent_id": "t1_ieaamkn",
                                    "score": 0,
                                    "created_utc": 1656605677.0,
                                    "replies": [
                                        {
                                            "body": "> access to multiple women using his money \n\nDoesn’t a SB have access to multiple men if she wants? Again, both the SD and the SB seem to have a balanced situation here. SDs can spend their money on multiple women, SBs can earn extra money having multiple SDs\n\n> what else does he want  \n\nThe sleepovers, monogamy, etc that you mentioned are not always given. Most SBs don’t offer those unless pushed. To me, those things _do_ count as extra the SB is doing for the SD. In those cases, the SD probably should spoil her extra in return",
                                            "author": null,
                                            "id": "ied21qy",
                                            "parent_id": "t1_iec1y1k",
                                            "score": 1,
                                            "created_utc": 1656619826.0,
                                            "replies": [
                                                {
                                                    "body": ">Doesn’t a SB have access to multiple men if she wants? Again, both the SD and the SB seem to have a balanced situation here. SDs can spend their money on multiple women, SBs can earn extra money having multiple SDs\n\nIt's heavily frowned upon if SBs have multiple SDs and we're considered \"pros\" if we do that. It's more easier to find ANY woman to be an SB and give sex and feigned attention than it is to find an SD who is financially capable of having an arrangement. \n\nWith respect, I can't blame SOME sbs for not providing certain things to SDs because sometimes, the PPM doesn't reflect it the requests that's being asked. This just happened to me yesterday, a POT SD who is married only wanted an oral sex arrangement. Doesn't seem like a bad idea, right? For 300 tacos, he wanted MONOGAMY as in  for me to not go on dates with other as well as no sex and he wasn't going to sexually satisfy me. Because I'm not a dirt bag, I couldn't promise him that and rather not put someone's health in jeopardy, but it wasn't enough for me to be monogamous to someone AND me not being sexually satisfied. \n\nIt's great that the men on Reddit are able to provide great allowances and if my monthly allowance was in the 2XXX range, best believe you wouldn't have to tell me twice or wait for me to suggest something. But in the real world, there's a lot of mediocre monthly allowances and outlandish demands on SDs expectations which is why some SDs have trouble finding SBs.",
                                                    "author": "DottiesHotSake",
                                                    "id": "ieed0fi",
                                                    "parent_id": "t1_ied21qy",
                                                    "score": 1,
                                                    "created_utc": 1656640168.0,
                                                    "replies": [
                                                        {
                                                            "body": "> it’s heavily frowned upon if SBs have multiple SDs\n\nI agree a lot of SDs are controlling and insist on monogamy. However it’s not like a sugar relationship is a marriage where everything must be disclosed. If I was a SB, I’d have multiple SDs and just not tell them. \n\nAs for the rest, we seem to agree that it needs to be fair for the SB and the SD. 3XX isn’t a fair agreement for an oral sex arrangement with monogamy. Fuck that dude.",
                                                            "author": null,
                                                            "id": "iehpkjh",
                                                            "parent_id": "t1_ieed0fi",
                                                            "score": 1,
                                                            "created_utc": 1656704710.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Experience has shown us that SBs do not operate like this at all. We can all tell you a story where we were head over heals and the SB took advantage. \n\nHere's how we operate once we get our silver fox badge. We give you a PPM and see how you behave. Then we wonder if we she should move to allowance. We say fuck it, let's try, so you start missing meets. So we try the gifts, how about diamonds, let's try that.\n\nIt appears to excite you and make you happy, but we already resent you a little for missing meets. So we become careful with the rewards we give you, because no one likes to be taken for a fool. \n\nAfter that we realize you had a boyfriend all along and curse ourselves for being so generous and stupid. We move back to PPM with the resolve to this time observe the reward system in return for good behavior only.\n\nThen we wait for the boyfriend to leave because we crave the affection you never gave us. Finally, we lose interest and move on, with or without telling you. \n\nSpooling doesn't work unless it's a reward for understanding our needs and attending to it. If you want regular spoiling in a SR, you got to earn it, otherwise it'll be a one time thing.",
            "author": "sugardad123",
            "id": "ieapxv4",
            "parent_id": "t3_vnwl5u",
            "score": 7,
            "created_utc": 1656580598.0,
            "replies": [
                {
                    "body": "I just read a post a few days ago written by an old man .. he doesn’t give ppm or allowance. He only pays pills. Like she has to stay with him long enough (maybe a few weeks to prove) then he pays her University fees .. \n\nI think the entire sugar relationship is very confusing. Everyone is doing it differently. I bet that old man is frustrated. Not many girls will have sex with him for free for a few weeks. How can he prove he can follow through? 🤔 \n\nTreating someone right means different things to different people. So vague .. \n\nTreating a gold digger right means giving her all your money - that actually sounds like divorce lol",
                    "author": null,
                    "id": "iebdt73",
                    "parent_id": "t1_ieapxv4",
                    "score": 2,
                    "created_utc": 1656595724.0,
                    "replies": [
                        {
                            "body": "There's a culture and that old man story, men offering scholarships and such are the worst, they'll turn the SB into a sex slave and won't deliver on their promises. \n\nIt should be fair at each meet, hence why there is the PPM standard, but the girls often don't want to learn about the culture until they get played, they are not in a place where they think objectively about it.",
                            "author": "sugardad123",
                            "id": "iebgt1k",
                            "parent_id": "t1_iebdt73",
                            "score": 1,
                            "created_utc": 1656597082.0,
                            "replies": [
                                {
                                    "body": "Well, anyway when I saw that post, I felt so lucky I never dated anyone like that because I could totally see I fall into a victim of these sort of narcissistic man. \n\nI need my man to be kind, compassionate and have morality and self introspection. Or I will repeat the miserable years again with my ex boyfriend. 🙈",
                                    "author": null,
                                    "id": "iecerny",
                                    "parent_id": "t1_iebgt1k",
                                    "score": 1,
                                    "created_utc": 1656610727.0,
                                    "replies": [
                                        {
                                            "body": "Us empaths understand each other. I've been with an ASPD and now I can spot the dark triad traits in a room full of strangers, damnit why are they so charming! :)",
                                            "author": "sugardad123",
                                            "id": "iecleo3",
                                            "parent_id": "t1_iecerny",
                                            "score": 1,
                                            "created_utc": 1656613344.0,
                                            "replies": [
                                                {
                                                    "body": "Well, I am not anti social I am just selectively social introvert :)\n\nYes I often get attracted to introverted men. \nMy last and current SD are both INFJ. \n\nIt’s very strange My emotional connection with the last one is much stronger. \nWe are both INFJ-T.. I think the turbulence trait makes us resonate with each other much more. \n\nThe current guy is INFJ-A .. his assertive vibe gives me he’s more like INTJ sometimes but later I got him to do the test and came out as INFJ.. also he’s very expressive so I believe he’s more feeler than thinker. \n\nWhat are you? I think you might be an INFP male? 🤔🙂",
                                                    "author": null,
                                                    "id": "iedfnff",
                                                    "parent_id": "t1_iecleo3",
                                                    "score": 1,
                                                    "created_utc": 1656625192.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "> some SDs believe that if they spoil too much their SB, they might leave once they get what they want \n\nWho? Which SDs believe this? \n\nFrom what I’ve experienced and read, most SDs are willing to spoil their SBs a lot as long as the SB does her part",
            "author": null,
            "id": "ieaaamy",
            "parent_id": "t3_vnwl5u",
            "score": 3,
            "created_utc": 1656568125.0,
            "replies": [
                {
                    "body": "Most? Who “most” you referring to?",
                    "author": "Iooklike_my_pictures",
                    "id": "ieafcnq",
                    "parent_id": "t1_ieaaamy",
                    "score": 0,
                    "created_utc": 1656571831.0,
                    "replies": [
                        {
                            "body": "Most = pretty much all the SDs on this thread. Happy to dig up a few other topics too\n\nMost men are happy to spoil their SB if she takes care of him in return. The problem is that many SBs are entitled and think they deserve extravagance at every meeting when they are doing the minimum and just showing up.",
                            "author": null,
                            "id": "ied2e0z",
                            "parent_id": "t1_ieafcnq",
                            "score": 1,
                            "created_utc": 1656619956.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Kind, fun, Consistent, reliable and sustainable.  You can always give more but you can’t dial it down after you started out lavishly.   My most successful long term arrangements were all a fair, slightly above average ppm with extras as they are earned.   Anytime I went well above average or a monthly allowance it has been a disaster.  There is very little correlation between the quality of the sugar relationship and how generous you are above and beyond the average.  There are obvious takers on both sides,  just avoid those people.",
            "author": "LotBuilder",
            "id": "ieak636",
            "parent_id": "t3_vnwl5u",
            "score": 3,
            "created_utc": 1656575707.0,
            "replies": []
        },
        {
            "body": "What in the heck happened to you?\n\nDid you ask for something and not get it?\n\nOr were you hoping that your SD would go above and beyond what you mutually negotiated?\n\nReally curious about what triggered your rant.",
            "author": "ExpertPerformance",
            "id": "ieaa0g5",
            "parent_id": "t3_vnwl5u",
            "score": 5,
            "created_utc": 1656567927.0,
            "replies": []
        },
        {
            "body": "Acting entitled is a great way to scare off most sugar daddies.",
            "author": "wb19081908",
            "id": "ieao6kp",
            "parent_id": "t3_vnwl5u",
            "score": 10,
            "created_utc": 1656579100.0,
            "replies": [
                {
                    "body": "Acting like you would have any chance with these beautiful women without the sugar aspect is a great way to scare off sugar babies. 🤍",
                    "author": "Stella_bby554",
                    "id": "iebnzes",
                    "parent_id": "t1_ieao6kp",
                    "score": 2,
                    "created_utc": 1656600113.0,
                    "replies": [
                        {
                            "body": "SDs are aware they are getting beautiful women that are often out of our league. That’s why we are paying, we get it. \n\nThe problem is women who expect extravagance beyond what is typical in a sugar relationship. They are often making thousands just showing up for dates but still don’t think it’s enough. That’s entitlement",
                            "author": null,
                            "id": "ied3rf1",
                            "parent_id": "t1_iebnzes",
                            "score": 2,
                            "created_utc": 1656620489.0,
                            "replies": [
                                {
                                    "body": "It’s not your decision to decide how much someone else is worth. Period. 🤍",
                                    "author": "Stella_bby554",
                                    "id": "iegs2bc",
                                    "parent_id": "t1_ied3rf1",
                                    "score": 1,
                                    "created_utc": 1656691013.0,
                                    "replies": [
                                        {
                                            "body": "Some of you SBs take this way too personally and start to believe your worth is what a SD will pay you. You’re a human, not a PPM amount. Stop valuing yourself based on how much money you get \n\nThat being said, it’s the SD who is deciding how much your time is worth. If you say “I’m worth $XXXX” for a ppm and it doesn’t seem worth it, we’ll just find another girl.",
                                            "author": null,
                                            "id": "iehoouh",
                                            "parent_id": "t1_iegs2bc",
                                            "score": 1,
                                            "created_utc": 1656704348.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Well given you’ve never been attracted to any sugar daddy you’ve seenI’m not surprised you had this reply",
                            "author": "wb19081908",
                            "id": "iebvmi0",
                            "parent_id": "t1_iebnzes",
                            "score": 1,
                            "created_utc": 1656603186.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Seriously, if you wake me up with some great pancakes and make sure I’m sorted morning noon and night I might go the extra mile, otherwise, the arrangement is the arrangement.",
            "author": "Immediate_Cabinet725",
            "id": "ie9n310",
            "parent_id": "t3_vnwl5u",
            "score": 6,
            "created_utc": 1656554999.0,
            "replies": []
        },
        {
            "body": "There are more SBs than there are SDs, many SB feel entitled, there is no free lunch. Mutual respect is needed.\n\nNo one should devalue you, your getting paid for what you agreed upon. If you feel you deserve more than the agreed upon amount, this is not the thing for you.\n\nRemember, No Free Lunch.",
            "author": "KingofHearts0087",
            "id": "ie9n929",
            "parent_id": "t3_vnwl5u",
            "score": 9,
            "created_utc": 1656555080.0,
            "replies": [
                {
                    "body": "Given that SDs almost universally pick up the tab at M&G's, there is, in fact, free lunch",
                    "author": "sinperviren",
                    "id": "ie9yzxs",
                    "parent_id": "t1_ie9n929",
                    "score": 12,
                    "created_utc": 1656561109.0,
                    "replies": [
                        {
                            "body": "Yes lots of free lunches 🤣🤣🤣",
                            "author": null,
                            "id": "iea7o7o",
                            "parent_id": "t1_ie9yzxs",
                            "score": 3,
                            "created_utc": 1656566349.0,
                            "replies": []
                        },
                        {
                            "body": "Maybe You don’t comprehend that there is something expected in return?",
                            "author": "KingofHearts0087",
                            "id": "ieat4q4",
                            "parent_id": "t1_ie9yzxs",
                            "score": 3,
                            "created_utc": 1656583258.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Tanstaafl!",
                    "author": "timrid",
                    "id": "ie9sove",
                    "parent_id": "t1_ie9n929",
                    "score": 3,
                    "created_utc": 1656557764.0,
                    "replies": []
                },
                {
                    "body": "MICHELLE OBAMA DISAGREES.",
                    "author": null,
                    "id": "ie9nr3c",
                    "parent_id": "t1_ie9n929",
                    "score": 7,
                    "created_utc": 1656555321.0,
                    "replies": [
                        {
                            "body": "Literal LOL. Thank you for this comment.",
                            "author": "HailToTheQuinn",
                            "id": "ie9yp9g",
                            "parent_id": "t1_ie9nr3c",
                            "score": 3,
                            "created_utc": 1656560946.0,
                            "replies": []
                        },
                        {
                            "body": "Lol",
                            "author": "clair-cummings",
                            "id": "iea0di7",
                            "parent_id": "t1_ie9nr3c",
                            "score": 2,
                            "created_utc": 1656561884.0,
                            "replies": []
                        },
                        {
                            "body": "Someone is paying for that free lunch. And there are returns to be collected.",
                            "author": "KingofHearts0087",
                            "id": "ie9q5c0",
                            "parent_id": "t1_ie9nr3c",
                            "score": 1,
                            "created_utc": 1656556488.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "No Free Lunch? So I’m supposed to be okay with going hungry while SD and his daughter are eating, and I’m unable get food on my own? I shouldn’t expect to have my basic needs met while accompanying him on vacation? I guess getting an allowance means he doesn’t have to treat me like a human being.",
                    "author": "oliviamc99",
                    "id": "iecucqr",
                    "parent_id": "t1_ie9n929",
                    "score": 0,
                    "created_utc": 1656616842.0,
                    "replies": [
                        {
                            "body": "Maybe You do not understand what a metaphor is, looks like that is the case. I suggest learning a thing or two about life before making accusations.\n\nBut I will spell it out for you, the concept of “No Free Lunch,” means that the SD is expecting something in return. Unless your with your husband, or parent, or relative, someone is expecting a return in that lunch they bought you.\n\nFor SR, that is the norm. So get with the program, learn a think or two.",
                            "author": "KingofHearts0087",
                            "id": "iecy7nq",
                            "parent_id": "t1_iecucqr",
                            "score": 3,
                            "created_utc": 1656618336.0,
                            "replies": [
                                {
                                    "body": "I just saw this. Read what I said more carefully. I had held up my end of the arrangement completely. I was accompanying him and his daughter on vacation. He would not give me food while he and his daughter were eating in the hotel room, and he threw me out when I complained that I didn’t feel well due to low blood sugar. If you are an SD taking your SB on vacation, you are responsible for her basic physiological needs such as food and water, and for her safety. You can’t just suddenly decide you don’t want to provide for those needs and force her to figure out a way home on her own. That is what happened to me and it’s unacceptable. You need to learn a thing or two about the power dynamics of sugar relationships, and how women have to keep themselves safe when dating.",
                                    "author": "oliviamc99",
                                    "id": "iijo8xy",
                                    "parent_id": "t1_iecy7nq",
                                    "score": 1,
                                    "created_utc": 1659381951.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "If I hear too many \"No's\" \"can'ts\" \"won'ts\" from an SD, I will reactivate my SA account. If I wanted to go back to non spoiling antics, I would go back with my ex. \n\nI don't ask for much, but the little I do ask, it grinds my gears when it can't be completed or worse, they'll do it for their other SBs and not me and that causes me to mentally check out.",
            "author": "DottiesHotSake",
            "id": "ie9xfjf",
            "parent_id": "t3_vnwl5u",
            "score": 10,
            "created_utc": 1656560250.0,
            "replies": []
        },
        {
            "body": "Maybe just tell her it would make you feel good if she thanked you.",
            "author": "OldCommand4010",
            "id": "iecvf82",
            "parent_id": "t3_vnwl5u",
            "score": 2,
            "created_utc": 1656617254.0,
            "replies": []
        },
        {
            "body": "> Some SDs believe that if they spoil too much their SB, they might leave once they get what they want.\n\nI've never actually heard that mentioned here.  \n\nWhat I have experienced - like others - is that all to often giving \"extra\" becomes an expectation of the normal.",
            "author": "SDstartingOut",
            "id": "iedsk4r",
            "parent_id": "t3_vnwl5u",
            "score": 2,
            "created_utc": 1656630573.0,
            "replies": []
        },
        {
            "body": "You've obviously never had a SB lol.",
            "author": null,
            "id": "ie9qeiw",
            "parent_id": "t3_vnwl5u",
            "score": 4,
            "created_utc": 1656556616.0,
            "replies": [
                {
                    "body": "🤣🤣🤣\n\nIt’s kind of like women saying they want this type of guy but end up going for the total opposite",
                    "author": "UnearthlyDinosaur",
                    "id": "iec8iaf",
                    "parent_id": "t1_ie9qeiw",
                    "score": 3,
                    "created_utc": 1656608244.0,
                    "replies": [
                        {
                            "body": "Always",
                            "author": null,
                            "id": "iee9izt",
                            "parent_id": "t1_iec8iaf",
                            "score": 1,
                            "created_utc": 1656638470.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "be attentive, affectionate and appreciative and you’ll never lose a real SD. The reason most SD stop spoiling is because they don’t see the reciprocation and feel like they’re being taken advantage of",
            "author": "NickPfromYuma",
            "id": "ieb98hu",
            "parent_id": "t3_vnwl5u",
            "score": 2,
            "created_utc": 1656593514.0,
            "replies": [
                {
                    "body": "I look at the three A words I am thinking many women want that too. It’s common sense isn’t it? Humans aren’t that all different .. 😊",
                    "author": null,
                    "id": "iebe7iz",
                    "parent_id": "t1_ieb98hu",
                    "score": 0,
                    "created_utc": 1656595910.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "This is the hill I die on lol\n\nI think it’s also forgotten that SBs are often spoiled bc they have to deal with an array of obstacles that makes vanilla dating for the SD not possible, such as: marriage, crazy work schedule, or being very uncouth or unattractive, etc. stereotypically, SBs are also often out of the SDs “league”. \n\nSo when I hear people whine about sbs needing to go “above and beyond” to be spoiled or how awful and fake they are for having high standards, let’s not forget that many SBs are dealing with the SDs shitty schedule, not only with work, but having to sneak around behind their spouses back a lot of the time, family obligations; we are spoiled to compensate for the finite nature of these relationships and how many of these guys will never be able to marry, truly let us into their lives, etc. \n\nSBs are giving them their youth, body, time and energy, just like in any relationship but in this case there are boundaries, parameters and obstacles that I would personally NEVER tolerate in vanilla dating so yeah. I do expect more than the bare minimum of spoiling",
            "author": "c0rnstarr",
            "id": "iebefoy",
            "parent_id": "t3_vnwl5u",
            "score": 3,
            "created_utc": 1656596016.0,
            "replies": [
                {
                    "body": "Girllll this!!!! These men think we will bed them without the financial aspect. We make a lot of compromise for them.",
                    "author": "Iooklike_my_pictures",
                    "id": "iecifzy",
                    "parent_id": "t1_iebefoy",
                    "score": 0,
                    "created_utc": 1656612168.0,
                    "replies": [
                        {
                            "body": "What in the heck happened to you?\n\nDid you ask for something and not get it?\n\nOr were you hoping that your SD would go above and beyond what you mutually negotiated?\n\nReally curious about what triggered your rant. If you had an agreement and it’s being met, why is there a problem?",
                            "author": "ExpertPerformance",
                            "id": "ieddsxe",
                            "parent_id": "t1_iecifzy",
                            "score": 0,
                            "created_utc": 1656624441.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "You go, girl!  I couldn’t agree more! 👏🏻",
                    "author": "Chill_SD1974",
                    "id": "iecmcna",
                    "parent_id": "t1_iebefoy",
                    "score": 0,
                    "created_utc": 1656613724.0,
                    "replies": [
                        {
                            "body": "Thank you chill 😤😤",
                            "author": "c0rnstarr",
                            "id": "ieeeyif",
                            "parent_id": "t1_iecmcna",
                            "score": 1,
                            "created_utc": 1656641108.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Ummmmm you expecting us to simp out for your personal value?……mam with all due respect most SDs dont care about values when majority of the time all their doing is winning their way into your cheeks getting clapped in the bedroom…..just had to put it out there respectfully",
            "author": "Thin_Bug_3775",
            "id": "ie9muta",
            "parent_id": "t3_vnwl5u",
            "score": 5,
            "created_utc": 1656554891.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "ie9n294",
                    "parent_id": "t1_ie9muta",
                    "score": 8,
                    "created_utc": 1656554989.0,
                    "replies": [
                        {
                            "body": "We shall call him the preying mantis of SLF.",
                            "author": null,
                            "id": "ie9n958",
                            "parent_id": "t1_ie9n294",
                            "score": 7,
                            "created_utc": 1656555081.0,
                            "replies": [
                                {
                                    "body": "praying mantis not preying mantis (just another example of the triumph of illusion over reality)",
                                    "author": "highfructoseSD",
                                    "id": "ieap6ks",
                                    "parent_id": "t1_ie9n958",
                                    "score": 1,
                                    "created_utc": 1656579947.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Extra credit for the use of the emojis. lol",
                            "author": "Y_4Z44",
                            "id": "ie9nyl6",
                            "parent_id": "t1_ie9n294",
                            "score": 4,
                            "created_utc": 1656555421.0,
                            "replies": []
                        },
                        {
                            "body": "I just had to be that guy to say it 🤷🏽‍♂️",
                            "author": "Thin_Bug_3775",
                            "id": "ie9nh60",
                            "parent_id": "t1_ie9n294",
                            "score": 2,
                            "created_utc": 1656555188.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Works for the mean time",
                    "author": "Iooklike_my_pictures",
                    "id": "ie9q0xw",
                    "parent_id": "t1_ie9muta",
                    "score": 0,
                    "created_utc": 1656556429.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "ie9s7ig",
            "parent_id": "t3_vnwl5u",
            "score": 3,
            "created_utc": 1656557517.0,
            "replies": [
                {
                    "body": "Bonefish and VS 💀",
                    "author": null,
                    "id": "iea1jua",
                    "parent_id": "t1_ie9s7ig",
                    "score": 13,
                    "created_utc": 1656562529.0,
                    "replies": [
                        {
                            "body": "In Macon GA that's the top of the pyramid.",
                            "author": "zapzangboombang",
                            "id": "ieadehn",
                            "parent_id": "t1_iea1jua",
                            "score": 4,
                            "created_utc": 1656570357.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "LMFAOOO VS AND BONEFISH?!?! I’m dying",
                    "author": "Sugarcookie54321_",
                    "id": "iebdvhm",
                    "parent_id": "t1_ie9s7ig",
                    "score": 6,
                    "created_utc": 1656595753.0,
                    "replies": [
                        {
                            "body": "It has to be a troll LOL.\n\nAnyway, cheap delusional wannabe SDs are a dime a dozen.",
                            "author": "LightOLove",
                            "id": "ieby636",
                            "parent_id": "t1_iebdvhm",
                            "score": 3,
                            "created_utc": 1656604197.0,
                            "replies": [
                                {
                                    "body": "Definitely wannabes. Gosh I thought I was crazy here.",
                                    "author": "Sugarcookie54321_",
                                    "id": "iebybc9",
                                    "parent_id": "t1_ieby636",
                                    "score": 3,
                                    "created_utc": 1656604256.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "iebe0d3",
                            "parent_id": "t1_iebdvhm",
                            "score": 2,
                            "created_utc": 1656595815.0,
                            "replies": [
                                {
                                    "body": "I’m good love. Thanks 😙",
                                    "author": "Sugarcookie54321_",
                                    "id": "iebe824",
                                    "parent_id": "t1_iebe0d3",
                                    "score": 2,
                                    "created_utc": 1656595917.0,
                                    "replies": []
                                },
                                {
                                    "body": "I think it's nice.",
                                    "author": "OldCommand4010",
                                    "id": "iecli88",
                                    "parent_id": "t1_iebe0d3",
                                    "score": 1,
                                    "created_utc": 1656613383.0,
                                    "replies": [
                                        {
                                            "body": "Fyi the stuff is made with slave labor in prison tho.  🙀",
                                            "author": "OldCommand4010",
                                            "id": "ieclt1c",
                                            "parent_id": "t1_iecli88",
                                            "score": 1,
                                            "created_utc": 1656613504.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Taking a SB to Victoria Secret is treating her right?…its like you’re buying the lingerie mostly for yourself to enjoy tho",
                    "author": "Naked_Werewolf1283",
                    "id": "ie9xebw",
                    "parent_id": "t1_ie9s7ig",
                    "score": 16,
                    "created_utc": 1656560231.0,
                    "replies": [
                        {
                            "body": "I really hope that last part was tongue in cheek sarcasm.",
                            "author": "clair-cummings",
                            "id": "iea09en",
                            "parent_id": "t1_ie9xebw",
                            "score": 7,
                            "created_utc": 1656561820.0,
                            "replies": []
                        },
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "ie9z97c",
                            "parent_id": "t1_ie9xebw",
                            "score": -5,
                            "created_utc": 1656561253.0,
                            "replies": [
                                {
                                    "body": "Ahahah yes because love wearing garter belt and stockings under my sweatpants….keep telling ur self that",
                                    "author": "Naked_Werewolf1283",
                                    "id": "iea6taa",
                                    "parent_id": "t1_ie9z97c",
                                    "score": 8,
                                    "created_utc": 1656565779.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Genuine SB's looking for genuine relationships will find it harder to land a solid SD in short time BUT if the SB is a \"commercial\" SB, then she wont have much problem finding SDs aka clients as early as next week. She will call them SD or whatever but they may not be genuine SD's, just tourists.",
                    "author": null,
                    "id": "iebmzlj",
                    "parent_id": "t1_ie9s7ig",
                    "score": 4,
                    "created_utc": 1656599705.0,
                    "replies": []
                },
                {
                    "body": "VS 🤣🤣🤣🤣",
                    "author": "WiseRequirement9277",
                    "id": "iebp1ea",
                    "parent_id": "t1_ie9s7ig",
                    "score": 2,
                    "created_utc": 1656600541.0,
                    "replies": []
                },
                {
                    "body": "Not in my experience",
                    "author": "Iooklike_my_pictures",
                    "id": "ie9sb01",
                    "parent_id": "t1_ie9s7ig",
                    "score": -3,
                    "created_utc": 1656557567.0,
                    "replies": [
                        {
                            "body": "Well, that's the point. You're making a massive generalization based on your own experience. Others are pointing out their experience has been the opposite.",
                            "author": "matthewjphillips",
                            "id": "ie9xk80",
                            "parent_id": "t1_ie9sb01",
                            "score": 7,
                            "created_utc": 1656560322.0,
                            "replies": []
                        },
                        {
                            "body": "Commercial SB's have no problem finding SD's quickly. Genuine SB's however take more time to land the ideal ones.",
                            "author": null,
                            "id": "iebn7t1",
                            "parent_id": "t1_ie9sb01",
                            "score": 2,
                            "created_utc": 1656599797.0,
                            "replies": []
                        },
                        {
                            "body": "They tell themselves this to make themselves feel better and make the woman feel devalued, therefore making her feel less worthy. They really don't know.",
                            "author": "clair-cummings",
                            "id": "iea06sb",
                            "parent_id": "t1_ie9sb01",
                            "score": 5,
                            "created_utc": 1656561779.0,
                            "replies": [
                                {
                                    "body": "There was this SD whom I’ve been seeing for almost 2 months. He was bragging that he can have as many as he wants and im likeee… yeah if money is not involved, we wouldnt bother talking to you",
                                    "author": "Iooklike_my_pictures",
                                    "id": "ieag21e",
                                    "parent_id": "t1_iea06sb",
                                    "score": 3,
                                    "created_utc": 1656572380.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "“Treat us right”. Well depends what you mean by that? Is that a purely financial thing? You want us to spend more and more on you above and beyond the allowance agreed? Is that it? If so then that will come across to the SD as entitlement and maybe even greed. And you know there are other ways a man can show he values you other than with his wallet. Anyway you need to define what you mean by “treat us right”…",
            "author": null,
            "id": "iea851g",
            "parent_id": "t3_vnwl5u",
            "score": 2,
            "created_utc": 1656566656.0,
            "replies": [
                {
                    "body": "“Treat us right” means at least the bare minimum. Sticking to the agreed upon allowance. Providing basic needs when I’m in a situation where I rely on him. Examples of being devalued: him saying that he wants to see you more often, but that the originally agreed on PPM “isn’t worth it.” Refusing to allow me to have food while on vacation with him, and throwing me out to get back home 200 miles away on my own when I complain about it because I’m not feeling well. These are things that have happened to me and I have a right to be treated better than that. I do believe I am entitled to basic respect.",
                    "author": "oliviamc99",
                    "id": "iecrlgg",
                    "parent_id": "t1_iea851g",
                    "score": 2,
                    "created_utc": 1656615784.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yep, I get men acting rude and disrespectful so none of them have gotten anywhere near close to sleeping with me. Honestly I doubt anyone will so a lot of my interactions are platonic and will likely stay that way.",
            "author": "UniqueSkinnyXFigure",
            "id": "iec3aq2",
            "parent_id": "t3_vnwl5u",
            "score": 2,
            "created_utc": 1656606213.0,
            "replies": []
        },
        {
            "body": "This is 100% true, I have experienced being devalued like this. My ex SD brought me on a trip to Disneyland with his daughter. Suddenly for some reason he decided he didn’t want to let me have food while him and the daughter are eating, and there was no way for me to get any food myself. Then he gets mad at me for being cranky, complaining and saying that I don’t feel well because of my low blood sugar. Claims I’m ruining his daughter’s trip and sends me away to get back home on my own 200 miles away. He literally said when we talked on the phone later that he’s “not responsible for my blood sugar.” A sugar daddy that won’t even provide for basic needs while on vacation with him and puts my safety at risk by making me go home on my own is no sugar daddy at all. Talk about being devalued. That incident was very traumatic and I don’t travel to or with SDs anymore. I was suicidal during and after this happened. The SDs here are complaining about feeling “taken for granted” well I’m sorry but that is nothing compared to something like this. They don’t understand the imbalanced power dynamic and the trauma they can inflict on their SB by devaluing them.",
            "author": "oliviamc99",
            "id": "iecm9wf",
            "parent_id": "t3_vnwl5u",
            "score": 1,
            "created_utc": 1656613693.0,
            "replies": [
                {
                    "body": "This sounds so painful! I’m guessing he’s no longer your SD.",
                    "author": "daddoms",
                    "id": "ieehyc7",
                    "parent_id": "t1_iecm9wf",
                    "score": 2,
                    "created_utc": 1656642561.0,
                    "replies": [
                        {
                            "body": "Definitely not",
                            "author": "oliviamc99",
                            "id": "ifg23v7",
                            "parent_id": "t1_ieehyc7",
                            "score": 1,
                            "created_utc": 1657348627.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "That is right..💗💗 but also wrong...i won't want anyone better..This is relationship...Both parties need to respect and cherish each other..Just mooching off of a person is wrong.. SD lifestyle is to be understood....",
            "author": "meleficent007",
            "id": "iea1nzr",
            "parent_id": "t3_vnwl5u",
            "score": 1,
            "created_utc": 1656562597.0,
            "replies": []
        },
        {
            "body": "Everyone has their own frame of reference. This is your frame of reference, but it’s not the only one out there. Many people enjoy a different kind of relationship dynamic that is not so tit for tat and entitled. \n\nSometimes I can’t spoil you like you selfishly want me to because of other external factors, like maybe my grandma just died and I’m feeling depressed so I’m not thinking about your selfish ass all day. Or maybe the market is down and business is tight, so I’m focused on work.\n\nIn those scenarios, the last thing I want is for an entitled woman to be on my back and nagging me about a new purse she wants; she should be supporting me in those moments.",
            "author": "TimeIsFractal",
            "id": "iea7l69",
            "parent_id": "t3_vnwl5u",
            "score": 1,
            "created_utc": 1656566295.0,
            "replies": []
        },
        {
            "body": "Usually when we say something is spoiled it means it’s going bad and needs to be replaced.",
            "author": null,
            "id": "iebdmhh",
            "parent_id": "t3_vnwl5u",
            "score": 1,
            "created_utc": 1656595637.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "ieafrw0",
            "parent_id": "t3_vnwl5u",
            "score": 0,
            "created_utc": 1656572164.0,
            "replies": [
                {
                    "body": "I like number three though for my last guy. Lol \nBut he’d never leave his wife for me.",
                    "author": null,
                    "id": "iebeq65",
                    "parent_id": "t1_ieafrw0",
                    "score": 1,
                    "created_utc": 1656596147.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "It really depends on the girl. \nIt’s possible some girls use men for their desire of material things. \n\nI think your theory only works when the girl genuinely likes the guy otherwise, the poor guy is going to be used as an ATM. \n\nBut you don’t need to advise men on this. Men are just emotional driven as women. When they fall, they can be also very blind. \n\nIf people ask me how do you know for sure, my answer is you don’t and only time can tell. Trust isn’t built in one day. \n\nYou fuck her once it’s hookup or prostitution; you fuck her a lifetime, it’s marriage. Only time matters. \n\nIf I want to use men, I have done so a million times. But I never do. At the end of day, how you feel about yourself is the most important thing. My morality just won’t allow me to use people. My conscience is clean.",
            "author": null,
            "id": "ieah9so",
            "parent_id": "t3_vnwl5u",
            "score": 0,
            "created_utc": 1656573339.0,
            "replies": []
        },
        {
            "body": "The biggest thing that makes me mad is entering into an arrangement, the terms are clear on what you will and won’t do, and they push and push and push for more and threaten you if you don’t do it. Now idk about most of you but this is a lifestyle and a job for me. It’s like going into a job for one position and they hire you for a position you have no experience in and didn’t apply for 😂",
            "author": "MercedesRose6969",
            "id": "ieaseuv",
            "parent_id": "t3_vnwl5u",
            "score": 1,
            "created_utc": 1656582667.0,
            "replies": [
                {
                    "body": "What about doggie or reverse cowgirl?",
                    "author": "SD1070",
                    "id": "iebzh3q",
                    "parent_id": "t1_ieaseuv",
                    "score": 2,
                    "created_utc": 1656604711.0,
                    "replies": [
                        {
                            "body": "Okay that was funny and it took me a second 😂😂",
                            "author": "MercedesRose6969",
                            "id": "iedeayt",
                            "parent_id": "t1_iebzh3q",
                            "score": 1,
                            "created_utc": 1656624646.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "My BF says he shouldn’t spoil me but does it anyway. 😅 We’re both very happy. We’re both very generous to each other.\n\nI agree OP",
            "author": "LadyoftheFlow4rs",
            "id": "ieb7dn3",
            "parent_id": "t3_vnwl5u",
            "score": 1,
            "created_utc": 1656592566.0,
            "replies": []
        },
        {
            "body": "Just don't get taken advantage of against your terms.",
            "author": "vdzz000",
            "id": "iebyg9b",
            "parent_id": "t3_vnwl5u",
            "score": 1,
            "created_utc": 1656604309.0,
            "replies": []
        },
        {
            "body": "Treat them right and be fair but shower them with luxury? Umm... No. As long as it's in the budget I can do it but once she overshoot the budget it's back to simple dining.",
            "author": "Orange_Overlord",
            "id": "iee4jbo",
            "parent_id": "t3_vnwl5u",
            "score": 1,
            "created_utc": 1656636090.0,
            "replies": []
        },
        {
            "body": "I don’t think the replies imply that they’re the butthurt type, love.  It’s just that tone of your post is accusing and easy to misinterpret so it provokes a tense response",
            "author": "JDMultralight",
            "id": "ielvh97",
            "parent_id": "t3_vnwl5u",
            "score": 1,
            "created_utc": 1656787461.0,
            "replies": []
        },
        {
            "body": "THIS. It’s funny the butthurt guys who want to ignore the fact all sbs are in agreement. \n\nIf you don’t want to spoil me with more gifts and such but instead buy me a dinner.... then I won’t spoil you with sex but rather just my company. \n\nHow’s that sound?",
            "author": "Whoisthatgirlleah",
            "id": "ieo83pw",
            "parent_id": "t3_vnwl5u",
            "score": 1,
            "created_utc": 1656833023.0,
            "replies": []
        },
        {
            "body": "TRUEST WORDS HAD NEVER BEEN SPOKEN\n\nlooklike_my_pictures for president pls! As woman to woman, I admire smart beautiful women!",
            "author": null,
            "id": "ietukst",
            "parent_id": "t3_vnwl5u",
            "score": 1,
            "created_utc": 1656948989.0,
            "replies": []
        },
        {
            "body": "Getting to choose between varying modes of privilege and luxury must be nice. You must be slumming it in that starter home.",
            "author": "Rivergirl2878",
            "id": "igedrb9",
            "parent_id": "t1_iebqbbm",
            "score": 4,
            "created_utc": 1657982288.0,
            "replies": [
                {
                    "body": "You know it’s less slumming it and more that Im incredibly attached to the little townhouse with my section 8 family next door because Ive lived here my whole adult life - and watched the kids grow into college-age (theyre so cute).",
                    "author": "JDMultralight",
                    "id": "ighkc94",
                    "parent_id": "t1_igedrb9",
                    "score": 1,
                    "created_utc": 1658037227.0,
                    "replies": [
                        {
                            "body": "The self-awareness to live a simpler life and appreciate the simple joy of liking your neighbors is a path to happiness.",
                            "author": "SantaBSB",
                            "id": "ign44ac",
                            "parent_id": "t1_ighkc94",
                            "score": 3,
                            "created_utc": 1658151989.0,
                            "replies": [
                                {
                                    "body": "Thats such a sweet thing to say!  Really nice to hear\n\nSome of the people close to me think my approach to life is weirdly an egotistical flourish - like Im trying to be special or put on a costume to look interesting.  Its nice to hear positive feedback",
                                    "author": "JDMultralight",
                                    "id": "igo7a75",
                                    "parent_id": "t1_ign44ac",
                                    "score": 2,
                                    "created_utc": 1658167885.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "That does sound nice. It’s cool that you’re so close with your neighbors. Sorry if I came off rude.",
                            "author": "Rivergirl2878",
                            "id": "jcbe3cy",
                            "parent_id": "t1_ighkc94",
                            "score": 1,
                            "created_utc": 1678899799.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I agree with the smart small then amp it up as time flows. Plus, it is also about what your SB and you value. Is it things or experiences or cash.\n\nI think there are no ground rules here besides being kind, respectful and generous BUT not stupid and foolish and get taken advantage of or display yourself as an ATM who can be screwed over in a big way and taken for granted. \n\nI think SD's who are in long standing SR's know very well how to balance those two aspects. Regardless in the end SD's can only control so much because SB's will do what they want to do. Some will screw over SD's even if he is nice and generous and some will stay loyal. \n\nLike I said they only ground rules are to stay kind and generous without being stupid, foolish or getting taken advantage of.",
            "author": null,
            "id": "iebbzvi",
            "parent_id": "t1_ie9zfos",
            "score": 9,
            "created_utc": 1656594862.0,
            "replies": []
        },
        {
            "body": "Investing in the right person who isn’t a “user” is important for both SBs and SDs.",
            "author": null,
            "id": "iebz61e",
            "parent_id": "t1_ie9zfos",
            "score": 5,
            "created_utc": 1656604590.0,
            "replies": []
        },
        {
            "body": "Hmm any chance you're still looking for sb??",
            "author": "Sweetie_Avee",
            "id": "ieavhyq",
            "parent_id": "t1_ie9zfos",
            "score": -2,
            "created_utc": 1656585106.0,
            "replies": [
                {
                    "body": ";]",
                    "author": "malcolm_reyn0lds",
                    "id": "ieaxiut",
                    "parent_id": "t1_ieavhyq",
                    "score": -1,
                    "created_utc": 1656586603.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Agree. I always hold back to positively reinforce.",
            "author": "GlucoseGuardians",
            "id": "iec4n7j",
            "parent_id": "t1_iea5uoe",
            "score": 1,
            "created_utc": 1656606734.0,
            "replies": []
        },
        {
            "body": "You and me both.",
            "author": null,
            "id": "iedqk85",
            "parent_id": "t1_ieb2mfk",
            "score": 3,
            "created_utc": 1656629704.0,
            "replies": []
        },
        {
            "body": "My recently separated SB kept asking for more the more I gave her.  \n\nExcessive generosity at the beginning isn't always smart.....IME.",
            "author": "Pitkin_SD",
            "id": "ie9uwn6",
            "parent_id": "t1_ie9n8dq",
            "score": 20,
            "created_utc": 1656558904.0,
            "replies": []
        },
        {
            "body": "90% of the time, you are right! In general, the more generous outside allowance I am, 2 things or both happen:\n\n1. She keeps asking for more and more to a point that when we meet, I spend more time thinking about what she would ask for next. \n2. She give less and less thinking that I am in love (which I am not, just appreciative of her).",
            "author": "SD_AU",
            "id": "iea4zy7",
            "parent_id": "t1_ie9n8dq",
            "score": 16,
            "created_utc": 1656564617.0,
            "replies": []
        },
        {
            "body": ">the more I gave the less they would treat me right.\n\nI'd like to believe I'm not like this, but when I look around my friends, co-workers, etc - this \\^ is what I see, not the OP's comments:\n\n>Treat us right and we will treat you better.\n\nThe better women I know get treated, the worse they treat the guy. I am talking about friends that are (afaik) in vanilla, not sugar, relationships.",
            "author": "NoLimitLexa",
            "id": "ie9oz0j",
            "parent_id": "t1_ie9n8dq",
            "score": 24,
            "created_utc": 1656555912.0,
            "replies": [
                {
                    "body": "Women are attracted to dominant men, not people pleasers. An unfortunate reality for the nice guys out there.",
                    "author": "SDinAsia",
                    "id": "ie9xi7b",
                    "parent_id": "t1_ie9oz0j",
                    "score": 6,
                    "created_utc": 1656560290.0,
                    "replies": [
                        {
                            "body": "The implication that dominance and kindness can’t coexist is odd. Also, women are attracted to a variety of men, women, and non-binary people, and a whole spectrum of personalities. Personally, I prefer emotionally intelligent guys, regardless of “dominance.” I’m also attracted to *gasp* submissive men.",
                            "author": "KetoSeaweed",
                            "id": "ieivub4",
                            "parent_id": "t1_ie9xi7b",
                            "score": 6,
                            "created_utc": 1656724071.0,
                            "replies": []
                        },
                        {
                            "body": "Better way to say that there are lots of things about dominant men that are attractive.  But if you actually go through the relationships in your whole extended friend group what you’ll find is that literally every kind of strength is thoroughly rewarded.\n\nNice guys do really well.  I don’t mean “nice guys” - Which means guys who dont know how to ever be assertive, and who women burden in subtle ways.\n\nAs far as the dominance relation between the man and woman, not letting her push you around is pretty much all you have to do.  That said, there are so many super hot women who marry guys and push them around or have a strong tendency to date guys they can push around.",
                            "author": "JDMultralight",
                            "id": "iebov62",
                            "parent_id": "t1_ie9xi7b",
                            "score": 3,
                            "created_utc": 1656600472.0,
                            "replies": []
                        },
                        {
                            "body": "Some, not all. I’ve found plenty of exceptions.",
                            "author": null,
                            "id": "iea8r2c",
                            "parent_id": "t1_ie9xi7b",
                            "score": 1,
                            "created_utc": 1656567072.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Same  experience tbh.",
            "author": "thereadinessisall",
            "id": "ie9otla",
            "parent_id": "t1_ie9n8dq",
            "score": 13,
            "created_utc": 1656555838.0,
            "replies": []
        },
        {
            "body": "We always chase after what we don't have. It's that simple. I learned it the hard way. Keep it simple and fair then you are alright. That moment you slip and go full throttle then you will lose her fast.",
            "author": "Orange_Overlord",
            "id": "iee4skj",
            "parent_id": "t1_ie9n8dq",
            "score": 2,
            "created_utc": 1656636211.0,
            "replies": []
        },
        {
            "body": "not trying to invalidate here, but as a SB who has had SDs/boyfriends snoop through my stuff - once you start to doubt things just trust your gut and leave instead of trying to prove a point by snooping for evidence. even if she is lying it doesn’t give you the right to invade her personal privacy just to be able to prove that you’re right. it’s super invasive and disrespectful, not to mention unhealthy. just something to consider. sorry that you had a bad experience with a BS-er though, not fair to you either.",
            "author": "dumpst3rj3di",
            "id": "iedgfo8",
            "parent_id": "t1_ie9qepo",
            "score": 7,
            "created_utc": 1656625509.0,
            "replies": [
                {
                    "body": "I totally agree with you. The first time it happen it should've been enough for me to end it. It was just tough. Her father had passed and when I tried leaving she guilt tripped me by saying all the guys in her life either die or leave her. She was very manipulative and we had history. 2.5 year relationship. I should've left when I wasn't getting what I expected.",
                    "author": "KanyeAsada420Grower",
                    "id": "iedhe24",
                    "parent_id": "t1_iedgfo8",
                    "score": 2,
                    "created_utc": 1656625898.0,
                    "replies": [
                        {
                            "body": "yikes! i’m so sorry you had to deal with that. some SBs just are not emotionally healthy enough for relationships at all, let alone sugar dating and it winds up negatively impacting their partners and leaves everyone with a bad taste. live and learn though, none of us are perfect and i know from experience that it takes time to learn how to stop ignoring red flags early on lol",
                            "author": "dumpst3rj3di",
                            "id": "iedip6f",
                            "parent_id": "t1_iedhe24",
                            "score": 2,
                            "created_utc": 1656626434.0,
                            "replies": [
                                {
                                    "body": "Appreciate it. I totally agree with you 💯 thanks for your comments and insight. I feel like I hit the lotto with my current sb. She's amazing and we have great chemistry. She has a heart or gold",
                                    "author": "KanyeAsada420Grower",
                                    "id": "iedjpjd",
                                    "parent_id": "t1_iedip6f",
                                    "score": 2,
                                    "created_utc": 1656626833.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "It hurt finding out that she would tell the truth to complete strangers on tiktok live, but couldn't be honest with me. I should've cut her off sooner.",
                    "author": "KanyeAsada420Grower",
                    "id": "iedk264",
                    "parent_id": "t1_iedgfo8",
                    "score": 1,
                    "created_utc": 1656626976.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "So do you treat your new SB right and provide allowance and gifts?",
            "author": null,
            "id": "iea1o4s",
            "parent_id": "t1_ie9qepo",
            "score": 5,
            "created_utc": 1656562599.0,
            "replies": [
                {
                    "body": "We are starting out on a PPM then once I trust her ill provide her an allowance. We talk everyday. And yes providing gifts.",
                    "author": "KanyeAsada420Grower",
                    "id": "iea23te",
                    "parent_id": "t1_iea1o4s",
                    "score": 5,
                    "created_utc": 1656562856.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "So seek vanilla dating because you’re honestly warping the bowl for the rest of us. “Sbs” like this are why I get offered 2 hundos for penetration in their car. Yeah, no thank you sir. You talk about all this money you get and this is your offer to me and others? Erm. Hard pass. Problem with you girlie is you’re legit seeking vanilla relationship and the sds don’t have the time or desire to give what you want. They’d prefer the lowball ppm and end it after several meet ups.\n\nAll they see in what you want is free. In the end you’ll have wasted time and nothing to show for it. But hey, at least they’re upvoting you haha.\n\nEdit: My bad haha, definitely read it as you don’t want an allowance. Now I’m seeing you most definitely want an allowance. Make sure to know your worth and don’t take these crap offers so many are offering 2022.",
            "author": "Whoisthatgirlleah",
            "id": "ieo8sov",
            "parent_id": "t1_ie9mvx1",
            "score": 3,
            "created_utc": 1656833615.0,
            "replies": []
        },
        {
            "body": "You are just the type I go for! And often find! Some women in this lifestyle only see the money (as some guys only see the sex) but for those of us who want a connection and a relationship (of some kind) it’s different. Kindness, humour, intellect, shared interests etc become as important as the money/sex. Sometimes more important.",
            "author": null,
            "id": "iea92dy",
            "parent_id": "t1_ie9mvx1",
            "score": 7,
            "created_utc": 1656567283.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "ie9zwur",
            "parent_id": "t1_ie9mvx1",
            "score": -5,
            "created_utc": 1656561622.0,
            "replies": [
                {
                    "body": "She said ‘anything beyond allowance’.",
                    "author": null,
                    "id": "iea7ic3",
                    "parent_id": "t1_ie9zwur",
                    "score": 5,
                    "created_utc": 1656566244.0,
                    "replies": []
                },
                {
                    "body": "How do you figure?",
                    "author": null,
                    "id": "iea0lq2",
                    "parent_id": "t1_ie9zwur",
                    "score": 2,
                    "created_utc": 1656562014.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "iea3ci8",
                            "parent_id": "t1_iea0lq2",
                            "score": -7,
                            "created_utc": 1656563605.0,
                            "replies": [
                                {
                                    "body": "Right... Which is what I said in my comment.",
                                    "author": null,
                                    "id": "iea3ebx",
                                    "parent_id": "t1_iea3ci8",
                                    "score": 11,
                                    "created_utc": 1656563636.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "That's called a Sugar BoyFriend (SBF) and it's pretty normal.  All of my SRs have been this way.",
                    "author": "SD1971",
                    "id": "ieas0mc",
                    "parent_id": "t1_ie9zwur",
                    "score": 2,
                    "created_utc": 1656582346.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Most SB's I meet are exactly like you but it is rare to see those types on SLF.",
            "author": null,
            "id": "iebceeu",
            "parent_id": "t1_ie9mvx1",
            "score": 1,
            "created_utc": 1656595057.0,
            "replies": [
                {
                    "body": "Exactly brother - I feel like im living in an alternate universe on SLF.\n\nI’ve literally never met one IRL who expects gifts, i dont sell going out for luxury lifestyle stuff at all (just basically tell them we wont roll super cheap - like if we go out we can do whatever you want - but Im mostly an outdoor/home guy). \n\nI offer an above-average PPM and foreground a few of my advantages (low demands about time and extracurricular contact unless it progresses, understanding of boundaries, previous experiences that went well).\n\nI have never been refused an MG based on that.",
                    "author": "JDMultralight",
                    "id": "ieliku4",
                    "parent_id": "t1_iebceeu",
                    "score": 1,
                    "created_utc": 1656781790.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I think you’re ultimately right but I think CEOS Athletes and movie stars are on the extreme end of hard workers.\n\nOnly tangentially related but there was some surprising sociological work done on contemporary elite families in NYC and the researcher found that the overwhelming trend in these families - if you measure the amount of time spending doing work-like things they’re through the fucking roof.  She described it as a “cult of work”.",
            "author": "JDMultralight",
            "id": "ieljuuq",
            "parent_id": "t1_ie9uu8y",
            "score": 2,
            "created_utc": 1656782344.0,
            "replies": []
        },
        {
            "body": "Bookstore 📚!? Nice! Wish I could spoil a SB in a bookstore or at least buy off her Amazon wish-list of selected books.",
            "author": "genericMaker",
            "id": "iec2qfj",
            "parent_id": "t1_ie9tdkg",
            "score": 4,
            "created_utc": 1656605989.0,
            "replies": []
        },
        {
            "body": "Thank you. People are so absolutist in their thinking these days. Not everything has to be uniform; there is a lot of nuance to life, culture, humans, etc.",
            "author": "TimeIsFractal",
            "id": "iea7bpv",
            "parent_id": "t1_ie9tdkg",
            "score": 6,
            "created_utc": 1656566122.0,
            "replies": [
                {
                    "body": "Exactly. I had a SD who loved that I played violin so on our first date he brought me tickets to an amazing orchestra. Something that I used to love to do outside of playing. It hands down was one of the best gifts I received and we went together. Not to costly for him but the consideration and attention to my likes and the effort and the childhood memories that act simply did was huge to me. So to me spoiling goes outside of designers . Getting spoiled emotionally and mentally is vital and sometimes can be better. Lol",
                    "author": "fleurdelunaholistics",
                    "id": "iea8r0o",
                    "parent_id": "t1_iea7bpv",
                    "score": 6,
                    "created_utc": 1656567071.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "She never talked about a 4-5 figure purse but about going beyond the allowance. The man you're describing is definitely spoiling you and he is above the average SD here",
            "author": "WiseRequirement9277",
            "id": "iebkazk",
            "parent_id": "t1_ie9tdkg",
            "score": 3,
            "created_utc": 1656598586.0,
            "replies": [
                {
                    "body": "You might want to reread what I said. I don't accept 4 figure purses. What I was saying was alot of sbs in general feel that extravagant gifts and 5 star trips and extra money  is the preferred way of spoiling.",
                    "author": "fleurdelunaholistics",
                    "id": "iebm3l2",
                    "parent_id": "t1_iebkazk",
                    "score": 0,
                    "created_utc": 1656599334.0,
                    "replies": [
                        {
                            "body": "Because that's their preferred one. Yours is investment. Both are valid and still spoiling",
                            "author": "WiseRequirement9277",
                            "id": "iebnb42",
                            "parent_id": "t1_iebm3l2",
                            "score": 4,
                            "created_utc": 1656599836.0,
                            "replies": []
                        },
                        {
                            "body": "I think you’re getting confused. This post isn’t about how to spoil, just that it should happen. Yours is happening. It’s not to argue the type of spoiling, just the existence. :)",
                            "author": "Cdnsugarr",
                            "id": "iebr9ma",
                            "parent_id": "t1_iebm3l2",
                            "score": 3,
                            "created_utc": 1656601439.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Rudyard, sorry had to.",
            "author": "sparky_SD16",
            "id": "ieb4xgg",
            "parent_id": "t1_iea59cd",
            "score": 1,
            "created_utc": 1656591227.0,
            "replies": [
                {
                    "body": "Thanks, inadvertantly added to the humor maybe?😂",
                    "author": "patienceisavirtue5",
                    "id": "iebd6sl",
                    "parent_id": "t1_ieb4xgg",
                    "score": 1,
                    "created_utc": 1656595432.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Brilliant!",
            "author": "Stickley1",
            "id": "iecb1mi",
            "parent_id": "t1_iea59cd",
            "score": 1,
            "created_utc": 1656609250.0,
            "replies": []
        },
        {
            "body": "Ew",
            "author": "Stella_bby554",
            "id": "iep7vxg",
            "parent_id": "t1_iea0myz",
            "score": 3,
            "created_utc": 1656858548.0,
            "replies": []
        },
        {
            "body": "Maybe the ugly ones, but no hot younger woman is easy",
            "author": null,
            "id": "ieaas8p",
            "parent_id": "t1_iea9jxz",
            "score": 5,
            "created_utc": 1656568460.0,
            "replies": []
        },
        {
            "body": "Wait till you start considering relationships.  We’re not attuned to the same things they are so they get upset.  Makes sense when they verbalize whats going on but good fucking luck anticipating these things.  Women are a labyrinth of turn offs and hot buttons - men are impenetrable walls of stupid.",
            "author": "JDMultralight",
            "id": "iebpwwa",
            "parent_id": "t1_iea9jxz",
            "score": 2,
            "created_utc": 1656600892.0,
            "replies": []
        },
        {
            "body": "Well said, guarantee the OP does not \"treat you better\" when \"spoiled right\".",
            "author": "JohnnyKemmer009",
            "id": "iecqri7",
            "parent_id": "t1_ie9ro3h",
            "score": 5,
            "created_utc": 1656615463.0,
            "replies": []
        },
        {
            "body": "OP sounds like a mean person",
            "author": "UnearthlyDinosaur",
            "id": "iec8eaw",
            "parent_id": "t1_ie9ro3h",
            "score": 4,
            "created_utc": 1656608200.0,
            "replies": [
                {
                    "body": "Correct. Have an upvote.",
                    "author": "JohnnyKemmer009",
                    "id": "iecqsi1",
                    "parent_id": "t1_iec8eaw",
                    "score": 1,
                    "created_utc": 1656615473.0,
                    "replies": []
                },
                {
                    "body": "Right, feeling entitled to basic respect is just so mean. How dare these women demand to be treated like human beings? \n\n/s",
                    "author": "oliviamc99",
                    "id": "iectfix",
                    "parent_id": "t1_iec8eaw",
                    "score": 1,
                    "created_utc": 1656616492.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Lol , i had the exact same thought",
            "author": "OCbird22",
            "id": "iea01jw",
            "parent_id": "t1_ie9tyn6",
            "score": 5,
            "created_utc": 1656561695.0,
            "replies": []
        },
        {
            "body": "It goes both ways",
            "author": "Iooklike_my_pictures",
            "id": "ieaft30",
            "parent_id": "t1_ie9tyn6",
            "score": -1,
            "created_utc": 1656572189.0,
            "replies": []
        },
        {
            "body": "Wait that’s so sad 🥲 hopefully one day you’ll find someone who is as enthusiastic as you are about her!",
            "author": "Sugarcookie54321_",
            "id": "iebe26j",
            "parent_id": "t1_iebcwz2",
            "score": 1,
            "created_utc": 1656595840.0,
            "replies": [
                {
                    "body": "My SRs have all been long and enjoyable.  The spoiling discrepancy is something that while consistent doesn’t detract from the overall relationship.",
                    "author": "Alienrite",
                    "id": "iebeduc",
                    "parent_id": "t1_iebe26j",
                    "score": 1,
                    "created_utc": 1656595992.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Let her know how you feel.  My SD told me he doesn't want me thanking him for money.  He says he gives it to me because he wants to and doesn't want to be thanked.",
            "author": "OldCommand4010",
            "id": "iecl6rx",
            "parent_id": "t1_iebcwz2",
            "score": 1,
            "created_utc": 1656613256.0,
            "replies": [
                {
                    "body": "I understand that dynamic…it’s nice to separate $ from the dating and mostly we don’t talk about the allowance except to acknowledge it’s been received.  \n\nI’m in a quandary about asking because then her spoiling me is not given but taken.   But relationships are only as good as the communication so I’ll work on finding a kind and appropriate way to speak about it.   \n\nThank you",
                    "author": "Alienrite",
                    "id": "iecuvnz",
                    "parent_id": "t1_iecl6rx",
                    "score": 1,
                    "created_utc": 1656617044.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "You know I hear this sometimes, and it's like... You guys are wanting to date women who you normally would not be able to date, without the financial part right? SO WHAT EXTRA ARE YOU WANTING FROM THEM BESIDES THE DATING WOMEN THAT YOU NORMALLY WOULD NOT BE ABLE TO DATE PARTS? They're DATING YOU, all things included of dating, when they normally WOULD NOT, because you are providing an allowance. \n\n&#x200B;\n\nAre we talking you need your car detailed, you want us to shine your shoes, organize your filing cabinet, sharpen all your pencils, cut the grass, plan out a meal calendar for the month? What above and beyond are we talking about here?",
            "author": null,
            "id": "ie9qcoh",
            "parent_id": "t1_ie9o8gz",
            "score": 12,
            "created_utc": 1656556590.0,
            "replies": [
                {
                    "body": "What don't you get? The allowance covers everything under the dating umbrella. That is the point isn't it? If you feel like the allowance doesn't suffice for the gap in vanilla compatibility, then you've done a poor job at selecting him.\n\nIf you are expecting someone to provide you with extras such as a new car, then the question really is to ask yourself if you are making similar gestures. Are you going on overnights without expecting anything? Are you making extra time for him? Are you doing thoughtful gestures like cooking or baking randomly?\n\nThere are many ways to express yourself and to put in extra effort into being a good sugar partner without expecting sex or money in return. That is what we mean by it. If you are the type to only motivate yourself to make an effort when the allowance is at play, then you are unlikely to be the type someone wants to spoil above and beyond. \n\nTake that coming from someone who provides an allowance 4-5 times the area average and who provides experiences with vacations and high cost dates all the time. If you specifically want something outside the agreement that is enjoyable only to you personally, you need to make effort to do things that the other person finds enjoyable.",
                    "author": "YlangScent",
                    "id": "ieb07pa",
                    "parent_id": "t1_ie9qcoh",
                    "score": 3,
                    "created_utc": 1656588414.0,
                    "replies": [
                        {
                            "body": "I don't get what more could be \"above and beyond\" besides the normal things in dating, which encompasses the things you've listed. I guess that is not typically happening for you guys in your experiences, but it is typical for me when I'm dating someone.",
                            "author": null,
                            "id": "ieb0mww",
                            "parent_id": "t1_ieb07pa",
                            "score": 2,
                            "created_utc": 1656588687.0,
                            "replies": [
                                {
                                    "body": "The problem is that you are probably a good egg.\n\nBy nature of that, you don't quite understand how bad some of your peers are because you don't have to deal with them. \n\nI am lucky in the regard that I am fairly young and being with me apparently isn't that big of a stretch. But I still had to learn to really filter properly to find the women like you. \n\nThere are a whole bunch of 'SBs' out there who are simply on the clock and out to just drain you rather than to have you improve their life in a relationship style connection.\n\nThey feel entitled to your wealth and expect all of it without putting in any effort at all. I mean damn woman, I am giving you a 5 digit allowance and just paid for your tuition, yet you still want to 'charge' me for a lunch when you were near a conference I was attending?\n\nSome people are highly motivated by greed and just think that because you own something, they should constantly be leeching it. The entitlement is a turn off and it took me quite a while to accept that it is best to just hold off on generosity above and beyond till it becomes clear she is the same type of person.",
                                    "author": "YlangScent",
                                    "id": "ieb46e9",
                                    "parent_id": "t1_ieb0mww",
                                    "score": 3,
                                    "created_utc": 1656590798.0,
                                    "replies": [
                                        {
                                            "body": "[removed]",
                                            "author": null,
                                            "id": "ieb5cy1",
                                            "parent_id": "t1_ieb46e9",
                                            "score": 1,
                                            "created_utc": 1656591464.0,
                                            "replies": [
                                                {
                                                    "body": "I think that is a lot of effort from your side and to be honest not something I can understand not giving support for. It clearly cost you a bunch of cash for gas and the sitter at the very least.\n\nI can't speak to him as a person of course, but for the record, that isn't what I personally would consider above and beyond. This clearly cost you a tangible amount of money after all.\n\nAbove and beyond for me would be if you decided to write me a lovely note, craft me something or even bake me a cookie or whatever. It's the thought that counts.",
                                                    "author": "YlangScent",
                                                    "id": "iebcpnz",
                                                    "parent_id": "t1_ieb5cy1",
                                                    "score": 1,
                                                    "created_utc": 1656595205.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Would you like a list of examples? While on an allowance, ask:\n\n  \n\\-if you can do overnights\n\n\\-if you can see him more than you normally would\n\n\\-if he would like to do a mini-vacation over an extended weekend\n\nBasically, take all the things that you would normally think about expecting a guy to provide more for, and do something from that list with no expectation for more.  You know, the opposite of what OP is asking - to have the SB spoil the SD beyond the agreement.",
                    "author": "jerdle",
                    "id": "ie9wu62",
                    "parent_id": "t1_ie9qcoh",
                    "score": 7,
                    "created_utc": 1656559926.0,
                    "replies": [
                        {
                            "body": "You know what completely boggles my mind.... everything you listed is so simple and so obvious. Why does it completely escape your average SB (and woman)?",
                            "author": "AustinMetz18",
                            "id": "ie9zbcl",
                            "parent_id": "t1_ie9wu62",
                            "score": 7,
                            "created_utc": 1656561287.0,
                            "replies": []
                        },
                        {
                            "body": "Those things are encompassed in \"dating\".",
                            "author": null,
                            "id": "iea0qs4",
                            "parent_id": "t1_ie9wu62",
                            "score": 3,
                            "created_utc": 1656562094.0,
                            "replies": [
                                {
                                    "body": "In 5 years of sugar dating, #1 and #3 were never approached from the SB first.  #2 has happened with one SB.  The 'all aspects of dating' is NOT the norm.  The norm is 'kinda-sorta' dating.",
                                    "author": "jerdle",
                                    "id": "iea77ub",
                                    "parent_id": "t1_iea0qs4",
                                    "score": 5,
                                    "created_utc": 1656566049.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Anal and threesome\nAnd giving them one fuck free for 4 paid",
                    "author": "WiseRequirement9277",
                    "id": "iebky4p",
                    "parent_id": "t1_ie9qcoh",
                    "score": 1,
                    "created_utc": 1656598852.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Hotwheels",
            "author": "timrid",
            "id": "ie9sfzl",
            "parent_id": "t1_ie9o8gz",
            "score": 2,
            "created_utc": 1656557637.0,
            "replies": [
                {
                    "body": "Oh no, she explicitly calls out for it to be a $30,000 car and if you tell her no you're \"not for her at all\"",
                    "author": "jerdle",
                    "id": "ie9x0lm",
                    "parent_id": "t1_ie9sfzl",
                    "score": 2,
                    "created_utc": 1656560023.0,
                    "replies": []
                }
            ]
        },
        {
            "body": ">OP, what are you doing to go above and beyond?\n\nShe's having sex with someone ***SHE*** normally wouldn't go for. That's above and beyond. There's POT SDs out there and I've personally became asthmatic when I heard they getting sex AND they were married because.....HOW? Lol. It sounds mean, but I'm truly not trying to be mean.\n\nAnd their PPM isn't enough to shake the table, so I get flabbergasted at times.",
            "author": "DottiesHotSake",
            "id": "ie9x8v8",
            "parent_id": "t1_ie9o8gz",
            "score": 1,
            "created_utc": 1656560146.0,
            "replies": [
                {
                    "body": "> she’s having sex with someone she normally wouldn’t go for \n\nAndddd he’s paying for that opportunity when most men wouldn’t. Seems pretty well balanced. \n\nThe question is why spoil her extra. Is she spoiling _him_ extra?",
                    "author": null,
                    "id": "ieaamkn",
                    "parent_id": "t1_ie9x8v8",
                    "score": 4,
                    "created_utc": 1656568350.0,
                    "replies": [
                        {
                            "body": "It will NEVER be balanced in a situation where the SD makes more than her and has the access to multiple women using his money.\n\nThe most I've heard men want women to do for them is to have great sex as spoiling and if she's doing that, then what more does he want? I'm not being calloused or insensitive, but I truly don't get what a married man who I won't have for a long time really wants.\n\nIf she's giving him sleepovers, texting, calling, being attentive to his needy ass, monogamy, coddling him, what ELSE does he want since he's not divorcing his wife??",
                            "author": "DottiesHotSake",
                            "id": "iec1y1k",
                            "parent_id": "t1_ieaamkn",
                            "score": 0,
                            "created_utc": 1656605677.0,
                            "replies": [
                                {
                                    "body": "> access to multiple women using his money \n\nDoesn’t a SB have access to multiple men if she wants? Again, both the SD and the SB seem to have a balanced situation here. SDs can spend their money on multiple women, SBs can earn extra money having multiple SDs\n\n> what else does he want  \n\nThe sleepovers, monogamy, etc that you mentioned are not always given. Most SBs don’t offer those unless pushed. To me, those things _do_ count as extra the SB is doing for the SD. In those cases, the SD probably should spoil her extra in return",
                                    "author": null,
                                    "id": "ied21qy",
                                    "parent_id": "t1_iec1y1k",
                                    "score": 1,
                                    "created_utc": 1656619826.0,
                                    "replies": [
                                        {
                                            "body": ">Doesn’t a SB have access to multiple men if she wants? Again, both the SD and the SB seem to have a balanced situation here. SDs can spend their money on multiple women, SBs can earn extra money having multiple SDs\n\nIt's heavily frowned upon if SBs have multiple SDs and we're considered \"pros\" if we do that. It's more easier to find ANY woman to be an SB and give sex and feigned attention than it is to find an SD who is financially capable of having an arrangement. \n\nWith respect, I can't blame SOME sbs for not providing certain things to SDs because sometimes, the PPM doesn't reflect it the requests that's being asked. This just happened to me yesterday, a POT SD who is married only wanted an oral sex arrangement. Doesn't seem like a bad idea, right? For 300 tacos, he wanted MONOGAMY as in  for me to not go on dates with other as well as no sex and he wasn't going to sexually satisfy me. Because I'm not a dirt bag, I couldn't promise him that and rather not put someone's health in jeopardy, but it wasn't enough for me to be monogamous to someone AND me not being sexually satisfied. \n\nIt's great that the men on Reddit are able to provide great allowances and if my monthly allowance was in the 2XXX range, best believe you wouldn't have to tell me twice or wait for me to suggest something. But in the real world, there's a lot of mediocre monthly allowances and outlandish demands on SDs expectations which is why some SDs have trouble finding SBs.",
                                            "author": "DottiesHotSake",
                                            "id": "ieed0fi",
                                            "parent_id": "t1_ied21qy",
                                            "score": 1,
                                            "created_utc": 1656640168.0,
                                            "replies": [
                                                {
                                                    "body": "> it’s heavily frowned upon if SBs have multiple SDs\n\nI agree a lot of SDs are controlling and insist on monogamy. However it’s not like a sugar relationship is a marriage where everything must be disclosed. If I was a SB, I’d have multiple SDs and just not tell them. \n\nAs for the rest, we seem to agree that it needs to be fair for the SB and the SD. 3XX isn’t a fair agreement for an oral sex arrangement with monogamy. Fuck that dude.",
                                                    "author": null,
                                                    "id": "iehpkjh",
                                                    "parent_id": "t1_ieed0fi",
                                                    "score": 1,
                                                    "created_utc": 1656704710.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I just read a post a few days ago written by an old man .. he doesn’t give ppm or allowance. He only pays pills. Like she has to stay with him long enough (maybe a few weeks to prove) then he pays her University fees .. \n\nI think the entire sugar relationship is very confusing. Everyone is doing it differently. I bet that old man is frustrated. Not many girls will have sex with him for free for a few weeks. How can he prove he can follow through? 🤔 \n\nTreating someone right means different things to different people. So vague .. \n\nTreating a gold digger right means giving her all your money - that actually sounds like divorce lol",
            "author": null,
            "id": "iebdt73",
            "parent_id": "t1_ieapxv4",
            "score": 2,
            "created_utc": 1656595724.0,
            "replies": [
                {
                    "body": "There's a culture and that old man story, men offering scholarships and such are the worst, they'll turn the SB into a sex slave and won't deliver on their promises. \n\nIt should be fair at each meet, hence why there is the PPM standard, but the girls often don't want to learn about the culture until they get played, they are not in a place where they think objectively about it.",
                    "author": "sugardad123",
                    "id": "iebgt1k",
                    "parent_id": "t1_iebdt73",
                    "score": 1,
                    "created_utc": 1656597082.0,
                    "replies": [
                        {
                            "body": "Well, anyway when I saw that post, I felt so lucky I never dated anyone like that because I could totally see I fall into a victim of these sort of narcissistic man. \n\nI need my man to be kind, compassionate and have morality and self introspection. Or I will repeat the miserable years again with my ex boyfriend. 🙈",
                            "author": null,
                            "id": "iecerny",
                            "parent_id": "t1_iebgt1k",
                            "score": 1,
                            "created_utc": 1656610727.0,
                            "replies": [
                                {
                                    "body": "Us empaths understand each other. I've been with an ASPD and now I can spot the dark triad traits in a room full of strangers, damnit why are they so charming! :)",
                                    "author": "sugardad123",
                                    "id": "iecleo3",
                                    "parent_id": "t1_iecerny",
                                    "score": 1,
                                    "created_utc": 1656613344.0,
                                    "replies": [
                                        {
                                            "body": "Well, I am not anti social I am just selectively social introvert :)\n\nYes I often get attracted to introverted men. \nMy last and current SD are both INFJ. \n\nIt’s very strange My emotional connection with the last one is much stronger. \nWe are both INFJ-T.. I think the turbulence trait makes us resonate with each other much more. \n\nThe current guy is INFJ-A .. his assertive vibe gives me he’s more like INTJ sometimes but later I got him to do the test and came out as INFJ.. also he’s very expressive so I believe he’s more feeler than thinker. \n\nWhat are you? I think you might be an INFP male? 🤔🙂",
                                            "author": null,
                                            "id": "iedfnff",
                                            "parent_id": "t1_iecleo3",
                                            "score": 1,
                                            "created_utc": 1656625192.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Most? Who “most” you referring to?",
            "author": "Iooklike_my_pictures",
            "id": "ieafcnq",
            "parent_id": "t1_ieaaamy",
            "score": 0,
            "created_utc": 1656571831.0,
            "replies": [
                {
                    "body": "Most = pretty much all the SDs on this thread. Happy to dig up a few other topics too\n\nMost men are happy to spoil their SB if she takes care of him in return. The problem is that many SBs are entitled and think they deserve extravagance at every meeting when they are doing the minimum and just showing up.",
                    "author": null,
                    "id": "ied2e0z",
                    "parent_id": "t1_ieafcnq",
                    "score": 1,
                    "created_utc": 1656619956.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Acting like you would have any chance with these beautiful women without the sugar aspect is a great way to scare off sugar babies. 🤍",
            "author": "Stella_bby554",
            "id": "iebnzes",
            "parent_id": "t1_ieao6kp",
            "score": 2,
            "created_utc": 1656600113.0,
            "replies": [
                {
                    "body": "SDs are aware they are getting beautiful women that are often out of our league. That’s why we are paying, we get it. \n\nThe problem is women who expect extravagance beyond what is typical in a sugar relationship. They are often making thousands just showing up for dates but still don’t think it’s enough. That’s entitlement",
                    "author": null,
                    "id": "ied3rf1",
                    "parent_id": "t1_iebnzes",
                    "score": 2,
                    "created_utc": 1656620489.0,
                    "replies": [
                        {
                            "body": "It’s not your decision to decide how much someone else is worth. Period. 🤍",
                            "author": "Stella_bby554",
                            "id": "iegs2bc",
                            "parent_id": "t1_ied3rf1",
                            "score": 1,
                            "created_utc": 1656691013.0,
                            "replies": [
                                {
                                    "body": "Some of you SBs take this way too personally and start to believe your worth is what a SD will pay you. You’re a human, not a PPM amount. Stop valuing yourself based on how much money you get \n\nThat being said, it’s the SD who is deciding how much your time is worth. If you say “I’m worth $XXXX” for a ppm and it doesn’t seem worth it, we’ll just find another girl.",
                                    "author": null,
                                    "id": "iehoouh",
                                    "parent_id": "t1_iegs2bc",
                                    "score": 1,
                                    "created_utc": 1656704348.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Well given you’ve never been attracted to any sugar daddy you’ve seenI’m not surprised you had this reply",
                    "author": "wb19081908",
                    "id": "iebvmi0",
                    "parent_id": "t1_iebnzes",
                    "score": 1,
                    "created_utc": 1656603186.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Given that SDs almost universally pick up the tab at M&G's, there is, in fact, free lunch",
            "author": "sinperviren",
            "id": "ie9yzxs",
            "parent_id": "t1_ie9n929",
            "score": 12,
            "created_utc": 1656561109.0,
            "replies": [
                {
                    "body": "Yes lots of free lunches 🤣🤣🤣",
                    "author": null,
                    "id": "iea7o7o",
                    "parent_id": "t1_ie9yzxs",
                    "score": 3,
                    "created_utc": 1656566349.0,
                    "replies": []
                },
                {
                    "body": "Maybe You don’t comprehend that there is something expected in return?",
                    "author": "KingofHearts0087",
                    "id": "ieat4q4",
                    "parent_id": "t1_ie9yzxs",
                    "score": 3,
                    "created_utc": 1656583258.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Tanstaafl!",
            "author": "timrid",
            "id": "ie9sove",
            "parent_id": "t1_ie9n929",
            "score": 3,
            "created_utc": 1656557764.0,
            "replies": []
        },
        {
            "body": "MICHELLE OBAMA DISAGREES.",
            "author": null,
            "id": "ie9nr3c",
            "parent_id": "t1_ie9n929",
            "score": 7,
            "created_utc": 1656555321.0,
            "replies": [
                {
                    "body": "Literal LOL. Thank you for this comment.",
                    "author": "HailToTheQuinn",
                    "id": "ie9yp9g",
                    "parent_id": "t1_ie9nr3c",
                    "score": 3,
                    "created_utc": 1656560946.0,
                    "replies": []
                },
                {
                    "body": "Lol",
                    "author": "clair-cummings",
                    "id": "iea0di7",
                    "parent_id": "t1_ie9nr3c",
                    "score": 2,
                    "created_utc": 1656561884.0,
                    "replies": []
                },
                {
                    "body": "Someone is paying for that free lunch. And there are returns to be collected.",
                    "author": "KingofHearts0087",
                    "id": "ie9q5c0",
                    "parent_id": "t1_ie9nr3c",
                    "score": 1,
                    "created_utc": 1656556488.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "No Free Lunch? So I’m supposed to be okay with going hungry while SD and his daughter are eating, and I’m unable get food on my own? I shouldn’t expect to have my basic needs met while accompanying him on vacation? I guess getting an allowance means he doesn’t have to treat me like a human being.",
            "author": "oliviamc99",
            "id": "iecucqr",
            "parent_id": "t1_ie9n929",
            "score": 0,
            "created_utc": 1656616842.0,
            "replies": [
                {
                    "body": "Maybe You do not understand what a metaphor is, looks like that is the case. I suggest learning a thing or two about life before making accusations.\n\nBut I will spell it out for you, the concept of “No Free Lunch,” means that the SD is expecting something in return. Unless your with your husband, or parent, or relative, someone is expecting a return in that lunch they bought you.\n\nFor SR, that is the norm. So get with the program, learn a think or two.",
                    "author": "KingofHearts0087",
                    "id": "iecy7nq",
                    "parent_id": "t1_iecucqr",
                    "score": 3,
                    "created_utc": 1656618336.0,
                    "replies": [
                        {
                            "body": "I just saw this. Read what I said more carefully. I had held up my end of the arrangement completely. I was accompanying him and his daughter on vacation. He would not give me food while he and his daughter were eating in the hotel room, and he threw me out when I complained that I didn’t feel well due to low blood sugar. If you are an SD taking your SB on vacation, you are responsible for her basic physiological needs such as food and water, and for her safety. You can’t just suddenly decide you don’t want to provide for those needs and force her to figure out a way home on her own. That is what happened to me and it’s unacceptable. You need to learn a thing or two about the power dynamics of sugar relationships, and how women have to keep themselves safe when dating.",
                            "author": "oliviamc99",
                            "id": "iijo8xy",
                            "parent_id": "t1_iecy7nq",
                            "score": 1,
                            "created_utc": 1659381951.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "🤣🤣🤣\n\nIt’s kind of like women saying they want this type of guy but end up going for the total opposite",
            "author": "UnearthlyDinosaur",
            "id": "iec8iaf",
            "parent_id": "t1_ie9qeiw",
            "score": 3,
            "created_utc": 1656608244.0,
            "replies": [
                {
                    "body": "Always",
                    "author": null,
                    "id": "iee9izt",
                    "parent_id": "t1_iec8iaf",
                    "score": 1,
                    "created_utc": 1656638470.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I look at the three A words I am thinking many women want that too. It’s common sense isn’t it? Humans aren’t that all different .. 😊",
            "author": null,
            "id": "iebe7iz",
            "parent_id": "t1_ieb98hu",
            "score": 0,
            "created_utc": 1656595910.0,
            "replies": []
        },
        {
            "body": "Girllll this!!!! These men think we will bed them without the financial aspect. We make a lot of compromise for them.",
            "author": "Iooklike_my_pictures",
            "id": "iecifzy",
            "parent_id": "t1_iebefoy",
            "score": 0,
            "created_utc": 1656612168.0,
            "replies": [
                {
                    "body": "What in the heck happened to you?\n\nDid you ask for something and not get it?\n\nOr were you hoping that your SD would go above and beyond what you mutually negotiated?\n\nReally curious about what triggered your rant. If you had an agreement and it’s being met, why is there a problem?",
                    "author": "ExpertPerformance",
                    "id": "ieddsxe",
                    "parent_id": "t1_iecifzy",
                    "score": 0,
                    "created_utc": 1656624441.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "You go, girl!  I couldn’t agree more! 👏🏻",
            "author": "Chill_SD1974",
            "id": "iecmcna",
            "parent_id": "t1_iebefoy",
            "score": 0,
            "created_utc": 1656613724.0,
            "replies": [
                {
                    "body": "Thank you chill 😤😤",
                    "author": "c0rnstarr",
                    "id": "ieeeyif",
                    "parent_id": "t1_iecmcna",
                    "score": 1,
                    "created_utc": 1656641108.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "ie9n294",
            "parent_id": "t1_ie9muta",
            "score": 8,
            "created_utc": 1656554989.0,
            "replies": [
                {
                    "body": "We shall call him the preying mantis of SLF.",
                    "author": null,
                    "id": "ie9n958",
                    "parent_id": "t1_ie9n294",
                    "score": 7,
                    "created_utc": 1656555081.0,
                    "replies": [
                        {
                            "body": "praying mantis not preying mantis (just another example of the triumph of illusion over reality)",
                            "author": "highfructoseSD",
                            "id": "ieap6ks",
                            "parent_id": "t1_ie9n958",
                            "score": 1,
                            "created_utc": 1656579947.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Extra credit for the use of the emojis. lol",
                    "author": "Y_4Z44",
                    "id": "ie9nyl6",
                    "parent_id": "t1_ie9n294",
                    "score": 4,
                    "created_utc": 1656555421.0,
                    "replies": []
                },
                {
                    "body": "I just had to be that guy to say it 🤷🏽‍♂️",
                    "author": "Thin_Bug_3775",
                    "id": "ie9nh60",
                    "parent_id": "t1_ie9n294",
                    "score": 2,
                    "created_utc": 1656555188.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Works for the mean time",
            "author": "Iooklike_my_pictures",
            "id": "ie9q0xw",
            "parent_id": "t1_ie9muta",
            "score": 0,
            "created_utc": 1656556429.0,
            "replies": []
        },
        {
            "body": "Bonefish and VS 💀",
            "author": null,
            "id": "iea1jua",
            "parent_id": "t1_ie9s7ig",
            "score": 13,
            "created_utc": 1656562529.0,
            "replies": [
                {
                    "body": "In Macon GA that's the top of the pyramid.",
                    "author": "zapzangboombang",
                    "id": "ieadehn",
                    "parent_id": "t1_iea1jua",
                    "score": 4,
                    "created_utc": 1656570357.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "LMFAOOO VS AND BONEFISH?!?! I’m dying",
            "author": "Sugarcookie54321_",
            "id": "iebdvhm",
            "parent_id": "t1_ie9s7ig",
            "score": 6,
            "created_utc": 1656595753.0,
            "replies": [
                {
                    "body": "It has to be a troll LOL.\n\nAnyway, cheap delusional wannabe SDs are a dime a dozen.",
                    "author": "LightOLove",
                    "id": "ieby636",
                    "parent_id": "t1_iebdvhm",
                    "score": 3,
                    "created_utc": 1656604197.0,
                    "replies": [
                        {
                            "body": "Definitely wannabes. Gosh I thought I was crazy here.",
                            "author": "Sugarcookie54321_",
                            "id": "iebybc9",
                            "parent_id": "t1_ieby636",
                            "score": 3,
                            "created_utc": 1656604256.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "iebe0d3",
                    "parent_id": "t1_iebdvhm",
                    "score": 2,
                    "created_utc": 1656595815.0,
                    "replies": [
                        {
                            "body": "I’m good love. Thanks 😙",
                            "author": "Sugarcookie54321_",
                            "id": "iebe824",
                            "parent_id": "t1_iebe0d3",
                            "score": 2,
                            "created_utc": 1656595917.0,
                            "replies": []
                        },
                        {
                            "body": "I think it's nice.",
                            "author": "OldCommand4010",
                            "id": "iecli88",
                            "parent_id": "t1_iebe0d3",
                            "score": 1,
                            "created_utc": 1656613383.0,
                            "replies": [
                                {
                                    "body": "Fyi the stuff is made with slave labor in prison tho.  🙀",
                                    "author": "OldCommand4010",
                                    "id": "ieclt1c",
                                    "parent_id": "t1_iecli88",
                                    "score": 1,
                                    "created_utc": 1656613504.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Taking a SB to Victoria Secret is treating her right?…its like you’re buying the lingerie mostly for yourself to enjoy tho",
            "author": "Naked_Werewolf1283",
            "id": "ie9xebw",
            "parent_id": "t1_ie9s7ig",
            "score": 16,
            "created_utc": 1656560231.0,
            "replies": [
                {
                    "body": "I really hope that last part was tongue in cheek sarcasm.",
                    "author": "clair-cummings",
                    "id": "iea09en",
                    "parent_id": "t1_ie9xebw",
                    "score": 7,
                    "created_utc": 1656561820.0,
                    "replies": []
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "ie9z97c",
                    "parent_id": "t1_ie9xebw",
                    "score": -5,
                    "created_utc": 1656561253.0,
                    "replies": [
                        {
                            "body": "Ahahah yes because love wearing garter belt and stockings under my sweatpants….keep telling ur self that",
                            "author": "Naked_Werewolf1283",
                            "id": "iea6taa",
                            "parent_id": "t1_ie9z97c",
                            "score": 8,
                            "created_utc": 1656565779.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Genuine SB's looking for genuine relationships will find it harder to land a solid SD in short time BUT if the SB is a \"commercial\" SB, then she wont have much problem finding SDs aka clients as early as next week. She will call them SD or whatever but they may not be genuine SD's, just tourists.",
            "author": null,
            "id": "iebmzlj",
            "parent_id": "t1_ie9s7ig",
            "score": 4,
            "created_utc": 1656599705.0,
            "replies": []
        },
        {
            "body": "VS 🤣🤣🤣🤣",
            "author": "WiseRequirement9277",
            "id": "iebp1ea",
            "parent_id": "t1_ie9s7ig",
            "score": 2,
            "created_utc": 1656600541.0,
            "replies": []
        },
        {
            "body": "Not in my experience",
            "author": "Iooklike_my_pictures",
            "id": "ie9sb01",
            "parent_id": "t1_ie9s7ig",
            "score": -3,
            "created_utc": 1656557567.0,
            "replies": [
                {
                    "body": "Well, that's the point. You're making a massive generalization based on your own experience. Others are pointing out their experience has been the opposite.",
                    "author": "matthewjphillips",
                    "id": "ie9xk80",
                    "parent_id": "t1_ie9sb01",
                    "score": 7,
                    "created_utc": 1656560322.0,
                    "replies": []
                },
                {
                    "body": "Commercial SB's have no problem finding SD's quickly. Genuine SB's however take more time to land the ideal ones.",
                    "author": null,
                    "id": "iebn7t1",
                    "parent_id": "t1_ie9sb01",
                    "score": 2,
                    "created_utc": 1656599797.0,
                    "replies": []
                },
                {
                    "body": "They tell themselves this to make themselves feel better and make the woman feel devalued, therefore making her feel less worthy. They really don't know.",
                    "author": "clair-cummings",
                    "id": "iea06sb",
                    "parent_id": "t1_ie9sb01",
                    "score": 5,
                    "created_utc": 1656561779.0,
                    "replies": [
                        {
                            "body": "There was this SD whom I’ve been seeing for almost 2 months. He was bragging that he can have as many as he wants and im likeee… yeah if money is not involved, we wouldnt bother talking to you",
                            "author": "Iooklike_my_pictures",
                            "id": "ieag21e",
                            "parent_id": "t1_iea06sb",
                            "score": 3,
                            "created_utc": 1656572380.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "“Treat us right” means at least the bare minimum. Sticking to the agreed upon allowance. Providing basic needs when I’m in a situation where I rely on him. Examples of being devalued: him saying that he wants to see you more often, but that the originally agreed on PPM “isn’t worth it.” Refusing to allow me to have food while on vacation with him, and throwing me out to get back home 200 miles away on my own when I complain about it because I’m not feeling well. These are things that have happened to me and I have a right to be treated better than that. I do believe I am entitled to basic respect.",
            "author": "oliviamc99",
            "id": "iecrlgg",
            "parent_id": "t1_iea851g",
            "score": 2,
            "created_utc": 1656615784.0,
            "replies": []
        },
        {
            "body": "This sounds so painful! I’m guessing he’s no longer your SD.",
            "author": "daddoms",
            "id": "ieehyc7",
            "parent_id": "t1_iecm9wf",
            "score": 2,
            "created_utc": 1656642561.0,
            "replies": [
                {
                    "body": "Definitely not",
                    "author": "oliviamc99",
                    "id": "ifg23v7",
                    "parent_id": "t1_ieehyc7",
                    "score": 1,
                    "created_utc": 1657348627.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I like number three though for my last guy. Lol \nBut he’d never leave his wife for me.",
            "author": null,
            "id": "iebeq65",
            "parent_id": "t1_ieafrw0",
            "score": 1,
            "created_utc": 1656596147.0,
            "replies": []
        },
        {
            "body": "What about doggie or reverse cowgirl?",
            "author": "SD1070",
            "id": "iebzh3q",
            "parent_id": "t1_ieaseuv",
            "score": 2,
            "created_utc": 1656604711.0,
            "replies": [
                {
                    "body": "Okay that was funny and it took me a second 😂😂",
                    "author": "MercedesRose6969",
                    "id": "iedeayt",
                    "parent_id": "t1_iebzh3q",
                    "score": 1,
                    "created_utc": 1656624646.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "You know it’s less slumming it and more that Im incredibly attached to the little townhouse with my section 8 family next door because Ive lived here my whole adult life - and watched the kids grow into college-age (theyre so cute).",
            "author": "JDMultralight",
            "id": "ighkc94",
            "parent_id": "t1_igedrb9",
            "score": 1,
            "created_utc": 1658037227.0,
            "replies": [
                {
                    "body": "The self-awareness to live a simpler life and appreciate the simple joy of liking your neighbors is a path to happiness.",
                    "author": "SantaBSB",
                    "id": "ign44ac",
                    "parent_id": "t1_ighkc94",
                    "score": 3,
                    "created_utc": 1658151989.0,
                    "replies": [
                        {
                            "body": "Thats such a sweet thing to say!  Really nice to hear\n\nSome of the people close to me think my approach to life is weirdly an egotistical flourish - like Im trying to be special or put on a costume to look interesting.  Its nice to hear positive feedback",
                            "author": "JDMultralight",
                            "id": "igo7a75",
                            "parent_id": "t1_ign44ac",
                            "score": 2,
                            "created_utc": 1658167885.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "That does sound nice. It’s cool that you’re so close with your neighbors. Sorry if I came off rude.",
                    "author": "Rivergirl2878",
                    "id": "jcbe3cy",
                    "parent_id": "t1_ighkc94",
                    "score": 1,
                    "created_utc": 1678899799.0,
                    "replies": []
                }
            ]
        },
        {
            "body": ";]",
            "author": "malcolm_reyn0lds",
            "id": "ieaxiut",
            "parent_id": "t1_ieavhyq",
            "score": -1,
            "created_utc": 1656586603.0,
            "replies": []
        },
        {
            "body": "Women are attracted to dominant men, not people pleasers. An unfortunate reality for the nice guys out there.",
            "author": "SDinAsia",
            "id": "ie9xi7b",
            "parent_id": "t1_ie9oz0j",
            "score": 6,
            "created_utc": 1656560290.0,
            "replies": [
                {
                    "body": "The implication that dominance and kindness can’t coexist is odd. Also, women are attracted to a variety of men, women, and non-binary people, and a whole spectrum of personalities. Personally, I prefer emotionally intelligent guys, regardless of “dominance.” I’m also attracted to *gasp* submissive men.",
                    "author": "KetoSeaweed",
                    "id": "ieivub4",
                    "parent_id": "t1_ie9xi7b",
                    "score": 6,
                    "created_utc": 1656724071.0,
                    "replies": []
                },
                {
                    "body": "Better way to say that there are lots of things about dominant men that are attractive.  But if you actually go through the relationships in your whole extended friend group what you’ll find is that literally every kind of strength is thoroughly rewarded.\n\nNice guys do really well.  I don’t mean “nice guys” - Which means guys who dont know how to ever be assertive, and who women burden in subtle ways.\n\nAs far as the dominance relation between the man and woman, not letting her push you around is pretty much all you have to do.  That said, there are so many super hot women who marry guys and push them around or have a strong tendency to date guys they can push around.",
                    "author": "JDMultralight",
                    "id": "iebov62",
                    "parent_id": "t1_ie9xi7b",
                    "score": 3,
                    "created_utc": 1656600472.0,
                    "replies": []
                },
                {
                    "body": "Some, not all. I’ve found plenty of exceptions.",
                    "author": null,
                    "id": "iea8r2c",
                    "parent_id": "t1_ie9xi7b",
                    "score": 1,
                    "created_utc": 1656567072.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I totally agree with you. The first time it happen it should've been enough for me to end it. It was just tough. Her father had passed and when I tried leaving she guilt tripped me by saying all the guys in her life either die or leave her. She was very manipulative and we had history. 2.5 year relationship. I should've left when I wasn't getting what I expected.",
            "author": "KanyeAsada420Grower",
            "id": "iedhe24",
            "parent_id": "t1_iedgfo8",
            "score": 2,
            "created_utc": 1656625898.0,
            "replies": [
                {
                    "body": "yikes! i’m so sorry you had to deal with that. some SBs just are not emotionally healthy enough for relationships at all, let alone sugar dating and it winds up negatively impacting their partners and leaves everyone with a bad taste. live and learn though, none of us are perfect and i know from experience that it takes time to learn how to stop ignoring red flags early on lol",
                    "author": "dumpst3rj3di",
                    "id": "iedip6f",
                    "parent_id": "t1_iedhe24",
                    "score": 2,
                    "created_utc": 1656626434.0,
                    "replies": [
                        {
                            "body": "Appreciate it. I totally agree with you 💯 thanks for your comments and insight. I feel like I hit the lotto with my current sb. She's amazing and we have great chemistry. She has a heart or gold",
                            "author": "KanyeAsada420Grower",
                            "id": "iedjpjd",
                            "parent_id": "t1_iedip6f",
                            "score": 2,
                            "created_utc": 1656626833.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "It hurt finding out that she would tell the truth to complete strangers on tiktok live, but couldn't be honest with me. I should've cut her off sooner.",
            "author": "KanyeAsada420Grower",
            "id": "iedk264",
            "parent_id": "t1_iedgfo8",
            "score": 1,
            "created_utc": 1656626976.0,
            "replies": []
        },
        {
            "body": "We are starting out on a PPM then once I trust her ill provide her an allowance. We talk everyday. And yes providing gifts.",
            "author": "KanyeAsada420Grower",
            "id": "iea23te",
            "parent_id": "t1_iea1o4s",
            "score": 5,
            "created_utc": 1656562856.0,
            "replies": []
        },
        {
            "body": "She said ‘anything beyond allowance’.",
            "author": null,
            "id": "iea7ic3",
            "parent_id": "t1_ie9zwur",
            "score": 5,
            "created_utc": 1656566244.0,
            "replies": []
        },
        {
            "body": "How do you figure?",
            "author": null,
            "id": "iea0lq2",
            "parent_id": "t1_ie9zwur",
            "score": 2,
            "created_utc": 1656562014.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "iea3ci8",
                    "parent_id": "t1_iea0lq2",
                    "score": -7,
                    "created_utc": 1656563605.0,
                    "replies": [
                        {
                            "body": "Right... Which is what I said in my comment.",
                            "author": null,
                            "id": "iea3ebx",
                            "parent_id": "t1_iea3ci8",
                            "score": 11,
                            "created_utc": 1656563636.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "That's called a Sugar BoyFriend (SBF) and it's pretty normal.  All of my SRs have been this way.",
            "author": "SD1971",
            "id": "ieas0mc",
            "parent_id": "t1_ie9zwur",
            "score": 2,
            "created_utc": 1656582346.0,
            "replies": []
        },
        {
            "body": "Exactly brother - I feel like im living in an alternate universe on SLF.\n\nI’ve literally never met one IRL who expects gifts, i dont sell going out for luxury lifestyle stuff at all (just basically tell them we wont roll super cheap - like if we go out we can do whatever you want - but Im mostly an outdoor/home guy). \n\nI offer an above-average PPM and foreground a few of my advantages (low demands about time and extracurricular contact unless it progresses, understanding of boundaries, previous experiences that went well).\n\nI have never been refused an MG based on that.",
            "author": "JDMultralight",
            "id": "ieliku4",
            "parent_id": "t1_iebceeu",
            "score": 1,
            "created_utc": 1656781790.0,
            "replies": []
        },
        {
            "body": "Exactly. I had a SD who loved that I played violin so on our first date he brought me tickets to an amazing orchestra. Something that I used to love to do outside of playing. It hands down was one of the best gifts I received and we went together. Not to costly for him but the consideration and attention to my likes and the effort and the childhood memories that act simply did was huge to me. So to me spoiling goes outside of designers . Getting spoiled emotionally and mentally is vital and sometimes can be better. Lol",
            "author": "fleurdelunaholistics",
            "id": "iea8r0o",
            "parent_id": "t1_iea7bpv",
            "score": 6,
            "created_utc": 1656567071.0,
            "replies": []
        },
        {
            "body": "You might want to reread what I said. I don't accept 4 figure purses. What I was saying was alot of sbs in general feel that extravagant gifts and 5 star trips and extra money  is the preferred way of spoiling.",
            "author": "fleurdelunaholistics",
            "id": "iebm3l2",
            "parent_id": "t1_iebkazk",
            "score": 0,
            "created_utc": 1656599334.0,
            "replies": [
                {
                    "body": "Because that's their preferred one. Yours is investment. Both are valid and still spoiling",
                    "author": "WiseRequirement9277",
                    "id": "iebnb42",
                    "parent_id": "t1_iebm3l2",
                    "score": 4,
                    "created_utc": 1656599836.0,
                    "replies": []
                },
                {
                    "body": "I think you’re getting confused. This post isn’t about how to spoil, just that it should happen. Yours is happening. It’s not to argue the type of spoiling, just the existence. :)",
                    "author": "Cdnsugarr",
                    "id": "iebr9ma",
                    "parent_id": "t1_iebm3l2",
                    "score": 3,
                    "created_utc": 1656601439.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Thanks, inadvertantly added to the humor maybe?😂",
            "author": "patienceisavirtue5",
            "id": "iebd6sl",
            "parent_id": "t1_ieb4xgg",
            "score": 1,
            "created_utc": 1656595432.0,
            "replies": []
        },
        {
            "body": "Correct. Have an upvote.",
            "author": "JohnnyKemmer009",
            "id": "iecqsi1",
            "parent_id": "t1_iec8eaw",
            "score": 1,
            "created_utc": 1656615473.0,
            "replies": []
        },
        {
            "body": "Right, feeling entitled to basic respect is just so mean. How dare these women demand to be treated like human beings? \n\n/s",
            "author": "oliviamc99",
            "id": "iectfix",
            "parent_id": "t1_iec8eaw",
            "score": 1,
            "created_utc": 1656616492.0,
            "replies": []
        },
        {
            "body": "My SRs have all been long and enjoyable.  The spoiling discrepancy is something that while consistent doesn’t detract from the overall relationship.",
            "author": "Alienrite",
            "id": "iebeduc",
            "parent_id": "t1_iebe26j",
            "score": 1,
            "created_utc": 1656595992.0,
            "replies": []
        },
        {
            "body": "I understand that dynamic…it’s nice to separate $ from the dating and mostly we don’t talk about the allowance except to acknowledge it’s been received.  \n\nI’m in a quandary about asking because then her spoiling me is not given but taken.   But relationships are only as good as the communication so I’ll work on finding a kind and appropriate way to speak about it.   \n\nThank you",
            "author": "Alienrite",
            "id": "iecuvnz",
            "parent_id": "t1_iecl6rx",
            "score": 1,
            "created_utc": 1656617044.0,
            "replies": []
        },
        {
            "body": "What don't you get? The allowance covers everything under the dating umbrella. That is the point isn't it? If you feel like the allowance doesn't suffice for the gap in vanilla compatibility, then you've done a poor job at selecting him.\n\nIf you are expecting someone to provide you with extras such as a new car, then the question really is to ask yourself if you are making similar gestures. Are you going on overnights without expecting anything? Are you making extra time for him? Are you doing thoughtful gestures like cooking or baking randomly?\n\nThere are many ways to express yourself and to put in extra effort into being a good sugar partner without expecting sex or money in return. That is what we mean by it. If you are the type to only motivate yourself to make an effort when the allowance is at play, then you are unlikely to be the type someone wants to spoil above and beyond. \n\nTake that coming from someone who provides an allowance 4-5 times the area average and who provides experiences with vacations and high cost dates all the time. If you specifically want something outside the agreement that is enjoyable only to you personally, you need to make effort to do things that the other person finds enjoyable.",
            "author": "YlangScent",
            "id": "ieb07pa",
            "parent_id": "t1_ie9qcoh",
            "score": 3,
            "created_utc": 1656588414.0,
            "replies": [
                {
                    "body": "I don't get what more could be \"above and beyond\" besides the normal things in dating, which encompasses the things you've listed. I guess that is not typically happening for you guys in your experiences, but it is typical for me when I'm dating someone.",
                    "author": null,
                    "id": "ieb0mww",
                    "parent_id": "t1_ieb07pa",
                    "score": 2,
                    "created_utc": 1656588687.0,
                    "replies": [
                        {
                            "body": "The problem is that you are probably a good egg.\n\nBy nature of that, you don't quite understand how bad some of your peers are because you don't have to deal with them. \n\nI am lucky in the regard that I am fairly young and being with me apparently isn't that big of a stretch. But I still had to learn to really filter properly to find the women like you. \n\nThere are a whole bunch of 'SBs' out there who are simply on the clock and out to just drain you rather than to have you improve their life in a relationship style connection.\n\nThey feel entitled to your wealth and expect all of it without putting in any effort at all. I mean damn woman, I am giving you a 5 digit allowance and just paid for your tuition, yet you still want to 'charge' me for a lunch when you were near a conference I was attending?\n\nSome people are highly motivated by greed and just think that because you own something, they should constantly be leeching it. The entitlement is a turn off and it took me quite a while to accept that it is best to just hold off on generosity above and beyond till it becomes clear she is the same type of person.",
                            "author": "YlangScent",
                            "id": "ieb46e9",
                            "parent_id": "t1_ieb0mww",
                            "score": 3,
                            "created_utc": 1656590798.0,
                            "replies": [
                                {
                                    "body": "[removed]",
                                    "author": null,
                                    "id": "ieb5cy1",
                                    "parent_id": "t1_ieb46e9",
                                    "score": 1,
                                    "created_utc": 1656591464.0,
                                    "replies": [
                                        {
                                            "body": "I think that is a lot of effort from your side and to be honest not something I can understand not giving support for. It clearly cost you a bunch of cash for gas and the sitter at the very least.\n\nI can't speak to him as a person of course, but for the record, that isn't what I personally would consider above and beyond. This clearly cost you a tangible amount of money after all.\n\nAbove and beyond for me would be if you decided to write me a lovely note, craft me something or even bake me a cookie or whatever. It's the thought that counts.",
                                            "author": "YlangScent",
                                            "id": "iebcpnz",
                                            "parent_id": "t1_ieb5cy1",
                                            "score": 1,
                                            "created_utc": 1656595205.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Would you like a list of examples? While on an allowance, ask:\n\n  \n\\-if you can do overnights\n\n\\-if you can see him more than you normally would\n\n\\-if he would like to do a mini-vacation over an extended weekend\n\nBasically, take all the things that you would normally think about expecting a guy to provide more for, and do something from that list with no expectation for more.  You know, the opposite of what OP is asking - to have the SB spoil the SD beyond the agreement.",
            "author": "jerdle",
            "id": "ie9wu62",
            "parent_id": "t1_ie9qcoh",
            "score": 7,
            "created_utc": 1656559926.0,
            "replies": [
                {
                    "body": "You know what completely boggles my mind.... everything you listed is so simple and so obvious. Why does it completely escape your average SB (and woman)?",
                    "author": "AustinMetz18",
                    "id": "ie9zbcl",
                    "parent_id": "t1_ie9wu62",
                    "score": 7,
                    "created_utc": 1656561287.0,
                    "replies": []
                },
                {
                    "body": "Those things are encompassed in \"dating\".",
                    "author": null,
                    "id": "iea0qs4",
                    "parent_id": "t1_ie9wu62",
                    "score": 3,
                    "created_utc": 1656562094.0,
                    "replies": [
                        {
                            "body": "In 5 years of sugar dating, #1 and #3 were never approached from the SB first.  #2 has happened with one SB.  The 'all aspects of dating' is NOT the norm.  The norm is 'kinda-sorta' dating.",
                            "author": "jerdle",
                            "id": "iea77ub",
                            "parent_id": "t1_iea0qs4",
                            "score": 5,
                            "created_utc": 1656566049.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Anal and threesome\nAnd giving them one fuck free for 4 paid",
            "author": "WiseRequirement9277",
            "id": "iebky4p",
            "parent_id": "t1_ie9qcoh",
            "score": 1,
            "created_utc": 1656598852.0,
            "replies": []
        },
        {
            "body": "Oh no, she explicitly calls out for it to be a $30,000 car and if you tell her no you're \"not for her at all\"",
            "author": "jerdle",
            "id": "ie9x0lm",
            "parent_id": "t1_ie9sfzl",
            "score": 2,
            "created_utc": 1656560023.0,
            "replies": []
        },
        {
            "body": "> she’s having sex with someone she normally wouldn’t go for \n\nAndddd he’s paying for that opportunity when most men wouldn’t. Seems pretty well balanced. \n\nThe question is why spoil her extra. Is she spoiling _him_ extra?",
            "author": null,
            "id": "ieaamkn",
            "parent_id": "t1_ie9x8v8",
            "score": 4,
            "created_utc": 1656568350.0,
            "replies": [
                {
                    "body": "It will NEVER be balanced in a situation where the SD makes more than her and has the access to multiple women using his money.\n\nThe most I've heard men want women to do for them is to have great sex as spoiling and if she's doing that, then what more does he want? I'm not being calloused or insensitive, but I truly don't get what a married man who I won't have for a long time really wants.\n\nIf she's giving him sleepovers, texting, calling, being attentive to his needy ass, monogamy, coddling him, what ELSE does he want since he's not divorcing his wife??",
                    "author": "DottiesHotSake",
                    "id": "iec1y1k",
                    "parent_id": "t1_ieaamkn",
                    "score": 0,
                    "created_utc": 1656605677.0,
                    "replies": [
                        {
                            "body": "> access to multiple women using his money \n\nDoesn’t a SB have access to multiple men if she wants? Again, both the SD and the SB seem to have a balanced situation here. SDs can spend their money on multiple women, SBs can earn extra money having multiple SDs\n\n> what else does he want  \n\nThe sleepovers, monogamy, etc that you mentioned are not always given. Most SBs don’t offer those unless pushed. To me, those things _do_ count as extra the SB is doing for the SD. In those cases, the SD probably should spoil her extra in return",
                            "author": null,
                            "id": "ied21qy",
                            "parent_id": "t1_iec1y1k",
                            "score": 1,
                            "created_utc": 1656619826.0,
                            "replies": [
                                {
                                    "body": ">Doesn’t a SB have access to multiple men if she wants? Again, both the SD and the SB seem to have a balanced situation here. SDs can spend their money on multiple women, SBs can earn extra money having multiple SDs\n\nIt's heavily frowned upon if SBs have multiple SDs and we're considered \"pros\" if we do that. It's more easier to find ANY woman to be an SB and give sex and feigned attention than it is to find an SD who is financially capable of having an arrangement. \n\nWith respect, I can't blame SOME sbs for not providing certain things to SDs because sometimes, the PPM doesn't reflect it the requests that's being asked. This just happened to me yesterday, a POT SD who is married only wanted an oral sex arrangement. Doesn't seem like a bad idea, right? For 300 tacos, he wanted MONOGAMY as in  for me to not go on dates with other as well as no sex and he wasn't going to sexually satisfy me. Because I'm not a dirt bag, I couldn't promise him that and rather not put someone's health in jeopardy, but it wasn't enough for me to be monogamous to someone AND me not being sexually satisfied. \n\nIt's great that the men on Reddit are able to provide great allowances and if my monthly allowance was in the 2XXX range, best believe you wouldn't have to tell me twice or wait for me to suggest something. But in the real world, there's a lot of mediocre monthly allowances and outlandish demands on SDs expectations which is why some SDs have trouble finding SBs.",
                                    "author": "DottiesHotSake",
                                    "id": "ieed0fi",
                                    "parent_id": "t1_ied21qy",
                                    "score": 1,
                                    "created_utc": 1656640168.0,
                                    "replies": [
                                        {
                                            "body": "> it’s heavily frowned upon if SBs have multiple SDs\n\nI agree a lot of SDs are controlling and insist on monogamy. However it’s not like a sugar relationship is a marriage where everything must be disclosed. If I was a SB, I’d have multiple SDs and just not tell them. \n\nAs for the rest, we seem to agree that it needs to be fair for the SB and the SD. 3XX isn’t a fair agreement for an oral sex arrangement with monogamy. Fuck that dude.",
                                            "author": null,
                                            "id": "iehpkjh",
                                            "parent_id": "t1_ieed0fi",
                                            "score": 1,
                                            "created_utc": 1656704710.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "There's a culture and that old man story, men offering scholarships and such are the worst, they'll turn the SB into a sex slave and won't deliver on their promises. \n\nIt should be fair at each meet, hence why there is the PPM standard, but the girls often don't want to learn about the culture until they get played, they are not in a place where they think objectively about it.",
            "author": "sugardad123",
            "id": "iebgt1k",
            "parent_id": "t1_iebdt73",
            "score": 1,
            "created_utc": 1656597082.0,
            "replies": [
                {
                    "body": "Well, anyway when I saw that post, I felt so lucky I never dated anyone like that because I could totally see I fall into a victim of these sort of narcissistic man. \n\nI need my man to be kind, compassionate and have morality and self introspection. Or I will repeat the miserable years again with my ex boyfriend. 🙈",
                    "author": null,
                    "id": "iecerny",
                    "parent_id": "t1_iebgt1k",
                    "score": 1,
                    "created_utc": 1656610727.0,
                    "replies": [
                        {
                            "body": "Us empaths understand each other. I've been with an ASPD and now I can spot the dark triad traits in a room full of strangers, damnit why are they so charming! :)",
                            "author": "sugardad123",
                            "id": "iecleo3",
                            "parent_id": "t1_iecerny",
                            "score": 1,
                            "created_utc": 1656613344.0,
                            "replies": [
                                {
                                    "body": "Well, I am not anti social I am just selectively social introvert :)\n\nYes I often get attracted to introverted men. \nMy last and current SD are both INFJ. \n\nIt’s very strange My emotional connection with the last one is much stronger. \nWe are both INFJ-T.. I think the turbulence trait makes us resonate with each other much more. \n\nThe current guy is INFJ-A .. his assertive vibe gives me he’s more like INTJ sometimes but later I got him to do the test and came out as INFJ.. also he’s very expressive so I believe he’s more feeler than thinker. \n\nWhat are you? I think you might be an INFP male? 🤔🙂",
                                    "author": null,
                                    "id": "iedfnff",
                                    "parent_id": "t1_iecleo3",
                                    "score": 1,
                                    "created_utc": 1656625192.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Most = pretty much all the SDs on this thread. Happy to dig up a few other topics too\n\nMost men are happy to spoil their SB if she takes care of him in return. The problem is that many SBs are entitled and think they deserve extravagance at every meeting when they are doing the minimum and just showing up.",
            "author": null,
            "id": "ied2e0z",
            "parent_id": "t1_ieafcnq",
            "score": 1,
            "created_utc": 1656619956.0,
            "replies": []
        },
        {
            "body": "SDs are aware they are getting beautiful women that are often out of our league. That’s why we are paying, we get it. \n\nThe problem is women who expect extravagance beyond what is typical in a sugar relationship. They are often making thousands just showing up for dates but still don’t think it’s enough. That’s entitlement",
            "author": null,
            "id": "ied3rf1",
            "parent_id": "t1_iebnzes",
            "score": 2,
            "created_utc": 1656620489.0,
            "replies": [
                {
                    "body": "It’s not your decision to decide how much someone else is worth. Period. 🤍",
                    "author": "Stella_bby554",
                    "id": "iegs2bc",
                    "parent_id": "t1_ied3rf1",
                    "score": 1,
                    "created_utc": 1656691013.0,
                    "replies": [
                        {
                            "body": "Some of you SBs take this way too personally and start to believe your worth is what a SD will pay you. You’re a human, not a PPM amount. Stop valuing yourself based on how much money you get \n\nThat being said, it’s the SD who is deciding how much your time is worth. If you say “I’m worth $XXXX” for a ppm and it doesn’t seem worth it, we’ll just find another girl.",
                            "author": null,
                            "id": "iehoouh",
                            "parent_id": "t1_iegs2bc",
                            "score": 1,
                            "created_utc": 1656704348.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Well given you’ve never been attracted to any sugar daddy you’ve seenI’m not surprised you had this reply",
            "author": "wb19081908",
            "id": "iebvmi0",
            "parent_id": "t1_iebnzes",
            "score": 1,
            "created_utc": 1656603186.0,
            "replies": []
        },
        {
            "body": "Yes lots of free lunches 🤣🤣🤣",
            "author": null,
            "id": "iea7o7o",
            "parent_id": "t1_ie9yzxs",
            "score": 3,
            "created_utc": 1656566349.0,
            "replies": []
        },
        {
            "body": "Maybe You don’t comprehend that there is something expected in return?",
            "author": "KingofHearts0087",
            "id": "ieat4q4",
            "parent_id": "t1_ie9yzxs",
            "score": 3,
            "created_utc": 1656583258.0,
            "replies": []
        },
        {
            "body": "Literal LOL. Thank you for this comment.",
            "author": "HailToTheQuinn",
            "id": "ie9yp9g",
            "parent_id": "t1_ie9nr3c",
            "score": 3,
            "created_utc": 1656560946.0,
            "replies": []
        },
        {
            "body": "Lol",
            "author": "clair-cummings",
            "id": "iea0di7",
            "parent_id": "t1_ie9nr3c",
            "score": 2,
            "created_utc": 1656561884.0,
            "replies": []
        },
        {
            "body": "Someone is paying for that free lunch. And there are returns to be collected.",
            "author": "KingofHearts0087",
            "id": "ie9q5c0",
            "parent_id": "t1_ie9nr3c",
            "score": 1,
            "created_utc": 1656556488.0,
            "replies": []
        },
        {
            "body": "Maybe You do not understand what a metaphor is, looks like that is the case. I suggest learning a thing or two about life before making accusations.\n\nBut I will spell it out for you, the concept of “No Free Lunch,” means that the SD is expecting something in return. Unless your with your husband, or parent, or relative, someone is expecting a return in that lunch they bought you.\n\nFor SR, that is the norm. So get with the program, learn a think or two.",
            "author": "KingofHearts0087",
            "id": "iecy7nq",
            "parent_id": "t1_iecucqr",
            "score": 3,
            "created_utc": 1656618336.0,
            "replies": [
                {
                    "body": "I just saw this. Read what I said more carefully. I had held up my end of the arrangement completely. I was accompanying him and his daughter on vacation. He would not give me food while he and his daughter were eating in the hotel room, and he threw me out when I complained that I didn’t feel well due to low blood sugar. If you are an SD taking your SB on vacation, you are responsible for her basic physiological needs such as food and water, and for her safety. You can’t just suddenly decide you don’t want to provide for those needs and force her to figure out a way home on her own. That is what happened to me and it’s unacceptable. You need to learn a thing or two about the power dynamics of sugar relationships, and how women have to keep themselves safe when dating.",
                    "author": "oliviamc99",
                    "id": "iijo8xy",
                    "parent_id": "t1_iecy7nq",
                    "score": 1,
                    "created_utc": 1659381951.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Always",
            "author": null,
            "id": "iee9izt",
            "parent_id": "t1_iec8iaf",
            "score": 1,
            "created_utc": 1656638470.0,
            "replies": []
        },
        {
            "body": "What in the heck happened to you?\n\nDid you ask for something and not get it?\n\nOr were you hoping that your SD would go above and beyond what you mutually negotiated?\n\nReally curious about what triggered your rant. If you had an agreement and it’s being met, why is there a problem?",
            "author": "ExpertPerformance",
            "id": "ieddsxe",
            "parent_id": "t1_iecifzy",
            "score": 0,
            "created_utc": 1656624441.0,
            "replies": []
        },
        {
            "body": "Thank you chill 😤😤",
            "author": "c0rnstarr",
            "id": "ieeeyif",
            "parent_id": "t1_iecmcna",
            "score": 1,
            "created_utc": 1656641108.0,
            "replies": []
        },
        {
            "body": "We shall call him the preying mantis of SLF.",
            "author": null,
            "id": "ie9n958",
            "parent_id": "t1_ie9n294",
            "score": 7,
            "created_utc": 1656555081.0,
            "replies": [
                {
                    "body": "praying mantis not preying mantis (just another example of the triumph of illusion over reality)",
                    "author": "highfructoseSD",
                    "id": "ieap6ks",
                    "parent_id": "t1_ie9n958",
                    "score": 1,
                    "created_utc": 1656579947.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Extra credit for the use of the emojis. lol",
            "author": "Y_4Z44",
            "id": "ie9nyl6",
            "parent_id": "t1_ie9n294",
            "score": 4,
            "created_utc": 1656555421.0,
            "replies": []
        },
        {
            "body": "I just had to be that guy to say it 🤷🏽‍♂️",
            "author": "Thin_Bug_3775",
            "id": "ie9nh60",
            "parent_id": "t1_ie9n294",
            "score": 2,
            "created_utc": 1656555188.0,
            "replies": []
        },
        {
            "body": "In Macon GA that's the top of the pyramid.",
            "author": "zapzangboombang",
            "id": "ieadehn",
            "parent_id": "t1_iea1jua",
            "score": 4,
            "created_utc": 1656570357.0,
            "replies": []
        },
        {
            "body": "It has to be a troll LOL.\n\nAnyway, cheap delusional wannabe SDs are a dime a dozen.",
            "author": "LightOLove",
            "id": "ieby636",
            "parent_id": "t1_iebdvhm",
            "score": 3,
            "created_utc": 1656604197.0,
            "replies": [
                {
                    "body": "Definitely wannabes. Gosh I thought I was crazy here.",
                    "author": "Sugarcookie54321_",
                    "id": "iebybc9",
                    "parent_id": "t1_ieby636",
                    "score": 3,
                    "created_utc": 1656604256.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "iebe0d3",
            "parent_id": "t1_iebdvhm",
            "score": 2,
            "created_utc": 1656595815.0,
            "replies": [
                {
                    "body": "I’m good love. Thanks 😙",
                    "author": "Sugarcookie54321_",
                    "id": "iebe824",
                    "parent_id": "t1_iebe0d3",
                    "score": 2,
                    "created_utc": 1656595917.0,
                    "replies": []
                },
                {
                    "body": "I think it's nice.",
                    "author": "OldCommand4010",
                    "id": "iecli88",
                    "parent_id": "t1_iebe0d3",
                    "score": 1,
                    "created_utc": 1656613383.0,
                    "replies": [
                        {
                            "body": "Fyi the stuff is made with slave labor in prison tho.  🙀",
                            "author": "OldCommand4010",
                            "id": "ieclt1c",
                            "parent_id": "t1_iecli88",
                            "score": 1,
                            "created_utc": 1656613504.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I really hope that last part was tongue in cheek sarcasm.",
            "author": "clair-cummings",
            "id": "iea09en",
            "parent_id": "t1_ie9xebw",
            "score": 7,
            "created_utc": 1656561820.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "ie9z97c",
            "parent_id": "t1_ie9xebw",
            "score": -5,
            "created_utc": 1656561253.0,
            "replies": [
                {
                    "body": "Ahahah yes because love wearing garter belt and stockings under my sweatpants….keep telling ur self that",
                    "author": "Naked_Werewolf1283",
                    "id": "iea6taa",
                    "parent_id": "t1_ie9z97c",
                    "score": 8,
                    "created_utc": 1656565779.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Well, that's the point. You're making a massive generalization based on your own experience. Others are pointing out their experience has been the opposite.",
            "author": "matthewjphillips",
            "id": "ie9xk80",
            "parent_id": "t1_ie9sb01",
            "score": 7,
            "created_utc": 1656560322.0,
            "replies": []
        },
        {
            "body": "Commercial SB's have no problem finding SD's quickly. Genuine SB's however take more time to land the ideal ones.",
            "author": null,
            "id": "iebn7t1",
            "parent_id": "t1_ie9sb01",
            "score": 2,
            "created_utc": 1656599797.0,
            "replies": []
        },
        {
            "body": "They tell themselves this to make themselves feel better and make the woman feel devalued, therefore making her feel less worthy. They really don't know.",
            "author": "clair-cummings",
            "id": "iea06sb",
            "parent_id": "t1_ie9sb01",
            "score": 5,
            "created_utc": 1656561779.0,
            "replies": [
                {
                    "body": "There was this SD whom I’ve been seeing for almost 2 months. He was bragging that he can have as many as he wants and im likeee… yeah if money is not involved, we wouldnt bother talking to you",
                    "author": "Iooklike_my_pictures",
                    "id": "ieag21e",
                    "parent_id": "t1_iea06sb",
                    "score": 3,
                    "created_utc": 1656572380.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Definitely not",
            "author": "oliviamc99",
            "id": "ifg23v7",
            "parent_id": "t1_ieehyc7",
            "score": 1,
            "created_utc": 1657348627.0,
            "replies": []
        },
        {
            "body": "Okay that was funny and it took me a second 😂😂",
            "author": "MercedesRose6969",
            "id": "iedeayt",
            "parent_id": "t1_iebzh3q",
            "score": 1,
            "created_utc": 1656624646.0,
            "replies": []
        },
        {
            "body": "The self-awareness to live a simpler life and appreciate the simple joy of liking your neighbors is a path to happiness.",
            "author": "SantaBSB",
            "id": "ign44ac",
            "parent_id": "t1_ighkc94",
            "score": 3,
            "created_utc": 1658151989.0,
            "replies": [
                {
                    "body": "Thats such a sweet thing to say!  Really nice to hear\n\nSome of the people close to me think my approach to life is weirdly an egotistical flourish - like Im trying to be special or put on a costume to look interesting.  Its nice to hear positive feedback",
                    "author": "JDMultralight",
                    "id": "igo7a75",
                    "parent_id": "t1_ign44ac",
                    "score": 2,
                    "created_utc": 1658167885.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "That does sound nice. It’s cool that you’re so close with your neighbors. Sorry if I came off rude.",
            "author": "Rivergirl2878",
            "id": "jcbe3cy",
            "parent_id": "t1_ighkc94",
            "score": 1,
            "created_utc": 1678899799.0,
            "replies": []
        },
        {
            "body": "The implication that dominance and kindness can’t coexist is odd. Also, women are attracted to a variety of men, women, and non-binary people, and a whole spectrum of personalities. Personally, I prefer emotionally intelligent guys, regardless of “dominance.” I’m also attracted to *gasp* submissive men.",
            "author": "KetoSeaweed",
            "id": "ieivub4",
            "parent_id": "t1_ie9xi7b",
            "score": 6,
            "created_utc": 1656724071.0,
            "replies": []
        },
        {
            "body": "Better way to say that there are lots of things about dominant men that are attractive.  But if you actually go through the relationships in your whole extended friend group what you’ll find is that literally every kind of strength is thoroughly rewarded.\n\nNice guys do really well.  I don’t mean “nice guys” - Which means guys who dont know how to ever be assertive, and who women burden in subtle ways.\n\nAs far as the dominance relation between the man and woman, not letting her push you around is pretty much all you have to do.  That said, there are so many super hot women who marry guys and push them around or have a strong tendency to date guys they can push around.",
            "author": "JDMultralight",
            "id": "iebov62",
            "parent_id": "t1_ie9xi7b",
            "score": 3,
            "created_utc": 1656600472.0,
            "replies": []
        },
        {
            "body": "Some, not all. I’ve found plenty of exceptions.",
            "author": null,
            "id": "iea8r2c",
            "parent_id": "t1_ie9xi7b",
            "score": 1,
            "created_utc": 1656567072.0,
            "replies": []
        },
        {
            "body": "yikes! i’m so sorry you had to deal with that. some SBs just are not emotionally healthy enough for relationships at all, let alone sugar dating and it winds up negatively impacting their partners and leaves everyone with a bad taste. live and learn though, none of us are perfect and i know from experience that it takes time to learn how to stop ignoring red flags early on lol",
            "author": "dumpst3rj3di",
            "id": "iedip6f",
            "parent_id": "t1_iedhe24",
            "score": 2,
            "created_utc": 1656626434.0,
            "replies": [
                {
                    "body": "Appreciate it. I totally agree with you 💯 thanks for your comments and insight. I feel like I hit the lotto with my current sb. She's amazing and we have great chemistry. She has a heart or gold",
                    "author": "KanyeAsada420Grower",
                    "id": "iedjpjd",
                    "parent_id": "t1_iedip6f",
                    "score": 2,
                    "created_utc": 1656626833.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "iea3ci8",
            "parent_id": "t1_iea0lq2",
            "score": -7,
            "created_utc": 1656563605.0,
            "replies": [
                {
                    "body": "Right... Which is what I said in my comment.",
                    "author": null,
                    "id": "iea3ebx",
                    "parent_id": "t1_iea3ci8",
                    "score": 11,
                    "created_utc": 1656563636.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Because that's their preferred one. Yours is investment. Both are valid and still spoiling",
            "author": "WiseRequirement9277",
            "id": "iebnb42",
            "parent_id": "t1_iebm3l2",
            "score": 4,
            "created_utc": 1656599836.0,
            "replies": []
        },
        {
            "body": "I think you’re getting confused. This post isn’t about how to spoil, just that it should happen. Yours is happening. It’s not to argue the type of spoiling, just the existence. :)",
            "author": "Cdnsugarr",
            "id": "iebr9ma",
            "parent_id": "t1_iebm3l2",
            "score": 3,
            "created_utc": 1656601439.0,
            "replies": []
        },
        {
            "body": "I don't get what more could be \"above and beyond\" besides the normal things in dating, which encompasses the things you've listed. I guess that is not typically happening for you guys in your experiences, but it is typical for me when I'm dating someone.",
            "author": null,
            "id": "ieb0mww",
            "parent_id": "t1_ieb07pa",
            "score": 2,
            "created_utc": 1656588687.0,
            "replies": [
                {
                    "body": "The problem is that you are probably a good egg.\n\nBy nature of that, you don't quite understand how bad some of your peers are because you don't have to deal with them. \n\nI am lucky in the regard that I am fairly young and being with me apparently isn't that big of a stretch. But I still had to learn to really filter properly to find the women like you. \n\nThere are a whole bunch of 'SBs' out there who are simply on the clock and out to just drain you rather than to have you improve their life in a relationship style connection.\n\nThey feel entitled to your wealth and expect all of it without putting in any effort at all. I mean damn woman, I am giving you a 5 digit allowance and just paid for your tuition, yet you still want to 'charge' me for a lunch when you were near a conference I was attending?\n\nSome people are highly motivated by greed and just think that because you own something, they should constantly be leeching it. The entitlement is a turn off and it took me quite a while to accept that it is best to just hold off on generosity above and beyond till it becomes clear she is the same type of person.",
                    "author": "YlangScent",
                    "id": "ieb46e9",
                    "parent_id": "t1_ieb0mww",
                    "score": 3,
                    "created_utc": 1656590798.0,
                    "replies": [
                        {
                            "body": "[removed]",
                            "author": null,
                            "id": "ieb5cy1",
                            "parent_id": "t1_ieb46e9",
                            "score": 1,
                            "created_utc": 1656591464.0,
                            "replies": [
                                {
                                    "body": "I think that is a lot of effort from your side and to be honest not something I can understand not giving support for. It clearly cost you a bunch of cash for gas and the sitter at the very least.\n\nI can't speak to him as a person of course, but for the record, that isn't what I personally would consider above and beyond. This clearly cost you a tangible amount of money after all.\n\nAbove and beyond for me would be if you decided to write me a lovely note, craft me something or even bake me a cookie or whatever. It's the thought that counts.",
                                    "author": "YlangScent",
                                    "id": "iebcpnz",
                                    "parent_id": "t1_ieb5cy1",
                                    "score": 1,
                                    "created_utc": 1656595205.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "You know what completely boggles my mind.... everything you listed is so simple and so obvious. Why does it completely escape your average SB (and woman)?",
            "author": "AustinMetz18",
            "id": "ie9zbcl",
            "parent_id": "t1_ie9wu62",
            "score": 7,
            "created_utc": 1656561287.0,
            "replies": []
        },
        {
            "body": "Those things are encompassed in \"dating\".",
            "author": null,
            "id": "iea0qs4",
            "parent_id": "t1_ie9wu62",
            "score": 3,
            "created_utc": 1656562094.0,
            "replies": [
                {
                    "body": "In 5 years of sugar dating, #1 and #3 were never approached from the SB first.  #2 has happened with one SB.  The 'all aspects of dating' is NOT the norm.  The norm is 'kinda-sorta' dating.",
                    "author": "jerdle",
                    "id": "iea77ub",
                    "parent_id": "t1_iea0qs4",
                    "score": 5,
                    "created_utc": 1656566049.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "It will NEVER be balanced in a situation where the SD makes more than her and has the access to multiple women using his money.\n\nThe most I've heard men want women to do for them is to have great sex as spoiling and if she's doing that, then what more does he want? I'm not being calloused or insensitive, but I truly don't get what a married man who I won't have for a long time really wants.\n\nIf she's giving him sleepovers, texting, calling, being attentive to his needy ass, monogamy, coddling him, what ELSE does he want since he's not divorcing his wife??",
            "author": "DottiesHotSake",
            "id": "iec1y1k",
            "parent_id": "t1_ieaamkn",
            "score": 0,
            "created_utc": 1656605677.0,
            "replies": [
                {
                    "body": "> access to multiple women using his money \n\nDoesn’t a SB have access to multiple men if she wants? Again, both the SD and the SB seem to have a balanced situation here. SDs can spend their money on multiple women, SBs can earn extra money having multiple SDs\n\n> what else does he want  \n\nThe sleepovers, monogamy, etc that you mentioned are not always given. Most SBs don’t offer those unless pushed. To me, those things _do_ count as extra the SB is doing for the SD. In those cases, the SD probably should spoil her extra in return",
                    "author": null,
                    "id": "ied21qy",
                    "parent_id": "t1_iec1y1k",
                    "score": 1,
                    "created_utc": 1656619826.0,
                    "replies": [
                        {
                            "body": ">Doesn’t a SB have access to multiple men if she wants? Again, both the SD and the SB seem to have a balanced situation here. SDs can spend their money on multiple women, SBs can earn extra money having multiple SDs\n\nIt's heavily frowned upon if SBs have multiple SDs and we're considered \"pros\" if we do that. It's more easier to find ANY woman to be an SB and give sex and feigned attention than it is to find an SD who is financially capable of having an arrangement. \n\nWith respect, I can't blame SOME sbs for not providing certain things to SDs because sometimes, the PPM doesn't reflect it the requests that's being asked. This just happened to me yesterday, a POT SD who is married only wanted an oral sex arrangement. Doesn't seem like a bad idea, right? For 300 tacos, he wanted MONOGAMY as in  for me to not go on dates with other as well as no sex and he wasn't going to sexually satisfy me. Because I'm not a dirt bag, I couldn't promise him that and rather not put someone's health in jeopardy, but it wasn't enough for me to be monogamous to someone AND me not being sexually satisfied. \n\nIt's great that the men on Reddit are able to provide great allowances and if my monthly allowance was in the 2XXX range, best believe you wouldn't have to tell me twice or wait for me to suggest something. But in the real world, there's a lot of mediocre monthly allowances and outlandish demands on SDs expectations which is why some SDs have trouble finding SBs.",
                            "author": "DottiesHotSake",
                            "id": "ieed0fi",
                            "parent_id": "t1_ied21qy",
                            "score": 1,
                            "created_utc": 1656640168.0,
                            "replies": [
                                {
                                    "body": "> it’s heavily frowned upon if SBs have multiple SDs\n\nI agree a lot of SDs are controlling and insist on monogamy. However it’s not like a sugar relationship is a marriage where everything must be disclosed. If I was a SB, I’d have multiple SDs and just not tell them. \n\nAs for the rest, we seem to agree that it needs to be fair for the SB and the SD. 3XX isn’t a fair agreement for an oral sex arrangement with monogamy. Fuck that dude.",
                                    "author": null,
                                    "id": "iehpkjh",
                                    "parent_id": "t1_ieed0fi",
                                    "score": 1,
                                    "created_utc": 1656704710.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Well, anyway when I saw that post, I felt so lucky I never dated anyone like that because I could totally see I fall into a victim of these sort of narcissistic man. \n\nI need my man to be kind, compassionate and have morality and self introspection. Or I will repeat the miserable years again with my ex boyfriend. 🙈",
            "author": null,
            "id": "iecerny",
            "parent_id": "t1_iebgt1k",
            "score": 1,
            "created_utc": 1656610727.0,
            "replies": [
                {
                    "body": "Us empaths understand each other. I've been with an ASPD and now I can spot the dark triad traits in a room full of strangers, damnit why are they so charming! :)",
                    "author": "sugardad123",
                    "id": "iecleo3",
                    "parent_id": "t1_iecerny",
                    "score": 1,
                    "created_utc": 1656613344.0,
                    "replies": [
                        {
                            "body": "Well, I am not anti social I am just selectively social introvert :)\n\nYes I often get attracted to introverted men. \nMy last and current SD are both INFJ. \n\nIt’s very strange My emotional connection with the last one is much stronger. \nWe are both INFJ-T.. I think the turbulence trait makes us resonate with each other much more. \n\nThe current guy is INFJ-A .. his assertive vibe gives me he’s more like INTJ sometimes but later I got him to do the test and came out as INFJ.. also he’s very expressive so I believe he’s more feeler than thinker. \n\nWhat are you? I think you might be an INFP male? 🤔🙂",
                            "author": null,
                            "id": "iedfnff",
                            "parent_id": "t1_iecleo3",
                            "score": 1,
                            "created_utc": 1656625192.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "It’s not your decision to decide how much someone else is worth. Period. 🤍",
            "author": "Stella_bby554",
            "id": "iegs2bc",
            "parent_id": "t1_ied3rf1",
            "score": 1,
            "created_utc": 1656691013.0,
            "replies": [
                {
                    "body": "Some of you SBs take this way too personally and start to believe your worth is what a SD will pay you. You’re a human, not a PPM amount. Stop valuing yourself based on how much money you get \n\nThat being said, it’s the SD who is deciding how much your time is worth. If you say “I’m worth $XXXX” for a ppm and it doesn’t seem worth it, we’ll just find another girl.",
                    "author": null,
                    "id": "iehoouh",
                    "parent_id": "t1_iegs2bc",
                    "score": 1,
                    "created_utc": 1656704348.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I just saw this. Read what I said more carefully. I had held up my end of the arrangement completely. I was accompanying him and his daughter on vacation. He would not give me food while he and his daughter were eating in the hotel room, and he threw me out when I complained that I didn’t feel well due to low blood sugar. If you are an SD taking your SB on vacation, you are responsible for her basic physiological needs such as food and water, and for her safety. You can’t just suddenly decide you don’t want to provide for those needs and force her to figure out a way home on her own. That is what happened to me and it’s unacceptable. You need to learn a thing or two about the power dynamics of sugar relationships, and how women have to keep themselves safe when dating.",
            "author": "oliviamc99",
            "id": "iijo8xy",
            "parent_id": "t1_iecy7nq",
            "score": 1,
            "created_utc": 1659381951.0,
            "replies": []
        },
        {
            "body": "praying mantis not preying mantis (just another example of the triumph of illusion over reality)",
            "author": "highfructoseSD",
            "id": "ieap6ks",
            "parent_id": "t1_ie9n958",
            "score": 1,
            "created_utc": 1656579947.0,
            "replies": []
        },
        {
            "body": "Definitely wannabes. Gosh I thought I was crazy here.",
            "author": "Sugarcookie54321_",
            "id": "iebybc9",
            "parent_id": "t1_ieby636",
            "score": 3,
            "created_utc": 1656604256.0,
            "replies": []
        },
        {
            "body": "I’m good love. Thanks 😙",
            "author": "Sugarcookie54321_",
            "id": "iebe824",
            "parent_id": "t1_iebe0d3",
            "score": 2,
            "created_utc": 1656595917.0,
            "replies": []
        },
        {
            "body": "I think it's nice.",
            "author": "OldCommand4010",
            "id": "iecli88",
            "parent_id": "t1_iebe0d3",
            "score": 1,
            "created_utc": 1656613383.0,
            "replies": [
                {
                    "body": "Fyi the stuff is made with slave labor in prison tho.  🙀",
                    "author": "OldCommand4010",
                    "id": "ieclt1c",
                    "parent_id": "t1_iecli88",
                    "score": 1,
                    "created_utc": 1656613504.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Ahahah yes because love wearing garter belt and stockings under my sweatpants….keep telling ur self that",
            "author": "Naked_Werewolf1283",
            "id": "iea6taa",
            "parent_id": "t1_ie9z97c",
            "score": 8,
            "created_utc": 1656565779.0,
            "replies": []
        },
        {
            "body": "There was this SD whom I’ve been seeing for almost 2 months. He was bragging that he can have as many as he wants and im likeee… yeah if money is not involved, we wouldnt bother talking to you",
            "author": "Iooklike_my_pictures",
            "id": "ieag21e",
            "parent_id": "t1_iea06sb",
            "score": 3,
            "created_utc": 1656572380.0,
            "replies": []
        },
        {
            "body": "Thats such a sweet thing to say!  Really nice to hear\n\nSome of the people close to me think my approach to life is weirdly an egotistical flourish - like Im trying to be special or put on a costume to look interesting.  Its nice to hear positive feedback",
            "author": "JDMultralight",
            "id": "igo7a75",
            "parent_id": "t1_ign44ac",
            "score": 2,
            "created_utc": 1658167885.0,
            "replies": []
        },
        {
            "body": "Appreciate it. I totally agree with you 💯 thanks for your comments and insight. I feel like I hit the lotto with my current sb. She's amazing and we have great chemistry. She has a heart or gold",
            "author": "KanyeAsada420Grower",
            "id": "iedjpjd",
            "parent_id": "t1_iedip6f",
            "score": 2,
            "created_utc": 1656626833.0,
            "replies": []
        },
        {
            "body": "Right... Which is what I said in my comment.",
            "author": null,
            "id": "iea3ebx",
            "parent_id": "t1_iea3ci8",
            "score": 11,
            "created_utc": 1656563636.0,
            "replies": []
        },
        {
            "body": "The problem is that you are probably a good egg.\n\nBy nature of that, you don't quite understand how bad some of your peers are because you don't have to deal with them. \n\nI am lucky in the regard that I am fairly young and being with me apparently isn't that big of a stretch. But I still had to learn to really filter properly to find the women like you. \n\nThere are a whole bunch of 'SBs' out there who are simply on the clock and out to just drain you rather than to have you improve their life in a relationship style connection.\n\nThey feel entitled to your wealth and expect all of it without putting in any effort at all. I mean damn woman, I am giving you a 5 digit allowance and just paid for your tuition, yet you still want to 'charge' me for a lunch when you were near a conference I was attending?\n\nSome people are highly motivated by greed and just think that because you own something, they should constantly be leeching it. The entitlement is a turn off and it took me quite a while to accept that it is best to just hold off on generosity above and beyond till it becomes clear she is the same type of person.",
            "author": "YlangScent",
            "id": "ieb46e9",
            "parent_id": "t1_ieb0mww",
            "score": 3,
            "created_utc": 1656590798.0,
            "replies": [
                {
                    "body": "[removed]",
                    "author": null,
                    "id": "ieb5cy1",
                    "parent_id": "t1_ieb46e9",
                    "score": 1,
                    "created_utc": 1656591464.0,
                    "replies": [
                        {
                            "body": "I think that is a lot of effort from your side and to be honest not something I can understand not giving support for. It clearly cost you a bunch of cash for gas and the sitter at the very least.\n\nI can't speak to him as a person of course, but for the record, that isn't what I personally would consider above and beyond. This clearly cost you a tangible amount of money after all.\n\nAbove and beyond for me would be if you decided to write me a lovely note, craft me something or even bake me a cookie or whatever. It's the thought that counts.",
                            "author": "YlangScent",
                            "id": "iebcpnz",
                            "parent_id": "t1_ieb5cy1",
                            "score": 1,
                            "created_utc": 1656595205.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "In 5 years of sugar dating, #1 and #3 were never approached from the SB first.  #2 has happened with one SB.  The 'all aspects of dating' is NOT the norm.  The norm is 'kinda-sorta' dating.",
            "author": "jerdle",
            "id": "iea77ub",
            "parent_id": "t1_iea0qs4",
            "score": 5,
            "created_utc": 1656566049.0,
            "replies": []
        },
        {
            "body": "> access to multiple women using his money \n\nDoesn’t a SB have access to multiple men if she wants? Again, both the SD and the SB seem to have a balanced situation here. SDs can spend their money on multiple women, SBs can earn extra money having multiple SDs\n\n> what else does he want  \n\nThe sleepovers, monogamy, etc that you mentioned are not always given. Most SBs don’t offer those unless pushed. To me, those things _do_ count as extra the SB is doing for the SD. In those cases, the SD probably should spoil her extra in return",
            "author": null,
            "id": "ied21qy",
            "parent_id": "t1_iec1y1k",
            "score": 1,
            "created_utc": 1656619826.0,
            "replies": [
                {
                    "body": ">Doesn’t a SB have access to multiple men if she wants? Again, both the SD and the SB seem to have a balanced situation here. SDs can spend their money on multiple women, SBs can earn extra money having multiple SDs\n\nIt's heavily frowned upon if SBs have multiple SDs and we're considered \"pros\" if we do that. It's more easier to find ANY woman to be an SB and give sex and feigned attention than it is to find an SD who is financially capable of having an arrangement. \n\nWith respect, I can't blame SOME sbs for not providing certain things to SDs because sometimes, the PPM doesn't reflect it the requests that's being asked. This just happened to me yesterday, a POT SD who is married only wanted an oral sex arrangement. Doesn't seem like a bad idea, right? For 300 tacos, he wanted MONOGAMY as in  for me to not go on dates with other as well as no sex and he wasn't going to sexually satisfy me. Because I'm not a dirt bag, I couldn't promise him that and rather not put someone's health in jeopardy, but it wasn't enough for me to be monogamous to someone AND me not being sexually satisfied. \n\nIt's great that the men on Reddit are able to provide great allowances and if my monthly allowance was in the 2XXX range, best believe you wouldn't have to tell me twice or wait for me to suggest something. But in the real world, there's a lot of mediocre monthly allowances and outlandish demands on SDs expectations which is why some SDs have trouble finding SBs.",
                    "author": "DottiesHotSake",
                    "id": "ieed0fi",
                    "parent_id": "t1_ied21qy",
                    "score": 1,
                    "created_utc": 1656640168.0,
                    "replies": [
                        {
                            "body": "> it’s heavily frowned upon if SBs have multiple SDs\n\nI agree a lot of SDs are controlling and insist on monogamy. However it’s not like a sugar relationship is a marriage where everything must be disclosed. If I was a SB, I’d have multiple SDs and just not tell them. \n\nAs for the rest, we seem to agree that it needs to be fair for the SB and the SD. 3XX isn’t a fair agreement for an oral sex arrangement with monogamy. Fuck that dude.",
                            "author": null,
                            "id": "iehpkjh",
                            "parent_id": "t1_ieed0fi",
                            "score": 1,
                            "created_utc": 1656704710.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Us empaths understand each other. I've been with an ASPD and now I can spot the dark triad traits in a room full of strangers, damnit why are they so charming! :)",
            "author": "sugardad123",
            "id": "iecleo3",
            "parent_id": "t1_iecerny",
            "score": 1,
            "created_utc": 1656613344.0,
            "replies": [
                {
                    "body": "Well, I am not anti social I am just selectively social introvert :)\n\nYes I often get attracted to introverted men. \nMy last and current SD are both INFJ. \n\nIt’s very strange My emotional connection with the last one is much stronger. \nWe are both INFJ-T.. I think the turbulence trait makes us resonate with each other much more. \n\nThe current guy is INFJ-A .. his assertive vibe gives me he’s more like INTJ sometimes but later I got him to do the test and came out as INFJ.. also he’s very expressive so I believe he’s more feeler than thinker. \n\nWhat are you? I think you might be an INFP male? 🤔🙂",
                    "author": null,
                    "id": "iedfnff",
                    "parent_id": "t1_iecleo3",
                    "score": 1,
                    "created_utc": 1656625192.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Some of you SBs take this way too personally and start to believe your worth is what a SD will pay you. You’re a human, not a PPM amount. Stop valuing yourself based on how much money you get \n\nThat being said, it’s the SD who is deciding how much your time is worth. If you say “I’m worth $XXXX” for a ppm and it doesn’t seem worth it, we’ll just find another girl.",
            "author": null,
            "id": "iehoouh",
            "parent_id": "t1_iegs2bc",
            "score": 1,
            "created_utc": 1656704348.0,
            "replies": []
        },
        {
            "body": "Fyi the stuff is made with slave labor in prison tho.  🙀",
            "author": "OldCommand4010",
            "id": "ieclt1c",
            "parent_id": "t1_iecli88",
            "score": 1,
            "created_utc": 1656613504.0,
            "replies": []
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "ieb5cy1",
            "parent_id": "t1_ieb46e9",
            "score": 1,
            "created_utc": 1656591464.0,
            "replies": [
                {
                    "body": "I think that is a lot of effort from your side and to be honest not something I can understand not giving support for. It clearly cost you a bunch of cash for gas and the sitter at the very least.\n\nI can't speak to him as a person of course, but for the record, that isn't what I personally would consider above and beyond. This clearly cost you a tangible amount of money after all.\n\nAbove and beyond for me would be if you decided to write me a lovely note, craft me something or even bake me a cookie or whatever. It's the thought that counts.",
                    "author": "YlangScent",
                    "id": "iebcpnz",
                    "parent_id": "t1_ieb5cy1",
                    "score": 1,
                    "created_utc": 1656595205.0,
                    "replies": []
                }
            ]
        },
        {
            "body": ">Doesn’t a SB have access to multiple men if she wants? Again, both the SD and the SB seem to have a balanced situation here. SDs can spend their money on multiple women, SBs can earn extra money having multiple SDs\n\nIt's heavily frowned upon if SBs have multiple SDs and we're considered \"pros\" if we do that. It's more easier to find ANY woman to be an SB and give sex and feigned attention than it is to find an SD who is financially capable of having an arrangement. \n\nWith respect, I can't blame SOME sbs for not providing certain things to SDs because sometimes, the PPM doesn't reflect it the requests that's being asked. This just happened to me yesterday, a POT SD who is married only wanted an oral sex arrangement. Doesn't seem like a bad idea, right? For 300 tacos, he wanted MONOGAMY as in  for me to not go on dates with other as well as no sex and he wasn't going to sexually satisfy me. Because I'm not a dirt bag, I couldn't promise him that and rather not put someone's health in jeopardy, but it wasn't enough for me to be monogamous to someone AND me not being sexually satisfied. \n\nIt's great that the men on Reddit are able to provide great allowances and if my monthly allowance was in the 2XXX range, best believe you wouldn't have to tell me twice or wait for me to suggest something. But in the real world, there's a lot of mediocre monthly allowances and outlandish demands on SDs expectations which is why some SDs have trouble finding SBs.",
            "author": "DottiesHotSake",
            "id": "ieed0fi",
            "parent_id": "t1_ied21qy",
            "score": 1,
            "created_utc": 1656640168.0,
            "replies": [
                {
                    "body": "> it’s heavily frowned upon if SBs have multiple SDs\n\nI agree a lot of SDs are controlling and insist on monogamy. However it’s not like a sugar relationship is a marriage where everything must be disclosed. If I was a SB, I’d have multiple SDs and just not tell them. \n\nAs for the rest, we seem to agree that it needs to be fair for the SB and the SD. 3XX isn’t a fair agreement for an oral sex arrangement with monogamy. Fuck that dude.",
                    "author": null,
                    "id": "iehpkjh",
                    "parent_id": "t1_ieed0fi",
                    "score": 1,
                    "created_utc": 1656704710.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Well, I am not anti social I am just selectively social introvert :)\n\nYes I often get attracted to introverted men. \nMy last and current SD are both INFJ. \n\nIt’s very strange My emotional connection with the last one is much stronger. \nWe are both INFJ-T.. I think the turbulence trait makes us resonate with each other much more. \n\nThe current guy is INFJ-A .. his assertive vibe gives me he’s more like INTJ sometimes but later I got him to do the test and came out as INFJ.. also he’s very expressive so I believe he’s more feeler than thinker. \n\nWhat are you? I think you might be an INFP male? 🤔🙂",
            "author": null,
            "id": "iedfnff",
            "parent_id": "t1_iecleo3",
            "score": 1,
            "created_utc": 1656625192.0,
            "replies": []
        },
        {
            "body": "I think that is a lot of effort from your side and to be honest not something I can understand not giving support for. It clearly cost you a bunch of cash for gas and the sitter at the very least.\n\nI can't speak to him as a person of course, but for the record, that isn't what I personally would consider above and beyond. This clearly cost you a tangible amount of money after all.\n\nAbove and beyond for me would be if you decided to write me a lovely note, craft me something or even bake me a cookie or whatever. It's the thought that counts.",
            "author": "YlangScent",
            "id": "iebcpnz",
            "parent_id": "t1_ieb5cy1",
            "score": 1,
            "created_utc": 1656595205.0,
            "replies": []
        },
        {
            "body": "> it’s heavily frowned upon if SBs have multiple SDs\n\nI agree a lot of SDs are controlling and insist on monogamy. However it’s not like a sugar relationship is a marriage where everything must be disclosed. If I was a SB, I’d have multiple SDs and just not tell them. \n\nAs for the rest, we seem to agree that it needs to be fair for the SB and the SD. 3XX isn’t a fair agreement for an oral sex arrangement with monogamy. Fuck that dude.",
            "author": null,
            "id": "iehpkjh",
            "parent_id": "t1_ieed0fi",
            "score": 1,
            "created_utc": 1656704710.0,
            "replies": []
        }
    ]
}