{
    "title": "Meeting people from reddit",
    "post_id": "l8itq5",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/l8itq5/meeting_people_from_reddit/",
    "author": "rkthailand22",
    "body": "I'm an avid reader of SLF, probably on a daily basis. I love the feelgood stories and I have one to add myself. So here goes...\n\nA while ago I came across a post where The Netherlands was mentioned. Since I'm Dutch I thought I'd send a PM. I've done this a few times before but it has never gone past a couple of messages back and forth unfortunately, but this time I got a quick response and we started talking. We moved to WhatsApp quickly to exchange some pictures and continue our conversation and boy I was in for a surprise: she wasn't only easy to talk to but also absolutely stunning.\nWe started talking about expectations and she said she'd feel more comfortable to take it slow and do several platonic dates before starting anything official. This was fine by me as I do favour the more organic go with the flow approach.\n\nSo we first had our m&g in the city she's studying in (2 hour drive) and have to say she's even more beautiful in real life!\nWe had a great connection from the start and our meet lasted well over 2 hours. Conversation flowed effortlessly and we even shared some cake. I usually wait to share my opinion about m&g's until a little while after but I think we both expressed we would like to see each other again immediately.\n\nSecond date was just dinner in an excellent Italian restaurant (her recommendation) and we had a wonderful time. Just platonic... \n\nThird date... she had a trip to a city near where I live. The last train back home was around 10pm so I offered to pay for a hotel so she didn't have to rush. She agreed. We had dinner in a lively little French bistro and then I gave her the two key cards to the room of the hotel (walking distance from the restaurant).\nAs I was about to walk to my car she invited me to come to the hotel, which I gracefully accepted of course.\nWhen we get to the room we open a small bottle of wine and she sees the wrapped gift I put on the table earlier. After unwrapping she came up to me and kissed me... passionately. I don't think we really stopped kissing for the next 3 hours or so... amazing match on the kissing (physical compatibility is soooo important) . \nI left a bit after midnight and she stayed the night by herself. The next day she visited a museum recommended by me and had a stroll around the city. She texted me some pictures and told me she got home safe. \n\nNow the fourth date. She asked me if I could stay over in her city for the next date, so I booked a nice hotel and made dinner reservations (again her recommendation). Picked her up and had a very nice dinner. She's a very relaxed person to be with. Our conversations are so easy. We complement each other very well. After dinner we walked through the city to get some coffee and she held my arm... now I imagine this is probably why a lot of guys sugardate for. The most beautiful arm candy there is. \n\nThen we made our way to the hotel.\nI won't share any dirty details but we had an extremely great night. We matched on a physical level you can only hope for.\n\nWe had another three amazing dates after that. Unfortunately she chose to pursue a vanilla relationship after this. I must admit there was some heartbreak, but I appreciate the time we spent together and I will cherish the memories of her.",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/l8itq5/meeting_people_from_reddit/",
    "score": 130,
    "upvote_ratio": 0.97,
    "created_utc": 1612002235.0,
    "num_comments": 27,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "I love success stories. I'm starting to keep my search to reddit hut its less straightforward than say, SA",
            "author": "templewander",
            "id": "glcw8yq",
            "parent_id": "t3_l8itq5",
            "score": 23,
            "created_utc": 1612005133.0,
            "replies": [
                {
                    "body": "Hello, I’m curious. How are y’all finding folks on here??",
                    "author": "Xomeetangie",
                    "id": "gldohs9",
                    "parent_id": "t1_glcw8yq",
                    "score": 10,
                    "created_utc": 1612023920.0,
                    "replies": [
                        {
                            "body": "I assumed people just pm on the regular. I never reach out to anyone but I get a decent amount of pms on reddit(won’t deny they are 90% scammers) but there’s some decent humans throughout the site that I’ve spoken to. I have a separate account for non-sugar things and I’ve spoken to many over the years and just made some Internet buddies.\n\nOn this account some SD’s have reached out and I don’t mind talking on here and seeing where it takes us. Doesn’t always work out but in the end I made a friend and maybe I got to learn something from them along the way :)\n\nIt never hurts to send a message. At the very least you can say you put yourself out there.",
                            "author": "avanirvana",
                            "id": "gleq4vf",
                            "parent_id": "t1_gldohs9",
                            "score": 4,
                            "created_utc": 1612041381.0,
                            "replies": [
                                {
                                    "body": "Very true... thank you for the input",
                                    "author": "Xomeetangie",
                                    "id": "glfif5m",
                                    "parent_id": "t1_gleq4vf",
                                    "score": 1,
                                    "created_utc": 1612055618.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "glfg293",
                            "parent_id": "t1_gldohs9",
                            "score": 2,
                            "created_utc": 1612054372.0,
                            "replies": [
                                {
                                    "body": "Yes, The more I read the old threads, the more I realize that",
                                    "author": "Xomeetangie",
                                    "id": "glfiny6",
                                    "parent_id": "t1_glfg293",
                                    "score": 1,
                                    "created_utc": 1612055748.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "❤️",
            "author": "brighteraurora",
            "id": "glctnlc",
            "parent_id": "t3_l8itq5",
            "score": 3,
            "created_utc": 1612002652.0,
            "replies": []
        },
        {
            "body": "This is a model start to an arrangement everyone should strive to follow.",
            "author": null,
            "id": "gldpd88",
            "parent_id": "t3_l8itq5",
            "score": 4,
            "created_utc": 1612024325.0,
            "replies": [
                {
                    "body": "My thought exactly!",
                    "author": null,
                    "id": "glheytn",
                    "parent_id": "t1_gldpd88",
                    "score": 1,
                    "created_utc": 1612104497.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "You must be a good partner yourself to make things evolve so smoothly, congratulations and I wish you heal this heartbreak.\nVanilla relationships are valuable and if you wonder she's probably thinking about you at times yet  just wishes to focus on her new relationship, which is not easy !",
            "author": "djvinc",
            "id": "gld6ist",
            "parent_id": "t3_l8itq5",
            "score": 4,
            "created_utc": 1612013736.0,
            "replies": []
        },
        {
            "body": "That is a wonderful story . I have had 3 sugar babies that where college students . Our time together was wonderful  . Our relationship was more than mutual beneficial but a true connection.  Ad I  know  going into such a relationship that the ending is inevitable but there is great satisfaction watching these young ladies blossom  .\n  Now since being on here I  see the really scamming side of the sugar bowl  . Only fans  and online sugar relationship profiles  start the culture of  conning  for the sake of the almighty dollar and not the true design of a sugar relationship  .",
            "author": "impulse175",
            "id": "gldmgy9",
            "parent_id": "t3_l8itq5",
            "score": 5,
            "created_utc": 1612022945.0,
            "replies": []
        },
        {
            "body": "Well a traditional sugar relationship really revolves around the sugar daddy  helping out the sugar baby personally,  financially,  emotionally and developing their personal growth  . Then the sugar baby recepercates by making the sugar daddy feel  respected, desired and wanted as both a person and man . I do not see how that whole  formula works out without meeting in person  . To build a true connection.",
            "author": "impulse175",
            "id": "gldnrgv",
            "parent_id": "t3_l8itq5",
            "score": 4,
            "created_utc": 1612023572.0,
            "replies": []
        },
        {
            "body": "Part of being a great SD is hoping that a great relationship will give her the support, time and space to meet an IRL man worthy of being her true, forever love......... but it hurts.",
            "author": "pinotandsugar",
            "id": "glexpv4",
            "parent_id": "t3_l8itq5",
            "score": 4,
            "created_utc": 1612045073.0,
            "replies": [
                {
                    "body": "This is a sad, but true statement.",
                    "author": "Y_4Z44",
                    "id": "glf2w81",
                    "parent_id": "t1_glexpv4",
                    "score": 2,
                    "created_utc": 1612047616.0,
                    "replies": []
                },
                {
                    "body": "Why does it have to be that way? )-: I've yet experience on but I don't understand why it has to end.",
                    "author": "sunshinedealerpd",
                    "id": "glfjorp",
                    "parent_id": "t1_glexpv4",
                    "score": 1,
                    "created_utc": 1612056283.0,
                    "replies": [
                        {
                            "body": "It does not have to end by government fiat or expiration of the's SB's license to sugar, but most do as the typical SB is in a period of exponential personal growth. Careers develop, personal relationships outside of sugar get serious, motherhood calls.",
                            "author": "pinotandsugar",
                            "id": "glfxk7a",
                            "parent_id": "t1_glfjorp",
                            "score": 2,
                            "created_utc": 1612063597.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "What a fairytale that was to read. I hope you two will find what your looking for, or end up crossing paths again :)",
            "author": "Jimmychoo_Loubou",
            "id": "gldsmye",
            "parent_id": "t3_l8itq5",
            "score": 2,
            "created_utc": 1612025822.0,
            "replies": []
        },
        {
            "body": "Aw that’s so nice! \nI have high hopes for a Reddit SD I’m meeting when it’s save again. \n\nIf I ever go back on SA I might add to the about me section that I’m extra interested in SDs that are on Reddit hihi",
            "author": "Adira5",
            "id": "gldumui",
            "parent_id": "t3_l8itq5",
            "score": 2,
            "created_utc": 1612026731.0,
            "replies": []
        },
        {
            "body": "Wholesome. 🥰🤗",
            "author": "VictoriaWestHou",
            "id": "glen7v7",
            "parent_id": "t3_l8itq5",
            "score": 2,
            "created_utc": 1612039969.0,
            "replies": []
        },
        {
            "body": "If you cant afford SA membership, You are not SD materials.\nThe membership is a sign of seriousness, it might not filter all fakes, saltdadies.... But it will reduce their numbers",
            "author": "extracheese343y",
            "id": "gleyu1j",
            "parent_id": "t3_l8itq5",
            "score": 0,
            "created_utc": 1612045624.0,
            "replies": []
        },
        {
            "body": "Thanks for sharing your story. Sounded like a great short term relationship. These memories are what we all hope and strive to achieve",
            "author": "supportiveceo",
            "id": "gldahxa",
            "parent_id": "t3_l8itq5",
            "score": 1,
            "created_utc": 1612016333.0,
            "replies": []
        },
        {
            "body": "What a sweet fling 💜",
            "author": "ashes2asscheeks",
            "id": "gleujm2",
            "parent_id": "t3_l8itq5",
            "score": 1,
            "created_utc": 1612043515.0,
            "replies": []
        },
        {
            "body": "That’s wonderful!  I’m sorry you two didn’t get more time together. The Netherlands is my favourite place to visit in the world, if anyone hasn’t gone reading this.. it’s a must ! (When it’s safe)",
            "author": "Cdnsugarr",
            "id": "glexn8y",
            "parent_id": "t3_l8itq5",
            "score": 1,
            "created_utc": 1612045038.0,
            "replies": []
        },
        {
            "body": "That's so nice, and what do you mean by vanilla exactly? That's had to imagine after you're description of the encounters? \n\nAlso I almost only ever get scammy people trying to link, so it's nice to hear of a success!",
            "author": "sunshinedealerpd",
            "id": "glfiwo3",
            "parent_id": "t3_l8itq5",
            "score": 1,
            "created_utc": 1612055876.0,
            "replies": [
                {
                    "body": "He means a traditional relationship not sugar.",
                    "author": "Zealousideal_Lion472",
                    "id": "glfvcb0",
                    "parent_id": "t1_glfiwo3",
                    "score": 1,
                    "created_utc": 1612062449.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I talk to many SB's on reddit, many platonics, cam girls etc. The first reply I give them is usually the last because there is only a small chance they are local. I simply ask them how far they are from cityx because if they are not within a 100 miles they are wasting their breath.",
            "author": null,
            "id": "glfkqnt",
            "parent_id": "t3_l8itq5",
            "score": 1,
            "created_utc": 1612056832.0,
            "replies": []
        },
        {
            "body": "The real life fairytales like this keep giving me hope, so cute.",
            "author": "ladylunapluss",
            "id": "glgb9ci",
            "parent_id": "t3_l8itq5",
            "score": 1,
            "created_utc": 1612071533.0,
            "replies": []
        },
        {
            "body": "I met a great guy on Reddit this past week. Unfortunately he’s from Europe and I’m in the states 🙁",
            "author": null,
            "id": "glgge0o",
            "parent_id": "t3_l8itq5",
            "score": 1,
            "created_utc": 1612075152.0,
            "replies": []
        },
        {
            "body": "Hello, I’m curious. How are y’all finding folks on here??",
            "author": "Xomeetangie",
            "id": "gldohs9",
            "parent_id": "t1_glcw8yq",
            "score": 10,
            "created_utc": 1612023920.0,
            "replies": [
                {
                    "body": "I assumed people just pm on the regular. I never reach out to anyone but I get a decent amount of pms on reddit(won’t deny they are 90% scammers) but there’s some decent humans throughout the site that I’ve spoken to. I have a separate account for non-sugar things and I’ve spoken to many over the years and just made some Internet buddies.\n\nOn this account some SD’s have reached out and I don’t mind talking on here and seeing where it takes us. Doesn’t always work out but in the end I made a friend and maybe I got to learn something from them along the way :)\n\nIt never hurts to send a message. At the very least you can say you put yourself out there.",
                    "author": "avanirvana",
                    "id": "gleq4vf",
                    "parent_id": "t1_gldohs9",
                    "score": 4,
                    "created_utc": 1612041381.0,
                    "replies": [
                        {
                            "body": "Very true... thank you for the input",
                            "author": "Xomeetangie",
                            "id": "glfif5m",
                            "parent_id": "t1_gleq4vf",
                            "score": 1,
                            "created_utc": 1612055618.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "glfg293",
                    "parent_id": "t1_gldohs9",
                    "score": 2,
                    "created_utc": 1612054372.0,
                    "replies": [
                        {
                            "body": "Yes, The more I read the old threads, the more I realize that",
                            "author": "Xomeetangie",
                            "id": "glfiny6",
                            "parent_id": "t1_glfg293",
                            "score": 1,
                            "created_utc": 1612055748.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "My thought exactly!",
            "author": null,
            "id": "glheytn",
            "parent_id": "t1_gldpd88",
            "score": 1,
            "created_utc": 1612104497.0,
            "replies": []
        },
        {
            "body": "This is a sad, but true statement.",
            "author": "Y_4Z44",
            "id": "glf2w81",
            "parent_id": "t1_glexpv4",
            "score": 2,
            "created_utc": 1612047616.0,
            "replies": []
        },
        {
            "body": "Why does it have to be that way? )-: I've yet experience on but I don't understand why it has to end.",
            "author": "sunshinedealerpd",
            "id": "glfjorp",
            "parent_id": "t1_glexpv4",
            "score": 1,
            "created_utc": 1612056283.0,
            "replies": [
                {
                    "body": "It does not have to end by government fiat or expiration of the's SB's license to sugar, but most do as the typical SB is in a period of exponential personal growth. Careers develop, personal relationships outside of sugar get serious, motherhood calls.",
                    "author": "pinotandsugar",
                    "id": "glfxk7a",
                    "parent_id": "t1_glfjorp",
                    "score": 2,
                    "created_utc": 1612063597.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "He means a traditional relationship not sugar.",
            "author": "Zealousideal_Lion472",
            "id": "glfvcb0",
            "parent_id": "t1_glfiwo3",
            "score": 1,
            "created_utc": 1612062449.0,
            "replies": []
        },
        {
            "body": "I assumed people just pm on the regular. I never reach out to anyone but I get a decent amount of pms on reddit(won’t deny they are 90% scammers) but there’s some decent humans throughout the site that I’ve spoken to. I have a separate account for non-sugar things and I’ve spoken to many over the years and just made some Internet buddies.\n\nOn this account some SD’s have reached out and I don’t mind talking on here and seeing where it takes us. Doesn’t always work out but in the end I made a friend and maybe I got to learn something from them along the way :)\n\nIt never hurts to send a message. At the very least you can say you put yourself out there.",
            "author": "avanirvana",
            "id": "gleq4vf",
            "parent_id": "t1_gldohs9",
            "score": 4,
            "created_utc": 1612041381.0,
            "replies": [
                {
                    "body": "Very true... thank you for the input",
                    "author": "Xomeetangie",
                    "id": "glfif5m",
                    "parent_id": "t1_gleq4vf",
                    "score": 1,
                    "created_utc": 1612055618.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "glfg293",
            "parent_id": "t1_gldohs9",
            "score": 2,
            "created_utc": 1612054372.0,
            "replies": [
                {
                    "body": "Yes, The more I read the old threads, the more I realize that",
                    "author": "Xomeetangie",
                    "id": "glfiny6",
                    "parent_id": "t1_glfg293",
                    "score": 1,
                    "created_utc": 1612055748.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "It does not have to end by government fiat or expiration of the's SB's license to sugar, but most do as the typical SB is in a period of exponential personal growth. Careers develop, personal relationships outside of sugar get serious, motherhood calls.",
            "author": "pinotandsugar",
            "id": "glfxk7a",
            "parent_id": "t1_glfjorp",
            "score": 2,
            "created_utc": 1612063597.0,
            "replies": []
        },
        {
            "body": "Very true... thank you for the input",
            "author": "Xomeetangie",
            "id": "glfif5m",
            "parent_id": "t1_gleq4vf",
            "score": 1,
            "created_utc": 1612055618.0,
            "replies": []
        },
        {
            "body": "Yes, The more I read the old threads, the more I realize that",
            "author": "Xomeetangie",
            "id": "glfiny6",
            "parent_id": "t1_glfg293",
            "score": 1,
            "created_utc": 1612055748.0,
            "replies": []
        }
    ]
}