{
    "title": "Lessons on Sugaring with style and grace",
    "post_id": "aupszm",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/aupszm/lessons_on_sugaring_with_style_and_grace/",
    "author": "10WiseWords",
    "body": "It occurs to me as I’ve read many posts recently that perhaps some of the problems SBs are encountering is because of poorly written biographies. Understanding the steps in attracting the “right” SD can definitely be helpful, and I’m a firm believer that an improvement in the “marketing” will always positively affect the end relationships. I’ve had some success with SA, and I hope my advice will offer some guidance and open a discussion for those ladies feeling frustrated or disappointed. I’m happy to chime in with advice or revisions and tweaking of your bio, if you like. \n\nMy experiences have ranged from a paid platonic dinners for companionship, long term but sporadic meetings to accommodate business travel, long weekends away, to monthly allowances paid regardless of his ability to meet, to all monthly expenses paid and a generous clothing budget allowance. Why have I been successful and others not? I’m certain I am absolutely not the most beautiful woman here, but I have learned what works for me—and I’d like to share. \n\nMy mindset, and I’m upfront here and on SA, is that this endeavor should be taken on as an adventure and treated as a side business. I realize that will ruffle some feathers, but it’s the best working metaphor I can offer (pun intended). \n\nLet’s start at the beginning. What brings me here? The economics of having good taste, a COMPLETE lack of tolerance for lies or games, and a very high sex drive. That said, I am extremely cautious and discriminating.  By that, mean I know I’m not every Seekers cup of tea. In fact, I wouldn’t want to be. I understand finding a fit that works for us both and offers shared chemistry and workable geography will take time. I’ve had three long term, emotionally fulfilling and mutually beneficial relationships from this site. I can even offer references! \n\nThat being said, I understand completely my place in my SDs life is as entertainment, therapy, and stress relief. My photos show my face, shape and assets. No nudes. And, I won’t send them until we have an established agreement and have met in person. I do have professional lingerie shots. They aren’t photoshopped. My profile is polite and very specific. Remember ladies, this is essentially your resume. The goal of a good resume is to highlight your talents, passions and give an idea of the atmosphere in which you hope to thrive. The goal of a good resume is to be offered a M&G, and to have established a bit of rapport to know you WANT to know more about the possibility of an agreement. The M&G is closely related to the job interview. Here, you also (the SB) are checking for a level of attraction, rapport and chemistry. You want to feel safe and also coveted. That’s the fun! \n\nMy best advice: Be real, Be Authentic and give and deserve Respect. \n\nIs there a dark side? Absolutely. In short ladies: be prepared for some scams, rude requests, and sourpuss SDs who can’t afford you. Laugh it off and don’t let it dissuade you. \n\nKeep your safety as priority #1. Set up a way to communicate that is NOT your phone number. Kik or TextFree or a burner number. Discuss Sexual Safety upfront. Have an app on your phone that knows your location and you can use passively. (I like Noonlight). Uber to and from your first meetings, if possible, or have a discrete friend drop you off and then leave to wait nearby or check in later. Always have one person who knows your location and when you’ll check in.\n\nBe on time, and look amazing. If you’re nervous, be upfront. He is too, even if he’s had more experience. Smile. Speak about things you both enjoy (movies, music, travel) and very gently introduce touch (if it feels right to you). Always, listen to your instincts. Are you having fun, enjoying the spark of anticipation? Can you flirt and enjoy each other’s company? \n\nIf your body says NO, listen to it. Your intuition is a gift. \n\nCompartmentalize your *value* and never mistake it for your *worth*.  \n\nAct like a lady and never accept treatment that demeans you. The block feature is your friend. You are offering a service, companionship, affection and discretion. Your time is valuable. So is his. Happy seeking! ",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/aupszm/lessons_on_sugaring_with_style_and_grace/",
    "score": 140,
    "upvote_ratio": 0.95,
    "created_utc": 1551126000.0,
    "num_comments": 59,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "I agree wholeheartedly with your post. It just feels frustrating and funny when you come across an SD's profile that wants a SB who is a \"lady/classy,\" but then demand to see nudes with your face cropped out before even meeting (and then claim its not personal nudes because your face is cropped out!?!?!1!). Then when you say no, they get hissy and call you a narcissist. Like, wut? Proceeded to block and report that bitter/angsty guy. I'm just trying to stay positive, but I am glad I didn't break my resolve.",
            "author": "LaIndiaDeAzucar",
            "id": "eh9tvqb",
            "parent_id": "t3_aupszm",
            "score": 31,
            "created_utc": 1551129179.0,
            "replies": [
                {
                    "body": "Good for you. Yes, it’s a swim with sharks, for sure. I’ve recently allowed my photos for only 24 hours, and then if the trolls are hissy—I say make an arrangement, I am not a spank bank. 😉",
                    "author": "10WiseWords",
                    "id": "eh9v5n0",
                    "parent_id": "t1_eh9tvqb",
                    "score": 17,
                    "created_utc": 1551130007.0,
                    "replies": [
                        {
                            "body": "That made me laugh, spank bank!",
                            "author": "PassionSense",
                            "id": "eha0wez",
                            "parent_id": "t1_eh9v5n0",
                            "score": 6,
                            "created_utc": 1551133895.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "You should be thanking him for playing his dirtbag card early in the game. ",
                    "author": "pinotandsugar",
                    "id": "eha2jb8",
                    "parent_id": "t1_eh9tvqb",
                    "score": 7,
                    "created_utc": 1551135074.0,
                    "replies": []
                },
                {
                    "body": "Why not be a bit classy. For the right guy it could pay off. Sexting and the ability to send a quick picture is very easy today but it doesn’t always show the value of your character. Impressive photos give me more tempting to the mind then nakedness. One contact I’ve made did not send a single compromising photo. If something is to be done in the future after a meet and greet I’m sure further teasing would follow. It’s more than the body. \nV. ",
                    "author": "camosailboat",
                    "id": "ehakubg",
                    "parent_id": "t1_eh9tvqb",
                    "score": 0,
                    "created_utc": 1551149146.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I had my SA account taken down in the last sorry using “escort” language so I e been nervous ever since then to state exactly what I’m looking for. \n\nSince then I’ve had men reach out who don’t understand that I’m looking for an arrangement and not to just go to dinner and have sex. What do you say on your profile to get across that your looking for an arrangement and not a salt and/or experience daddy?",
            "author": "SugarBabySD",
            "id": "eh9wwop",
            "parent_id": "t3_aupszm",
            "score": 13,
            "created_utc": 1551131166.0,
            "replies": [
                {
                    "body": "Hmmmmm. Let me look and see if I can offer some direction. I’ll PM you. ",
                    "author": "10WiseWords",
                    "id": "eh9xbcu",
                    "parent_id": "t1_eh9wwop",
                    "score": 7,
                    "created_utc": 1551131438.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Very well said, very classy. I haven't got time to write at length here, but there's a basic corollary/parallel for SDs. Act like a gentleman, always show respect, don't accept  disrespect or bad behavior, value your lady's time, company, contribution and enjoyment.",
            "author": "OlderSD",
            "id": "eh9qbml",
            "parent_id": "t3_aupszm",
            "score": 17,
            "created_utc": 1551126901.0,
            "replies": []
        },
        {
            "body": "Wow... just wow.. I’ve thought about it as a job but never on this aspect. Thank you for this! ",
            "author": "KillaVibesXO",
            "id": "eh9v8zs",
            "parent_id": "t3_aupszm",
            "score": 7,
            "created_utc": 1551130069.0,
            "replies": [
                {
                    "body": "Thanks for being open to it. Perhaps it will help or at least offer a good perspective when it’s tough. ",
                    "author": "10WiseWords",
                    "id": "eh9wr8t",
                    "parent_id": "t1_eh9v8zs",
                    "score": 3,
                    "created_utc": 1551131066.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Good post and I like the “with grace”.  When meeting someone be polite even if you are not interested.  Either side can say no and there’s no reason to be rude.\n\nYou can talk and find a fit with someone if your are honest about your wants and needs.  And no need to shame someone for differing wants and needs.  If they don’t fit just say it’s not what you’re looking for and wish them the best. ",
            "author": "throwawayrdu71",
            "id": "ehack89",
            "parent_id": "t3_aupszm",
            "score": 4,
            "created_utc": 1551142917.0,
            "replies": [
                {
                    "body": "Agreed. A good reminder since younger SBs seem to come predominantly from a sense of entitlement rather than a space of mutual respect. ",
                    "author": "10WiseWords",
                    "id": "ehadaqq",
                    "parent_id": "t1_ehack89",
                    "score": 4,
                    "created_utc": 1551143495.0,
                    "replies": [
                        {
                            "body": "This comment was enough to make me fall in love with you...",
                            "author": null,
                            "id": "ehatmz9",
                            "parent_id": "t1_ehadaqq",
                            "score": 2,
                            "created_utc": 1551156031.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Golded because I agree with every single word you said 100%, especially the second-to-last line re value and worth.",
            "author": "xxnightrain",
            "id": "ehb2gru",
            "parent_id": "t3_aupszm",
            "score": 4,
            "created_utc": 1551166559.0,
            "replies": [
                {
                    "body": "Thank you! I’m stoked. My first Gold. Party!!",
                    "author": "10WiseWords",
                    "id": "ehb2x1u",
                    "parent_id": "t1_ehb2gru",
                    "score": 2,
                    "created_utc": 1551167212.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Extremely well-written. My compliments!",
            "author": null,
            "id": "eh9zscd",
            "parent_id": "t3_aupszm",
            "score": 3,
            "created_utc": 1551133114.0,
            "replies": []
        },
        {
            "body": "Some women cannot seem to celebrate others as they should — and it’s a shame, because we’d all be much better off being advocates instead of judges. To the critics: Don’t assume that because you’ve read a couple posts, you are an expert in someone else’s life. Nobody is better off as a result of your attempt to knock someone’s life experiences, and you aren’t doing any favors by “pointing out inconsistencies”.  I suggest taking a long look at why you feel the need to do so in the first place. \n\nAs the saying goes, take what you like, and leave the rest. Or if you don’t have anything nice to say.. STFU. \n\nAwesome post OP.",
            "author": "shelbyscarlett",
            "id": "ehake88",
            "parent_id": "t3_aupszm",
            "score": 6,
            "created_utc": 1551148805.0,
            "replies": [
                {
                    "body": "Thank you. This is so well said and BRAVO for it. Thanks for having my back, and for honoring the truth that women are stronger as a whole when we lift each other up. Advocates, not judges. I love it! ❤️❤️",
                    "author": "10WiseWords",
                    "id": "ehal2zq",
                    "parent_id": "t1_ehake88",
                    "score": 1,
                    "created_utc": 1551149324.0,
                    "replies": [
                        {
                            "body": "Anytime sister! ☺️ Going out of the way to publicly cast judgement is just toxic, IMO. Hoping she (and all of us) can find the joy and strength in lifting each other up instead of separating and finding fault. ❤️",
                            "author": "shelbyscarlett",
                            "id": "ehaltlz",
                            "parent_id": "t1_ehal2zq",
                            "score": 2,
                            "created_utc": 1551149859.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Awesome post! ",
            "author": "snake_pod",
            "id": "ehatopx",
            "parent_id": "t3_aupszm",
            "score": 2,
            "created_utc": 1551156077.0,
            "replies": [
                {
                    "body": "Thank you! I’m glad you liked it!",
                    "author": "10WiseWords",
                    "id": "ehav4ru",
                    "parent_id": "t1_ehatopx",
                    "score": 1,
                    "created_utc": 1551157435.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yup",
            "author": null,
            "id": "ehc80et",
            "parent_id": "t3_aupszm",
            "score": 2,
            "created_utc": 1551208046.0,
            "replies": []
        },
        {
            "body": "Truly wonderful advice.",
            "author": "marker3000",
            "id": "ehciej0",
            "parent_id": "t3_aupszm",
            "score": 2,
            "created_utc": 1551215031.0,
            "replies": []
        },
        {
            "body": "I am new to exploring being a SB.. I'm very interested in how I could benefit from such arrangements. Your post has helped me out a lot with what to expect.  Wondering if I could ask you a few questions?",
            "author": "SweetSolaGirl",
            "id": "ehi8sd6",
            "parent_id": "t3_aupszm",
            "score": 2,
            "created_utc": 1551390314.0,
            "replies": [
                {
                    "body": "Sure!",
                    "author": "10WiseWords",
                    "id": "ehiilju",
                    "parent_id": "t1_ehi8sd6",
                    "score": 1,
                    "created_utc": 1551396860.0,
                    "replies": [
                        {
                            "body": "How is the best way to go about getting paid? I've come across multiple people wanting to use my bank account, which I have denied. They are obviously scammers right? How can I find someone real that will set an arrangement so I can actually be paid. ",
                            "author": "SweetSolaGirl",
                            "id": "ehiu9kt",
                            "parent_id": "t1_ehiilju",
                            "score": 1,
                            "created_utc": 1551405587.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "This post and your last post are polar opposites.\n\nYou're a successful SB with 26usd to your name and drowning in medical debt?",
            "author": "Kitoko30",
            "id": "eh9td3h",
            "parent_id": "t3_aupszm",
            "score": 4,
            "created_utc": 1551128842.0,
            "replies": [
                {
                    "body": "My life has definitely been a lesson in keeping balance, that’s for sure. If you read that post in full you saw I was explaining a very difficult time in my life. I’ve recently survived betrayal, divorce, the loss of my career and and ongoing fight with the IRS for my ex’s poor choices and his creditors for check fraud. I’ve even survived cancer! I’ve had success as an SB, and those experiences make me a good example of resilience and determination. As always, I’m open and honest. Thank you for a chance to clarify and for your due diligence! If it was an attempt to discredit my advice here, I’m happy to have a chance to respond. ",
                    "author": "10WiseWords",
                    "id": "eh9vdqj",
                    "parent_id": "t1_eh9td3h",
                    "score": 10,
                    "created_utc": 1551130155.0,
                    "replies": [
                        {
                            "body": "I am very proud of you!!!!!!!!! Great post but your wisdom, advice, determination and survival traits are incredible! Falling is not the issue, nor is getting up after a fall; it is what we do when we get up that matters most. You are an amazingly incredible person and again, I am very proud of you!!!!!!!!!\n\nFailure happens at the moment we assign it the merits of the best viable option, so glad you ignored that and persevered! :) It isn't the current worth, which holds value, it is value in character which dictates the future value in total assets accumulated. Already you have more than most so, ignore those who wish to discount you from a naive, present day, monetary level.",
                            "author": "AlmostFullyEvolved",
                            "id": "eh9xt2f",
                            "parent_id": "t1_eh9vdqj",
                            "score": 4,
                            "created_utc": 1551131763.0,
                            "replies": [
                                {
                                    "body": "Awwwwww. Thank you. I appreciate you!!",
                                    "author": "10WiseWords",
                                    "id": "eh9xy10",
                                    "parent_id": "t1_eh9xt2f",
                                    "score": 5,
                                    "created_utc": 1551131851.0,
                                    "replies": [
                                        {
                                            "body": "No need to thank me... I thank you for posting such a refreshing post! :) It is the positive attitude which increases success, unlike all of the frequent complaining, gender bashing and pouting posts.",
                                            "author": "AlmostFullyEvolved",
                                            "id": "eh9yr5s",
                                            "parent_id": "t1_eh9xy10",
                                            "score": 2,
                                            "created_utc": 1551132398.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Not discrediting. Pointing out inconsistency between last/this post. \n\n' My experiences have ranged from a paid platonic dinners for companionship, long term but sporadic meetings to accommodate business travel, long weekends away, to monthly allowances paid regardless of his ability to meet, to all monthly expenses paid and a generous clothing budget allowance.  '\n\nThat makes absolutely no sense given 12 days ago 26 to your name/no credit/no car/no job/drowning in medical debt/etc",
                            "author": "Kitoko30",
                            "id": "eh9yelm",
                            "parent_id": "t1_eh9vdqj",
                            "score": 0,
                            "created_utc": 1551132160.0,
                            "replies": [
                                {
                                    "body": "So the assumption is that I always have an SD, just because I’ve had great arrangements in the past? That definitely makes you the ass here, as assumptions go. Of course I have a car and a job, since I’ve *survived* those setbacks. I was describing a heartbreaking time in my life, right after my divorce and cancer treatments. You like poking for a response and that makes you unwelcome on my thread.  You are officially becoming rude. And, since you offer no soul baring insights and only more criticism and contempt, you are exactly what ISN’T welcome here. Am I right, SLF??",
                                    "author": "10WiseWords",
                                    "id": "eh9ztpe",
                                    "parent_id": "t1_eh9yelm",
                                    "score": 8,
                                    "created_utc": 1551133140.0,
                                    "replies": [
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "ehbmirv",
                                            "parent_id": "t1_eh9ztpe",
                                            "score": 4,
                                            "created_utc": 1551192691.0,
                                            "replies": [
                                                {
                                                    "body": "And I’ve politely responded. Goad elsewhere. ",
                                                    "author": "10WiseWords",
                                                    "id": "ehcakuy",
                                                    "parent_id": "t1_ehbmirv",
                                                    "score": 1,
                                                    "created_utc": 1551209790.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Oh piss off",
                    "author": "cornycatlady",
                    "id": "eh9v8dj",
                    "parent_id": "t1_eh9td3h",
                    "score": 0,
                    "created_utc": 1551130057.0,
                    "replies": [
                        {
                            "body": "Being financially destitute is not one of the pillars of success for any sb",
                            "author": "Kitoko30",
                            "id": "eh9wpd1",
                            "parent_id": "t1_eh9v8dj",
                            "score": -2,
                            "created_utc": 1551131030.0,
                            "replies": [
                                {
                                    "body": "It is amazing how you we can all read the same thing and how little you actually got from it. I guess you missed the part where she wrote: **\"Compartmentalize your** ***value*** **and never mistake it for your** ***worth*****.** Shame, as you seem to be focused on her net worth and completely missed her vast wealth.\n\nSeems some splenda daddy's have a need to make themselves feel better by attacking the SBs income, as a means of making themselves feel better, while missing the fact that it only makes them look like a total ass. I have found those who look down on others, because of their present day financials are, most commonly, rather financially restricted themselves. Speaking for myself only: I sometimes feel guilty about my wealth and feel a need to bring others up or secretly contribute towards their potential. (Investing in people is far more liberating than destroying, or unjustifiably humiliating them, in front of others) What I don't ever do is; mimic your terrible attempt at humiliating a person, who also has an enormous amount of drive and potential.\n\nOne day soon, her financial wealth will, mostly likely, surpass yours; as her value portrayed here, already has...",
                                    "author": "AlmostFullyEvolved",
                                    "id": "eha03ez",
                                    "parent_id": "t1_eh9wpd1",
                                    "score": 8,
                                    "created_utc": 1551133325.0,
                                    "replies": [
                                        {
                                            "body": "I'm female. \n\nMy comments are specific to her literal ' panic everyday about food/gas ' whilst offering advice on facilitating SRs/her extensive success as SB. \n\n",
                                            "author": "Kitoko30",
                                            "id": "eha1s2s",
                                            "parent_id": "t1_eha03ez",
                                            "score": 4,
                                            "created_utc": 1551134528.0,
                                            "replies": [
                                                {
                                                    "body": "Knowing (now)  that you’re female makes your comments far more understandable. I shared heartbreak in one post and solid advice from success in another. Perhaps changing your focus away from constantly throwing shade on other women is a good goal for you. I’m certain it will make you more attractive to both sexes. ",
                                                    "author": "10WiseWords",
                                                    "id": "eha3jvv",
                                                    "parent_id": "t1_eha1s2s",
                                                    "score": 4,
                                                    "created_utc": 1551135813.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "Luckily, times do change quickly. Especially when one is smart and beautiful! ",
                                    "author": "10WiseWords",
                                    "id": "eh9wyw1",
                                    "parent_id": "t1_eh9wpd1",
                                    "score": 1,
                                    "created_utc": 1551131208.0,
                                    "replies": []
                                },
                                {
                                    "body": "She did not mention that anywhere in her post???",
                                    "author": "cornycatlady",
                                    "id": "eh9wtwc",
                                    "parent_id": "t1_eh9wpd1",
                                    "score": -1,
                                    "created_utc": 1551131115.0,
                                    "replies": [
                                        {
                                            "body": "It’s in a previous post. What can I say? If you dig, you end up with dirt...my dirt is just easier to find. I don’t hide it. I never dreamed it would be used as ammunition, but it’s no less authentic. It’s ALL part of my story. ",
                                            "author": "10WiseWords",
                                            "id": "eha40bu",
                                            "parent_id": "t1_eh9wtwc",
                                            "score": 7,
                                            "created_utc": 1551136156.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I've never paid for my own photography so I don't know the answer to this -- what's  the point of professional photography if it's not photoshopped? Don't people usually hire this person to get beautiful, finely retouched photos back? Not photoshopping like a magazine ad where the model might not resemble the actual model anymore, but def photoshopped.",
            "author": null,
            "id": "eh9tagn",
            "parent_id": "t3_aupszm",
            "score": 3,
            "created_utc": 1551128793.0,
            "replies": [
                {
                    "body": "I’m a photographer. I don’t call it photoshopping to adjust light, color balance, or do minor retouching like removing a few blemishes or brightening teeth. I don’t even do that in Photoshop, I use Lightroom. That’s just finishing the photo in post, it’s standard work flow. I’d never give a client a raw photo.\n\nActual photoshopping done in Photoshop would be where I’d fix things like under-eye circles, sun damage, cellulite and wrinkles, drastically uneven skin tones, scars, “contouring”, and Frankenstein body parts together if necessary. That’s gonna cost extra. But it’s also seriously overboard for most people, unless they’re going in a magazine of course. \n\nTo be honest, a good photographer can make someone look 10x better than they do in real life without spending a single minute in Photoshop. Lens choice, aperture, lighting, angles, setting, makeup, clothing, eliciting certain expressions, moods, and poses. Those things are so much more important than photoshopping. THAT is why you hire a photographer. Otherwise any idiot with an Adobe account can make your pores and wrinkles disappear from your phone selfies. They’re not comparable :)\n\nTl;dr People hire photographers to get professional photos, not to get photoshopped photos",
                    "author": "freyjacalifornia",
                    "id": "ehb9g15",
                    "parent_id": "t1_eh9tagn",
                    "score": 6,
                    "created_utc": 1551178356.0,
                    "replies": []
                },
                {
                    "body": "I actually have them because I’ve done a bit of  lingerie modeling. I just put it out there as what works for me. Absolutely a friend with a great camera can take awesome pictures as well. And I don’t consider it photoshopped to brighten up the lighting or do some cropping, I advertise if my body is as you can see it in real life. Also have photos I like very much I’ve taken with my phone, so my profile mixes both. Thank you for the question! ",
                    "author": "10WiseWords",
                    "id": "eh9uut0",
                    "parent_id": "t1_eh9tagn",
                    "score": 3,
                    "created_utc": 1551129810.0,
                    "replies": [
                        {
                            "body": "It definitely IS still photoshopping to adjust lighting and small details and such. Most professionally done photos will have some level of skin retouching as well. Small things like removing blemishes or taking away a stray hair that’s falling across your cheek, or removing a bit of stubble/razor burn. (Unless you specifically request they not do that, and some don’t want their work shown unless it’s polished to their usual degree of quality)\n\nI know you mean it colloquially, as in they didn’t morph your body into something it isn’t, but people need to stop using incorrect terminology for this because it just gives cranky dudes ammo. If they see a perfectly manicured photo, and the subject says it isn’t photoshopped, then that’s one more unrealistic standard that they’ll use to prop up arguments. \n\n",
                            "author": "oh_come_on_eileen",
                            "id": "eha1ct9",
                            "parent_id": "t1_eh9uut0",
                            "score": -2,
                            "created_utc": 1551134221.0,
                            "replies": [
                                {
                                    "body": "Hmmm. An interesting point. Thank you for the insight. Although I don’t post the finished/edited photos to SA (legally they don’t belong to me once they are sold and published elsewhere) I can see your point. I actually prefer the untouched photos, so those are the ones I share. I think, though, that my photos are a nice mix of casual photos and those that show my full body. ",
                                    "author": "10WiseWords",
                                    "id": "eha2soh",
                                    "parent_id": "t1_eha1ct9",
                                    "score": 2,
                                    "created_utc": 1551135262.0,
                                    "replies": []
                                },
                                {
                                    "body": "Retouching in the ways that you mention is not what I consider photoshopping. Suggesting that spending three minutes removing blemishes and adjusting light/color balance is “photoshopping” is just silly. Cranky dudes can have all the ammo they want. I’ll even Photoshop some into their photos if they’d like :)",
                                    "author": "freyjacalifornia",
                                    "id": "ehb9r6f",
                                    "parent_id": "t1_eha1ct9",
                                    "score": 1,
                                    "created_utc": 1551178857.0,
                                    "replies": [
                                        {
                                            "body": "That’s literally photoshopping though? It’s not even just cranky dudes, it’s using the term wrong. There needs to be a clearer distinction between photoshopped and unretouched work, and if people are demanding it of companies that use photos to advertise their products, we should be able to expect the same honesty as well when people say they haven’t photoshopped something. \n\nLike it isn’t even necessary to mention in most cases, and if you’re gonna say ‘not photoshopped’ it needs to not be, and if it is, just say ‘light photo editing’ or ‘light retouching’.\n\nIf it’s enough of an issue that you need to mention it and want to make a clear stand on the topic, have a disclaimer on photos saying ‘no modification of my body is done during photo editing, only lighting and color adjustments have been made’. Otherwise saying ‘my pics aren’t photoshopped’ is disingenuous. ",
                                            "author": "oh_come_on_eileen",
                                            "id": "ehcd13s",
                                            "parent_id": "t1_ehb9r6f",
                                            "score": 2,
                                            "created_utc": 1551211449.0,
                                            "replies": [
                                                {
                                                    "body": "I mean... it’s actually not literally photoshopping. I’m a photographer. I don’t even use Photoshop to do “light retouching”. I use Lightroom. If you’d like to get that pedantic about it, shall we verbify lightrooming? \n\nI consider photoshopping to be making material changes to the subject of the image that could not have been done with different lighting conditions or makeup when the photo was taken. Covering up a zit or lightening the exposure around the face is just not photoshopping.",
                                                    "author": "freyjacalifornia",
                                                    "id": "ehcgks7",
                                                    "parent_id": "t1_ehcd13s",
                                                    "score": 1,
                                                    "created_utc": 1551213810.0,
                                                    "replies": [
                                                        {
                                                            "body": "I’m not the one who decides what colloquialisms mean. If you wanna try to make lightrooming happen then go for it. \n\nI’m being ‘pedantic’ because there are enough accusations of disingenuous behavior in this lifestyle and for women in general, so using definitive language is important.\n\nI do think the proliferation of unretouched bodies in photos is important. I wholly encourage people to do that. But again, to some people, ‘not photoshopped’ is being used as ‘all stretch marks and acne are gone, and very natural looking edits like mild teeth whitening or removing stray hairs are done’ (as opposed to warping or facetuning the body/face) rather than truly not being retouched at all, so people need to be clear when they’re making statements about it.\n\nAgain, it’s a thing where you don’t HAVE to say anything about it, but if you feel strongly enough to do so, I believe it’s important to be clear and honest. ",
                                                            "author": "oh_come_on_eileen",
                                                            "id": "ehfr5ja",
                                                            "parent_id": "t1_ehcgks7",
                                                            "score": 1,
                                                            "created_utc": 1551311821.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Excellent lesson young lady. Bravo!\n\n",
            "author": "JamFurallya",
            "id": "eha0x2g",
            "parent_id": "t3_aupszm",
            "score": 2,
            "created_utc": 1551133908.0,
            "replies": []
        },
        {
            "body": "Rule #1: Be Attractive.\n\nRule #2: Don't listen to advice from people who were born rich, attractive or gifted. They are mostly useless",
            "author": "xanfiles",
            "id": "ehauh38",
            "parent_id": "t3_aupszm",
            "score": 2,
            "created_utc": 1551156802.0,
            "replies": [
                {
                    "body": "Is this an assumption about me from my post, or advice offered to me, or just a random bit of advice? (As an aside, Technically we are all born with nothing, and die the same way, right?) r/showerthoughts",
                    "author": "10WiseWords",
                    "id": "ehauz4g",
                    "parent_id": "t1_ehauh38",
                    "score": 1,
                    "created_utc": 1551157285.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I thought u were married for 17 years?",
            "author": null,
            "id": "eh9ysez",
            "parent_id": "t3_aupszm",
            "score": -2,
            "created_utc": 1551132423.0,
            "replies": [
                {
                    "body": "I was! Are you assuming all SBs are early 20s?",
                    "author": "10WiseWords",
                    "id": "eh9zxoe",
                    "parent_id": "t1_eh9ysez",
                    "score": 7,
                    "created_utc": 1551133216.0,
                    "replies": [
                        {
                            "body": "No it’s not about age, I was just saying you don’t really know the game since you were married the last 17 years. \n\n",
                            "author": null,
                            "id": "eha2sgi",
                            "parent_id": "t1_eh9zxoe",
                            "score": -3,
                            "created_utc": 1551135257.0,
                            "replies": [
                                {
                                    "body": "Again, an assumption. Wow! I’ve been separated and divorced over 3 years. I’ve had multiple interactions, multiple (and varied) arrangements, and exchanged several hundred messages. So, I can offer some insight from life and my experiences in this lifestyle. Take it or leave it. Frankly, my experience as a longtime wife makes me a capable and intelligent mistress. Shocking, huh?",
                                    "author": "10WiseWords",
                                    "id": "eha9kmm",
                                    "parent_id": "t1_eha2sgi",
                                    "score": 7,
                                    "created_utc": 1551140514.0,
                                    "replies": [
                                        {
                                            "body": "If you have 3 years, then I made the wrong assumptions. Sorry if it came out as if I was questioning your credibility. ",
                                            "author": null,
                                            "id": "ehbb5q9",
                                            "parent_id": "t1_eha9kmm",
                                            "score": 1,
                                            "created_utc": 1551181062.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Good for you. Yes, it’s a swim with sharks, for sure. I’ve recently allowed my photos for only 24 hours, and then if the trolls are hissy—I say make an arrangement, I am not a spank bank. 😉",
            "author": "10WiseWords",
            "id": "eh9v5n0",
            "parent_id": "t1_eh9tvqb",
            "score": 17,
            "created_utc": 1551130007.0,
            "replies": [
                {
                    "body": "That made me laugh, spank bank!",
                    "author": "PassionSense",
                    "id": "eha0wez",
                    "parent_id": "t1_eh9v5n0",
                    "score": 6,
                    "created_utc": 1551133895.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "You should be thanking him for playing his dirtbag card early in the game. ",
            "author": "pinotandsugar",
            "id": "eha2jb8",
            "parent_id": "t1_eh9tvqb",
            "score": 7,
            "created_utc": 1551135074.0,
            "replies": []
        },
        {
            "body": "Why not be a bit classy. For the right guy it could pay off. Sexting and the ability to send a quick picture is very easy today but it doesn’t always show the value of your character. Impressive photos give me more tempting to the mind then nakedness. One contact I’ve made did not send a single compromising photo. If something is to be done in the future after a meet and greet I’m sure further teasing would follow. It’s more than the body. \nV. ",
            "author": "camosailboat",
            "id": "ehakubg",
            "parent_id": "t1_eh9tvqb",
            "score": 0,
            "created_utc": 1551149146.0,
            "replies": []
        },
        {
            "body": "Hmmmmm. Let me look and see if I can offer some direction. I’ll PM you. ",
            "author": "10WiseWords",
            "id": "eh9xbcu",
            "parent_id": "t1_eh9wwop",
            "score": 7,
            "created_utc": 1551131438.0,
            "replies": []
        },
        {
            "body": "Thanks for being open to it. Perhaps it will help or at least offer a good perspective when it’s tough. ",
            "author": "10WiseWords",
            "id": "eh9wr8t",
            "parent_id": "t1_eh9v8zs",
            "score": 3,
            "created_utc": 1551131066.0,
            "replies": []
        },
        {
            "body": "Agreed. A good reminder since younger SBs seem to come predominantly from a sense of entitlement rather than a space of mutual respect. ",
            "author": "10WiseWords",
            "id": "ehadaqq",
            "parent_id": "t1_ehack89",
            "score": 4,
            "created_utc": 1551143495.0,
            "replies": [
                {
                    "body": "This comment was enough to make me fall in love with you...",
                    "author": null,
                    "id": "ehatmz9",
                    "parent_id": "t1_ehadaqq",
                    "score": 2,
                    "created_utc": 1551156031.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Thank you! I’m stoked. My first Gold. Party!!",
            "author": "10WiseWords",
            "id": "ehb2x1u",
            "parent_id": "t1_ehb2gru",
            "score": 2,
            "created_utc": 1551167212.0,
            "replies": []
        },
        {
            "body": "Thank you. This is so well said and BRAVO for it. Thanks for having my back, and for honoring the truth that women are stronger as a whole when we lift each other up. Advocates, not judges. I love it! ❤️❤️",
            "author": "10WiseWords",
            "id": "ehal2zq",
            "parent_id": "t1_ehake88",
            "score": 1,
            "created_utc": 1551149324.0,
            "replies": [
                {
                    "body": "Anytime sister! ☺️ Going out of the way to publicly cast judgement is just toxic, IMO. Hoping she (and all of us) can find the joy and strength in lifting each other up instead of separating and finding fault. ❤️",
                    "author": "shelbyscarlett",
                    "id": "ehaltlz",
                    "parent_id": "t1_ehal2zq",
                    "score": 2,
                    "created_utc": 1551149859.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Thank you! I’m glad you liked it!",
            "author": "10WiseWords",
            "id": "ehav4ru",
            "parent_id": "t1_ehatopx",
            "score": 1,
            "created_utc": 1551157435.0,
            "replies": []
        },
        {
            "body": "Sure!",
            "author": "10WiseWords",
            "id": "ehiilju",
            "parent_id": "t1_ehi8sd6",
            "score": 1,
            "created_utc": 1551396860.0,
            "replies": [
                {
                    "body": "How is the best way to go about getting paid? I've come across multiple people wanting to use my bank account, which I have denied. They are obviously scammers right? How can I find someone real that will set an arrangement so I can actually be paid. ",
                    "author": "SweetSolaGirl",
                    "id": "ehiu9kt",
                    "parent_id": "t1_ehiilju",
                    "score": 1,
                    "created_utc": 1551405587.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "My life has definitely been a lesson in keeping balance, that’s for sure. If you read that post in full you saw I was explaining a very difficult time in my life. I’ve recently survived betrayal, divorce, the loss of my career and and ongoing fight with the IRS for my ex’s poor choices and his creditors for check fraud. I’ve even survived cancer! I’ve had success as an SB, and those experiences make me a good example of resilience and determination. As always, I’m open and honest. Thank you for a chance to clarify and for your due diligence! If it was an attempt to discredit my advice here, I’m happy to have a chance to respond. ",
            "author": "10WiseWords",
            "id": "eh9vdqj",
            "parent_id": "t1_eh9td3h",
            "score": 10,
            "created_utc": 1551130155.0,
            "replies": [
                {
                    "body": "I am very proud of you!!!!!!!!! Great post but your wisdom, advice, determination and survival traits are incredible! Falling is not the issue, nor is getting up after a fall; it is what we do when we get up that matters most. You are an amazingly incredible person and again, I am very proud of you!!!!!!!!!\n\nFailure happens at the moment we assign it the merits of the best viable option, so glad you ignored that and persevered! :) It isn't the current worth, which holds value, it is value in character which dictates the future value in total assets accumulated. Already you have more than most so, ignore those who wish to discount you from a naive, present day, monetary level.",
                    "author": "AlmostFullyEvolved",
                    "id": "eh9xt2f",
                    "parent_id": "t1_eh9vdqj",
                    "score": 4,
                    "created_utc": 1551131763.0,
                    "replies": [
                        {
                            "body": "Awwwwww. Thank you. I appreciate you!!",
                            "author": "10WiseWords",
                            "id": "eh9xy10",
                            "parent_id": "t1_eh9xt2f",
                            "score": 5,
                            "created_utc": 1551131851.0,
                            "replies": [
                                {
                                    "body": "No need to thank me... I thank you for posting such a refreshing post! :) It is the positive attitude which increases success, unlike all of the frequent complaining, gender bashing and pouting posts.",
                                    "author": "AlmostFullyEvolved",
                                    "id": "eh9yr5s",
                                    "parent_id": "t1_eh9xy10",
                                    "score": 2,
                                    "created_utc": 1551132398.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Not discrediting. Pointing out inconsistency between last/this post. \n\n' My experiences have ranged from a paid platonic dinners for companionship, long term but sporadic meetings to accommodate business travel, long weekends away, to monthly allowances paid regardless of his ability to meet, to all monthly expenses paid and a generous clothing budget allowance.  '\n\nThat makes absolutely no sense given 12 days ago 26 to your name/no credit/no car/no job/drowning in medical debt/etc",
                    "author": "Kitoko30",
                    "id": "eh9yelm",
                    "parent_id": "t1_eh9vdqj",
                    "score": 0,
                    "created_utc": 1551132160.0,
                    "replies": [
                        {
                            "body": "So the assumption is that I always have an SD, just because I’ve had great arrangements in the past? That definitely makes you the ass here, as assumptions go. Of course I have a car and a job, since I’ve *survived* those setbacks. I was describing a heartbreaking time in my life, right after my divorce and cancer treatments. You like poking for a response and that makes you unwelcome on my thread.  You are officially becoming rude. And, since you offer no soul baring insights and only more criticism and contempt, you are exactly what ISN’T welcome here. Am I right, SLF??",
                            "author": "10WiseWords",
                            "id": "eh9ztpe",
                            "parent_id": "t1_eh9yelm",
                            "score": 8,
                            "created_utc": 1551133140.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "ehbmirv",
                                    "parent_id": "t1_eh9ztpe",
                                    "score": 4,
                                    "created_utc": 1551192691.0,
                                    "replies": [
                                        {
                                            "body": "And I’ve politely responded. Goad elsewhere. ",
                                            "author": "10WiseWords",
                                            "id": "ehcakuy",
                                            "parent_id": "t1_ehbmirv",
                                            "score": 1,
                                            "created_utc": 1551209790.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Oh piss off",
            "author": "cornycatlady",
            "id": "eh9v8dj",
            "parent_id": "t1_eh9td3h",
            "score": 0,
            "created_utc": 1551130057.0,
            "replies": [
                {
                    "body": "Being financially destitute is not one of the pillars of success for any sb",
                    "author": "Kitoko30",
                    "id": "eh9wpd1",
                    "parent_id": "t1_eh9v8dj",
                    "score": -2,
                    "created_utc": 1551131030.0,
                    "replies": [
                        {
                            "body": "It is amazing how you we can all read the same thing and how little you actually got from it. I guess you missed the part where she wrote: **\"Compartmentalize your** ***value*** **and never mistake it for your** ***worth*****.** Shame, as you seem to be focused on her net worth and completely missed her vast wealth.\n\nSeems some splenda daddy's have a need to make themselves feel better by attacking the SBs income, as a means of making themselves feel better, while missing the fact that it only makes them look like a total ass. I have found those who look down on others, because of their present day financials are, most commonly, rather financially restricted themselves. Speaking for myself only: I sometimes feel guilty about my wealth and feel a need to bring others up or secretly contribute towards their potential. (Investing in people is far more liberating than destroying, or unjustifiably humiliating them, in front of others) What I don't ever do is; mimic your terrible attempt at humiliating a person, who also has an enormous amount of drive and potential.\n\nOne day soon, her financial wealth will, mostly likely, surpass yours; as her value portrayed here, already has...",
                            "author": "AlmostFullyEvolved",
                            "id": "eha03ez",
                            "parent_id": "t1_eh9wpd1",
                            "score": 8,
                            "created_utc": 1551133325.0,
                            "replies": [
                                {
                                    "body": "I'm female. \n\nMy comments are specific to her literal ' panic everyday about food/gas ' whilst offering advice on facilitating SRs/her extensive success as SB. \n\n",
                                    "author": "Kitoko30",
                                    "id": "eha1s2s",
                                    "parent_id": "t1_eha03ez",
                                    "score": 4,
                                    "created_utc": 1551134528.0,
                                    "replies": [
                                        {
                                            "body": "Knowing (now)  that you’re female makes your comments far more understandable. I shared heartbreak in one post and solid advice from success in another. Perhaps changing your focus away from constantly throwing shade on other women is a good goal for you. I’m certain it will make you more attractive to both sexes. ",
                                            "author": "10WiseWords",
                                            "id": "eha3jvv",
                                            "parent_id": "t1_eha1s2s",
                                            "score": 4,
                                            "created_utc": 1551135813.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Luckily, times do change quickly. Especially when one is smart and beautiful! ",
                            "author": "10WiseWords",
                            "id": "eh9wyw1",
                            "parent_id": "t1_eh9wpd1",
                            "score": 1,
                            "created_utc": 1551131208.0,
                            "replies": []
                        },
                        {
                            "body": "She did not mention that anywhere in her post???",
                            "author": "cornycatlady",
                            "id": "eh9wtwc",
                            "parent_id": "t1_eh9wpd1",
                            "score": -1,
                            "created_utc": 1551131115.0,
                            "replies": [
                                {
                                    "body": "It’s in a previous post. What can I say? If you dig, you end up with dirt...my dirt is just easier to find. I don’t hide it. I never dreamed it would be used as ammunition, but it’s no less authentic. It’s ALL part of my story. ",
                                    "author": "10WiseWords",
                                    "id": "eha40bu",
                                    "parent_id": "t1_eh9wtwc",
                                    "score": 7,
                                    "created_utc": 1551136156.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I’m a photographer. I don’t call it photoshopping to adjust light, color balance, or do minor retouching like removing a few blemishes or brightening teeth. I don’t even do that in Photoshop, I use Lightroom. That’s just finishing the photo in post, it’s standard work flow. I’d never give a client a raw photo.\n\nActual photoshopping done in Photoshop would be where I’d fix things like under-eye circles, sun damage, cellulite and wrinkles, drastically uneven skin tones, scars, “contouring”, and Frankenstein body parts together if necessary. That’s gonna cost extra. But it’s also seriously overboard for most people, unless they’re going in a magazine of course. \n\nTo be honest, a good photographer can make someone look 10x better than they do in real life without spending a single minute in Photoshop. Lens choice, aperture, lighting, angles, setting, makeup, clothing, eliciting certain expressions, moods, and poses. Those things are so much more important than photoshopping. THAT is why you hire a photographer. Otherwise any idiot with an Adobe account can make your pores and wrinkles disappear from your phone selfies. They’re not comparable :)\n\nTl;dr People hire photographers to get professional photos, not to get photoshopped photos",
            "author": "freyjacalifornia",
            "id": "ehb9g15",
            "parent_id": "t1_eh9tagn",
            "score": 6,
            "created_utc": 1551178356.0,
            "replies": []
        },
        {
            "body": "I actually have them because I’ve done a bit of  lingerie modeling. I just put it out there as what works for me. Absolutely a friend with a great camera can take awesome pictures as well. And I don’t consider it photoshopped to brighten up the lighting or do some cropping, I advertise if my body is as you can see it in real life. Also have photos I like very much I’ve taken with my phone, so my profile mixes both. Thank you for the question! ",
            "author": "10WiseWords",
            "id": "eh9uut0",
            "parent_id": "t1_eh9tagn",
            "score": 3,
            "created_utc": 1551129810.0,
            "replies": [
                {
                    "body": "It definitely IS still photoshopping to adjust lighting and small details and such. Most professionally done photos will have some level of skin retouching as well. Small things like removing blemishes or taking away a stray hair that’s falling across your cheek, or removing a bit of stubble/razor burn. (Unless you specifically request they not do that, and some don’t want their work shown unless it’s polished to their usual degree of quality)\n\nI know you mean it colloquially, as in they didn’t morph your body into something it isn’t, but people need to stop using incorrect terminology for this because it just gives cranky dudes ammo. If they see a perfectly manicured photo, and the subject says it isn’t photoshopped, then that’s one more unrealistic standard that they’ll use to prop up arguments. \n\n",
                    "author": "oh_come_on_eileen",
                    "id": "eha1ct9",
                    "parent_id": "t1_eh9uut0",
                    "score": -2,
                    "created_utc": 1551134221.0,
                    "replies": [
                        {
                            "body": "Hmmm. An interesting point. Thank you for the insight. Although I don’t post the finished/edited photos to SA (legally they don’t belong to me once they are sold and published elsewhere) I can see your point. I actually prefer the untouched photos, so those are the ones I share. I think, though, that my photos are a nice mix of casual photos and those that show my full body. ",
                            "author": "10WiseWords",
                            "id": "eha2soh",
                            "parent_id": "t1_eha1ct9",
                            "score": 2,
                            "created_utc": 1551135262.0,
                            "replies": []
                        },
                        {
                            "body": "Retouching in the ways that you mention is not what I consider photoshopping. Suggesting that spending three minutes removing blemishes and adjusting light/color balance is “photoshopping” is just silly. Cranky dudes can have all the ammo they want. I’ll even Photoshop some into their photos if they’d like :)",
                            "author": "freyjacalifornia",
                            "id": "ehb9r6f",
                            "parent_id": "t1_eha1ct9",
                            "score": 1,
                            "created_utc": 1551178857.0,
                            "replies": [
                                {
                                    "body": "That’s literally photoshopping though? It’s not even just cranky dudes, it’s using the term wrong. There needs to be a clearer distinction between photoshopped and unretouched work, and if people are demanding it of companies that use photos to advertise their products, we should be able to expect the same honesty as well when people say they haven’t photoshopped something. \n\nLike it isn’t even necessary to mention in most cases, and if you’re gonna say ‘not photoshopped’ it needs to not be, and if it is, just say ‘light photo editing’ or ‘light retouching’.\n\nIf it’s enough of an issue that you need to mention it and want to make a clear stand on the topic, have a disclaimer on photos saying ‘no modification of my body is done during photo editing, only lighting and color adjustments have been made’. Otherwise saying ‘my pics aren’t photoshopped’ is disingenuous. ",
                                    "author": "oh_come_on_eileen",
                                    "id": "ehcd13s",
                                    "parent_id": "t1_ehb9r6f",
                                    "score": 2,
                                    "created_utc": 1551211449.0,
                                    "replies": [
                                        {
                                            "body": "I mean... it’s actually not literally photoshopping. I’m a photographer. I don’t even use Photoshop to do “light retouching”. I use Lightroom. If you’d like to get that pedantic about it, shall we verbify lightrooming? \n\nI consider photoshopping to be making material changes to the subject of the image that could not have been done with different lighting conditions or makeup when the photo was taken. Covering up a zit or lightening the exposure around the face is just not photoshopping.",
                                            "author": "freyjacalifornia",
                                            "id": "ehcgks7",
                                            "parent_id": "t1_ehcd13s",
                                            "score": 1,
                                            "created_utc": 1551213810.0,
                                            "replies": [
                                                {
                                                    "body": "I’m not the one who decides what colloquialisms mean. If you wanna try to make lightrooming happen then go for it. \n\nI’m being ‘pedantic’ because there are enough accusations of disingenuous behavior in this lifestyle and for women in general, so using definitive language is important.\n\nI do think the proliferation of unretouched bodies in photos is important. I wholly encourage people to do that. But again, to some people, ‘not photoshopped’ is being used as ‘all stretch marks and acne are gone, and very natural looking edits like mild teeth whitening or removing stray hairs are done’ (as opposed to warping or facetuning the body/face) rather than truly not being retouched at all, so people need to be clear when they’re making statements about it.\n\nAgain, it’s a thing where you don’t HAVE to say anything about it, but if you feel strongly enough to do so, I believe it’s important to be clear and honest. ",
                                                    "author": "oh_come_on_eileen",
                                                    "id": "ehfr5ja",
                                                    "parent_id": "t1_ehcgks7",
                                                    "score": 1,
                                                    "created_utc": 1551311821.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Is this an assumption about me from my post, or advice offered to me, or just a random bit of advice? (As an aside, Technically we are all born with nothing, and die the same way, right?) r/showerthoughts",
            "author": "10WiseWords",
            "id": "ehauz4g",
            "parent_id": "t1_ehauh38",
            "score": 1,
            "created_utc": 1551157285.0,
            "replies": []
        },
        {
            "body": "I was! Are you assuming all SBs are early 20s?",
            "author": "10WiseWords",
            "id": "eh9zxoe",
            "parent_id": "t1_eh9ysez",
            "score": 7,
            "created_utc": 1551133216.0,
            "replies": [
                {
                    "body": "No it’s not about age, I was just saying you don’t really know the game since you were married the last 17 years. \n\n",
                    "author": null,
                    "id": "eha2sgi",
                    "parent_id": "t1_eh9zxoe",
                    "score": -3,
                    "created_utc": 1551135257.0,
                    "replies": [
                        {
                            "body": "Again, an assumption. Wow! I’ve been separated and divorced over 3 years. I’ve had multiple interactions, multiple (and varied) arrangements, and exchanged several hundred messages. So, I can offer some insight from life and my experiences in this lifestyle. Take it or leave it. Frankly, my experience as a longtime wife makes me a capable and intelligent mistress. Shocking, huh?",
                            "author": "10WiseWords",
                            "id": "eha9kmm",
                            "parent_id": "t1_eha2sgi",
                            "score": 7,
                            "created_utc": 1551140514.0,
                            "replies": [
                                {
                                    "body": "If you have 3 years, then I made the wrong assumptions. Sorry if it came out as if I was questioning your credibility. ",
                                    "author": null,
                                    "id": "ehbb5q9",
                                    "parent_id": "t1_eha9kmm",
                                    "score": 1,
                                    "created_utc": 1551181062.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "That made me laugh, spank bank!",
            "author": "PassionSense",
            "id": "eha0wez",
            "parent_id": "t1_eh9v5n0",
            "score": 6,
            "created_utc": 1551133895.0,
            "replies": []
        },
        {
            "body": "This comment was enough to make me fall in love with you...",
            "author": null,
            "id": "ehatmz9",
            "parent_id": "t1_ehadaqq",
            "score": 2,
            "created_utc": 1551156031.0,
            "replies": []
        },
        {
            "body": "Anytime sister! ☺️ Going out of the way to publicly cast judgement is just toxic, IMO. Hoping she (and all of us) can find the joy and strength in lifting each other up instead of separating and finding fault. ❤️",
            "author": "shelbyscarlett",
            "id": "ehaltlz",
            "parent_id": "t1_ehal2zq",
            "score": 2,
            "created_utc": 1551149859.0,
            "replies": []
        },
        {
            "body": "How is the best way to go about getting paid? I've come across multiple people wanting to use my bank account, which I have denied. They are obviously scammers right? How can I find someone real that will set an arrangement so I can actually be paid. ",
            "author": "SweetSolaGirl",
            "id": "ehiu9kt",
            "parent_id": "t1_ehiilju",
            "score": 1,
            "created_utc": 1551405587.0,
            "replies": []
        },
        {
            "body": "I am very proud of you!!!!!!!!! Great post but your wisdom, advice, determination and survival traits are incredible! Falling is not the issue, nor is getting up after a fall; it is what we do when we get up that matters most. You are an amazingly incredible person and again, I am very proud of you!!!!!!!!!\n\nFailure happens at the moment we assign it the merits of the best viable option, so glad you ignored that and persevered! :) It isn't the current worth, which holds value, it is value in character which dictates the future value in total assets accumulated. Already you have more than most so, ignore those who wish to discount you from a naive, present day, monetary level.",
            "author": "AlmostFullyEvolved",
            "id": "eh9xt2f",
            "parent_id": "t1_eh9vdqj",
            "score": 4,
            "created_utc": 1551131763.0,
            "replies": [
                {
                    "body": "Awwwwww. Thank you. I appreciate you!!",
                    "author": "10WiseWords",
                    "id": "eh9xy10",
                    "parent_id": "t1_eh9xt2f",
                    "score": 5,
                    "created_utc": 1551131851.0,
                    "replies": [
                        {
                            "body": "No need to thank me... I thank you for posting such a refreshing post! :) It is the positive attitude which increases success, unlike all of the frequent complaining, gender bashing and pouting posts.",
                            "author": "AlmostFullyEvolved",
                            "id": "eh9yr5s",
                            "parent_id": "t1_eh9xy10",
                            "score": 2,
                            "created_utc": 1551132398.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Not discrediting. Pointing out inconsistency between last/this post. \n\n' My experiences have ranged from a paid platonic dinners for companionship, long term but sporadic meetings to accommodate business travel, long weekends away, to monthly allowances paid regardless of his ability to meet, to all monthly expenses paid and a generous clothing budget allowance.  '\n\nThat makes absolutely no sense given 12 days ago 26 to your name/no credit/no car/no job/drowning in medical debt/etc",
            "author": "Kitoko30",
            "id": "eh9yelm",
            "parent_id": "t1_eh9vdqj",
            "score": 0,
            "created_utc": 1551132160.0,
            "replies": [
                {
                    "body": "So the assumption is that I always have an SD, just because I’ve had great arrangements in the past? That definitely makes you the ass here, as assumptions go. Of course I have a car and a job, since I’ve *survived* those setbacks. I was describing a heartbreaking time in my life, right after my divorce and cancer treatments. You like poking for a response and that makes you unwelcome on my thread.  You are officially becoming rude. And, since you offer no soul baring insights and only more criticism and contempt, you are exactly what ISN’T welcome here. Am I right, SLF??",
                    "author": "10WiseWords",
                    "id": "eh9ztpe",
                    "parent_id": "t1_eh9yelm",
                    "score": 8,
                    "created_utc": 1551133140.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "ehbmirv",
                            "parent_id": "t1_eh9ztpe",
                            "score": 4,
                            "created_utc": 1551192691.0,
                            "replies": [
                                {
                                    "body": "And I’ve politely responded. Goad elsewhere. ",
                                    "author": "10WiseWords",
                                    "id": "ehcakuy",
                                    "parent_id": "t1_ehbmirv",
                                    "score": 1,
                                    "created_utc": 1551209790.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Being financially destitute is not one of the pillars of success for any sb",
            "author": "Kitoko30",
            "id": "eh9wpd1",
            "parent_id": "t1_eh9v8dj",
            "score": -2,
            "created_utc": 1551131030.0,
            "replies": [
                {
                    "body": "It is amazing how you we can all read the same thing and how little you actually got from it. I guess you missed the part where she wrote: **\"Compartmentalize your** ***value*** **and never mistake it for your** ***worth*****.** Shame, as you seem to be focused on her net worth and completely missed her vast wealth.\n\nSeems some splenda daddy's have a need to make themselves feel better by attacking the SBs income, as a means of making themselves feel better, while missing the fact that it only makes them look like a total ass. I have found those who look down on others, because of their present day financials are, most commonly, rather financially restricted themselves. Speaking for myself only: I sometimes feel guilty about my wealth and feel a need to bring others up or secretly contribute towards their potential. (Investing in people is far more liberating than destroying, or unjustifiably humiliating them, in front of others) What I don't ever do is; mimic your terrible attempt at humiliating a person, who also has an enormous amount of drive and potential.\n\nOne day soon, her financial wealth will, mostly likely, surpass yours; as her value portrayed here, already has...",
                    "author": "AlmostFullyEvolved",
                    "id": "eha03ez",
                    "parent_id": "t1_eh9wpd1",
                    "score": 8,
                    "created_utc": 1551133325.0,
                    "replies": [
                        {
                            "body": "I'm female. \n\nMy comments are specific to her literal ' panic everyday about food/gas ' whilst offering advice on facilitating SRs/her extensive success as SB. \n\n",
                            "author": "Kitoko30",
                            "id": "eha1s2s",
                            "parent_id": "t1_eha03ez",
                            "score": 4,
                            "created_utc": 1551134528.0,
                            "replies": [
                                {
                                    "body": "Knowing (now)  that you’re female makes your comments far more understandable. I shared heartbreak in one post and solid advice from success in another. Perhaps changing your focus away from constantly throwing shade on other women is a good goal for you. I’m certain it will make you more attractive to both sexes. ",
                                    "author": "10WiseWords",
                                    "id": "eha3jvv",
                                    "parent_id": "t1_eha1s2s",
                                    "score": 4,
                                    "created_utc": 1551135813.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Luckily, times do change quickly. Especially when one is smart and beautiful! ",
                    "author": "10WiseWords",
                    "id": "eh9wyw1",
                    "parent_id": "t1_eh9wpd1",
                    "score": 1,
                    "created_utc": 1551131208.0,
                    "replies": []
                },
                {
                    "body": "She did not mention that anywhere in her post???",
                    "author": "cornycatlady",
                    "id": "eh9wtwc",
                    "parent_id": "t1_eh9wpd1",
                    "score": -1,
                    "created_utc": 1551131115.0,
                    "replies": [
                        {
                            "body": "It’s in a previous post. What can I say? If you dig, you end up with dirt...my dirt is just easier to find. I don’t hide it. I never dreamed it would be used as ammunition, but it’s no less authentic. It’s ALL part of my story. ",
                            "author": "10WiseWords",
                            "id": "eha40bu",
                            "parent_id": "t1_eh9wtwc",
                            "score": 7,
                            "created_utc": 1551136156.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "It definitely IS still photoshopping to adjust lighting and small details and such. Most professionally done photos will have some level of skin retouching as well. Small things like removing blemishes or taking away a stray hair that’s falling across your cheek, or removing a bit of stubble/razor burn. (Unless you specifically request they not do that, and some don’t want their work shown unless it’s polished to their usual degree of quality)\n\nI know you mean it colloquially, as in they didn’t morph your body into something it isn’t, but people need to stop using incorrect terminology for this because it just gives cranky dudes ammo. If they see a perfectly manicured photo, and the subject says it isn’t photoshopped, then that’s one more unrealistic standard that they’ll use to prop up arguments. \n\n",
            "author": "oh_come_on_eileen",
            "id": "eha1ct9",
            "parent_id": "t1_eh9uut0",
            "score": -2,
            "created_utc": 1551134221.0,
            "replies": [
                {
                    "body": "Hmmm. An interesting point. Thank you for the insight. Although I don’t post the finished/edited photos to SA (legally they don’t belong to me once they are sold and published elsewhere) I can see your point. I actually prefer the untouched photos, so those are the ones I share. I think, though, that my photos are a nice mix of casual photos and those that show my full body. ",
                    "author": "10WiseWords",
                    "id": "eha2soh",
                    "parent_id": "t1_eha1ct9",
                    "score": 2,
                    "created_utc": 1551135262.0,
                    "replies": []
                },
                {
                    "body": "Retouching in the ways that you mention is not what I consider photoshopping. Suggesting that spending three minutes removing blemishes and adjusting light/color balance is “photoshopping” is just silly. Cranky dudes can have all the ammo they want. I’ll even Photoshop some into their photos if they’d like :)",
                    "author": "freyjacalifornia",
                    "id": "ehb9r6f",
                    "parent_id": "t1_eha1ct9",
                    "score": 1,
                    "created_utc": 1551178857.0,
                    "replies": [
                        {
                            "body": "That’s literally photoshopping though? It’s not even just cranky dudes, it’s using the term wrong. There needs to be a clearer distinction between photoshopped and unretouched work, and if people are demanding it of companies that use photos to advertise their products, we should be able to expect the same honesty as well when people say they haven’t photoshopped something. \n\nLike it isn’t even necessary to mention in most cases, and if you’re gonna say ‘not photoshopped’ it needs to not be, and if it is, just say ‘light photo editing’ or ‘light retouching’.\n\nIf it’s enough of an issue that you need to mention it and want to make a clear stand on the topic, have a disclaimer on photos saying ‘no modification of my body is done during photo editing, only lighting and color adjustments have been made’. Otherwise saying ‘my pics aren’t photoshopped’ is disingenuous. ",
                            "author": "oh_come_on_eileen",
                            "id": "ehcd13s",
                            "parent_id": "t1_ehb9r6f",
                            "score": 2,
                            "created_utc": 1551211449.0,
                            "replies": [
                                {
                                    "body": "I mean... it’s actually not literally photoshopping. I’m a photographer. I don’t even use Photoshop to do “light retouching”. I use Lightroom. If you’d like to get that pedantic about it, shall we verbify lightrooming? \n\nI consider photoshopping to be making material changes to the subject of the image that could not have been done with different lighting conditions or makeup when the photo was taken. Covering up a zit or lightening the exposure around the face is just not photoshopping.",
                                    "author": "freyjacalifornia",
                                    "id": "ehcgks7",
                                    "parent_id": "t1_ehcd13s",
                                    "score": 1,
                                    "created_utc": 1551213810.0,
                                    "replies": [
                                        {
                                            "body": "I’m not the one who decides what colloquialisms mean. If you wanna try to make lightrooming happen then go for it. \n\nI’m being ‘pedantic’ because there are enough accusations of disingenuous behavior in this lifestyle and for women in general, so using definitive language is important.\n\nI do think the proliferation of unretouched bodies in photos is important. I wholly encourage people to do that. But again, to some people, ‘not photoshopped’ is being used as ‘all stretch marks and acne are gone, and very natural looking edits like mild teeth whitening or removing stray hairs are done’ (as opposed to warping or facetuning the body/face) rather than truly not being retouched at all, so people need to be clear when they’re making statements about it.\n\nAgain, it’s a thing where you don’t HAVE to say anything about it, but if you feel strongly enough to do so, I believe it’s important to be clear and honest. ",
                                            "author": "oh_come_on_eileen",
                                            "id": "ehfr5ja",
                                            "parent_id": "t1_ehcgks7",
                                            "score": 1,
                                            "created_utc": 1551311821.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "No it’s not about age, I was just saying you don’t really know the game since you were married the last 17 years. \n\n",
            "author": null,
            "id": "eha2sgi",
            "parent_id": "t1_eh9zxoe",
            "score": -3,
            "created_utc": 1551135257.0,
            "replies": [
                {
                    "body": "Again, an assumption. Wow! I’ve been separated and divorced over 3 years. I’ve had multiple interactions, multiple (and varied) arrangements, and exchanged several hundred messages. So, I can offer some insight from life and my experiences in this lifestyle. Take it or leave it. Frankly, my experience as a longtime wife makes me a capable and intelligent mistress. Shocking, huh?",
                    "author": "10WiseWords",
                    "id": "eha9kmm",
                    "parent_id": "t1_eha2sgi",
                    "score": 7,
                    "created_utc": 1551140514.0,
                    "replies": [
                        {
                            "body": "If you have 3 years, then I made the wrong assumptions. Sorry if it came out as if I was questioning your credibility. ",
                            "author": null,
                            "id": "ehbb5q9",
                            "parent_id": "t1_eha9kmm",
                            "score": 1,
                            "created_utc": 1551181062.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Awwwwww. Thank you. I appreciate you!!",
            "author": "10WiseWords",
            "id": "eh9xy10",
            "parent_id": "t1_eh9xt2f",
            "score": 5,
            "created_utc": 1551131851.0,
            "replies": [
                {
                    "body": "No need to thank me... I thank you for posting such a refreshing post! :) It is the positive attitude which increases success, unlike all of the frequent complaining, gender bashing and pouting posts.",
                    "author": "AlmostFullyEvolved",
                    "id": "eh9yr5s",
                    "parent_id": "t1_eh9xy10",
                    "score": 2,
                    "created_utc": 1551132398.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "So the assumption is that I always have an SD, just because I’ve had great arrangements in the past? That definitely makes you the ass here, as assumptions go. Of course I have a car and a job, since I’ve *survived* those setbacks. I was describing a heartbreaking time in my life, right after my divorce and cancer treatments. You like poking for a response and that makes you unwelcome on my thread.  You are officially becoming rude. And, since you offer no soul baring insights and only more criticism and contempt, you are exactly what ISN’T welcome here. Am I right, SLF??",
            "author": "10WiseWords",
            "id": "eh9ztpe",
            "parent_id": "t1_eh9yelm",
            "score": 8,
            "created_utc": 1551133140.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "ehbmirv",
                    "parent_id": "t1_eh9ztpe",
                    "score": 4,
                    "created_utc": 1551192691.0,
                    "replies": [
                        {
                            "body": "And I’ve politely responded. Goad elsewhere. ",
                            "author": "10WiseWords",
                            "id": "ehcakuy",
                            "parent_id": "t1_ehbmirv",
                            "score": 1,
                            "created_utc": 1551209790.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "It is amazing how you we can all read the same thing and how little you actually got from it. I guess you missed the part where she wrote: **\"Compartmentalize your** ***value*** **and never mistake it for your** ***worth*****.** Shame, as you seem to be focused on her net worth and completely missed her vast wealth.\n\nSeems some splenda daddy's have a need to make themselves feel better by attacking the SBs income, as a means of making themselves feel better, while missing the fact that it only makes them look like a total ass. I have found those who look down on others, because of their present day financials are, most commonly, rather financially restricted themselves. Speaking for myself only: I sometimes feel guilty about my wealth and feel a need to bring others up or secretly contribute towards their potential. (Investing in people is far more liberating than destroying, or unjustifiably humiliating them, in front of others) What I don't ever do is; mimic your terrible attempt at humiliating a person, who also has an enormous amount of drive and potential.\n\nOne day soon, her financial wealth will, mostly likely, surpass yours; as her value portrayed here, already has...",
            "author": "AlmostFullyEvolved",
            "id": "eha03ez",
            "parent_id": "t1_eh9wpd1",
            "score": 8,
            "created_utc": 1551133325.0,
            "replies": [
                {
                    "body": "I'm female. \n\nMy comments are specific to her literal ' panic everyday about food/gas ' whilst offering advice on facilitating SRs/her extensive success as SB. \n\n",
                    "author": "Kitoko30",
                    "id": "eha1s2s",
                    "parent_id": "t1_eha03ez",
                    "score": 4,
                    "created_utc": 1551134528.0,
                    "replies": [
                        {
                            "body": "Knowing (now)  that you’re female makes your comments far more understandable. I shared heartbreak in one post and solid advice from success in another. Perhaps changing your focus away from constantly throwing shade on other women is a good goal for you. I’m certain it will make you more attractive to both sexes. ",
                            "author": "10WiseWords",
                            "id": "eha3jvv",
                            "parent_id": "t1_eha1s2s",
                            "score": 4,
                            "created_utc": 1551135813.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Luckily, times do change quickly. Especially when one is smart and beautiful! ",
            "author": "10WiseWords",
            "id": "eh9wyw1",
            "parent_id": "t1_eh9wpd1",
            "score": 1,
            "created_utc": 1551131208.0,
            "replies": []
        },
        {
            "body": "She did not mention that anywhere in her post???",
            "author": "cornycatlady",
            "id": "eh9wtwc",
            "parent_id": "t1_eh9wpd1",
            "score": -1,
            "created_utc": 1551131115.0,
            "replies": [
                {
                    "body": "It’s in a previous post. What can I say? If you dig, you end up with dirt...my dirt is just easier to find. I don’t hide it. I never dreamed it would be used as ammunition, but it’s no less authentic. It’s ALL part of my story. ",
                    "author": "10WiseWords",
                    "id": "eha40bu",
                    "parent_id": "t1_eh9wtwc",
                    "score": 7,
                    "created_utc": 1551136156.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Hmmm. An interesting point. Thank you for the insight. Although I don’t post the finished/edited photos to SA (legally they don’t belong to me once they are sold and published elsewhere) I can see your point. I actually prefer the untouched photos, so those are the ones I share. I think, though, that my photos are a nice mix of casual photos and those that show my full body. ",
            "author": "10WiseWords",
            "id": "eha2soh",
            "parent_id": "t1_eha1ct9",
            "score": 2,
            "created_utc": 1551135262.0,
            "replies": []
        },
        {
            "body": "Retouching in the ways that you mention is not what I consider photoshopping. Suggesting that spending three minutes removing blemishes and adjusting light/color balance is “photoshopping” is just silly. Cranky dudes can have all the ammo they want. I’ll even Photoshop some into their photos if they’d like :)",
            "author": "freyjacalifornia",
            "id": "ehb9r6f",
            "parent_id": "t1_eha1ct9",
            "score": 1,
            "created_utc": 1551178857.0,
            "replies": [
                {
                    "body": "That’s literally photoshopping though? It’s not even just cranky dudes, it’s using the term wrong. There needs to be a clearer distinction between photoshopped and unretouched work, and if people are demanding it of companies that use photos to advertise their products, we should be able to expect the same honesty as well when people say they haven’t photoshopped something. \n\nLike it isn’t even necessary to mention in most cases, and if you’re gonna say ‘not photoshopped’ it needs to not be, and if it is, just say ‘light photo editing’ or ‘light retouching’.\n\nIf it’s enough of an issue that you need to mention it and want to make a clear stand on the topic, have a disclaimer on photos saying ‘no modification of my body is done during photo editing, only lighting and color adjustments have been made’. Otherwise saying ‘my pics aren’t photoshopped’ is disingenuous. ",
                    "author": "oh_come_on_eileen",
                    "id": "ehcd13s",
                    "parent_id": "t1_ehb9r6f",
                    "score": 2,
                    "created_utc": 1551211449.0,
                    "replies": [
                        {
                            "body": "I mean... it’s actually not literally photoshopping. I’m a photographer. I don’t even use Photoshop to do “light retouching”. I use Lightroom. If you’d like to get that pedantic about it, shall we verbify lightrooming? \n\nI consider photoshopping to be making material changes to the subject of the image that could not have been done with different lighting conditions or makeup when the photo was taken. Covering up a zit or lightening the exposure around the face is just not photoshopping.",
                            "author": "freyjacalifornia",
                            "id": "ehcgks7",
                            "parent_id": "t1_ehcd13s",
                            "score": 1,
                            "created_utc": 1551213810.0,
                            "replies": [
                                {
                                    "body": "I’m not the one who decides what colloquialisms mean. If you wanna try to make lightrooming happen then go for it. \n\nI’m being ‘pedantic’ because there are enough accusations of disingenuous behavior in this lifestyle and for women in general, so using definitive language is important.\n\nI do think the proliferation of unretouched bodies in photos is important. I wholly encourage people to do that. But again, to some people, ‘not photoshopped’ is being used as ‘all stretch marks and acne are gone, and very natural looking edits like mild teeth whitening or removing stray hairs are done’ (as opposed to warping or facetuning the body/face) rather than truly not being retouched at all, so people need to be clear when they’re making statements about it.\n\nAgain, it’s a thing where you don’t HAVE to say anything about it, but if you feel strongly enough to do so, I believe it’s important to be clear and honest. ",
                                    "author": "oh_come_on_eileen",
                                    "id": "ehfr5ja",
                                    "parent_id": "t1_ehcgks7",
                                    "score": 1,
                                    "created_utc": 1551311821.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Again, an assumption. Wow! I’ve been separated and divorced over 3 years. I’ve had multiple interactions, multiple (and varied) arrangements, and exchanged several hundred messages. So, I can offer some insight from life and my experiences in this lifestyle. Take it or leave it. Frankly, my experience as a longtime wife makes me a capable and intelligent mistress. Shocking, huh?",
            "author": "10WiseWords",
            "id": "eha9kmm",
            "parent_id": "t1_eha2sgi",
            "score": 7,
            "created_utc": 1551140514.0,
            "replies": [
                {
                    "body": "If you have 3 years, then I made the wrong assumptions. Sorry if it came out as if I was questioning your credibility. ",
                    "author": null,
                    "id": "ehbb5q9",
                    "parent_id": "t1_eha9kmm",
                    "score": 1,
                    "created_utc": 1551181062.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "No need to thank me... I thank you for posting such a refreshing post! :) It is the positive attitude which increases success, unlike all of the frequent complaining, gender bashing and pouting posts.",
            "author": "AlmostFullyEvolved",
            "id": "eh9yr5s",
            "parent_id": "t1_eh9xy10",
            "score": 2,
            "created_utc": 1551132398.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "ehbmirv",
            "parent_id": "t1_eh9ztpe",
            "score": 4,
            "created_utc": 1551192691.0,
            "replies": [
                {
                    "body": "And I’ve politely responded. Goad elsewhere. ",
                    "author": "10WiseWords",
                    "id": "ehcakuy",
                    "parent_id": "t1_ehbmirv",
                    "score": 1,
                    "created_utc": 1551209790.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I'm female. \n\nMy comments are specific to her literal ' panic everyday about food/gas ' whilst offering advice on facilitating SRs/her extensive success as SB. \n\n",
            "author": "Kitoko30",
            "id": "eha1s2s",
            "parent_id": "t1_eha03ez",
            "score": 4,
            "created_utc": 1551134528.0,
            "replies": [
                {
                    "body": "Knowing (now)  that you’re female makes your comments far more understandable. I shared heartbreak in one post and solid advice from success in another. Perhaps changing your focus away from constantly throwing shade on other women is a good goal for you. I’m certain it will make you more attractive to both sexes. ",
                    "author": "10WiseWords",
                    "id": "eha3jvv",
                    "parent_id": "t1_eha1s2s",
                    "score": 4,
                    "created_utc": 1551135813.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "It’s in a previous post. What can I say? If you dig, you end up with dirt...my dirt is just easier to find. I don’t hide it. I never dreamed it would be used as ammunition, but it’s no less authentic. It’s ALL part of my story. ",
            "author": "10WiseWords",
            "id": "eha40bu",
            "parent_id": "t1_eh9wtwc",
            "score": 7,
            "created_utc": 1551136156.0,
            "replies": []
        },
        {
            "body": "That’s literally photoshopping though? It’s not even just cranky dudes, it’s using the term wrong. There needs to be a clearer distinction between photoshopped and unretouched work, and if people are demanding it of companies that use photos to advertise their products, we should be able to expect the same honesty as well when people say they haven’t photoshopped something. \n\nLike it isn’t even necessary to mention in most cases, and if you’re gonna say ‘not photoshopped’ it needs to not be, and if it is, just say ‘light photo editing’ or ‘light retouching’.\n\nIf it’s enough of an issue that you need to mention it and want to make a clear stand on the topic, have a disclaimer on photos saying ‘no modification of my body is done during photo editing, only lighting and color adjustments have been made’. Otherwise saying ‘my pics aren’t photoshopped’ is disingenuous. ",
            "author": "oh_come_on_eileen",
            "id": "ehcd13s",
            "parent_id": "t1_ehb9r6f",
            "score": 2,
            "created_utc": 1551211449.0,
            "replies": [
                {
                    "body": "I mean... it’s actually not literally photoshopping. I’m a photographer. I don’t even use Photoshop to do “light retouching”. I use Lightroom. If you’d like to get that pedantic about it, shall we verbify lightrooming? \n\nI consider photoshopping to be making material changes to the subject of the image that could not have been done with different lighting conditions or makeup when the photo was taken. Covering up a zit or lightening the exposure around the face is just not photoshopping.",
                    "author": "freyjacalifornia",
                    "id": "ehcgks7",
                    "parent_id": "t1_ehcd13s",
                    "score": 1,
                    "created_utc": 1551213810.0,
                    "replies": [
                        {
                            "body": "I’m not the one who decides what colloquialisms mean. If you wanna try to make lightrooming happen then go for it. \n\nI’m being ‘pedantic’ because there are enough accusations of disingenuous behavior in this lifestyle and for women in general, so using definitive language is important.\n\nI do think the proliferation of unretouched bodies in photos is important. I wholly encourage people to do that. But again, to some people, ‘not photoshopped’ is being used as ‘all stretch marks and acne are gone, and very natural looking edits like mild teeth whitening or removing stray hairs are done’ (as opposed to warping or facetuning the body/face) rather than truly not being retouched at all, so people need to be clear when they’re making statements about it.\n\nAgain, it’s a thing where you don’t HAVE to say anything about it, but if you feel strongly enough to do so, I believe it’s important to be clear and honest. ",
                            "author": "oh_come_on_eileen",
                            "id": "ehfr5ja",
                            "parent_id": "t1_ehcgks7",
                            "score": 1,
                            "created_utc": 1551311821.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "If you have 3 years, then I made the wrong assumptions. Sorry if it came out as if I was questioning your credibility. ",
            "author": null,
            "id": "ehbb5q9",
            "parent_id": "t1_eha9kmm",
            "score": 1,
            "created_utc": 1551181062.0,
            "replies": []
        },
        {
            "body": "And I’ve politely responded. Goad elsewhere. ",
            "author": "10WiseWords",
            "id": "ehcakuy",
            "parent_id": "t1_ehbmirv",
            "score": 1,
            "created_utc": 1551209790.0,
            "replies": []
        },
        {
            "body": "Knowing (now)  that you’re female makes your comments far more understandable. I shared heartbreak in one post and solid advice from success in another. Perhaps changing your focus away from constantly throwing shade on other women is a good goal for you. I’m certain it will make you more attractive to both sexes. ",
            "author": "10WiseWords",
            "id": "eha3jvv",
            "parent_id": "t1_eha1s2s",
            "score": 4,
            "created_utc": 1551135813.0,
            "replies": []
        },
        {
            "body": "I mean... it’s actually not literally photoshopping. I’m a photographer. I don’t even use Photoshop to do “light retouching”. I use Lightroom. If you’d like to get that pedantic about it, shall we verbify lightrooming? \n\nI consider photoshopping to be making material changes to the subject of the image that could not have been done with different lighting conditions or makeup when the photo was taken. Covering up a zit or lightening the exposure around the face is just not photoshopping.",
            "author": "freyjacalifornia",
            "id": "ehcgks7",
            "parent_id": "t1_ehcd13s",
            "score": 1,
            "created_utc": 1551213810.0,
            "replies": [
                {
                    "body": "I’m not the one who decides what colloquialisms mean. If you wanna try to make lightrooming happen then go for it. \n\nI’m being ‘pedantic’ because there are enough accusations of disingenuous behavior in this lifestyle and for women in general, so using definitive language is important.\n\nI do think the proliferation of unretouched bodies in photos is important. I wholly encourage people to do that. But again, to some people, ‘not photoshopped’ is being used as ‘all stretch marks and acne are gone, and very natural looking edits like mild teeth whitening or removing stray hairs are done’ (as opposed to warping or facetuning the body/face) rather than truly not being retouched at all, so people need to be clear when they’re making statements about it.\n\nAgain, it’s a thing where you don’t HAVE to say anything about it, but if you feel strongly enough to do so, I believe it’s important to be clear and honest. ",
                    "author": "oh_come_on_eileen",
                    "id": "ehfr5ja",
                    "parent_id": "t1_ehcgks7",
                    "score": 1,
                    "created_utc": 1551311821.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I’m not the one who decides what colloquialisms mean. If you wanna try to make lightrooming happen then go for it. \n\nI’m being ‘pedantic’ because there are enough accusations of disingenuous behavior in this lifestyle and for women in general, so using definitive language is important.\n\nI do think the proliferation of unretouched bodies in photos is important. I wholly encourage people to do that. But again, to some people, ‘not photoshopped’ is being used as ‘all stretch marks and acne are gone, and very natural looking edits like mild teeth whitening or removing stray hairs are done’ (as opposed to warping or facetuning the body/face) rather than truly not being retouched at all, so people need to be clear when they’re making statements about it.\n\nAgain, it’s a thing where you don’t HAVE to say anything about it, but if you feel strongly enough to do so, I believe it’s important to be clear and honest. ",
            "author": "oh_come_on_eileen",
            "id": "ehfr5ja",
            "parent_id": "t1_ehcgks7",
            "score": 1,
            "created_utc": 1551311821.0,
            "replies": []
        }
    ]
}