{
    "title": "Ayo chill 💀",
    "post_id": "xd883x",
    "post_url": "https://www.reddit.com/r/dankruto/comments/xd883x/ayo_chill/",
    "author": "RPG-RAUPUNGA-MKYFY-_",
    "body": "",
    "url": "https://i.redd.it/r96445r4tmn91.jpg",
    "score": 3622,
    "upvote_ratio": 0.99,
    "created_utc": 1663077298.0,
    "num_comments": 56,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "Sai’s ability seemed so OP when he was introduced and then they didn’t do shit with him lmao",
            "author": "whalemix",
            "id": "io9g76x",
            "parent_id": "t3_xd883x",
            "score": 283,
            "created_utc": 1663079481.0,
            "replies": [
                {
                    "body": "Right??? The biggest letdown at the start of Shippuden, besides Naruto not learning crap but giant rasengan",
                    "author": "EpicMaxxy",
                    "id": "ioa625v",
                    "parent_id": "t1_io9g76x",
                    "score": 121,
                    "created_utc": 1663089100.0,
                    "replies": [
                        {
                            "body": "Rasengan was just too versatile for the story. It was never lethal, it was always as strong as the story required, it almost never drew large amounts of blood, it didn't leave people with burns or lost limbs, and the user was forced to meet opponents head on. \n\nThis meant Naruto had a tool that was perfect for a moralizing protagonist. \n\nHe demonstrates bravery since he can't just stay in the shadows and win through genjutsu. \n\nHe doesn't have to kill his opponents or bear responsibility for maiming them (Kakuzu and white zetsu excepted, except Kakashi stole the kill for Kakuzu and white zetsu seemingly don't bleed or feel pain). \n\nAnd his jutsu is so variable in its effect on targets that it can succeed or fail to do something without people complaining about inconsistency. If the Raikiri somehow failed to pierce a target, we'd want to know how the target survived. But if a rasengan just knocks the wind out of someone, we don't seem to question how the same jutsu that blew up a water tower didn't explode the target's organs.",
                            "author": "Justicar-terrae",
                            "id": "ioaec9o",
                            "parent_id": "t1_ioa625v",
                            "score": 76,
                            "created_utc": 1663093069.0,
                            "replies": [
                                {
                                    "body": "To add to your point; since Naruto never intends to kill someone, maybe the power was never 100% on the Rasengan. \n\nAlso - Naruto has *killed* \"people\" with his signature move. However, it seems like these characters were more spiritually controlled (non-human) or monsters. Like that one red hair spirit thing that controlled one of the former temple guardians.",
                                    "author": "I_C_Weiner__",
                                    "id": "ioafqvq",
                                    "parent_id": "t1_ioaec9o",
                                    "score": 36,
                                    "created_utc": 1663093620.0,
                                    "replies": [
                                        {
                                            "body": "He only killed Yura though. Nobody else.",
                                            "author": null,
                                            "id": "ioahde8",
                                            "parent_id": "t1_ioafqvq",
                                            "score": 11,
                                            "created_utc": 1663094253.0,
                                            "replies": [
                                                {
                                                    "body": "What about Fuka- technically it was floating hair and a spirit?",
                                                    "author": "I_C_Weiner__",
                                                    "id": "ioelowl",
                                                    "parent_id": "t1_ioahde8",
                                                    "score": 3,
                                                    "created_utc": 1663168116.0,
                                                    "replies": [
                                                        {
                                                            "body": "Isn't she filler?",
                                                            "author": null,
                                                            "id": "ioembdc",
                                                            "parent_id": "t1_ioelowl",
                                                            "score": 2,
                                                            "created_utc": 1663168354.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Yes",
                                                                    "author": "I_C_Weiner__",
                                                                    "id": "ioeorqz",
                                                                    "parent_id": "t1_ioembdc",
                                                                    "score": 2,
                                                                    "created_utc": 1663169283.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "Yeah but that \"Rasenshuriken\" is one of the most lethal one-hit kill moves in the franchise.",
                                    "author": "BigBadDogIV",
                                    "id": "iob6099",
                                    "parent_id": "t1_ioaec9o",
                                    "score": 10,
                                    "created_utc": 1663103489.0,
                                    "replies": [
                                        {
                                            "body": "It's strong, but not really all that lethal in the series. It mortally wounds one non-zetsu living person, Kakuzu, and that person is left alive long enough for Kakashi to steal the kill. Every other time we see a rasenshuriken take out a target, that target is either a white zetsu or a corpse being remotely controlled by Nagato. \n\nThe move is powerful, sure. But it has a much lower kill count than, say, raikiri/chidori. And we see plenty of lethal one-hit abilities in the show, even if they rarely actually work because they were used against targets with even more ridiculous abilities. Take particle style for example. It immediately deletes anything caught inside it's shape, and the shape can be quite massive. The only reason Sasuke survived is because he was pulled out of it by a third party who could move through walls; and the only reason Madara survived is because he was an edo tensei summon at the time. In the show, not sure about the manga, Asuma disintegrates an entire squad of three shinobi with a single blast of fire style. Sasori and Hanzo use poisons that one-shot anyone unless they get treated with antidotes; and very few people can make the antidotes. Kaguya's bones one-shot anyone they touch. Amaterasu always kills unless the user turns off the fire or the target sheds the part of their body that is ablaze. Kakashi can send chunks of a target into the kamui dimension if he gets close enough and has enough chakra; he could warp away a target's head and immediately kill them. And there are abilities like the water bullet that will punch right through a person unless blocked with a strong enough technique.",
                                            "author": "Justicar-terrae",
                                            "id": "ioci6pu",
                                            "parent_id": "t1_iob6099",
                                            "score": 9,
                                            "created_utc": 1663124547.0,
                                            "replies": [
                                                {
                                                    "body": ">It's strong, but not really all that lethal in the series.\n\nIt's an interesting caveat to say \"in the series\". You're right to point out it wasn't used to kill many, if any characters. But this more has to do with the writing around Naruto's character than the lethality of the Rasenshuriken.\n\n>It mortally wounds one non-zetsu living person, Kakuzu, and that person is left alive long enough for Kakashi to steal the kill.\n\nPersonally, I don't have a lot of issues with the writing in Naruto (a lot of people will disagree with me on this but that's them) but this is one of my biggest ones. There is no way Kakuzu should have still been alive at all after getting hit with the Rasenshuriken. Yes, technically it killed him like four or five times over but he still had enough life left afterwards that Musashi Kishimoto could conveniently have someone other than Naruto kill him the final time. But we know that's bullshit from Tsunade's explanation of the Rasenshuriken. He should have been killed at least thousands of times over due to the extreme level of thoroughness with which the Rasenshuriken shreds things. It shreds so thoroughly that even all the individual molecules get shredded as well. There's no way that Kakuzu should have only died four or five times from that.\n\n>The move is powerful, sure. But it has a much lower kill count than, say, raikiri/chidori. And we see plenty of lethal one-hit abilities in the show, even if they rarely actually work because they were used against targets with even more ridiculous abilities. Take particle style for example. It immediately deletes anything caught inside it's shape, and the shape can be quite massive. The only reason Sasuke survived is because he was pulled out of it by a third party who could move through walls; and the only reason Madara survived is because he was an edo tensei summon at the time. In the show, not sure about the manga, Asuma disintegrates an entire squad of three shinobi with a single blast of fire style. Sasori and Hanzo use poisons that one-shot anyone unless they get treated with antidotes; and very few people can make the antidotes. Kaguya's bones one-shot anyone they touch. Amaterasu always kills unless the user turns off the fire or the target sheds the part of their body that is ablaze. Kakashi can send chunks of a target into the kamui dimension if he gets close enough and has enough chakra; he could warp away a target's head and immediately kill them. And there are abilities like the water bullet that will punch right through a person unless blocked with a strong enough technique.\n\nThis is a good point. I forgot just how many different one-hit kill moves there is in Naruto. For some reason I was only thinking of Amaterasu and Rasenshuriken (probably because those are the two one-hit kill moves used by Sasuke and Naruto). Rasenshuriken is still definitely a one-hit kill move that normal characters should not be capable of surviving, but there's definitely a lot of other one-hit kill moves that are equal to or greater than Rasenshuriken in their lethality.",
                                                    "author": "BigBadDogIV",
                                                    "id": "ioezoqv",
                                                    "parent_id": "t1_ioci6pu",
                                                    "score": 4,
                                                    "created_utc": 1663173410.0,
                                                    "replies": [
                                                        {
                                                            "body": "You're right that rasenshuriken is still a great move, I don't want to completely downplay it. It's got power and, eventually, adaptability with all the element combinations Naruto learned from the tailed beasts. It also scales up decently well, able to cut through a god tree pretty easily (once boosted by war arc amps). But it doesn't do anything that particle style can't do, it can't seal or trap unkillable enemies like Gaara's sand or Sai's paint or Obito/Kakashi's kamui, and its one-shot power against humans isn't top tier (though it's still high tier, especially at series end). \n\nOne thing I'll definitely grant to rasenshuriken is ease of use once mastered. There are several other supposedly awesome abilities that kinda suck from a practical aspect. Three of the Sage's tools, for example, only work when used together and are stupidly complex. Plus if you can bop someone with the rope tool you could just as easily cut them with a sword or other weapon, skipping all the word-game nonsense. Several of the Ninja Swords of the Mist are similarly underwhelming, like Helmet Splitter or the Executioner Sword, both of which offer minor advantages in exchange for being cumbersome. Hidan's ritual requires tons of setup. Truth Seeker Orbs are strong but nowhere near as strong as they are implied to be, and you need to go through tons of steps to unlock them. Half of Pain's abilities also seem overly complex or of little value in a fight, like the Asura Path (basically just a pointy guy with fancy paper bombs), Human Path (can't do anything without grabbing your head first), and Animal Path (doesn't do shit after the animals are summoned). \n\nAnd plenty of other one-shot abilities are locked behind special eyeballs or genetics, sometimes with soft caps on how much they can be used (soft caps because you can get around MS caps by unlocking EMS). Rasenshuriken can theoretically be learned by anyone with enough practice, patience, and chakra. So even though Naruto still gets hax power-ups because of his bloodline, he still has an \"everyman\" jutsu that he earned rather than one he unlocked through birth.",
                                                            "author": "Justicar-terrae",
                                                            "id": "iof47ku",
                                                            "parent_id": "t1_ioezoqv",
                                                            "score": 3,
                                                            "created_utc": 1663175122.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "All he did was \"Make it bigger\" \"Make it curvy\" with Jiraiya for 2 years and trained hard to do that. Respects from Konohamaru 😅",
                            "author": "Crazykwan0",
                            "id": "ioae5d9",
                            "parent_id": "t1_ioa625v",
                            "score": 19,
                            "created_utc": 1663092991.0,
                            "replies": []
                        },
                        {
                            "body": "Naruto used Kyuubi chakra regularly though. And he was a better and smarter fighter",
                            "author": "Kgb725",
                            "id": "iob7rgf",
                            "parent_id": "t1_ioa625v",
                            "score": 4,
                            "created_utc": 1663104169.0,
                            "replies": []
                        },
                        {
                            "body": "What about Lee",
                            "author": "Few_Pay_5313",
                            "id": "iocjj1h",
                            "parent_id": "t1_ioa625v",
                            "score": 4,
                            "created_utc": 1663125225.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "The fate of 90% of the side characters.",
                    "author": "Knight_of_Myrmidia",
                    "id": "iod1gvf",
                    "parent_id": "t1_io9g76x",
                    "score": 4,
                    "created_utc": 1663135460.0,
                    "replies": []
                },
                {
                    "body": "Story of every character that isn't Naruto, Sauske, or Kakashi.",
                    "author": "infamusforever223",
                    "id": "iobhw41",
                    "parent_id": "t1_io9g76x",
                    "score": 8,
                    "created_utc": 1663108320.0,
                    "replies": [
                        {
                            "body": "What are you saying, bro? Kakashi? You sure about that?🗿\n\nBecause I don’t ever remember Kakashi using his arsenal of over 1000 Jutsus aside from [Chidori/Raikiri→Some varient of that sh-t/Mud wall/Great fireball(that one wasn’t even in a serious fight, it was against his student on 2nd bell test/Water dragon(also against his student)].\n\nOr ever using his Sharingan to copy Jutsus which he did only once at the start of the series. Maybe some more like 2 or 3 that I forget, because they weren’t impactful enough. Like they call him \"Copy Ninja Hatake Kakashi of the Sharingan\", they keep rubbing it on our face but they nearly never show sh-t to prove their point.\n\nOr even knowing about his family like his dad, talking about some big let down. We only know his name and that he was as strong as the Three Legendary Sanin. And no, we’re not gonna talk about his mom.\n\nI don’t remember Kakashi winning that much of fight alone like Naruto or Sasuke.\n\nI don’t think they were fair with him either. They didn’t explore his full potential either, surely not as much as someone like Sai but they *cleary* could have done better with Kakashi.\n\nSo it’s more like:\n\n\"Story of every character that isn’t Naruto or Sasuke\"\n\nBecause Naruto and Sasuke were the real focus until the very end. Practically everything revolves around Naruto and Sasuke. It’s always Naruto and Sasuke. Like them being some little Jesus Ninjas. Do you remember Kakashi being some little Jesus Ninja? Because I surely don’t.\n\nOFC I get that they are the MCs so that’s normal, but still, it doesn’t feel right. They did all of Naruto’s side characters so dirty. **All of them.**\n\n\n*Literally.*",
                            "author": "Safe-Form-3263",
                            "id": "iocbfqy",
                            "parent_id": "t1_iobhw41",
                            "score": 2,
                            "created_utc": 1663121391.0,
                            "replies": [
                                {
                                    "body": "I was mainly referring to his kamui hax he had during the war arc, where he was spamming it constantly without getting exhausted, before Madara stole it. There's also him charging off to fight the tailed beasts with Guy. Then there wad the hax Susanno he had when fighting Kaguya. While he did eventually lose those abilities he wad keeping up when he had them. Kakashi also has a very developed backstop that's connected to one of the main villains, which is why he so developed.",
                                    "author": "infamusforever223",
                                    "id": "iocgv4q",
                                    "parent_id": "t1_iocbfqy",
                                    "score": 1,
                                    "created_utc": 1663123899.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "What could he even do besides have a bit more versatility",
                    "author": "Kgb725",
                    "id": "iob7ukx",
                    "parent_id": "t1_io9g76x",
                    "score": 1,
                    "created_utc": 1663104204.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Can barely see this shadowy ass meme",
            "author": "xstormaggedonx",
            "id": "io9ce5h",
            "parent_id": "t3_xd883x",
            "score": 121,
            "created_utc": 1663077993.0,
            "replies": [
                {
                    "body": "shadow clone meme repost x1000 jutsu",
                    "author": "ChodeChungus",
                    "id": "iobazs4",
                    "parent_id": "t1_io9ce5h",
                    "score": 18,
                    "created_utc": 1663105459.0,
                    "replies": []
                },
                {
                    "body": "Op spilled ink on it out of solidarity.",
                    "author": "deadlysnoots",
                    "id": "iodq99r",
                    "parent_id": "t1_io9ce5h",
                    "score": 3,
                    "created_utc": 1663153784.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Keep clowning the man Sai. Bro finna draw himself fucking your mom then pull your mom out the paper and actually fuck your mom",
            "author": "Meager1169",
            "id": "io9ersm",
            "parent_id": "t3_xd883x",
            "score": 144,
            "created_utc": 1663078932.0,
            "replies": [
                {
                    "body": "God dam ur right",
                    "author": "AggressiveRow3046",
                    "id": "io9f2gs",
                    "parent_id": "t1_io9ersm",
                    "score": 35,
                    "created_utc": 1663079053.0,
                    "replies": []
                },
                {
                    "body": "☠️ That’s crazy lady gonna drip ink",
                    "author": "NetworkVegetable7075",
                    "id": "ioa40n5",
                    "parent_id": "t1_io9ersm",
                    "score": 19,
                    "created_utc": 1663088347.0,
                    "replies": []
                },
                {
                    "body": "Homie got Ino, automatic W.",
                    "author": "Filth7",
                    "id": "iocaa6m",
                    "parent_id": "t1_io9ersm",
                    "score": 8,
                    "created_utc": 1663120874.0,
                    "replies": []
                },
                {
                    "body": "His jutsu is terrifying when you realize this man can literally weaponize Hentai",
                    "author": "SeductivePillowcase",
                    "id": "iocn1ld",
                    "parent_id": "t1_io9ersm",
                    "score": 6,
                    "created_utc": 1663127037.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "did you print this meme out and then take a picture of it with a disposable camera, drop it off at CVS to get the film processed, pickup said picture when it was ready, scan it via the scanner at your office to your email, compress it and then upload it to reddit? cause bro, the quality? is 👌😩",
            "author": "ChodeChungus",
            "id": "ioaht6o",
            "parent_id": "t3_xd883x",
            "score": 40,
            "created_utc": 1663094415.0,
            "replies": [
                {
                    "body": "😂",
                    "author": "CaseSensitivo",
                    "id": "iobyrts",
                    "parent_id": "t1_ioaht6o",
                    "score": 5,
                    "created_utc": 1663115795.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "5th Great Shinobi War",
            "author": "IAmYoDaddyDuh",
            "id": "ioa013j",
            "parent_id": "t3_xd883x",
            "score": 12,
            "created_utc": 1663086877.0,
            "replies": []
        },
        {
            "body": "Sai’s Kampf 👨🏻‍🎨 ☠️",
            "author": "Chango_D",
            "id": "ioa16zv",
            "parent_id": "t3_xd883x",
            "score": 11,
            "created_utc": 1663087305.0,
            "replies": []
        },
        {
            "body": "Everyone gangsta until Sai starts drawing every Kage and tailed beast",
            "author": "ItsPinhead",
            "id": "ioak7dd",
            "parent_id": "t3_xd883x",
            "score": 11,
            "created_utc": 1663095331.0,
            "replies": []
        },
        {
            "body": "Nah! Draw harder maybe!",
            "author": "PaulCHouse",
            "id": "io9n9dd",
            "parent_id": "t3_xd883x",
            "score": 8,
            "created_utc": 1663082150.0,
            "replies": []
        },
        {
            "body": "Did someone turn the lights off?",
            "author": "ThirtyH",
            "id": "ioagytb",
            "parent_id": "t3_xd883x",
            "score": 7,
            "created_utc": 1663094100.0,
            "replies": []
        },
        {
            "body": "Hitler would be thrilled to know that someone generations from his death would call him “an artist”. He was a literal bum who could rile up drunks at a bar.",
            "author": "IronSavage3",
            "id": "ioa8yxq",
            "parent_id": "t3_xd883x",
            "score": 8,
            "created_utc": 1663090211.0,
            "replies": [
                {
                    "body": "Nah, he definitely had talent in art. You can check his paintings are not bad. \n\nAnd even as politician he had quite charisma and his moments, he wouldn’t gain as much power as he did without it.",
                    "author": "DrunkSaruman",
                    "id": "ioaek82",
                    "parent_id": "t1_ioa8yxq",
                    "score": 5,
                    "created_utc": 1663093158.0,
                    "replies": [
                        {
                            "body": "I agree, he might’ve been a dick but he was an insanely good public speaker.",
                            "author": "HandsyGymTeacher",
                            "id": "ioawthr",
                            "parent_id": "t1_ioaek82",
                            "score": 4,
                            "created_utc": 1663100038.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I'm gonna have to correct him on that one, the last time an artist got mad, he suicide bombed a forrest. Art is an explosion bitches.",
            "author": null,
            "id": "iocnkoo",
            "parent_id": "t3_xd883x",
            "score": 3,
            "created_utc": 1663127325.0,
            "replies": []
        },
        {
            "body": "Hail sai",
            "author": "Maleficent_Rip_8794",
            "id": "iob71nt",
            "parent_id": "t3_xd883x",
            "score": 2,
            "created_utc": 1663103897.0,
            "replies": []
        },
        {
            "body": "Can he draw a woman and fuck it",
            "author": "HalfAsFunny",
            "id": "iocde5i",
            "parent_id": "t3_xd883x",
            "score": 2,
            "created_utc": 1663122277.0,
            "replies": [
                {
                    "body": "I don't know, does naruto fuck his own shadow clones using sexy jutsu?",
                    "author": null,
                    "id": "iocnnm7",
                    "parent_id": "t1_iocde5i",
                    "score": 2,
                    "created_utc": 1663127370.0,
                    "replies": [
                        {
                            "body": "I hope so or else it would be a waste of his power. Let's just say you got his power would you fuck your shadow clones?",
                            "author": "HalfAsFunny",
                            "id": "iocpgqc",
                            "parent_id": "t1_iocnnm7",
                            "score": 2,
                            "created_utc": 1663128271.0,
                            "replies": [
                                {
                                    "body": "Remember, you inherit your clone's memories after they disappear. I don't particularly want to inherit my clone's memory of getting penetrated.",
                                    "author": null,
                                    "id": "iocpoqh",
                                    "parent_id": "t1_iocpgqc",
                                    "score": 2,
                                    "created_utc": 1663128373.0,
                                    "replies": [
                                        {
                                            "body": "But there has to be a technique that can erase/block memories right",
                                            "author": "HalfAsFunny",
                                            "id": "iocqcvn",
                                            "parent_id": "t1_iocpoqh",
                                            "score": 2,
                                            "created_utc": 1663128750.0,
                                            "replies": [
                                                {
                                                    "body": "Not everyone's lucky enough to be a genjutsu type or be close with a genjutsu type. You could get a yamanaka clan member to do it, but they'd also see the memory themselves...",
                                                    "author": null,
                                                    "id": "iocqitd",
                                                    "parent_id": "t1_iocqcvn",
                                                    "score": 2,
                                                    "created_utc": 1663128846.0,
                                                    "replies": [
                                                        {
                                                            "body": "Let them fuck the clones too man 🤣🤣",
                                                            "author": "HalfAsFunny",
                                                            "id": "ioct7d5",
                                                            "parent_id": "t1_iocqitd",
                                                            "score": 1,
                                                            "created_utc": 1663130335.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "😭😭",
            "author": "CarrotEnvironmental6",
            "id": "iocll0b",
            "parent_id": "t3_xd883x",
            "score": 2,
            "created_utc": 1663126273.0,
            "replies": []
        },
        {
            "body": "Sai not getting into ninja academy has untapped meme potential.",
            "author": "the6crimson6fucker6",
            "id": "ioaf9kh",
            "parent_id": "t3_xd883x",
            "score": 2,
            "created_utc": 1663093431.0,
            "replies": []
        },
        {
            "body": "Still more useful than Sakura tho .....",
            "author": null,
            "id": "ioakxpq",
            "parent_id": "t3_xd883x",
            "score": 1,
            "created_utc": 1663095610.0,
            "replies": []
        },
        {
            "body": "hi 5 people that are here",
            "author": "sushibabooshi",
            "id": "ioc20ud",
            "parent_id": "t3_xd883x",
            "score": 1,
            "created_utc": 1663117225.0,
            "replies": [
                {
                    "body": "now there's 8",
                    "author": "sushibabooshi",
                    "id": "ioc28gk",
                    "parent_id": "t1_ioc20ud",
                    "score": 1,
                    "created_utc": 1663117318.0,
                    "replies": [
                        {
                            "body": "now 10",
                            "author": "sushibabooshi",
                            "id": "ioc29rj",
                            "parent_id": "t1_ioc28gk",
                            "score": 2,
                            "created_utc": 1663117333.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Sai has one of the most cringe worthy moments in all of anime in my opinion, and that is when during the 4th great ninja war we get to see the epic return of Squad 7  the 3 way deadlock summoning is about to happen its all hype and impressive, then sai has to come in and ruin the moment by being that \"well technically I was part of squad 7 too\" guy, and gets himself shot down like fodder and then begs naruto to share more chakra with everyone",
            "author": "Neat_Yogurtcloset526",
            "id": "ioajzie",
            "parent_id": "t3_xd883x",
            "score": -2,
            "created_utc": 1663095246.0,
            "replies": []
        },
        {
            "body": "😭😭",
            "author": "princessexmia",
            "id": "ioartr9",
            "parent_id": "t3_xd883x",
            "score": 1,
            "created_utc": 1663098204.0,
            "replies": []
        },
        {
            "body": "Someone please turn the lights on for this meme",
            "author": "Zorzan",
            "id": "iodr830",
            "parent_id": "t3_xd883x",
            "score": 1,
            "created_utc": 1663154334.0,
            "replies": []
        },
        {
            "body": "Right??? The biggest letdown at the start of Shippuden, besides Naruto not learning crap but giant rasengan",
            "author": "EpicMaxxy",
            "id": "ioa625v",
            "parent_id": "t1_io9g76x",
            "score": 121,
            "created_utc": 1663089100.0,
            "replies": [
                {
                    "body": "Rasengan was just too versatile for the story. It was never lethal, it was always as strong as the story required, it almost never drew large amounts of blood, it didn't leave people with burns or lost limbs, and the user was forced to meet opponents head on. \n\nThis meant Naruto had a tool that was perfect for a moralizing protagonist. \n\nHe demonstrates bravery since he can't just stay in the shadows and win through genjutsu. \n\nHe doesn't have to kill his opponents or bear responsibility for maiming them (Kakuzu and white zetsu excepted, except Kakashi stole the kill for Kakuzu and white zetsu seemingly don't bleed or feel pain). \n\nAnd his jutsu is so variable in its effect on targets that it can succeed or fail to do something without people complaining about inconsistency. If the Raikiri somehow failed to pierce a target, we'd want to know how the target survived. But if a rasengan just knocks the wind out of someone, we don't seem to question how the same jutsu that blew up a water tower didn't explode the target's organs.",
                    "author": "Justicar-terrae",
                    "id": "ioaec9o",
                    "parent_id": "t1_ioa625v",
                    "score": 76,
                    "created_utc": 1663093069.0,
                    "replies": [
                        {
                            "body": "To add to your point; since Naruto never intends to kill someone, maybe the power was never 100% on the Rasengan. \n\nAlso - Naruto has *killed* \"people\" with his signature move. However, it seems like these characters were more spiritually controlled (non-human) or monsters. Like that one red hair spirit thing that controlled one of the former temple guardians.",
                            "author": "I_C_Weiner__",
                            "id": "ioafqvq",
                            "parent_id": "t1_ioaec9o",
                            "score": 36,
                            "created_utc": 1663093620.0,
                            "replies": [
                                {
                                    "body": "He only killed Yura though. Nobody else.",
                                    "author": null,
                                    "id": "ioahde8",
                                    "parent_id": "t1_ioafqvq",
                                    "score": 11,
                                    "created_utc": 1663094253.0,
                                    "replies": [
                                        {
                                            "body": "What about Fuka- technically it was floating hair and a spirit?",
                                            "author": "I_C_Weiner__",
                                            "id": "ioelowl",
                                            "parent_id": "t1_ioahde8",
                                            "score": 3,
                                            "created_utc": 1663168116.0,
                                            "replies": [
                                                {
                                                    "body": "Isn't she filler?",
                                                    "author": null,
                                                    "id": "ioembdc",
                                                    "parent_id": "t1_ioelowl",
                                                    "score": 2,
                                                    "created_utc": 1663168354.0,
                                                    "replies": [
                                                        {
                                                            "body": "Yes",
                                                            "author": "I_C_Weiner__",
                                                            "id": "ioeorqz",
                                                            "parent_id": "t1_ioembdc",
                                                            "score": 2,
                                                            "created_utc": 1663169283.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Yeah but that \"Rasenshuriken\" is one of the most lethal one-hit kill moves in the franchise.",
                            "author": "BigBadDogIV",
                            "id": "iob6099",
                            "parent_id": "t1_ioaec9o",
                            "score": 10,
                            "created_utc": 1663103489.0,
                            "replies": [
                                {
                                    "body": "It's strong, but not really all that lethal in the series. It mortally wounds one non-zetsu living person, Kakuzu, and that person is left alive long enough for Kakashi to steal the kill. Every other time we see a rasenshuriken take out a target, that target is either a white zetsu or a corpse being remotely controlled by Nagato. \n\nThe move is powerful, sure. But it has a much lower kill count than, say, raikiri/chidori. And we see plenty of lethal one-hit abilities in the show, even if they rarely actually work because they were used against targets with even more ridiculous abilities. Take particle style for example. It immediately deletes anything caught inside it's shape, and the shape can be quite massive. The only reason Sasuke survived is because he was pulled out of it by a third party who could move through walls; and the only reason Madara survived is because he was an edo tensei summon at the time. In the show, not sure about the manga, Asuma disintegrates an entire squad of three shinobi with a single blast of fire style. Sasori and Hanzo use poisons that one-shot anyone unless they get treated with antidotes; and very few people can make the antidotes. Kaguya's bones one-shot anyone they touch. Amaterasu always kills unless the user turns off the fire or the target sheds the part of their body that is ablaze. Kakashi can send chunks of a target into the kamui dimension if he gets close enough and has enough chakra; he could warp away a target's head and immediately kill them. And there are abilities like the water bullet that will punch right through a person unless blocked with a strong enough technique.",
                                    "author": "Justicar-terrae",
                                    "id": "ioci6pu",
                                    "parent_id": "t1_iob6099",
                                    "score": 9,
                                    "created_utc": 1663124547.0,
                                    "replies": [
                                        {
                                            "body": ">It's strong, but not really all that lethal in the series.\n\nIt's an interesting caveat to say \"in the series\". You're right to point out it wasn't used to kill many, if any characters. But this more has to do with the writing around Naruto's character than the lethality of the Rasenshuriken.\n\n>It mortally wounds one non-zetsu living person, Kakuzu, and that person is left alive long enough for Kakashi to steal the kill.\n\nPersonally, I don't have a lot of issues with the writing in Naruto (a lot of people will disagree with me on this but that's them) but this is one of my biggest ones. There is no way Kakuzu should have still been alive at all after getting hit with the Rasenshuriken. Yes, technically it killed him like four or five times over but he still had enough life left afterwards that Musashi Kishimoto could conveniently have someone other than Naruto kill him the final time. But we know that's bullshit from Tsunade's explanation of the Rasenshuriken. He should have been killed at least thousands of times over due to the extreme level of thoroughness with which the Rasenshuriken shreds things. It shreds so thoroughly that even all the individual molecules get shredded as well. There's no way that Kakuzu should have only died four or five times from that.\n\n>The move is powerful, sure. But it has a much lower kill count than, say, raikiri/chidori. And we see plenty of lethal one-hit abilities in the show, even if they rarely actually work because they were used against targets with even more ridiculous abilities. Take particle style for example. It immediately deletes anything caught inside it's shape, and the shape can be quite massive. The only reason Sasuke survived is because he was pulled out of it by a third party who could move through walls; and the only reason Madara survived is because he was an edo tensei summon at the time. In the show, not sure about the manga, Asuma disintegrates an entire squad of three shinobi with a single blast of fire style. Sasori and Hanzo use poisons that one-shot anyone unless they get treated with antidotes; and very few people can make the antidotes. Kaguya's bones one-shot anyone they touch. Amaterasu always kills unless the user turns off the fire or the target sheds the part of their body that is ablaze. Kakashi can send chunks of a target into the kamui dimension if he gets close enough and has enough chakra; he could warp away a target's head and immediately kill them. And there are abilities like the water bullet that will punch right through a person unless blocked with a strong enough technique.\n\nThis is a good point. I forgot just how many different one-hit kill moves there is in Naruto. For some reason I was only thinking of Amaterasu and Rasenshuriken (probably because those are the two one-hit kill moves used by Sasuke and Naruto). Rasenshuriken is still definitely a one-hit kill move that normal characters should not be capable of surviving, but there's definitely a lot of other one-hit kill moves that are equal to or greater than Rasenshuriken in their lethality.",
                                            "author": "BigBadDogIV",
                                            "id": "ioezoqv",
                                            "parent_id": "t1_ioci6pu",
                                            "score": 4,
                                            "created_utc": 1663173410.0,
                                            "replies": [
                                                {
                                                    "body": "You're right that rasenshuriken is still a great move, I don't want to completely downplay it. It's got power and, eventually, adaptability with all the element combinations Naruto learned from the tailed beasts. It also scales up decently well, able to cut through a god tree pretty easily (once boosted by war arc amps). But it doesn't do anything that particle style can't do, it can't seal or trap unkillable enemies like Gaara's sand or Sai's paint or Obito/Kakashi's kamui, and its one-shot power against humans isn't top tier (though it's still high tier, especially at series end). \n\nOne thing I'll definitely grant to rasenshuriken is ease of use once mastered. There are several other supposedly awesome abilities that kinda suck from a practical aspect. Three of the Sage's tools, for example, only work when used together and are stupidly complex. Plus if you can bop someone with the rope tool you could just as easily cut them with a sword or other weapon, skipping all the word-game nonsense. Several of the Ninja Swords of the Mist are similarly underwhelming, like Helmet Splitter or the Executioner Sword, both of which offer minor advantages in exchange for being cumbersome. Hidan's ritual requires tons of setup. Truth Seeker Orbs are strong but nowhere near as strong as they are implied to be, and you need to go through tons of steps to unlock them. Half of Pain's abilities also seem overly complex or of little value in a fight, like the Asura Path (basically just a pointy guy with fancy paper bombs), Human Path (can't do anything without grabbing your head first), and Animal Path (doesn't do shit after the animals are summoned). \n\nAnd plenty of other one-shot abilities are locked behind special eyeballs or genetics, sometimes with soft caps on how much they can be used (soft caps because you can get around MS caps by unlocking EMS). Rasenshuriken can theoretically be learned by anyone with enough practice, patience, and chakra. So even though Naruto still gets hax power-ups because of his bloodline, he still has an \"everyman\" jutsu that he earned rather than one he unlocked through birth.",
                                                    "author": "Justicar-terrae",
                                                    "id": "iof47ku",
                                                    "parent_id": "t1_ioezoqv",
                                                    "score": 3,
                                                    "created_utc": 1663175122.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "All he did was \"Make it bigger\" \"Make it curvy\" with Jiraiya for 2 years and trained hard to do that. Respects from Konohamaru 😅",
                    "author": "Crazykwan0",
                    "id": "ioae5d9",
                    "parent_id": "t1_ioa625v",
                    "score": 19,
                    "created_utc": 1663092991.0,
                    "replies": []
                },
                {
                    "body": "Naruto used Kyuubi chakra regularly though. And he was a better and smarter fighter",
                    "author": "Kgb725",
                    "id": "iob7rgf",
                    "parent_id": "t1_ioa625v",
                    "score": 4,
                    "created_utc": 1663104169.0,
                    "replies": []
                },
                {
                    "body": "What about Lee",
                    "author": "Few_Pay_5313",
                    "id": "iocjj1h",
                    "parent_id": "t1_ioa625v",
                    "score": 4,
                    "created_utc": 1663125225.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "The fate of 90% of the side characters.",
            "author": "Knight_of_Myrmidia",
            "id": "iod1gvf",
            "parent_id": "t1_io9g76x",
            "score": 4,
            "created_utc": 1663135460.0,
            "replies": []
        },
        {
            "body": "Story of every character that isn't Naruto, Sauske, or Kakashi.",
            "author": "infamusforever223",
            "id": "iobhw41",
            "parent_id": "t1_io9g76x",
            "score": 8,
            "created_utc": 1663108320.0,
            "replies": [
                {
                    "body": "What are you saying, bro? Kakashi? You sure about that?🗿\n\nBecause I don’t ever remember Kakashi using his arsenal of over 1000 Jutsus aside from [Chidori/Raikiri→Some varient of that sh-t/Mud wall/Great fireball(that one wasn’t even in a serious fight, it was against his student on 2nd bell test/Water dragon(also against his student)].\n\nOr ever using his Sharingan to copy Jutsus which he did only once at the start of the series. Maybe some more like 2 or 3 that I forget, because they weren’t impactful enough. Like they call him \"Copy Ninja Hatake Kakashi of the Sharingan\", they keep rubbing it on our face but they nearly never show sh-t to prove their point.\n\nOr even knowing about his family like his dad, talking about some big let down. We only know his name and that he was as strong as the Three Legendary Sanin. And no, we’re not gonna talk about his mom.\n\nI don’t remember Kakashi winning that much of fight alone like Naruto or Sasuke.\n\nI don’t think they were fair with him either. They didn’t explore his full potential either, surely not as much as someone like Sai but they *cleary* could have done better with Kakashi.\n\nSo it’s more like:\n\n\"Story of every character that isn’t Naruto or Sasuke\"\n\nBecause Naruto and Sasuke were the real focus until the very end. Practically everything revolves around Naruto and Sasuke. It’s always Naruto and Sasuke. Like them being some little Jesus Ninjas. Do you remember Kakashi being some little Jesus Ninja? Because I surely don’t.\n\nOFC I get that they are the MCs so that’s normal, but still, it doesn’t feel right. They did all of Naruto’s side characters so dirty. **All of them.**\n\n\n*Literally.*",
                    "author": "Safe-Form-3263",
                    "id": "iocbfqy",
                    "parent_id": "t1_iobhw41",
                    "score": 2,
                    "created_utc": 1663121391.0,
                    "replies": [
                        {
                            "body": "I was mainly referring to his kamui hax he had during the war arc, where he was spamming it constantly without getting exhausted, before Madara stole it. There's also him charging off to fight the tailed beasts with Guy. Then there wad the hax Susanno he had when fighting Kaguya. While he did eventually lose those abilities he wad keeping up when he had them. Kakashi also has a very developed backstop that's connected to one of the main villains, which is why he so developed.",
                            "author": "infamusforever223",
                            "id": "iocgv4q",
                            "parent_id": "t1_iocbfqy",
                            "score": 1,
                            "created_utc": 1663123899.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "What could he even do besides have a bit more versatility",
            "author": "Kgb725",
            "id": "iob7ukx",
            "parent_id": "t1_io9g76x",
            "score": 1,
            "created_utc": 1663104204.0,
            "replies": []
        },
        {
            "body": "shadow clone meme repost x1000 jutsu",
            "author": "ChodeChungus",
            "id": "iobazs4",
            "parent_id": "t1_io9ce5h",
            "score": 18,
            "created_utc": 1663105459.0,
            "replies": []
        },
        {
            "body": "Op spilled ink on it out of solidarity.",
            "author": "deadlysnoots",
            "id": "iodq99r",
            "parent_id": "t1_io9ce5h",
            "score": 3,
            "created_utc": 1663153784.0,
            "replies": []
        },
        {
            "body": "God dam ur right",
            "author": "AggressiveRow3046",
            "id": "io9f2gs",
            "parent_id": "t1_io9ersm",
            "score": 35,
            "created_utc": 1663079053.0,
            "replies": []
        },
        {
            "body": "☠️ That’s crazy lady gonna drip ink",
            "author": "NetworkVegetable7075",
            "id": "ioa40n5",
            "parent_id": "t1_io9ersm",
            "score": 19,
            "created_utc": 1663088347.0,
            "replies": []
        },
        {
            "body": "Homie got Ino, automatic W.",
            "author": "Filth7",
            "id": "iocaa6m",
            "parent_id": "t1_io9ersm",
            "score": 8,
            "created_utc": 1663120874.0,
            "replies": []
        },
        {
            "body": "His jutsu is terrifying when you realize this man can literally weaponize Hentai",
            "author": "SeductivePillowcase",
            "id": "iocn1ld",
            "parent_id": "t1_io9ersm",
            "score": 6,
            "created_utc": 1663127037.0,
            "replies": []
        },
        {
            "body": "😂",
            "author": "CaseSensitivo",
            "id": "iobyrts",
            "parent_id": "t1_ioaht6o",
            "score": 5,
            "created_utc": 1663115795.0,
            "replies": []
        },
        {
            "body": "Nah, he definitely had talent in art. You can check his paintings are not bad. \n\nAnd even as politician he had quite charisma and his moments, he wouldn’t gain as much power as he did without it.",
            "author": "DrunkSaruman",
            "id": "ioaek82",
            "parent_id": "t1_ioa8yxq",
            "score": 5,
            "created_utc": 1663093158.0,
            "replies": [
                {
                    "body": "I agree, he might’ve been a dick but he was an insanely good public speaker.",
                    "author": "HandsyGymTeacher",
                    "id": "ioawthr",
                    "parent_id": "t1_ioaek82",
                    "score": 4,
                    "created_utc": 1663100038.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I don't know, does naruto fuck his own shadow clones using sexy jutsu?",
            "author": null,
            "id": "iocnnm7",
            "parent_id": "t1_iocde5i",
            "score": 2,
            "created_utc": 1663127370.0,
            "replies": [
                {
                    "body": "I hope so or else it would be a waste of his power. Let's just say you got his power would you fuck your shadow clones?",
                    "author": "HalfAsFunny",
                    "id": "iocpgqc",
                    "parent_id": "t1_iocnnm7",
                    "score": 2,
                    "created_utc": 1663128271.0,
                    "replies": [
                        {
                            "body": "Remember, you inherit your clone's memories after they disappear. I don't particularly want to inherit my clone's memory of getting penetrated.",
                            "author": null,
                            "id": "iocpoqh",
                            "parent_id": "t1_iocpgqc",
                            "score": 2,
                            "created_utc": 1663128373.0,
                            "replies": [
                                {
                                    "body": "But there has to be a technique that can erase/block memories right",
                                    "author": "HalfAsFunny",
                                    "id": "iocqcvn",
                                    "parent_id": "t1_iocpoqh",
                                    "score": 2,
                                    "created_utc": 1663128750.0,
                                    "replies": [
                                        {
                                            "body": "Not everyone's lucky enough to be a genjutsu type or be close with a genjutsu type. You could get a yamanaka clan member to do it, but they'd also see the memory themselves...",
                                            "author": null,
                                            "id": "iocqitd",
                                            "parent_id": "t1_iocqcvn",
                                            "score": 2,
                                            "created_utc": 1663128846.0,
                                            "replies": [
                                                {
                                                    "body": "Let them fuck the clones too man 🤣🤣",
                                                    "author": "HalfAsFunny",
                                                    "id": "ioct7d5",
                                                    "parent_id": "t1_iocqitd",
                                                    "score": 1,
                                                    "created_utc": 1663130335.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "now there's 8",
            "author": "sushibabooshi",
            "id": "ioc28gk",
            "parent_id": "t1_ioc20ud",
            "score": 1,
            "created_utc": 1663117318.0,
            "replies": [
                {
                    "body": "now 10",
                    "author": "sushibabooshi",
                    "id": "ioc29rj",
                    "parent_id": "t1_ioc28gk",
                    "score": 2,
                    "created_utc": 1663117333.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Rasengan was just too versatile for the story. It was never lethal, it was always as strong as the story required, it almost never drew large amounts of blood, it didn't leave people with burns or lost limbs, and the user was forced to meet opponents head on. \n\nThis meant Naruto had a tool that was perfect for a moralizing protagonist. \n\nHe demonstrates bravery since he can't just stay in the shadows and win through genjutsu. \n\nHe doesn't have to kill his opponents or bear responsibility for maiming them (Kakuzu and white zetsu excepted, except Kakashi stole the kill for Kakuzu and white zetsu seemingly don't bleed or feel pain). \n\nAnd his jutsu is so variable in its effect on targets that it can succeed or fail to do something without people complaining about inconsistency. If the Raikiri somehow failed to pierce a target, we'd want to know how the target survived. But if a rasengan just knocks the wind out of someone, we don't seem to question how the same jutsu that blew up a water tower didn't explode the target's organs.",
            "author": "Justicar-terrae",
            "id": "ioaec9o",
            "parent_id": "t1_ioa625v",
            "score": 76,
            "created_utc": 1663093069.0,
            "replies": [
                {
                    "body": "To add to your point; since Naruto never intends to kill someone, maybe the power was never 100% on the Rasengan. \n\nAlso - Naruto has *killed* \"people\" with his signature move. However, it seems like these characters were more spiritually controlled (non-human) or monsters. Like that one red hair spirit thing that controlled one of the former temple guardians.",
                    "author": "I_C_Weiner__",
                    "id": "ioafqvq",
                    "parent_id": "t1_ioaec9o",
                    "score": 36,
                    "created_utc": 1663093620.0,
                    "replies": [
                        {
                            "body": "He only killed Yura though. Nobody else.",
                            "author": null,
                            "id": "ioahde8",
                            "parent_id": "t1_ioafqvq",
                            "score": 11,
                            "created_utc": 1663094253.0,
                            "replies": [
                                {
                                    "body": "What about Fuka- technically it was floating hair and a spirit?",
                                    "author": "I_C_Weiner__",
                                    "id": "ioelowl",
                                    "parent_id": "t1_ioahde8",
                                    "score": 3,
                                    "created_utc": 1663168116.0,
                                    "replies": [
                                        {
                                            "body": "Isn't she filler?",
                                            "author": null,
                                            "id": "ioembdc",
                                            "parent_id": "t1_ioelowl",
                                            "score": 2,
                                            "created_utc": 1663168354.0,
                                            "replies": [
                                                {
                                                    "body": "Yes",
                                                    "author": "I_C_Weiner__",
                                                    "id": "ioeorqz",
                                                    "parent_id": "t1_ioembdc",
                                                    "score": 2,
                                                    "created_utc": 1663169283.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Yeah but that \"Rasenshuriken\" is one of the most lethal one-hit kill moves in the franchise.",
                    "author": "BigBadDogIV",
                    "id": "iob6099",
                    "parent_id": "t1_ioaec9o",
                    "score": 10,
                    "created_utc": 1663103489.0,
                    "replies": [
                        {
                            "body": "It's strong, but not really all that lethal in the series. It mortally wounds one non-zetsu living person, Kakuzu, and that person is left alive long enough for Kakashi to steal the kill. Every other time we see a rasenshuriken take out a target, that target is either a white zetsu or a corpse being remotely controlled by Nagato. \n\nThe move is powerful, sure. But it has a much lower kill count than, say, raikiri/chidori. And we see plenty of lethal one-hit abilities in the show, even if they rarely actually work because they were used against targets with even more ridiculous abilities. Take particle style for example. It immediately deletes anything caught inside it's shape, and the shape can be quite massive. The only reason Sasuke survived is because he was pulled out of it by a third party who could move through walls; and the only reason Madara survived is because he was an edo tensei summon at the time. In the show, not sure about the manga, Asuma disintegrates an entire squad of three shinobi with a single blast of fire style. Sasori and Hanzo use poisons that one-shot anyone unless they get treated with antidotes; and very few people can make the antidotes. Kaguya's bones one-shot anyone they touch. Amaterasu always kills unless the user turns off the fire or the target sheds the part of their body that is ablaze. Kakashi can send chunks of a target into the kamui dimension if he gets close enough and has enough chakra; he could warp away a target's head and immediately kill them. And there are abilities like the water bullet that will punch right through a person unless blocked with a strong enough technique.",
                            "author": "Justicar-terrae",
                            "id": "ioci6pu",
                            "parent_id": "t1_iob6099",
                            "score": 9,
                            "created_utc": 1663124547.0,
                            "replies": [
                                {
                                    "body": ">It's strong, but not really all that lethal in the series.\n\nIt's an interesting caveat to say \"in the series\". You're right to point out it wasn't used to kill many, if any characters. But this more has to do with the writing around Naruto's character than the lethality of the Rasenshuriken.\n\n>It mortally wounds one non-zetsu living person, Kakuzu, and that person is left alive long enough for Kakashi to steal the kill.\n\nPersonally, I don't have a lot of issues with the writing in Naruto (a lot of people will disagree with me on this but that's them) but this is one of my biggest ones. There is no way Kakuzu should have still been alive at all after getting hit with the Rasenshuriken. Yes, technically it killed him like four or five times over but he still had enough life left afterwards that Musashi Kishimoto could conveniently have someone other than Naruto kill him the final time. But we know that's bullshit from Tsunade's explanation of the Rasenshuriken. He should have been killed at least thousands of times over due to the extreme level of thoroughness with which the Rasenshuriken shreds things. It shreds so thoroughly that even all the individual molecules get shredded as well. There's no way that Kakuzu should have only died four or five times from that.\n\n>The move is powerful, sure. But it has a much lower kill count than, say, raikiri/chidori. And we see plenty of lethal one-hit abilities in the show, even if they rarely actually work because they were used against targets with even more ridiculous abilities. Take particle style for example. It immediately deletes anything caught inside it's shape, and the shape can be quite massive. The only reason Sasuke survived is because he was pulled out of it by a third party who could move through walls; and the only reason Madara survived is because he was an edo tensei summon at the time. In the show, not sure about the manga, Asuma disintegrates an entire squad of three shinobi with a single blast of fire style. Sasori and Hanzo use poisons that one-shot anyone unless they get treated with antidotes; and very few people can make the antidotes. Kaguya's bones one-shot anyone they touch. Amaterasu always kills unless the user turns off the fire or the target sheds the part of their body that is ablaze. Kakashi can send chunks of a target into the kamui dimension if he gets close enough and has enough chakra; he could warp away a target's head and immediately kill them. And there are abilities like the water bullet that will punch right through a person unless blocked with a strong enough technique.\n\nThis is a good point. I forgot just how many different one-hit kill moves there is in Naruto. For some reason I was only thinking of Amaterasu and Rasenshuriken (probably because those are the two one-hit kill moves used by Sasuke and Naruto). Rasenshuriken is still definitely a one-hit kill move that normal characters should not be capable of surviving, but there's definitely a lot of other one-hit kill moves that are equal to or greater than Rasenshuriken in their lethality.",
                                    "author": "BigBadDogIV",
                                    "id": "ioezoqv",
                                    "parent_id": "t1_ioci6pu",
                                    "score": 4,
                                    "created_utc": 1663173410.0,
                                    "replies": [
                                        {
                                            "body": "You're right that rasenshuriken is still a great move, I don't want to completely downplay it. It's got power and, eventually, adaptability with all the element combinations Naruto learned from the tailed beasts. It also scales up decently well, able to cut through a god tree pretty easily (once boosted by war arc amps). But it doesn't do anything that particle style can't do, it can't seal or trap unkillable enemies like Gaara's sand or Sai's paint or Obito/Kakashi's kamui, and its one-shot power against humans isn't top tier (though it's still high tier, especially at series end). \n\nOne thing I'll definitely grant to rasenshuriken is ease of use once mastered. There are several other supposedly awesome abilities that kinda suck from a practical aspect. Three of the Sage's tools, for example, only work when used together and are stupidly complex. Plus if you can bop someone with the rope tool you could just as easily cut them with a sword or other weapon, skipping all the word-game nonsense. Several of the Ninja Swords of the Mist are similarly underwhelming, like Helmet Splitter or the Executioner Sword, both of which offer minor advantages in exchange for being cumbersome. Hidan's ritual requires tons of setup. Truth Seeker Orbs are strong but nowhere near as strong as they are implied to be, and you need to go through tons of steps to unlock them. Half of Pain's abilities also seem overly complex or of little value in a fight, like the Asura Path (basically just a pointy guy with fancy paper bombs), Human Path (can't do anything without grabbing your head first), and Animal Path (doesn't do shit after the animals are summoned). \n\nAnd plenty of other one-shot abilities are locked behind special eyeballs or genetics, sometimes with soft caps on how much they can be used (soft caps because you can get around MS caps by unlocking EMS). Rasenshuriken can theoretically be learned by anyone with enough practice, patience, and chakra. So even though Naruto still gets hax power-ups because of his bloodline, he still has an \"everyman\" jutsu that he earned rather than one he unlocked through birth.",
                                            "author": "Justicar-terrae",
                                            "id": "iof47ku",
                                            "parent_id": "t1_ioezoqv",
                                            "score": 3,
                                            "created_utc": 1663175122.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "All he did was \"Make it bigger\" \"Make it curvy\" with Jiraiya for 2 years and trained hard to do that. Respects from Konohamaru 😅",
            "author": "Crazykwan0",
            "id": "ioae5d9",
            "parent_id": "t1_ioa625v",
            "score": 19,
            "created_utc": 1663092991.0,
            "replies": []
        },
        {
            "body": "Naruto used Kyuubi chakra regularly though. And he was a better and smarter fighter",
            "author": "Kgb725",
            "id": "iob7rgf",
            "parent_id": "t1_ioa625v",
            "score": 4,
            "created_utc": 1663104169.0,
            "replies": []
        },
        {
            "body": "What about Lee",
            "author": "Few_Pay_5313",
            "id": "iocjj1h",
            "parent_id": "t1_ioa625v",
            "score": 4,
            "created_utc": 1663125225.0,
            "replies": []
        },
        {
            "body": "What are you saying, bro? Kakashi? You sure about that?🗿\n\nBecause I don’t ever remember Kakashi using his arsenal of over 1000 Jutsus aside from [Chidori/Raikiri→Some varient of that sh-t/Mud wall/Great fireball(that one wasn’t even in a serious fight, it was against his student on 2nd bell test/Water dragon(also against his student)].\n\nOr ever using his Sharingan to copy Jutsus which he did only once at the start of the series. Maybe some more like 2 or 3 that I forget, because they weren’t impactful enough. Like they call him \"Copy Ninja Hatake Kakashi of the Sharingan\", they keep rubbing it on our face but they nearly never show sh-t to prove their point.\n\nOr even knowing about his family like his dad, talking about some big let down. We only know his name and that he was as strong as the Three Legendary Sanin. And no, we’re not gonna talk about his mom.\n\nI don’t remember Kakashi winning that much of fight alone like Naruto or Sasuke.\n\nI don’t think they were fair with him either. They didn’t explore his full potential either, surely not as much as someone like Sai but they *cleary* could have done better with Kakashi.\n\nSo it’s more like:\n\n\"Story of every character that isn’t Naruto or Sasuke\"\n\nBecause Naruto and Sasuke were the real focus until the very end. Practically everything revolves around Naruto and Sasuke. It’s always Naruto and Sasuke. Like them being some little Jesus Ninjas. Do you remember Kakashi being some little Jesus Ninja? Because I surely don’t.\n\nOFC I get that they are the MCs so that’s normal, but still, it doesn’t feel right. They did all of Naruto’s side characters so dirty. **All of them.**\n\n\n*Literally.*",
            "author": "Safe-Form-3263",
            "id": "iocbfqy",
            "parent_id": "t1_iobhw41",
            "score": 2,
            "created_utc": 1663121391.0,
            "replies": [
                {
                    "body": "I was mainly referring to his kamui hax he had during the war arc, where he was spamming it constantly without getting exhausted, before Madara stole it. There's also him charging off to fight the tailed beasts with Guy. Then there wad the hax Susanno he had when fighting Kaguya. While he did eventually lose those abilities he wad keeping up when he had them. Kakashi also has a very developed backstop that's connected to one of the main villains, which is why he so developed.",
                    "author": "infamusforever223",
                    "id": "iocgv4q",
                    "parent_id": "t1_iocbfqy",
                    "score": 1,
                    "created_utc": 1663123899.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I agree, he might’ve been a dick but he was an insanely good public speaker.",
            "author": "HandsyGymTeacher",
            "id": "ioawthr",
            "parent_id": "t1_ioaek82",
            "score": 4,
            "created_utc": 1663100038.0,
            "replies": []
        },
        {
            "body": "I hope so or else it would be a waste of his power. Let's just say you got his power would you fuck your shadow clones?",
            "author": "HalfAsFunny",
            "id": "iocpgqc",
            "parent_id": "t1_iocnnm7",
            "score": 2,
            "created_utc": 1663128271.0,
            "replies": [
                {
                    "body": "Remember, you inherit your clone's memories after they disappear. I don't particularly want to inherit my clone's memory of getting penetrated.",
                    "author": null,
                    "id": "iocpoqh",
                    "parent_id": "t1_iocpgqc",
                    "score": 2,
                    "created_utc": 1663128373.0,
                    "replies": [
                        {
                            "body": "But there has to be a technique that can erase/block memories right",
                            "author": "HalfAsFunny",
                            "id": "iocqcvn",
                            "parent_id": "t1_iocpoqh",
                            "score": 2,
                            "created_utc": 1663128750.0,
                            "replies": [
                                {
                                    "body": "Not everyone's lucky enough to be a genjutsu type or be close with a genjutsu type. You could get a yamanaka clan member to do it, but they'd also see the memory themselves...",
                                    "author": null,
                                    "id": "iocqitd",
                                    "parent_id": "t1_iocqcvn",
                                    "score": 2,
                                    "created_utc": 1663128846.0,
                                    "replies": [
                                        {
                                            "body": "Let them fuck the clones too man 🤣🤣",
                                            "author": "HalfAsFunny",
                                            "id": "ioct7d5",
                                            "parent_id": "t1_iocqitd",
                                            "score": 1,
                                            "created_utc": 1663130335.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "now 10",
            "author": "sushibabooshi",
            "id": "ioc29rj",
            "parent_id": "t1_ioc28gk",
            "score": 2,
            "created_utc": 1663117333.0,
            "replies": []
        },
        {
            "body": "To add to your point; since Naruto never intends to kill someone, maybe the power was never 100% on the Rasengan. \n\nAlso - Naruto has *killed* \"people\" with his signature move. However, it seems like these characters were more spiritually controlled (non-human) or monsters. Like that one red hair spirit thing that controlled one of the former temple guardians.",
            "author": "I_C_Weiner__",
            "id": "ioafqvq",
            "parent_id": "t1_ioaec9o",
            "score": 36,
            "created_utc": 1663093620.0,
            "replies": [
                {
                    "body": "He only killed Yura though. Nobody else.",
                    "author": null,
                    "id": "ioahde8",
                    "parent_id": "t1_ioafqvq",
                    "score": 11,
                    "created_utc": 1663094253.0,
                    "replies": [
                        {
                            "body": "What about Fuka- technically it was floating hair and a spirit?",
                            "author": "I_C_Weiner__",
                            "id": "ioelowl",
                            "parent_id": "t1_ioahde8",
                            "score": 3,
                            "created_utc": 1663168116.0,
                            "replies": [
                                {
                                    "body": "Isn't she filler?",
                                    "author": null,
                                    "id": "ioembdc",
                                    "parent_id": "t1_ioelowl",
                                    "score": 2,
                                    "created_utc": 1663168354.0,
                                    "replies": [
                                        {
                                            "body": "Yes",
                                            "author": "I_C_Weiner__",
                                            "id": "ioeorqz",
                                            "parent_id": "t1_ioembdc",
                                            "score": 2,
                                            "created_utc": 1663169283.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yeah but that \"Rasenshuriken\" is one of the most lethal one-hit kill moves in the franchise.",
            "author": "BigBadDogIV",
            "id": "iob6099",
            "parent_id": "t1_ioaec9o",
            "score": 10,
            "created_utc": 1663103489.0,
            "replies": [
                {
                    "body": "It's strong, but not really all that lethal in the series. It mortally wounds one non-zetsu living person, Kakuzu, and that person is left alive long enough for Kakashi to steal the kill. Every other time we see a rasenshuriken take out a target, that target is either a white zetsu or a corpse being remotely controlled by Nagato. \n\nThe move is powerful, sure. But it has a much lower kill count than, say, raikiri/chidori. And we see plenty of lethal one-hit abilities in the show, even if they rarely actually work because they were used against targets with even more ridiculous abilities. Take particle style for example. It immediately deletes anything caught inside it's shape, and the shape can be quite massive. The only reason Sasuke survived is because he was pulled out of it by a third party who could move through walls; and the only reason Madara survived is because he was an edo tensei summon at the time. In the show, not sure about the manga, Asuma disintegrates an entire squad of three shinobi with a single blast of fire style. Sasori and Hanzo use poisons that one-shot anyone unless they get treated with antidotes; and very few people can make the antidotes. Kaguya's bones one-shot anyone they touch. Amaterasu always kills unless the user turns off the fire or the target sheds the part of their body that is ablaze. Kakashi can send chunks of a target into the kamui dimension if he gets close enough and has enough chakra; he could warp away a target's head and immediately kill them. And there are abilities like the water bullet that will punch right through a person unless blocked with a strong enough technique.",
                    "author": "Justicar-terrae",
                    "id": "ioci6pu",
                    "parent_id": "t1_iob6099",
                    "score": 9,
                    "created_utc": 1663124547.0,
                    "replies": [
                        {
                            "body": ">It's strong, but not really all that lethal in the series.\n\nIt's an interesting caveat to say \"in the series\". You're right to point out it wasn't used to kill many, if any characters. But this more has to do with the writing around Naruto's character than the lethality of the Rasenshuriken.\n\n>It mortally wounds one non-zetsu living person, Kakuzu, and that person is left alive long enough for Kakashi to steal the kill.\n\nPersonally, I don't have a lot of issues with the writing in Naruto (a lot of people will disagree with me on this but that's them) but this is one of my biggest ones. There is no way Kakuzu should have still been alive at all after getting hit with the Rasenshuriken. Yes, technically it killed him like four or five times over but he still had enough life left afterwards that Musashi Kishimoto could conveniently have someone other than Naruto kill him the final time. But we know that's bullshit from Tsunade's explanation of the Rasenshuriken. He should have been killed at least thousands of times over due to the extreme level of thoroughness with which the Rasenshuriken shreds things. It shreds so thoroughly that even all the individual molecules get shredded as well. There's no way that Kakuzu should have only died four or five times from that.\n\n>The move is powerful, sure. But it has a much lower kill count than, say, raikiri/chidori. And we see plenty of lethal one-hit abilities in the show, even if they rarely actually work because they were used against targets with even more ridiculous abilities. Take particle style for example. It immediately deletes anything caught inside it's shape, and the shape can be quite massive. The only reason Sasuke survived is because he was pulled out of it by a third party who could move through walls; and the only reason Madara survived is because he was an edo tensei summon at the time. In the show, not sure about the manga, Asuma disintegrates an entire squad of three shinobi with a single blast of fire style. Sasori and Hanzo use poisons that one-shot anyone unless they get treated with antidotes; and very few people can make the antidotes. Kaguya's bones one-shot anyone they touch. Amaterasu always kills unless the user turns off the fire or the target sheds the part of their body that is ablaze. Kakashi can send chunks of a target into the kamui dimension if he gets close enough and has enough chakra; he could warp away a target's head and immediately kill them. And there are abilities like the water bullet that will punch right through a person unless blocked with a strong enough technique.\n\nThis is a good point. I forgot just how many different one-hit kill moves there is in Naruto. For some reason I was only thinking of Amaterasu and Rasenshuriken (probably because those are the two one-hit kill moves used by Sasuke and Naruto). Rasenshuriken is still definitely a one-hit kill move that normal characters should not be capable of surviving, but there's definitely a lot of other one-hit kill moves that are equal to or greater than Rasenshuriken in their lethality.",
                            "author": "BigBadDogIV",
                            "id": "ioezoqv",
                            "parent_id": "t1_ioci6pu",
                            "score": 4,
                            "created_utc": 1663173410.0,
                            "replies": [
                                {
                                    "body": "You're right that rasenshuriken is still a great move, I don't want to completely downplay it. It's got power and, eventually, adaptability with all the element combinations Naruto learned from the tailed beasts. It also scales up decently well, able to cut through a god tree pretty easily (once boosted by war arc amps). But it doesn't do anything that particle style can't do, it can't seal or trap unkillable enemies like Gaara's sand or Sai's paint or Obito/Kakashi's kamui, and its one-shot power against humans isn't top tier (though it's still high tier, especially at series end). \n\nOne thing I'll definitely grant to rasenshuriken is ease of use once mastered. There are several other supposedly awesome abilities that kinda suck from a practical aspect. Three of the Sage's tools, for example, only work when used together and are stupidly complex. Plus if you can bop someone with the rope tool you could just as easily cut them with a sword or other weapon, skipping all the word-game nonsense. Several of the Ninja Swords of the Mist are similarly underwhelming, like Helmet Splitter or the Executioner Sword, both of which offer minor advantages in exchange for being cumbersome. Hidan's ritual requires tons of setup. Truth Seeker Orbs are strong but nowhere near as strong as they are implied to be, and you need to go through tons of steps to unlock them. Half of Pain's abilities also seem overly complex or of little value in a fight, like the Asura Path (basically just a pointy guy with fancy paper bombs), Human Path (can't do anything without grabbing your head first), and Animal Path (doesn't do shit after the animals are summoned). \n\nAnd plenty of other one-shot abilities are locked behind special eyeballs or genetics, sometimes with soft caps on how much they can be used (soft caps because you can get around MS caps by unlocking EMS). Rasenshuriken can theoretically be learned by anyone with enough practice, patience, and chakra. So even though Naruto still gets hax power-ups because of his bloodline, he still has an \"everyman\" jutsu that he earned rather than one he unlocked through birth.",
                                    "author": "Justicar-terrae",
                                    "id": "iof47ku",
                                    "parent_id": "t1_ioezoqv",
                                    "score": 3,
                                    "created_utc": 1663175122.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I was mainly referring to his kamui hax he had during the war arc, where he was spamming it constantly without getting exhausted, before Madara stole it. There's also him charging off to fight the tailed beasts with Guy. Then there wad the hax Susanno he had when fighting Kaguya. While he did eventually lose those abilities he wad keeping up when he had them. Kakashi also has a very developed backstop that's connected to one of the main villains, which is why he so developed.",
            "author": "infamusforever223",
            "id": "iocgv4q",
            "parent_id": "t1_iocbfqy",
            "score": 1,
            "created_utc": 1663123899.0,
            "replies": []
        },
        {
            "body": "Remember, you inherit your clone's memories after they disappear. I don't particularly want to inherit my clone's memory of getting penetrated.",
            "author": null,
            "id": "iocpoqh",
            "parent_id": "t1_iocpgqc",
            "score": 2,
            "created_utc": 1663128373.0,
            "replies": [
                {
                    "body": "But there has to be a technique that can erase/block memories right",
                    "author": "HalfAsFunny",
                    "id": "iocqcvn",
                    "parent_id": "t1_iocpoqh",
                    "score": 2,
                    "created_utc": 1663128750.0,
                    "replies": [
                        {
                            "body": "Not everyone's lucky enough to be a genjutsu type or be close with a genjutsu type. You could get a yamanaka clan member to do it, but they'd also see the memory themselves...",
                            "author": null,
                            "id": "iocqitd",
                            "parent_id": "t1_iocqcvn",
                            "score": 2,
                            "created_utc": 1663128846.0,
                            "replies": [
                                {
                                    "body": "Let them fuck the clones too man 🤣🤣",
                                    "author": "HalfAsFunny",
                                    "id": "ioct7d5",
                                    "parent_id": "t1_iocqitd",
                                    "score": 1,
                                    "created_utc": 1663130335.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "He only killed Yura though. Nobody else.",
            "author": null,
            "id": "ioahde8",
            "parent_id": "t1_ioafqvq",
            "score": 11,
            "created_utc": 1663094253.0,
            "replies": [
                {
                    "body": "What about Fuka- technically it was floating hair and a spirit?",
                    "author": "I_C_Weiner__",
                    "id": "ioelowl",
                    "parent_id": "t1_ioahde8",
                    "score": 3,
                    "created_utc": 1663168116.0,
                    "replies": [
                        {
                            "body": "Isn't she filler?",
                            "author": null,
                            "id": "ioembdc",
                            "parent_id": "t1_ioelowl",
                            "score": 2,
                            "created_utc": 1663168354.0,
                            "replies": [
                                {
                                    "body": "Yes",
                                    "author": "I_C_Weiner__",
                                    "id": "ioeorqz",
                                    "parent_id": "t1_ioembdc",
                                    "score": 2,
                                    "created_utc": 1663169283.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "It's strong, but not really all that lethal in the series. It mortally wounds one non-zetsu living person, Kakuzu, and that person is left alive long enough for Kakashi to steal the kill. Every other time we see a rasenshuriken take out a target, that target is either a white zetsu or a corpse being remotely controlled by Nagato. \n\nThe move is powerful, sure. But it has a much lower kill count than, say, raikiri/chidori. And we see plenty of lethal one-hit abilities in the show, even if they rarely actually work because they were used against targets with even more ridiculous abilities. Take particle style for example. It immediately deletes anything caught inside it's shape, and the shape can be quite massive. The only reason Sasuke survived is because he was pulled out of it by a third party who could move through walls; and the only reason Madara survived is because he was an edo tensei summon at the time. In the show, not sure about the manga, Asuma disintegrates an entire squad of three shinobi with a single blast of fire style. Sasori and Hanzo use poisons that one-shot anyone unless they get treated with antidotes; and very few people can make the antidotes. Kaguya's bones one-shot anyone they touch. Amaterasu always kills unless the user turns off the fire or the target sheds the part of their body that is ablaze. Kakashi can send chunks of a target into the kamui dimension if he gets close enough and has enough chakra; he could warp away a target's head and immediately kill them. And there are abilities like the water bullet that will punch right through a person unless blocked with a strong enough technique.",
            "author": "Justicar-terrae",
            "id": "ioci6pu",
            "parent_id": "t1_iob6099",
            "score": 9,
            "created_utc": 1663124547.0,
            "replies": [
                {
                    "body": ">It's strong, but not really all that lethal in the series.\n\nIt's an interesting caveat to say \"in the series\". You're right to point out it wasn't used to kill many, if any characters. But this more has to do with the writing around Naruto's character than the lethality of the Rasenshuriken.\n\n>It mortally wounds one non-zetsu living person, Kakuzu, and that person is left alive long enough for Kakashi to steal the kill.\n\nPersonally, I don't have a lot of issues with the writing in Naruto (a lot of people will disagree with me on this but that's them) but this is one of my biggest ones. There is no way Kakuzu should have still been alive at all after getting hit with the Rasenshuriken. Yes, technically it killed him like four or five times over but he still had enough life left afterwards that Musashi Kishimoto could conveniently have someone other than Naruto kill him the final time. But we know that's bullshit from Tsunade's explanation of the Rasenshuriken. He should have been killed at least thousands of times over due to the extreme level of thoroughness with which the Rasenshuriken shreds things. It shreds so thoroughly that even all the individual molecules get shredded as well. There's no way that Kakuzu should have only died four or five times from that.\n\n>The move is powerful, sure. But it has a much lower kill count than, say, raikiri/chidori. And we see plenty of lethal one-hit abilities in the show, even if they rarely actually work because they were used against targets with even more ridiculous abilities. Take particle style for example. It immediately deletes anything caught inside it's shape, and the shape can be quite massive. The only reason Sasuke survived is because he was pulled out of it by a third party who could move through walls; and the only reason Madara survived is because he was an edo tensei summon at the time. In the show, not sure about the manga, Asuma disintegrates an entire squad of three shinobi with a single blast of fire style. Sasori and Hanzo use poisons that one-shot anyone unless they get treated with antidotes; and very few people can make the antidotes. Kaguya's bones one-shot anyone they touch. Amaterasu always kills unless the user turns off the fire or the target sheds the part of their body that is ablaze. Kakashi can send chunks of a target into the kamui dimension if he gets close enough and has enough chakra; he could warp away a target's head and immediately kill them. And there are abilities like the water bullet that will punch right through a person unless blocked with a strong enough technique.\n\nThis is a good point. I forgot just how many different one-hit kill moves there is in Naruto. For some reason I was only thinking of Amaterasu and Rasenshuriken (probably because those are the two one-hit kill moves used by Sasuke and Naruto). Rasenshuriken is still definitely a one-hit kill move that normal characters should not be capable of surviving, but there's definitely a lot of other one-hit kill moves that are equal to or greater than Rasenshuriken in their lethality.",
                    "author": "BigBadDogIV",
                    "id": "ioezoqv",
                    "parent_id": "t1_ioci6pu",
                    "score": 4,
                    "created_utc": 1663173410.0,
                    "replies": [
                        {
                            "body": "You're right that rasenshuriken is still a great move, I don't want to completely downplay it. It's got power and, eventually, adaptability with all the element combinations Naruto learned from the tailed beasts. It also scales up decently well, able to cut through a god tree pretty easily (once boosted by war arc amps). But it doesn't do anything that particle style can't do, it can't seal or trap unkillable enemies like Gaara's sand or Sai's paint or Obito/Kakashi's kamui, and its one-shot power against humans isn't top tier (though it's still high tier, especially at series end). \n\nOne thing I'll definitely grant to rasenshuriken is ease of use once mastered. There are several other supposedly awesome abilities that kinda suck from a practical aspect. Three of the Sage's tools, for example, only work when used together and are stupidly complex. Plus if you can bop someone with the rope tool you could just as easily cut them with a sword or other weapon, skipping all the word-game nonsense. Several of the Ninja Swords of the Mist are similarly underwhelming, like Helmet Splitter or the Executioner Sword, both of which offer minor advantages in exchange for being cumbersome. Hidan's ritual requires tons of setup. Truth Seeker Orbs are strong but nowhere near as strong as they are implied to be, and you need to go through tons of steps to unlock them. Half of Pain's abilities also seem overly complex or of little value in a fight, like the Asura Path (basically just a pointy guy with fancy paper bombs), Human Path (can't do anything without grabbing your head first), and Animal Path (doesn't do shit after the animals are summoned). \n\nAnd plenty of other one-shot abilities are locked behind special eyeballs or genetics, sometimes with soft caps on how much they can be used (soft caps because you can get around MS caps by unlocking EMS). Rasenshuriken can theoretically be learned by anyone with enough practice, patience, and chakra. So even though Naruto still gets hax power-ups because of his bloodline, he still has an \"everyman\" jutsu that he earned rather than one he unlocked through birth.",
                            "author": "Justicar-terrae",
                            "id": "iof47ku",
                            "parent_id": "t1_ioezoqv",
                            "score": 3,
                            "created_utc": 1663175122.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "But there has to be a technique that can erase/block memories right",
            "author": "HalfAsFunny",
            "id": "iocqcvn",
            "parent_id": "t1_iocpoqh",
            "score": 2,
            "created_utc": 1663128750.0,
            "replies": [
                {
                    "body": "Not everyone's lucky enough to be a genjutsu type or be close with a genjutsu type. You could get a yamanaka clan member to do it, but they'd also see the memory themselves...",
                    "author": null,
                    "id": "iocqitd",
                    "parent_id": "t1_iocqcvn",
                    "score": 2,
                    "created_utc": 1663128846.0,
                    "replies": [
                        {
                            "body": "Let them fuck the clones too man 🤣🤣",
                            "author": "HalfAsFunny",
                            "id": "ioct7d5",
                            "parent_id": "t1_iocqitd",
                            "score": 1,
                            "created_utc": 1663130335.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "What about Fuka- technically it was floating hair and a spirit?",
            "author": "I_C_Weiner__",
            "id": "ioelowl",
            "parent_id": "t1_ioahde8",
            "score": 3,
            "created_utc": 1663168116.0,
            "replies": [
                {
                    "body": "Isn't she filler?",
                    "author": null,
                    "id": "ioembdc",
                    "parent_id": "t1_ioelowl",
                    "score": 2,
                    "created_utc": 1663168354.0,
                    "replies": [
                        {
                            "body": "Yes",
                            "author": "I_C_Weiner__",
                            "id": "ioeorqz",
                            "parent_id": "t1_ioembdc",
                            "score": 2,
                            "created_utc": 1663169283.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": ">It's strong, but not really all that lethal in the series.\n\nIt's an interesting caveat to say \"in the series\". You're right to point out it wasn't used to kill many, if any characters. But this more has to do with the writing around Naruto's character than the lethality of the Rasenshuriken.\n\n>It mortally wounds one non-zetsu living person, Kakuzu, and that person is left alive long enough for Kakashi to steal the kill.\n\nPersonally, I don't have a lot of issues with the writing in Naruto (a lot of people will disagree with me on this but that's them) but this is one of my biggest ones. There is no way Kakuzu should have still been alive at all after getting hit with the Rasenshuriken. Yes, technically it killed him like four or five times over but he still had enough life left afterwards that Musashi Kishimoto could conveniently have someone other than Naruto kill him the final time. But we know that's bullshit from Tsunade's explanation of the Rasenshuriken. He should have been killed at least thousands of times over due to the extreme level of thoroughness with which the Rasenshuriken shreds things. It shreds so thoroughly that even all the individual molecules get shredded as well. There's no way that Kakuzu should have only died four or five times from that.\n\n>The move is powerful, sure. But it has a much lower kill count than, say, raikiri/chidori. And we see plenty of lethal one-hit abilities in the show, even if they rarely actually work because they were used against targets with even more ridiculous abilities. Take particle style for example. It immediately deletes anything caught inside it's shape, and the shape can be quite massive. The only reason Sasuke survived is because he was pulled out of it by a third party who could move through walls; and the only reason Madara survived is because he was an edo tensei summon at the time. In the show, not sure about the manga, Asuma disintegrates an entire squad of three shinobi with a single blast of fire style. Sasori and Hanzo use poisons that one-shot anyone unless they get treated with antidotes; and very few people can make the antidotes. Kaguya's bones one-shot anyone they touch. Amaterasu always kills unless the user turns off the fire or the target sheds the part of their body that is ablaze. Kakashi can send chunks of a target into the kamui dimension if he gets close enough and has enough chakra; he could warp away a target's head and immediately kill them. And there are abilities like the water bullet that will punch right through a person unless blocked with a strong enough technique.\n\nThis is a good point. I forgot just how many different one-hit kill moves there is in Naruto. For some reason I was only thinking of Amaterasu and Rasenshuriken (probably because those are the two one-hit kill moves used by Sasuke and Naruto). Rasenshuriken is still definitely a one-hit kill move that normal characters should not be capable of surviving, but there's definitely a lot of other one-hit kill moves that are equal to or greater than Rasenshuriken in their lethality.",
            "author": "BigBadDogIV",
            "id": "ioezoqv",
            "parent_id": "t1_ioci6pu",
            "score": 4,
            "created_utc": 1663173410.0,
            "replies": [
                {
                    "body": "You're right that rasenshuriken is still a great move, I don't want to completely downplay it. It's got power and, eventually, adaptability with all the element combinations Naruto learned from the tailed beasts. It also scales up decently well, able to cut through a god tree pretty easily (once boosted by war arc amps). But it doesn't do anything that particle style can't do, it can't seal or trap unkillable enemies like Gaara's sand or Sai's paint or Obito/Kakashi's kamui, and its one-shot power against humans isn't top tier (though it's still high tier, especially at series end). \n\nOne thing I'll definitely grant to rasenshuriken is ease of use once mastered. There are several other supposedly awesome abilities that kinda suck from a practical aspect. Three of the Sage's tools, for example, only work when used together and are stupidly complex. Plus if you can bop someone with the rope tool you could just as easily cut them with a sword or other weapon, skipping all the word-game nonsense. Several of the Ninja Swords of the Mist are similarly underwhelming, like Helmet Splitter or the Executioner Sword, both of which offer minor advantages in exchange for being cumbersome. Hidan's ritual requires tons of setup. Truth Seeker Orbs are strong but nowhere near as strong as they are implied to be, and you need to go through tons of steps to unlock them. Half of Pain's abilities also seem overly complex or of little value in a fight, like the Asura Path (basically just a pointy guy with fancy paper bombs), Human Path (can't do anything without grabbing your head first), and Animal Path (doesn't do shit after the animals are summoned). \n\nAnd plenty of other one-shot abilities are locked behind special eyeballs or genetics, sometimes with soft caps on how much they can be used (soft caps because you can get around MS caps by unlocking EMS). Rasenshuriken can theoretically be learned by anyone with enough practice, patience, and chakra. So even though Naruto still gets hax power-ups because of his bloodline, he still has an \"everyman\" jutsu that he earned rather than one he unlocked through birth.",
                    "author": "Justicar-terrae",
                    "id": "iof47ku",
                    "parent_id": "t1_ioezoqv",
                    "score": 3,
                    "created_utc": 1663175122.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Not everyone's lucky enough to be a genjutsu type or be close with a genjutsu type. You could get a yamanaka clan member to do it, but they'd also see the memory themselves...",
            "author": null,
            "id": "iocqitd",
            "parent_id": "t1_iocqcvn",
            "score": 2,
            "created_utc": 1663128846.0,
            "replies": [
                {
                    "body": "Let them fuck the clones too man 🤣🤣",
                    "author": "HalfAsFunny",
                    "id": "ioct7d5",
                    "parent_id": "t1_iocqitd",
                    "score": 1,
                    "created_utc": 1663130335.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Isn't she filler?",
            "author": null,
            "id": "ioembdc",
            "parent_id": "t1_ioelowl",
            "score": 2,
            "created_utc": 1663168354.0,
            "replies": [
                {
                    "body": "Yes",
                    "author": "I_C_Weiner__",
                    "id": "ioeorqz",
                    "parent_id": "t1_ioembdc",
                    "score": 2,
                    "created_utc": 1663169283.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "You're right that rasenshuriken is still a great move, I don't want to completely downplay it. It's got power and, eventually, adaptability with all the element combinations Naruto learned from the tailed beasts. It also scales up decently well, able to cut through a god tree pretty easily (once boosted by war arc amps). But it doesn't do anything that particle style can't do, it can't seal or trap unkillable enemies like Gaara's sand or Sai's paint or Obito/Kakashi's kamui, and its one-shot power against humans isn't top tier (though it's still high tier, especially at series end). \n\nOne thing I'll definitely grant to rasenshuriken is ease of use once mastered. There are several other supposedly awesome abilities that kinda suck from a practical aspect. Three of the Sage's tools, for example, only work when used together and are stupidly complex. Plus if you can bop someone with the rope tool you could just as easily cut them with a sword or other weapon, skipping all the word-game nonsense. Several of the Ninja Swords of the Mist are similarly underwhelming, like Helmet Splitter or the Executioner Sword, both of which offer minor advantages in exchange for being cumbersome. Hidan's ritual requires tons of setup. Truth Seeker Orbs are strong but nowhere near as strong as they are implied to be, and you need to go through tons of steps to unlock them. Half of Pain's abilities also seem overly complex or of little value in a fight, like the Asura Path (basically just a pointy guy with fancy paper bombs), Human Path (can't do anything without grabbing your head first), and Animal Path (doesn't do shit after the animals are summoned). \n\nAnd plenty of other one-shot abilities are locked behind special eyeballs or genetics, sometimes with soft caps on how much they can be used (soft caps because you can get around MS caps by unlocking EMS). Rasenshuriken can theoretically be learned by anyone with enough practice, patience, and chakra. So even though Naruto still gets hax power-ups because of his bloodline, he still has an \"everyman\" jutsu that he earned rather than one he unlocked through birth.",
            "author": "Justicar-terrae",
            "id": "iof47ku",
            "parent_id": "t1_ioezoqv",
            "score": 3,
            "created_utc": 1663175122.0,
            "replies": []
        },
        {
            "body": "Let them fuck the clones too man 🤣🤣",
            "author": "HalfAsFunny",
            "id": "ioct7d5",
            "parent_id": "t1_iocqitd",
            "score": 1,
            "created_utc": 1663130335.0,
            "replies": []
        },
        {
            "body": "Yes",
            "author": "I_C_Weiner__",
            "id": "ioeorqz",
            "parent_id": "t1_ioembdc",
            "score": 2,
            "created_utc": 1663169283.0,
            "replies": []
        }
    ]
}