{
    "title": "Newbie, would appreciate any tips🙂",
    "post_id": "okzuy9",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/okzuy9/newbie_would_appreciate_any_tips/",
    "author": "Genvieve_delacroix",
    "body": "",
    "url": "https://www.reddit.com/gallery/okzuy9",
    "score": 129,
    "upvote_ratio": 0.97,
    "created_utc": 1626376816.0,
    "num_comments": 67,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "Terrific. I get enough of a hint about your personality to know if I want to message, schedule M&G. You don’t need to write volumes. If you are totally overloaded with messages you can be more specific about what types of guys turn you on.",
            "author": "daddoms",
            "id": "h5bk7hl",
            "parent_id": "t3_okzuy9",
            "score": 31,
            "created_utc": 1626382864.0,
            "replies": []
        },
        {
            "body": "Wow, you’re gorgeous ❤️",
            "author": "SDinChi",
            "id": "h5bhbm5",
            "parent_id": "t3_okzuy9",
            "score": 14,
            "created_utc": 1626381619.0,
            "replies": [
                {
                    "body": "Aww thanks😊",
                    "author": "Genvieve_delacroix",
                    "id": "h5bhvj9",
                    "parent_id": "t1_h5bhbm5",
                    "score": 2,
                    "created_utc": 1626381853.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "You are BEAUTIFUL \n\nThis might not mean a lot, but I'm a woman also attracted to women and if I saw you out and about, I would definitely approach you and ask you to dinner 😂 \n\nGreat profile btw, good luck!",
            "author": "Youllneverguess777",
            "id": "h5gk7ys",
            "parent_id": "t3_okzuy9",
            "score": 14,
            "created_utc": 1626479747.0,
            "replies": []
        },
        {
            "body": "I am an SD who does focus in on the written portion of a profile - and contrary to the advice you have below - I do not see a need for more (you have a concisely written profile) which is not bad. Here are some constructive items for your profile:\n\nPhotos: Overall - terrific. I would omit the one in car. The quality is poor and it adds nothing that other photos do not already show. Now, improvements (although nothing is likely needed) would be a better view of the dazzling smile you show with your pug and a photo of you dressed up for a date.\n\nAbout me: As I said concise. Adding an interest that a date can be build around would be a nice addition - find dining, a cuisine you love, a style of art you enjoy exploring, winetasting, or any of these items you love or would like learning more about.\n\nSeeking: No really actionable suggestions here.",
            "author": "sfwinefan",
            "id": "h5bou6t",
            "parent_id": "t3_okzuy9",
            "score": 17,
            "created_utc": 1626384953.0,
            "replies": [
                {
                    "body": "Thank you for this, really actionable advice🙂. I’ll add the cuisine I enjoy and my love for outdoorsy dates such as hikes etc in my about me to give SDs more to work with. \n\nI was actually iffy on the one in the car so I am glad I am not the only one, I’ll replace it with a picture of me dressed up to go out wearing something classy as you suggested",
                    "author": "Genvieve_delacroix",
                    "id": "h5bufgf",
                    "parent_id": "t1_h5bou6t",
                    "score": 10,
                    "created_utc": 1626387584.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "This profile is pure class 👌🏻 girl you are gorgeous",
            "author": null,
            "id": "h5c3bub",
            "parent_id": "t3_okzuy9",
            "score": 9,
            "created_utc": 1626391979.0,
            "replies": []
        },
        {
            "body": "You are so beautiful! Your profile honestly seems pretty perfect to me. I can’t imagine you’re going to have any trouble.",
            "author": "SaccharineSpice",
            "id": "h5bimu7",
            "parent_id": "t3_okzuy9",
            "score": 13,
            "created_utc": 1626382178.0,
            "replies": [
                {
                    "body": "I thought my “about me” might be a little short especially since some of the SDs in my area seem to write a lot. No change there?",
                    "author": "Genvieve_delacroix",
                    "id": "h5bizx8",
                    "parent_id": "t1_h5bimu7",
                    "score": 2,
                    "created_utc": 1626382334.0,
                    "replies": [
                        {
                            "body": "As one who truly does enjoy reading profiles, sure more would be nice but in truth, you probably don't need much more. You packed a lot of compelling information in a few sentences. For the sapios out there, you have enough to go on with your terrific images and text. Your Seeking is spot on.",
                            "author": "Intrepid_Seeker",
                            "id": "h5bneq5",
                            "parent_id": "t1_h5bizx8",
                            "score": 4,
                            "created_utc": 1626384299.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "At this point we’re at a consensus that most of these profile reviews are just self-promos right?",
            "author": null,
            "id": "h5clksx",
            "parent_id": "t3_okzuy9",
            "score": 14,
            "created_utc": 1626401470.0,
            "replies": [
                {
                    "body": "Are you getting jealous?",
                    "author": "Intelligent-Tone-687",
                    "id": "hc4qols",
                    "parent_id": "t1_h5clksx",
                    "score": 0,
                    "created_utc": 1631151111.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "You'll do fine. :) Just keep the radar up for all the BS artists.\n\nPersonally I'd like to see a little more about what you're looking for - a little more specifics. I realize that's hard for you, since you form those ideals of what you want through experience, to a degree. As others have said, check out the feedback other profile reviews have gotten.\n\nThen again, leaving it open would allow me to message you to find out more details. Fine line to walk...",
            "author": "quietgrey1",
            "id": "h5br0rd",
            "parent_id": "t3_okzuy9",
            "score": 3,
            "created_utc": 1626385967.0,
            "replies": []
        },
        {
            "body": "You are so perfect, it hurts",
            "author": "Teejaynj",
            "id": "h5cnpvl",
            "parent_id": "t3_okzuy9",
            "score": 3,
            "created_utc": 1626402624.0,
            "replies": []
        },
        {
            "body": "Stunningly beautiful, excellent mix of pics, and enough About You that reading it tells me I would enjoy getting to know more. \n\nI wouldn't change anything.",
            "author": "mraspencer",
            "id": "h5cwgc8",
            "parent_id": "t3_okzuy9",
            "score": 3,
            "created_utc": 1626407482.0,
            "replies": []
        },
        {
            "body": "Stoppppppp ✨✨✨✨✨✨❤️❤️❤️❤️❤️❤️❤️",
            "author": "__lolbruh",
            "id": "h5evkgx",
            "parent_id": "t3_okzuy9",
            "score": 3,
            "created_utc": 1626452546.0,
            "replies": []
        },
        {
            "body": "I like it. Just enough of everything. \"Maybe\" at least one full body shot. But I can tell from your picture you are slim. Your profile reads like you're into experiences equally as the finances. I've dealt with sugarbabies like that.  \nEdit. I just saw all your pics. Change Nothing !",
            "author": "southernslick",
            "id": "h5c4li8",
            "parent_id": "t3_okzuy9",
            "score": 2,
            "created_utc": 1626392629.0,
            "replies": []
        },
        {
            "body": "Your pictures are better than than 80% out there. Your hair color is really eye catching.\n\nHowever your writing could use improvement. The sentence s are very long and I had to read them more than once to understand.  Your message seems to be I am ambitious and smart and eager to learn. But you should balance that with, what you can do for me. Like I am quiet but very good listener, or my friends all know the can rely on me in times of need.",
            "author": "kansashog",
            "id": "h5d8980",
            "parent_id": "t3_okzuy9",
            "score": 2,
            "created_utc": 1626415158.0,
            "replies": []
        },
        {
            "body": "Great profile - concise, but it left me wanting to know more about you when I read it, which is the point, right?  Great pics 😍.  As was said above, if you wanted to replace the car pic, maybe good - though it does show a great smile.  Impressive mile pace!\n\nGood luck!",
            "author": null,
            "id": "h5dukuc",
            "parent_id": "t3_okzuy9",
            "score": 2,
            "created_utc": 1626433822.0,
            "replies": []
        },
        {
            "body": "Very beautiful photos and concise, well written profile that shows your personality.  If you were in my area, I would message you in a heart beat.\n\nYou will have no problem getting attention from a wide range of men.  Your challenge will be how to sort through those messages to find the best matches for you.  It will not be to get attention.  Good luck!",
            "author": "willfromvb",
            "id": "h5e308f",
            "parent_id": "t3_okzuy9",
            "score": 2,
            "created_utc": 1626439268.0,
            "replies": []
        },
        {
            "body": "Hello from a fellow DFW'er :)\n\nYour photos are gorgeous enough to make them overlook the simple/short profile I think, haha.  Otherwise, I'd write a bit more on what you love to do, interests, etc.\n\nFor ideas, surf other profile reviews - I've found that helps.",
            "author": "sinvortex",
            "id": "h5bjunw",
            "parent_id": "t3_okzuy9",
            "score": 4,
            "created_utc": 1626382708.0,
            "replies": [
                {
                    "body": "Will surf some of the profile review for sure, thank you!",
                    "author": "Genvieve_delacroix",
                    "id": "h5bl16f",
                    "parent_id": "t1_h5bjunw",
                    "score": 1,
                    "created_utc": 1626383225.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "You’re perfect. Don’t change a thing. I live in texas but not DFW or else I’d message you on seeking :)",
            "author": null,
            "id": "h5bk3wg",
            "parent_id": "t3_okzuy9",
            "score": 3,
            "created_utc": 1626382821.0,
            "replies": []
        },
        {
            "body": "Your text and pics are great but, personally, I find your location to be a real turnoff as it is much too far away.",
            "author": "This_is_Not_My_Handl",
            "id": "h5cxb8n",
            "parent_id": "t3_okzuy9",
            "score": 3,
            "created_utc": 1626407989.0,
            "replies": []
        },
        {
            "body": "If you were in the NY/PH area....wow you are pretty.",
            "author": "rodv66",
            "id": "h5bpe7x",
            "parent_id": "t3_okzuy9",
            "score": 1,
            "created_utc": 1626385213.0,
            "replies": []
        },
        {
            "body": "This is where I disagree when African American SB’s on here say they have a harder time finding a sd due to their race. It’s all about looks, it doesn’t matter if Youre black, white, brown, pink, red. If you are attractive and have a good figure then you will do well in the bowl, period. \n\nThe op is an absolute stunner and I’m sure her seeking and reddit inboxes are blowing up with messages. She should not have any issues finding a sd.",
            "author": null,
            "id": "h5bsgmu",
            "parent_id": "t3_okzuy9",
            "score": 0,
            "created_utc": 1626386640.0,
            "replies": [
                {
                    "body": "I think it’s more about body type than race & the demographics of most SDs (white older men) aren’t interested in body types outside of the typical slim/athletic build but I could be wrong",
                    "author": "Genvieve_delacroix",
                    "id": "h5btgew",
                    "parent_id": "t1_h5bsgmu",
                    "score": 10,
                    "created_utc": 1626387116.0,
                    "replies": [
                        {
                            "body": "Probably very true. As a latino man myself, I personally prefer a slim thic woman :)",
                            "author": null,
                            "id": "h5bw3r8",
                            "parent_id": "t1_h5btgew",
                            "score": 2,
                            "created_utc": 1626388390.0,
                            "replies": []
                        },
                        {
                            "body": "Body type is part of it, background and cultural norms are another.   When they are too far out of alignment it is just too different to connect compared to other options.  Differences not better vs worse.\n\nI passed on petite women with too many background differences but enjoyed more curvy women I connected with on common interests. \n\nYou will do fantastic in DFW.  I was active on SA there for a while and saw the SBs.  You are top 1%.",
                            "author": "TXPolyDaddy",
                            "id": "h5e7m0o",
                            "parent_id": "t1_h5btgew",
                            "score": 1,
                            "created_utc": 1626441773.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "She’s beautiful, but that doesn’t negate the fact that many SD profiles blatantly state “no black women” or they describe the ideal SB “petite blonde”. \n\nAlso, many SDs will send lower allowance rates to women of color because they believe the value is lower as well.\n\nThere’s no need to downplay what black women go through.",
                    "author": "Chawkleeta",
                    "id": "h5eichf",
                    "parent_id": "t1_h5bsgmu",
                    "score": 6,
                    "created_utc": 1626446895.0,
                    "replies": [
                        {
                            "body": "I doubt the OP will have sugar daddies trying to lowball her. She could get any allowance she requested. \n\nI am a Latino male, I know I’m not everyone’s type and that’s ok. But I’m a decent looking and in shape guy. I get white girls all the time that tell me they’ve never dated a Latino guy before but they found me attractive. \n\nEveryone has their own preferences. Some sds may not typically go for black women but I bet they would love the OP.",
                            "author": null,
                            "id": "h5eiw53",
                            "parent_id": "t1_h5eichf",
                            "score": 1,
                            "created_utc": 1626447133.0,
                            "replies": [
                                {
                                    "body": "Latino men have no business \"disagreeing\" with the issues that Black women have. Your assumptions are based off of your opinion on one person's looks.\n\nYou've never been a black woman so stop.",
                                    "author": "Chawkleeta",
                                    "id": "h5ep1pg",
                                    "parent_id": "t1_h5eiw53",
                                    "score": 9,
                                    "created_utc": 1626449786.0,
                                    "replies": [
                                        {
                                            "body": "Am I not a person of color and face discrimination Just like you? Don’t try and out victim me. We all face issues as POC while dating. My experiences as a Latino POC shouldn’t be undermined by you because we are different races. That’s just making the issue worse. \n\nIm sorry if you’re having issues finding a SD but not every black woman does, especially if they are attractive and have a good figure.",
                                            "author": null,
                                            "id": "h5epxq0",
                                            "parent_id": "t1_h5ep1pg",
                                            "score": 1,
                                            "created_utc": 1626450159.0,
                                            "replies": [
                                                {
                                                    "body": "/sigh\n\nCircle back to your first comment. Attempting to make assumptions about me doesn't negate the fact that you're \"disagreeing\" with something that many SBs struggle with no matter how attractive they are.\n\nAlso, you're using your ethnicity as a pass to talk about black women. Stop. Just compliment OP without diminishing other people's experiences.",
                                                    "author": "Chawkleeta",
                                                    "id": "h5etwhj",
                                                    "parent_id": "t1_h5epxq0",
                                                    "score": 6,
                                                    "created_utc": 1626451839.0,
                                                    "replies": [
                                                        {
                                                            "body": "My struggles are the same as your struggles. I struggle as a Latino man in the bowl therefore I try and make myself more attractive to SB’s. I workout, make more money, dress Well etc.",
                                                            "author": null,
                                                            "id": "h5eu57j",
                                                            "parent_id": "t1_h5etwhj",
                                                            "score": 1,
                                                            "created_utc": 1626451942.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Our experiences are not the same, and I will never know what it's like to be a Latino man. You will never know what it's like to be a Black woman, but if you want to be understanding and supportive it would be nice if you didn't generalize all of us and assume you have the simple solution to racial prejudice in the bowl.",
                                                                    "author": "Chawkleeta",
                                                                    "id": "h5euwtj",
                                                                    "parent_id": "t1_h5eu57j",
                                                                    "score": 5,
                                                                    "created_utc": 1626452268.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "Ok I’m sorry if I came across a little insensitive to black women’s struggles in the bowl. \n\nBut you admit that the OP will have zero issue finding a SD as a beautiful woman, despite her race?",
                                                                            "author": null,
                                                                            "id": "h5eva2m",
                                                                            "parent_id": "t1_h5euwtj",
                                                                            "score": 2,
                                                                            "created_utc": 1626452424.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "It seems like you’re trying to compare apples and oranges. Minoritized groups experience discrimination in very different ways. It comes across as demeaning and ignorant when you try to negate the experiences of all Black women because you happen to find one (OP) that you find attractive and then on top of that try to equate your experiences as a latino MAN to that of a Black woman. You should’ve just complimented the OP instead of generalizing Black women. Your comments are a perfect example of the difficulties  Black women face in the bowl.\n\n\n\n\nThis profile is AMAZING by the way. I love your pics!",
                                                                                    "author": "LongjumpingTiger5082",
                                                                                    "id": "h5f3wvg",
                                                                                    "parent_id": "t1_h5eva2m",
                                                                                    "score": 6,
                                                                                    "created_utc": 1626456083.0,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Like someone else said, just because she’s beautiful doesn’t negate struggles. As an AA SB myself I’ve come across many men that literally describe white or asian women and totally exclude black women (ie “into petite blonde bombshell kinda girls” or i remember one saying “if you’re not an asian baddie sorry but i’m not interested”). while everyone has preferences, whether they have a specific type or are open to everyone, it has been seen time and time again that black women especially those that are darker skinned are less desired and when they are desired it’s on some weird vibes. I get more messages asking me to be a dom or submissive “black queen” or “chocolate goddess” when i know these men are not making the color of women of other ethnicities’ skin the main focus. We AA women are stuck in between being undesired or fetishized for the most part which are both quite discouraging especially taking in the fact that yes, these men do lowball us…It is relatively hard to find someone, even in regular dating, that respects us for who we are as people. But with that said, unless you are an AA SB I find it interesting that you can disagree with this as if you know what it’s like.",
                    "author": "xokammeryn",
                    "id": "h5hh52h",
                    "parent_id": "t1_h5bsgmu",
                    "score": 1,
                    "created_utc": 1626498397.0,
                    "replies": [
                        {
                            "body": "I totally empathize with what you’re dealing with. But if you’re an attractive black female like the OP, then you will have zero problems in the bowl. Period.",
                            "author": null,
                            "id": "h5hhan7",
                            "parent_id": "t1_h5hh52h",
                            "score": -1,
                            "created_utc": 1626498507.0,
                            "replies": [
                                {
                                    "body": "Have I had trouble finding someone? No. But like I explained, there are other problems within the bowl. Pure discrimination. The pool for men that want black women compared to others is not that large and many of those that do offer lower amounts than they would for nonblack SBs or are disrespectful towards us. These things make it difficult to find someone that we’d want a SR with and a SR involved comfort for both parties. So overall it’s still hard and if you think we should settle just bc someone has interest in us for once then yikes. The OP is beautiful like I said before but you should realize that that’s not the only problem within this topic. I hope you can understand that it is not just a face value issue.",
                                    "author": "xokammeryn",
                                    "id": "h5hi5nl",
                                    "parent_id": "t1_h5hhan7",
                                    "score": 2,
                                    "created_utc": 1626499128.0,
                                    "replies": [
                                        {
                                            "body": "Like i said we all have our preferences. I go for attractive women period. I’ve never dated a black woman before but i would date the OP and any other woman that looked like her in a heartbeat. It has nothing to do with racism.",
                                            "author": null,
                                            "id": "h5hivk4",
                                            "parent_id": "t1_h5hi5nl",
                                            "score": 0,
                                            "created_utc": 1626499653.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Only have 2 words. God damn! \n\nProfile is great btw. Don’t change it. Not into the long winded profiles.",
            "author": "BishopSD",
            "id": "h5c6prn",
            "parent_id": "t3_okzuy9",
            "score": 0,
            "created_utc": 1626393711.0,
            "replies": []
        },
        {
            "body": "6 min a mile. You are heading to Tokyo then.",
            "author": "captainIsBack4u",
            "id": "h5bri6l",
            "parent_id": "t3_okzuy9",
            "score": -1,
            "created_utc": 1626386192.0,
            "replies": []
        },
        {
            "body": "Hi ! You are sooo cute !! I live in California but I feel like we should be friends!!",
            "author": "Impressive-Ask-4812",
            "id": "h5bmdgo",
            "parent_id": "t3_okzuy9",
            "score": 1,
            "created_utc": 1626383829.0,
            "replies": [
                {
                    "body": "Always up for making more friends😊",
                    "author": "Genvieve_delacroix",
                    "id": "h5c2531",
                    "parent_id": "t1_h5bmdgo",
                    "score": 3,
                    "created_utc": 1626391374.0,
                    "replies": [
                        {
                            "body": "I sent you a message (: !",
                            "author": "Impressive-Ask-4812",
                            "id": "h5c465u",
                            "parent_id": "t1_h5c2531",
                            "score": 1,
                            "created_utc": 1626392412.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I read that as you were reading \"Exit to Eden\", which is a very sexy, kinky book! Horrible movie tho....",
            "author": "Discreet_Deviancy",
            "id": "h5bvk87",
            "parent_id": "t3_okzuy9",
            "score": 1,
            "created_utc": 1626388128.0,
            "replies": [
                {
                    "body": "I’ll try to find it at my local library🙃",
                    "author": "Genvieve_delacroix",
                    "id": "h5bw8rs",
                    "parent_id": "t1_h5bvk87",
                    "score": 2,
                    "created_utc": 1626388457.0,
                    "replies": [
                        {
                            "body": "It was written nuder a nom de plume by Anne Rice, who wrote \"Interview with the vampire\". She also wrote the \"The Claiming of Sleeping Beauty\" trilogy under a different nom, and they are also very kinky, very sexy. She is a really talented erotic writer.",
                            "author": "Discreet_Deviancy",
                            "id": "h5bwos8",
                            "parent_id": "t1_h5bw8rs",
                            "score": 6,
                            "created_utc": 1626388670.0,
                            "replies": [
                                {
                                    "body": "10/10 recommend anything written by Anne Rice. Interview with the Vampire is what got me into reading and inspired me to do what I do today. Her range of works however is... interesting lol",
                                    "author": "PreviousEntrance1300",
                                    "id": "h5crn5u",
                                    "parent_id": "t1_h5bwos8",
                                    "score": 2,
                                    "created_utc": 1626404750.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Very good! You are beautiful and well spoken",
            "author": "Open-Lengthiness-832",
            "id": "h5bw2mh",
            "parent_id": "t3_okzuy9",
            "score": 1,
            "created_utc": 1626388375.0,
            "replies": []
        },
        {
            "body": "I did the 880 in just under 2 minutes....so who's chasing who?\n\nBtw....is that dog with the yellow and green eyes real or stuffed?\n\nDon't change anything, profile looks good :-)",
            "author": null,
            "id": "h5bz9cs",
            "parent_id": "t3_okzuy9",
            "score": 1,
            "created_utc": 1626389931.0,
            "replies": []
        },
        {
            "body": "You’re gorgeous. Love your profile and pics. The swimsuit pic is WOW. Be very choosy! Because you can! \n\nBtw I would love to know howwwwww do you get your teeth so sparkling white? TY!",
            "author": "Throwawayalways666",
            "id": "h5c4c3p",
            "parent_id": "t3_okzuy9",
            "score": 1,
            "created_utc": 1626392495.0,
            "replies": []
        },
        {
            "body": "WOW. You are absolutely gorgeous in all of profiles photos posted here.  You will be overwhelmed with messages the minute you post online. Setup filters to cut out the rubbish. As for the text in your profile - I see what type of people are sending messages and make changes accordingly.  For example, if 99% of individuals that you are not happy with - at all - are making sexual comments about your bikini photo, maybe you should remove it or hide it.  There’s a saying about flies being attracted to certain things.  \n\nNote that I have not mentioned that bikini photo .. until now.  WoW!!!  👋",
            "author": "MasterAcct2020",
            "id": "h5cfqes",
            "parent_id": "t3_okzuy9",
            "score": 1,
            "created_utc": 1626398404.0,
            "replies": []
        },
        {
            "body": "Great profile!  You're obviously very attractive but also come across as classy and intelligent.   I agree that you can lose the car pic but that is a minor detail.   There are some great law schools in Chicago btw 😉",
            "author": "jackaustin35",
            "id": "h5cggf8",
            "parent_id": "t3_okzuy9",
            "score": 1,
            "created_utc": 1626398785.0,
            "replies": [
                {
                    "body": "Put in a good word for me at UChicago😉\n\nThank you for the kind words and already got rid of the car pic!",
                    "author": "Genvieve_delacroix",
                    "id": "h5ckyt7",
                    "parent_id": "t1_h5cggf8",
                    "score": 1,
                    "created_utc": 1626401145.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Pics\n\n* You're incredibly photogenic. The bikini pic in particular is a banger.\n* I'd prefer if your main pic had a smile. Particularly as it's the first impression.\n\nText\n\n* \"I am probably trying my hand at learning a new language.\" What language?\n* Personally I'd like to see a bit more on your seeking section. Ideal activities you'd like to do together. More on your requirements, expectations or standards to help you filter people.",
            "author": "BlueLantern",
            "id": "h5cncmd",
            "parent_id": "t3_okzuy9",
            "score": 1,
            "created_utc": 1626402423.0,
            "replies": []
        },
        {
            "body": "Great pics, terrific smile, text on-point. The only thing that looks odd is that your hand looks like it's coming from another body or something :) (no biggie, tho)",
            "author": "bdogdog",
            "id": "h5coaik",
            "parent_id": "t3_okzuy9",
            "score": 1,
            "created_utc": 1626402935.0,
            "replies": [
                {
                    "body": "I think that’s the screenshot lol since I just cropped out the search bar",
                    "author": "Genvieve_delacroix",
                    "id": "h5cozsu",
                    "parent_id": "t1_h5coaik",
                    "score": 1,
                    "created_utc": 1626403318.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "You are so pretty!!! Also love your puppies 🐶🐶💓",
            "author": "violentponykiller",
            "id": "h5dijb1",
            "parent_id": "t3_okzuy9",
            "score": 1,
            "created_utc": 1626423582.0,
            "replies": []
        },
        {
            "body": "My only recommendation would be…can you relocate to Chicago? 😁",
            "author": null,
            "id": "h5fgaj4",
            "parent_id": "t3_okzuy9",
            "score": 1,
            "created_utc": 1626461322.0,
            "replies": []
        },
        {
            "body": "you need a picture proving your slim status",
            "author": "ExcellentAnywhere162",
            "id": "h5i97d3",
            "parent_id": "t3_okzuy9",
            "score": 1,
            "created_utc": 1626522360.0,
            "replies": []
        },
        {
            "body": "Just wanted to say you’re gorgeous! You should have no problem. Just be wary of scammers.",
            "author": "EmpiricalGrl",
            "id": "h5r0fas",
            "parent_id": "t3_okzuy9",
            "score": 1,
            "created_utc": 1626701242.0,
            "replies": []
        },
        {
            "body": "Please move to London.",
            "author": "Distinct-Animal-9628",
            "id": "h7fexcv",
            "parent_id": "t3_okzuy9",
            "score": 1,
            "created_utc": 1627911649.0,
            "replies": []
        },
        {
            "body": "You and I both bbg",
            "author": "Able_Necessary_8600",
            "id": "h7ult7e",
            "parent_id": "t3_okzuy9",
            "score": 1,
            "created_utc": 1628194097.0,
            "replies": []
        },
        {
            "body": "Aww thanks😊",
            "author": "Genvieve_delacroix",
            "id": "h5bhvj9",
            "parent_id": "t1_h5bhbm5",
            "score": 2,
            "created_utc": 1626381853.0,
            "replies": []
        },
        {
            "body": "Thank you for this, really actionable advice🙂. I’ll add the cuisine I enjoy and my love for outdoorsy dates such as hikes etc in my about me to give SDs more to work with. \n\nI was actually iffy on the one in the car so I am glad I am not the only one, I’ll replace it with a picture of me dressed up to go out wearing something classy as you suggested",
            "author": "Genvieve_delacroix",
            "id": "h5bufgf",
            "parent_id": "t1_h5bou6t",
            "score": 10,
            "created_utc": 1626387584.0,
            "replies": []
        },
        {
            "body": "I thought my “about me” might be a little short especially since some of the SDs in my area seem to write a lot. No change there?",
            "author": "Genvieve_delacroix",
            "id": "h5bizx8",
            "parent_id": "t1_h5bimu7",
            "score": 2,
            "created_utc": 1626382334.0,
            "replies": [
                {
                    "body": "As one who truly does enjoy reading profiles, sure more would be nice but in truth, you probably don't need much more. You packed a lot of compelling information in a few sentences. For the sapios out there, you have enough to go on with your terrific images and text. Your Seeking is spot on.",
                    "author": "Intrepid_Seeker",
                    "id": "h5bneq5",
                    "parent_id": "t1_h5bizx8",
                    "score": 4,
                    "created_utc": 1626384299.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Are you getting jealous?",
            "author": "Intelligent-Tone-687",
            "id": "hc4qols",
            "parent_id": "t1_h5clksx",
            "score": 0,
            "created_utc": 1631151111.0,
            "replies": []
        },
        {
            "body": "Will surf some of the profile review for sure, thank you!",
            "author": "Genvieve_delacroix",
            "id": "h5bl16f",
            "parent_id": "t1_h5bjunw",
            "score": 1,
            "created_utc": 1626383225.0,
            "replies": []
        },
        {
            "body": "I think it’s more about body type than race & the demographics of most SDs (white older men) aren’t interested in body types outside of the typical slim/athletic build but I could be wrong",
            "author": "Genvieve_delacroix",
            "id": "h5btgew",
            "parent_id": "t1_h5bsgmu",
            "score": 10,
            "created_utc": 1626387116.0,
            "replies": [
                {
                    "body": "Probably very true. As a latino man myself, I personally prefer a slim thic woman :)",
                    "author": null,
                    "id": "h5bw3r8",
                    "parent_id": "t1_h5btgew",
                    "score": 2,
                    "created_utc": 1626388390.0,
                    "replies": []
                },
                {
                    "body": "Body type is part of it, background and cultural norms are another.   When they are too far out of alignment it is just too different to connect compared to other options.  Differences not better vs worse.\n\nI passed on petite women with too many background differences but enjoyed more curvy women I connected with on common interests. \n\nYou will do fantastic in DFW.  I was active on SA there for a while and saw the SBs.  You are top 1%.",
                    "author": "TXPolyDaddy",
                    "id": "h5e7m0o",
                    "parent_id": "t1_h5btgew",
                    "score": 1,
                    "created_utc": 1626441773.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "She’s beautiful, but that doesn’t negate the fact that many SD profiles blatantly state “no black women” or they describe the ideal SB “petite blonde”. \n\nAlso, many SDs will send lower allowance rates to women of color because they believe the value is lower as well.\n\nThere’s no need to downplay what black women go through.",
            "author": "Chawkleeta",
            "id": "h5eichf",
            "parent_id": "t1_h5bsgmu",
            "score": 6,
            "created_utc": 1626446895.0,
            "replies": [
                {
                    "body": "I doubt the OP will have sugar daddies trying to lowball her. She could get any allowance she requested. \n\nI am a Latino male, I know I’m not everyone’s type and that’s ok. But I’m a decent looking and in shape guy. I get white girls all the time that tell me they’ve never dated a Latino guy before but they found me attractive. \n\nEveryone has their own preferences. Some sds may not typically go for black women but I bet they would love the OP.",
                    "author": null,
                    "id": "h5eiw53",
                    "parent_id": "t1_h5eichf",
                    "score": 1,
                    "created_utc": 1626447133.0,
                    "replies": [
                        {
                            "body": "Latino men have no business \"disagreeing\" with the issues that Black women have. Your assumptions are based off of your opinion on one person's looks.\n\nYou've never been a black woman so stop.",
                            "author": "Chawkleeta",
                            "id": "h5ep1pg",
                            "parent_id": "t1_h5eiw53",
                            "score": 9,
                            "created_utc": 1626449786.0,
                            "replies": [
                                {
                                    "body": "Am I not a person of color and face discrimination Just like you? Don’t try and out victim me. We all face issues as POC while dating. My experiences as a Latino POC shouldn’t be undermined by you because we are different races. That’s just making the issue worse. \n\nIm sorry if you’re having issues finding a SD but not every black woman does, especially if they are attractive and have a good figure.",
                                    "author": null,
                                    "id": "h5epxq0",
                                    "parent_id": "t1_h5ep1pg",
                                    "score": 1,
                                    "created_utc": 1626450159.0,
                                    "replies": [
                                        {
                                            "body": "/sigh\n\nCircle back to your first comment. Attempting to make assumptions about me doesn't negate the fact that you're \"disagreeing\" with something that many SBs struggle with no matter how attractive they are.\n\nAlso, you're using your ethnicity as a pass to talk about black women. Stop. Just compliment OP without diminishing other people's experiences.",
                                            "author": "Chawkleeta",
                                            "id": "h5etwhj",
                                            "parent_id": "t1_h5epxq0",
                                            "score": 6,
                                            "created_utc": 1626451839.0,
                                            "replies": [
                                                {
                                                    "body": "My struggles are the same as your struggles. I struggle as a Latino man in the bowl therefore I try and make myself more attractive to SB’s. I workout, make more money, dress Well etc.",
                                                    "author": null,
                                                    "id": "h5eu57j",
                                                    "parent_id": "t1_h5etwhj",
                                                    "score": 1,
                                                    "created_utc": 1626451942.0,
                                                    "replies": [
                                                        {
                                                            "body": "Our experiences are not the same, and I will never know what it's like to be a Latino man. You will never know what it's like to be a Black woman, but if you want to be understanding and supportive it would be nice if you didn't generalize all of us and assume you have the simple solution to racial prejudice in the bowl.",
                                                            "author": "Chawkleeta",
                                                            "id": "h5euwtj",
                                                            "parent_id": "t1_h5eu57j",
                                                            "score": 5,
                                                            "created_utc": 1626452268.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Ok I’m sorry if I came across a little insensitive to black women’s struggles in the bowl. \n\nBut you admit that the OP will have zero issue finding a SD as a beautiful woman, despite her race?",
                                                                    "author": null,
                                                                    "id": "h5eva2m",
                                                                    "parent_id": "t1_h5euwtj",
                                                                    "score": 2,
                                                                    "created_utc": 1626452424.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "It seems like you’re trying to compare apples and oranges. Minoritized groups experience discrimination in very different ways. It comes across as demeaning and ignorant when you try to negate the experiences of all Black women because you happen to find one (OP) that you find attractive and then on top of that try to equate your experiences as a latino MAN to that of a Black woman. You should’ve just complimented the OP instead of generalizing Black women. Your comments are a perfect example of the difficulties  Black women face in the bowl.\n\n\n\n\nThis profile is AMAZING by the way. I love your pics!",
                                                                            "author": "LongjumpingTiger5082",
                                                                            "id": "h5f3wvg",
                                                                            "parent_id": "t1_h5eva2m",
                                                                            "score": 6,
                                                                            "created_utc": 1626456083.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Like someone else said, just because she’s beautiful doesn’t negate struggles. As an AA SB myself I’ve come across many men that literally describe white or asian women and totally exclude black women (ie “into petite blonde bombshell kinda girls” or i remember one saying “if you’re not an asian baddie sorry but i’m not interested”). while everyone has preferences, whether they have a specific type or are open to everyone, it has been seen time and time again that black women especially those that are darker skinned are less desired and when they are desired it’s on some weird vibes. I get more messages asking me to be a dom or submissive “black queen” or “chocolate goddess” when i know these men are not making the color of women of other ethnicities’ skin the main focus. We AA women are stuck in between being undesired or fetishized for the most part which are both quite discouraging especially taking in the fact that yes, these men do lowball us…It is relatively hard to find someone, even in regular dating, that respects us for who we are as people. But with that said, unless you are an AA SB I find it interesting that you can disagree with this as if you know what it’s like.",
            "author": "xokammeryn",
            "id": "h5hh52h",
            "parent_id": "t1_h5bsgmu",
            "score": 1,
            "created_utc": 1626498397.0,
            "replies": [
                {
                    "body": "I totally empathize with what you’re dealing with. But if you’re an attractive black female like the OP, then you will have zero problems in the bowl. Period.",
                    "author": null,
                    "id": "h5hhan7",
                    "parent_id": "t1_h5hh52h",
                    "score": -1,
                    "created_utc": 1626498507.0,
                    "replies": [
                        {
                            "body": "Have I had trouble finding someone? No. But like I explained, there are other problems within the bowl. Pure discrimination. The pool for men that want black women compared to others is not that large and many of those that do offer lower amounts than they would for nonblack SBs or are disrespectful towards us. These things make it difficult to find someone that we’d want a SR with and a SR involved comfort for both parties. So overall it’s still hard and if you think we should settle just bc someone has interest in us for once then yikes. The OP is beautiful like I said before but you should realize that that’s not the only problem within this topic. I hope you can understand that it is not just a face value issue.",
                            "author": "xokammeryn",
                            "id": "h5hi5nl",
                            "parent_id": "t1_h5hhan7",
                            "score": 2,
                            "created_utc": 1626499128.0,
                            "replies": [
                                {
                                    "body": "Like i said we all have our preferences. I go for attractive women period. I’ve never dated a black woman before but i would date the OP and any other woman that looked like her in a heartbeat. It has nothing to do with racism.",
                                    "author": null,
                                    "id": "h5hivk4",
                                    "parent_id": "t1_h5hi5nl",
                                    "score": 0,
                                    "created_utc": 1626499653.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Always up for making more friends😊",
            "author": "Genvieve_delacroix",
            "id": "h5c2531",
            "parent_id": "t1_h5bmdgo",
            "score": 3,
            "created_utc": 1626391374.0,
            "replies": [
                {
                    "body": "I sent you a message (: !",
                    "author": "Impressive-Ask-4812",
                    "id": "h5c465u",
                    "parent_id": "t1_h5c2531",
                    "score": 1,
                    "created_utc": 1626392412.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I’ll try to find it at my local library🙃",
            "author": "Genvieve_delacroix",
            "id": "h5bw8rs",
            "parent_id": "t1_h5bvk87",
            "score": 2,
            "created_utc": 1626388457.0,
            "replies": [
                {
                    "body": "It was written nuder a nom de plume by Anne Rice, who wrote \"Interview with the vampire\". She also wrote the \"The Claiming of Sleeping Beauty\" trilogy under a different nom, and they are also very kinky, very sexy. She is a really talented erotic writer.",
                    "author": "Discreet_Deviancy",
                    "id": "h5bwos8",
                    "parent_id": "t1_h5bw8rs",
                    "score": 6,
                    "created_utc": 1626388670.0,
                    "replies": [
                        {
                            "body": "10/10 recommend anything written by Anne Rice. Interview with the Vampire is what got me into reading and inspired me to do what I do today. Her range of works however is... interesting lol",
                            "author": "PreviousEntrance1300",
                            "id": "h5crn5u",
                            "parent_id": "t1_h5bwos8",
                            "score": 2,
                            "created_utc": 1626404750.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Put in a good word for me at UChicago😉\n\nThank you for the kind words and already got rid of the car pic!",
            "author": "Genvieve_delacroix",
            "id": "h5ckyt7",
            "parent_id": "t1_h5cggf8",
            "score": 1,
            "created_utc": 1626401145.0,
            "replies": []
        },
        {
            "body": "I think that’s the screenshot lol since I just cropped out the search bar",
            "author": "Genvieve_delacroix",
            "id": "h5cozsu",
            "parent_id": "t1_h5coaik",
            "score": 1,
            "created_utc": 1626403318.0,
            "replies": []
        },
        {
            "body": "As one who truly does enjoy reading profiles, sure more would be nice but in truth, you probably don't need much more. You packed a lot of compelling information in a few sentences. For the sapios out there, you have enough to go on with your terrific images and text. Your Seeking is spot on.",
            "author": "Intrepid_Seeker",
            "id": "h5bneq5",
            "parent_id": "t1_h5bizx8",
            "score": 4,
            "created_utc": 1626384299.0,
            "replies": []
        },
        {
            "body": "Probably very true. As a latino man myself, I personally prefer a slim thic woman :)",
            "author": null,
            "id": "h5bw3r8",
            "parent_id": "t1_h5btgew",
            "score": 2,
            "created_utc": 1626388390.0,
            "replies": []
        },
        {
            "body": "Body type is part of it, background and cultural norms are another.   When they are too far out of alignment it is just too different to connect compared to other options.  Differences not better vs worse.\n\nI passed on petite women with too many background differences but enjoyed more curvy women I connected with on common interests. \n\nYou will do fantastic in DFW.  I was active on SA there for a while and saw the SBs.  You are top 1%.",
            "author": "TXPolyDaddy",
            "id": "h5e7m0o",
            "parent_id": "t1_h5btgew",
            "score": 1,
            "created_utc": 1626441773.0,
            "replies": []
        },
        {
            "body": "I doubt the OP will have sugar daddies trying to lowball her. She could get any allowance she requested. \n\nI am a Latino male, I know I’m not everyone’s type and that’s ok. But I’m a decent looking and in shape guy. I get white girls all the time that tell me they’ve never dated a Latino guy before but they found me attractive. \n\nEveryone has their own preferences. Some sds may not typically go for black women but I bet they would love the OP.",
            "author": null,
            "id": "h5eiw53",
            "parent_id": "t1_h5eichf",
            "score": 1,
            "created_utc": 1626447133.0,
            "replies": [
                {
                    "body": "Latino men have no business \"disagreeing\" with the issues that Black women have. Your assumptions are based off of your opinion on one person's looks.\n\nYou've never been a black woman so stop.",
                    "author": "Chawkleeta",
                    "id": "h5ep1pg",
                    "parent_id": "t1_h5eiw53",
                    "score": 9,
                    "created_utc": 1626449786.0,
                    "replies": [
                        {
                            "body": "Am I not a person of color and face discrimination Just like you? Don’t try and out victim me. We all face issues as POC while dating. My experiences as a Latino POC shouldn’t be undermined by you because we are different races. That’s just making the issue worse. \n\nIm sorry if you’re having issues finding a SD but not every black woman does, especially if they are attractive and have a good figure.",
                            "author": null,
                            "id": "h5epxq0",
                            "parent_id": "t1_h5ep1pg",
                            "score": 1,
                            "created_utc": 1626450159.0,
                            "replies": [
                                {
                                    "body": "/sigh\n\nCircle back to your first comment. Attempting to make assumptions about me doesn't negate the fact that you're \"disagreeing\" with something that many SBs struggle with no matter how attractive they are.\n\nAlso, you're using your ethnicity as a pass to talk about black women. Stop. Just compliment OP without diminishing other people's experiences.",
                                    "author": "Chawkleeta",
                                    "id": "h5etwhj",
                                    "parent_id": "t1_h5epxq0",
                                    "score": 6,
                                    "created_utc": 1626451839.0,
                                    "replies": [
                                        {
                                            "body": "My struggles are the same as your struggles. I struggle as a Latino man in the bowl therefore I try and make myself more attractive to SB’s. I workout, make more money, dress Well etc.",
                                            "author": null,
                                            "id": "h5eu57j",
                                            "parent_id": "t1_h5etwhj",
                                            "score": 1,
                                            "created_utc": 1626451942.0,
                                            "replies": [
                                                {
                                                    "body": "Our experiences are not the same, and I will never know what it's like to be a Latino man. You will never know what it's like to be a Black woman, but if you want to be understanding and supportive it would be nice if you didn't generalize all of us and assume you have the simple solution to racial prejudice in the bowl.",
                                                    "author": "Chawkleeta",
                                                    "id": "h5euwtj",
                                                    "parent_id": "t1_h5eu57j",
                                                    "score": 5,
                                                    "created_utc": 1626452268.0,
                                                    "replies": [
                                                        {
                                                            "body": "Ok I’m sorry if I came across a little insensitive to black women’s struggles in the bowl. \n\nBut you admit that the OP will have zero issue finding a SD as a beautiful woman, despite her race?",
                                                            "author": null,
                                                            "id": "h5eva2m",
                                                            "parent_id": "t1_h5euwtj",
                                                            "score": 2,
                                                            "created_utc": 1626452424.0,
                                                            "replies": [
                                                                {
                                                                    "body": "It seems like you’re trying to compare apples and oranges. Minoritized groups experience discrimination in very different ways. It comes across as demeaning and ignorant when you try to negate the experiences of all Black women because you happen to find one (OP) that you find attractive and then on top of that try to equate your experiences as a latino MAN to that of a Black woman. You should’ve just complimented the OP instead of generalizing Black women. Your comments are a perfect example of the difficulties  Black women face in the bowl.\n\n\n\n\nThis profile is AMAZING by the way. I love your pics!",
                                                                    "author": "LongjumpingTiger5082",
                                                                    "id": "h5f3wvg",
                                                                    "parent_id": "t1_h5eva2m",
                                                                    "score": 6,
                                                                    "created_utc": 1626456083.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I totally empathize with what you’re dealing with. But if you’re an attractive black female like the OP, then you will have zero problems in the bowl. Period.",
            "author": null,
            "id": "h5hhan7",
            "parent_id": "t1_h5hh52h",
            "score": -1,
            "created_utc": 1626498507.0,
            "replies": [
                {
                    "body": "Have I had trouble finding someone? No. But like I explained, there are other problems within the bowl. Pure discrimination. The pool for men that want black women compared to others is not that large and many of those that do offer lower amounts than they would for nonblack SBs or are disrespectful towards us. These things make it difficult to find someone that we’d want a SR with and a SR involved comfort for both parties. So overall it’s still hard and if you think we should settle just bc someone has interest in us for once then yikes. The OP is beautiful like I said before but you should realize that that’s not the only problem within this topic. I hope you can understand that it is not just a face value issue.",
                    "author": "xokammeryn",
                    "id": "h5hi5nl",
                    "parent_id": "t1_h5hhan7",
                    "score": 2,
                    "created_utc": 1626499128.0,
                    "replies": [
                        {
                            "body": "Like i said we all have our preferences. I go for attractive women period. I’ve never dated a black woman before but i would date the OP and any other woman that looked like her in a heartbeat. It has nothing to do with racism.",
                            "author": null,
                            "id": "h5hivk4",
                            "parent_id": "t1_h5hi5nl",
                            "score": 0,
                            "created_utc": 1626499653.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I sent you a message (: !",
            "author": "Impressive-Ask-4812",
            "id": "h5c465u",
            "parent_id": "t1_h5c2531",
            "score": 1,
            "created_utc": 1626392412.0,
            "replies": []
        },
        {
            "body": "It was written nuder a nom de plume by Anne Rice, who wrote \"Interview with the vampire\". She also wrote the \"The Claiming of Sleeping Beauty\" trilogy under a different nom, and they are also very kinky, very sexy. She is a really talented erotic writer.",
            "author": "Discreet_Deviancy",
            "id": "h5bwos8",
            "parent_id": "t1_h5bw8rs",
            "score": 6,
            "created_utc": 1626388670.0,
            "replies": [
                {
                    "body": "10/10 recommend anything written by Anne Rice. Interview with the Vampire is what got me into reading and inspired me to do what I do today. Her range of works however is... interesting lol",
                    "author": "PreviousEntrance1300",
                    "id": "h5crn5u",
                    "parent_id": "t1_h5bwos8",
                    "score": 2,
                    "created_utc": 1626404750.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Latino men have no business \"disagreeing\" with the issues that Black women have. Your assumptions are based off of your opinion on one person's looks.\n\nYou've never been a black woman so stop.",
            "author": "Chawkleeta",
            "id": "h5ep1pg",
            "parent_id": "t1_h5eiw53",
            "score": 9,
            "created_utc": 1626449786.0,
            "replies": [
                {
                    "body": "Am I not a person of color and face discrimination Just like you? Don’t try and out victim me. We all face issues as POC while dating. My experiences as a Latino POC shouldn’t be undermined by you because we are different races. That’s just making the issue worse. \n\nIm sorry if you’re having issues finding a SD but not every black woman does, especially if they are attractive and have a good figure.",
                    "author": null,
                    "id": "h5epxq0",
                    "parent_id": "t1_h5ep1pg",
                    "score": 1,
                    "created_utc": 1626450159.0,
                    "replies": [
                        {
                            "body": "/sigh\n\nCircle back to your first comment. Attempting to make assumptions about me doesn't negate the fact that you're \"disagreeing\" with something that many SBs struggle with no matter how attractive they are.\n\nAlso, you're using your ethnicity as a pass to talk about black women. Stop. Just compliment OP without diminishing other people's experiences.",
                            "author": "Chawkleeta",
                            "id": "h5etwhj",
                            "parent_id": "t1_h5epxq0",
                            "score": 6,
                            "created_utc": 1626451839.0,
                            "replies": [
                                {
                                    "body": "My struggles are the same as your struggles. I struggle as a Latino man in the bowl therefore I try and make myself more attractive to SB’s. I workout, make more money, dress Well etc.",
                                    "author": null,
                                    "id": "h5eu57j",
                                    "parent_id": "t1_h5etwhj",
                                    "score": 1,
                                    "created_utc": 1626451942.0,
                                    "replies": [
                                        {
                                            "body": "Our experiences are not the same, and I will never know what it's like to be a Latino man. You will never know what it's like to be a Black woman, but if you want to be understanding and supportive it would be nice if you didn't generalize all of us and assume you have the simple solution to racial prejudice in the bowl.",
                                            "author": "Chawkleeta",
                                            "id": "h5euwtj",
                                            "parent_id": "t1_h5eu57j",
                                            "score": 5,
                                            "created_utc": 1626452268.0,
                                            "replies": [
                                                {
                                                    "body": "Ok I’m sorry if I came across a little insensitive to black women’s struggles in the bowl. \n\nBut you admit that the OP will have zero issue finding a SD as a beautiful woman, despite her race?",
                                                    "author": null,
                                                    "id": "h5eva2m",
                                                    "parent_id": "t1_h5euwtj",
                                                    "score": 2,
                                                    "created_utc": 1626452424.0,
                                                    "replies": [
                                                        {
                                                            "body": "It seems like you’re trying to compare apples and oranges. Minoritized groups experience discrimination in very different ways. It comes across as demeaning and ignorant when you try to negate the experiences of all Black women because you happen to find one (OP) that you find attractive and then on top of that try to equate your experiences as a latino MAN to that of a Black woman. You should’ve just complimented the OP instead of generalizing Black women. Your comments are a perfect example of the difficulties  Black women face in the bowl.\n\n\n\n\nThis profile is AMAZING by the way. I love your pics!",
                                                            "author": "LongjumpingTiger5082",
                                                            "id": "h5f3wvg",
                                                            "parent_id": "t1_h5eva2m",
                                                            "score": 6,
                                                            "created_utc": 1626456083.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Have I had trouble finding someone? No. But like I explained, there are other problems within the bowl. Pure discrimination. The pool for men that want black women compared to others is not that large and many of those that do offer lower amounts than they would for nonblack SBs or are disrespectful towards us. These things make it difficult to find someone that we’d want a SR with and a SR involved comfort for both parties. So overall it’s still hard and if you think we should settle just bc someone has interest in us for once then yikes. The OP is beautiful like I said before but you should realize that that’s not the only problem within this topic. I hope you can understand that it is not just a face value issue.",
            "author": "xokammeryn",
            "id": "h5hi5nl",
            "parent_id": "t1_h5hhan7",
            "score": 2,
            "created_utc": 1626499128.0,
            "replies": [
                {
                    "body": "Like i said we all have our preferences. I go for attractive women period. I’ve never dated a black woman before but i would date the OP and any other woman that looked like her in a heartbeat. It has nothing to do with racism.",
                    "author": null,
                    "id": "h5hivk4",
                    "parent_id": "t1_h5hi5nl",
                    "score": 0,
                    "created_utc": 1626499653.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "10/10 recommend anything written by Anne Rice. Interview with the Vampire is what got me into reading and inspired me to do what I do today. Her range of works however is... interesting lol",
            "author": "PreviousEntrance1300",
            "id": "h5crn5u",
            "parent_id": "t1_h5bwos8",
            "score": 2,
            "created_utc": 1626404750.0,
            "replies": []
        },
        {
            "body": "Am I not a person of color and face discrimination Just like you? Don’t try and out victim me. We all face issues as POC while dating. My experiences as a Latino POC shouldn’t be undermined by you because we are different races. That’s just making the issue worse. \n\nIm sorry if you’re having issues finding a SD but not every black woman does, especially if they are attractive and have a good figure.",
            "author": null,
            "id": "h5epxq0",
            "parent_id": "t1_h5ep1pg",
            "score": 1,
            "created_utc": 1626450159.0,
            "replies": [
                {
                    "body": "/sigh\n\nCircle back to your first comment. Attempting to make assumptions about me doesn't negate the fact that you're \"disagreeing\" with something that many SBs struggle with no matter how attractive they are.\n\nAlso, you're using your ethnicity as a pass to talk about black women. Stop. Just compliment OP without diminishing other people's experiences.",
                    "author": "Chawkleeta",
                    "id": "h5etwhj",
                    "parent_id": "t1_h5epxq0",
                    "score": 6,
                    "created_utc": 1626451839.0,
                    "replies": [
                        {
                            "body": "My struggles are the same as your struggles. I struggle as a Latino man in the bowl therefore I try and make myself more attractive to SB’s. I workout, make more money, dress Well etc.",
                            "author": null,
                            "id": "h5eu57j",
                            "parent_id": "t1_h5etwhj",
                            "score": 1,
                            "created_utc": 1626451942.0,
                            "replies": [
                                {
                                    "body": "Our experiences are not the same, and I will never know what it's like to be a Latino man. You will never know what it's like to be a Black woman, but if you want to be understanding and supportive it would be nice if you didn't generalize all of us and assume you have the simple solution to racial prejudice in the bowl.",
                                    "author": "Chawkleeta",
                                    "id": "h5euwtj",
                                    "parent_id": "t1_h5eu57j",
                                    "score": 5,
                                    "created_utc": 1626452268.0,
                                    "replies": [
                                        {
                                            "body": "Ok I’m sorry if I came across a little insensitive to black women’s struggles in the bowl. \n\nBut you admit that the OP will have zero issue finding a SD as a beautiful woman, despite her race?",
                                            "author": null,
                                            "id": "h5eva2m",
                                            "parent_id": "t1_h5euwtj",
                                            "score": 2,
                                            "created_utc": 1626452424.0,
                                            "replies": [
                                                {
                                                    "body": "It seems like you’re trying to compare apples and oranges. Minoritized groups experience discrimination in very different ways. It comes across as demeaning and ignorant when you try to negate the experiences of all Black women because you happen to find one (OP) that you find attractive and then on top of that try to equate your experiences as a latino MAN to that of a Black woman. You should’ve just complimented the OP instead of generalizing Black women. Your comments are a perfect example of the difficulties  Black women face in the bowl.\n\n\n\n\nThis profile is AMAZING by the way. I love your pics!",
                                                    "author": "LongjumpingTiger5082",
                                                    "id": "h5f3wvg",
                                                    "parent_id": "t1_h5eva2m",
                                                    "score": 6,
                                                    "created_utc": 1626456083.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Like i said we all have our preferences. I go for attractive women period. I’ve never dated a black woman before but i would date the OP and any other woman that looked like her in a heartbeat. It has nothing to do with racism.",
            "author": null,
            "id": "h5hivk4",
            "parent_id": "t1_h5hi5nl",
            "score": 0,
            "created_utc": 1626499653.0,
            "replies": []
        },
        {
            "body": "/sigh\n\nCircle back to your first comment. Attempting to make assumptions about me doesn't negate the fact that you're \"disagreeing\" with something that many SBs struggle with no matter how attractive they are.\n\nAlso, you're using your ethnicity as a pass to talk about black women. Stop. Just compliment OP without diminishing other people's experiences.",
            "author": "Chawkleeta",
            "id": "h5etwhj",
            "parent_id": "t1_h5epxq0",
            "score": 6,
            "created_utc": 1626451839.0,
            "replies": [
                {
                    "body": "My struggles are the same as your struggles. I struggle as a Latino man in the bowl therefore I try and make myself more attractive to SB’s. I workout, make more money, dress Well etc.",
                    "author": null,
                    "id": "h5eu57j",
                    "parent_id": "t1_h5etwhj",
                    "score": 1,
                    "created_utc": 1626451942.0,
                    "replies": [
                        {
                            "body": "Our experiences are not the same, and I will never know what it's like to be a Latino man. You will never know what it's like to be a Black woman, but if you want to be understanding and supportive it would be nice if you didn't generalize all of us and assume you have the simple solution to racial prejudice in the bowl.",
                            "author": "Chawkleeta",
                            "id": "h5euwtj",
                            "parent_id": "t1_h5eu57j",
                            "score": 5,
                            "created_utc": 1626452268.0,
                            "replies": [
                                {
                                    "body": "Ok I’m sorry if I came across a little insensitive to black women’s struggles in the bowl. \n\nBut you admit that the OP will have zero issue finding a SD as a beautiful woman, despite her race?",
                                    "author": null,
                                    "id": "h5eva2m",
                                    "parent_id": "t1_h5euwtj",
                                    "score": 2,
                                    "created_utc": 1626452424.0,
                                    "replies": [
                                        {
                                            "body": "It seems like you’re trying to compare apples and oranges. Minoritized groups experience discrimination in very different ways. It comes across as demeaning and ignorant when you try to negate the experiences of all Black women because you happen to find one (OP) that you find attractive and then on top of that try to equate your experiences as a latino MAN to that of a Black woman. You should’ve just complimented the OP instead of generalizing Black women. Your comments are a perfect example of the difficulties  Black women face in the bowl.\n\n\n\n\nThis profile is AMAZING by the way. I love your pics!",
                                            "author": "LongjumpingTiger5082",
                                            "id": "h5f3wvg",
                                            "parent_id": "t1_h5eva2m",
                                            "score": 6,
                                            "created_utc": 1626456083.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "My struggles are the same as your struggles. I struggle as a Latino man in the bowl therefore I try and make myself more attractive to SB’s. I workout, make more money, dress Well etc.",
            "author": null,
            "id": "h5eu57j",
            "parent_id": "t1_h5etwhj",
            "score": 1,
            "created_utc": 1626451942.0,
            "replies": [
                {
                    "body": "Our experiences are not the same, and I will never know what it's like to be a Latino man. You will never know what it's like to be a Black woman, but if you want to be understanding and supportive it would be nice if you didn't generalize all of us and assume you have the simple solution to racial prejudice in the bowl.",
                    "author": "Chawkleeta",
                    "id": "h5euwtj",
                    "parent_id": "t1_h5eu57j",
                    "score": 5,
                    "created_utc": 1626452268.0,
                    "replies": [
                        {
                            "body": "Ok I’m sorry if I came across a little insensitive to black women’s struggles in the bowl. \n\nBut you admit that the OP will have zero issue finding a SD as a beautiful woman, despite her race?",
                            "author": null,
                            "id": "h5eva2m",
                            "parent_id": "t1_h5euwtj",
                            "score": 2,
                            "created_utc": 1626452424.0,
                            "replies": [
                                {
                                    "body": "It seems like you’re trying to compare apples and oranges. Minoritized groups experience discrimination in very different ways. It comes across as demeaning and ignorant when you try to negate the experiences of all Black women because you happen to find one (OP) that you find attractive and then on top of that try to equate your experiences as a latino MAN to that of a Black woman. You should’ve just complimented the OP instead of generalizing Black women. Your comments are a perfect example of the difficulties  Black women face in the bowl.\n\n\n\n\nThis profile is AMAZING by the way. I love your pics!",
                                    "author": "LongjumpingTiger5082",
                                    "id": "h5f3wvg",
                                    "parent_id": "t1_h5eva2m",
                                    "score": 6,
                                    "created_utc": 1626456083.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Our experiences are not the same, and I will never know what it's like to be a Latino man. You will never know what it's like to be a Black woman, but if you want to be understanding and supportive it would be nice if you didn't generalize all of us and assume you have the simple solution to racial prejudice in the bowl.",
            "author": "Chawkleeta",
            "id": "h5euwtj",
            "parent_id": "t1_h5eu57j",
            "score": 5,
            "created_utc": 1626452268.0,
            "replies": [
                {
                    "body": "Ok I’m sorry if I came across a little insensitive to black women’s struggles in the bowl. \n\nBut you admit that the OP will have zero issue finding a SD as a beautiful woman, despite her race?",
                    "author": null,
                    "id": "h5eva2m",
                    "parent_id": "t1_h5euwtj",
                    "score": 2,
                    "created_utc": 1626452424.0,
                    "replies": [
                        {
                            "body": "It seems like you’re trying to compare apples and oranges. Minoritized groups experience discrimination in very different ways. It comes across as demeaning and ignorant when you try to negate the experiences of all Black women because you happen to find one (OP) that you find attractive and then on top of that try to equate your experiences as a latino MAN to that of a Black woman. You should’ve just complimented the OP instead of generalizing Black women. Your comments are a perfect example of the difficulties  Black women face in the bowl.\n\n\n\n\nThis profile is AMAZING by the way. I love your pics!",
                            "author": "LongjumpingTiger5082",
                            "id": "h5f3wvg",
                            "parent_id": "t1_h5eva2m",
                            "score": 6,
                            "created_utc": 1626456083.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Ok I’m sorry if I came across a little insensitive to black women’s struggles in the bowl. \n\nBut you admit that the OP will have zero issue finding a SD as a beautiful woman, despite her race?",
            "author": null,
            "id": "h5eva2m",
            "parent_id": "t1_h5euwtj",
            "score": 2,
            "created_utc": 1626452424.0,
            "replies": [
                {
                    "body": "It seems like you’re trying to compare apples and oranges. Minoritized groups experience discrimination in very different ways. It comes across as demeaning and ignorant when you try to negate the experiences of all Black women because you happen to find one (OP) that you find attractive and then on top of that try to equate your experiences as a latino MAN to that of a Black woman. You should’ve just complimented the OP instead of generalizing Black women. Your comments are a perfect example of the difficulties  Black women face in the bowl.\n\n\n\n\nThis profile is AMAZING by the way. I love your pics!",
                    "author": "LongjumpingTiger5082",
                    "id": "h5f3wvg",
                    "parent_id": "t1_h5eva2m",
                    "score": 6,
                    "created_utc": 1626456083.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "It seems like you’re trying to compare apples and oranges. Minoritized groups experience discrimination in very different ways. It comes across as demeaning and ignorant when you try to negate the experiences of all Black women because you happen to find one (OP) that you find attractive and then on top of that try to equate your experiences as a latino MAN to that of a Black woman. You should’ve just complimented the OP instead of generalizing Black women. Your comments are a perfect example of the difficulties  Black women face in the bowl.\n\n\n\n\nThis profile is AMAZING by the way. I love your pics!",
            "author": "LongjumpingTiger5082",
            "id": "h5f3wvg",
            "parent_id": "t1_h5eva2m",
            "score": 6,
            "created_utc": 1626456083.0,
            "replies": []
        }
    ]
}