{
    "title": "Any other SBs annoyed by all the girls hopping on the “trend” of having a SD?",
    "post_id": "kf75sl",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/kf75sl/any_other_sbs_annoyed_by_all_the_girls_hopping_on/",
    "author": "happylilegg",
    "body": "I just need to vent this out because it’s been sitting on my mind for a few months. I see it all over social media (insta, Twitter, tiktok) of girls signing up for different sugar websites and becoming rinsers. They make tiktok videos explaining how to make money off SDs but all the “advice” is how to get POTs to send money for texting and then ghost them if they try to meet up. \n\nI’m so incredibly annoyed by this behavior because it’s not sugaring at that point, you’re just scamming men. It also gives SBs an incredibly bad rep and ruins it for everyone else. \n\nThe tiktok videos I’ve seen essentially give the “advice” of telling POTs “oh well my former SD gave me xxx a week just to text/talk, and when we get more comfortable, we can meet in person”. They encourage never actually meeting in person, give a laundry list of excuses on why you can’t meet, and overall just trash “advice”. \n\nThis is absolutely terrible and dilutes the bowl for anyone actually seeking a true arrangement. I feel bad for SDs that fall into this trap and get taken advantage of by young girls desperate for money. \n\nCovid really had a harsh impact on the bowl (at least it feels like) and I can’t help but feel the need to blame all these scammers for making the rest of the 18-25 y/o SBs look bad. \n\nAnyone else noticing this too? I can’t be the only one going crazy by this. They paint SDs as lonely and gross men desperate for attention, but in my experience that’s so far from the truth. Most SDs don’t need your companionship, they give you money because they like seeing you succeed/happy. \n\nI feel like you can’t even tell these girls “hey maybe don’t ruin a good thing” because they literally don’t care. They’re just in it for themselves at the end of the day.",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/kf75sl/any_other_sbs_annoyed_by_all_the_girls_hopping_on/",
    "score": 282,
    "upvote_ratio": 0.93,
    "created_utc": 1608241901.0,
    "num_comments": 158,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "Extremely annoying because the flood SA making it harder to find us genuine ones",
            "author": null,
            "id": "gg6oaxa",
            "parent_id": "t3_kf75sl",
            "score": 83,
            "created_utc": 1608242044.0,
            "replies": [
                {
                    "body": "Extremely difficult! I’ve been accused of being a rinser for asking for partial allowance upfront because the POT wanted me to meet 2 hours from where I live. It was a mess trying to assure him that I’m not a scammer and honestly ruins the first impression.",
                    "author": "happylilegg",
                    "id": "gg6os26",
                    "parent_id": "t1_gg6oaxa",
                    "score": 25,
                    "created_utc": 1608242285.0,
                    "replies": [
                        {
                            "body": "When I know that POT SB is traveling some distance to meet at a place I suggested, of course I offer to cover Uber or gas. POT SB shouldn't even have to ask.",
                            "author": "kingporterstomp",
                            "id": "gg73vhp",
                            "parent_id": "t1_gg6os26",
                            "score": 46,
                            "created_utc": 1608249863.0,
                            "replies": [
                                {
                                    "body": "This is the way!!!",
                                    "author": "kirathekira",
                                    "id": "gg7xi7f",
                                    "parent_id": "t1_gg73vhp",
                                    "score": 10,
                                    "created_utc": 1608266322.0,
                                    "replies": []
                                },
                                {
                                    "body": "That is great of you. I would guess there are ladies who ask for money for help paying travel expenses for the first M&G and then ghost. :( I can see why some POT SDs would get skeptical of this then. I can also see why someone would want assistance traveling. SMH at these scammer girls and guys. They ruin it for others. Perhaps it can get back to some semblance of normalcy when COVID19 is over and people aren't trying to look for a quick buck?",
                                    "author": "Classy_Curves",
                                    "id": "ggc7vhy",
                                    "parent_id": "t1_gg73vhp",
                                    "score": 2,
                                    "created_utc": 1608360944.0,
                                    "replies": []
                                },
                                {
                                    "body": "Agree totally but then.. there is the above which is reality.  It has happened to me.",
                                    "author": "craa141",
                                    "id": "gg87a3m",
                                    "parent_id": "t1_gg73vhp",
                                    "score": 4,
                                    "created_utc": 1608273160.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Yeah that's really hard but you're swimming amidst a tidal wave of scammers. I have a 100% strict $0 before meeting in person. I will give you gas money in person the moment you walk up and you can turn around and walk away, but not $.01 before the m&g.",
                            "author": "mshmlkslf",
                            "id": "gge7kc2",
                            "parent_id": "t1_gg6os26",
                            "score": 3,
                            "created_utc": 1608408400.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "It’s incredibly frustrating. I commented on one of these TikTok videos calling it out as bad advice/not real sugaring and a few girls replied asking if I had any videos explaining what sugaring is really about. I don’t, and told them I’m not sure I’m ready to out myself publicly like that, but man. It’s tempting just to set the record straight.",
            "author": "FoxyFreckles1989",
            "id": "gg6scts",
            "parent_id": "t3_kf75sl",
            "score": 36,
            "created_utc": 1608244133.0,
            "replies": [
                {
                    "body": "girls just dont want to hear the cold hard truth that you have to fuck the men. i dont say that as a bad thing but the whole \"teach me how to get an sd!!!\" ... find an old man and fuck him idk what answer ur looking for",
                    "author": null,
                    "id": "gg85dxb",
                    "parent_id": "t1_gg6scts",
                    "score": 44,
                    "created_utc": 1608271672.0,
                    "replies": [
                        {
                            "body": "This has me rolling! 💀\n\n>\"teach me how to get an sd!!!\" ... find an old man and fuck him idk what answer ur looking for\n\nThis is the only piece of solid advice tbf, and personally, I would much rather ride an old horse and be guaranteed not only income, but an actual good time instead of messing around with these youngins whose idea of stimulating the g-spot is jack-hammering my cervix to pulp!",
                            "author": "QuirkyComplex",
                            "id": "gg8gml8",
                            "parent_id": "t1_gg85dxb",
                            "score": 23,
                            "created_utc": 1608281548.0,
                            "replies": [
                                {
                                    "body": "I am dying. 😂😂😂",
                                    "author": "FoxyFreckles1989",
                                    "id": "gg8vg22",
                                    "parent_id": "t1_gg8gml8",
                                    "score": 11,
                                    "created_utc": 1608295773.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "I think that’s (sadly) the real issue; not enough real SBs setting the record straight about what it is and what it could be for them (scammers and potential scammers)! Also, sometimes when you are forthright, you might get those people who will talk crap about you for being a SB. So they take the advice of the scammers and run with it. Sucks all around.",
                    "author": "AmazonTeddy",
                    "id": "gg7stsi",
                    "parent_id": "t1_gg6scts",
                    "score": 10,
                    "created_utc": 1608263662.0,
                    "replies": []
                },
                {
                    "body": "That’s the thing - I’m not willing to out myself but I can’t stand all this misinformation.",
                    "author": "happylilegg",
                    "id": "gg6tm0k",
                    "parent_id": "t1_gg6scts",
                    "score": 13,
                    "created_utc": 1608244797.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gg6oimi",
            "parent_id": "t3_kf75sl",
            "score": 58,
            "created_utc": 1608242152.0,
            "replies": [
                {
                    "body": "ESPECIALLY TikTok! I just watched a 6 part series of a girl explaining how she makes 300/day by scamming men. Like ??? Why is this something you do for fun??",
                    "author": "happylilegg",
                    "id": "gg6ozk9",
                    "parent_id": "t1_gg6oimi",
                    "score": 59,
                    "created_utc": 1608242391.0,
                    "replies": [
                        {
                            "body": "Because she is making 70k tax free thats why (if honest)\n\nI had a ex semi rinser SB in my more studly days early 30s over 13 years ago she was making 1k a week scamming \"old dudes\" as she said. Since I was early 30s tbey sure seemed old to me too.",
                            "author": "bookworm010101",
                            "id": "gg7dpur",
                            "parent_id": "t1_gg6ozk9",
                            "score": 10,
                            "created_utc": 1608255194.0,
                            "replies": [
                                {
                                    "body": "There's no fool like an old fool",
                                    "author": null,
                                    "id": "gg8dy1n",
                                    "parent_id": "t1_gg7dpur",
                                    "score": 3,
                                    "created_utc": 1608278958.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "oh man! when i was around not sure tik tok was a thing...and what was the technique?",
                            "author": "MiLocavida",
                            "id": "gg6t17z",
                            "parent_id": "t1_gg6ozk9",
                            "score": 8,
                            "created_utc": 1608244494.0,
                            "replies": [
                                {
                                    "body": "I only heard of it in the past year -it’s really blown up. \nShe was explaining how she would make accounts, set a random location, and message hundreds of guys the same copy + pasted line: “Well my old sugar daddy used to pay me about  💯 per week to talk and text. And then we were comfortable, we met, and he paid more” \nShe just leads them on, gives them excuses on why she can’t meet up yet, and finds new ones when they stop paying.",
                                    "author": "happylilegg",
                                    "id": "gg6tje6",
                                    "parent_id": "t1_gg6t17z",
                                    "score": 14,
                                    "created_utc": 1608244760.0,
                                    "replies": [
                                        {
                                            "body": "Can confirm.\n\nI have received nearly that exavy cut-paste message. \n\n <block> and move on is an instant reflex now.",
                                            "author": "TXPolyDaddy",
                                            "id": "gg7pene",
                                            "parent_id": "t1_gg6tje6",
                                            "score": 16,
                                            "created_utc": 1608261721.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "My response: Well my last SB slept with me for free for 6 months to make sure she liked the chemistry.  We should start with that.",
                                            "author": "LotBuilder",
                                            "id": "gg7qs4i",
                                            "parent_id": "t1_gg6tje6",
                                            "score": 28,
                                            "created_utc": 1608262515.0,
                                            "replies": [
                                                {
                                                    "body": "That is funny as fuck!!",
                                                    "author": "9Voices2020",
                                                    "id": "gg90tnl",
                                                    "parent_id": "t1_gg7qs4i",
                                                    "score": 6,
                                                    "created_utc": 1608299556.0,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "body": "Yep I saw this too!",
                                            "author": "newfence1",
                                            "id": "gg6vc7u",
                                            "parent_id": "t1_gg6tje6",
                                            "score": 5,
                                            "created_utc": 1608245702.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "> for fun\n\n300/day is no longer doing it \"for fun\". That's a career, baby.",
                            "author": "This_is_Not_My_Handl",
                            "id": "gg83wjs",
                            "parent_id": "t1_gg6ozk9",
                            "score": 9,
                            "created_utc": 1608270562.0,
                            "replies": []
                        },
                        {
                            "body": "karma will catch up to her :)",
                            "author": null,
                            "id": "gg6rd9m",
                            "parent_id": "t1_gg6ozk9",
                            "score": 25,
                            "created_utc": 1608243615.0,
                            "replies": [
                                {
                                    "body": "... eventually.",
                                    "author": null,
                                    "id": "gg8dv02",
                                    "parent_id": "t1_gg6rd9m",
                                    "score": 4,
                                    "created_utc": 1608278878.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "I think i know which tiktok you’re saying. I watched until the second video and it’s so annoying how they portray a sugar relationship. 😪😪😪I looked at the comments and oooooffff",
                            "author": "cranerish",
                            "id": "gg8ppb4",
                            "parent_id": "t1_gg6ozk9",
                            "score": 5,
                            "created_utc": 1608290599.0,
                            "replies": []
                        },
                        {
                            "body": "I imagine that some of these girls delude themselves into thinking of these men as Johns who are only interested in exploiting desperate girls for sex, and that it is somehow \"justified\" to trick them into losing money. In many ways being able to pretend that you are not doing something awful is more insidious than if you were just outright playing a villein. Although I am guessing some of them do that as well.",
                            "author": "LookingForTrueStuff",
                            "id": "gg6rg02",
                            "parent_id": "t1_gg6ozk9",
                            "score": 12,
                            "created_utc": 1608243655.0,
                            "replies": [
                                {
                                    "body": "Yep, we had one in here last week! She mentioned that her SD “preyed” on young women and when I was like wait what’s going on, it turned out that he just had the audacity to consensually date other adults with an age gap. Sigh.... kids!",
                                    "author": null,
                                    "id": "gg7azoi",
                                    "parent_id": "t1_gg6rg02",
                                    "score": 16,
                                    "created_utc": 1608253644.0,
                                    "replies": []
                                },
                                {
                                    "body": "It's the opposite side of the \"Red Pill\" guys that think all women are hoes and should be treated as such.  They give each other \"high fives\" for manipulating and controlling women.  \n\nThe good news is that these people are never happy people and never find a happy relationship.  Both types of people don't respect the opposite sex and as a result are never respected by their partners.",
                                    "author": "willfromvb",
                                    "id": "gg8no30",
                                    "parent_id": "t1_gg6rg02",
                                    "score": 6,
                                    "created_utc": 1608288574.0,
                                    "replies": [
                                        {
                                            "body": "So recently it was 'incels' now it's 'red pill' it seems like we are collecting way too many terms for being an asshole.",
                                            "author": "LookingForTrueStuff",
                                            "id": "gg9mhci",
                                            "parent_id": "t1_gg8no30",
                                            "score": 5,
                                            "created_utc": 1608310497.0,
                                            "replies": [
                                                {
                                                    "body": "No!  Incels (involuntary celibate) is the insulting name \"Red Pill\" type of guys call other guys that don't disrespect women enough in their mind. It's just a way to call someone weak and say that they can't get laid.",
                                                    "author": "willfromvb",
                                                    "id": "ggabrik",
                                                    "parent_id": "t1_gg9mhci",
                                                    "score": 3,
                                                    "created_utc": 1608321207.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "I think we watched the same videos is her username @callikoa? She seriously talks like a scammer and so many girls are now trying her methods.",
                            "author": "sugarlove05",
                            "id": "gg7cslz",
                            "parent_id": "t1_gg6ozk9",
                            "score": 5,
                            "created_utc": 1608254663.0,
                            "replies": []
                        },
                        {
                            "body": "Sounds like a sociopath or unbelievably selfish person. It'll catch up with her.",
                            "author": "Classy_Curves",
                            "id": "ggc7z0r",
                            "parent_id": "t1_gg6ozk9",
                            "score": 2,
                            "created_utc": 1608361033.0,
                            "replies": []
                        },
                        {
                            "body": "As long as there are idiots who fall for it, scammers make money and get rich. I instantly block or next such profiles. Around 30% online and fake profiles, about 30% platonic and 30% toe dippers in my area. SA is just a sad place to find a SB these days.",
                            "author": "MrBrownv",
                            "id": "gga8c9g",
                            "parent_id": "t1_gg6ozk9",
                            "score": 1,
                            "created_utc": 1608319721.0,
                            "replies": []
                        },
                        {
                            "body": "I know exactly which girl you’re talking about and I was in shock!!",
                            "author": "EntertainerStandard",
                            "id": "ggbmyg7",
                            "parent_id": "t1_gg6ozk9",
                            "score": 1,
                            "created_utc": 1608346188.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Everyone talks about how TikTok is so addicting but I feel like if I did download it I'd just be in a rage all the time lmao",
                    "author": null,
                    "id": "gg6p0z9",
                    "parent_id": "t1_gg6oimi",
                    "score": 13,
                    "created_utc": 1608242411.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "gg6q7l0",
                            "parent_id": "t1_gg6p0z9",
                            "score": 18,
                            "created_utc": 1608243017.0,
                            "replies": [
                                {
                                    "body": "I just stick to Youtube for my mindless viewing needs lmao",
                                    "author": null,
                                    "id": "gg6ratn",
                                    "parent_id": "t1_gg6q7l0",
                                    "score": 8,
                                    "created_utc": 1608243581.0,
                                    "replies": []
                                },
                                {
                                    "body": "My little dog and I watch animal videos on there together in the morning before the alarm goes off. It’s lovely if you don’t look under the rocks.",
                                    "author": null,
                                    "id": "gg7b53d",
                                    "parent_id": "t1_gg6q7l0",
                                    "score": 5,
                                    "created_utc": 1608253729.0,
                                    "replies": [
                                        {
                                            "body": "That’s so funny and cute! Lol",
                                            "author": "AmazonTeddy",
                                            "id": "gg7r5i4",
                                            "parent_id": "t1_gg7b53d",
                                            "score": 2,
                                            "created_utc": 1608262730.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "gg6rkyn",
                                    "parent_id": "t1_gg6q7l0",
                                    "score": 4,
                                    "created_utc": 1608243728.0,
                                    "replies": [
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "gg6rvpf",
                                            "parent_id": "t1_gg6rkyn",
                                            "score": 4,
                                            "created_utc": 1608243881.0,
                                            "replies": [
                                                {
                                                    "body": "don't have tik tok but now i'm intrigued, do you search topics like on youtube or how do you find these videos?",
                                                    "author": "MiLocavida",
                                                    "id": "gg6t5i2",
                                                    "parent_id": "t1_gg6rvpf",
                                                    "score": 1,
                                                    "created_utc": 1608244558.0,
                                                    "replies": []
                                                },
                                                {
                                                    "body": "I would love to have a SM rather than a SD. I love women in general.",
                                                    "author": "Parking-Dimension-30",
                                                    "id": "gg8lb4e",
                                                    "parent_id": "t1_gg6rvpf",
                                                    "score": 1,
                                                    "created_utc": 1608286148.0,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "ggav2av",
                                            "parent_id": "t1_gg6rkyn",
                                            "score": 1,
                                            "created_utc": 1608330180.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Don’t do it - it sucks you in with mindless content. I’m hooked and this might just be the thing that makes me ragequit. LOL",
                            "author": "happylilegg",
                            "id": "gg6qjhk",
                            "parent_id": "t1_gg6p0z9",
                            "score": 2,
                            "created_utc": 1608243187.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Yesss tik tok is full of girls pretending they’re sugar babies, strippers, OF girls. Then you hear their advice and experiences like 🤔🤔 it’s clear they’re mostly looking to become influencers I think",
                    "author": "strt31",
                    "id": "gg7ofz4",
                    "parent_id": "t1_gg6oimi",
                    "score": 4,
                    "created_utc": 1608261181.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I solve most of that easily: I only communicate with women who are 30 and older.",
            "author": "Mining4Gold2",
            "id": "gg7glqh",
            "parent_id": "t3_kf75sl",
            "score": 15,
            "created_utc": 1608256814.0,
            "replies": [
                {
                    "body": "Not all young women are like that!",
                    "author": "Truetomyselfxo",
                    "id": "gga35cf",
                    "parent_id": "t1_gg7glqh",
                    "score": 3,
                    "created_utc": 1608317485.0,
                    "replies": []
                },
                {
                    "body": "There certainly are advantages to older women.",
                    "author": "Classy_Curves",
                    "id": "ggc8hkb",
                    "parent_id": "t1_gg7glqh",
                    "score": 2,
                    "created_utc": 1608361508.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I pretend I do not see it 🙈",
            "author": "curly_spice",
            "id": "gg6oa89",
            "parent_id": "t3_kf75sl",
            "score": 12,
            "created_utc": 1608242034.0,
            "replies": [
                {
                    "body": "I also want to pretend I didn’t see it because ya know, get your bag girl, but aalllsooo it ruins it for the rest of us! I’m conflicted but frustrated nonetheless",
                    "author": "happylilegg",
                    "id": "gg6olaq",
                    "parent_id": "t1_gg6oa89",
                    "score": 7,
                    "created_utc": 1608242189.0,
                    "replies": [
                        {
                            "body": "No I totally get that! It kind of makes me feel bad as an SB in that age range who genuinely wants to have successful arrangements, rather than being another young + dumb rinser.",
                            "author": "curly_spice",
                            "id": "gg6or8z",
                            "parent_id": "t1_gg6olaq",
                            "score": 8,
                            "created_utc": 1608242273.0,
                            "replies": [
                                {
                                    "body": "I’m in that age range too - it’s awful that we have the rep of being rinsers/young/dumb just because all these girls :/",
                                    "author": "happylilegg",
                                    "id": "gg6ovsh",
                                    "parent_id": "t1_gg6or8z",
                                    "score": 8,
                                    "created_utc": 1608242338.0,
                                    "replies": [
                                        {
                                            "body": "You forgot to mention toe dippers (a LOT of them!) :-D",
                                            "author": "SeekingInSydney",
                                            "id": "jgozrl1",
                                            "parent_id": "t1_gg6ovsh",
                                            "score": 1,
                                            "created_utc": 1681784084.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I feel the same way. I get so pissed cause you go and look at the comments and everyone is eating this shit up like it's ok?? Saw one video where a girl gave a \"tutorial\" on how to \"catfish a SD\" and I LOST it",
            "author": "w4termelonsug4r",
            "id": "gg6qkhi",
            "parent_id": "t3_kf75sl",
            "score": 12,
            "created_utc": 1608243201.0,
            "replies": [
                {
                    "body": "And if you dare tell them this is not what being an actual SB is, everyone would trash you in the comments!",
                    "author": "happylilegg",
                    "id": "gg6qu9v",
                    "parent_id": "t1_gg6qkhi",
                    "score": 7,
                    "created_utc": 1608243342.0,
                    "replies": [
                        {
                            "body": "have you ever considered that while the people in the comments may be “eating it up”, the vast majority of them are never even going to attempt it? And even if they did, how far do you realistically think they’re going to get? Probably not very. In fact why would you even believe the videos? Lots of people lie on the internet. Just don’t worry about them, a handful of people aren’t “ruining the bowl” for anyone.",
                            "author": "BellaBlissNYC",
                            "id": "gg7ww5q",
                            "parent_id": "t1_gg6qu9v",
                            "score": 4,
                            "created_utc": 1608265969.0,
                            "replies": [
                                {
                                    "body": "Bingo, I meet these girls on SA all day long and they last a few days, tops. They want 'platonic spoiling', don't ever want to meet, don't try and get to know you in the slightest, and then they're gone.",
                                    "author": "mshmlkslf",
                                    "id": "gge80fz",
                                    "parent_id": "t1_gg7ww5q",
                                    "score": 3,
                                    "created_utc": 1608408640.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I feel you, and we are sharing this pain. It is so hard right now for legit SDs and SBs to find each other.\n\nYou are right on every count, and I'm not trying to shift blame or anything, but I'm just wondering why you or other SBs bothered by this trend don't make your own videos advocating for a more ethical approach to sugar dating and the benefits it has?",
            "author": "LookingForTrueStuff",
            "id": "gg6qm19",
            "parent_id": "t3_kf75sl",
            "score": 10,
            "created_utc": 1608243224.0,
            "replies": [
                {
                    "body": "I would love to clarify this topic, but am terrified of outing myself to family/friends/professors/whoever knows me as a SB. I’m sure there are SBs that advocate the ethical way but I haven’t seen their videos. If I wasn’t bound by traditional/conservative family, I totally would.",
                    "author": "happylilegg",
                    "id": "gg6r9vk",
                    "parent_id": "t1_gg6qm19",
                    "score": 19,
                    "created_utc": 1608243568.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "The bowl is polluted atm. SA is losing money, fast. Cancelled my D sub last week. If they don't make changes, they'll lose the rest of their subs before the end of next year.",
            "author": "ProRussian_88",
            "id": "gg6twk3",
            "parent_id": "t3_kf75sl",
            "score": 6,
            "created_utc": 1608244950.0,
            "replies": [
                {
                    "body": "I heard SA is even raising their prices!  (Unverified)",
                    "author": "TXPolyDaddy",
                    "id": "gg7q72t",
                    "parent_id": "t1_gg6twk3",
                    "score": 3,
                    "created_utc": 1608262179.0,
                    "replies": []
                },
                {
                    "body": "It’s unfortunate all around!",
                    "author": "AmazonTeddy",
                    "id": "gg7w89b",
                    "parent_id": "t1_gg6twk3",
                    "score": 1,
                    "created_utc": 1608265577.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "One girl messaged me on here the other day because she saw on TikTok that “Reddit is an easy way to make money.”  Tried to help her so she doesn’t get scammed but oh well",
            "author": null,
            "id": "gg73hoz",
            "parent_id": "t3_kf75sl",
            "score": 8,
            "created_utc": 1608249676.0,
            "replies": []
        },
        {
            "body": "Most of these girls see a few hundred dollars as a lot of money and can’t even fathom the big picture.  That being said,  any SD sending money before meeting is a idiot.  When guys stop doing it,  girls like this will get frustrated and go away.",
            "author": "LotBuilder",
            "id": "gg7pbxz",
            "parent_id": "t3_kf75sl",
            "score": 6,
            "created_utc": 1608261679.0,
            "replies": [
                {
                    "body": "WYP recommends people pay half before meeting and half after.",
                    "author": "Classy_Curves",
                    "id": "ggc94u9",
                    "parent_id": "t1_gg7pbxz",
                    "score": 2,
                    "created_utc": 1608362110.0,
                    "replies": [
                        {
                            "body": "Well,  I don’t give anyone money that I have not met.",
                            "author": "LotBuilder",
                            "id": "ggcafzo",
                            "parent_id": "t1_ggc94u9",
                            "score": 2,
                            "created_utc": 1608363378.0,
                            "replies": [
                                {
                                    "body": "Considering how many young SBs are scamming people I can see why.",
                                    "author": "Classy_Curves",
                                    "id": "ggcapto",
                                    "parent_id": "t1_ggcafzo",
                                    "score": 3,
                                    "created_utc": 1608363642.0,
                                    "replies": [
                                        {
                                            "body": "Why would they meet up with guys is they can get hundreds per day ?",
                                            "author": "LotBuilder",
                                            "id": "ggcasyg",
                                            "parent_id": "t1_ggcapto",
                                            "score": 2,
                                            "created_utc": 1608363726.0,
                                            "replies": [
                                                {
                                                    "body": "I have a feeling that is a bit of an exaggeration but I get where you're going with it. I also think it'd be exhausting work to keep trying to find new people then quickly ghost them. Constantly creating new identities and \"fishing\" for new victims is so time consuming. I can't imagine doing it. Taking pictures and videos of my feet is time consuming enough.",
                                                    "author": "Classy_Curves",
                                                    "id": "ggcbu6i",
                                                    "parent_id": "t1_ggcasyg",
                                                    "score": 2,
                                                    "created_utc": 1608364737.0,
                                                    "replies": [
                                                        {
                                                            "body": "Really... compared to a typical retail,  childcare restaurant job where you are on your feet all day busting your ass it’s “time consuming” to take a few pics.   One of my SB’s worked at a daycare whiling kids butts all dat for two bucks above minimum wage.  She would gladly spend 8 hours a day texting guys for a few hundred a day.  It’s not hard work",
                                                            "author": "LotBuilder",
                                                            "id": "ggccefo",
                                                            "parent_id": "t1_ggcbu6i",
                                                            "score": 2,
                                                            "created_utc": 1608365298.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I’m grateful for it, I think it reminds my sugar daddy not to take me for granted bc finding a legitimate sugar partner right now is a shit show.",
            "author": "inplainsight221",
            "id": "gg6p6nf",
            "parent_id": "t3_kf75sl",
            "score": 17,
            "created_utc": 1608242490.0,
            "replies": [
                {
                    "body": "Yeah I’m kinda sitting back gloating right now since my former SD seemed to prioritize his needs over mine. \n\nGo forth and prosper bro 😄",
                    "author": null,
                    "id": "gg71x98",
                    "parent_id": "t1_gg6p6nf",
                    "score": 8,
                    "created_utc": 1608248932.0,
                    "replies": []
                },
                {
                    "body": "An absolute shit show",
                    "author": "happylilegg",
                    "id": "gg6qp70",
                    "parent_id": "t1_gg6p6nf",
                    "score": 1,
                    "created_utc": 1608243269.0,
                    "replies": []
                },
                {
                    "body": "That part!!",
                    "author": "LostAngelesThrowaway",
                    "id": "gghmrdr",
                    "parent_id": "t1_gg6p6nf",
                    "score": 1,
                    "created_utc": 1608480111.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I’m very curious as to whether this reaches saturation at some point — SDs are all educated to the rinsing/scamming behavior and are savvy enough not to feed the problem — or if there will always be a sufficient supply of fools to be separated from their money.",
            "author": "LaGriffeDuLion",
            "id": "gg6rve3",
            "parent_id": "t3_kf75sl",
            "score": 6,
            "created_utc": 1608243877.0,
            "replies": [
                {
                    "body": "Unfortunately, there will always be new people that haven’t done enough research to know red flags.",
                    "author": "happylilegg",
                    "id": "gg6tpke",
                    "parent_id": "t1_gg6rve3",
                    "score": 3,
                    "created_utc": 1608244850.0,
                    "replies": [
                        {
                            "body": "In my eyes, that's 100% SDs fault.",
                            "author": "dullnailfile",
                            "id": "ggai4gp",
                            "parent_id": "t1_gg6tpke",
                            "score": 1,
                            "created_utc": 1608323974.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Maybe it’s fine then. The scammers and the losers - I guess there’s a nut for every bolt 😅",
                    "author": "strt31",
                    "id": "gg7oqj1",
                    "parent_id": "t1_gg6rve3",
                    "score": 0,
                    "created_utc": 1608261347.0,
                    "replies": [
                        {
                            "body": "That is pretty shitty.   \n\nThere are sincere, yet not at all competitive, young women that come on here looking for advice.  They have almost no hope of finding a genuine SR and end up swamped with scammers.   They don't deserve that, they are likely just naive. The truth, if listened to, could save them a lot of heart ache.  \n\nAnyone who knowingly engages to scam someone deserves way more than just scorn.   The money is really the least of the damage.",
                            "author": "TXPolyDaddy",
                            "id": "gg7q35f",
                            "parent_id": "t1_gg7oqj1",
                            "score": 4,
                            "created_utc": 1608262116.0,
                            "replies": [
                                {
                                    "body": "No I agree! anyone knowingly scamming is selfish and taking advantage of an innocent person. There are scammers on both sides and I was just addressing the question about the bowl getting saturated, not the morality of it. I don’t think it will get saturated because the vulnerable will keep getting scammed as long as there’s scammers and vice versa.",
                                    "author": "strt31",
                                    "id": "gg8e9kz",
                                    "parent_id": "t1_gg7q35f",
                                    "score": 2,
                                    "created_utc": 1608279256.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gg7ap1m",
            "parent_id": "t3_kf75sl",
            "score": 6,
            "created_utc": 1608253480.0,
            "replies": []
        },
        {
            "body": "I literally felt seen reading this. It really diminishes the nature of the relationship and makes these men more wary to communicate because they're expecting be scammed. I'm an older SB (31) so I already have it a bit harder but this \"trend\" making my lifestyle a fad is not cute.",
            "author": "kenziikenz",
            "id": "gg7l942",
            "parent_id": "t3_kf75sl",
            "score": 6,
            "created_utc": 1608259412.0,
            "replies": []
        },
        {
            "body": "it is not just annoying - there was a thread some time ago where a SB put herself in a situation that went badly because she listened to those videos - there are very serious consequences for the BS that they are selling - AND its as annoying af too",
            "author": "thereadinessisall",
            "id": "gg7mcls",
            "parent_id": "t3_kf75sl",
            "score": 6,
            "created_utc": 1608260025.0,
            "replies": [
                {
                    "body": "Really? Now I'm curious.",
                    "author": "Classy_Curves",
                    "id": "ggc8ucj",
                    "parent_id": "t1_gg7mcls",
                    "score": 3,
                    "created_utc": 1608361837.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I filtered out that type of noise years ago. The last sentence of my profile writeup says: \"let's meet for coffee during the day in a place of your choosing, and let me know you're up for that in your first communication with me.\"\n\nThat filters out 98% of the noise/rinsers/scammers, etc.  It also reduces the number of SB's who contact me. It also filters out the SB's who don't read my full profile (and are just sending mass messages/likes to a million SD's). \n\nThat's the only solution I've found. If I didn't do it that way, it would take 10 to 20 hours per week to filter through all the noise, messages, calls, etc, just to get to a M&G. \n\nThis method keeps the time I spend on SA (viewing messages) down to a few minutes per week.\n\nI'll probably spend more time in the future 'freestyling', which might be more time efficient than SA at this point.",
            "author": "Nomad_Bill",
            "id": "gg7skdh",
            "parent_id": "t3_kf75sl",
            "score": 6,
            "created_utc": 1608263521.0,
            "replies": []
        },
        {
            "body": "It’s annoying us SD’s too. They have no damn clue what they are doing.",
            "author": "mraspencer",
            "id": "gg79qce",
            "parent_id": "t3_kf75sl",
            "score": 6,
            "created_utc": 1608252937.0,
            "replies": []
        },
        {
            "body": "Completely annoyed. It makes things a lot harder on the genuine SB’s. I feel like this is exactly why we encounter a lot more scams and ones that stand us up. We’re unable to confirm meets now because so many “SB’s” are scamming these men, long enough to get something for nothing and then blocking them! It’s like the new thing these days and I’m really not enjoying it.",
            "author": "BeautifulDisaster_1",
            "id": "gg7ciia",
            "parent_id": "t3_kf75sl",
            "score": 5,
            "created_utc": 1608254501.0,
            "replies": []
        },
        {
            "body": "I totally agree with you, I think TikTok is the absolute worst at it. I’ve seen dozens of videos of girls explaining how they’ve “scammed” these men and they don’t even have to meet them and the comments are full of young and mostly underage girls wanting the same. I genuinely enjoy being a sb and the thought of scamming these men just to make a quick dollar is pretty messed up. In my head, I feel like 2017 was the best year to find or be a sb. Because there wasn’t as many girls on seeking and it was more fun and genuine when it came to finding a sd.",
            "author": "SugarbabeNikki",
            "id": "gg8topy",
            "parent_id": "t3_kf75sl",
            "score": 5,
            "created_utc": 1608294352.0,
            "replies": [
                {
                    "body": "Can confirm, that’s when I started. It was far less crowded than it is now.",
                    "author": "LostAngelesThrowaway",
                    "id": "gghrsmn",
                    "parent_id": "t1_gg8topy",
                    "score": 1,
                    "created_utc": 1608482639.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "A girl in my town posted the most cringe worthy video I’ve ever seen in my life the other day.... I wanted to curl into a ball and die watching it. “ITS NOT MY FAULT OLD MEN WANT TO OBJECTIFY ME AND PAY ME TO GO OUT FOR DINNER..” etc etc... okay hunny... ugh. It’s so bad.",
            "author": "Spacerangerbabe",
            "id": "gg9betj",
            "parent_id": "t3_kf75sl",
            "score": 4,
            "created_utc": 1608305451.0,
            "replies": []
        },
        {
            "body": "Literally yes. I’m 21 and have been sugaring since I was 18/19 and it so exhausting seeing people be like “I want a sugar daddy without the sugar” and then argue that plenty of girls do online sexwork without meeting up when I tell them they’re not gonna find that. Meanwhile those girls they’re talking about are professional financial dominatrix and shit like that who are professional cyber sluts! Online sugaring & sexwork IS possible if ur a pro who can still provide what the daddy/client needs but it’s rare & these girls expect that same salary just for sending selfie’s to guys. Some of them don’t even wanna send nudes or do video chats!! It’s so annoying but I chop it up to none of those girls have what it takes to be a sexworker anyways, they just wanna be a stay at home girlfriend and need to find a rich boyfriend to take care of them.",
            "author": "AliceBangz",
            "id": "gg7jxef",
            "parent_id": "t3_kf75sl",
            "score": 8,
            "created_utc": 1608258667.0,
            "replies": []
        },
        {
            "body": "Sadly, I’ve had to add in to all my messages I initially send now “not looking for online only arrangements, wanting to meet”",
            "author": "rambade",
            "id": "gg79mj7",
            "parent_id": "t3_kf75sl",
            "score": 4,
            "created_utc": 1608252877.0,
            "replies": []
        },
        {
            "body": "I have been trying to be a sugar baby and learn more about it for a while and i laughed my ass off when i seen those videos on tiktok the 1st thought i had is this girl just trying to get views",
            "author": "ElizaS2073",
            "id": "gg7gte7",
            "parent_id": "t3_kf75sl",
            "score": 5,
            "created_utc": 1608256932.0,
            "replies": []
        },
        {
            "body": "Hopefully this trend will die once the pandemic ends and people aren't spending so much time at home.",
            "author": "chloe_aw",
            "id": "gg7yozf",
            "parent_id": "t3_kf75sl",
            "score": 4,
            "created_utc": 1608267023.0,
            "replies": []
        },
        {
            "body": "I just saw a tiktok vid last night on this exact thing and I thought the same - this isn’t sugar dating, it’s a scam. But honestly I love that there are so many girls like this because it makes me SHINEEEEEE BABYYYY. Just by not being a scammer I stand out ten fold. SDs are so appreciative and relieved when they finally get to chat with the real deal.",
            "author": "newfence1",
            "id": "gg6v9rd",
            "parent_id": "t3_kf75sl",
            "score": 7,
            "created_utc": 1608245667.0,
            "replies": [
                {
                    "body": "EXACTLY!",
                    "author": "LostAngelesThrowaway",
                    "id": "gghnw0r",
                    "parent_id": "t1_gg6v9rd",
                    "score": 1,
                    "created_utc": 1608480575.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yeah I hate them. I also hate when one of my friends try to get in the lifestyle because they’re never serious so I just stopped helping them.",
            "author": "periodpooh46",
            "id": "gg7m56c",
            "parent_id": "t3_kf75sl",
            "score": 3,
            "created_utc": 1608259914.0,
            "replies": []
        },
        {
            "body": "These girls can be eliminated very quickly by pushing to a M&G within a short period of time (1 week) . If they won't/can't meet you can check them off your pot list.",
            "author": "GSSD",
            "id": "gg92pyb",
            "parent_id": "t3_kf75sl",
            "score": 3,
            "created_utc": 1608300720.0,
            "replies": []
        },
        {
            "body": "I don't think anyone with money is going to be put off because of the presence of scammers. \n\nThe entire world is people trying to scam you out of your money and always has been.",
            "author": "ifisch",
            "id": "gg6p693",
            "parent_id": "t3_kf75sl",
            "score": 5,
            "created_utc": 1608242485.0,
            "replies": [
                {
                    "body": "In my most recent experience, I had to reassure my SD that I wouldn’t just ghost him after our date because that’s how his first experience went. I think that’s really overshadowing my logic right now, but this really grinds my gears because of how crappy it is to scam someone. On top of that, these girls are marketing it as just how to be a SB or SB101. If you didn’t know anything about the bowl, you’d think that was okay to scam these guys. :/ I know I can’t do anything about it, but it just isn’t right.",
                    "author": "happylilegg",
                    "id": "gg6qbjz",
                    "parent_id": "t1_gg6p693",
                    "score": 6,
                    "created_utc": 1608243074.0,
                    "replies": [
                        {
                            "body": ">these girls are marketing it as just how to be a SB or SB101\n\nand how do i find these topics on tik tok? don't even have the app but curious to see what the tehniques are nowadays. Glad i'm out of the bowl...",
                            "author": "MiLocavida",
                            "id": "gg6tbyc",
                            "parent_id": "t1_gg6qbjz",
                            "score": 2,
                            "created_utc": 1608244652.0,
                            "replies": [
                                {
                                    "body": "I’ll pm you!",
                                    "author": "happylilegg",
                                    "id": "gg6tzua",
                                    "parent_id": "t1_gg6tbyc",
                                    "score": 2,
                                    "created_utc": 1608244999.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": ">I don't think anyone with money is going to be put off because of the presence of scammers.\n\nThat is a foolish thought.   \n\n\nAs a SD my guard is 100% up at all times and especially at the beginning I'm looking for a reason to run (asking for money upfront, platonic only, online only, pic/video sellers).   \n\n\nIt only takes falling for it 1,952 times to learn a lesson ;)   \n\n\nAlso, I didn't renew my membership due to college being out and the rise of online only babies that SA allows.  That takes me and my sugar fund out of the bowl along with anyone else who feels the same way.   \n\n\nSA isn't going to crack down on it because they need the numbers to keep rising and new girls (real or fake) on the site to keep men interested and coming back for more.   \n\n\nSA doesn't care about making it harder for SB or SD to find each other, they just focus on growth and maybe an eventual exit.   \n\n\nSorry to crash your thread ladies, you all look amazing and skinny as ever. Whatever you're doing, it's working, keep it up.",
                    "author": "TexasSD",
                    "id": "gg6vlo4",
                    "parent_id": "t1_gg6p693",
                    "score": 4,
                    "created_utc": 1608245840.0,
                    "replies": []
                }
            ]
        },
        {
            "body": ">. They make tiktok videos explaining how to make money off SDs\n\nI discovered that there are a healthy amount of YouTube channels dedicated to this topic too. Some of them have substantial followings eg. Codenamechanel and her \"Finesse Fam\"  - a community she runs and monetizes via Patreon. On the one hand I can't help but admire the entrepreneurship - there is a lot of content that has been produced - but on the other hand, she is separating unsuspecting SBs from their money in exchange for \"teaching\" them how to \"finesse\" or separate unsuspecting SDs from their money. Not sure which is worse\n\nSeparate but related: despite the heavily anti-SD slant, @theclownlife on Instagram is pretty hilarious for Sugar Baby/Daddy memes",
            "author": "London-SD",
            "id": "gg79cvl",
            "parent_id": "t3_kf75sl",
            "score": 4,
            "created_utc": 1608252725.0,
            "replies": [
                {
                    "body": "What ever happened to theclownlife and miaishighvalue ?",
                    "author": "mdmafortune",
                    "id": "j7nil1i",
                    "parent_id": "t1_gg79cvl",
                    "score": 1,
                    "created_utc": 1675821355.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Really no need to give it any thought or attention  in my opinion. This has always been happening, and it always will happen. You’re only “seeing” more of it now because of modern platforms. This business has never been easy to navigate; if it was, everyone would do it. Both SBs and SDs just need to know how to weed out he wrong ones and how to find the right ones. That has always been the case, and always will be. The wrong ones will always be weeded out from either side, it doesn’t and won’t benefit you in any way to spend your time and energy fuming over time wasters or fakes. In the long run, who is going to end up in a better arrangement/making more money, you, or the fake? Time is money, don’t waste yours on things like this.",
            "author": "BellaBlissNYC",
            "id": "gg7c17q",
            "parent_id": "t3_kf75sl",
            "score": 5,
            "created_utc": 1608254228.0,
            "replies": []
        },
        {
            "body": "> They paint SDs as lonely and gross men desperate for attention, but in my experience that’s so far from the truth.\n\nThis is actually my FAVORITE part, lol! I get the biggest kick outta those nitwits who think none of us have enough \"game\" to have any kind of a gorgeous companion just for the sake of spending time with someone. Puhleeze. \n\n> Most SDs don’t need your companionship, they give you money because they like seeing you succeed/happy.\n\nSo much so this. \n\n> I feel like you can’t even tell these girls “hey maybe don’t ruin a good thing” because they literally don’t care. They’re just in it for themselves at the end of the day.\n\nNo worries. Real SD's spot their bullshit from MILES away and avoid them. Hopefully the only ones they get are the one-hit-wonder chumps who usually are only fooled once, or the RedPill Daddies that turn the tables on them.",
            "author": "SDRippington",
            "id": "gg9hw5a",
            "parent_id": "t3_kf75sl",
            "score": 2,
            "created_utc": 1608308568.0,
            "replies": []
        },
        {
            "body": "I have had the same group of sugar babies for about 3 years now. They get along with each other very well and they all treat me with extreme love, affection and respect (photos available on request). I have met each of them on Seeking Arrangement. \nI have met other ladies at SA and when they want money before meeting I report them to SA and they are banned from the system. IMO they are nothing but prostitutes. I do not deal with prostitutes.",
            "author": "inttrepidd",
            "id": "ggax5hr",
            "parent_id": "t3_kf75sl",
            "score": 2,
            "created_utc": 1608331302.0,
            "replies": []
        },
        {
            "body": "I literally was just about to make a post of how much the tik tok “sugar babies” piss me off!!! This one girl had a series with (upwards of 35k likes) about how she talks to the guy and leads him on for money and then never meets up! Ugh just makes it so frustrating. And the comments are young girls just eating it up.",
            "author": "sugarlove05",
            "id": "gg7cbtb",
            "parent_id": "t3_kf75sl",
            "score": 4,
            "created_utc": 1608254395.0,
            "replies": []
        },
        {
            "body": "ok...first tiktok experience everrrr. haah\n\nI do have to say, respect for hustling. In the real world they call them grifters, but in the end, you're a grown ass man willing to send money and that's a choice. Some men feel that need so more power to them.\n\niN summary what i learned about the tiktok hustler:\n\nShe uses 3 sites that she recommends:\n\nseeking arrangements\n\nsecretbenetis\n\nmy girl fund\n\nShe says, after they message you with whatever nonsense they say, tell them\n\n***I want to meet, i live too far, i work too much, but i can definitely meet you soon.***\n\n(she says, whatever excuse)\n\nBut most important:\n\n***MAYBE WE CAN WORK SOMETHING OUT OVER THE PHONE UNTIL WE MEET***\n\nHustler continues:  ***my old sugar daddy used to pay me 100 dollars a week to talk and text and then when we met, he would pay me more***\n\n***for every 100 men that say no, 2 will say yes***\n\n***i went through 200 guys, then i found a handful***\n\n***These men will send you money. Set a day, my goal is 300 a day!***\n\n&#x200B;\n\nLove this comment:\n\nHey girl, could you make one more video on how you should talk to them?\n\nJust explaining what convos to have since we have to talk to them a lot.",
            "author": "MiLocavida",
            "id": "gg6xjce",
            "parent_id": "t3_kf75sl",
            "score": 3,
            "created_utc": 1608246845.0,
            "replies": [
                {
                    "body": "Anyone who is successful doing this would be spending her time finding more people to send her more money instead of making videos about it.  Also that little amount of money for the amount of texting and talking someone will want is not gonna be worth it for most people.",
                    "author": "UseTheForceRey",
                    "id": "gg7bbgt",
                    "parent_id": "t1_gg6xjce",
                    "score": 4,
                    "created_utc": 1608253829.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I gave SD a try because I saw the scamming and hustling on apps like hinge and bumble. I thought this would be more direct and easier because god damn I’m 33 and I never felt so lonely in my life. \n\nWhat a fool I was. I saw how hard girls would hustle you to add to her Instagram followers or appetizers and a drink in dating apps. Replace followers with dollar signs and I should have known better.",
            "author": "OhKevinPatrick",
            "id": "gg88opg",
            "parent_id": "t3_kf75sl",
            "score": 2,
            "created_utc": 1608274307.0,
            "replies": []
        },
        {
            "body": "I'm pretty sure that happened to me today. I gave her a relatively small amount of money for the get to know each other texting period. I made her verify she was real first. Then nothing.\n\nIt wasn't a large amount, but the audacity of it makes me angry.",
            "author": "ToughPillToSwallow",
            "id": "gg89bx5",
            "parent_id": "t3_kf75sl",
            "score": 2,
            "created_utc": 1608274835.0,
            "replies": []
        },
        {
            "body": "Tiktok is for teenagers lol",
            "author": null,
            "id": "gg6veix",
            "parent_id": "t3_kf75sl",
            "score": 0,
            "created_utc": 1608245735.0,
            "replies": [
                {
                    "body": "comments i saw there are a lot of women, 20 and up, 30 and up...",
                    "author": "MiLocavida",
                    "id": "gg6xy0h",
                    "parent_id": "t1_gg6veix",
                    "score": 2,
                    "created_utc": 1608247044.0,
                    "replies": [
                        {
                            "body": "well lmfao they need to grow up maybe",
                            "author": null,
                            "id": "gg6yrw9",
                            "parent_id": "t1_gg6xy0h",
                            "score": 1,
                            "created_utc": 1608247434.0,
                            "replies": [
                                {
                                    "body": "everybody needs cash right now, quick.\n\ni'm getting messages from women that i talked to a year ago...i love the messages...\n\nhi...lol",
                                    "author": "MiLocavida",
                                    "id": "gg6zdux",
                                    "parent_id": "t1_gg6yrw9",
                                    "score": 2,
                                    "created_utc": 1608247721.0,
                                    "replies": [
                                        {
                                            "body": "Ignored it lmfao I got msgs from guys I dated before yesterday too, guess guys are horny nowadays",
                                            "author": null,
                                            "id": "gg70gp4",
                                            "parent_id": "t1_gg6zdux",
                                            "score": 3,
                                            "created_utc": 1608248246.0,
                                            "replies": [
                                                {
                                                    "body": ">guys are horny nowadays\n\ni mean, guys are always horny...nonstop!!! :D  And thus, SD;s",
                                                    "author": "MiLocavida",
                                                    "id": "gg71bi5",
                                                    "parent_id": "t1_gg70gp4",
                                                    "score": 1,
                                                    "created_utc": 1608248654.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Perhaps that was once true but numerous lockdowns have driven people of all ages to the platform now.",
                    "author": "London-SD",
                    "id": "gg76obv",
                    "parent_id": "t1_gg6veix",
                    "score": 1,
                    "created_utc": 1608251248.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "gg7php8",
            "parent_id": "t3_kf75sl",
            "score": 0,
            "created_utc": 1608261768.0,
            "replies": [
                {
                    "body": ">They’re preoccupying and weeding the bottom dweller Indian broke pervs f\n\nYou had me until this...",
                    "author": "bsbdfw",
                    "id": "gg8i7sy",
                    "parent_id": "t1_gg7php8",
                    "score": 2,
                    "created_utc": 1608283043.0,
                    "replies": []
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "gg8wm1w",
                    "parent_id": "t1_gg7php8",
                    "score": 2,
                    "created_utc": 1608296661.0,
                    "replies": [
                        {
                            "body": "Very what an arse hole",
                            "author": "gvsulaker82",
                            "id": "gg9uhpv",
                            "parent_id": "t1_gg8wm1w",
                            "score": 1,
                            "created_utc": 1608313833.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Wait, you’re upset that someone had a better scam than you and it’s taking away from your scam?",
            "author": "bbmg69",
            "id": "gg8lgnr",
            "parent_id": "t3_kf75sl",
            "score": 0,
            "created_utc": 1608286305.0,
            "replies": []
        },
        {
            "body": "anyone really a sugar dad? going to lose my home in need of help please",
            "author": "Crazy-Dance-1391",
            "id": "gg8jc39",
            "parent_id": "t3_kf75sl",
            "score": 0,
            "created_utc": 1608284141.0,
            "replies": []
        },
        {
            "body": "If I’ll be honest, I know people won’t like my opinion but I encourage this trend. There was a much needed change anyways and I’m all for that. A lot of you assholes will downvote this but I agree that although it’s not “ideal” not all women should have to have sex for $$$.  Probably after COVID that type of sugaring may become obsolete. Nevertheless I’m all for this change as a SB myself.",
            "author": null,
            "id": "gg7etmx",
            "parent_id": "t3_kf75sl",
            "score": -4,
            "created_utc": 1608255827.0,
            "replies": [
                {
                    "body": "Are you saying that you support women requesting and accepting money for conversation and then ghosting?",
                    "author": "ToughPillToSwallow",
                    "id": "gg8av2f",
                    "parent_id": "t1_gg7etmx",
                    "score": 3,
                    "created_utc": 1608276139.0,
                    "replies": []
                },
                {
                    "body": "Fair enough opinion.\nDon’t like the chances of $ for just chatting to guys.\nSee we aren’t generally desperate for female company, I could go out say 2-3 times a week with women I know if I just wanted company and a chat for zero dollars.\nActually doing just that with a glamour next week, true story I just pay for the meal and drinks.\nThat’s the exception usually hang with mates when not out with my long term SGF",
                    "author": "SydSd1",
                    "id": "gg8ampo",
                    "parent_id": "t1_gg7etmx",
                    "score": 1,
                    "created_utc": 1608275941.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "When I first started, I got scammed. I had no prior knowledge of the lifestyle, but over a few months I learned it.",
            "author": null,
            "id": "gg72wwq",
            "parent_id": "t3_kf75sl",
            "score": 1,
            "created_utc": 1608249404.0,
            "replies": []
        },
        {
            "body": "This has been discussed here since March. A majority of these TikTok “SBs” are lying. Most of the new SA SB online only accounts are deactivated within three days of signing up. They’re annoying, but the “90% of women on SA want online only” posts on this sub are just not true. There are plenty of women willing to meet in real life without expecting money in advance.\n\nI’m sure there are some TikTok scammers making a few bucks, but no one is making xxx/day doing this. If someone asks for money before meeting and you report them SA will ban their account. Also, even if someone does fall for this trap all online payments can easily be disputed and reversed even if they’re legitimately sent.",
            "author": "us3rname9",
            "id": "gg73496",
            "parent_id": "t3_kf75sl",
            "score": 1,
            "created_utc": 1608249501.0,
            "replies": []
        },
        {
            "body": "THIS!!!!!!!!!!",
            "author": "Laceycashh09",
            "id": "gg752iy",
            "parent_id": "t3_kf75sl",
            "score": 1,
            "created_utc": 1608250450.0,
            "replies": []
        },
        {
            "body": "God yes. I'm a newer SB but have had a hard time by all this as well. Its really frustrating for SBs like me who are really trying.",
            "author": "bambiibutts",
            "id": "gg7csqu",
            "parent_id": "t3_kf75sl",
            "score": 1,
            "created_utc": 1608254665.0,
            "replies": []
        },
        {
            "body": "soo annoyed. they all assumed that we all just want to scam now :(",
            "author": "risadabarbie",
            "id": "gg7fqrz",
            "parent_id": "t3_kf75sl",
            "score": 1,
            "created_utc": 1608256332.0,
            "replies": []
        },
        {
            "body": "After 2-3 times all SD will catch up to this trend really quick , losing a few hundreds dollars is nothing, however Wasting time talking is where the SD gets hurt. The Time wasted we can’t take back because we could be talking to someone with good intentions.",
            "author": "LongETH",
            "id": "gg7pemi",
            "parent_id": "t3_kf75sl",
            "score": 1,
            "created_utc": 1608261721.0,
            "replies": []
        },
        {
            "body": "It’s worse now because IG has deleted photos that have any implied nudity or a description that seemed to sell nudity.",
            "author": "kirathekira",
            "id": "gg7xfio",
            "parent_id": "t3_kf75sl",
            "score": 1,
            "created_utc": 1608266278.0,
            "replies": []
        },
        {
            "body": "I want to get more normal, good sugar babies proudly proclaiming that they love sugaring! Sugar dating doesn't have to be in the dark forever.",
            "author": "SugarFetch",
            "id": "gg7z628",
            "parent_id": "t3_kf75sl",
            "score": 1,
            "created_utc": 1608267323.0,
            "replies": []
        },
        {
            "body": "its those girls that make banks (like mine) ( and over 55) prevent transfers via paypal, WU, MG, venmo... fucking scammers, i hate em",
            "author": "gilroy2019",
            "id": "gg81eed",
            "parent_id": "t3_kf75sl",
            "score": 1,
            "created_utc": 1608268794.0,
            "replies": []
        },
        {
            "body": "I am not annoyed by such because it has no bearing on my life. People have been scamming others for much longer than I have been alive. Lastly, hopping on a trend doesn't mean it's gonna work out for you.",
            "author": "bsbdfw",
            "id": "gg8iei4",
            "parent_id": "t3_kf75sl",
            "score": 1,
            "created_utc": 1608283223.0,
            "replies": []
        },
        {
            "body": "Is this why I’ve been flooded with this exact thing the last few days. “My last sd would give me x amount just to text and stuff until we met” I don’t give any money till we meet. But even that don’t work cuz tonight I was robbed. I don’t know why I’m even still looking I found the perfect sb within first 2 days. 18 beautiful and doesn’t ask for crazy amount. I’m just gonna consider myself lucky I found her and stick to just her.",
            "author": "Omni86",
            "id": "gg8j3aw",
            "parent_id": "t3_kf75sl",
            "score": 1,
            "created_utc": 1608283900.0,
            "replies": []
        },
        {
            "body": "Im a sd lmao I haven’t seen a sudden wave of sb",
            "author": "nick_crumpton",
            "id": "gg8y8gy",
            "parent_id": "t3_kf75sl",
            "score": 1,
            "created_utc": 1608297832.0,
            "replies": []
        },
        {
            "body": "All good things must come to an end. The entire SD&SB thing just makes me sick to my stomach. But hey...... knock yourselves out. When the party’s over...... ITS OVER.... and real life is waiting for you. Lmfao!!!!",
            "author": "ConsiderationDue111",
            "id": "gg8zbjk",
            "parent_id": "t3_kf75sl",
            "score": 1,
            "created_utc": 1608298579.0,
            "replies": []
        },
        {
            "body": "I get pissed off because it’s made it impossible for me to find a legit SD when that is what I truly want. They really make it difficult for us to really meet anyone substantial. I would do anything for real sugar 🥰",
            "author": "StarNerd920",
            "id": "gg92ch9",
            "parent_id": "t3_kf75sl",
            "score": 1,
            "created_utc": 1608300498.0,
            "replies": []
        },
        {
            "body": "I just came back to the bowl after a hiatus and this explains all the terse SD profiles about not giving money upfront, not interested in online only, etc. It's hard enough to establish the right level of trust in this kind of arrangement, annoying that the scamming makes it even harder.",
            "author": "dariawiththetits",
            "id": "gg93q4e",
            "parent_id": "t3_kf75sl",
            "score": 1,
            "created_utc": 1608301325.0,
            "replies": []
        },
        {
            "body": "The only thing I see with all the supposed sugar babies is they want to spam you with only fans, snap, pics, videos, etc.  No offense to the gorgeous ladies, but I want a connection and I want to do in person.  Does anyone do that anymore?",
            "author": null,
            "id": "gg94geg",
            "parent_id": "t3_kf75sl",
            "score": 1,
            "created_utc": 1608301743.0,
            "replies": []
        },
        {
            "body": "Funny enough, I stumbled across this community by accident and have been visiting it off an on.  I am a decent enough looking late 30 something, make good enough money, never had a problem finding a FWB.  These days though it's harder and harder finding quality FWB's and I just don't have the time anymore to spend hours and hours searching so I was considering it.  That being said I made an extremely vanilla profile on SA just to look around.   Granted I only look around at maybe 20-30 profiles but I was a bit taken back by the demands women have up on most of the profiles.  Usually something along the lines of wanted - male, 25-35, must be fit, must pay me xyz amount PPM or per month, must be single, must do this, must do that... I mean the list of demands went on and on.  Really turned me off.... I mean it seemed like these women wanted the top 1-5% of the dating pool of men looks wise, the top 1% of men money wise, and expect them to be single, that man doesn't exist in the bowl.  The men that do fit those criteria have a \"black book\" filled with women that will come visit them for free any time they want.  Maybe I just didn't search long enough, but if that is the criteria SBs expect I don't see how SR come about these days.",
            "author": "badazzcpa",
            "id": "gg9ef8a",
            "parent_id": "t3_kf75sl",
            "score": 1,
            "created_utc": 1608307005.0,
            "replies": []
        },
        {
            "body": "There are so many reasons not to be an SD right now. Until I'm vaccinated, I can't risk my health or the health of others, the proliferation of scammers (so many different kinds of scammers too!), the appearance of girls who look like they might be underage and just the amount of work needed to wade through it all. It must be just as frustrating for someone who wants to be a SB, but needs to contend with all of that too.\n\nI had planned to get back into meeting with someone once I'm vaccinated next year, but at this point it just sounds...exhausting. As much as I'd rather spend the money on an SB, erotic massage parlours and escorts are legal where I live, and that honestly feels safer, easier and more predictable until things calm down.",
            "author": "my_NSFW_posts",
            "id": "gg9fn7z",
            "parent_id": "t3_kf75sl",
            "score": 1,
            "created_utc": 1608307606.0,
            "replies": []
        },
        {
            "body": "I just had a 20yo say exactly that-- \"Well my old sugar daddy used to pay me \\[XXX\\] a week just to text with him and then when we met in person we changed the amount.\" When I replied that I was looking for an in-person relationship, she mentioned coronavirus and said, \"Maybe we can just do texting for now?\" I didn't know she was pulling that from a script...",
            "author": "WiseGuyInOregon",
            "id": "gg9k064",
            "parent_id": "t3_kf75sl",
            "score": 1,
            "created_utc": 1608309453.0,
            "replies": [
                {
                    "body": "I see you may have posted a number which is most likely an amount in relations to an arrangement. If this is the case, you are violating Rule#4 - \"No dollar amounts that are in reference to allowance/PPM are allowed.\"\n\n\nIf you are curious about Allowances reported by SLF contributors please see the [Allowance Master Thread 2020-2021](https://www.reddit.com/r/sugarlifestyleforum/comments/ja37xt/allowance_master_thread_20202021/)\n\nYour post will not be approved until you remove the amount.  Please read the sub [Rules](https://www.reddit.com/r/sugarlifestyleforum/comments/748zta/updated_and_clarified_rules_for_slf/) prior to posting anything else. \n\nIf you simply posted a number not referencing a monetary amount, please message the MODs to approve your post.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/sugarlifestyleforum) if you have any questions or concerns.*",
                    "author": "AutoModerator",
                    "id": "gg9k080",
                    "parent_id": "t1_gg9k064",
                    "score": 1,
                    "created_utc": 1608309453.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I know exactly what TikTok you’re talking about and the replies where so annoying. Just a bunch of girls trying to take advantage of people. No better than the scammers who post on social media🙄🙄",
            "author": "RobbiSosa",
            "id": "gg9ooh2",
            "parent_id": "t3_kf75sl",
            "score": 1,
            "created_utc": 1608311428.0,
            "replies": []
        },
        {
            "body": "That explains so much. I have reported anyone who asks for gas before meeting. They get the boot and come back immediately with the same pics. The site has allowed itself to go down the shitter.",
            "author": "Obvious-Document6174",
            "id": "gg9qcf4",
            "parent_id": "t3_kf75sl",
            "score": 1,
            "created_utc": 1608312131.0,
            "replies": []
        },
        {
            "body": "I really want to hop on this, but as a guy, no one wants a male sugar baby.",
            "author": "VigilsSMG",
            "id": "gg9v2w8",
            "parent_id": "t3_kf75sl",
            "score": 1,
            "created_utc": 1608314078.0,
            "replies": []
        },
        {
            "body": "In case anybody is wondering what she’s talking about; here’s a video: https://vm.tiktok.com/ZMJgg4QVh/",
            "author": "Ooreofe",
            "id": "gga0umt",
            "parent_id": "t3_kf75sl",
            "score": 1,
            "created_utc": 1608316504.0,
            "replies": []
        },
        {
            "body": "Yes. Absolutely yes. It is so annoying and frustrating to see!",
            "author": "bunbun124",
            "id": "gga1cyp",
            "parent_id": "t3_kf75sl",
            "score": 1,
            "created_utc": 1608316721.0,
            "replies": []
        },
        {
            "body": "I understand that Onlyfans is becoming more popular especially in the pandemic, and it promotes the same concept of a sugar-like relationship, online only.  Scamming is effectively encouraged by the Onlyfans business model.",
            "author": "HappyBear1952",
            "id": "gga59p1",
            "parent_id": "t3_kf75sl",
            "score": 1,
            "created_utc": 1608318396.0,
            "replies": []
        },
        {
            "body": "Oh well, it only makes it harder for the good SBs. I know, it only took me to get scammed once before I changed the way I did things. Lost only a small amount, but I no longer give any type of allowance until we have both met up in person and agree on the type of relationship we are having. If any SB wants money first before anything, I'll just assume it's a scam and move on. \n\nGood luck people and be safe out there.",
            "author": "gamrguypb",
            "id": "ggady61",
            "parent_id": "t3_kf75sl",
            "score": 1,
            "created_utc": 1608322160.0,
            "replies": []
        },
        {
            "body": "They seem to be exploding on Secret Benefits and even Tinder.",
            "author": "NaughtyBoy4Fun",
            "id": "ggaicaq",
            "parent_id": "t3_kf75sl",
            "score": 1,
            "created_utc": 1608324069.0,
            "replies": []
        },
        {
            "body": "In the internet marketing world, we call this e-whoring, and that’s exactly what these scammers are.",
            "author": "awesomedude2016_2016",
            "id": "ggaiwao",
            "parent_id": "t3_kf75sl",
            "score": 1,
            "created_utc": 1608324311.0,
            "replies": []
        },
        {
            "body": "Yes!!! Its tiring and they need to be exposed because they are making it hard for us normal ones to actually meet good men. \nPlease use the Mr Number app to write reviews on SDs y meet if they r real or fake. This way we can help each othr thru the bs ones.",
            "author": "One-Birthday1919",
            "id": "gh3psyx",
            "parent_id": "t3_kf75sl",
            "score": 1,
            "created_utc": 1609016147.0,
            "replies": []
        },
        {
            "body": "Soo is being a SB like an upper class escort",
            "author": "Illustrious_Coach_96",
            "id": "gi667pv",
            "parent_id": "t3_kf75sl",
            "score": 1,
            "created_utc": 1609846859.0,
            "replies": []
        },
        {
            "body": "Extremely difficult! I’ve been accused of being a rinser for asking for partial allowance upfront because the POT wanted me to meet 2 hours from where I live. It was a mess trying to assure him that I’m not a scammer and honestly ruins the first impression.",
            "author": "happylilegg",
            "id": "gg6os26",
            "parent_id": "t1_gg6oaxa",
            "score": 25,
            "created_utc": 1608242285.0,
            "replies": [
                {
                    "body": "When I know that POT SB is traveling some distance to meet at a place I suggested, of course I offer to cover Uber or gas. POT SB shouldn't even have to ask.",
                    "author": "kingporterstomp",
                    "id": "gg73vhp",
                    "parent_id": "t1_gg6os26",
                    "score": 46,
                    "created_utc": 1608249863.0,
                    "replies": [
                        {
                            "body": "This is the way!!!",
                            "author": "kirathekira",
                            "id": "gg7xi7f",
                            "parent_id": "t1_gg73vhp",
                            "score": 10,
                            "created_utc": 1608266322.0,
                            "replies": []
                        },
                        {
                            "body": "That is great of you. I would guess there are ladies who ask for money for help paying travel expenses for the first M&G and then ghost. :( I can see why some POT SDs would get skeptical of this then. I can also see why someone would want assistance traveling. SMH at these scammer girls and guys. They ruin it for others. Perhaps it can get back to some semblance of normalcy when COVID19 is over and people aren't trying to look for a quick buck?",
                            "author": "Classy_Curves",
                            "id": "ggc7vhy",
                            "parent_id": "t1_gg73vhp",
                            "score": 2,
                            "created_utc": 1608360944.0,
                            "replies": []
                        },
                        {
                            "body": "Agree totally but then.. there is the above which is reality.  It has happened to me.",
                            "author": "craa141",
                            "id": "gg87a3m",
                            "parent_id": "t1_gg73vhp",
                            "score": 4,
                            "created_utc": 1608273160.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Yeah that's really hard but you're swimming amidst a tidal wave of scammers. I have a 100% strict $0 before meeting in person. I will give you gas money in person the moment you walk up and you can turn around and walk away, but not $.01 before the m&g.",
                    "author": "mshmlkslf",
                    "id": "gge7kc2",
                    "parent_id": "t1_gg6os26",
                    "score": 3,
                    "created_utc": 1608408400.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "girls just dont want to hear the cold hard truth that you have to fuck the men. i dont say that as a bad thing but the whole \"teach me how to get an sd!!!\" ... find an old man and fuck him idk what answer ur looking for",
            "author": null,
            "id": "gg85dxb",
            "parent_id": "t1_gg6scts",
            "score": 44,
            "created_utc": 1608271672.0,
            "replies": [
                {
                    "body": "This has me rolling! 💀\n\n>\"teach me how to get an sd!!!\" ... find an old man and fuck him idk what answer ur looking for\n\nThis is the only piece of solid advice tbf, and personally, I would much rather ride an old horse and be guaranteed not only income, but an actual good time instead of messing around with these youngins whose idea of stimulating the g-spot is jack-hammering my cervix to pulp!",
                    "author": "QuirkyComplex",
                    "id": "gg8gml8",
                    "parent_id": "t1_gg85dxb",
                    "score": 23,
                    "created_utc": 1608281548.0,
                    "replies": [
                        {
                            "body": "I am dying. 😂😂😂",
                            "author": "FoxyFreckles1989",
                            "id": "gg8vg22",
                            "parent_id": "t1_gg8gml8",
                            "score": 11,
                            "created_utc": 1608295773.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I think that’s (sadly) the real issue; not enough real SBs setting the record straight about what it is and what it could be for them (scammers and potential scammers)! Also, sometimes when you are forthright, you might get those people who will talk crap about you for being a SB. So they take the advice of the scammers and run with it. Sucks all around.",
            "author": "AmazonTeddy",
            "id": "gg7stsi",
            "parent_id": "t1_gg6scts",
            "score": 10,
            "created_utc": 1608263662.0,
            "replies": []
        },
        {
            "body": "That’s the thing - I’m not willing to out myself but I can’t stand all this misinformation.",
            "author": "happylilegg",
            "id": "gg6tm0k",
            "parent_id": "t1_gg6scts",
            "score": 13,
            "created_utc": 1608244797.0,
            "replies": []
        },
        {
            "body": "ESPECIALLY TikTok! I just watched a 6 part series of a girl explaining how she makes 300/day by scamming men. Like ??? Why is this something you do for fun??",
            "author": "happylilegg",
            "id": "gg6ozk9",
            "parent_id": "t1_gg6oimi",
            "score": 59,
            "created_utc": 1608242391.0,
            "replies": [
                {
                    "body": "Because she is making 70k tax free thats why (if honest)\n\nI had a ex semi rinser SB in my more studly days early 30s over 13 years ago she was making 1k a week scamming \"old dudes\" as she said. Since I was early 30s tbey sure seemed old to me too.",
                    "author": "bookworm010101",
                    "id": "gg7dpur",
                    "parent_id": "t1_gg6ozk9",
                    "score": 10,
                    "created_utc": 1608255194.0,
                    "replies": [
                        {
                            "body": "There's no fool like an old fool",
                            "author": null,
                            "id": "gg8dy1n",
                            "parent_id": "t1_gg7dpur",
                            "score": 3,
                            "created_utc": 1608278958.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "oh man! when i was around not sure tik tok was a thing...and what was the technique?",
                    "author": "MiLocavida",
                    "id": "gg6t17z",
                    "parent_id": "t1_gg6ozk9",
                    "score": 8,
                    "created_utc": 1608244494.0,
                    "replies": [
                        {
                            "body": "I only heard of it in the past year -it’s really blown up. \nShe was explaining how she would make accounts, set a random location, and message hundreds of guys the same copy + pasted line: “Well my old sugar daddy used to pay me about  💯 per week to talk and text. And then we were comfortable, we met, and he paid more” \nShe just leads them on, gives them excuses on why she can’t meet up yet, and finds new ones when they stop paying.",
                            "author": "happylilegg",
                            "id": "gg6tje6",
                            "parent_id": "t1_gg6t17z",
                            "score": 14,
                            "created_utc": 1608244760.0,
                            "replies": [
                                {
                                    "body": "Can confirm.\n\nI have received nearly that exavy cut-paste message. \n\n <block> and move on is an instant reflex now.",
                                    "author": "TXPolyDaddy",
                                    "id": "gg7pene",
                                    "parent_id": "t1_gg6tje6",
                                    "score": 16,
                                    "created_utc": 1608261721.0,
                                    "replies": []
                                },
                                {
                                    "body": "My response: Well my last SB slept with me for free for 6 months to make sure she liked the chemistry.  We should start with that.",
                                    "author": "LotBuilder",
                                    "id": "gg7qs4i",
                                    "parent_id": "t1_gg6tje6",
                                    "score": 28,
                                    "created_utc": 1608262515.0,
                                    "replies": [
                                        {
                                            "body": "That is funny as fuck!!",
                                            "author": "9Voices2020",
                                            "id": "gg90tnl",
                                            "parent_id": "t1_gg7qs4i",
                                            "score": 6,
                                            "created_utc": 1608299556.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "Yep I saw this too!",
                                    "author": "newfence1",
                                    "id": "gg6vc7u",
                                    "parent_id": "t1_gg6tje6",
                                    "score": 5,
                                    "created_utc": 1608245702.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "> for fun\n\n300/day is no longer doing it \"for fun\". That's a career, baby.",
                    "author": "This_is_Not_My_Handl",
                    "id": "gg83wjs",
                    "parent_id": "t1_gg6ozk9",
                    "score": 9,
                    "created_utc": 1608270562.0,
                    "replies": []
                },
                {
                    "body": "karma will catch up to her :)",
                    "author": null,
                    "id": "gg6rd9m",
                    "parent_id": "t1_gg6ozk9",
                    "score": 25,
                    "created_utc": 1608243615.0,
                    "replies": [
                        {
                            "body": "... eventually.",
                            "author": null,
                            "id": "gg8dv02",
                            "parent_id": "t1_gg6rd9m",
                            "score": 4,
                            "created_utc": 1608278878.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "I think i know which tiktok you’re saying. I watched until the second video and it’s so annoying how they portray a sugar relationship. 😪😪😪I looked at the comments and oooooffff",
                    "author": "cranerish",
                    "id": "gg8ppb4",
                    "parent_id": "t1_gg6ozk9",
                    "score": 5,
                    "created_utc": 1608290599.0,
                    "replies": []
                },
                {
                    "body": "I imagine that some of these girls delude themselves into thinking of these men as Johns who are only interested in exploiting desperate girls for sex, and that it is somehow \"justified\" to trick them into losing money. In many ways being able to pretend that you are not doing something awful is more insidious than if you were just outright playing a villein. Although I am guessing some of them do that as well.",
                    "author": "LookingForTrueStuff",
                    "id": "gg6rg02",
                    "parent_id": "t1_gg6ozk9",
                    "score": 12,
                    "created_utc": 1608243655.0,
                    "replies": [
                        {
                            "body": "Yep, we had one in here last week! She mentioned that her SD “preyed” on young women and when I was like wait what’s going on, it turned out that he just had the audacity to consensually date other adults with an age gap. Sigh.... kids!",
                            "author": null,
                            "id": "gg7azoi",
                            "parent_id": "t1_gg6rg02",
                            "score": 16,
                            "created_utc": 1608253644.0,
                            "replies": []
                        },
                        {
                            "body": "It's the opposite side of the \"Red Pill\" guys that think all women are hoes and should be treated as such.  They give each other \"high fives\" for manipulating and controlling women.  \n\nThe good news is that these people are never happy people and never find a happy relationship.  Both types of people don't respect the opposite sex and as a result are never respected by their partners.",
                            "author": "willfromvb",
                            "id": "gg8no30",
                            "parent_id": "t1_gg6rg02",
                            "score": 6,
                            "created_utc": 1608288574.0,
                            "replies": [
                                {
                                    "body": "So recently it was 'incels' now it's 'red pill' it seems like we are collecting way too many terms for being an asshole.",
                                    "author": "LookingForTrueStuff",
                                    "id": "gg9mhci",
                                    "parent_id": "t1_gg8no30",
                                    "score": 5,
                                    "created_utc": 1608310497.0,
                                    "replies": [
                                        {
                                            "body": "No!  Incels (involuntary celibate) is the insulting name \"Red Pill\" type of guys call other guys that don't disrespect women enough in their mind. It's just a way to call someone weak and say that they can't get laid.",
                                            "author": "willfromvb",
                                            "id": "ggabrik",
                                            "parent_id": "t1_gg9mhci",
                                            "score": 3,
                                            "created_utc": 1608321207.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "I think we watched the same videos is her username @callikoa? She seriously talks like a scammer and so many girls are now trying her methods.",
                    "author": "sugarlove05",
                    "id": "gg7cslz",
                    "parent_id": "t1_gg6ozk9",
                    "score": 5,
                    "created_utc": 1608254663.0,
                    "replies": []
                },
                {
                    "body": "Sounds like a sociopath or unbelievably selfish person. It'll catch up with her.",
                    "author": "Classy_Curves",
                    "id": "ggc7z0r",
                    "parent_id": "t1_gg6ozk9",
                    "score": 2,
                    "created_utc": 1608361033.0,
                    "replies": []
                },
                {
                    "body": "As long as there are idiots who fall for it, scammers make money and get rich. I instantly block or next such profiles. Around 30% online and fake profiles, about 30% platonic and 30% toe dippers in my area. SA is just a sad place to find a SB these days.",
                    "author": "MrBrownv",
                    "id": "gga8c9g",
                    "parent_id": "t1_gg6ozk9",
                    "score": 1,
                    "created_utc": 1608319721.0,
                    "replies": []
                },
                {
                    "body": "I know exactly which girl you’re talking about and I was in shock!!",
                    "author": "EntertainerStandard",
                    "id": "ggbmyg7",
                    "parent_id": "t1_gg6ozk9",
                    "score": 1,
                    "created_utc": 1608346188.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Everyone talks about how TikTok is so addicting but I feel like if I did download it I'd just be in a rage all the time lmao",
            "author": null,
            "id": "gg6p0z9",
            "parent_id": "t1_gg6oimi",
            "score": 13,
            "created_utc": 1608242411.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "gg6q7l0",
                    "parent_id": "t1_gg6p0z9",
                    "score": 18,
                    "created_utc": 1608243017.0,
                    "replies": [
                        {
                            "body": "I just stick to Youtube for my mindless viewing needs lmao",
                            "author": null,
                            "id": "gg6ratn",
                            "parent_id": "t1_gg6q7l0",
                            "score": 8,
                            "created_utc": 1608243581.0,
                            "replies": []
                        },
                        {
                            "body": "My little dog and I watch animal videos on there together in the morning before the alarm goes off. It’s lovely if you don’t look under the rocks.",
                            "author": null,
                            "id": "gg7b53d",
                            "parent_id": "t1_gg6q7l0",
                            "score": 5,
                            "created_utc": 1608253729.0,
                            "replies": [
                                {
                                    "body": "That’s so funny and cute! Lol",
                                    "author": "AmazonTeddy",
                                    "id": "gg7r5i4",
                                    "parent_id": "t1_gg7b53d",
                                    "score": 2,
                                    "created_utc": 1608262730.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "gg6rkyn",
                            "parent_id": "t1_gg6q7l0",
                            "score": 4,
                            "created_utc": 1608243728.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "gg6rvpf",
                                    "parent_id": "t1_gg6rkyn",
                                    "score": 4,
                                    "created_utc": 1608243881.0,
                                    "replies": [
                                        {
                                            "body": "don't have tik tok but now i'm intrigued, do you search topics like on youtube or how do you find these videos?",
                                            "author": "MiLocavida",
                                            "id": "gg6t5i2",
                                            "parent_id": "t1_gg6rvpf",
                                            "score": 1,
                                            "created_utc": 1608244558.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "I would love to have a SM rather than a SD. I love women in general.",
                                            "author": "Parking-Dimension-30",
                                            "id": "gg8lb4e",
                                            "parent_id": "t1_gg6rvpf",
                                            "score": 1,
                                            "created_utc": 1608286148.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "ggav2av",
                                    "parent_id": "t1_gg6rkyn",
                                    "score": 1,
                                    "created_utc": 1608330180.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Don’t do it - it sucks you in with mindless content. I’m hooked and this might just be the thing that makes me ragequit. LOL",
                    "author": "happylilegg",
                    "id": "gg6qjhk",
                    "parent_id": "t1_gg6p0z9",
                    "score": 2,
                    "created_utc": 1608243187.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yesss tik tok is full of girls pretending they’re sugar babies, strippers, OF girls. Then you hear their advice and experiences like 🤔🤔 it’s clear they’re mostly looking to become influencers I think",
            "author": "strt31",
            "id": "gg7ofz4",
            "parent_id": "t1_gg6oimi",
            "score": 4,
            "created_utc": 1608261181.0,
            "replies": []
        },
        {
            "body": "Not all young women are like that!",
            "author": "Truetomyselfxo",
            "id": "gga35cf",
            "parent_id": "t1_gg7glqh",
            "score": 3,
            "created_utc": 1608317485.0,
            "replies": []
        },
        {
            "body": "There certainly are advantages to older women.",
            "author": "Classy_Curves",
            "id": "ggc8hkb",
            "parent_id": "t1_gg7glqh",
            "score": 2,
            "created_utc": 1608361508.0,
            "replies": []
        },
        {
            "body": "I also want to pretend I didn’t see it because ya know, get your bag girl, but aalllsooo it ruins it for the rest of us! I’m conflicted but frustrated nonetheless",
            "author": "happylilegg",
            "id": "gg6olaq",
            "parent_id": "t1_gg6oa89",
            "score": 7,
            "created_utc": 1608242189.0,
            "replies": [
                {
                    "body": "No I totally get that! It kind of makes me feel bad as an SB in that age range who genuinely wants to have successful arrangements, rather than being another young + dumb rinser.",
                    "author": "curly_spice",
                    "id": "gg6or8z",
                    "parent_id": "t1_gg6olaq",
                    "score": 8,
                    "created_utc": 1608242273.0,
                    "replies": [
                        {
                            "body": "I’m in that age range too - it’s awful that we have the rep of being rinsers/young/dumb just because all these girls :/",
                            "author": "happylilegg",
                            "id": "gg6ovsh",
                            "parent_id": "t1_gg6or8z",
                            "score": 8,
                            "created_utc": 1608242338.0,
                            "replies": [
                                {
                                    "body": "You forgot to mention toe dippers (a LOT of them!) :-D",
                                    "author": "SeekingInSydney",
                                    "id": "jgozrl1",
                                    "parent_id": "t1_gg6ovsh",
                                    "score": 1,
                                    "created_utc": 1681784084.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "And if you dare tell them this is not what being an actual SB is, everyone would trash you in the comments!",
            "author": "happylilegg",
            "id": "gg6qu9v",
            "parent_id": "t1_gg6qkhi",
            "score": 7,
            "created_utc": 1608243342.0,
            "replies": [
                {
                    "body": "have you ever considered that while the people in the comments may be “eating it up”, the vast majority of them are never even going to attempt it? And even if they did, how far do you realistically think they’re going to get? Probably not very. In fact why would you even believe the videos? Lots of people lie on the internet. Just don’t worry about them, a handful of people aren’t “ruining the bowl” for anyone.",
                    "author": "BellaBlissNYC",
                    "id": "gg7ww5q",
                    "parent_id": "t1_gg6qu9v",
                    "score": 4,
                    "created_utc": 1608265969.0,
                    "replies": [
                        {
                            "body": "Bingo, I meet these girls on SA all day long and they last a few days, tops. They want 'platonic spoiling', don't ever want to meet, don't try and get to know you in the slightest, and then they're gone.",
                            "author": "mshmlkslf",
                            "id": "gge80fz",
                            "parent_id": "t1_gg7ww5q",
                            "score": 3,
                            "created_utc": 1608408640.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I would love to clarify this topic, but am terrified of outing myself to family/friends/professors/whoever knows me as a SB. I’m sure there are SBs that advocate the ethical way but I haven’t seen their videos. If I wasn’t bound by traditional/conservative family, I totally would.",
            "author": "happylilegg",
            "id": "gg6r9vk",
            "parent_id": "t1_gg6qm19",
            "score": 19,
            "created_utc": 1608243568.0,
            "replies": []
        },
        {
            "body": "I heard SA is even raising their prices!  (Unverified)",
            "author": "TXPolyDaddy",
            "id": "gg7q72t",
            "parent_id": "t1_gg6twk3",
            "score": 3,
            "created_utc": 1608262179.0,
            "replies": []
        },
        {
            "body": "It’s unfortunate all around!",
            "author": "AmazonTeddy",
            "id": "gg7w89b",
            "parent_id": "t1_gg6twk3",
            "score": 1,
            "created_utc": 1608265577.0,
            "replies": []
        },
        {
            "body": "WYP recommends people pay half before meeting and half after.",
            "author": "Classy_Curves",
            "id": "ggc94u9",
            "parent_id": "t1_gg7pbxz",
            "score": 2,
            "created_utc": 1608362110.0,
            "replies": [
                {
                    "body": "Well,  I don’t give anyone money that I have not met.",
                    "author": "LotBuilder",
                    "id": "ggcafzo",
                    "parent_id": "t1_ggc94u9",
                    "score": 2,
                    "created_utc": 1608363378.0,
                    "replies": [
                        {
                            "body": "Considering how many young SBs are scamming people I can see why.",
                            "author": "Classy_Curves",
                            "id": "ggcapto",
                            "parent_id": "t1_ggcafzo",
                            "score": 3,
                            "created_utc": 1608363642.0,
                            "replies": [
                                {
                                    "body": "Why would they meet up with guys is they can get hundreds per day ?",
                                    "author": "LotBuilder",
                                    "id": "ggcasyg",
                                    "parent_id": "t1_ggcapto",
                                    "score": 2,
                                    "created_utc": 1608363726.0,
                                    "replies": [
                                        {
                                            "body": "I have a feeling that is a bit of an exaggeration but I get where you're going with it. I also think it'd be exhausting work to keep trying to find new people then quickly ghost them. Constantly creating new identities and \"fishing\" for new victims is so time consuming. I can't imagine doing it. Taking pictures and videos of my feet is time consuming enough.",
                                            "author": "Classy_Curves",
                                            "id": "ggcbu6i",
                                            "parent_id": "t1_ggcasyg",
                                            "score": 2,
                                            "created_utc": 1608364737.0,
                                            "replies": [
                                                {
                                                    "body": "Really... compared to a typical retail,  childcare restaurant job where you are on your feet all day busting your ass it’s “time consuming” to take a few pics.   One of my SB’s worked at a daycare whiling kids butts all dat for two bucks above minimum wage.  She would gladly spend 8 hours a day texting guys for a few hundred a day.  It’s not hard work",
                                                    "author": "LotBuilder",
                                                    "id": "ggccefo",
                                                    "parent_id": "t1_ggcbu6i",
                                                    "score": 2,
                                                    "created_utc": 1608365298.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yeah I’m kinda sitting back gloating right now since my former SD seemed to prioritize his needs over mine. \n\nGo forth and prosper bro 😄",
            "author": null,
            "id": "gg71x98",
            "parent_id": "t1_gg6p6nf",
            "score": 8,
            "created_utc": 1608248932.0,
            "replies": []
        },
        {
            "body": "An absolute shit show",
            "author": "happylilegg",
            "id": "gg6qp70",
            "parent_id": "t1_gg6p6nf",
            "score": 1,
            "created_utc": 1608243269.0,
            "replies": []
        },
        {
            "body": "That part!!",
            "author": "LostAngelesThrowaway",
            "id": "gghmrdr",
            "parent_id": "t1_gg6p6nf",
            "score": 1,
            "created_utc": 1608480111.0,
            "replies": []
        },
        {
            "body": "Unfortunately, there will always be new people that haven’t done enough research to know red flags.",
            "author": "happylilegg",
            "id": "gg6tpke",
            "parent_id": "t1_gg6rve3",
            "score": 3,
            "created_utc": 1608244850.0,
            "replies": [
                {
                    "body": "In my eyes, that's 100% SDs fault.",
                    "author": "dullnailfile",
                    "id": "ggai4gp",
                    "parent_id": "t1_gg6tpke",
                    "score": 1,
                    "created_utc": 1608323974.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Maybe it’s fine then. The scammers and the losers - I guess there’s a nut for every bolt 😅",
            "author": "strt31",
            "id": "gg7oqj1",
            "parent_id": "t1_gg6rve3",
            "score": 0,
            "created_utc": 1608261347.0,
            "replies": [
                {
                    "body": "That is pretty shitty.   \n\nThere are sincere, yet not at all competitive, young women that come on here looking for advice.  They have almost no hope of finding a genuine SR and end up swamped with scammers.   They don't deserve that, they are likely just naive. The truth, if listened to, could save them a lot of heart ache.  \n\nAnyone who knowingly engages to scam someone deserves way more than just scorn.   The money is really the least of the damage.",
                    "author": "TXPolyDaddy",
                    "id": "gg7q35f",
                    "parent_id": "t1_gg7oqj1",
                    "score": 4,
                    "created_utc": 1608262116.0,
                    "replies": [
                        {
                            "body": "No I agree! anyone knowingly scamming is selfish and taking advantage of an innocent person. There are scammers on both sides and I was just addressing the question about the bowl getting saturated, not the morality of it. I don’t think it will get saturated because the vulnerable will keep getting scammed as long as there’s scammers and vice versa.",
                            "author": "strt31",
                            "id": "gg8e9kz",
                            "parent_id": "t1_gg7q35f",
                            "score": 2,
                            "created_utc": 1608279256.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Really? Now I'm curious.",
            "author": "Classy_Curves",
            "id": "ggc8ucj",
            "parent_id": "t1_gg7mcls",
            "score": 3,
            "created_utc": 1608361837.0,
            "replies": []
        },
        {
            "body": "Can confirm, that’s when I started. It was far less crowded than it is now.",
            "author": "LostAngelesThrowaway",
            "id": "gghrsmn",
            "parent_id": "t1_gg8topy",
            "score": 1,
            "created_utc": 1608482639.0,
            "replies": []
        },
        {
            "body": "EXACTLY!",
            "author": "LostAngelesThrowaway",
            "id": "gghnw0r",
            "parent_id": "t1_gg6v9rd",
            "score": 1,
            "created_utc": 1608480575.0,
            "replies": []
        },
        {
            "body": "In my most recent experience, I had to reassure my SD that I wouldn’t just ghost him after our date because that’s how his first experience went. I think that’s really overshadowing my logic right now, but this really grinds my gears because of how crappy it is to scam someone. On top of that, these girls are marketing it as just how to be a SB or SB101. If you didn’t know anything about the bowl, you’d think that was okay to scam these guys. :/ I know I can’t do anything about it, but it just isn’t right.",
            "author": "happylilegg",
            "id": "gg6qbjz",
            "parent_id": "t1_gg6p693",
            "score": 6,
            "created_utc": 1608243074.0,
            "replies": [
                {
                    "body": ">these girls are marketing it as just how to be a SB or SB101\n\nand how do i find these topics on tik tok? don't even have the app but curious to see what the tehniques are nowadays. Glad i'm out of the bowl...",
                    "author": "MiLocavida",
                    "id": "gg6tbyc",
                    "parent_id": "t1_gg6qbjz",
                    "score": 2,
                    "created_utc": 1608244652.0,
                    "replies": [
                        {
                            "body": "I’ll pm you!",
                            "author": "happylilegg",
                            "id": "gg6tzua",
                            "parent_id": "t1_gg6tbyc",
                            "score": 2,
                            "created_utc": 1608244999.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": ">I don't think anyone with money is going to be put off because of the presence of scammers.\n\nThat is a foolish thought.   \n\n\nAs a SD my guard is 100% up at all times and especially at the beginning I'm looking for a reason to run (asking for money upfront, platonic only, online only, pic/video sellers).   \n\n\nIt only takes falling for it 1,952 times to learn a lesson ;)   \n\n\nAlso, I didn't renew my membership due to college being out and the rise of online only babies that SA allows.  That takes me and my sugar fund out of the bowl along with anyone else who feels the same way.   \n\n\nSA isn't going to crack down on it because they need the numbers to keep rising and new girls (real or fake) on the site to keep men interested and coming back for more.   \n\n\nSA doesn't care about making it harder for SB or SD to find each other, they just focus on growth and maybe an eventual exit.   \n\n\nSorry to crash your thread ladies, you all look amazing and skinny as ever. Whatever you're doing, it's working, keep it up.",
            "author": "TexasSD",
            "id": "gg6vlo4",
            "parent_id": "t1_gg6p693",
            "score": 4,
            "created_utc": 1608245840.0,
            "replies": []
        },
        {
            "body": "What ever happened to theclownlife and miaishighvalue ?",
            "author": "mdmafortune",
            "id": "j7nil1i",
            "parent_id": "t1_gg79cvl",
            "score": 1,
            "created_utc": 1675821355.0,
            "replies": []
        },
        {
            "body": "Anyone who is successful doing this would be spending her time finding more people to send her more money instead of making videos about it.  Also that little amount of money for the amount of texting and talking someone will want is not gonna be worth it for most people.",
            "author": "UseTheForceRey",
            "id": "gg7bbgt",
            "parent_id": "t1_gg6xjce",
            "score": 4,
            "created_utc": 1608253829.0,
            "replies": []
        },
        {
            "body": "comments i saw there are a lot of women, 20 and up, 30 and up...",
            "author": "MiLocavida",
            "id": "gg6xy0h",
            "parent_id": "t1_gg6veix",
            "score": 2,
            "created_utc": 1608247044.0,
            "replies": [
                {
                    "body": "well lmfao they need to grow up maybe",
                    "author": null,
                    "id": "gg6yrw9",
                    "parent_id": "t1_gg6xy0h",
                    "score": 1,
                    "created_utc": 1608247434.0,
                    "replies": [
                        {
                            "body": "everybody needs cash right now, quick.\n\ni'm getting messages from women that i talked to a year ago...i love the messages...\n\nhi...lol",
                            "author": "MiLocavida",
                            "id": "gg6zdux",
                            "parent_id": "t1_gg6yrw9",
                            "score": 2,
                            "created_utc": 1608247721.0,
                            "replies": [
                                {
                                    "body": "Ignored it lmfao I got msgs from guys I dated before yesterday too, guess guys are horny nowadays",
                                    "author": null,
                                    "id": "gg70gp4",
                                    "parent_id": "t1_gg6zdux",
                                    "score": 3,
                                    "created_utc": 1608248246.0,
                                    "replies": [
                                        {
                                            "body": ">guys are horny nowadays\n\ni mean, guys are always horny...nonstop!!! :D  And thus, SD;s",
                                            "author": "MiLocavida",
                                            "id": "gg71bi5",
                                            "parent_id": "t1_gg70gp4",
                                            "score": 1,
                                            "created_utc": 1608248654.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Perhaps that was once true but numerous lockdowns have driven people of all ages to the platform now.",
            "author": "London-SD",
            "id": "gg76obv",
            "parent_id": "t1_gg6veix",
            "score": 1,
            "created_utc": 1608251248.0,
            "replies": []
        },
        {
            "body": ">They’re preoccupying and weeding the bottom dweller Indian broke pervs f\n\nYou had me until this...",
            "author": "bsbdfw",
            "id": "gg8i7sy",
            "parent_id": "t1_gg7php8",
            "score": 2,
            "created_utc": 1608283043.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gg8wm1w",
            "parent_id": "t1_gg7php8",
            "score": 2,
            "created_utc": 1608296661.0,
            "replies": [
                {
                    "body": "Very what an arse hole",
                    "author": "gvsulaker82",
                    "id": "gg9uhpv",
                    "parent_id": "t1_gg8wm1w",
                    "score": 1,
                    "created_utc": 1608313833.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Are you saying that you support women requesting and accepting money for conversation and then ghosting?",
            "author": "ToughPillToSwallow",
            "id": "gg8av2f",
            "parent_id": "t1_gg7etmx",
            "score": 3,
            "created_utc": 1608276139.0,
            "replies": []
        },
        {
            "body": "Fair enough opinion.\nDon’t like the chances of $ for just chatting to guys.\nSee we aren’t generally desperate for female company, I could go out say 2-3 times a week with women I know if I just wanted company and a chat for zero dollars.\nActually doing just that with a glamour next week, true story I just pay for the meal and drinks.\nThat’s the exception usually hang with mates when not out with my long term SGF",
            "author": "SydSd1",
            "id": "gg8ampo",
            "parent_id": "t1_gg7etmx",
            "score": 1,
            "created_utc": 1608275941.0,
            "replies": []
        },
        {
            "body": "I see you may have posted a number which is most likely an amount in relations to an arrangement. If this is the case, you are violating Rule#4 - \"No dollar amounts that are in reference to allowance/PPM are allowed.\"\n\n\nIf you are curious about Allowances reported by SLF contributors please see the [Allowance Master Thread 2020-2021](https://www.reddit.com/r/sugarlifestyleforum/comments/ja37xt/allowance_master_thread_20202021/)\n\nYour post will not be approved until you remove the amount.  Please read the sub [Rules](https://www.reddit.com/r/sugarlifestyleforum/comments/748zta/updated_and_clarified_rules_for_slf/) prior to posting anything else. \n\nIf you simply posted a number not referencing a monetary amount, please message the MODs to approve your post.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/sugarlifestyleforum) if you have any questions or concerns.*",
            "author": "AutoModerator",
            "id": "gg9k080",
            "parent_id": "t1_gg9k064",
            "score": 1,
            "created_utc": 1608309453.0,
            "replies": []
        },
        {
            "body": "When I know that POT SB is traveling some distance to meet at a place I suggested, of course I offer to cover Uber or gas. POT SB shouldn't even have to ask.",
            "author": "kingporterstomp",
            "id": "gg73vhp",
            "parent_id": "t1_gg6os26",
            "score": 46,
            "created_utc": 1608249863.0,
            "replies": [
                {
                    "body": "This is the way!!!",
                    "author": "kirathekira",
                    "id": "gg7xi7f",
                    "parent_id": "t1_gg73vhp",
                    "score": 10,
                    "created_utc": 1608266322.0,
                    "replies": []
                },
                {
                    "body": "That is great of you. I would guess there are ladies who ask for money for help paying travel expenses for the first M&G and then ghost. :( I can see why some POT SDs would get skeptical of this then. I can also see why someone would want assistance traveling. SMH at these scammer girls and guys. They ruin it for others. Perhaps it can get back to some semblance of normalcy when COVID19 is over and people aren't trying to look for a quick buck?",
                    "author": "Classy_Curves",
                    "id": "ggc7vhy",
                    "parent_id": "t1_gg73vhp",
                    "score": 2,
                    "created_utc": 1608360944.0,
                    "replies": []
                },
                {
                    "body": "Agree totally but then.. there is the above which is reality.  It has happened to me.",
                    "author": "craa141",
                    "id": "gg87a3m",
                    "parent_id": "t1_gg73vhp",
                    "score": 4,
                    "created_utc": 1608273160.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yeah that's really hard but you're swimming amidst a tidal wave of scammers. I have a 100% strict $0 before meeting in person. I will give you gas money in person the moment you walk up and you can turn around and walk away, but not $.01 before the m&g.",
            "author": "mshmlkslf",
            "id": "gge7kc2",
            "parent_id": "t1_gg6os26",
            "score": 3,
            "created_utc": 1608408400.0,
            "replies": []
        },
        {
            "body": "This has me rolling! 💀\n\n>\"teach me how to get an sd!!!\" ... find an old man and fuck him idk what answer ur looking for\n\nThis is the only piece of solid advice tbf, and personally, I would much rather ride an old horse and be guaranteed not only income, but an actual good time instead of messing around with these youngins whose idea of stimulating the g-spot is jack-hammering my cervix to pulp!",
            "author": "QuirkyComplex",
            "id": "gg8gml8",
            "parent_id": "t1_gg85dxb",
            "score": 23,
            "created_utc": 1608281548.0,
            "replies": [
                {
                    "body": "I am dying. 😂😂😂",
                    "author": "FoxyFreckles1989",
                    "id": "gg8vg22",
                    "parent_id": "t1_gg8gml8",
                    "score": 11,
                    "created_utc": 1608295773.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Because she is making 70k tax free thats why (if honest)\n\nI had a ex semi rinser SB in my more studly days early 30s over 13 years ago she was making 1k a week scamming \"old dudes\" as she said. Since I was early 30s tbey sure seemed old to me too.",
            "author": "bookworm010101",
            "id": "gg7dpur",
            "parent_id": "t1_gg6ozk9",
            "score": 10,
            "created_utc": 1608255194.0,
            "replies": [
                {
                    "body": "There's no fool like an old fool",
                    "author": null,
                    "id": "gg8dy1n",
                    "parent_id": "t1_gg7dpur",
                    "score": 3,
                    "created_utc": 1608278958.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "oh man! when i was around not sure tik tok was a thing...and what was the technique?",
            "author": "MiLocavida",
            "id": "gg6t17z",
            "parent_id": "t1_gg6ozk9",
            "score": 8,
            "created_utc": 1608244494.0,
            "replies": [
                {
                    "body": "I only heard of it in the past year -it’s really blown up. \nShe was explaining how she would make accounts, set a random location, and message hundreds of guys the same copy + pasted line: “Well my old sugar daddy used to pay me about  💯 per week to talk and text. And then we were comfortable, we met, and he paid more” \nShe just leads them on, gives them excuses on why she can’t meet up yet, and finds new ones when they stop paying.",
                    "author": "happylilegg",
                    "id": "gg6tje6",
                    "parent_id": "t1_gg6t17z",
                    "score": 14,
                    "created_utc": 1608244760.0,
                    "replies": [
                        {
                            "body": "Can confirm.\n\nI have received nearly that exavy cut-paste message. \n\n <block> and move on is an instant reflex now.",
                            "author": "TXPolyDaddy",
                            "id": "gg7pene",
                            "parent_id": "t1_gg6tje6",
                            "score": 16,
                            "created_utc": 1608261721.0,
                            "replies": []
                        },
                        {
                            "body": "My response: Well my last SB slept with me for free for 6 months to make sure she liked the chemistry.  We should start with that.",
                            "author": "LotBuilder",
                            "id": "gg7qs4i",
                            "parent_id": "t1_gg6tje6",
                            "score": 28,
                            "created_utc": 1608262515.0,
                            "replies": [
                                {
                                    "body": "That is funny as fuck!!",
                                    "author": "9Voices2020",
                                    "id": "gg90tnl",
                                    "parent_id": "t1_gg7qs4i",
                                    "score": 6,
                                    "created_utc": 1608299556.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Yep I saw this too!",
                            "author": "newfence1",
                            "id": "gg6vc7u",
                            "parent_id": "t1_gg6tje6",
                            "score": 5,
                            "created_utc": 1608245702.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "> for fun\n\n300/day is no longer doing it \"for fun\". That's a career, baby.",
            "author": "This_is_Not_My_Handl",
            "id": "gg83wjs",
            "parent_id": "t1_gg6ozk9",
            "score": 9,
            "created_utc": 1608270562.0,
            "replies": []
        },
        {
            "body": "karma will catch up to her :)",
            "author": null,
            "id": "gg6rd9m",
            "parent_id": "t1_gg6ozk9",
            "score": 25,
            "created_utc": 1608243615.0,
            "replies": [
                {
                    "body": "... eventually.",
                    "author": null,
                    "id": "gg8dv02",
                    "parent_id": "t1_gg6rd9m",
                    "score": 4,
                    "created_utc": 1608278878.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I think i know which tiktok you’re saying. I watched until the second video and it’s so annoying how they portray a sugar relationship. 😪😪😪I looked at the comments and oooooffff",
            "author": "cranerish",
            "id": "gg8ppb4",
            "parent_id": "t1_gg6ozk9",
            "score": 5,
            "created_utc": 1608290599.0,
            "replies": []
        },
        {
            "body": "I imagine that some of these girls delude themselves into thinking of these men as Johns who are only interested in exploiting desperate girls for sex, and that it is somehow \"justified\" to trick them into losing money. In many ways being able to pretend that you are not doing something awful is more insidious than if you were just outright playing a villein. Although I am guessing some of them do that as well.",
            "author": "LookingForTrueStuff",
            "id": "gg6rg02",
            "parent_id": "t1_gg6ozk9",
            "score": 12,
            "created_utc": 1608243655.0,
            "replies": [
                {
                    "body": "Yep, we had one in here last week! She mentioned that her SD “preyed” on young women and when I was like wait what’s going on, it turned out that he just had the audacity to consensually date other adults with an age gap. Sigh.... kids!",
                    "author": null,
                    "id": "gg7azoi",
                    "parent_id": "t1_gg6rg02",
                    "score": 16,
                    "created_utc": 1608253644.0,
                    "replies": []
                },
                {
                    "body": "It's the opposite side of the \"Red Pill\" guys that think all women are hoes and should be treated as such.  They give each other \"high fives\" for manipulating and controlling women.  \n\nThe good news is that these people are never happy people and never find a happy relationship.  Both types of people don't respect the opposite sex and as a result are never respected by their partners.",
                    "author": "willfromvb",
                    "id": "gg8no30",
                    "parent_id": "t1_gg6rg02",
                    "score": 6,
                    "created_utc": 1608288574.0,
                    "replies": [
                        {
                            "body": "So recently it was 'incels' now it's 'red pill' it seems like we are collecting way too many terms for being an asshole.",
                            "author": "LookingForTrueStuff",
                            "id": "gg9mhci",
                            "parent_id": "t1_gg8no30",
                            "score": 5,
                            "created_utc": 1608310497.0,
                            "replies": [
                                {
                                    "body": "No!  Incels (involuntary celibate) is the insulting name \"Red Pill\" type of guys call other guys that don't disrespect women enough in their mind. It's just a way to call someone weak and say that they can't get laid.",
                                    "author": "willfromvb",
                                    "id": "ggabrik",
                                    "parent_id": "t1_gg9mhci",
                                    "score": 3,
                                    "created_utc": 1608321207.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I think we watched the same videos is her username @callikoa? She seriously talks like a scammer and so many girls are now trying her methods.",
            "author": "sugarlove05",
            "id": "gg7cslz",
            "parent_id": "t1_gg6ozk9",
            "score": 5,
            "created_utc": 1608254663.0,
            "replies": []
        },
        {
            "body": "Sounds like a sociopath or unbelievably selfish person. It'll catch up with her.",
            "author": "Classy_Curves",
            "id": "ggc7z0r",
            "parent_id": "t1_gg6ozk9",
            "score": 2,
            "created_utc": 1608361033.0,
            "replies": []
        },
        {
            "body": "As long as there are idiots who fall for it, scammers make money and get rich. I instantly block or next such profiles. Around 30% online and fake profiles, about 30% platonic and 30% toe dippers in my area. SA is just a sad place to find a SB these days.",
            "author": "MrBrownv",
            "id": "gga8c9g",
            "parent_id": "t1_gg6ozk9",
            "score": 1,
            "created_utc": 1608319721.0,
            "replies": []
        },
        {
            "body": "I know exactly which girl you’re talking about and I was in shock!!",
            "author": "EntertainerStandard",
            "id": "ggbmyg7",
            "parent_id": "t1_gg6ozk9",
            "score": 1,
            "created_utc": 1608346188.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gg6q7l0",
            "parent_id": "t1_gg6p0z9",
            "score": 18,
            "created_utc": 1608243017.0,
            "replies": [
                {
                    "body": "I just stick to Youtube for my mindless viewing needs lmao",
                    "author": null,
                    "id": "gg6ratn",
                    "parent_id": "t1_gg6q7l0",
                    "score": 8,
                    "created_utc": 1608243581.0,
                    "replies": []
                },
                {
                    "body": "My little dog and I watch animal videos on there together in the morning before the alarm goes off. It’s lovely if you don’t look under the rocks.",
                    "author": null,
                    "id": "gg7b53d",
                    "parent_id": "t1_gg6q7l0",
                    "score": 5,
                    "created_utc": 1608253729.0,
                    "replies": [
                        {
                            "body": "That’s so funny and cute! Lol",
                            "author": "AmazonTeddy",
                            "id": "gg7r5i4",
                            "parent_id": "t1_gg7b53d",
                            "score": 2,
                            "created_utc": 1608262730.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "gg6rkyn",
                    "parent_id": "t1_gg6q7l0",
                    "score": 4,
                    "created_utc": 1608243728.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "gg6rvpf",
                            "parent_id": "t1_gg6rkyn",
                            "score": 4,
                            "created_utc": 1608243881.0,
                            "replies": [
                                {
                                    "body": "don't have tik tok but now i'm intrigued, do you search topics like on youtube or how do you find these videos?",
                                    "author": "MiLocavida",
                                    "id": "gg6t5i2",
                                    "parent_id": "t1_gg6rvpf",
                                    "score": 1,
                                    "created_utc": 1608244558.0,
                                    "replies": []
                                },
                                {
                                    "body": "I would love to have a SM rather than a SD. I love women in general.",
                                    "author": "Parking-Dimension-30",
                                    "id": "gg8lb4e",
                                    "parent_id": "t1_gg6rvpf",
                                    "score": 1,
                                    "created_utc": 1608286148.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "ggav2av",
                            "parent_id": "t1_gg6rkyn",
                            "score": 1,
                            "created_utc": 1608330180.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Don’t do it - it sucks you in with mindless content. I’m hooked and this might just be the thing that makes me ragequit. LOL",
            "author": "happylilegg",
            "id": "gg6qjhk",
            "parent_id": "t1_gg6p0z9",
            "score": 2,
            "created_utc": 1608243187.0,
            "replies": []
        },
        {
            "body": "No I totally get that! It kind of makes me feel bad as an SB in that age range who genuinely wants to have successful arrangements, rather than being another young + dumb rinser.",
            "author": "curly_spice",
            "id": "gg6or8z",
            "parent_id": "t1_gg6olaq",
            "score": 8,
            "created_utc": 1608242273.0,
            "replies": [
                {
                    "body": "I’m in that age range too - it’s awful that we have the rep of being rinsers/young/dumb just because all these girls :/",
                    "author": "happylilegg",
                    "id": "gg6ovsh",
                    "parent_id": "t1_gg6or8z",
                    "score": 8,
                    "created_utc": 1608242338.0,
                    "replies": [
                        {
                            "body": "You forgot to mention toe dippers (a LOT of them!) :-D",
                            "author": "SeekingInSydney",
                            "id": "jgozrl1",
                            "parent_id": "t1_gg6ovsh",
                            "score": 1,
                            "created_utc": 1681784084.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "have you ever considered that while the people in the comments may be “eating it up”, the vast majority of them are never even going to attempt it? And even if they did, how far do you realistically think they’re going to get? Probably not very. In fact why would you even believe the videos? Lots of people lie on the internet. Just don’t worry about them, a handful of people aren’t “ruining the bowl” for anyone.",
            "author": "BellaBlissNYC",
            "id": "gg7ww5q",
            "parent_id": "t1_gg6qu9v",
            "score": 4,
            "created_utc": 1608265969.0,
            "replies": [
                {
                    "body": "Bingo, I meet these girls on SA all day long and they last a few days, tops. They want 'platonic spoiling', don't ever want to meet, don't try and get to know you in the slightest, and then they're gone.",
                    "author": "mshmlkslf",
                    "id": "gge80fz",
                    "parent_id": "t1_gg7ww5q",
                    "score": 3,
                    "created_utc": 1608408640.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Well,  I don’t give anyone money that I have not met.",
            "author": "LotBuilder",
            "id": "ggcafzo",
            "parent_id": "t1_ggc94u9",
            "score": 2,
            "created_utc": 1608363378.0,
            "replies": [
                {
                    "body": "Considering how many young SBs are scamming people I can see why.",
                    "author": "Classy_Curves",
                    "id": "ggcapto",
                    "parent_id": "t1_ggcafzo",
                    "score": 3,
                    "created_utc": 1608363642.0,
                    "replies": [
                        {
                            "body": "Why would they meet up with guys is they can get hundreds per day ?",
                            "author": "LotBuilder",
                            "id": "ggcasyg",
                            "parent_id": "t1_ggcapto",
                            "score": 2,
                            "created_utc": 1608363726.0,
                            "replies": [
                                {
                                    "body": "I have a feeling that is a bit of an exaggeration but I get where you're going with it. I also think it'd be exhausting work to keep trying to find new people then quickly ghost them. Constantly creating new identities and \"fishing\" for new victims is so time consuming. I can't imagine doing it. Taking pictures and videos of my feet is time consuming enough.",
                                    "author": "Classy_Curves",
                                    "id": "ggcbu6i",
                                    "parent_id": "t1_ggcasyg",
                                    "score": 2,
                                    "created_utc": 1608364737.0,
                                    "replies": [
                                        {
                                            "body": "Really... compared to a typical retail,  childcare restaurant job where you are on your feet all day busting your ass it’s “time consuming” to take a few pics.   One of my SB’s worked at a daycare whiling kids butts all dat for two bucks above minimum wage.  She would gladly spend 8 hours a day texting guys for a few hundred a day.  It’s not hard work",
                                            "author": "LotBuilder",
                                            "id": "ggccefo",
                                            "parent_id": "t1_ggcbu6i",
                                            "score": 2,
                                            "created_utc": 1608365298.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "In my eyes, that's 100% SDs fault.",
            "author": "dullnailfile",
            "id": "ggai4gp",
            "parent_id": "t1_gg6tpke",
            "score": 1,
            "created_utc": 1608323974.0,
            "replies": []
        },
        {
            "body": "That is pretty shitty.   \n\nThere are sincere, yet not at all competitive, young women that come on here looking for advice.  They have almost no hope of finding a genuine SR and end up swamped with scammers.   They don't deserve that, they are likely just naive. The truth, if listened to, could save them a lot of heart ache.  \n\nAnyone who knowingly engages to scam someone deserves way more than just scorn.   The money is really the least of the damage.",
            "author": "TXPolyDaddy",
            "id": "gg7q35f",
            "parent_id": "t1_gg7oqj1",
            "score": 4,
            "created_utc": 1608262116.0,
            "replies": [
                {
                    "body": "No I agree! anyone knowingly scamming is selfish and taking advantage of an innocent person. There are scammers on both sides and I was just addressing the question about the bowl getting saturated, not the morality of it. I don’t think it will get saturated because the vulnerable will keep getting scammed as long as there’s scammers and vice versa.",
                    "author": "strt31",
                    "id": "gg8e9kz",
                    "parent_id": "t1_gg7q35f",
                    "score": 2,
                    "created_utc": 1608279256.0,
                    "replies": []
                }
            ]
        },
        {
            "body": ">these girls are marketing it as just how to be a SB or SB101\n\nand how do i find these topics on tik tok? don't even have the app but curious to see what the tehniques are nowadays. Glad i'm out of the bowl...",
            "author": "MiLocavida",
            "id": "gg6tbyc",
            "parent_id": "t1_gg6qbjz",
            "score": 2,
            "created_utc": 1608244652.0,
            "replies": [
                {
                    "body": "I’ll pm you!",
                    "author": "happylilegg",
                    "id": "gg6tzua",
                    "parent_id": "t1_gg6tbyc",
                    "score": 2,
                    "created_utc": 1608244999.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "well lmfao they need to grow up maybe",
            "author": null,
            "id": "gg6yrw9",
            "parent_id": "t1_gg6xy0h",
            "score": 1,
            "created_utc": 1608247434.0,
            "replies": [
                {
                    "body": "everybody needs cash right now, quick.\n\ni'm getting messages from women that i talked to a year ago...i love the messages...\n\nhi...lol",
                    "author": "MiLocavida",
                    "id": "gg6zdux",
                    "parent_id": "t1_gg6yrw9",
                    "score": 2,
                    "created_utc": 1608247721.0,
                    "replies": [
                        {
                            "body": "Ignored it lmfao I got msgs from guys I dated before yesterday too, guess guys are horny nowadays",
                            "author": null,
                            "id": "gg70gp4",
                            "parent_id": "t1_gg6zdux",
                            "score": 3,
                            "created_utc": 1608248246.0,
                            "replies": [
                                {
                                    "body": ">guys are horny nowadays\n\ni mean, guys are always horny...nonstop!!! :D  And thus, SD;s",
                                    "author": "MiLocavida",
                                    "id": "gg71bi5",
                                    "parent_id": "t1_gg70gp4",
                                    "score": 1,
                                    "created_utc": 1608248654.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Very what an arse hole",
            "author": "gvsulaker82",
            "id": "gg9uhpv",
            "parent_id": "t1_gg8wm1w",
            "score": 1,
            "created_utc": 1608313833.0,
            "replies": []
        },
        {
            "body": "This is the way!!!",
            "author": "kirathekira",
            "id": "gg7xi7f",
            "parent_id": "t1_gg73vhp",
            "score": 10,
            "created_utc": 1608266322.0,
            "replies": []
        },
        {
            "body": "That is great of you. I would guess there are ladies who ask for money for help paying travel expenses for the first M&G and then ghost. :( I can see why some POT SDs would get skeptical of this then. I can also see why someone would want assistance traveling. SMH at these scammer girls and guys. They ruin it for others. Perhaps it can get back to some semblance of normalcy when COVID19 is over and people aren't trying to look for a quick buck?",
            "author": "Classy_Curves",
            "id": "ggc7vhy",
            "parent_id": "t1_gg73vhp",
            "score": 2,
            "created_utc": 1608360944.0,
            "replies": []
        },
        {
            "body": "Agree totally but then.. there is the above which is reality.  It has happened to me.",
            "author": "craa141",
            "id": "gg87a3m",
            "parent_id": "t1_gg73vhp",
            "score": 4,
            "created_utc": 1608273160.0,
            "replies": []
        },
        {
            "body": "I am dying. 😂😂😂",
            "author": "FoxyFreckles1989",
            "id": "gg8vg22",
            "parent_id": "t1_gg8gml8",
            "score": 11,
            "created_utc": 1608295773.0,
            "replies": []
        },
        {
            "body": "There's no fool like an old fool",
            "author": null,
            "id": "gg8dy1n",
            "parent_id": "t1_gg7dpur",
            "score": 3,
            "created_utc": 1608278958.0,
            "replies": []
        },
        {
            "body": "I only heard of it in the past year -it’s really blown up. \nShe was explaining how she would make accounts, set a random location, and message hundreds of guys the same copy + pasted line: “Well my old sugar daddy used to pay me about  💯 per week to talk and text. And then we were comfortable, we met, and he paid more” \nShe just leads them on, gives them excuses on why she can’t meet up yet, and finds new ones when they stop paying.",
            "author": "happylilegg",
            "id": "gg6tje6",
            "parent_id": "t1_gg6t17z",
            "score": 14,
            "created_utc": 1608244760.0,
            "replies": [
                {
                    "body": "Can confirm.\n\nI have received nearly that exavy cut-paste message. \n\n <block> and move on is an instant reflex now.",
                    "author": "TXPolyDaddy",
                    "id": "gg7pene",
                    "parent_id": "t1_gg6tje6",
                    "score": 16,
                    "created_utc": 1608261721.0,
                    "replies": []
                },
                {
                    "body": "My response: Well my last SB slept with me for free for 6 months to make sure she liked the chemistry.  We should start with that.",
                    "author": "LotBuilder",
                    "id": "gg7qs4i",
                    "parent_id": "t1_gg6tje6",
                    "score": 28,
                    "created_utc": 1608262515.0,
                    "replies": [
                        {
                            "body": "That is funny as fuck!!",
                            "author": "9Voices2020",
                            "id": "gg90tnl",
                            "parent_id": "t1_gg7qs4i",
                            "score": 6,
                            "created_utc": 1608299556.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Yep I saw this too!",
                    "author": "newfence1",
                    "id": "gg6vc7u",
                    "parent_id": "t1_gg6tje6",
                    "score": 5,
                    "created_utc": 1608245702.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "... eventually.",
            "author": null,
            "id": "gg8dv02",
            "parent_id": "t1_gg6rd9m",
            "score": 4,
            "created_utc": 1608278878.0,
            "replies": []
        },
        {
            "body": "Yep, we had one in here last week! She mentioned that her SD “preyed” on young women and when I was like wait what’s going on, it turned out that he just had the audacity to consensually date other adults with an age gap. Sigh.... kids!",
            "author": null,
            "id": "gg7azoi",
            "parent_id": "t1_gg6rg02",
            "score": 16,
            "created_utc": 1608253644.0,
            "replies": []
        },
        {
            "body": "It's the opposite side of the \"Red Pill\" guys that think all women are hoes and should be treated as such.  They give each other \"high fives\" for manipulating and controlling women.  \n\nThe good news is that these people are never happy people and never find a happy relationship.  Both types of people don't respect the opposite sex and as a result are never respected by their partners.",
            "author": "willfromvb",
            "id": "gg8no30",
            "parent_id": "t1_gg6rg02",
            "score": 6,
            "created_utc": 1608288574.0,
            "replies": [
                {
                    "body": "So recently it was 'incels' now it's 'red pill' it seems like we are collecting way too many terms for being an asshole.",
                    "author": "LookingForTrueStuff",
                    "id": "gg9mhci",
                    "parent_id": "t1_gg8no30",
                    "score": 5,
                    "created_utc": 1608310497.0,
                    "replies": [
                        {
                            "body": "No!  Incels (involuntary celibate) is the insulting name \"Red Pill\" type of guys call other guys that don't disrespect women enough in their mind. It's just a way to call someone weak and say that they can't get laid.",
                            "author": "willfromvb",
                            "id": "ggabrik",
                            "parent_id": "t1_gg9mhci",
                            "score": 3,
                            "created_utc": 1608321207.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I just stick to Youtube for my mindless viewing needs lmao",
            "author": null,
            "id": "gg6ratn",
            "parent_id": "t1_gg6q7l0",
            "score": 8,
            "created_utc": 1608243581.0,
            "replies": []
        },
        {
            "body": "My little dog and I watch animal videos on there together in the morning before the alarm goes off. It’s lovely if you don’t look under the rocks.",
            "author": null,
            "id": "gg7b53d",
            "parent_id": "t1_gg6q7l0",
            "score": 5,
            "created_utc": 1608253729.0,
            "replies": [
                {
                    "body": "That’s so funny and cute! Lol",
                    "author": "AmazonTeddy",
                    "id": "gg7r5i4",
                    "parent_id": "t1_gg7b53d",
                    "score": 2,
                    "created_utc": 1608262730.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gg6rkyn",
            "parent_id": "t1_gg6q7l0",
            "score": 4,
            "created_utc": 1608243728.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "gg6rvpf",
                    "parent_id": "t1_gg6rkyn",
                    "score": 4,
                    "created_utc": 1608243881.0,
                    "replies": [
                        {
                            "body": "don't have tik tok but now i'm intrigued, do you search topics like on youtube or how do you find these videos?",
                            "author": "MiLocavida",
                            "id": "gg6t5i2",
                            "parent_id": "t1_gg6rvpf",
                            "score": 1,
                            "created_utc": 1608244558.0,
                            "replies": []
                        },
                        {
                            "body": "I would love to have a SM rather than a SD. I love women in general.",
                            "author": "Parking-Dimension-30",
                            "id": "gg8lb4e",
                            "parent_id": "t1_gg6rvpf",
                            "score": 1,
                            "created_utc": 1608286148.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "ggav2av",
                    "parent_id": "t1_gg6rkyn",
                    "score": 1,
                    "created_utc": 1608330180.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I’m in that age range too - it’s awful that we have the rep of being rinsers/young/dumb just because all these girls :/",
            "author": "happylilegg",
            "id": "gg6ovsh",
            "parent_id": "t1_gg6or8z",
            "score": 8,
            "created_utc": 1608242338.0,
            "replies": [
                {
                    "body": "You forgot to mention toe dippers (a LOT of them!) :-D",
                    "author": "SeekingInSydney",
                    "id": "jgozrl1",
                    "parent_id": "t1_gg6ovsh",
                    "score": 1,
                    "created_utc": 1681784084.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Bingo, I meet these girls on SA all day long and they last a few days, tops. They want 'platonic spoiling', don't ever want to meet, don't try and get to know you in the slightest, and then they're gone.",
            "author": "mshmlkslf",
            "id": "gge80fz",
            "parent_id": "t1_gg7ww5q",
            "score": 3,
            "created_utc": 1608408640.0,
            "replies": []
        },
        {
            "body": "Considering how many young SBs are scamming people I can see why.",
            "author": "Classy_Curves",
            "id": "ggcapto",
            "parent_id": "t1_ggcafzo",
            "score": 3,
            "created_utc": 1608363642.0,
            "replies": [
                {
                    "body": "Why would they meet up with guys is they can get hundreds per day ?",
                    "author": "LotBuilder",
                    "id": "ggcasyg",
                    "parent_id": "t1_ggcapto",
                    "score": 2,
                    "created_utc": 1608363726.0,
                    "replies": [
                        {
                            "body": "I have a feeling that is a bit of an exaggeration but I get where you're going with it. I also think it'd be exhausting work to keep trying to find new people then quickly ghost them. Constantly creating new identities and \"fishing\" for new victims is so time consuming. I can't imagine doing it. Taking pictures and videos of my feet is time consuming enough.",
                            "author": "Classy_Curves",
                            "id": "ggcbu6i",
                            "parent_id": "t1_ggcasyg",
                            "score": 2,
                            "created_utc": 1608364737.0,
                            "replies": [
                                {
                                    "body": "Really... compared to a typical retail,  childcare restaurant job where you are on your feet all day busting your ass it’s “time consuming” to take a few pics.   One of my SB’s worked at a daycare whiling kids butts all dat for two bucks above minimum wage.  She would gladly spend 8 hours a day texting guys for a few hundred a day.  It’s not hard work",
                                    "author": "LotBuilder",
                                    "id": "ggccefo",
                                    "parent_id": "t1_ggcbu6i",
                                    "score": 2,
                                    "created_utc": 1608365298.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "No I agree! anyone knowingly scamming is selfish and taking advantage of an innocent person. There are scammers on both sides and I was just addressing the question about the bowl getting saturated, not the morality of it. I don’t think it will get saturated because the vulnerable will keep getting scammed as long as there’s scammers and vice versa.",
            "author": "strt31",
            "id": "gg8e9kz",
            "parent_id": "t1_gg7q35f",
            "score": 2,
            "created_utc": 1608279256.0,
            "replies": []
        },
        {
            "body": "I’ll pm you!",
            "author": "happylilegg",
            "id": "gg6tzua",
            "parent_id": "t1_gg6tbyc",
            "score": 2,
            "created_utc": 1608244999.0,
            "replies": []
        },
        {
            "body": "everybody needs cash right now, quick.\n\ni'm getting messages from women that i talked to a year ago...i love the messages...\n\nhi...lol",
            "author": "MiLocavida",
            "id": "gg6zdux",
            "parent_id": "t1_gg6yrw9",
            "score": 2,
            "created_utc": 1608247721.0,
            "replies": [
                {
                    "body": "Ignored it lmfao I got msgs from guys I dated before yesterday too, guess guys are horny nowadays",
                    "author": null,
                    "id": "gg70gp4",
                    "parent_id": "t1_gg6zdux",
                    "score": 3,
                    "created_utc": 1608248246.0,
                    "replies": [
                        {
                            "body": ">guys are horny nowadays\n\ni mean, guys are always horny...nonstop!!! :D  And thus, SD;s",
                            "author": "MiLocavida",
                            "id": "gg71bi5",
                            "parent_id": "t1_gg70gp4",
                            "score": 1,
                            "created_utc": 1608248654.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Can confirm.\n\nI have received nearly that exavy cut-paste message. \n\n <block> and move on is an instant reflex now.",
            "author": "TXPolyDaddy",
            "id": "gg7pene",
            "parent_id": "t1_gg6tje6",
            "score": 16,
            "created_utc": 1608261721.0,
            "replies": []
        },
        {
            "body": "My response: Well my last SB slept with me for free for 6 months to make sure she liked the chemistry.  We should start with that.",
            "author": "LotBuilder",
            "id": "gg7qs4i",
            "parent_id": "t1_gg6tje6",
            "score": 28,
            "created_utc": 1608262515.0,
            "replies": [
                {
                    "body": "That is funny as fuck!!",
                    "author": "9Voices2020",
                    "id": "gg90tnl",
                    "parent_id": "t1_gg7qs4i",
                    "score": 6,
                    "created_utc": 1608299556.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yep I saw this too!",
            "author": "newfence1",
            "id": "gg6vc7u",
            "parent_id": "t1_gg6tje6",
            "score": 5,
            "created_utc": 1608245702.0,
            "replies": []
        },
        {
            "body": "So recently it was 'incels' now it's 'red pill' it seems like we are collecting way too many terms for being an asshole.",
            "author": "LookingForTrueStuff",
            "id": "gg9mhci",
            "parent_id": "t1_gg8no30",
            "score": 5,
            "created_utc": 1608310497.0,
            "replies": [
                {
                    "body": "No!  Incels (involuntary celibate) is the insulting name \"Red Pill\" type of guys call other guys that don't disrespect women enough in their mind. It's just a way to call someone weak and say that they can't get laid.",
                    "author": "willfromvb",
                    "id": "ggabrik",
                    "parent_id": "t1_gg9mhci",
                    "score": 3,
                    "created_utc": 1608321207.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "That’s so funny and cute! Lol",
            "author": "AmazonTeddy",
            "id": "gg7r5i4",
            "parent_id": "t1_gg7b53d",
            "score": 2,
            "created_utc": 1608262730.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gg6rvpf",
            "parent_id": "t1_gg6rkyn",
            "score": 4,
            "created_utc": 1608243881.0,
            "replies": [
                {
                    "body": "don't have tik tok but now i'm intrigued, do you search topics like on youtube or how do you find these videos?",
                    "author": "MiLocavida",
                    "id": "gg6t5i2",
                    "parent_id": "t1_gg6rvpf",
                    "score": 1,
                    "created_utc": 1608244558.0,
                    "replies": []
                },
                {
                    "body": "I would love to have a SM rather than a SD. I love women in general.",
                    "author": "Parking-Dimension-30",
                    "id": "gg8lb4e",
                    "parent_id": "t1_gg6rvpf",
                    "score": 1,
                    "created_utc": 1608286148.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "ggav2av",
            "parent_id": "t1_gg6rkyn",
            "score": 1,
            "created_utc": 1608330180.0,
            "replies": []
        },
        {
            "body": "You forgot to mention toe dippers (a LOT of them!) :-D",
            "author": "SeekingInSydney",
            "id": "jgozrl1",
            "parent_id": "t1_gg6ovsh",
            "score": 1,
            "created_utc": 1681784084.0,
            "replies": []
        },
        {
            "body": "Why would they meet up with guys is they can get hundreds per day ?",
            "author": "LotBuilder",
            "id": "ggcasyg",
            "parent_id": "t1_ggcapto",
            "score": 2,
            "created_utc": 1608363726.0,
            "replies": [
                {
                    "body": "I have a feeling that is a bit of an exaggeration but I get where you're going with it. I also think it'd be exhausting work to keep trying to find new people then quickly ghost them. Constantly creating new identities and \"fishing\" for new victims is so time consuming. I can't imagine doing it. Taking pictures and videos of my feet is time consuming enough.",
                    "author": "Classy_Curves",
                    "id": "ggcbu6i",
                    "parent_id": "t1_ggcasyg",
                    "score": 2,
                    "created_utc": 1608364737.0,
                    "replies": [
                        {
                            "body": "Really... compared to a typical retail,  childcare restaurant job where you are on your feet all day busting your ass it’s “time consuming” to take a few pics.   One of my SB’s worked at a daycare whiling kids butts all dat for two bucks above minimum wage.  She would gladly spend 8 hours a day texting guys for a few hundred a day.  It’s not hard work",
                            "author": "LotBuilder",
                            "id": "ggccefo",
                            "parent_id": "t1_ggcbu6i",
                            "score": 2,
                            "created_utc": 1608365298.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Ignored it lmfao I got msgs from guys I dated before yesterday too, guess guys are horny nowadays",
            "author": null,
            "id": "gg70gp4",
            "parent_id": "t1_gg6zdux",
            "score": 3,
            "created_utc": 1608248246.0,
            "replies": [
                {
                    "body": ">guys are horny nowadays\n\ni mean, guys are always horny...nonstop!!! :D  And thus, SD;s",
                    "author": "MiLocavida",
                    "id": "gg71bi5",
                    "parent_id": "t1_gg70gp4",
                    "score": 1,
                    "created_utc": 1608248654.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "That is funny as fuck!!",
            "author": "9Voices2020",
            "id": "gg90tnl",
            "parent_id": "t1_gg7qs4i",
            "score": 6,
            "created_utc": 1608299556.0,
            "replies": []
        },
        {
            "body": "No!  Incels (involuntary celibate) is the insulting name \"Red Pill\" type of guys call other guys that don't disrespect women enough in their mind. It's just a way to call someone weak and say that they can't get laid.",
            "author": "willfromvb",
            "id": "ggabrik",
            "parent_id": "t1_gg9mhci",
            "score": 3,
            "created_utc": 1608321207.0,
            "replies": []
        },
        {
            "body": "don't have tik tok but now i'm intrigued, do you search topics like on youtube or how do you find these videos?",
            "author": "MiLocavida",
            "id": "gg6t5i2",
            "parent_id": "t1_gg6rvpf",
            "score": 1,
            "created_utc": 1608244558.0,
            "replies": []
        },
        {
            "body": "I would love to have a SM rather than a SD. I love women in general.",
            "author": "Parking-Dimension-30",
            "id": "gg8lb4e",
            "parent_id": "t1_gg6rvpf",
            "score": 1,
            "created_utc": 1608286148.0,
            "replies": []
        },
        {
            "body": "I have a feeling that is a bit of an exaggeration but I get where you're going with it. I also think it'd be exhausting work to keep trying to find new people then quickly ghost them. Constantly creating new identities and \"fishing\" for new victims is so time consuming. I can't imagine doing it. Taking pictures and videos of my feet is time consuming enough.",
            "author": "Classy_Curves",
            "id": "ggcbu6i",
            "parent_id": "t1_ggcasyg",
            "score": 2,
            "created_utc": 1608364737.0,
            "replies": [
                {
                    "body": "Really... compared to a typical retail,  childcare restaurant job where you are on your feet all day busting your ass it’s “time consuming” to take a few pics.   One of my SB’s worked at a daycare whiling kids butts all dat for two bucks above minimum wage.  She would gladly spend 8 hours a day texting guys for a few hundred a day.  It’s not hard work",
                    "author": "LotBuilder",
                    "id": "ggccefo",
                    "parent_id": "t1_ggcbu6i",
                    "score": 2,
                    "created_utc": 1608365298.0,
                    "replies": []
                }
            ]
        },
        {
            "body": ">guys are horny nowadays\n\ni mean, guys are always horny...nonstop!!! :D  And thus, SD;s",
            "author": "MiLocavida",
            "id": "gg71bi5",
            "parent_id": "t1_gg70gp4",
            "score": 1,
            "created_utc": 1608248654.0,
            "replies": []
        },
        {
            "body": "Really... compared to a typical retail,  childcare restaurant job where you are on your feet all day busting your ass it’s “time consuming” to take a few pics.   One of my SB’s worked at a daycare whiling kids butts all dat for two bucks above minimum wage.  She would gladly spend 8 hours a day texting guys for a few hundred a day.  It’s not hard work",
            "author": "LotBuilder",
            "id": "ggccefo",
            "parent_id": "t1_ggcbu6i",
            "score": 2,
            "created_utc": 1608365298.0,
            "replies": []
        }
    ]
}