{
    "title": "The reason why SA is becoming full of “low-quality” SBs",
    "post_id": "10vzkba",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/10vzkba/the_reason_why_sa_is_becoming_full_of_lowquality/",
    "author": "ccii22",
    "body": "Recently, I have seen many posts from SDs on this forum complaining about the decline in quality of SB in the bowl. I would like to share my own experiences with SDs in SA from the past week, that made me want to quit the platform:\n\n\nSD1: We were having a great conversation, and we decided to schedule a video chat. He then asked me what ethnicity I was, after I told him my ethnicity, he immediately used an offensive language, made racist remarks, and expressed the worst stereotypes about my home country, and then blocked me. Although I am aware that racism exists in this world, I honestly didn't anticipate encountering it in SA. Additionally, rather than choosing \"all ethnicities\" in the seeking section if a sd is against a specific ethnicity, why not make this clear in his profile? Or perhaps why didn’t he just block without offending me? I don't want to dwell on emotions here, even though I consider myself to be resilient to racism, his messages were way too harsh.\n\nSD2: He asked if I'd be willing to be a nanny for his child, as well as take care of his household, dog's needs and his needs. And I quote: \"the dog has needs, and so do I.\"\n\nSD3: A pot SD offered me a pity arrangement, saying \"If you make me really happy, I can give you up to (a 3-digit number) per month,\" with no gifts. I told him I make more than that working 3 times per week as a waitress and he responded with \"Keep working as a waitress, it's better.\"\n\nSD4: One man in SA listed in his profile the qualities he DIDN’T want in a sb, such as goal-oriented, career-oriented, and vegetarian…He approached me and said my profile was interesting. I point that I met the majority of the requirements he wasn't looking for, to which he responded, \"we just have to avoid talking about those topics.\" If not about our careers, aspirations, interests, or culinary preferences, what should we talk about?\n\nAdditionally, over 60% of SDs in SA (in Europe at least) explicitly state in their profile \"no financial arrangements.\"\n\nThe purpose of this post is to explain to SDs why the bowl contains subpar SBs. As a reliable SB, after only one week on the platform, my encounters with racism, disrespect, and a lack of genuine interest have made me want to quit and leave the platform to SBs who can put up with these approaches, scammers, and OF girls who want to sell content.",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/10vzkba/the_reason_why_sa_is_becoming_full_of_lowquality/",
    "score": 116,
    "upvote_ratio": 0.91,
    "created_utc": 1675769294.0,
    "num_comments": 89,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "Yikes!! Yeah there is so much junk for both. It’s draining. But then you find a good fit for awhile and forget the pain. \n\nAs an SD I read SBs posting stuff and think: well, that’s an easy next - guy sounds like an ass. Easy. But that doesn’t take away the drain. Or the time invested.",
            "author": "thereadinessisall",
            "id": "j7k69ia",
            "parent_id": "t3_10vzkba",
            "score": 37,
            "created_utc": 1675769756.0,
            "replies": [
                {
                    "body": "Seems like it’s the SDs fault yet again.\n\nI haven’t used S in a year cause out of 100 SBs I found maybe one that was attractive.\n\nI’ll say this though- I don’t blame the legit SBs for leaving S if the guys don’t want to provide financial support. I said it once and I’ll say it again. Seeking going full vanilla has made it a waste of time for people like us, cause no one on there wants a real arrangement anymore. The SBs want to sell content and the SDs (well I shouldn’t use that term) want to have a “non transactional”relationship. \n\nCertain people here shame me for saying negative things about S- but the fact is it’s a vanilla site now and they have made that very clear. It’s NOT a good place to find an attractive woman who wants a traditional arrangement.",
                    "author": "UnearthlyDinosaur",
                    "id": "j7kmyqj",
                    "parent_id": "t1_j7k69ia",
                    "score": 7,
                    "created_utc": 1675779318.0,
                    "replies": [
                        {
                            "body": "what do you feel are the better alternative places lately?",
                            "author": "JonCoffey1978",
                            "id": "j7o8xvx",
                            "parent_id": "t1_j7kmyqj",
                            "score": 1,
                            "created_utc": 1675834259.0,
                            "replies": [
                                {
                                    "body": "What’s your price is decent. At least you can offer money there without getting banned.",
                                    "author": "UnearthlyDinosaur",
                                    "id": "j7o9uyb",
                                    "parent_id": "t1_j7o8xvx",
                                    "score": 3,
                                    "created_utc": 1675834809.0,
                                    "replies": [
                                        {
                                            "body": "WYP belongs to SA.  Just saying.",
                                            "author": "ingallsd",
                                            "id": "j7put6b",
                                            "parent_id": "t1_j7o9uyb",
                                            "score": 2,
                                            "created_utc": 1675871279.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I 100% believe you. Frankly I’m impressed any of you girls hang around long enough to find a good match. \n\nI think it’s mostly about being lucky to be on when an actual man is online as well and finding that connection. \n\nOtherwise you are just wading in the filth of humanity. I get the feeling it’s like being the only girl in a dive bar after midnight, getting hit on by all the specimens that society has rejected.",
            "author": "Neither-Ad-2833",
            "id": "j7k7ci4",
            "parent_id": "t3_10vzkba",
            "score": 36,
            "created_utc": 1675770528.0,
            "replies": [
                {
                    "body": "The guys on seeking are definitely not worth it for SBs",
                    "author": "UnearthlyDinosaur",
                    "id": "j7kn3bp",
                    "parent_id": "t1_j7k7ci4",
                    "score": 9,
                    "created_utc": 1675779376.0,
                    "replies": [
                        {
                            "body": "The opposite is also true....  I just started an SA about 5 weeks ago.... \n\nWent on 8 M&Gs....\n\n2 were no-shows\n\n1 was on her phone the entire time\n\n3 were escorts\n\n1 had expectations of $xxxx/week for Platonic",
                            "author": "Veioviz",
                            "id": "j7lf0g6",
                            "parent_id": "t1_j7kn3bp",
                            "score": 8,
                            "created_utc": 1675790793.0,
                            "replies": [
                                {
                                    "body": "That is brutal and I do admit the quality of women has gone down along with the quality of men. Hang in there.",
                                    "author": "mysticalheavensawait",
                                    "id": "j7lfd4s",
                                    "parent_id": "t1_j7lf0g6",
                                    "score": 3,
                                    "created_utc": 1675790929.0,
                                    "replies": []
                                },
                                {
                                    "body": "They are probably all unattractive. Seeking is a dumpster fire",
                                    "author": "UnearthlyDinosaur",
                                    "id": "j7lr688",
                                    "parent_id": "t1_j7lf0g6",
                                    "score": -1,
                                    "created_utc": 1675795506.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "> I get the feeling it’s like being the only girl in a dive bar after midnight, getting hit on by all the specimens that society has rejected.\n\nBut if you are the only girl left in a dive bar at he end of the night that is more a reflection of you then the filth, no?",
                    "author": "CuriousSD1976",
                    "id": "j7livj4",
                    "parent_id": "t1_j7k7ci4",
                    "score": 0,
                    "created_utc": 1675792271.0,
                    "replies": [
                        {
                            "body": "Not necessarily, the person I'm perceived to be makes it very difficult for men to approach me irl unless they are shameless and very drunk OR I'm absolutely barefaced and dressed like a bum. When in reality, I'm just socially awkward and might need a friend or two around to give me the confidence to introduce myself to people sometimes.",
                            "author": "iismelldaisiesii",
                            "id": "j7luxi9",
                            "parent_id": "t1_j7livj4",
                            "score": 5,
                            "created_utc": 1675796978.0,
                            "replies": []
                        },
                        {
                            "body": "Touché",
                            "author": "Neither-Ad-2833",
                            "id": "j7lx5j8",
                            "parent_id": "t1_j7livj4",
                            "score": 2,
                            "created_utc": 1675797847.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "You need to keep trying. There are some great people on there in amongst the charlatans, liars and frauds. With time you start to get a feel for the time wasters and fruitcakes. Even then, you won’t get it right all of the time. I’ve made some great friendships through SA, some of which have continued on a non-sexual basis long after we parted company because our lives moved on.",
            "author": "Regular_Lettuce_9064",
            "id": "j7kpau8",
            "parent_id": "t3_10vzkba",
            "score": 8,
            "created_utc": 1675780373.0,
            "replies": []
        },
        {
            "body": "I’ve said this a few times on here, that all of the quality SB’s left Seeking because the site is such a shit show. But the same is true in reverse, the quality SD’s left Seeking because the quality isn’t there anymore.",
            "author": "NewYorkSD",
            "id": "j7kqezp",
            "parent_id": "t3_10vzkba",
            "score": 7,
            "created_utc": 1675780862.0,
            "replies": [
                {
                    "body": "Yep, vicious circle...",
                    "author": "A-touchofreality",
                    "id": "j7krj09",
                    "parent_id": "t1_j7kqezp",
                    "score": 4,
                    "created_utc": 1675781355.0,
                    "replies": []
                },
                {
                    "body": "I blame SESTA/FOSTA and the rebrand.",
                    "author": "mysticalheavensawait",
                    "id": "j7kyo7t",
                    "parent_id": "t1_j7kqezp",
                    "score": 4,
                    "created_utc": 1675784364.0,
                    "replies": [
                        {
                            "body": "No real reason to be on a vanilla dating site <\\3",
                            "author": "Maleficent_SB",
                            "id": "j7mp599",
                            "parent_id": "t1_j7kyo7t",
                            "score": 3,
                            "created_utc": 1675808613.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I understand where you're coming from about the \"low quality\" SB's on SA. There are no rules on there except I think it's obvious you shouldn't insult people or engage in any hate language at all..That being said, the range of SD's and SB's is a wide spectrum...and I have to sheepishly admit I may be partially responsible without knowing it before joining this forum.. I am very respectful, sensitive, polite and always act like a gentleman with women. But I guess I entered SA without even knowing that I probably shouldn't even be on there because I cannot provide financially what some women on there want....but, the site also carries and I've met and had arrangements with some women who are working their way through school, making enough to meet their basic needs but want extra income for all those things that a woman enjoys in pampering herself. Hair and nails done, massages, shopping at Sephora or Ultra etc. I've had 2 such arrangements with women who were very sincere I thought in telling me..\"I' don't want to break the bank with somebody. I just want some extras in my life\"...One was a young lady in medical school and when she graduated and got a position at a local hospital she said \"You know I don't need to do this anymore\"..It was agreed from the outset with her the arrangement would probably be just that..time limited to her being in med school. I was very happy for her success and we parted ways..You see I was a professional in the health-care field ( no not a Doc) and as my obligations to my college age children were met..I had some \"disposable income\" as I call it.. I was and am very upfront about that..and some pot SB's were fine with that level of assistance...I guess I'm a \"low quality\" SD and their \"low quality\" SBs. IDK And then I'm sure there are SD's on SA with private jets, multiple houses, exotic cars etc...It's become more and more clear to me that the site SA has a broad spectrum of SDs and SBs in terms of their expectations. The trick of course is lining up these 2 people with each other..",
            "author": "surfrat54",
            "id": "j7khd6r",
            "parent_id": "t3_10vzkba",
            "score": 12,
            "created_utc": 1675776585.0,
            "replies": [
                {
                    "body": "Thank you for sharing 💗👏",
                    "author": "P0sitiveViibes777",
                    "id": "j7km84r",
                    "parent_id": "t1_j7khd6r",
                    "score": 3,
                    "created_utc": 1675778975.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I agree with you! I’ve had two bad experiences so I quit off SA",
            "author": "AggressiveKet",
            "id": "j7kr7uv",
            "parent_id": "t3_10vzkba",
            "score": 5,
            "created_utc": 1675781220.0,
            "replies": [
                {
                    "body": "So what site do you use now?  Or have you given up on SD/SB altogether?",
                    "author": "ingallsd",
                    "id": "j7pw3yl",
                    "parent_id": "t1_j7kr7uv",
                    "score": 2,
                    "created_utc": 1675871796.0,
                    "replies": [
                        {
                            "body": "Honestly, just on here or snap. Not really trying",
                            "author": "AggressiveKet",
                            "id": "j7q8h7b",
                            "parent_id": "t1_j7pw3yl",
                            "score": 1,
                            "created_utc": 1675876609.0,
                            "replies": [
                                {
                                    "body": "I guess I am too ignorant about snap to know how to look there for SBs.",
                                    "author": "ingallsd",
                                    "id": "j7qgzi5",
                                    "parent_id": "t1_j7q8h7b",
                                    "score": 0,
                                    "created_utc": 1675879849.0,
                                    "replies": [
                                        {
                                            "body": "I have a full time job now n starting school so again; not really looking.",
                                            "author": "AggressiveKet",
                                            "id": "j7qi8xt",
                                            "parent_id": "t1_j7qgzi5",
                                            "score": 1,
                                            "created_utc": 1675880339.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "I get lots of scammer sd and sm trying to offer arrangement in snap. My general impression is that they are all scammers.",
                                            "author": "Rivergirl2878",
                                            "id": "jahwunr",
                                            "parent_id": "t1_j7qgzi5",
                                            "score": 1,
                                            "created_utc": 1677685584.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "'why not make this clear in his profile?' - because then he's be making it clear to all sb that he's racist and that's not a good look\n\ni would agree that there are a lot of, let's call them 'questionable' sd characters out there. i do see that there are these 'characters' on both sides, sb and sd\n\ni would agree that it is contributing to the downward spiral of the quality in the bowl. but just as you can't let rude or insensitive people get you down in regular life, you can't let it get you down. just be gladd that when the assholes reveal themselves, you can ignore them and not deal with them for the rest of your life. you run into assholes of various types everywhere- at leat you don't have to keep them in your life",
            "author": "davitech73",
            "id": "j7leyul",
            "parent_id": "t3_10vzkba",
            "score": 5,
            "created_utc": 1675790777.0,
            "replies": []
        },
        {
            "body": "SA now is totally different from 6 years ago when I started sugaring. An obvious decline in quality of SBs and maybe SDs. It’s hopeless. \n\nI decided to just find a GF and spoil her to bits. Vanilla relationship with sprinkled sugar! \n\nI stopped sugar dating for the time being... But I date with sugar.\n\nI hope you can find your perfect match!",
            "author": "SugarSugar1968",
            "id": "j7ke3ml",
            "parent_id": "t3_10vzkba",
            "score": 9,
            "created_utc": 1675774809.0,
            "replies": [
                {
                    "body": "This is the way.",
                    "author": "CuriousSD1976",
                    "id": "j7ljv40",
                    "parent_id": "t1_j7ke3ml",
                    "score": 2,
                    "created_utc": 1675792651.0,
                    "replies": []
                },
                {
                    "body": "At this point , might be it",
                    "author": "Cocobrownx0",
                    "id": "j7kydh1",
                    "parent_id": "t1_j7ke3ml",
                    "score": 1,
                    "created_utc": 1675784243.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "This was my experience as well . Every single one I encountered was either looking for quick & cheap hook up . Or they immediately complained about them being a tight spot financially and were just looking for a “real connection not based on transactions” LMAO BYE",
            "author": "Worldly_Quarter6785",
            "id": "j7klypd",
            "parent_id": "t3_10vzkba",
            "score": 12,
            "created_utc": 1675778853.0,
            "replies": [
                {
                    "body": "I had an ex SD reached out to me yesterday telling me he's been under a lot of stress and asked me about a statement I made previously that we'll always be good friends. So he tried to see if I wanna hook up with him to help him de-stress but he is financially tight now and cannot afford any allowance. Like wtf seriously? The audacity these men have 🥴",
                    "author": "paypahcut",
                    "id": "j7npnn9",
                    "parent_id": "t1_j7klypd",
                    "score": 5,
                    "created_utc": 1675824532.0,
                    "replies": [
                        {
                            "body": "Ikr?  It's almost as ridiculous as the SBs who only want an \"online relationship\"😂😂 like, some of them really think it's OF and SDs will pay them for online interactions and videos lool.",
                            "author": "byrdiztrulythewyrd",
                            "id": "j88npi4",
                            "parent_id": "t1_j7npnn9",
                            "score": 1,
                            "created_utc": 1676210463.0,
                            "replies": [
                                {
                                    "body": "Yeah there is a place for that and I’d say it’s in cam rooms not sugar daddy sites lmao",
                                    "author": "Worldly_Quarter6785",
                                    "id": "j88q27m",
                                    "parent_id": "t1_j88npi4",
                                    "score": 1,
                                    "created_utc": 1676211667.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "made racist remarks\n\nWho EVER does that?    \n\nthe dog has needs, and so do I   \n\nI'd fuck the dog but you? not a chance  \n   \n  3-digit number per month   \n\nare you on welfare?   \n\nNo vegetarian?   \n\nOf course not, because I wouldn't be eating your meat.   \n\nJust a few bon mots",
            "author": "GSSD",
            "id": "j7ldtxp",
            "parent_id": "t3_10vzkba",
            "score": 8,
            "created_utc": 1675790344.0,
            "replies": []
        },
        {
            "body": "How long have you been on Seeking? If just within the past year. Yes, I would say 2/3rds of guys are not realistic about what Sugaring is.\n\nI have been on 3 years now. I started right before Covid at the of 2019. I had some good luck at first. Then I took 9 months off. I got back on found a new SB right away. That lasted 3 months. Then I got so busy with my job I did not have time to sugar from March 2021-October. Took 4 months off came back. Found a SB for 4 months. She was fun, but not really an GF type. More of just a fun time. I wanted more of  connection. So I went back on found a good match. 4 months later. We parted ways. So exactly 1 year ago. I got back on the horse and I can say 2022 was the worst of them all. Got rinsed by 3 SBs in a row. Nothing but grifters, escorts, scammers, time wasters and all the above.\n\nSo, I changed my approach and now I found what I think is my best SB so far. I am very happy.\n\nSo moral of the story it takes time to find a great match: 36 months. 55 meet and greets. 100's of emails and dms all time wasters. I finally find a good match.",
            "author": "CenTexFunGuy",
            "id": "j7k8lgk",
            "parent_id": "t3_10vzkba",
            "score": 9,
            "created_utc": 1675771390.0,
            "replies": [
                {
                    "body": "What was the change to your approach?",
                    "author": "Weary-Friendship-164",
                    "id": "j7k8rxd",
                    "parent_id": "t1_j7k8lgk",
                    "score": 3,
                    "created_utc": 1675771516.0,
                    "replies": [
                        {
                            "body": ">What was the change to your approach?\n\nI quit trying to date anyone under 25. Just not my cup of tea. Could not find anyone close to what I wanted. So I moved it up to 25+. That is when I started to get better results. I quit dating SBs that had 'no job' or no other 'steady income streams' (mummy and daddy do not count).\n\nSo no more 'students' or anyone who did not have a full time job. Homeowners too. If renting I passed. I find women who own their own home are more reliable. More genuine and more what I like. ( I am not bashing a renter. Just my preference and experiences)\n\nI wanted to be an 'extra bonus' in their life. Not the one 'paying the bills'.\n\nAnd finally, I am sticking to the 4-A's. Attractive (to me), Attentive, Appreciative, and the biggest of them all. Affectionate!!!!! No more will ever date anyone who is not affectionate. I am very affectionate and hands on. I love to touch and caress my partner. I am not gropy or gross about it. Just my thing.\n\nEdit: I will also add Single Moms. They are much more reliable and know what they want. Most are less likely to be flakey. And they are on my schedule of 'early to bed and early to rise' with kids.  Sure, there will be dates where they have to cancel last minute or only have 4 hours on X or Y days. But so far it seems worth it.",
                            "author": "CenTexFunGuy",
                            "id": "j7kgmd2",
                            "parent_id": "t1_j7k8rxd",
                            "score": 11,
                            "created_utc": 1675776196.0,
                            "replies": [
                                {
                                    "body": "I live close to a college town so a lot of my sb's over the years have been students 19-22.\n\nI have been seeing them flake a lot more on me in the past year and they are overall just not that reliable.\n\nI switched my age range to 25 -30 and am having much better results and the girls are just as hot.\n\n\\-----------------------------\n\n\"Single Moms. They are much more reliable and know what they want. Most are less likely to be flakey.\"\n\nGood observation I never thought of it that way.",
                                    "author": "LuckyINTJ",
                                    "id": "j7kw8rw",
                                    "parent_id": "t1_j7kgmd2",
                                    "score": 7,
                                    "created_utc": 1675783365.0,
                                    "replies": [
                                        {
                                            "body": ">I live close to a college town so a lot of my sb's over the years have been students 19-22.\n\nI live in a College town. Like 10 min away. I tried to date 'local'. All 3 rinsed me and were flakes. Getting too drunk the day before a date. Always wanting to 'party'. I am too old to 'party' like they do.",
                                            "author": "CenTexFunGuy",
                                            "id": "j7kxki1",
                                            "parent_id": "t1_j7kw8rw",
                                            "score": 1,
                                            "created_utc": 1675783911.0,
                                            "replies": []
                                        },
                                        {
                                            "body": ">Good observation I never thought of it that way.\n\nFor them it is an 'escape' from the daily grind. My SB told me she looks forward to seeing me so she can recharge and relax.",
                                            "author": "CenTexFunGuy",
                                            "id": "j7kxeb8",
                                            "parent_id": "t1_j7kw8rw",
                                            "score": 0,
                                            "created_utc": 1675783838.0,
                                            "replies": [
                                                {
                                                    "body": "Hellllll yes. I get the four A's and don't have to feel guilty for taking \"me\" time because the money goes to the kids' investment accounts. (Okay, sometimes goes to keeping a roof over their heads, but that is neither the plan nor the path I'm on, just some bumps in the road.) \n\nAnd I can get all the feelings for my guy without worrying about him intruding on my children's lives; no marriage proposals, no fantasizing about making babies, etc.",
                                                    "author": "Insatiable_Learner",
                                                    "id": "j7lsbiu",
                                                    "parent_id": "t1_j7kxeb8",
                                                    "score": 2,
                                                    "created_utc": 1675795953.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "I used to think I wanted a 21 year old hottie. But it turns out I don’t really have that much in common with 21 year olds. No matter how hot they are. And they a lot less reliable and more flakey. Besides there are plenty of 30ish folks who are still plenty hot but have so much more to offer from an emotional maturity perspective.",
                                    "author": "itsa_trapp",
                                    "id": "j7kr21l",
                                    "parent_id": "t1_j7kgmd2",
                                    "score": 6,
                                    "created_utc": 1675781147.0,
                                    "replies": []
                                },
                                {
                                    "body": "I’ve personally used a similar strategy and it has paid off.",
                                    "author": "Polithrowaway12",
                                    "id": "j7ml7k2",
                                    "parent_id": "t1_j7kgmd2",
                                    "score": 2,
                                    "created_utc": 1675807034.0,
                                    "replies": []
                                },
                                {
                                    "body": "The 4 A’s! Love this",
                                    "author": "Logical-Equipment-23",
                                    "id": "j7ki3cl",
                                    "parent_id": "t1_j7kgmd2",
                                    "score": 2,
                                    "created_utc": 1675776965.0,
                                    "replies": []
                                },
                                {
                                    "body": "This is good screening criteria.",
                                    "author": "mysticalheavensawait",
                                    "id": "j7ky9m0",
                                    "parent_id": "t1_j7kgmd2",
                                    "score": 1,
                                    "created_utc": 1675784198.0,
                                    "replies": []
                                },
                                {
                                    "body": "Also, women 25+ are generally better in bed. At least in my experience",
                                    "author": "FreeTheMarket",
                                    "id": "j7rinve",
                                    "parent_id": "t1_j7kgmd2",
                                    "score": 1,
                                    "created_utc": 1675893987.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "> 36 months. 55 meet and greets. 100's of emails and dms all time wasters. I finally find a good match.\n\nYou’ll have better success finding a regular girl out and about who values your success. If you are a wealthy successful and single man, a lot of attractive girls who are not on SA want you.",
                    "author": "geekxp",
                    "id": "j7kdyrk",
                    "parent_id": "t1_j7k8lgk",
                    "score": 5,
                    "created_utc": 1675774732.0,
                    "replies": [
                        {
                            "body": "> a lot of attractive girls who are not on SA want you.\n\nI have no idea where to even find them. I am sure you are right. I am very happy with my current SR. She is wonderful. I have not even tried to vanilla or hybrid date in well over 10 years. I do not even know how to vanilla date anymore...",
                            "author": "CenTexFunGuy",
                            "id": "j7kfhia",
                            "parent_id": "t1_j7kdyrk",
                            "score": 2,
                            "created_utc": 1675775585.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Y checks out - the true top talent is hard to find on seeking. The average profile is not SB caliber to begin with, the best have other better venues to frequent or the strong entry level job market also means they don’t need to deal w any creeps on seeking \n\nUnfortunate that the experience is worse for both sides, but it is what it is. I am just hoping my current SR lasts a long enough time, I have no desire to go back on seeking any time soon",
            "author": "OCbird22",
            "id": "j7ksdwu",
            "parent_id": "t3_10vzkba",
            "score": 3,
            "created_utc": 1675781731.0,
            "replies": []
        },
        {
            "body": "I have to say that this was not my experience of Seeking at all. I experienced no racism but I did experience fantasists, the low ballers, a whole collection of the most bizarre sexual fantasies and more low effort one liners than I've ever experienced on Tinder.\n\nI managed to meet two decent and reliable SDs out of it so I can't complain.",
            "author": "superbex98",
            "id": "j7ko4jw",
            "parent_id": "t3_10vzkba",
            "score": 3,
            "created_utc": 1675779845.0,
            "replies": [
                {
                    "body": "I haven't experienced racism on SA, but I have on Bumble. That was.... Fun.... I hope to see him irl someday so I can smell his fear everytime I open my mouth!",
                    "author": "iismelldaisiesii",
                    "id": "j7lv9ps",
                    "parent_id": "t1_j7ko4jw",
                    "score": 3,
                    "created_utc": 1675797112.0,
                    "replies": [
                        {
                            "body": "Are you planning on biting his c\\*ck off or something?",
                            "author": "superbex98",
                            "id": "j7lwxnw",
                            "parent_id": "t1_j7lv9ps",
                            "score": 3,
                            "created_utc": 1675797762.0,
                            "replies": [
                                {
                                    "body": "Never even crossed my mind, but now, I'm seriously considering it",
                                    "author": "iismelldaisiesii",
                                    "id": "j7mlo7y",
                                    "parent_id": "t1_j7lwxnw",
                                    "score": 1,
                                    "created_utc": 1675807213.0,
                                    "replies": []
                                },
                                {
                                    "body": "Hey Bex x",
                                    "author": "Anna_SB_London",
                                    "id": "j7ms1tf",
                                    "parent_id": "t1_j7lwxnw",
                                    "score": 1,
                                    "created_utc": 1675809792.0,
                                    "replies": [
                                        {
                                            "body": "Hello back to you!",
                                            "author": "superbex98",
                                            "id": "j7msxed",
                                            "parent_id": "t1_j7ms1tf",
                                            "score": 1,
                                            "created_utc": 1675810152.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I started sugaring at 20 and the quality of men on Seeking then were much better. I think SESTA/FOSTA happened and then all of the escort rejects flooded Seeking. It’s a bummer to hear that about Europe though. I did read on here that they tend to be cheaper.",
            "author": "mysticalheavensawait",
            "id": "j7kxmom",
            "parent_id": "t3_10vzkba",
            "score": 4,
            "created_utc": 1675783936.0,
            "replies": [
                {
                    "body": "Bingo. All of the laws prosecuting sex workers and their \"Johns\" drove them into other avenues. The wave of \"cam girls\" really started to swell in the last few years.",
                    "author": "TigerSharkSLDF",
                    "id": "j7lbqdc",
                    "parent_id": "t1_j7kxmom",
                    "score": 1,
                    "created_utc": 1675789530.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "How do we stop going round and round in these circles and basically spreading mutual mistrust and bordering on hate for the opposite sex? I’m not active on the platform right now, thank god by the sounds of it! But I could share an almost exact similar experience from when I was last active based on my experience of fake, rude and entitled SBs. We are all going to come across them unfortunately and it’s how we react and our attitude that matters. Once I got past the point where I knew how not to be scammed and I was savvy enough to not get into anything that would impact me either physically, financially or emotionally then all that is left is a bit of time wasting. Yes that’s very annoying but not the end of the world. I spent huge amounts of time chasing business in the past that came to nothing. It’s part of the game and we all need to accept it. But to your specific experiences: -\n\nSD1 - Nothing to say. Wrong in every sense. Honestly, I would report him as he should not be on dating sites if that is how he treats people.\n\nSD2 - Looks like he was on the wrong platform! Basically I would have laughed at this.\n\nSD3 - Another rude ah and clearly not serious, so just don’t waste any more time.\n\nSD4 - Clearly not a match and very weird boundaries to set from him, again move on.\n\nIs it really 60% stating no rewards? Sounds a lot, but I agree with other comments; any serious SD knows that this is BS, so I would simply ignore the comment OR if you are really interested in the guy then the first message should be “oh, I assume this was a joke, wink wink”.\n\nYour experience was in some cases really awful and completely unacceptable, in other cases rude and in others just weird. But if you have only been on the platform for a week, then I think most people will agree it can take time, persistence and extreme filtering to get down to the genuine matches. And it all depends on location, compatibility and some degree of luck.",
            "author": "Sad_Manufacturer9669",
            "id": "j7ks1om",
            "parent_id": "t3_10vzkba",
            "score": 2,
            "created_utc": 1675781582.0,
            "replies": []
        },
        {
            "body": "Someone needs to make a sugar app that kicks out toxic creeps on both sides",
            "author": "sehns",
            "id": "j7l2dj2",
            "parent_id": "t3_10vzkba",
            "score": 2,
            "created_utc": 1675785853.0,
            "replies": [
                {
                    "body": "Sure it would be great. However, there's no admin tool that could effectively filter scammers, creeps, fakes, and johns/escorts out.",
                    "author": "EuropeanDaddyDom",
                    "id": "j7lp3ap",
                    "parent_id": "t1_j7l2dj2",
                    "score": 1,
                    "created_utc": 1675794697.0,
                    "replies": [
                        {
                            "body": "You would rely on user reports and have them submit evidence like screenshots etc",
                            "author": "sehns",
                            "id": "j7nk8q6",
                            "parent_id": "t1_j7lp3ap",
                            "score": 1,
                            "created_utc": 1675822113.0,
                            "replies": [
                                {
                                    "body": "Yes, Seeking does this. You see how effective it is.",
                                    "author": "EuropeanDaddyDom",
                                    "id": "j7nrg33",
                                    "parent_id": "t1_j7nk8q6",
                                    "score": 1,
                                    "created_utc": 1675825344.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": ">over 60% of SDs in SA (in Europe at least) explicitly state in their profile \"no financial arrangements.\"\n\nThey are not SDs. Also they have marked themselves to be easily recognized and nexted.  \nThese people are the counterparts of women who lack what it takes to be an SB and are looking for platonic arrangements. BLOCK/NEXT\n\n>As a reliable SB, after only one week on the platform, my encounters with racism, disrespect, and a lack of genuine interest have made me want to quit and leave the platform to SBs who can put up with these approaches, scammers, and OF girls who want to sell content.\n\nA week of negative experiences should not discourage you. It takes months to find a real SD or SB nowadays. That's just the nature of the beast.",
            "author": "EuropeanDaddyDom",
            "id": "j7lkw20",
            "parent_id": "t3_10vzkba",
            "score": 2,
            "created_utc": 1675793056.0,
            "replies": []
        },
        {
            "body": "It sounds like, at least in Europe (you mentioned it so I am assuming location) many self-identified SDs are (in a term once from an SB that I loved) \"douche canoes\". I am sorry you had to put up with those. But one thing confused me, why add \"OF girls that only want to sell content\"? How would those effect you?",
            "author": "SDInLeather",
            "id": "j7lmthw",
            "parent_id": "t3_10vzkba",
            "score": 2,
            "created_utc": 1675793817.0,
            "replies": [
                {
                    "body": "Because most of sd recently complains that there are a lot of girls in SA who just want to sell content or just send their OF link. My point is after what I encountered during this week as a legit sb I’m thinking about leaving the platform and leaving it more to the girls who want to do online business.",
                    "author": "ccii22",
                    "id": "j7mgol5",
                    "parent_id": "t1_j7lmthw",
                    "score": 2,
                    "created_utc": 1675805295.0,
                    "replies": [
                        {
                            "body": "There \\*are\\* indeed quite a few. I screen them partially in my profile, by stating I have no interest in online only relationships, including those that only sell content. But, many do not read, so instead what I do is just report them as soon as they are clear that that is all that they are doing. Maybe Seeking bans them, maybe not. As before, though, I am sorry you had to deal with the series of idiots, I cannot speak for other SD's on Seeking, only for myself, that I would never do any of those behaviors. I am though a legit one, who has had several very wonderful arrangements from there over the years, so I tend to respect the forum(even were I to act like that by nature, which thankfully I do not).",
                            "author": "SDInLeather",
                            "id": "j7mn8ns",
                            "parent_id": "t1_j7mgol5",
                            "score": 2,
                            "created_utc": 1675807846.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Hun, I'm so sorry you were treated that way!\n\nThe quality for BOTH sides, has really just gone to absolute shit.",
            "author": "JustAsk4Alice",
            "id": "j7m3nrv",
            "parent_id": "t3_10vzkba",
            "score": 2,
            "created_utc": 1675800338.0,
            "replies": []
        },
        {
            "body": "This site has always been a flaming dumpster fire 😂",
            "author": "la_selena",
            "id": "j7mleir",
            "parent_id": "t3_10vzkba",
            "score": 2,
            "created_utc": 1675807109.0,
            "replies": []
        },
        {
            "body": "I’ve had many similar interactions on SA shortly after i moved to the US from Asia. I had great arrangements while living an Asia and just terrible experiences in the states. This is exactly the reason I left. Tbf when i lived in Asia i was living in a big metropolis city and now I live in a suburb in the Midwest. I’m curious if that has something to do with the terrible quality in pot SDs in my experience",
            "author": "EntertainmentSharp24",
            "id": "j7n70z4",
            "parent_id": "t3_10vzkba",
            "score": 2,
            "created_utc": 1675816161.0,
            "replies": []
        },
        {
            "body": "You are in Europe where men have their needs satisfied without sugar babies. the chance of getting a SD in Europe is next to zero.",
            "author": "JeaneyBowl",
            "id": "j7n7n1n",
            "parent_id": "t3_10vzkba",
            "score": 2,
            "created_utc": 1675816428.0,
            "replies": []
        },
        {
            "body": "If you genuinely want an arrangement don’t quit. These issues are mirrored for SB and SD. A good arrangement isn’t necessarily going to come immediately but once it does it’s worth while. One thing for everyone is don’t waste time as soon as anyone gives a red flag. Just move on.",
            "author": "SW1981",
            "id": "j7n85ol",
            "parent_id": "t3_10vzkba",
            "score": 2,
            "created_utc": 1675816654.0,
            "replies": []
        },
        {
            "body": "Don’t want Goal/career oriented?!! This one I don’t get at all…",
            "author": "burnersugbbac",
            "id": "j7nw50b",
            "parent_id": "t3_10vzkba",
            "score": 2,
            "created_utc": 1675827539.0,
            "replies": []
        },
        {
            "body": "Bad experiences but you have to sort through a bunch until you find one (if you're lucky) that's just the nature of the beast.  I've had a SB commit felony fraud against me and get locked up, another with attempted extortion as well, which are far nastier than some ugly comments or weird arrangement requests.  Criminal background checks should be required by SA and disclosed in some manner which I'll leave up to them.......but they're doing nothing now",
            "author": "Snoo71180",
            "id": "ja2o2wo",
            "parent_id": "t3_10vzkba",
            "score": 2,
            "created_utc": 1677411294.0,
            "replies": []
        },
        {
            "body": "Sorry to hear that, but I'd stick around a little more, there are good SDs out there, even if finding them requires putting up with the fake ones.  \nAside from SD1 which is unexcusable the other have their reasons, which might not be immediately apparent: \nSD2 might need some plausible reason for you to be there, I've introduced SBs as secretaries or marketing assistants to acquaintances I happened to meet while out dining. SD3 is probably from eastern Europe, where high 3 digit numbers are the normal allowance. SD4 is 'nicely' saying he's looking for sex only.  \n>Additionally, over 60% of SDs in SA (in Europe at least) explicitly state in their profile \"no financial arrangements.\"  \n\nThis is plausible deniability in case someone they know stumbles upon their account. Trust me, people know what Seeking is and what's expected of them.\n\nGood luck to you, your unicorn SD is waiting somewhere, you'll find him eventually.  \nEdit: It might be a good idea to post a profile review, SD1 not being able to figure your ethnicity leads me to think you might not have pictures or have headless ones like escorting sites use. Having no/incomplete pictures is a big red flag for most reals SDs. Also, picture review takes a while on Seeking, pictures you might have posted 3-4 days ago might not be displayed on you profile yet, try waiting a little. Same goes for your description.",
            "author": "val_br",
            "id": "j7kc3xf",
            "parent_id": "t3_10vzkba",
            "score": 2,
            "created_utc": 1675773641.0,
            "replies": []
        },
        {
            "body": "*Although I am aware that racism exists in this world, I honestly didn't anticipate encountering it in SA.*\n\nFrankly, I don't understand why you would think Seeking would be somehow exempt from racists.",
            "author": "BinghamtonSD",
            "id": "j7kdz0g",
            "parent_id": "t3_10vzkba",
            "score": 2,
            "created_utc": 1675774736.0,
            "replies": [
                {
                    "body": "Had the thought of Seeking being a platform with men having certain level of wisdom and education.",
                    "author": "ccii22",
                    "id": "j7kgbgk",
                    "parent_id": "t1_j7kdz0g",
                    "score": 3,
                    "created_utc": 1675776035.0,
                    "replies": [
                        {
                            "body": "No, just a platform with men having enough money to pay for the $100+/month premium membership. A subset of those men will have a certain level of widsom and education.",
                            "author": "BinghamtonSD",
                            "id": "j7kp671",
                            "parent_id": "t1_j7kgbgk",
                            "score": 5,
                            "created_utc": 1675780313.0,
                            "replies": [
                                {
                                    "body": "I see you may have posted a number which is most likely an amount in relations to an arrangement. If this is the case, you are violating Rule #4 - \"No dollar amounts that are in reference to allowance/PPM are allowed.\"\n\nIf you are curious about Allowances reported by SLF contributors please see the [Allowance Master Thread 2021-2022](/r/sugarlifestyleforum/comments/pc22tk/allowance_master_thread_20212022/).\n\nYour post will not be approved until you remove the amount.  Please read the sub [Rules](/r/sugarlifestyleforum/comments/748zta/updated_and_clarified_rules_for_slf/) prior to posting anything else. \n\nIf you simply posted a number not referencing a monetary amount, please message the MODs to approve your post.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/sugarlifestyleforum) if you have any questions or concerns.*",
                                    "author": "AutoModerator",
                                    "id": "j7kp688",
                                    "parent_id": "t1_j7kp671",
                                    "score": -1,
                                    "created_utc": 1675780313.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "racism isn't caused by a lack of wisdom or education. it's more a lack of empathy",
                            "author": "davitech73",
                            "id": "j7lpj8j",
                            "parent_id": "t1_j7kgbgk",
                            "score": 1,
                            "created_utc": 1675794868.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "It’s really hard finding the right person so hang in there. I utilize SA’s filters for the basics + went on 2-3 M&zags daily for about a week to find my SD.",
            "author": "TheSinema",
            "id": "j7kesqg",
            "parent_id": "t3_10vzkba",
            "score": 2,
            "created_utc": 1675775205.0,
            "replies": []
        },
        {
            "body": "Why is it the don’t seem to get the sugar part of their job description!!! You will also find it’s those who are low grade SD’s that make comments like this - the resent having to pay to get attention. Too bad sunshine pay up or slide on outta here x",
            "author": "Anna_SB_London",
            "id": "j7mmp80",
            "parent_id": "t3_10vzkba",
            "score": 2,
            "created_utc": 1675807631.0,
            "replies": []
        },
        {
            "body": "You pointed out that there’s a lot of subpar men posing as SDs.  It’s a logical fallacy that this will lead to more subpar SBs on the site.",
            "author": "DarthDaddius",
            "id": "j7kg4ct",
            "parent_id": "t3_10vzkba",
            "score": 2,
            "created_utc": 1675775930.0,
            "replies": []
        },
        {
            "body": "I started 4 months into lockdown, feeling I got the better of most recent batch, there was no perfection but certainly both I and the matches had valuable needs and the stock market served my allowance nicely at the start of my experience. Imagine, ppm in btc and constant spoiling dates outside of allowance- was great during nyc lockdown. Both went over the span of a year and one went 2 years, respectfully long distance, with travel monthly, gifts delivered to my door, and emotional connection. \n\nI hate how SA is now, lack of connections and quite rude. \n\nFree styling at a conference of your field-adjacent is probably a better approach. Don’t let anyone twist you into a pretzel.",
            "author": "ImpossibleSalary5504",
            "id": "j7k9byg",
            "parent_id": "t3_10vzkba",
            "score": 1,
            "created_utc": 1675771888.0,
            "replies": []
        },
        {
            "body": "I honestly have noticed that SA seems to be flooded with Average/below average SB, especially in attractiveness.  Not too many 9s and 10s on there.  There are some, but that site is mostly normal looking girls.  You gotta stay on there and try hard to find that amazing SB we all have in our minds.  It's the truth.  And don't get me started with the cute girls only  looking for platonic omg.  They are increasing big time and I don't like it lol.  I'll find my perfect SB this month hopefully.",
            "author": "MalibuProducer77",
            "id": "j7pr8n3",
            "parent_id": "t3_10vzkba",
            "score": 0,
            "created_utc": 1675869818.0,
            "replies": []
        },
        {
            "body": ">Additionally, over 60% of SDs in SA (in Europe at least) explicitly state in their profile \"no financial arrangements.\"\n\nGreat! All the better for me.\n\n>The purpose of this post is to explain to SDs why the bowl contains subpar SBs.\n\nIt does no such thing though 🤔\n\n>As a reliable SB, after only one week on the platform, my encounters with racism, disrespect, and a lack of genuine interest have made me want to quit and leave the platform\n\nSorry to hear that but I wonder if you have taken any personal accountability for your experience or is it simply the fault of all the bad \"SDs\"?\n\n>One man in SA listed in his profile the qualities he DIDN’T want in a sb\n\nBut you just said...\n\n>if a sd is against a specific ethnicity, why not make this clear in his profile?",
            "author": "London-SD",
            "id": "j7kpnfa",
            "parent_id": "t3_10vzkba",
            "score": -5,
            "created_utc": 1675780530.0,
            "replies": []
        },
        {
            "body": "*Recently, I have seen many posts from SDs on this forum complaining about the decline in quality of SB in the bow*\n\n\\^This is both a recent and eternal part of SLF\n\n*made me want to quit and leave*\n\n*\\^*Also both a recent and eternal part of Seeking, for both men and women\n\nStill - For most of us, the grind tends to be worth it when you find something good.",
            "author": "Gemini-Fox",
            "id": "j7l5mju",
            "parent_id": "t3_10vzkba",
            "score": 1,
            "created_utc": 1675787146.0,
            "replies": []
        },
        {
            "body": ">Additionally, over 60% of SDs in SA (in Europe at least) explicitly state in their profile \"no financial arrangements.\"\n\nI wonder if this is a defense mechanism against the new SA \"AI\" so that their accounts won't be flagged/banned?",
            "author": "CuriousSD1976",
            "id": "j7lil9n",
            "parent_id": "t3_10vzkba",
            "score": 1,
            "created_utc": 1675792161.0,
            "replies": []
        },
        {
            "body": "The state of the bowl is terrible - it’s almost as bad as dating in the real world.",
            "author": "Odd-Luck7658",
            "id": "j7vn9js",
            "parent_id": "t3_10vzkba",
            "score": 1,
            "created_utc": 1675969233.0,
            "replies": []
        },
        {
            "body": "Seems like it’s the SDs fault yet again.\n\nI haven’t used S in a year cause out of 100 SBs I found maybe one that was attractive.\n\nI’ll say this though- I don’t blame the legit SBs for leaving S if the guys don’t want to provide financial support. I said it once and I’ll say it again. Seeking going full vanilla has made it a waste of time for people like us, cause no one on there wants a real arrangement anymore. The SBs want to sell content and the SDs (well I shouldn’t use that term) want to have a “non transactional”relationship. \n\nCertain people here shame me for saying negative things about S- but the fact is it’s a vanilla site now and they have made that very clear. It’s NOT a good place to find an attractive woman who wants a traditional arrangement.",
            "author": "UnearthlyDinosaur",
            "id": "j7kmyqj",
            "parent_id": "t1_j7k69ia",
            "score": 7,
            "created_utc": 1675779318.0,
            "replies": [
                {
                    "body": "what do you feel are the better alternative places lately?",
                    "author": "JonCoffey1978",
                    "id": "j7o8xvx",
                    "parent_id": "t1_j7kmyqj",
                    "score": 1,
                    "created_utc": 1675834259.0,
                    "replies": [
                        {
                            "body": "What’s your price is decent. At least you can offer money there without getting banned.",
                            "author": "UnearthlyDinosaur",
                            "id": "j7o9uyb",
                            "parent_id": "t1_j7o8xvx",
                            "score": 3,
                            "created_utc": 1675834809.0,
                            "replies": [
                                {
                                    "body": "WYP belongs to SA.  Just saying.",
                                    "author": "ingallsd",
                                    "id": "j7put6b",
                                    "parent_id": "t1_j7o9uyb",
                                    "score": 2,
                                    "created_utc": 1675871279.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "The guys on seeking are definitely not worth it for SBs",
            "author": "UnearthlyDinosaur",
            "id": "j7kn3bp",
            "parent_id": "t1_j7k7ci4",
            "score": 9,
            "created_utc": 1675779376.0,
            "replies": [
                {
                    "body": "The opposite is also true....  I just started an SA about 5 weeks ago.... \n\nWent on 8 M&Gs....\n\n2 were no-shows\n\n1 was on her phone the entire time\n\n3 were escorts\n\n1 had expectations of $xxxx/week for Platonic",
                    "author": "Veioviz",
                    "id": "j7lf0g6",
                    "parent_id": "t1_j7kn3bp",
                    "score": 8,
                    "created_utc": 1675790793.0,
                    "replies": [
                        {
                            "body": "That is brutal and I do admit the quality of women has gone down along with the quality of men. Hang in there.",
                            "author": "mysticalheavensawait",
                            "id": "j7lfd4s",
                            "parent_id": "t1_j7lf0g6",
                            "score": 3,
                            "created_utc": 1675790929.0,
                            "replies": []
                        },
                        {
                            "body": "They are probably all unattractive. Seeking is a dumpster fire",
                            "author": "UnearthlyDinosaur",
                            "id": "j7lr688",
                            "parent_id": "t1_j7lf0g6",
                            "score": -1,
                            "created_utc": 1675795506.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "> I get the feeling it’s like being the only girl in a dive bar after midnight, getting hit on by all the specimens that society has rejected.\n\nBut if you are the only girl left in a dive bar at he end of the night that is more a reflection of you then the filth, no?",
            "author": "CuriousSD1976",
            "id": "j7livj4",
            "parent_id": "t1_j7k7ci4",
            "score": 0,
            "created_utc": 1675792271.0,
            "replies": [
                {
                    "body": "Not necessarily, the person I'm perceived to be makes it very difficult for men to approach me irl unless they are shameless and very drunk OR I'm absolutely barefaced and dressed like a bum. When in reality, I'm just socially awkward and might need a friend or two around to give me the confidence to introduce myself to people sometimes.",
                    "author": "iismelldaisiesii",
                    "id": "j7luxi9",
                    "parent_id": "t1_j7livj4",
                    "score": 5,
                    "created_utc": 1675796978.0,
                    "replies": []
                },
                {
                    "body": "Touché",
                    "author": "Neither-Ad-2833",
                    "id": "j7lx5j8",
                    "parent_id": "t1_j7livj4",
                    "score": 2,
                    "created_utc": 1675797847.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yep, vicious circle...",
            "author": "A-touchofreality",
            "id": "j7krj09",
            "parent_id": "t1_j7kqezp",
            "score": 4,
            "created_utc": 1675781355.0,
            "replies": []
        },
        {
            "body": "I blame SESTA/FOSTA and the rebrand.",
            "author": "mysticalheavensawait",
            "id": "j7kyo7t",
            "parent_id": "t1_j7kqezp",
            "score": 4,
            "created_utc": 1675784364.0,
            "replies": [
                {
                    "body": "No real reason to be on a vanilla dating site <\\3",
                    "author": "Maleficent_SB",
                    "id": "j7mp599",
                    "parent_id": "t1_j7kyo7t",
                    "score": 3,
                    "created_utc": 1675808613.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Thank you for sharing 💗👏",
            "author": "P0sitiveViibes777",
            "id": "j7km84r",
            "parent_id": "t1_j7khd6r",
            "score": 3,
            "created_utc": 1675778975.0,
            "replies": []
        },
        {
            "body": "So what site do you use now?  Or have you given up on SD/SB altogether?",
            "author": "ingallsd",
            "id": "j7pw3yl",
            "parent_id": "t1_j7kr7uv",
            "score": 2,
            "created_utc": 1675871796.0,
            "replies": [
                {
                    "body": "Honestly, just on here or snap. Not really trying",
                    "author": "AggressiveKet",
                    "id": "j7q8h7b",
                    "parent_id": "t1_j7pw3yl",
                    "score": 1,
                    "created_utc": 1675876609.0,
                    "replies": [
                        {
                            "body": "I guess I am too ignorant about snap to know how to look there for SBs.",
                            "author": "ingallsd",
                            "id": "j7qgzi5",
                            "parent_id": "t1_j7q8h7b",
                            "score": 0,
                            "created_utc": 1675879849.0,
                            "replies": [
                                {
                                    "body": "I have a full time job now n starting school so again; not really looking.",
                                    "author": "AggressiveKet",
                                    "id": "j7qi8xt",
                                    "parent_id": "t1_j7qgzi5",
                                    "score": 1,
                                    "created_utc": 1675880339.0,
                                    "replies": []
                                },
                                {
                                    "body": "I get lots of scammer sd and sm trying to offer arrangement in snap. My general impression is that they are all scammers.",
                                    "author": "Rivergirl2878",
                                    "id": "jahwunr",
                                    "parent_id": "t1_j7qgzi5",
                                    "score": 1,
                                    "created_utc": 1677685584.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "This is the way.",
            "author": "CuriousSD1976",
            "id": "j7ljv40",
            "parent_id": "t1_j7ke3ml",
            "score": 2,
            "created_utc": 1675792651.0,
            "replies": []
        },
        {
            "body": "At this point , might be it",
            "author": "Cocobrownx0",
            "id": "j7kydh1",
            "parent_id": "t1_j7ke3ml",
            "score": 1,
            "created_utc": 1675784243.0,
            "replies": []
        },
        {
            "body": "I had an ex SD reached out to me yesterday telling me he's been under a lot of stress and asked me about a statement I made previously that we'll always be good friends. So he tried to see if I wanna hook up with him to help him de-stress but he is financially tight now and cannot afford any allowance. Like wtf seriously? The audacity these men have 🥴",
            "author": "paypahcut",
            "id": "j7npnn9",
            "parent_id": "t1_j7klypd",
            "score": 5,
            "created_utc": 1675824532.0,
            "replies": [
                {
                    "body": "Ikr?  It's almost as ridiculous as the SBs who only want an \"online relationship\"😂😂 like, some of them really think it's OF and SDs will pay them for online interactions and videos lool.",
                    "author": "byrdiztrulythewyrd",
                    "id": "j88npi4",
                    "parent_id": "t1_j7npnn9",
                    "score": 1,
                    "created_utc": 1676210463.0,
                    "replies": [
                        {
                            "body": "Yeah there is a place for that and I’d say it’s in cam rooms not sugar daddy sites lmao",
                            "author": "Worldly_Quarter6785",
                            "id": "j88q27m",
                            "parent_id": "t1_j88npi4",
                            "score": 1,
                            "created_utc": 1676211667.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "What was the change to your approach?",
            "author": "Weary-Friendship-164",
            "id": "j7k8rxd",
            "parent_id": "t1_j7k8lgk",
            "score": 3,
            "created_utc": 1675771516.0,
            "replies": [
                {
                    "body": ">What was the change to your approach?\n\nI quit trying to date anyone under 25. Just not my cup of tea. Could not find anyone close to what I wanted. So I moved it up to 25+. That is when I started to get better results. I quit dating SBs that had 'no job' or no other 'steady income streams' (mummy and daddy do not count).\n\nSo no more 'students' or anyone who did not have a full time job. Homeowners too. If renting I passed. I find women who own their own home are more reliable. More genuine and more what I like. ( I am not bashing a renter. Just my preference and experiences)\n\nI wanted to be an 'extra bonus' in their life. Not the one 'paying the bills'.\n\nAnd finally, I am sticking to the 4-A's. Attractive (to me), Attentive, Appreciative, and the biggest of them all. Affectionate!!!!! No more will ever date anyone who is not affectionate. I am very affectionate and hands on. I love to touch and caress my partner. I am not gropy or gross about it. Just my thing.\n\nEdit: I will also add Single Moms. They are much more reliable and know what they want. Most are less likely to be flakey. And they are on my schedule of 'early to bed and early to rise' with kids.  Sure, there will be dates where they have to cancel last minute or only have 4 hours on X or Y days. But so far it seems worth it.",
                    "author": "CenTexFunGuy",
                    "id": "j7kgmd2",
                    "parent_id": "t1_j7k8rxd",
                    "score": 11,
                    "created_utc": 1675776196.0,
                    "replies": [
                        {
                            "body": "I live close to a college town so a lot of my sb's over the years have been students 19-22.\n\nI have been seeing them flake a lot more on me in the past year and they are overall just not that reliable.\n\nI switched my age range to 25 -30 and am having much better results and the girls are just as hot.\n\n\\-----------------------------\n\n\"Single Moms. They are much more reliable and know what they want. Most are less likely to be flakey.\"\n\nGood observation I never thought of it that way.",
                            "author": "LuckyINTJ",
                            "id": "j7kw8rw",
                            "parent_id": "t1_j7kgmd2",
                            "score": 7,
                            "created_utc": 1675783365.0,
                            "replies": [
                                {
                                    "body": ">I live close to a college town so a lot of my sb's over the years have been students 19-22.\n\nI live in a College town. Like 10 min away. I tried to date 'local'. All 3 rinsed me and were flakes. Getting too drunk the day before a date. Always wanting to 'party'. I am too old to 'party' like they do.",
                                    "author": "CenTexFunGuy",
                                    "id": "j7kxki1",
                                    "parent_id": "t1_j7kw8rw",
                                    "score": 1,
                                    "created_utc": 1675783911.0,
                                    "replies": []
                                },
                                {
                                    "body": ">Good observation I never thought of it that way.\n\nFor them it is an 'escape' from the daily grind. My SB told me she looks forward to seeing me so she can recharge and relax.",
                                    "author": "CenTexFunGuy",
                                    "id": "j7kxeb8",
                                    "parent_id": "t1_j7kw8rw",
                                    "score": 0,
                                    "created_utc": 1675783838.0,
                                    "replies": [
                                        {
                                            "body": "Hellllll yes. I get the four A's and don't have to feel guilty for taking \"me\" time because the money goes to the kids' investment accounts. (Okay, sometimes goes to keeping a roof over their heads, but that is neither the plan nor the path I'm on, just some bumps in the road.) \n\nAnd I can get all the feelings for my guy without worrying about him intruding on my children's lives; no marriage proposals, no fantasizing about making babies, etc.",
                                            "author": "Insatiable_Learner",
                                            "id": "j7lsbiu",
                                            "parent_id": "t1_j7kxeb8",
                                            "score": 2,
                                            "created_utc": 1675795953.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "I used to think I wanted a 21 year old hottie. But it turns out I don’t really have that much in common with 21 year olds. No matter how hot they are. And they a lot less reliable and more flakey. Besides there are plenty of 30ish folks who are still plenty hot but have so much more to offer from an emotional maturity perspective.",
                            "author": "itsa_trapp",
                            "id": "j7kr21l",
                            "parent_id": "t1_j7kgmd2",
                            "score": 6,
                            "created_utc": 1675781147.0,
                            "replies": []
                        },
                        {
                            "body": "I’ve personally used a similar strategy and it has paid off.",
                            "author": "Polithrowaway12",
                            "id": "j7ml7k2",
                            "parent_id": "t1_j7kgmd2",
                            "score": 2,
                            "created_utc": 1675807034.0,
                            "replies": []
                        },
                        {
                            "body": "The 4 A’s! Love this",
                            "author": "Logical-Equipment-23",
                            "id": "j7ki3cl",
                            "parent_id": "t1_j7kgmd2",
                            "score": 2,
                            "created_utc": 1675776965.0,
                            "replies": []
                        },
                        {
                            "body": "This is good screening criteria.",
                            "author": "mysticalheavensawait",
                            "id": "j7ky9m0",
                            "parent_id": "t1_j7kgmd2",
                            "score": 1,
                            "created_utc": 1675784198.0,
                            "replies": []
                        },
                        {
                            "body": "Also, women 25+ are generally better in bed. At least in my experience",
                            "author": "FreeTheMarket",
                            "id": "j7rinve",
                            "parent_id": "t1_j7kgmd2",
                            "score": 1,
                            "created_utc": 1675893987.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "> 36 months. 55 meet and greets. 100's of emails and dms all time wasters. I finally find a good match.\n\nYou’ll have better success finding a regular girl out and about who values your success. If you are a wealthy successful and single man, a lot of attractive girls who are not on SA want you.",
            "author": "geekxp",
            "id": "j7kdyrk",
            "parent_id": "t1_j7k8lgk",
            "score": 5,
            "created_utc": 1675774732.0,
            "replies": [
                {
                    "body": "> a lot of attractive girls who are not on SA want you.\n\nI have no idea where to even find them. I am sure you are right. I am very happy with my current SR. She is wonderful. I have not even tried to vanilla or hybrid date in well over 10 years. I do not even know how to vanilla date anymore...",
                    "author": "CenTexFunGuy",
                    "id": "j7kfhia",
                    "parent_id": "t1_j7kdyrk",
                    "score": 2,
                    "created_utc": 1675775585.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I haven't experienced racism on SA, but I have on Bumble. That was.... Fun.... I hope to see him irl someday so I can smell his fear everytime I open my mouth!",
            "author": "iismelldaisiesii",
            "id": "j7lv9ps",
            "parent_id": "t1_j7ko4jw",
            "score": 3,
            "created_utc": 1675797112.0,
            "replies": [
                {
                    "body": "Are you planning on biting his c\\*ck off or something?",
                    "author": "superbex98",
                    "id": "j7lwxnw",
                    "parent_id": "t1_j7lv9ps",
                    "score": 3,
                    "created_utc": 1675797762.0,
                    "replies": [
                        {
                            "body": "Never even crossed my mind, but now, I'm seriously considering it",
                            "author": "iismelldaisiesii",
                            "id": "j7mlo7y",
                            "parent_id": "t1_j7lwxnw",
                            "score": 1,
                            "created_utc": 1675807213.0,
                            "replies": []
                        },
                        {
                            "body": "Hey Bex x",
                            "author": "Anna_SB_London",
                            "id": "j7ms1tf",
                            "parent_id": "t1_j7lwxnw",
                            "score": 1,
                            "created_utc": 1675809792.0,
                            "replies": [
                                {
                                    "body": "Hello back to you!",
                                    "author": "superbex98",
                                    "id": "j7msxed",
                                    "parent_id": "t1_j7ms1tf",
                                    "score": 1,
                                    "created_utc": 1675810152.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Bingo. All of the laws prosecuting sex workers and their \"Johns\" drove them into other avenues. The wave of \"cam girls\" really started to swell in the last few years.",
            "author": "TigerSharkSLDF",
            "id": "j7lbqdc",
            "parent_id": "t1_j7kxmom",
            "score": 1,
            "created_utc": 1675789530.0,
            "replies": []
        },
        {
            "body": "Sure it would be great. However, there's no admin tool that could effectively filter scammers, creeps, fakes, and johns/escorts out.",
            "author": "EuropeanDaddyDom",
            "id": "j7lp3ap",
            "parent_id": "t1_j7l2dj2",
            "score": 1,
            "created_utc": 1675794697.0,
            "replies": [
                {
                    "body": "You would rely on user reports and have them submit evidence like screenshots etc",
                    "author": "sehns",
                    "id": "j7nk8q6",
                    "parent_id": "t1_j7lp3ap",
                    "score": 1,
                    "created_utc": 1675822113.0,
                    "replies": [
                        {
                            "body": "Yes, Seeking does this. You see how effective it is.",
                            "author": "EuropeanDaddyDom",
                            "id": "j7nrg33",
                            "parent_id": "t1_j7nk8q6",
                            "score": 1,
                            "created_utc": 1675825344.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Because most of sd recently complains that there are a lot of girls in SA who just want to sell content or just send their OF link. My point is after what I encountered during this week as a legit sb I’m thinking about leaving the platform and leaving it more to the girls who want to do online business.",
            "author": "ccii22",
            "id": "j7mgol5",
            "parent_id": "t1_j7lmthw",
            "score": 2,
            "created_utc": 1675805295.0,
            "replies": [
                {
                    "body": "There \\*are\\* indeed quite a few. I screen them partially in my profile, by stating I have no interest in online only relationships, including those that only sell content. But, many do not read, so instead what I do is just report them as soon as they are clear that that is all that they are doing. Maybe Seeking bans them, maybe not. As before, though, I am sorry you had to deal with the series of idiots, I cannot speak for other SD's on Seeking, only for myself, that I would never do any of those behaviors. I am though a legit one, who has had several very wonderful arrangements from there over the years, so I tend to respect the forum(even were I to act like that by nature, which thankfully I do not).",
                    "author": "SDInLeather",
                    "id": "j7mn8ns",
                    "parent_id": "t1_j7mgol5",
                    "score": 2,
                    "created_utc": 1675807846.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Had the thought of Seeking being a platform with men having certain level of wisdom and education.",
            "author": "ccii22",
            "id": "j7kgbgk",
            "parent_id": "t1_j7kdz0g",
            "score": 3,
            "created_utc": 1675776035.0,
            "replies": [
                {
                    "body": "No, just a platform with men having enough money to pay for the $100+/month premium membership. A subset of those men will have a certain level of widsom and education.",
                    "author": "BinghamtonSD",
                    "id": "j7kp671",
                    "parent_id": "t1_j7kgbgk",
                    "score": 5,
                    "created_utc": 1675780313.0,
                    "replies": [
                        {
                            "body": "I see you may have posted a number which is most likely an amount in relations to an arrangement. If this is the case, you are violating Rule #4 - \"No dollar amounts that are in reference to allowance/PPM are allowed.\"\n\nIf you are curious about Allowances reported by SLF contributors please see the [Allowance Master Thread 2021-2022](/r/sugarlifestyleforum/comments/pc22tk/allowance_master_thread_20212022/).\n\nYour post will not be approved until you remove the amount.  Please read the sub [Rules](/r/sugarlifestyleforum/comments/748zta/updated_and_clarified_rules_for_slf/) prior to posting anything else. \n\nIf you simply posted a number not referencing a monetary amount, please message the MODs to approve your post.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/sugarlifestyleforum) if you have any questions or concerns.*",
                            "author": "AutoModerator",
                            "id": "j7kp688",
                            "parent_id": "t1_j7kp671",
                            "score": -1,
                            "created_utc": 1675780313.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "racism isn't caused by a lack of wisdom or education. it's more a lack of empathy",
                    "author": "davitech73",
                    "id": "j7lpj8j",
                    "parent_id": "t1_j7kgbgk",
                    "score": 1,
                    "created_utc": 1675794868.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "what do you feel are the better alternative places lately?",
            "author": "JonCoffey1978",
            "id": "j7o8xvx",
            "parent_id": "t1_j7kmyqj",
            "score": 1,
            "created_utc": 1675834259.0,
            "replies": [
                {
                    "body": "What’s your price is decent. At least you can offer money there without getting banned.",
                    "author": "UnearthlyDinosaur",
                    "id": "j7o9uyb",
                    "parent_id": "t1_j7o8xvx",
                    "score": 3,
                    "created_utc": 1675834809.0,
                    "replies": [
                        {
                            "body": "WYP belongs to SA.  Just saying.",
                            "author": "ingallsd",
                            "id": "j7put6b",
                            "parent_id": "t1_j7o9uyb",
                            "score": 2,
                            "created_utc": 1675871279.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "The opposite is also true....  I just started an SA about 5 weeks ago.... \n\nWent on 8 M&Gs....\n\n2 were no-shows\n\n1 was on her phone the entire time\n\n3 were escorts\n\n1 had expectations of $xxxx/week for Platonic",
            "author": "Veioviz",
            "id": "j7lf0g6",
            "parent_id": "t1_j7kn3bp",
            "score": 8,
            "created_utc": 1675790793.0,
            "replies": [
                {
                    "body": "That is brutal and I do admit the quality of women has gone down along with the quality of men. Hang in there.",
                    "author": "mysticalheavensawait",
                    "id": "j7lfd4s",
                    "parent_id": "t1_j7lf0g6",
                    "score": 3,
                    "created_utc": 1675790929.0,
                    "replies": []
                },
                {
                    "body": "They are probably all unattractive. Seeking is a dumpster fire",
                    "author": "UnearthlyDinosaur",
                    "id": "j7lr688",
                    "parent_id": "t1_j7lf0g6",
                    "score": -1,
                    "created_utc": 1675795506.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Not necessarily, the person I'm perceived to be makes it very difficult for men to approach me irl unless they are shameless and very drunk OR I'm absolutely barefaced and dressed like a bum. When in reality, I'm just socially awkward and might need a friend or two around to give me the confidence to introduce myself to people sometimes.",
            "author": "iismelldaisiesii",
            "id": "j7luxi9",
            "parent_id": "t1_j7livj4",
            "score": 5,
            "created_utc": 1675796978.0,
            "replies": []
        },
        {
            "body": "Touché",
            "author": "Neither-Ad-2833",
            "id": "j7lx5j8",
            "parent_id": "t1_j7livj4",
            "score": 2,
            "created_utc": 1675797847.0,
            "replies": []
        },
        {
            "body": "No real reason to be on a vanilla dating site <\\3",
            "author": "Maleficent_SB",
            "id": "j7mp599",
            "parent_id": "t1_j7kyo7t",
            "score": 3,
            "created_utc": 1675808613.0,
            "replies": []
        },
        {
            "body": "Honestly, just on here or snap. Not really trying",
            "author": "AggressiveKet",
            "id": "j7q8h7b",
            "parent_id": "t1_j7pw3yl",
            "score": 1,
            "created_utc": 1675876609.0,
            "replies": [
                {
                    "body": "I guess I am too ignorant about snap to know how to look there for SBs.",
                    "author": "ingallsd",
                    "id": "j7qgzi5",
                    "parent_id": "t1_j7q8h7b",
                    "score": 0,
                    "created_utc": 1675879849.0,
                    "replies": [
                        {
                            "body": "I have a full time job now n starting school so again; not really looking.",
                            "author": "AggressiveKet",
                            "id": "j7qi8xt",
                            "parent_id": "t1_j7qgzi5",
                            "score": 1,
                            "created_utc": 1675880339.0,
                            "replies": []
                        },
                        {
                            "body": "I get lots of scammer sd and sm trying to offer arrangement in snap. My general impression is that they are all scammers.",
                            "author": "Rivergirl2878",
                            "id": "jahwunr",
                            "parent_id": "t1_j7qgzi5",
                            "score": 1,
                            "created_utc": 1677685584.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Ikr?  It's almost as ridiculous as the SBs who only want an \"online relationship\"😂😂 like, some of them really think it's OF and SDs will pay them for online interactions and videos lool.",
            "author": "byrdiztrulythewyrd",
            "id": "j88npi4",
            "parent_id": "t1_j7npnn9",
            "score": 1,
            "created_utc": 1676210463.0,
            "replies": [
                {
                    "body": "Yeah there is a place for that and I’d say it’s in cam rooms not sugar daddy sites lmao",
                    "author": "Worldly_Quarter6785",
                    "id": "j88q27m",
                    "parent_id": "t1_j88npi4",
                    "score": 1,
                    "created_utc": 1676211667.0,
                    "replies": []
                }
            ]
        },
        {
            "body": ">What was the change to your approach?\n\nI quit trying to date anyone under 25. Just not my cup of tea. Could not find anyone close to what I wanted. So I moved it up to 25+. That is when I started to get better results. I quit dating SBs that had 'no job' or no other 'steady income streams' (mummy and daddy do not count).\n\nSo no more 'students' or anyone who did not have a full time job. Homeowners too. If renting I passed. I find women who own their own home are more reliable. More genuine and more what I like. ( I am not bashing a renter. Just my preference and experiences)\n\nI wanted to be an 'extra bonus' in their life. Not the one 'paying the bills'.\n\nAnd finally, I am sticking to the 4-A's. Attractive (to me), Attentive, Appreciative, and the biggest of them all. Affectionate!!!!! No more will ever date anyone who is not affectionate. I am very affectionate and hands on. I love to touch and caress my partner. I am not gropy or gross about it. Just my thing.\n\nEdit: I will also add Single Moms. They are much more reliable and know what they want. Most are less likely to be flakey. And they are on my schedule of 'early to bed and early to rise' with kids.  Sure, there will be dates where they have to cancel last minute or only have 4 hours on X or Y days. But so far it seems worth it.",
            "author": "CenTexFunGuy",
            "id": "j7kgmd2",
            "parent_id": "t1_j7k8rxd",
            "score": 11,
            "created_utc": 1675776196.0,
            "replies": [
                {
                    "body": "I live close to a college town so a lot of my sb's over the years have been students 19-22.\n\nI have been seeing them flake a lot more on me in the past year and they are overall just not that reliable.\n\nI switched my age range to 25 -30 and am having much better results and the girls are just as hot.\n\n\\-----------------------------\n\n\"Single Moms. They are much more reliable and know what they want. Most are less likely to be flakey.\"\n\nGood observation I never thought of it that way.",
                    "author": "LuckyINTJ",
                    "id": "j7kw8rw",
                    "parent_id": "t1_j7kgmd2",
                    "score": 7,
                    "created_utc": 1675783365.0,
                    "replies": [
                        {
                            "body": ">I live close to a college town so a lot of my sb's over the years have been students 19-22.\n\nI live in a College town. Like 10 min away. I tried to date 'local'. All 3 rinsed me and were flakes. Getting too drunk the day before a date. Always wanting to 'party'. I am too old to 'party' like they do.",
                            "author": "CenTexFunGuy",
                            "id": "j7kxki1",
                            "parent_id": "t1_j7kw8rw",
                            "score": 1,
                            "created_utc": 1675783911.0,
                            "replies": []
                        },
                        {
                            "body": ">Good observation I never thought of it that way.\n\nFor them it is an 'escape' from the daily grind. My SB told me she looks forward to seeing me so she can recharge and relax.",
                            "author": "CenTexFunGuy",
                            "id": "j7kxeb8",
                            "parent_id": "t1_j7kw8rw",
                            "score": 0,
                            "created_utc": 1675783838.0,
                            "replies": [
                                {
                                    "body": "Hellllll yes. I get the four A's and don't have to feel guilty for taking \"me\" time because the money goes to the kids' investment accounts. (Okay, sometimes goes to keeping a roof over their heads, but that is neither the plan nor the path I'm on, just some bumps in the road.) \n\nAnd I can get all the feelings for my guy without worrying about him intruding on my children's lives; no marriage proposals, no fantasizing about making babies, etc.",
                                    "author": "Insatiable_Learner",
                                    "id": "j7lsbiu",
                                    "parent_id": "t1_j7kxeb8",
                                    "score": 2,
                                    "created_utc": 1675795953.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "I used to think I wanted a 21 year old hottie. But it turns out I don’t really have that much in common with 21 year olds. No matter how hot they are. And they a lot less reliable and more flakey. Besides there are plenty of 30ish folks who are still plenty hot but have so much more to offer from an emotional maturity perspective.",
                    "author": "itsa_trapp",
                    "id": "j7kr21l",
                    "parent_id": "t1_j7kgmd2",
                    "score": 6,
                    "created_utc": 1675781147.0,
                    "replies": []
                },
                {
                    "body": "I’ve personally used a similar strategy and it has paid off.",
                    "author": "Polithrowaway12",
                    "id": "j7ml7k2",
                    "parent_id": "t1_j7kgmd2",
                    "score": 2,
                    "created_utc": 1675807034.0,
                    "replies": []
                },
                {
                    "body": "The 4 A’s! Love this",
                    "author": "Logical-Equipment-23",
                    "id": "j7ki3cl",
                    "parent_id": "t1_j7kgmd2",
                    "score": 2,
                    "created_utc": 1675776965.0,
                    "replies": []
                },
                {
                    "body": "This is good screening criteria.",
                    "author": "mysticalheavensawait",
                    "id": "j7ky9m0",
                    "parent_id": "t1_j7kgmd2",
                    "score": 1,
                    "created_utc": 1675784198.0,
                    "replies": []
                },
                {
                    "body": "Also, women 25+ are generally better in bed. At least in my experience",
                    "author": "FreeTheMarket",
                    "id": "j7rinve",
                    "parent_id": "t1_j7kgmd2",
                    "score": 1,
                    "created_utc": 1675893987.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "> a lot of attractive girls who are not on SA want you.\n\nI have no idea where to even find them. I am sure you are right. I am very happy with my current SR. She is wonderful. I have not even tried to vanilla or hybrid date in well over 10 years. I do not even know how to vanilla date anymore...",
            "author": "CenTexFunGuy",
            "id": "j7kfhia",
            "parent_id": "t1_j7kdyrk",
            "score": 2,
            "created_utc": 1675775585.0,
            "replies": []
        },
        {
            "body": "Are you planning on biting his c\\*ck off or something?",
            "author": "superbex98",
            "id": "j7lwxnw",
            "parent_id": "t1_j7lv9ps",
            "score": 3,
            "created_utc": 1675797762.0,
            "replies": [
                {
                    "body": "Never even crossed my mind, but now, I'm seriously considering it",
                    "author": "iismelldaisiesii",
                    "id": "j7mlo7y",
                    "parent_id": "t1_j7lwxnw",
                    "score": 1,
                    "created_utc": 1675807213.0,
                    "replies": []
                },
                {
                    "body": "Hey Bex x",
                    "author": "Anna_SB_London",
                    "id": "j7ms1tf",
                    "parent_id": "t1_j7lwxnw",
                    "score": 1,
                    "created_utc": 1675809792.0,
                    "replies": [
                        {
                            "body": "Hello back to you!",
                            "author": "superbex98",
                            "id": "j7msxed",
                            "parent_id": "t1_j7ms1tf",
                            "score": 1,
                            "created_utc": 1675810152.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "You would rely on user reports and have them submit evidence like screenshots etc",
            "author": "sehns",
            "id": "j7nk8q6",
            "parent_id": "t1_j7lp3ap",
            "score": 1,
            "created_utc": 1675822113.0,
            "replies": [
                {
                    "body": "Yes, Seeking does this. You see how effective it is.",
                    "author": "EuropeanDaddyDom",
                    "id": "j7nrg33",
                    "parent_id": "t1_j7nk8q6",
                    "score": 1,
                    "created_utc": 1675825344.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "There \\*are\\* indeed quite a few. I screen them partially in my profile, by stating I have no interest in online only relationships, including those that only sell content. But, many do not read, so instead what I do is just report them as soon as they are clear that that is all that they are doing. Maybe Seeking bans them, maybe not. As before, though, I am sorry you had to deal with the series of idiots, I cannot speak for other SD's on Seeking, only for myself, that I would never do any of those behaviors. I am though a legit one, who has had several very wonderful arrangements from there over the years, so I tend to respect the forum(even were I to act like that by nature, which thankfully I do not).",
            "author": "SDInLeather",
            "id": "j7mn8ns",
            "parent_id": "t1_j7mgol5",
            "score": 2,
            "created_utc": 1675807846.0,
            "replies": []
        },
        {
            "body": "No, just a platform with men having enough money to pay for the $100+/month premium membership. A subset of those men will have a certain level of widsom and education.",
            "author": "BinghamtonSD",
            "id": "j7kp671",
            "parent_id": "t1_j7kgbgk",
            "score": 5,
            "created_utc": 1675780313.0,
            "replies": [
                {
                    "body": "I see you may have posted a number which is most likely an amount in relations to an arrangement. If this is the case, you are violating Rule #4 - \"No dollar amounts that are in reference to allowance/PPM are allowed.\"\n\nIf you are curious about Allowances reported by SLF contributors please see the [Allowance Master Thread 2021-2022](/r/sugarlifestyleforum/comments/pc22tk/allowance_master_thread_20212022/).\n\nYour post will not be approved until you remove the amount.  Please read the sub [Rules](/r/sugarlifestyleforum/comments/748zta/updated_and_clarified_rules_for_slf/) prior to posting anything else. \n\nIf you simply posted a number not referencing a monetary amount, please message the MODs to approve your post.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/sugarlifestyleforum) if you have any questions or concerns.*",
                    "author": "AutoModerator",
                    "id": "j7kp688",
                    "parent_id": "t1_j7kp671",
                    "score": -1,
                    "created_utc": 1675780313.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "racism isn't caused by a lack of wisdom or education. it's more a lack of empathy",
            "author": "davitech73",
            "id": "j7lpj8j",
            "parent_id": "t1_j7kgbgk",
            "score": 1,
            "created_utc": 1675794868.0,
            "replies": []
        },
        {
            "body": "What’s your price is decent. At least you can offer money there without getting banned.",
            "author": "UnearthlyDinosaur",
            "id": "j7o9uyb",
            "parent_id": "t1_j7o8xvx",
            "score": 3,
            "created_utc": 1675834809.0,
            "replies": [
                {
                    "body": "WYP belongs to SA.  Just saying.",
                    "author": "ingallsd",
                    "id": "j7put6b",
                    "parent_id": "t1_j7o9uyb",
                    "score": 2,
                    "created_utc": 1675871279.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "That is brutal and I do admit the quality of women has gone down along with the quality of men. Hang in there.",
            "author": "mysticalheavensawait",
            "id": "j7lfd4s",
            "parent_id": "t1_j7lf0g6",
            "score": 3,
            "created_utc": 1675790929.0,
            "replies": []
        },
        {
            "body": "They are probably all unattractive. Seeking is a dumpster fire",
            "author": "UnearthlyDinosaur",
            "id": "j7lr688",
            "parent_id": "t1_j7lf0g6",
            "score": -1,
            "created_utc": 1675795506.0,
            "replies": []
        },
        {
            "body": "I guess I am too ignorant about snap to know how to look there for SBs.",
            "author": "ingallsd",
            "id": "j7qgzi5",
            "parent_id": "t1_j7q8h7b",
            "score": 0,
            "created_utc": 1675879849.0,
            "replies": [
                {
                    "body": "I have a full time job now n starting school so again; not really looking.",
                    "author": "AggressiveKet",
                    "id": "j7qi8xt",
                    "parent_id": "t1_j7qgzi5",
                    "score": 1,
                    "created_utc": 1675880339.0,
                    "replies": []
                },
                {
                    "body": "I get lots of scammer sd and sm trying to offer arrangement in snap. My general impression is that they are all scammers.",
                    "author": "Rivergirl2878",
                    "id": "jahwunr",
                    "parent_id": "t1_j7qgzi5",
                    "score": 1,
                    "created_utc": 1677685584.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yeah there is a place for that and I’d say it’s in cam rooms not sugar daddy sites lmao",
            "author": "Worldly_Quarter6785",
            "id": "j88q27m",
            "parent_id": "t1_j88npi4",
            "score": 1,
            "created_utc": 1676211667.0,
            "replies": []
        },
        {
            "body": "I live close to a college town so a lot of my sb's over the years have been students 19-22.\n\nI have been seeing them flake a lot more on me in the past year and they are overall just not that reliable.\n\nI switched my age range to 25 -30 and am having much better results and the girls are just as hot.\n\n\\-----------------------------\n\n\"Single Moms. They are much more reliable and know what they want. Most are less likely to be flakey.\"\n\nGood observation I never thought of it that way.",
            "author": "LuckyINTJ",
            "id": "j7kw8rw",
            "parent_id": "t1_j7kgmd2",
            "score": 7,
            "created_utc": 1675783365.0,
            "replies": [
                {
                    "body": ">I live close to a college town so a lot of my sb's over the years have been students 19-22.\n\nI live in a College town. Like 10 min away. I tried to date 'local'. All 3 rinsed me and were flakes. Getting too drunk the day before a date. Always wanting to 'party'. I am too old to 'party' like they do.",
                    "author": "CenTexFunGuy",
                    "id": "j7kxki1",
                    "parent_id": "t1_j7kw8rw",
                    "score": 1,
                    "created_utc": 1675783911.0,
                    "replies": []
                },
                {
                    "body": ">Good observation I never thought of it that way.\n\nFor them it is an 'escape' from the daily grind. My SB told me she looks forward to seeing me so she can recharge and relax.",
                    "author": "CenTexFunGuy",
                    "id": "j7kxeb8",
                    "parent_id": "t1_j7kw8rw",
                    "score": 0,
                    "created_utc": 1675783838.0,
                    "replies": [
                        {
                            "body": "Hellllll yes. I get the four A's and don't have to feel guilty for taking \"me\" time because the money goes to the kids' investment accounts. (Okay, sometimes goes to keeping a roof over their heads, but that is neither the plan nor the path I'm on, just some bumps in the road.) \n\nAnd I can get all the feelings for my guy without worrying about him intruding on my children's lives; no marriage proposals, no fantasizing about making babies, etc.",
                            "author": "Insatiable_Learner",
                            "id": "j7lsbiu",
                            "parent_id": "t1_j7kxeb8",
                            "score": 2,
                            "created_utc": 1675795953.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I used to think I wanted a 21 year old hottie. But it turns out I don’t really have that much in common with 21 year olds. No matter how hot they are. And they a lot less reliable and more flakey. Besides there are plenty of 30ish folks who are still plenty hot but have so much more to offer from an emotional maturity perspective.",
            "author": "itsa_trapp",
            "id": "j7kr21l",
            "parent_id": "t1_j7kgmd2",
            "score": 6,
            "created_utc": 1675781147.0,
            "replies": []
        },
        {
            "body": "I’ve personally used a similar strategy and it has paid off.",
            "author": "Polithrowaway12",
            "id": "j7ml7k2",
            "parent_id": "t1_j7kgmd2",
            "score": 2,
            "created_utc": 1675807034.0,
            "replies": []
        },
        {
            "body": "The 4 A’s! Love this",
            "author": "Logical-Equipment-23",
            "id": "j7ki3cl",
            "parent_id": "t1_j7kgmd2",
            "score": 2,
            "created_utc": 1675776965.0,
            "replies": []
        },
        {
            "body": "This is good screening criteria.",
            "author": "mysticalheavensawait",
            "id": "j7ky9m0",
            "parent_id": "t1_j7kgmd2",
            "score": 1,
            "created_utc": 1675784198.0,
            "replies": []
        },
        {
            "body": "Also, women 25+ are generally better in bed. At least in my experience",
            "author": "FreeTheMarket",
            "id": "j7rinve",
            "parent_id": "t1_j7kgmd2",
            "score": 1,
            "created_utc": 1675893987.0,
            "replies": []
        },
        {
            "body": "Never even crossed my mind, but now, I'm seriously considering it",
            "author": "iismelldaisiesii",
            "id": "j7mlo7y",
            "parent_id": "t1_j7lwxnw",
            "score": 1,
            "created_utc": 1675807213.0,
            "replies": []
        },
        {
            "body": "Hey Bex x",
            "author": "Anna_SB_London",
            "id": "j7ms1tf",
            "parent_id": "t1_j7lwxnw",
            "score": 1,
            "created_utc": 1675809792.0,
            "replies": [
                {
                    "body": "Hello back to you!",
                    "author": "superbex98",
                    "id": "j7msxed",
                    "parent_id": "t1_j7ms1tf",
                    "score": 1,
                    "created_utc": 1675810152.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yes, Seeking does this. You see how effective it is.",
            "author": "EuropeanDaddyDom",
            "id": "j7nrg33",
            "parent_id": "t1_j7nk8q6",
            "score": 1,
            "created_utc": 1675825344.0,
            "replies": []
        },
        {
            "body": "I see you may have posted a number which is most likely an amount in relations to an arrangement. If this is the case, you are violating Rule #4 - \"No dollar amounts that are in reference to allowance/PPM are allowed.\"\n\nIf you are curious about Allowances reported by SLF contributors please see the [Allowance Master Thread 2021-2022](/r/sugarlifestyleforum/comments/pc22tk/allowance_master_thread_20212022/).\n\nYour post will not be approved until you remove the amount.  Please read the sub [Rules](/r/sugarlifestyleforum/comments/748zta/updated_and_clarified_rules_for_slf/) prior to posting anything else. \n\nIf you simply posted a number not referencing a monetary amount, please message the MODs to approve your post.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/sugarlifestyleforum) if you have any questions or concerns.*",
            "author": "AutoModerator",
            "id": "j7kp688",
            "parent_id": "t1_j7kp671",
            "score": -1,
            "created_utc": 1675780313.0,
            "replies": []
        },
        {
            "body": "WYP belongs to SA.  Just saying.",
            "author": "ingallsd",
            "id": "j7put6b",
            "parent_id": "t1_j7o9uyb",
            "score": 2,
            "created_utc": 1675871279.0,
            "replies": []
        },
        {
            "body": "I have a full time job now n starting school so again; not really looking.",
            "author": "AggressiveKet",
            "id": "j7qi8xt",
            "parent_id": "t1_j7qgzi5",
            "score": 1,
            "created_utc": 1675880339.0,
            "replies": []
        },
        {
            "body": "I get lots of scammer sd and sm trying to offer arrangement in snap. My general impression is that they are all scammers.",
            "author": "Rivergirl2878",
            "id": "jahwunr",
            "parent_id": "t1_j7qgzi5",
            "score": 1,
            "created_utc": 1677685584.0,
            "replies": []
        },
        {
            "body": ">I live close to a college town so a lot of my sb's over the years have been students 19-22.\n\nI live in a College town. Like 10 min away. I tried to date 'local'. All 3 rinsed me and were flakes. Getting too drunk the day before a date. Always wanting to 'party'. I am too old to 'party' like they do.",
            "author": "CenTexFunGuy",
            "id": "j7kxki1",
            "parent_id": "t1_j7kw8rw",
            "score": 1,
            "created_utc": 1675783911.0,
            "replies": []
        },
        {
            "body": ">Good observation I never thought of it that way.\n\nFor them it is an 'escape' from the daily grind. My SB told me she looks forward to seeing me so she can recharge and relax.",
            "author": "CenTexFunGuy",
            "id": "j7kxeb8",
            "parent_id": "t1_j7kw8rw",
            "score": 0,
            "created_utc": 1675783838.0,
            "replies": [
                {
                    "body": "Hellllll yes. I get the four A's and don't have to feel guilty for taking \"me\" time because the money goes to the kids' investment accounts. (Okay, sometimes goes to keeping a roof over their heads, but that is neither the plan nor the path I'm on, just some bumps in the road.) \n\nAnd I can get all the feelings for my guy without worrying about him intruding on my children's lives; no marriage proposals, no fantasizing about making babies, etc.",
                    "author": "Insatiable_Learner",
                    "id": "j7lsbiu",
                    "parent_id": "t1_j7kxeb8",
                    "score": 2,
                    "created_utc": 1675795953.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Hello back to you!",
            "author": "superbex98",
            "id": "j7msxed",
            "parent_id": "t1_j7ms1tf",
            "score": 1,
            "created_utc": 1675810152.0,
            "replies": []
        },
        {
            "body": "Hellllll yes. I get the four A's and don't have to feel guilty for taking \"me\" time because the money goes to the kids' investment accounts. (Okay, sometimes goes to keeping a roof over their heads, but that is neither the plan nor the path I'm on, just some bumps in the road.) \n\nAnd I can get all the feelings for my guy without worrying about him intruding on my children's lives; no marriage proposals, no fantasizing about making babies, etc.",
            "author": "Insatiable_Learner",
            "id": "j7lsbiu",
            "parent_id": "t1_j7kxeb8",
            "score": 2,
            "created_utc": 1675795953.0,
            "replies": []
        }
    ]
}