{
    "title": "I was stranded with no way home.",
    "post_id": "aejqot",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/aejqot/i_was_stranded_with_no_way_home/",
    "author": "justunjust",
    "body": "I understand in the sugar bowl there is give and take. I also understand when something is given what the sexual expectation. But i just had a daddy do a 180 on me last night.\n\nWe started the day drinking. I suggested i invite my friend to hang with us and hopefully it would turn into some fun. Before she got there I tried to get kinky with my daddy just in case she wouldn’t be down. He denied almost certain she’d put out later.\n\nAs the night went on, we drank and had fun. But at one point during the night my friend hinted she was tired and wanted to go home. I kind of wanted to go home too. Since i was drunk she said she’d take my car to her house and i could sleep over.\n\nThe SD flipped out saying he’d get her an Uber. But i also was no longer in the mood- that ship had sailed. \n\nMy car was at his house so we needed a ride to get it, but he just stormed out of the bar. And left.\n\nMy friend at this point was uncomfortable got her own Uber home.\n\nWhen i got to his house i told him that since she got a ride i wanted to just crash on his couch because i didn’t feel safe driving. \n \nAt first he agreed then 10 mins later woke me up demanding i sleep in his bed. I said no. He then said he’s calling another girl over and i had to leave.\n\nI was still fairly drunk and said I’d prefer if i could just sleep for an hour. He can do whatever he wants. He then threatened to call the cops if i don’t leave.\n\nObviously i wasn’t going to play any games, so i got up and went to my car. He then confessed he never had or intended on calling the police.\n\nThankfully i made it home safe, i just need to vent.",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/aejqot/i_was_stranded_with_no_way_home/",
    "score": 105,
    "upvote_ratio": 0.89,
    "created_utc": 1547131876.0,
    "num_comments": 48,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "Sounds like it’s time to move on. Relationship needs to be based around respect and clearly there’s none going in your direction so time to find someone better.  ",
            "author": null,
            "id": "edpqc25",
            "parent_id": "t3_aejqot",
            "score": 121,
            "created_utc": 1547132168.0,
            "replies": [
                {
                    "body": "That’s for sure. I just wish i knew how to report him to other girls in my area.",
                    "author": "justunjust",
                    "id": "edpqe98",
                    "parent_id": "t1_edpqc25",
                    "score": 37,
                    "created_utc": 1547132316.0,
                    "replies": [
                        {
                            "body": "I do not know how. He did not do anything wrong on seeking, and really nothing were the cops can get involved.\n\nSo really move on and hope that other ladies are as wise as you.\n\nJust a side note. Not drinking as much will help you keep your wits about you more. I really encourage SBs to not get intoxicated around SDs they do not know well. Not saying that the SD is a douche canoe, just being drunk can lower your wits.",
                            "author": "girlz_are_42",
                            "id": "edpr6pq",
                            "parent_id": "t1_edpqe98",
                            "score": 17,
                            "created_utc": 1547133306.0,
                            "replies": [
                                {
                                    "body": "I know, i have been seeing him for a while now. And i know he’s entitled and I’ve been planning on breaking things off but i needed to get some stuff from his house that i left. Thankfully i did all that before we started drinking",
                                    "author": "justunjust",
                                    "id": "edpri0a",
                                    "parent_id": "t1_edpr6pq",
                                    "score": 17,
                                    "created_utc": 1547133550.0,
                                    "replies": [
                                        {
                                            "body": "Glad it worked out for you ok. He is an ass, but you are safe.",
                                            "author": "girlz_are_42",
                                            "id": "edpt0rl",
                                            "parent_id": "t1_edpri0a",
                                            "score": 11,
                                            "created_utc": 1547134622.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "why would you invite a friend along hoping she too would fuck your soon to be ex SD ? Why not get your own Uber if he refused ? Why did you want your friend driving your vehicle if she too was drunk ? Did you drive inebriated ?  \n\nReport him for what ? Being an asshole ? \n\n",
                                            "author": "Kitoko30",
                                            "id": "edpyly3",
                                            "parent_id": "t1_edpri0a",
                                            "score": 21,
                                            "created_utc": 1547137944.0,
                                            "replies": [
                                                {
                                                    "body": "You need to calm down. ",
                                                    "author": "justunjust",
                                                    "id": "edpys5z",
                                                    "parent_id": "t1_edpyly3",
                                                    "score": -10,
                                                    "created_utc": 1547138041.0,
                                                    "replies": [
                                                        {
                                                            "body": "So you want to report him for your slew of poor choices ? That's apparently his fault ?\n\nYou knew and stated he was/is an asshole prior to. Now apparently it's an issue ?",
                                                            "author": "Kitoko30",
                                                            "id": "edq3a6m",
                                                            "parent_id": "t1_edpys5z",
                                                            "score": 15,
                                                            "created_utc": 1547140445.0,
                                                            "replies": [
                                                                {
                                                                    "body": "I kind of agree with this point. If the relationship was already rocky, why invite a friend and get intoxicated with someone who had already shown signs of being an asshole? \n\nOf course I don't blame OP for the actions of the SD. Unfortunately, the world operates in a way where you really need to be more careful. Getting hammered around someone who can abuse you one way or another (specially when he's shown signs of not being a respectable person), and inviting a friend over to interact with this risky person don't really seem like very good choices. \n\n I'm very glad you were able to get out of the situation and returned home safely, and I wish there was something that could be done to prevent other women to be at risk with him. Just try to be more careful next time.",
                                                                    "author": null,
                                                                    "id": "edqfkvy",
                                                                    "parent_id": "t1_edq3a6m",
                                                                    "score": 16,
                                                                    "created_utc": 1547146945.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "Take into account OP is on parole for DUI having already violated her parole atleast once. Continues to make bad choices including same behaviors and attempts to abdicate self of accountability without any self reflection. ",
                                                                            "author": "Kitoko30",
                                                                            "id": "edqi2r4",
                                                                            "parent_id": "t1_edqfkvy",
                                                                            "score": 14,
                                                                            "created_utc": 1547148213.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "I honestly thought your tone was way harsh at first but read her post history...10 days ago she fell for a scam aka had sex and assumed a guy would pay her in full online, then just 7 days ago talked about being overwhelmed with a controlling SD. Not to mention history of getting way too inebriated on alcohol when going out and resulting in at least a DUI (eta multiple arrests and drug abuse). \n\n\n/u/justunjust this is a wakeup call if there ever was one. Yes the bowl and life is harsh but I think you've been rolling with the punches and hoping for the best for way too long. You need to take a break from the bowl before you land yourself in an even worse situation, which I  honestly think is inevitable if you don't change your approach and start learning from your mistakes. \n\n\nAnd for the love of God please start taking ubers OR not drink *at all* when you bring your car with you. Rehab and doing community service doesn't mean much when you're still going out and getting drunk and sugaring haphazardly. You really can turn your life around but you need to look inward. ",
                                                                                    "author": "adequatelay",
                                                                                    "id": "edqo493",
                                                                                    "parent_id": "t1_edqi2r4",
                                                                                    "score": 19,
                                                                                    "created_utc": 1547151252.0,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "body": "I reiterate girlz's advice. Alcohol excess causes all kinds of problems and you should never go there with a SD. Besides, I do not like being in the company of a drunk SB. ",
                                            "author": "GSSD",
                                            "id": "edpt41b",
                                            "parent_id": "t1_edpri0a",
                                            "score": 6,
                                            "created_utc": 1547134683.0,
                                            "replies": [
                                                {
                                                    "body": "Yah mine has gotten tipsy once, fortunately she was super cute and went to bed. Getting blasted drunk is not usually sexy, and drunk people can be a bit annoying at times.",
                                                    "author": "girlz_are_42",
                                                    "id": "edpv043",
                                                    "parent_id": "t1_edpt41b",
                                                    "score": 6,
                                                    "created_utc": 1547135837.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Mr. number used to be great for that but mostly things have been cleared out from the company. You can find kik groups on “let’s talk sugar”. I have a couple local ones we all chat about the guys. Also instagram is surprisingly resourceful. One girl would just post a Screenshot of the guys profiles and would get comments from others telling their experience ",
                            "author": "throwaway-kittycat",
                            "id": "edq9ywv",
                            "parent_id": "t1_edpqe98",
                            "score": 2,
                            "created_utc": 1547143930.0,
                            "replies": []
                        },
                        {
                            "body": "Report him for what exactly? ",
                            "author": null,
                            "id": "edqgf1a",
                            "parent_id": "t1_edpqe98",
                            "score": 1,
                            "created_utc": 1547147373.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "> I suggested i invite my friend to hang with us and hopefully it would turn into some fun. Before she got there I tried to get kinky with my daddy just in case she wouldn’t be down.\n\nDid you check with her to see if a threesome was on the table when you invited her over? Is this an arrangement you and her have had in the past?\n\nBecause it's usually safer for everybody involved to hash that out before everyone gets together. ",
            "author": "rivershimmer",
            "id": "edpxn4v",
            "parent_id": "t3_aejqot",
            "score": 21,
            "created_utc": 1547137370.0,
            "replies": [
                {
                    "body": "I thought that was a little bizarre as well. ",
                    "author": "Fierybuttz",
                    "id": "edr9lik",
                    "parent_id": "t1_edpxn4v",
                    "score": 10,
                    "created_utc": 1547162978.0,
                    "replies": []
                },
                {
                    "body": "Oh she knew what she was getting into. She’s on SA to. But she just met the guy and wasn’t feeling it. ",
                    "author": "justunjust",
                    "id": "edpxxbc",
                    "parent_id": "t1_edpxn4v",
                    "score": 16,
                    "created_utc": 1547137542.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "edps93q",
            "parent_id": "t3_aejqot",
            "score": 36,
            "created_utc": 1547134096.0,
            "replies": [
                {
                    "body": "> Alcohol and sugar don’t mix\n\nUnless it is [simple syrup](https://www.washingtonpost.com/lifestyle/food/have-simple-syrup-put-it-to-use-in-one-of-these-colorful-cocktails/2017/06/02/dfba1502-46d8-11e7-98cd-af64b4fe2dfc_story.html) ",
                    "author": "girlz_are_42",
                    "id": "edptfzq",
                    "parent_id": "t1_edps93q",
                    "score": 14,
                    "created_utc": 1547134904.0,
                    "replies": [
                        {
                            "body": "Unless your favorite drink is Fireball Whisky. ",
                            "author": "Sparkledork1",
                            "id": "edqiuom",
                            "parent_id": "t1_edptfzq",
                            "score": 4,
                            "created_utc": 1547148595.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Hahaha yeah I’m learning that. I hated that trapped feeling.",
                    "author": "justunjust",
                    "id": "edpsai8",
                    "parent_id": "t1_edps93q",
                    "score": 2,
                    "created_utc": 1547134124.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "He sounds like a major douche. End things now and move on.",
            "author": "BigBearSD",
            "id": "edpqz5o",
            "parent_id": "t3_aejqot",
            "score": 14,
            "created_utc": 1547133132.0,
            "replies": []
        },
        {
            "body": "Never see that man again hun",
            "author": "keepitcoming21",
            "id": "edqeke3",
            "parent_id": "t3_aejqot",
            "score": 3,
            "created_utc": 1547146436.0,
            "replies": []
        },
        {
            "body": "The entire appeal of this lifestyle is there should be no drama and mutual respect. As soon as that goes away it’s time to move on. Sorry you had to put up with such an ass.",
            "author": "throwawaySD2B",
            "id": "edptl29",
            "parent_id": "t3_aejqot",
            "score": 9,
            "created_utc": 1547134995.0,
            "replies": [
                {
                    "body": "Oh his number is blocked. I’m glad i got all my shit",
                    "author": "justunjust",
                    "id": "edpu3c2",
                    "parent_id": "t1_edptl29",
                    "score": 9,
                    "created_utc": 1547135309.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "He's an asshole.",
            "author": null,
            "id": "edpqjtm",
            "parent_id": "t3_aejqot",
            "score": 7,
            "created_utc": 1547132679.0,
            "replies": []
        },
        {
            "body": "He's jackass. Take better care of yourself.",
            "author": "OlderSD",
            "id": "edps8cv",
            "parent_id": "t3_aejqot",
            "score": 7,
            "created_utc": 1547134082.0,
            "replies": []
        },
        {
            "body": "you have a crazy life and need to get a grip before you have a seriously bad outcome",
            "author": "doctorcoolpop",
            "id": "edq3tsu",
            "parent_id": "t3_aejqot",
            "score": 11,
            "created_utc": 1547140734.0,
            "replies": []
        },
        {
            "body": "There is definitely a lot wrong with this story. Glad you made it back safely but when engaging you need to have an exit plan and three backups just in case. It's being safe to make sure that not only was  your friend aware that you were there but someone else knew where you were and to come get you when you knew you couldn't make it back. Also, the friend leaving you alone, uncomfortable or not is nonsense. I don't care how I feel, I'm not leaving a friend alone in a sketchy situation. I believe it's time to replace them both and better luck next time. ",
            "author": "Oneinamil91",
            "id": "edquoaq",
            "parent_id": "t3_aejqot",
            "score": 5,
            "created_utc": 1547154681.0,
            "replies": []
        },
        {
            "body": "Sorry this happened to you. Thank God you got home safe. I personally don't get drunk around people unless I really knew them for a long time. But then again I barely get drunk. It's just been my rule. Two drinks max. Just take it as a lesson learned. He should of let you sleep it off. He's an asshole for that. ",
            "author": "liliflower85",
            "id": "edq5zkc",
            "parent_id": "t3_aejqot",
            "score": 5,
            "created_utc": 1547141865.0,
            "replies": []
        },
        {
            "body": "You kind of played with fire here, and given what you knew about the SD, the outcome was predictable.\n\nOn what planet is a guy who is entitled and you want to break up with going to react sanely to a(n implicitly) promised three way falling through?",
            "author": "kgkf8d83",
            "id": "edqh11o",
            "parent_id": "t3_aejqot",
            "score": 5,
            "created_utc": 1547147687.0,
            "replies": []
        },
        {
            "body": "As a recovered alcoholic (45 months alcohol free)...  I think your day went south at, “We started the day drinking.”\n\nIf I were you, I would reverse the tape of that day back and then re-play it forward with none of the three of you having any alcohol to drink but in a fun mood regardless.  Would the outcome have been worse, the same or better? 🤔\n\nOn a separate note - is your SD the “choker” you talked about in another sub post?  If he is... he’s just hitting on all cylinders, isn’t he? >shudder<",
            "author": null,
            "id": "edrccpa",
            "parent_id": "t3_aejqot",
            "score": 5,
            "created_utc": 1547164894.0,
            "replies": [
                {
                    "body": "Seriously, this reads like some of the shit I got into before I finally quit drinking (and realized I was far too messy for the bowl so I stepped back) I hope shit gets old for OP before something else bad happens, because this could have gone so many different, worse ways, and this outcome was already shitty. That said, his behavior is not her fault and I'm sure glad she got away from him! Bad news, sounds like ",
                    "author": "hexensabbat",
                    "id": "edrfmkh",
                    "parent_id": "t1_edrccpa",
                    "score": 3,
                    "created_utc": 1547167304.0,
                    "replies": []
                },
                {
                    "body": "Are we really gonna try and do someone else’s inventory for them? Plenty of people can day drink and not have an issue. Some of us can’t, in my experience painting with a broad brush  is dicey",
                    "author": "theasswasfat100",
                    "id": "edrx22u",
                    "parent_id": "t1_edrccpa",
                    "score": 3,
                    "created_utc": 1547180618.0,
                    "replies": [
                        {
                            "body": "I agree.  I was just asking a hypothetical of how the day and evening would have played out with the three of them if alcohol had not been in the picture.  I tend to think it would have ended in the harmonious and mountain top like threesome experience they were aiming for.  Just saying.",
                            "author": null,
                            "id": "edry9zz",
                            "parent_id": "t1_edrx22u",
                            "score": 1,
                            "created_utc": 1547181618.0,
                            "replies": [
                                {
                                    "body": "Completely understood, maybe I was a little too strident in my response ",
                                    "author": "theasswasfat100",
                                    "id": "edrye5e",
                                    "parent_id": "t1_edry9zz",
                                    "score": 2,
                                    "created_utc": 1547181713.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Sorry this happened and sorry for all the victim-blaming comments. Wtf SLF??? You're allowed to drink and even get drunk if that's the relationship you have with your SD. ",
            "author": "furleylucke",
            "id": "edqt0uk",
            "parent_id": "t3_aejqot",
            "score": 3,
            "created_utc": 1547153812.0,
            "replies": [
                {
                    "body": "Thanks i honestly stopped reading. Like I’ve been seeing him over a month and we’ve gotten drunk before. But he was being clingy...",
                    "author": "justunjust",
                    "id": "edqt3na",
                    "parent_id": "t1_edqt0uk",
                    "score": 1,
                    "created_utc": 1547153854.0,
                    "replies": []
                },
                {
                    "body": "Victim blaming a drunk driver. What's wrong with you",
                    "author": null,
                    "id": "edsc243",
                    "parent_id": "t1_edqt0uk",
                    "score": 1,
                    "created_utc": 1547193567.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "edqxctd",
            "parent_id": "t3_aejqot",
            "score": 1,
            "created_utc": 1547156133.0,
            "replies": [
                {
                    "body": "We’ve been hanging out for a month. We had a friendship i thought. This wasn’t meet fuck and pay. It was hang out, have conversation and fuck. But i didn’t get paid per fuck.",
                    "author": "justunjust",
                    "id": "edqxgs8",
                    "parent_id": "t1_edqxctd",
                    "score": 0,
                    "created_utc": 1547156191.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "He's obviously looking for an on-demand escort, and figures SBs are cheaper over time with added bonuses and no nagging. Drop him like a bad habit, he's no good. ",
            "author": "Vivalyrian",
            "id": "edsfdf0",
            "parent_id": "t3_aejqot",
            "score": 1,
            "created_utc": 1547196943.0,
            "replies": []
        },
        {
            "body": "He sounds SALTY AF.  Where did you meet him? Delete and block his number, he has no respect for women.  ",
            "author": "newsbhere",
            "id": "edtrbbr",
            "parent_id": "t3_aejqot",
            "score": 1,
            "created_utc": 1547230847.0,
            "replies": []
        },
        {
            "body": "Scary\nWives can’t even trust their husbands of lots of years. I wouldn’t put my full trust in an sd. This one got a short fuse",
            "author": "plussizefairy",
            "id": "edv3t52",
            "parent_id": "t3_aejqot",
            "score": 1,
            "created_utc": 1547262696.0,
            "replies": []
        },
        {
            "body": "What a petulant a-hole. Glad you've moved on from him.",
            "author": "Cledaddy23",
            "id": "edqbc8l",
            "parent_id": "t3_aejqot",
            "score": 1,
            "created_utc": 1547144635.0,
            "replies": []
        },
        {
            "body": "Too bad you didn't have a sober friend who could have Ubered to you and your car, and drive you home (and then Uber home). \n\nGuy needs to go. Too cray. Too much drama. \n\nGood luck to you. ",
            "author": "Haffbad",
            "id": "edrbah9",
            "parent_id": "t3_aejqot",
            "score": 1,
            "created_utc": 1547164133.0,
            "replies": []
        },
        {
            "body": "Once again, don't drink on the first meet \n",
            "author": "anonymou555andWich",
            "id": "edprfgk",
            "parent_id": "t3_aejqot",
            "score": -5,
            "created_utc": 1547133497.0,
            "replies": [
                {
                    "body": "This wasn’t a first meet, I’ve known him for over a month",
                    "author": "justunjust",
                    "id": "edprj6w",
                    "parent_id": "t1_edprfgk",
                    "score": 10,
                    "created_utc": 1547133574.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "This ummm....man???  is a idiot. His actions where totally disrespectful to you as a person. \nGlad you cut ties. Don't go back to that shit show. ",
            "author": "inafishbowl17",
            "id": "edro471",
            "parent_id": "t3_aejqot",
            "score": 0,
            "created_utc": 1547173677.0,
            "replies": []
        },
        {
            "body": "That’s for sure. I just wish i knew how to report him to other girls in my area.",
            "author": "justunjust",
            "id": "edpqe98",
            "parent_id": "t1_edpqc25",
            "score": 37,
            "created_utc": 1547132316.0,
            "replies": [
                {
                    "body": "I do not know how. He did not do anything wrong on seeking, and really nothing were the cops can get involved.\n\nSo really move on and hope that other ladies are as wise as you.\n\nJust a side note. Not drinking as much will help you keep your wits about you more. I really encourage SBs to not get intoxicated around SDs they do not know well. Not saying that the SD is a douche canoe, just being drunk can lower your wits.",
                    "author": "girlz_are_42",
                    "id": "edpr6pq",
                    "parent_id": "t1_edpqe98",
                    "score": 17,
                    "created_utc": 1547133306.0,
                    "replies": [
                        {
                            "body": "I know, i have been seeing him for a while now. And i know he’s entitled and I’ve been planning on breaking things off but i needed to get some stuff from his house that i left. Thankfully i did all that before we started drinking",
                            "author": "justunjust",
                            "id": "edpri0a",
                            "parent_id": "t1_edpr6pq",
                            "score": 17,
                            "created_utc": 1547133550.0,
                            "replies": [
                                {
                                    "body": "Glad it worked out for you ok. He is an ass, but you are safe.",
                                    "author": "girlz_are_42",
                                    "id": "edpt0rl",
                                    "parent_id": "t1_edpri0a",
                                    "score": 11,
                                    "created_utc": 1547134622.0,
                                    "replies": []
                                },
                                {
                                    "body": "why would you invite a friend along hoping she too would fuck your soon to be ex SD ? Why not get your own Uber if he refused ? Why did you want your friend driving your vehicle if she too was drunk ? Did you drive inebriated ?  \n\nReport him for what ? Being an asshole ? \n\n",
                                    "author": "Kitoko30",
                                    "id": "edpyly3",
                                    "parent_id": "t1_edpri0a",
                                    "score": 21,
                                    "created_utc": 1547137944.0,
                                    "replies": [
                                        {
                                            "body": "You need to calm down. ",
                                            "author": "justunjust",
                                            "id": "edpys5z",
                                            "parent_id": "t1_edpyly3",
                                            "score": -10,
                                            "created_utc": 1547138041.0,
                                            "replies": [
                                                {
                                                    "body": "So you want to report him for your slew of poor choices ? That's apparently his fault ?\n\nYou knew and stated he was/is an asshole prior to. Now apparently it's an issue ?",
                                                    "author": "Kitoko30",
                                                    "id": "edq3a6m",
                                                    "parent_id": "t1_edpys5z",
                                                    "score": 15,
                                                    "created_utc": 1547140445.0,
                                                    "replies": [
                                                        {
                                                            "body": "I kind of agree with this point. If the relationship was already rocky, why invite a friend and get intoxicated with someone who had already shown signs of being an asshole? \n\nOf course I don't blame OP for the actions of the SD. Unfortunately, the world operates in a way where you really need to be more careful. Getting hammered around someone who can abuse you one way or another (specially when he's shown signs of not being a respectable person), and inviting a friend over to interact with this risky person don't really seem like very good choices. \n\n I'm very glad you were able to get out of the situation and returned home safely, and I wish there was something that could be done to prevent other women to be at risk with him. Just try to be more careful next time.",
                                                            "author": null,
                                                            "id": "edqfkvy",
                                                            "parent_id": "t1_edq3a6m",
                                                            "score": 16,
                                                            "created_utc": 1547146945.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Take into account OP is on parole for DUI having already violated her parole atleast once. Continues to make bad choices including same behaviors and attempts to abdicate self of accountability without any self reflection. ",
                                                                    "author": "Kitoko30",
                                                                    "id": "edqi2r4",
                                                                    "parent_id": "t1_edqfkvy",
                                                                    "score": 14,
                                                                    "created_utc": 1547148213.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "I honestly thought your tone was way harsh at first but read her post history...10 days ago she fell for a scam aka had sex and assumed a guy would pay her in full online, then just 7 days ago talked about being overwhelmed with a controlling SD. Not to mention history of getting way too inebriated on alcohol when going out and resulting in at least a DUI (eta multiple arrests and drug abuse). \n\n\n/u/justunjust this is a wakeup call if there ever was one. Yes the bowl and life is harsh but I think you've been rolling with the punches and hoping for the best for way too long. You need to take a break from the bowl before you land yourself in an even worse situation, which I  honestly think is inevitable if you don't change your approach and start learning from your mistakes. \n\n\nAnd for the love of God please start taking ubers OR not drink *at all* when you bring your car with you. Rehab and doing community service doesn't mean much when you're still going out and getting drunk and sugaring haphazardly. You really can turn your life around but you need to look inward. ",
                                                                            "author": "adequatelay",
                                                                            "id": "edqo493",
                                                                            "parent_id": "t1_edqi2r4",
                                                                            "score": 19,
                                                                            "created_utc": 1547151252.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "I reiterate girlz's advice. Alcohol excess causes all kinds of problems and you should never go there with a SD. Besides, I do not like being in the company of a drunk SB. ",
                                    "author": "GSSD",
                                    "id": "edpt41b",
                                    "parent_id": "t1_edpri0a",
                                    "score": 6,
                                    "created_utc": 1547134683.0,
                                    "replies": [
                                        {
                                            "body": "Yah mine has gotten tipsy once, fortunately she was super cute and went to bed. Getting blasted drunk is not usually sexy, and drunk people can be a bit annoying at times.",
                                            "author": "girlz_are_42",
                                            "id": "edpv043",
                                            "parent_id": "t1_edpt41b",
                                            "score": 6,
                                            "created_utc": 1547135837.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Mr. number used to be great for that but mostly things have been cleared out from the company. You can find kik groups on “let’s talk sugar”. I have a couple local ones we all chat about the guys. Also instagram is surprisingly resourceful. One girl would just post a Screenshot of the guys profiles and would get comments from others telling their experience ",
                    "author": "throwaway-kittycat",
                    "id": "edq9ywv",
                    "parent_id": "t1_edpqe98",
                    "score": 2,
                    "created_utc": 1547143930.0,
                    "replies": []
                },
                {
                    "body": "Report him for what exactly? ",
                    "author": null,
                    "id": "edqgf1a",
                    "parent_id": "t1_edpqe98",
                    "score": 1,
                    "created_utc": 1547147373.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I thought that was a little bizarre as well. ",
            "author": "Fierybuttz",
            "id": "edr9lik",
            "parent_id": "t1_edpxn4v",
            "score": 10,
            "created_utc": 1547162978.0,
            "replies": []
        },
        {
            "body": "Oh she knew what she was getting into. She’s on SA to. But she just met the guy and wasn’t feeling it. ",
            "author": "justunjust",
            "id": "edpxxbc",
            "parent_id": "t1_edpxn4v",
            "score": 16,
            "created_utc": 1547137542.0,
            "replies": []
        },
        {
            "body": "> Alcohol and sugar don’t mix\n\nUnless it is [simple syrup](https://www.washingtonpost.com/lifestyle/food/have-simple-syrup-put-it-to-use-in-one-of-these-colorful-cocktails/2017/06/02/dfba1502-46d8-11e7-98cd-af64b4fe2dfc_story.html) ",
            "author": "girlz_are_42",
            "id": "edptfzq",
            "parent_id": "t1_edps93q",
            "score": 14,
            "created_utc": 1547134904.0,
            "replies": [
                {
                    "body": "Unless your favorite drink is Fireball Whisky. ",
                    "author": "Sparkledork1",
                    "id": "edqiuom",
                    "parent_id": "t1_edptfzq",
                    "score": 4,
                    "created_utc": 1547148595.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Hahaha yeah I’m learning that. I hated that trapped feeling.",
            "author": "justunjust",
            "id": "edpsai8",
            "parent_id": "t1_edps93q",
            "score": 2,
            "created_utc": 1547134124.0,
            "replies": []
        },
        {
            "body": "Oh his number is blocked. I’m glad i got all my shit",
            "author": "justunjust",
            "id": "edpu3c2",
            "parent_id": "t1_edptl29",
            "score": 9,
            "created_utc": 1547135309.0,
            "replies": []
        },
        {
            "body": "Seriously, this reads like some of the shit I got into before I finally quit drinking (and realized I was far too messy for the bowl so I stepped back) I hope shit gets old for OP before something else bad happens, because this could have gone so many different, worse ways, and this outcome was already shitty. That said, his behavior is not her fault and I'm sure glad she got away from him! Bad news, sounds like ",
            "author": "hexensabbat",
            "id": "edrfmkh",
            "parent_id": "t1_edrccpa",
            "score": 3,
            "created_utc": 1547167304.0,
            "replies": []
        },
        {
            "body": "Are we really gonna try and do someone else’s inventory for them? Plenty of people can day drink and not have an issue. Some of us can’t, in my experience painting with a broad brush  is dicey",
            "author": "theasswasfat100",
            "id": "edrx22u",
            "parent_id": "t1_edrccpa",
            "score": 3,
            "created_utc": 1547180618.0,
            "replies": [
                {
                    "body": "I agree.  I was just asking a hypothetical of how the day and evening would have played out with the three of them if alcohol had not been in the picture.  I tend to think it would have ended in the harmonious and mountain top like threesome experience they were aiming for.  Just saying.",
                    "author": null,
                    "id": "edry9zz",
                    "parent_id": "t1_edrx22u",
                    "score": 1,
                    "created_utc": 1547181618.0,
                    "replies": [
                        {
                            "body": "Completely understood, maybe I was a little too strident in my response ",
                            "author": "theasswasfat100",
                            "id": "edrye5e",
                            "parent_id": "t1_edry9zz",
                            "score": 2,
                            "created_utc": 1547181713.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Thanks i honestly stopped reading. Like I’ve been seeing him over a month and we’ve gotten drunk before. But he was being clingy...",
            "author": "justunjust",
            "id": "edqt3na",
            "parent_id": "t1_edqt0uk",
            "score": 1,
            "created_utc": 1547153854.0,
            "replies": []
        },
        {
            "body": "Victim blaming a drunk driver. What's wrong with you",
            "author": null,
            "id": "edsc243",
            "parent_id": "t1_edqt0uk",
            "score": 1,
            "created_utc": 1547193567.0,
            "replies": []
        },
        {
            "body": "We’ve been hanging out for a month. We had a friendship i thought. This wasn’t meet fuck and pay. It was hang out, have conversation and fuck. But i didn’t get paid per fuck.",
            "author": "justunjust",
            "id": "edqxgs8",
            "parent_id": "t1_edqxctd",
            "score": 0,
            "created_utc": 1547156191.0,
            "replies": []
        },
        {
            "body": "This wasn’t a first meet, I’ve known him for over a month",
            "author": "justunjust",
            "id": "edprj6w",
            "parent_id": "t1_edprfgk",
            "score": 10,
            "created_utc": 1547133574.0,
            "replies": []
        },
        {
            "body": "I do not know how. He did not do anything wrong on seeking, and really nothing were the cops can get involved.\n\nSo really move on and hope that other ladies are as wise as you.\n\nJust a side note. Not drinking as much will help you keep your wits about you more. I really encourage SBs to not get intoxicated around SDs they do not know well. Not saying that the SD is a douche canoe, just being drunk can lower your wits.",
            "author": "girlz_are_42",
            "id": "edpr6pq",
            "parent_id": "t1_edpqe98",
            "score": 17,
            "created_utc": 1547133306.0,
            "replies": [
                {
                    "body": "I know, i have been seeing him for a while now. And i know he’s entitled and I’ve been planning on breaking things off but i needed to get some stuff from his house that i left. Thankfully i did all that before we started drinking",
                    "author": "justunjust",
                    "id": "edpri0a",
                    "parent_id": "t1_edpr6pq",
                    "score": 17,
                    "created_utc": 1547133550.0,
                    "replies": [
                        {
                            "body": "Glad it worked out for you ok. He is an ass, but you are safe.",
                            "author": "girlz_are_42",
                            "id": "edpt0rl",
                            "parent_id": "t1_edpri0a",
                            "score": 11,
                            "created_utc": 1547134622.0,
                            "replies": []
                        },
                        {
                            "body": "why would you invite a friend along hoping she too would fuck your soon to be ex SD ? Why not get your own Uber if he refused ? Why did you want your friend driving your vehicle if she too was drunk ? Did you drive inebriated ?  \n\nReport him for what ? Being an asshole ? \n\n",
                            "author": "Kitoko30",
                            "id": "edpyly3",
                            "parent_id": "t1_edpri0a",
                            "score": 21,
                            "created_utc": 1547137944.0,
                            "replies": [
                                {
                                    "body": "You need to calm down. ",
                                    "author": "justunjust",
                                    "id": "edpys5z",
                                    "parent_id": "t1_edpyly3",
                                    "score": -10,
                                    "created_utc": 1547138041.0,
                                    "replies": [
                                        {
                                            "body": "So you want to report him for your slew of poor choices ? That's apparently his fault ?\n\nYou knew and stated he was/is an asshole prior to. Now apparently it's an issue ?",
                                            "author": "Kitoko30",
                                            "id": "edq3a6m",
                                            "parent_id": "t1_edpys5z",
                                            "score": 15,
                                            "created_utc": 1547140445.0,
                                            "replies": [
                                                {
                                                    "body": "I kind of agree with this point. If the relationship was already rocky, why invite a friend and get intoxicated with someone who had already shown signs of being an asshole? \n\nOf course I don't blame OP for the actions of the SD. Unfortunately, the world operates in a way where you really need to be more careful. Getting hammered around someone who can abuse you one way or another (specially when he's shown signs of not being a respectable person), and inviting a friend over to interact with this risky person don't really seem like very good choices. \n\n I'm very glad you were able to get out of the situation and returned home safely, and I wish there was something that could be done to prevent other women to be at risk with him. Just try to be more careful next time.",
                                                    "author": null,
                                                    "id": "edqfkvy",
                                                    "parent_id": "t1_edq3a6m",
                                                    "score": 16,
                                                    "created_utc": 1547146945.0,
                                                    "replies": [
                                                        {
                                                            "body": "Take into account OP is on parole for DUI having already violated her parole atleast once. Continues to make bad choices including same behaviors and attempts to abdicate self of accountability without any self reflection. ",
                                                            "author": "Kitoko30",
                                                            "id": "edqi2r4",
                                                            "parent_id": "t1_edqfkvy",
                                                            "score": 14,
                                                            "created_utc": 1547148213.0,
                                                            "replies": [
                                                                {
                                                                    "body": "I honestly thought your tone was way harsh at first but read her post history...10 days ago she fell for a scam aka had sex and assumed a guy would pay her in full online, then just 7 days ago talked about being overwhelmed with a controlling SD. Not to mention history of getting way too inebriated on alcohol when going out and resulting in at least a DUI (eta multiple arrests and drug abuse). \n\n\n/u/justunjust this is a wakeup call if there ever was one. Yes the bowl and life is harsh but I think you've been rolling with the punches and hoping for the best for way too long. You need to take a break from the bowl before you land yourself in an even worse situation, which I  honestly think is inevitable if you don't change your approach and start learning from your mistakes. \n\n\nAnd for the love of God please start taking ubers OR not drink *at all* when you bring your car with you. Rehab and doing community service doesn't mean much when you're still going out and getting drunk and sugaring haphazardly. You really can turn your life around but you need to look inward. ",
                                                                    "author": "adequatelay",
                                                                    "id": "edqo493",
                                                                    "parent_id": "t1_edqi2r4",
                                                                    "score": 19,
                                                                    "created_utc": 1547151252.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "I reiterate girlz's advice. Alcohol excess causes all kinds of problems and you should never go there with a SD. Besides, I do not like being in the company of a drunk SB. ",
                            "author": "GSSD",
                            "id": "edpt41b",
                            "parent_id": "t1_edpri0a",
                            "score": 6,
                            "created_utc": 1547134683.0,
                            "replies": [
                                {
                                    "body": "Yah mine has gotten tipsy once, fortunately she was super cute and went to bed. Getting blasted drunk is not usually sexy, and drunk people can be a bit annoying at times.",
                                    "author": "girlz_are_42",
                                    "id": "edpv043",
                                    "parent_id": "t1_edpt41b",
                                    "score": 6,
                                    "created_utc": 1547135837.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Mr. number used to be great for that but mostly things have been cleared out from the company. You can find kik groups on “let’s talk sugar”. I have a couple local ones we all chat about the guys. Also instagram is surprisingly resourceful. One girl would just post a Screenshot of the guys profiles and would get comments from others telling their experience ",
            "author": "throwaway-kittycat",
            "id": "edq9ywv",
            "parent_id": "t1_edpqe98",
            "score": 2,
            "created_utc": 1547143930.0,
            "replies": []
        },
        {
            "body": "Report him for what exactly? ",
            "author": null,
            "id": "edqgf1a",
            "parent_id": "t1_edpqe98",
            "score": 1,
            "created_utc": 1547147373.0,
            "replies": []
        },
        {
            "body": "Unless your favorite drink is Fireball Whisky. ",
            "author": "Sparkledork1",
            "id": "edqiuom",
            "parent_id": "t1_edptfzq",
            "score": 4,
            "created_utc": 1547148595.0,
            "replies": []
        },
        {
            "body": "I agree.  I was just asking a hypothetical of how the day and evening would have played out with the three of them if alcohol had not been in the picture.  I tend to think it would have ended in the harmonious and mountain top like threesome experience they were aiming for.  Just saying.",
            "author": null,
            "id": "edry9zz",
            "parent_id": "t1_edrx22u",
            "score": 1,
            "created_utc": 1547181618.0,
            "replies": [
                {
                    "body": "Completely understood, maybe I was a little too strident in my response ",
                    "author": "theasswasfat100",
                    "id": "edrye5e",
                    "parent_id": "t1_edry9zz",
                    "score": 2,
                    "created_utc": 1547181713.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I know, i have been seeing him for a while now. And i know he’s entitled and I’ve been planning on breaking things off but i needed to get some stuff from his house that i left. Thankfully i did all that before we started drinking",
            "author": "justunjust",
            "id": "edpri0a",
            "parent_id": "t1_edpr6pq",
            "score": 17,
            "created_utc": 1547133550.0,
            "replies": [
                {
                    "body": "Glad it worked out for you ok. He is an ass, but you are safe.",
                    "author": "girlz_are_42",
                    "id": "edpt0rl",
                    "parent_id": "t1_edpri0a",
                    "score": 11,
                    "created_utc": 1547134622.0,
                    "replies": []
                },
                {
                    "body": "why would you invite a friend along hoping she too would fuck your soon to be ex SD ? Why not get your own Uber if he refused ? Why did you want your friend driving your vehicle if she too was drunk ? Did you drive inebriated ?  \n\nReport him for what ? Being an asshole ? \n\n",
                    "author": "Kitoko30",
                    "id": "edpyly3",
                    "parent_id": "t1_edpri0a",
                    "score": 21,
                    "created_utc": 1547137944.0,
                    "replies": [
                        {
                            "body": "You need to calm down. ",
                            "author": "justunjust",
                            "id": "edpys5z",
                            "parent_id": "t1_edpyly3",
                            "score": -10,
                            "created_utc": 1547138041.0,
                            "replies": [
                                {
                                    "body": "So you want to report him for your slew of poor choices ? That's apparently his fault ?\n\nYou knew and stated he was/is an asshole prior to. Now apparently it's an issue ?",
                                    "author": "Kitoko30",
                                    "id": "edq3a6m",
                                    "parent_id": "t1_edpys5z",
                                    "score": 15,
                                    "created_utc": 1547140445.0,
                                    "replies": [
                                        {
                                            "body": "I kind of agree with this point. If the relationship was already rocky, why invite a friend and get intoxicated with someone who had already shown signs of being an asshole? \n\nOf course I don't blame OP for the actions of the SD. Unfortunately, the world operates in a way where you really need to be more careful. Getting hammered around someone who can abuse you one way or another (specially when he's shown signs of not being a respectable person), and inviting a friend over to interact with this risky person don't really seem like very good choices. \n\n I'm very glad you were able to get out of the situation and returned home safely, and I wish there was something that could be done to prevent other women to be at risk with him. Just try to be more careful next time.",
                                            "author": null,
                                            "id": "edqfkvy",
                                            "parent_id": "t1_edq3a6m",
                                            "score": 16,
                                            "created_utc": 1547146945.0,
                                            "replies": [
                                                {
                                                    "body": "Take into account OP is on parole for DUI having already violated her parole atleast once. Continues to make bad choices including same behaviors and attempts to abdicate self of accountability without any self reflection. ",
                                                    "author": "Kitoko30",
                                                    "id": "edqi2r4",
                                                    "parent_id": "t1_edqfkvy",
                                                    "score": 14,
                                                    "created_utc": 1547148213.0,
                                                    "replies": [
                                                        {
                                                            "body": "I honestly thought your tone was way harsh at first but read her post history...10 days ago she fell for a scam aka had sex and assumed a guy would pay her in full online, then just 7 days ago talked about being overwhelmed with a controlling SD. Not to mention history of getting way too inebriated on alcohol when going out and resulting in at least a DUI (eta multiple arrests and drug abuse). \n\n\n/u/justunjust this is a wakeup call if there ever was one. Yes the bowl and life is harsh but I think you've been rolling with the punches and hoping for the best for way too long. You need to take a break from the bowl before you land yourself in an even worse situation, which I  honestly think is inevitable if you don't change your approach and start learning from your mistakes. \n\n\nAnd for the love of God please start taking ubers OR not drink *at all* when you bring your car with you. Rehab and doing community service doesn't mean much when you're still going out and getting drunk and sugaring haphazardly. You really can turn your life around but you need to look inward. ",
                                                            "author": "adequatelay",
                                                            "id": "edqo493",
                                                            "parent_id": "t1_edqi2r4",
                                                            "score": 19,
                                                            "created_utc": 1547151252.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "I reiterate girlz's advice. Alcohol excess causes all kinds of problems and you should never go there with a SD. Besides, I do not like being in the company of a drunk SB. ",
                    "author": "GSSD",
                    "id": "edpt41b",
                    "parent_id": "t1_edpri0a",
                    "score": 6,
                    "created_utc": 1547134683.0,
                    "replies": [
                        {
                            "body": "Yah mine has gotten tipsy once, fortunately she was super cute and went to bed. Getting blasted drunk is not usually sexy, and drunk people can be a bit annoying at times.",
                            "author": "girlz_are_42",
                            "id": "edpv043",
                            "parent_id": "t1_edpt41b",
                            "score": 6,
                            "created_utc": 1547135837.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Completely understood, maybe I was a little too strident in my response ",
            "author": "theasswasfat100",
            "id": "edrye5e",
            "parent_id": "t1_edry9zz",
            "score": 2,
            "created_utc": 1547181713.0,
            "replies": []
        },
        {
            "body": "Glad it worked out for you ok. He is an ass, but you are safe.",
            "author": "girlz_are_42",
            "id": "edpt0rl",
            "parent_id": "t1_edpri0a",
            "score": 11,
            "created_utc": 1547134622.0,
            "replies": []
        },
        {
            "body": "why would you invite a friend along hoping she too would fuck your soon to be ex SD ? Why not get your own Uber if he refused ? Why did you want your friend driving your vehicle if she too was drunk ? Did you drive inebriated ?  \n\nReport him for what ? Being an asshole ? \n\n",
            "author": "Kitoko30",
            "id": "edpyly3",
            "parent_id": "t1_edpri0a",
            "score": 21,
            "created_utc": 1547137944.0,
            "replies": [
                {
                    "body": "You need to calm down. ",
                    "author": "justunjust",
                    "id": "edpys5z",
                    "parent_id": "t1_edpyly3",
                    "score": -10,
                    "created_utc": 1547138041.0,
                    "replies": [
                        {
                            "body": "So you want to report him for your slew of poor choices ? That's apparently his fault ?\n\nYou knew and stated he was/is an asshole prior to. Now apparently it's an issue ?",
                            "author": "Kitoko30",
                            "id": "edq3a6m",
                            "parent_id": "t1_edpys5z",
                            "score": 15,
                            "created_utc": 1547140445.0,
                            "replies": [
                                {
                                    "body": "I kind of agree with this point. If the relationship was already rocky, why invite a friend and get intoxicated with someone who had already shown signs of being an asshole? \n\nOf course I don't blame OP for the actions of the SD. Unfortunately, the world operates in a way where you really need to be more careful. Getting hammered around someone who can abuse you one way or another (specially when he's shown signs of not being a respectable person), and inviting a friend over to interact with this risky person don't really seem like very good choices. \n\n I'm very glad you were able to get out of the situation and returned home safely, and I wish there was something that could be done to prevent other women to be at risk with him. Just try to be more careful next time.",
                                    "author": null,
                                    "id": "edqfkvy",
                                    "parent_id": "t1_edq3a6m",
                                    "score": 16,
                                    "created_utc": 1547146945.0,
                                    "replies": [
                                        {
                                            "body": "Take into account OP is on parole for DUI having already violated her parole atleast once. Continues to make bad choices including same behaviors and attempts to abdicate self of accountability without any self reflection. ",
                                            "author": "Kitoko30",
                                            "id": "edqi2r4",
                                            "parent_id": "t1_edqfkvy",
                                            "score": 14,
                                            "created_utc": 1547148213.0,
                                            "replies": [
                                                {
                                                    "body": "I honestly thought your tone was way harsh at first but read her post history...10 days ago she fell for a scam aka had sex and assumed a guy would pay her in full online, then just 7 days ago talked about being overwhelmed with a controlling SD. Not to mention history of getting way too inebriated on alcohol when going out and resulting in at least a DUI (eta multiple arrests and drug abuse). \n\n\n/u/justunjust this is a wakeup call if there ever was one. Yes the bowl and life is harsh but I think you've been rolling with the punches and hoping for the best for way too long. You need to take a break from the bowl before you land yourself in an even worse situation, which I  honestly think is inevitable if you don't change your approach and start learning from your mistakes. \n\n\nAnd for the love of God please start taking ubers OR not drink *at all* when you bring your car with you. Rehab and doing community service doesn't mean much when you're still going out and getting drunk and sugaring haphazardly. You really can turn your life around but you need to look inward. ",
                                                    "author": "adequatelay",
                                                    "id": "edqo493",
                                                    "parent_id": "t1_edqi2r4",
                                                    "score": 19,
                                                    "created_utc": 1547151252.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I reiterate girlz's advice. Alcohol excess causes all kinds of problems and you should never go there with a SD. Besides, I do not like being in the company of a drunk SB. ",
            "author": "GSSD",
            "id": "edpt41b",
            "parent_id": "t1_edpri0a",
            "score": 6,
            "created_utc": 1547134683.0,
            "replies": [
                {
                    "body": "Yah mine has gotten tipsy once, fortunately she was super cute and went to bed. Getting blasted drunk is not usually sexy, and drunk people can be a bit annoying at times.",
                    "author": "girlz_are_42",
                    "id": "edpv043",
                    "parent_id": "t1_edpt41b",
                    "score": 6,
                    "created_utc": 1547135837.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "You need to calm down. ",
            "author": "justunjust",
            "id": "edpys5z",
            "parent_id": "t1_edpyly3",
            "score": -10,
            "created_utc": 1547138041.0,
            "replies": [
                {
                    "body": "So you want to report him for your slew of poor choices ? That's apparently his fault ?\n\nYou knew and stated he was/is an asshole prior to. Now apparently it's an issue ?",
                    "author": "Kitoko30",
                    "id": "edq3a6m",
                    "parent_id": "t1_edpys5z",
                    "score": 15,
                    "created_utc": 1547140445.0,
                    "replies": [
                        {
                            "body": "I kind of agree with this point. If the relationship was already rocky, why invite a friend and get intoxicated with someone who had already shown signs of being an asshole? \n\nOf course I don't blame OP for the actions of the SD. Unfortunately, the world operates in a way where you really need to be more careful. Getting hammered around someone who can abuse you one way or another (specially when he's shown signs of not being a respectable person), and inviting a friend over to interact with this risky person don't really seem like very good choices. \n\n I'm very glad you were able to get out of the situation and returned home safely, and I wish there was something that could be done to prevent other women to be at risk with him. Just try to be more careful next time.",
                            "author": null,
                            "id": "edqfkvy",
                            "parent_id": "t1_edq3a6m",
                            "score": 16,
                            "created_utc": 1547146945.0,
                            "replies": [
                                {
                                    "body": "Take into account OP is on parole for DUI having already violated her parole atleast once. Continues to make bad choices including same behaviors and attempts to abdicate self of accountability without any self reflection. ",
                                    "author": "Kitoko30",
                                    "id": "edqi2r4",
                                    "parent_id": "t1_edqfkvy",
                                    "score": 14,
                                    "created_utc": 1547148213.0,
                                    "replies": [
                                        {
                                            "body": "I honestly thought your tone was way harsh at first but read her post history...10 days ago she fell for a scam aka had sex and assumed a guy would pay her in full online, then just 7 days ago talked about being overwhelmed with a controlling SD. Not to mention history of getting way too inebriated on alcohol when going out and resulting in at least a DUI (eta multiple arrests and drug abuse). \n\n\n/u/justunjust this is a wakeup call if there ever was one. Yes the bowl and life is harsh but I think you've been rolling with the punches and hoping for the best for way too long. You need to take a break from the bowl before you land yourself in an even worse situation, which I  honestly think is inevitable if you don't change your approach and start learning from your mistakes. \n\n\nAnd for the love of God please start taking ubers OR not drink *at all* when you bring your car with you. Rehab and doing community service doesn't mean much when you're still going out and getting drunk and sugaring haphazardly. You really can turn your life around but you need to look inward. ",
                                            "author": "adequatelay",
                                            "id": "edqo493",
                                            "parent_id": "t1_edqi2r4",
                                            "score": 19,
                                            "created_utc": 1547151252.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yah mine has gotten tipsy once, fortunately she was super cute and went to bed. Getting blasted drunk is not usually sexy, and drunk people can be a bit annoying at times.",
            "author": "girlz_are_42",
            "id": "edpv043",
            "parent_id": "t1_edpt41b",
            "score": 6,
            "created_utc": 1547135837.0,
            "replies": []
        },
        {
            "body": "So you want to report him for your slew of poor choices ? That's apparently his fault ?\n\nYou knew and stated he was/is an asshole prior to. Now apparently it's an issue ?",
            "author": "Kitoko30",
            "id": "edq3a6m",
            "parent_id": "t1_edpys5z",
            "score": 15,
            "created_utc": 1547140445.0,
            "replies": [
                {
                    "body": "I kind of agree with this point. If the relationship was already rocky, why invite a friend and get intoxicated with someone who had already shown signs of being an asshole? \n\nOf course I don't blame OP for the actions of the SD. Unfortunately, the world operates in a way where you really need to be more careful. Getting hammered around someone who can abuse you one way or another (specially when he's shown signs of not being a respectable person), and inviting a friend over to interact with this risky person don't really seem like very good choices. \n\n I'm very glad you were able to get out of the situation and returned home safely, and I wish there was something that could be done to prevent other women to be at risk with him. Just try to be more careful next time.",
                    "author": null,
                    "id": "edqfkvy",
                    "parent_id": "t1_edq3a6m",
                    "score": 16,
                    "created_utc": 1547146945.0,
                    "replies": [
                        {
                            "body": "Take into account OP is on parole for DUI having already violated her parole atleast once. Continues to make bad choices including same behaviors and attempts to abdicate self of accountability without any self reflection. ",
                            "author": "Kitoko30",
                            "id": "edqi2r4",
                            "parent_id": "t1_edqfkvy",
                            "score": 14,
                            "created_utc": 1547148213.0,
                            "replies": [
                                {
                                    "body": "I honestly thought your tone was way harsh at first but read her post history...10 days ago she fell for a scam aka had sex and assumed a guy would pay her in full online, then just 7 days ago talked about being overwhelmed with a controlling SD. Not to mention history of getting way too inebriated on alcohol when going out and resulting in at least a DUI (eta multiple arrests and drug abuse). \n\n\n/u/justunjust this is a wakeup call if there ever was one. Yes the bowl and life is harsh but I think you've been rolling with the punches and hoping for the best for way too long. You need to take a break from the bowl before you land yourself in an even worse situation, which I  honestly think is inevitable if you don't change your approach and start learning from your mistakes. \n\n\nAnd for the love of God please start taking ubers OR not drink *at all* when you bring your car with you. Rehab and doing community service doesn't mean much when you're still going out and getting drunk and sugaring haphazardly. You really can turn your life around but you need to look inward. ",
                                    "author": "adequatelay",
                                    "id": "edqo493",
                                    "parent_id": "t1_edqi2r4",
                                    "score": 19,
                                    "created_utc": 1547151252.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I kind of agree with this point. If the relationship was already rocky, why invite a friend and get intoxicated with someone who had already shown signs of being an asshole? \n\nOf course I don't blame OP for the actions of the SD. Unfortunately, the world operates in a way where you really need to be more careful. Getting hammered around someone who can abuse you one way or another (specially when he's shown signs of not being a respectable person), and inviting a friend over to interact with this risky person don't really seem like very good choices. \n\n I'm very glad you were able to get out of the situation and returned home safely, and I wish there was something that could be done to prevent other women to be at risk with him. Just try to be more careful next time.",
            "author": null,
            "id": "edqfkvy",
            "parent_id": "t1_edq3a6m",
            "score": 16,
            "created_utc": 1547146945.0,
            "replies": [
                {
                    "body": "Take into account OP is on parole for DUI having already violated her parole atleast once. Continues to make bad choices including same behaviors and attempts to abdicate self of accountability without any self reflection. ",
                    "author": "Kitoko30",
                    "id": "edqi2r4",
                    "parent_id": "t1_edqfkvy",
                    "score": 14,
                    "created_utc": 1547148213.0,
                    "replies": [
                        {
                            "body": "I honestly thought your tone was way harsh at first but read her post history...10 days ago she fell for a scam aka had sex and assumed a guy would pay her in full online, then just 7 days ago talked about being overwhelmed with a controlling SD. Not to mention history of getting way too inebriated on alcohol when going out and resulting in at least a DUI (eta multiple arrests and drug abuse). \n\n\n/u/justunjust this is a wakeup call if there ever was one. Yes the bowl and life is harsh but I think you've been rolling with the punches and hoping for the best for way too long. You need to take a break from the bowl before you land yourself in an even worse situation, which I  honestly think is inevitable if you don't change your approach and start learning from your mistakes. \n\n\nAnd for the love of God please start taking ubers OR not drink *at all* when you bring your car with you. Rehab and doing community service doesn't mean much when you're still going out and getting drunk and sugaring haphazardly. You really can turn your life around but you need to look inward. ",
                            "author": "adequatelay",
                            "id": "edqo493",
                            "parent_id": "t1_edqi2r4",
                            "score": 19,
                            "created_utc": 1547151252.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Take into account OP is on parole for DUI having already violated her parole atleast once. Continues to make bad choices including same behaviors and attempts to abdicate self of accountability without any self reflection. ",
            "author": "Kitoko30",
            "id": "edqi2r4",
            "parent_id": "t1_edqfkvy",
            "score": 14,
            "created_utc": 1547148213.0,
            "replies": [
                {
                    "body": "I honestly thought your tone was way harsh at first but read her post history...10 days ago she fell for a scam aka had sex and assumed a guy would pay her in full online, then just 7 days ago talked about being overwhelmed with a controlling SD. Not to mention history of getting way too inebriated on alcohol when going out and resulting in at least a DUI (eta multiple arrests and drug abuse). \n\n\n/u/justunjust this is a wakeup call if there ever was one. Yes the bowl and life is harsh but I think you've been rolling with the punches and hoping for the best for way too long. You need to take a break from the bowl before you land yourself in an even worse situation, which I  honestly think is inevitable if you don't change your approach and start learning from your mistakes. \n\n\nAnd for the love of God please start taking ubers OR not drink *at all* when you bring your car with you. Rehab and doing community service doesn't mean much when you're still going out and getting drunk and sugaring haphazardly. You really can turn your life around but you need to look inward. ",
                    "author": "adequatelay",
                    "id": "edqo493",
                    "parent_id": "t1_edqi2r4",
                    "score": 19,
                    "created_utc": 1547151252.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I honestly thought your tone was way harsh at first but read her post history...10 days ago she fell for a scam aka had sex and assumed a guy would pay her in full online, then just 7 days ago talked about being overwhelmed with a controlling SD. Not to mention history of getting way too inebriated on alcohol when going out and resulting in at least a DUI (eta multiple arrests and drug abuse). \n\n\n/u/justunjust this is a wakeup call if there ever was one. Yes the bowl and life is harsh but I think you've been rolling with the punches and hoping for the best for way too long. You need to take a break from the bowl before you land yourself in an even worse situation, which I  honestly think is inevitable if you don't change your approach and start learning from your mistakes. \n\n\nAnd for the love of God please start taking ubers OR not drink *at all* when you bring your car with you. Rehab and doing community service doesn't mean much when you're still going out and getting drunk and sugaring haphazardly. You really can turn your life around but you need to look inward. ",
            "author": "adequatelay",
            "id": "edqo493",
            "parent_id": "t1_edqi2r4",
            "score": 19,
            "created_utc": 1547151252.0,
            "replies": []
        }
    ]
}