{
    "title": "[HDYP] Mijoo recommends Somin for the female vocal group \"WSG Wannabe\"",
    "post_id": "u0i5gq",
    "post_url": "https://www.reddit.com/r/runningman/comments/u0i5gq/hdyp_mijoo_recommends_somin_for_the_female_vocal/",
    "author": "creezle",
    "body": "",
    "url": "https://v.redd.it/acgxs5m7jps81",
    "score": 299,
    "upvote_ratio": 0.97,
    "created_utc": 1649599157.0,
    "num_comments": 38,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "How I wish she is free to join it. But now, she is busy with her drama. And I don't think the drama will finish filming anytime soon...",
            "author": "salmeng",
            "id": "i464t32",
            "parent_id": "t3_u0i5gq",
            "score": 47,
            "created_utc": 1649602611.0,
            "replies": [
                {
                    "body": "Yeah unfortunately I think this will be the case. If she can't even film Sixth Sense it doesn't seem likely.",
                    "author": "creezle",
                    "id": "i46c69a",
                    "parent_id": "t1_i464t32",
                    "score": 25,
                    "created_utc": 1649605705.0,
                    "replies": [
                        {
                            "body": "it could be just the scheduling times clashing/causing a conflict with her rehab etc. since yjs is on sixth sense you would think it would be a different time scheduled than hdyp",
                            "author": "Cedosg",
                            "id": "i46fvv1",
                            "parent_id": "t1_i46c69a",
                            "score": 7,
                            "created_utc": 1649607194.0,
                            "replies": [
                                {
                                    "body": "I'd love if that were the case but I think the group coordinates outside of recording hours as well so it could be a time commitment issue.",
                                    "author": "creezle",
                                    "id": "i46kye2",
                                    "parent_id": "t1_i46fvv1",
                                    "score": 0,
                                    "created_utc": 1649609207.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "The project is for people who can sing and she's not a singer. Even if she was free, she'd be disqualified in the blind auditions anyways.",
                    "author": "magablossom",
                    "id": "i482y3f",
                    "parent_id": "t1_i464t32",
                    "score": -15,
                    "created_utc": 1649631807.0,
                    "replies": [
                        {
                            "body": "Yang Sechan and Hwang Jesung auditioned for MSG Wannabe as their Psychorus persona. While they were instantly eliminated, their segment was still funny. Do Kyungwan got eliminated too cuz he sounded so much like Kim Jungmin. Yet that reveal was one of the funniest bits in the entire MSG Wannabe saga.\n\nIf time allows, 100% there's comedic value in Somin attending the audition even if she gets eliminated.",
                            "author": "SuddenBag",
                            "id": "i49j7jw",
                            "parent_id": "t1_i482y3f",
                            "score": 11,
                            "created_utc": 1649659997.0,
                            "replies": [
                                {
                                    "body": "hwang jesung actually got in the top 9 but he couldn't fit it into his schedule.",
                                    "author": "Cedosg",
                                    "id": "i4agr3b",
                                    "parent_id": "t1_i49j7jw",
                                    "score": 3,
                                    "created_utc": 1649683079.0,
                                    "replies": []
                                },
                                {
                                    "body": "Psychorus is a musical group. Do Kyungwan can sing (so well that he got mistaken for an actual singer). So technically, there was valid reason to invite both to audition. I understand your viewpoint about comedic value, but JSM falls in neither category.",
                                    "author": "magablossom",
                                    "id": "i49jkcv",
                                    "parent_id": "t1_i49j7jw",
                                    "score": -6,
                                    "created_utc": 1649660278.0,
                                    "replies": [
                                        {
                                            "body": "Psychorus is a *comedic* musical group. Their audition for MSG Wannabe fell apart pretty quickly. And that's fine cuz it's funny.\n\nHDYP is a variety show, it's not a musical competition. Sure, serious singers are needed, but there's nothing wrong with someone who isn't a super good singer attending as long as that segment is funny.",
                                            "author": "SuddenBag",
                                            "id": "i49k1ph",
                                            "parent_id": "t1_i49jkcv",
                                            "score": 8,
                                            "created_utc": 1649660655.0,
                                            "replies": [
                                                {
                                                    "body": "I'd argue they had more room for comedic segments last time, hence why we got Psychorus. The competition is likely greater this time. Also JSM has never given any indication that she wants to be a singer. Why the insistence that she appear? Even if someone was to appear for a comedic segment, shouldn't they at least have singing or musical aspirations?\n\nedit: added sentences",
                                                    "author": "magablossom",
                                                    "id": "i49kuie",
                                                    "parent_id": "t1_i49k1ph",
                                                    "score": -5,
                                                    "created_utc": 1649661296.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "there is 2 actors  in MSG Wannabe (previous project). lee sang yi and lee dong hwi",
                            "author": "Next_Topic3790",
                            "id": "i48vpz1",
                            "parent_id": "t1_i482y3f",
                            "score": 2,
                            "created_utc": 1649645345.0,
                            "replies": [
                                {
                                    "body": "They're both very skilled at singing",
                                    "author": "magablossom",
                                    "id": "i48wvz8",
                                    "parent_id": "t1_i48vpz1",
                                    "score": -6,
                                    "created_utc": 1649645934.0,
                                    "replies": [
                                        {
                                            "body": " they can sing but  still  not a singer ..U said somin can not joint coz she is not a singer ( actually she already have a song with shinhwa kim dong wan) .. mi joo also said somin can sing..so somin can still participate if she want..",
                                            "author": "Next_Topic3790",
                                            "id": "i48zamh",
                                            "parent_id": "t1_i48wvz8",
                                            "score": 6,
                                            "created_utc": 1649647181.0,
                                            "replies": [
                                                {
                                                    "body": "My point is that it would be a waste of time for JSM (of course she's free to participate if she's invited). She's not exactly a strong vocalist and she's never pretended to be one. Someone like LSB, as Mijoo mentioned, has a strong chance though.\n\nedit: word",
                                                    "author": "magablossom",
                                                    "id": "i490v1t",
                                                    "parent_id": "t1_i48zamh",
                                                    "score": -3,
                                                    "created_utc": 1649648010.0,
                                                    "replies": [
                                                        {
                                                            "body": "so now move to  lee sun bin?..sun bin can sing? somin also, sun bin can dance? somin also, sun bin got trained? somin also....haha...just said u dont like somin to participate....let the people in charge to judge them..not us..Lol🤣..Bye",
                                                            "author": "Next_Topic3790",
                                                            "id": "i49699d",
                                                            "parent_id": "t1_i490v1t",
                                                            "score": 10,
                                                            "created_utc": 1649651082.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Both LSB and JSM have sung in the past. LSB has proven she has strong vocal skills while JSM is noticeably weaker and clearly not a singer. Watch the clip OP posted. YJS agreed that LSB was a good candidate but was surprised and unsure about JSM. Even Mijoo only mentioned emotions rather than vocal skill for JSM\n\nYou can argue about it all you want. Even if JSM auditions, she'll be disqualified. Accusing me of not wanting her to participate is nonsensical and won't change the facts. I said in another comment that it would be fun if she joined for an acting project; I have nothing against her\n\nedit: word",
                                                                    "author": "magablossom",
                                                                    "id": "i49i9hy",
                                                                    "parent_id": "t1_i49699d",
                                                                    "score": -2,
                                                                    "created_utc": 1649659269.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "enough that kjk invited her to sing in his concert. https://youtu.be/G3lRNfkh8gg",
                                                                            "author": "Cedosg",
                                                                            "id": "i4ah59q",
                                                                            "parent_id": "t1_i49i9hy",
                                                                            "score": 3,
                                                                            "created_utc": 1649683259.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "because she’s a coworker and friend",
                                                                                    "author": "magablossom",
                                                                                    "id": "i4b92kb",
                                                                                    "parent_id": "t1_i4ah59q",
                                                                                    "score": 0,
                                                                                    "created_utc": 1649694798.0,
                                                                                    "replies": [
                                                                                        {
                                                                                            "body": "not for an actual concert that people pay for.",
                                                                                            "author": "Cedosg",
                                                                                            "id": "i4blel8",
                                                                                            "parent_id": "t1_i4b92kb",
                                                                                            "score": 0,
                                                                                            "created_utc": 1649699425.0,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "body": "What concert attendee wouldn’t enjoy seeing extra celebrities, regardless of whether they can sing or not? He invited Sechan too and a bunch of his celebrity friends who had time to appear. It was just for fun\n\nedit: added sentence",
                                                                                                    "author": "magablossom",
                                                                                                    "id": "i4dd3p7",
                                                                                                    "parent_id": "t1_i4blel8",
                                                                                                    "score": 1,
                                                                                                    "created_utc": 1649726842.0,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "body": "the concert attendees that don't care about running man?\n\nsomin isn't that popular as a celebrity too.\n\nPS: Se Chan is actually a pretty decent rapper.",
                                                                                                            "author": "Cedosg",
                                                                                                            "id": "i4dgq5x",
                                                                                                            "parent_id": "t1_i4dd3p7",
                                                                                                            "score": 1,
                                                                                                            "created_utc": 1649728407.0,
                                                                                                            "replies": []
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Loved it how Somin's ringback tone is Sukjin's new song with MSG Wannabe. If she even shows up for 5 minutes of an episode of HDYP I'd be happy.",
            "author": "buddhabear07",
            "id": "i472o2s",
            "parent_id": "t3_u0i5gq",
            "score": 32,
            "created_utc": 1649616344.0,
            "replies": []
        },
        {
            "body": "OMG i hope they cast her, and then she can join in writing the song. She's a good writer. I remember her song in running man fan meeting, it was really great",
            "author": "pake19",
            "id": "i463kdn",
            "parent_id": "t3_u0i5gq",
            "score": 56,
            "created_utc": 1649602074.0,
            "replies": [
                {
                    "body": "I still listen to that song!",
                    "author": "Cat4Why7",
                    "id": "i46fx90",
                    "parent_id": "t1_i463kdn",
                    "score": 4,
                    "created_utc": 1649607210.0,
                    "replies": []
                },
                {
                    "body": "They wouldn't entrust a song for such a big project to someone who barely has song writing experience. It would be cool if she could join in some future project though, maybe acting related",
                    "author": "magablossom",
                    "id": "i482zp0",
                    "parent_id": "t1_i463kdn",
                    "score": -7,
                    "created_utc": 1649631828.0,
                    "replies": [
                        {
                            "body": "I’m not saying she’s the most experienced writer in the world but her experience isn’t limited to the RM project. She’s written music for 2 different musicians already.",
                            "author": "RumblesFish",
                            "id": "i48k6cj",
                            "parent_id": "t1_i482zp0",
                            "score": 9,
                            "created_utc": 1649639851.0,
                            "replies": [
                                {
                                    "body": "Co-writing a fanmeet song and working on a couple of projects that went largely unnoticed doesn't exactly boast experience. It's cute that she experimented with that though",
                                    "author": "magablossom",
                                    "id": "i48lz1b",
                                    "parent_id": "t1_i48k6cj",
                                    "score": -10,
                                    "created_utc": 1649640694.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "They let her write it for running man. It's not like she'll be producing the music. She writes poetry, and they can take snippets from her just like running man did",
                            "author": "pake19",
                            "id": "i484pyn",
                            "parent_id": "t1_i482zp0",
                            "score": -2,
                            "created_utc": 1649632620.0,
                            "replies": [
                                {
                                    "body": "hope she can appear in that show..really want to see her in this show 😍..she write a song for lee ki chan (one room), and she also made a collaboration with choi button (producer).. in \"problem child in house\" show she mention that she already registered as a lyricist.",
                                    "author": "Next_Topic3790",
                                    "id": "i48xnnb",
                                    "parent_id": "t1_i484pyn",
                                    "score": 4,
                                    "created_utc": 1649646326.0,
                                    "replies": []
                                },
                                {
                                    "body": "She helped write a song for her team, just like everyone contributed to creating songs for their team performances. I'm not trying to insult her but realistically there's no reason to cast her when they can get far more established writers\n\nedit: wording",
                                    "author": "magablossom",
                                    "id": "i485m6w",
                                    "parent_id": "t1_i484pyn",
                                    "score": -7,
                                    "created_utc": 1649633028.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Yeah anyone who follows HYDP music group projects  would know this fact. They tend to entrust wrting the song to established composers. I don't even know why you are getting downvoted lol.\n\nEdit: Seriously, RM fandom is so emotional lol.",
                            "author": "whitefang0824",
                            "id": "i490mv8",
                            "parent_id": "t1_i482zp0",
                            "score": -6,
                            "created_utc": 1649647887.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I always wanted her to cameo on this show. Even if it’s not this project I just hope one day!!! 🥹🥹",
            "author": "Papercrane4",
            "id": "i4989ua",
            "parent_id": "t3_u0i5gq",
            "score": 17,
            "created_utc": 1649652312.0,
            "replies": [
                {
                    "body": "yes, same with me..really want her to cameo on this show..all this time its only her voice tho😂..when this show started jae suk  call her for relay camera segment.",
                    "author": "Next_Topic3790",
                    "id": "i49agln",
                    "parent_id": "t1_i4989ua",
                    "score": 5,
                    "created_utc": 1649653704.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I just love MiJoo!",
            "author": null,
            "id": "i47jspj",
            "parent_id": "t3_u0i5gq",
            "score": 18,
            "created_utc": 1649623470.0,
            "replies": []
        },
        {
            "body": "Btw where is the subbed episode, i can't find it on dramanice nor kshow123",
            "author": "pake19",
            "id": "i4640gh",
            "parent_id": "t3_u0i5gq",
            "score": 3,
            "created_utc": 1649602267.0,
            "replies": [
                {
                    "body": "The subs came out a few hours ago and is available on legit streaming services and will probably be on the *other* ones later today. If you want to manually download the ep+subs you can check out the thread on /r/koreanvariety",
                    "author": "creezle",
                    "id": "i46bfuf",
                    "parent_id": "t1_i4640gh",
                    "score": 6,
                    "created_utc": 1649605409.0,
                    "replies": [
                        {
                            "body": "Thank youu",
                            "author": "pake19",
                            "id": "i46bnwq",
                            "parent_id": "t1_i46bfuf",
                            "score": 0,
                            "created_utc": 1649605497.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "mijoo looks pretty here",
            "author": "jiseulseyoung",
            "id": "iawndnu",
            "parent_id": "t3_u0i5gq",
            "score": 1,
            "created_utc": 1654174442.0,
            "replies": []
        },
        {
            "body": "Yeah unfortunately I think this will be the case. If she can't even film Sixth Sense it doesn't seem likely.",
            "author": "creezle",
            "id": "i46c69a",
            "parent_id": "t1_i464t32",
            "score": 25,
            "created_utc": 1649605705.0,
            "replies": [
                {
                    "body": "it could be just the scheduling times clashing/causing a conflict with her rehab etc. since yjs is on sixth sense you would think it would be a different time scheduled than hdyp",
                    "author": "Cedosg",
                    "id": "i46fvv1",
                    "parent_id": "t1_i46c69a",
                    "score": 7,
                    "created_utc": 1649607194.0,
                    "replies": [
                        {
                            "body": "I'd love if that were the case but I think the group coordinates outside of recording hours as well so it could be a time commitment issue.",
                            "author": "creezle",
                            "id": "i46kye2",
                            "parent_id": "t1_i46fvv1",
                            "score": 0,
                            "created_utc": 1649609207.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "The project is for people who can sing and she's not a singer. Even if she was free, she'd be disqualified in the blind auditions anyways.",
            "author": "magablossom",
            "id": "i482y3f",
            "parent_id": "t1_i464t32",
            "score": -15,
            "created_utc": 1649631807.0,
            "replies": [
                {
                    "body": "Yang Sechan and Hwang Jesung auditioned for MSG Wannabe as their Psychorus persona. While they were instantly eliminated, their segment was still funny. Do Kyungwan got eliminated too cuz he sounded so much like Kim Jungmin. Yet that reveal was one of the funniest bits in the entire MSG Wannabe saga.\n\nIf time allows, 100% there's comedic value in Somin attending the audition even if she gets eliminated.",
                    "author": "SuddenBag",
                    "id": "i49j7jw",
                    "parent_id": "t1_i482y3f",
                    "score": 11,
                    "created_utc": 1649659997.0,
                    "replies": [
                        {
                            "body": "hwang jesung actually got in the top 9 but he couldn't fit it into his schedule.",
                            "author": "Cedosg",
                            "id": "i4agr3b",
                            "parent_id": "t1_i49j7jw",
                            "score": 3,
                            "created_utc": 1649683079.0,
                            "replies": []
                        },
                        {
                            "body": "Psychorus is a musical group. Do Kyungwan can sing (so well that he got mistaken for an actual singer). So technically, there was valid reason to invite both to audition. I understand your viewpoint about comedic value, but JSM falls in neither category.",
                            "author": "magablossom",
                            "id": "i49jkcv",
                            "parent_id": "t1_i49j7jw",
                            "score": -6,
                            "created_utc": 1649660278.0,
                            "replies": [
                                {
                                    "body": "Psychorus is a *comedic* musical group. Their audition for MSG Wannabe fell apart pretty quickly. And that's fine cuz it's funny.\n\nHDYP is a variety show, it's not a musical competition. Sure, serious singers are needed, but there's nothing wrong with someone who isn't a super good singer attending as long as that segment is funny.",
                                    "author": "SuddenBag",
                                    "id": "i49k1ph",
                                    "parent_id": "t1_i49jkcv",
                                    "score": 8,
                                    "created_utc": 1649660655.0,
                                    "replies": [
                                        {
                                            "body": "I'd argue they had more room for comedic segments last time, hence why we got Psychorus. The competition is likely greater this time. Also JSM has never given any indication that she wants to be a singer. Why the insistence that she appear? Even if someone was to appear for a comedic segment, shouldn't they at least have singing or musical aspirations?\n\nedit: added sentences",
                                            "author": "magablossom",
                                            "id": "i49kuie",
                                            "parent_id": "t1_i49k1ph",
                                            "score": -5,
                                            "created_utc": 1649661296.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "there is 2 actors  in MSG Wannabe (previous project). lee sang yi and lee dong hwi",
                    "author": "Next_Topic3790",
                    "id": "i48vpz1",
                    "parent_id": "t1_i482y3f",
                    "score": 2,
                    "created_utc": 1649645345.0,
                    "replies": [
                        {
                            "body": "They're both very skilled at singing",
                            "author": "magablossom",
                            "id": "i48wvz8",
                            "parent_id": "t1_i48vpz1",
                            "score": -6,
                            "created_utc": 1649645934.0,
                            "replies": [
                                {
                                    "body": " they can sing but  still  not a singer ..U said somin can not joint coz she is not a singer ( actually she already have a song with shinhwa kim dong wan) .. mi joo also said somin can sing..so somin can still participate if she want..",
                                    "author": "Next_Topic3790",
                                    "id": "i48zamh",
                                    "parent_id": "t1_i48wvz8",
                                    "score": 6,
                                    "created_utc": 1649647181.0,
                                    "replies": [
                                        {
                                            "body": "My point is that it would be a waste of time for JSM (of course she's free to participate if she's invited). She's not exactly a strong vocalist and she's never pretended to be one. Someone like LSB, as Mijoo mentioned, has a strong chance though.\n\nedit: word",
                                            "author": "magablossom",
                                            "id": "i490v1t",
                                            "parent_id": "t1_i48zamh",
                                            "score": -3,
                                            "created_utc": 1649648010.0,
                                            "replies": [
                                                {
                                                    "body": "so now move to  lee sun bin?..sun bin can sing? somin also, sun bin can dance? somin also, sun bin got trained? somin also....haha...just said u dont like somin to participate....let the people in charge to judge them..not us..Lol🤣..Bye",
                                                    "author": "Next_Topic3790",
                                                    "id": "i49699d",
                                                    "parent_id": "t1_i490v1t",
                                                    "score": 10,
                                                    "created_utc": 1649651082.0,
                                                    "replies": [
                                                        {
                                                            "body": "Both LSB and JSM have sung in the past. LSB has proven she has strong vocal skills while JSM is noticeably weaker and clearly not a singer. Watch the clip OP posted. YJS agreed that LSB was a good candidate but was surprised and unsure about JSM. Even Mijoo only mentioned emotions rather than vocal skill for JSM\n\nYou can argue about it all you want. Even if JSM auditions, she'll be disqualified. Accusing me of not wanting her to participate is nonsensical and won't change the facts. I said in another comment that it would be fun if she joined for an acting project; I have nothing against her\n\nedit: word",
                                                            "author": "magablossom",
                                                            "id": "i49i9hy",
                                                            "parent_id": "t1_i49699d",
                                                            "score": -2,
                                                            "created_utc": 1649659269.0,
                                                            "replies": [
                                                                {
                                                                    "body": "enough that kjk invited her to sing in his concert. https://youtu.be/G3lRNfkh8gg",
                                                                    "author": "Cedosg",
                                                                    "id": "i4ah59q",
                                                                    "parent_id": "t1_i49i9hy",
                                                                    "score": 3,
                                                                    "created_utc": 1649683259.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "because she’s a coworker and friend",
                                                                            "author": "magablossom",
                                                                            "id": "i4b92kb",
                                                                            "parent_id": "t1_i4ah59q",
                                                                            "score": 0,
                                                                            "created_utc": 1649694798.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "not for an actual concert that people pay for.",
                                                                                    "author": "Cedosg",
                                                                                    "id": "i4blel8",
                                                                                    "parent_id": "t1_i4b92kb",
                                                                                    "score": 0,
                                                                                    "created_utc": 1649699425.0,
                                                                                    "replies": [
                                                                                        {
                                                                                            "body": "What concert attendee wouldn’t enjoy seeing extra celebrities, regardless of whether they can sing or not? He invited Sechan too and a bunch of his celebrity friends who had time to appear. It was just for fun\n\nedit: added sentence",
                                                                                            "author": "magablossom",
                                                                                            "id": "i4dd3p7",
                                                                                            "parent_id": "t1_i4blel8",
                                                                                            "score": 1,
                                                                                            "created_utc": 1649726842.0,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "body": "the concert attendees that don't care about running man?\n\nsomin isn't that popular as a celebrity too.\n\nPS: Se Chan is actually a pretty decent rapper.",
                                                                                                    "author": "Cedosg",
                                                                                                    "id": "i4dgq5x",
                                                                                                    "parent_id": "t1_i4dd3p7",
                                                                                                    "score": 1,
                                                                                                    "created_utc": 1649728407.0,
                                                                                                    "replies": []
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I still listen to that song!",
            "author": "Cat4Why7",
            "id": "i46fx90",
            "parent_id": "t1_i463kdn",
            "score": 4,
            "created_utc": 1649607210.0,
            "replies": []
        },
        {
            "body": "They wouldn't entrust a song for such a big project to someone who barely has song writing experience. It would be cool if she could join in some future project though, maybe acting related",
            "author": "magablossom",
            "id": "i482zp0",
            "parent_id": "t1_i463kdn",
            "score": -7,
            "created_utc": 1649631828.0,
            "replies": [
                {
                    "body": "I’m not saying she’s the most experienced writer in the world but her experience isn’t limited to the RM project. She’s written music for 2 different musicians already.",
                    "author": "RumblesFish",
                    "id": "i48k6cj",
                    "parent_id": "t1_i482zp0",
                    "score": 9,
                    "created_utc": 1649639851.0,
                    "replies": [
                        {
                            "body": "Co-writing a fanmeet song and working on a couple of projects that went largely unnoticed doesn't exactly boast experience. It's cute that she experimented with that though",
                            "author": "magablossom",
                            "id": "i48lz1b",
                            "parent_id": "t1_i48k6cj",
                            "score": -10,
                            "created_utc": 1649640694.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "They let her write it for running man. It's not like she'll be producing the music. She writes poetry, and they can take snippets from her just like running man did",
                    "author": "pake19",
                    "id": "i484pyn",
                    "parent_id": "t1_i482zp0",
                    "score": -2,
                    "created_utc": 1649632620.0,
                    "replies": [
                        {
                            "body": "hope she can appear in that show..really want to see her in this show 😍..she write a song for lee ki chan (one room), and she also made a collaboration with choi button (producer).. in \"problem child in house\" show she mention that she already registered as a lyricist.",
                            "author": "Next_Topic3790",
                            "id": "i48xnnb",
                            "parent_id": "t1_i484pyn",
                            "score": 4,
                            "created_utc": 1649646326.0,
                            "replies": []
                        },
                        {
                            "body": "She helped write a song for her team, just like everyone contributed to creating songs for their team performances. I'm not trying to insult her but realistically there's no reason to cast her when they can get far more established writers\n\nedit: wording",
                            "author": "magablossom",
                            "id": "i485m6w",
                            "parent_id": "t1_i484pyn",
                            "score": -7,
                            "created_utc": 1649633028.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Yeah anyone who follows HYDP music group projects  would know this fact. They tend to entrust wrting the song to established composers. I don't even know why you are getting downvoted lol.\n\nEdit: Seriously, RM fandom is so emotional lol.",
                    "author": "whitefang0824",
                    "id": "i490mv8",
                    "parent_id": "t1_i482zp0",
                    "score": -6,
                    "created_utc": 1649647887.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "yes, same with me..really want her to cameo on this show..all this time its only her voice tho😂..when this show started jae suk  call her for relay camera segment.",
            "author": "Next_Topic3790",
            "id": "i49agln",
            "parent_id": "t1_i4989ua",
            "score": 5,
            "created_utc": 1649653704.0,
            "replies": []
        },
        {
            "body": "The subs came out a few hours ago and is available on legit streaming services and will probably be on the *other* ones later today. If you want to manually download the ep+subs you can check out the thread on /r/koreanvariety",
            "author": "creezle",
            "id": "i46bfuf",
            "parent_id": "t1_i4640gh",
            "score": 6,
            "created_utc": 1649605409.0,
            "replies": [
                {
                    "body": "Thank youu",
                    "author": "pake19",
                    "id": "i46bnwq",
                    "parent_id": "t1_i46bfuf",
                    "score": 0,
                    "created_utc": 1649605497.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "it could be just the scheduling times clashing/causing a conflict with her rehab etc. since yjs is on sixth sense you would think it would be a different time scheduled than hdyp",
            "author": "Cedosg",
            "id": "i46fvv1",
            "parent_id": "t1_i46c69a",
            "score": 7,
            "created_utc": 1649607194.0,
            "replies": [
                {
                    "body": "I'd love if that were the case but I think the group coordinates outside of recording hours as well so it could be a time commitment issue.",
                    "author": "creezle",
                    "id": "i46kye2",
                    "parent_id": "t1_i46fvv1",
                    "score": 0,
                    "created_utc": 1649609207.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yang Sechan and Hwang Jesung auditioned for MSG Wannabe as their Psychorus persona. While they were instantly eliminated, their segment was still funny. Do Kyungwan got eliminated too cuz he sounded so much like Kim Jungmin. Yet that reveal was one of the funniest bits in the entire MSG Wannabe saga.\n\nIf time allows, 100% there's comedic value in Somin attending the audition even if she gets eliminated.",
            "author": "SuddenBag",
            "id": "i49j7jw",
            "parent_id": "t1_i482y3f",
            "score": 11,
            "created_utc": 1649659997.0,
            "replies": [
                {
                    "body": "hwang jesung actually got in the top 9 but he couldn't fit it into his schedule.",
                    "author": "Cedosg",
                    "id": "i4agr3b",
                    "parent_id": "t1_i49j7jw",
                    "score": 3,
                    "created_utc": 1649683079.0,
                    "replies": []
                },
                {
                    "body": "Psychorus is a musical group. Do Kyungwan can sing (so well that he got mistaken for an actual singer). So technically, there was valid reason to invite both to audition. I understand your viewpoint about comedic value, but JSM falls in neither category.",
                    "author": "magablossom",
                    "id": "i49jkcv",
                    "parent_id": "t1_i49j7jw",
                    "score": -6,
                    "created_utc": 1649660278.0,
                    "replies": [
                        {
                            "body": "Psychorus is a *comedic* musical group. Their audition for MSG Wannabe fell apart pretty quickly. And that's fine cuz it's funny.\n\nHDYP is a variety show, it's not a musical competition. Sure, serious singers are needed, but there's nothing wrong with someone who isn't a super good singer attending as long as that segment is funny.",
                            "author": "SuddenBag",
                            "id": "i49k1ph",
                            "parent_id": "t1_i49jkcv",
                            "score": 8,
                            "created_utc": 1649660655.0,
                            "replies": [
                                {
                                    "body": "I'd argue they had more room for comedic segments last time, hence why we got Psychorus. The competition is likely greater this time. Also JSM has never given any indication that she wants to be a singer. Why the insistence that she appear? Even if someone was to appear for a comedic segment, shouldn't they at least have singing or musical aspirations?\n\nedit: added sentences",
                                    "author": "magablossom",
                                    "id": "i49kuie",
                                    "parent_id": "t1_i49k1ph",
                                    "score": -5,
                                    "created_utc": 1649661296.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "there is 2 actors  in MSG Wannabe (previous project). lee sang yi and lee dong hwi",
            "author": "Next_Topic3790",
            "id": "i48vpz1",
            "parent_id": "t1_i482y3f",
            "score": 2,
            "created_utc": 1649645345.0,
            "replies": [
                {
                    "body": "They're both very skilled at singing",
                    "author": "magablossom",
                    "id": "i48wvz8",
                    "parent_id": "t1_i48vpz1",
                    "score": -6,
                    "created_utc": 1649645934.0,
                    "replies": [
                        {
                            "body": " they can sing but  still  not a singer ..U said somin can not joint coz she is not a singer ( actually she already have a song with shinhwa kim dong wan) .. mi joo also said somin can sing..so somin can still participate if she want..",
                            "author": "Next_Topic3790",
                            "id": "i48zamh",
                            "parent_id": "t1_i48wvz8",
                            "score": 6,
                            "created_utc": 1649647181.0,
                            "replies": [
                                {
                                    "body": "My point is that it would be a waste of time for JSM (of course she's free to participate if she's invited). She's not exactly a strong vocalist and she's never pretended to be one. Someone like LSB, as Mijoo mentioned, has a strong chance though.\n\nedit: word",
                                    "author": "magablossom",
                                    "id": "i490v1t",
                                    "parent_id": "t1_i48zamh",
                                    "score": -3,
                                    "created_utc": 1649648010.0,
                                    "replies": [
                                        {
                                            "body": "so now move to  lee sun bin?..sun bin can sing? somin also, sun bin can dance? somin also, sun bin got trained? somin also....haha...just said u dont like somin to participate....let the people in charge to judge them..not us..Lol🤣..Bye",
                                            "author": "Next_Topic3790",
                                            "id": "i49699d",
                                            "parent_id": "t1_i490v1t",
                                            "score": 10,
                                            "created_utc": 1649651082.0,
                                            "replies": [
                                                {
                                                    "body": "Both LSB and JSM have sung in the past. LSB has proven she has strong vocal skills while JSM is noticeably weaker and clearly not a singer. Watch the clip OP posted. YJS agreed that LSB was a good candidate but was surprised and unsure about JSM. Even Mijoo only mentioned emotions rather than vocal skill for JSM\n\nYou can argue about it all you want. Even if JSM auditions, she'll be disqualified. Accusing me of not wanting her to participate is nonsensical and won't change the facts. I said in another comment that it would be fun if she joined for an acting project; I have nothing against her\n\nedit: word",
                                                    "author": "magablossom",
                                                    "id": "i49i9hy",
                                                    "parent_id": "t1_i49699d",
                                                    "score": -2,
                                                    "created_utc": 1649659269.0,
                                                    "replies": [
                                                        {
                                                            "body": "enough that kjk invited her to sing in his concert. https://youtu.be/G3lRNfkh8gg",
                                                            "author": "Cedosg",
                                                            "id": "i4ah59q",
                                                            "parent_id": "t1_i49i9hy",
                                                            "score": 3,
                                                            "created_utc": 1649683259.0,
                                                            "replies": [
                                                                {
                                                                    "body": "because she’s a coworker and friend",
                                                                    "author": "magablossom",
                                                                    "id": "i4b92kb",
                                                                    "parent_id": "t1_i4ah59q",
                                                                    "score": 0,
                                                                    "created_utc": 1649694798.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "not for an actual concert that people pay for.",
                                                                            "author": "Cedosg",
                                                                            "id": "i4blel8",
                                                                            "parent_id": "t1_i4b92kb",
                                                                            "score": 0,
                                                                            "created_utc": 1649699425.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "What concert attendee wouldn’t enjoy seeing extra celebrities, regardless of whether they can sing or not? He invited Sechan too and a bunch of his celebrity friends who had time to appear. It was just for fun\n\nedit: added sentence",
                                                                                    "author": "magablossom",
                                                                                    "id": "i4dd3p7",
                                                                                    "parent_id": "t1_i4blel8",
                                                                                    "score": 1,
                                                                                    "created_utc": 1649726842.0,
                                                                                    "replies": [
                                                                                        {
                                                                                            "body": "the concert attendees that don't care about running man?\n\nsomin isn't that popular as a celebrity too.\n\nPS: Se Chan is actually a pretty decent rapper.",
                                                                                            "author": "Cedosg",
                                                                                            "id": "i4dgq5x",
                                                                                            "parent_id": "t1_i4dd3p7",
                                                                                            "score": 1,
                                                                                            "created_utc": 1649728407.0,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I’m not saying she’s the most experienced writer in the world but her experience isn’t limited to the RM project. She’s written music for 2 different musicians already.",
            "author": "RumblesFish",
            "id": "i48k6cj",
            "parent_id": "t1_i482zp0",
            "score": 9,
            "created_utc": 1649639851.0,
            "replies": [
                {
                    "body": "Co-writing a fanmeet song and working on a couple of projects that went largely unnoticed doesn't exactly boast experience. It's cute that she experimented with that though",
                    "author": "magablossom",
                    "id": "i48lz1b",
                    "parent_id": "t1_i48k6cj",
                    "score": -10,
                    "created_utc": 1649640694.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "They let her write it for running man. It's not like she'll be producing the music. She writes poetry, and they can take snippets from her just like running man did",
            "author": "pake19",
            "id": "i484pyn",
            "parent_id": "t1_i482zp0",
            "score": -2,
            "created_utc": 1649632620.0,
            "replies": [
                {
                    "body": "hope she can appear in that show..really want to see her in this show 😍..she write a song for lee ki chan (one room), and she also made a collaboration with choi button (producer).. in \"problem child in house\" show she mention that she already registered as a lyricist.",
                    "author": "Next_Topic3790",
                    "id": "i48xnnb",
                    "parent_id": "t1_i484pyn",
                    "score": 4,
                    "created_utc": 1649646326.0,
                    "replies": []
                },
                {
                    "body": "She helped write a song for her team, just like everyone contributed to creating songs for their team performances. I'm not trying to insult her but realistically there's no reason to cast her when they can get far more established writers\n\nedit: wording",
                    "author": "magablossom",
                    "id": "i485m6w",
                    "parent_id": "t1_i484pyn",
                    "score": -7,
                    "created_utc": 1649633028.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yeah anyone who follows HYDP music group projects  would know this fact. They tend to entrust wrting the song to established composers. I don't even know why you are getting downvoted lol.\n\nEdit: Seriously, RM fandom is so emotional lol.",
            "author": "whitefang0824",
            "id": "i490mv8",
            "parent_id": "t1_i482zp0",
            "score": -6,
            "created_utc": 1649647887.0,
            "replies": []
        },
        {
            "body": "Thank youu",
            "author": "pake19",
            "id": "i46bnwq",
            "parent_id": "t1_i46bfuf",
            "score": 0,
            "created_utc": 1649605497.0,
            "replies": []
        },
        {
            "body": "I'd love if that were the case but I think the group coordinates outside of recording hours as well so it could be a time commitment issue.",
            "author": "creezle",
            "id": "i46kye2",
            "parent_id": "t1_i46fvv1",
            "score": 0,
            "created_utc": 1649609207.0,
            "replies": []
        },
        {
            "body": "hwang jesung actually got in the top 9 but he couldn't fit it into his schedule.",
            "author": "Cedosg",
            "id": "i4agr3b",
            "parent_id": "t1_i49j7jw",
            "score": 3,
            "created_utc": 1649683079.0,
            "replies": []
        },
        {
            "body": "Psychorus is a musical group. Do Kyungwan can sing (so well that he got mistaken for an actual singer). So technically, there was valid reason to invite both to audition. I understand your viewpoint about comedic value, but JSM falls in neither category.",
            "author": "magablossom",
            "id": "i49jkcv",
            "parent_id": "t1_i49j7jw",
            "score": -6,
            "created_utc": 1649660278.0,
            "replies": [
                {
                    "body": "Psychorus is a *comedic* musical group. Their audition for MSG Wannabe fell apart pretty quickly. And that's fine cuz it's funny.\n\nHDYP is a variety show, it's not a musical competition. Sure, serious singers are needed, but there's nothing wrong with someone who isn't a super good singer attending as long as that segment is funny.",
                    "author": "SuddenBag",
                    "id": "i49k1ph",
                    "parent_id": "t1_i49jkcv",
                    "score": 8,
                    "created_utc": 1649660655.0,
                    "replies": [
                        {
                            "body": "I'd argue they had more room for comedic segments last time, hence why we got Psychorus. The competition is likely greater this time. Also JSM has never given any indication that she wants to be a singer. Why the insistence that she appear? Even if someone was to appear for a comedic segment, shouldn't they at least have singing or musical aspirations?\n\nedit: added sentences",
                            "author": "magablossom",
                            "id": "i49kuie",
                            "parent_id": "t1_i49k1ph",
                            "score": -5,
                            "created_utc": 1649661296.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "They're both very skilled at singing",
            "author": "magablossom",
            "id": "i48wvz8",
            "parent_id": "t1_i48vpz1",
            "score": -6,
            "created_utc": 1649645934.0,
            "replies": [
                {
                    "body": " they can sing but  still  not a singer ..U said somin can not joint coz she is not a singer ( actually she already have a song with shinhwa kim dong wan) .. mi joo also said somin can sing..so somin can still participate if she want..",
                    "author": "Next_Topic3790",
                    "id": "i48zamh",
                    "parent_id": "t1_i48wvz8",
                    "score": 6,
                    "created_utc": 1649647181.0,
                    "replies": [
                        {
                            "body": "My point is that it would be a waste of time for JSM (of course she's free to participate if she's invited). She's not exactly a strong vocalist and she's never pretended to be one. Someone like LSB, as Mijoo mentioned, has a strong chance though.\n\nedit: word",
                            "author": "magablossom",
                            "id": "i490v1t",
                            "parent_id": "t1_i48zamh",
                            "score": -3,
                            "created_utc": 1649648010.0,
                            "replies": [
                                {
                                    "body": "so now move to  lee sun bin?..sun bin can sing? somin also, sun bin can dance? somin also, sun bin got trained? somin also....haha...just said u dont like somin to participate....let the people in charge to judge them..not us..Lol🤣..Bye",
                                    "author": "Next_Topic3790",
                                    "id": "i49699d",
                                    "parent_id": "t1_i490v1t",
                                    "score": 10,
                                    "created_utc": 1649651082.0,
                                    "replies": [
                                        {
                                            "body": "Both LSB and JSM have sung in the past. LSB has proven she has strong vocal skills while JSM is noticeably weaker and clearly not a singer. Watch the clip OP posted. YJS agreed that LSB was a good candidate but was surprised and unsure about JSM. Even Mijoo only mentioned emotions rather than vocal skill for JSM\n\nYou can argue about it all you want. Even if JSM auditions, she'll be disqualified. Accusing me of not wanting her to participate is nonsensical and won't change the facts. I said in another comment that it would be fun if she joined for an acting project; I have nothing against her\n\nedit: word",
                                            "author": "magablossom",
                                            "id": "i49i9hy",
                                            "parent_id": "t1_i49699d",
                                            "score": -2,
                                            "created_utc": 1649659269.0,
                                            "replies": [
                                                {
                                                    "body": "enough that kjk invited her to sing in his concert. https://youtu.be/G3lRNfkh8gg",
                                                    "author": "Cedosg",
                                                    "id": "i4ah59q",
                                                    "parent_id": "t1_i49i9hy",
                                                    "score": 3,
                                                    "created_utc": 1649683259.0,
                                                    "replies": [
                                                        {
                                                            "body": "because she’s a coworker and friend",
                                                            "author": "magablossom",
                                                            "id": "i4b92kb",
                                                            "parent_id": "t1_i4ah59q",
                                                            "score": 0,
                                                            "created_utc": 1649694798.0,
                                                            "replies": [
                                                                {
                                                                    "body": "not for an actual concert that people pay for.",
                                                                    "author": "Cedosg",
                                                                    "id": "i4blel8",
                                                                    "parent_id": "t1_i4b92kb",
                                                                    "score": 0,
                                                                    "created_utc": 1649699425.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "What concert attendee wouldn’t enjoy seeing extra celebrities, regardless of whether they can sing or not? He invited Sechan too and a bunch of his celebrity friends who had time to appear. It was just for fun\n\nedit: added sentence",
                                                                            "author": "magablossom",
                                                                            "id": "i4dd3p7",
                                                                            "parent_id": "t1_i4blel8",
                                                                            "score": 1,
                                                                            "created_utc": 1649726842.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "the concert attendees that don't care about running man?\n\nsomin isn't that popular as a celebrity too.\n\nPS: Se Chan is actually a pretty decent rapper.",
                                                                                    "author": "Cedosg",
                                                                                    "id": "i4dgq5x",
                                                                                    "parent_id": "t1_i4dd3p7",
                                                                                    "score": 1,
                                                                                    "created_utc": 1649728407.0,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Co-writing a fanmeet song and working on a couple of projects that went largely unnoticed doesn't exactly boast experience. It's cute that she experimented with that though",
            "author": "magablossom",
            "id": "i48lz1b",
            "parent_id": "t1_i48k6cj",
            "score": -10,
            "created_utc": 1649640694.0,
            "replies": []
        },
        {
            "body": "hope she can appear in that show..really want to see her in this show 😍..she write a song for lee ki chan (one room), and she also made a collaboration with choi button (producer).. in \"problem child in house\" show she mention that she already registered as a lyricist.",
            "author": "Next_Topic3790",
            "id": "i48xnnb",
            "parent_id": "t1_i484pyn",
            "score": 4,
            "created_utc": 1649646326.0,
            "replies": []
        },
        {
            "body": "She helped write a song for her team, just like everyone contributed to creating songs for their team performances. I'm not trying to insult her but realistically there's no reason to cast her when they can get far more established writers\n\nedit: wording",
            "author": "magablossom",
            "id": "i485m6w",
            "parent_id": "t1_i484pyn",
            "score": -7,
            "created_utc": 1649633028.0,
            "replies": []
        },
        {
            "body": "Psychorus is a *comedic* musical group. Their audition for MSG Wannabe fell apart pretty quickly. And that's fine cuz it's funny.\n\nHDYP is a variety show, it's not a musical competition. Sure, serious singers are needed, but there's nothing wrong with someone who isn't a super good singer attending as long as that segment is funny.",
            "author": "SuddenBag",
            "id": "i49k1ph",
            "parent_id": "t1_i49jkcv",
            "score": 8,
            "created_utc": 1649660655.0,
            "replies": [
                {
                    "body": "I'd argue they had more room for comedic segments last time, hence why we got Psychorus. The competition is likely greater this time. Also JSM has never given any indication that she wants to be a singer. Why the insistence that she appear? Even if someone was to appear for a comedic segment, shouldn't they at least have singing or musical aspirations?\n\nedit: added sentences",
                    "author": "magablossom",
                    "id": "i49kuie",
                    "parent_id": "t1_i49k1ph",
                    "score": -5,
                    "created_utc": 1649661296.0,
                    "replies": []
                }
            ]
        },
        {
            "body": " they can sing but  still  not a singer ..U said somin can not joint coz she is not a singer ( actually she already have a song with shinhwa kim dong wan) .. mi joo also said somin can sing..so somin can still participate if she want..",
            "author": "Next_Topic3790",
            "id": "i48zamh",
            "parent_id": "t1_i48wvz8",
            "score": 6,
            "created_utc": 1649647181.0,
            "replies": [
                {
                    "body": "My point is that it would be a waste of time for JSM (of course she's free to participate if she's invited). She's not exactly a strong vocalist and she's never pretended to be one. Someone like LSB, as Mijoo mentioned, has a strong chance though.\n\nedit: word",
                    "author": "magablossom",
                    "id": "i490v1t",
                    "parent_id": "t1_i48zamh",
                    "score": -3,
                    "created_utc": 1649648010.0,
                    "replies": [
                        {
                            "body": "so now move to  lee sun bin?..sun bin can sing? somin also, sun bin can dance? somin also, sun bin got trained? somin also....haha...just said u dont like somin to participate....let the people in charge to judge them..not us..Lol🤣..Bye",
                            "author": "Next_Topic3790",
                            "id": "i49699d",
                            "parent_id": "t1_i490v1t",
                            "score": 10,
                            "created_utc": 1649651082.0,
                            "replies": [
                                {
                                    "body": "Both LSB and JSM have sung in the past. LSB has proven she has strong vocal skills while JSM is noticeably weaker and clearly not a singer. Watch the clip OP posted. YJS agreed that LSB was a good candidate but was surprised and unsure about JSM. Even Mijoo only mentioned emotions rather than vocal skill for JSM\n\nYou can argue about it all you want. Even if JSM auditions, she'll be disqualified. Accusing me of not wanting her to participate is nonsensical and won't change the facts. I said in another comment that it would be fun if she joined for an acting project; I have nothing against her\n\nedit: word",
                                    "author": "magablossom",
                                    "id": "i49i9hy",
                                    "parent_id": "t1_i49699d",
                                    "score": -2,
                                    "created_utc": 1649659269.0,
                                    "replies": [
                                        {
                                            "body": "enough that kjk invited her to sing in his concert. https://youtu.be/G3lRNfkh8gg",
                                            "author": "Cedosg",
                                            "id": "i4ah59q",
                                            "parent_id": "t1_i49i9hy",
                                            "score": 3,
                                            "created_utc": 1649683259.0,
                                            "replies": [
                                                {
                                                    "body": "because she’s a coworker and friend",
                                                    "author": "magablossom",
                                                    "id": "i4b92kb",
                                                    "parent_id": "t1_i4ah59q",
                                                    "score": 0,
                                                    "created_utc": 1649694798.0,
                                                    "replies": [
                                                        {
                                                            "body": "not for an actual concert that people pay for.",
                                                            "author": "Cedosg",
                                                            "id": "i4blel8",
                                                            "parent_id": "t1_i4b92kb",
                                                            "score": 0,
                                                            "created_utc": 1649699425.0,
                                                            "replies": [
                                                                {
                                                                    "body": "What concert attendee wouldn’t enjoy seeing extra celebrities, regardless of whether they can sing or not? He invited Sechan too and a bunch of his celebrity friends who had time to appear. It was just for fun\n\nedit: added sentence",
                                                                    "author": "magablossom",
                                                                    "id": "i4dd3p7",
                                                                    "parent_id": "t1_i4blel8",
                                                                    "score": 1,
                                                                    "created_utc": 1649726842.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "the concert attendees that don't care about running man?\n\nsomin isn't that popular as a celebrity too.\n\nPS: Se Chan is actually a pretty decent rapper.",
                                                                            "author": "Cedosg",
                                                                            "id": "i4dgq5x",
                                                                            "parent_id": "t1_i4dd3p7",
                                                                            "score": 1,
                                                                            "created_utc": 1649728407.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I'd argue they had more room for comedic segments last time, hence why we got Psychorus. The competition is likely greater this time. Also JSM has never given any indication that she wants to be a singer. Why the insistence that she appear? Even if someone was to appear for a comedic segment, shouldn't they at least have singing or musical aspirations?\n\nedit: added sentences",
            "author": "magablossom",
            "id": "i49kuie",
            "parent_id": "t1_i49k1ph",
            "score": -5,
            "created_utc": 1649661296.0,
            "replies": []
        },
        {
            "body": "My point is that it would be a waste of time for JSM (of course she's free to participate if she's invited). She's not exactly a strong vocalist and she's never pretended to be one. Someone like LSB, as Mijoo mentioned, has a strong chance though.\n\nedit: word",
            "author": "magablossom",
            "id": "i490v1t",
            "parent_id": "t1_i48zamh",
            "score": -3,
            "created_utc": 1649648010.0,
            "replies": [
                {
                    "body": "so now move to  lee sun bin?..sun bin can sing? somin also, sun bin can dance? somin also, sun bin got trained? somin also....haha...just said u dont like somin to participate....let the people in charge to judge them..not us..Lol🤣..Bye",
                    "author": "Next_Topic3790",
                    "id": "i49699d",
                    "parent_id": "t1_i490v1t",
                    "score": 10,
                    "created_utc": 1649651082.0,
                    "replies": [
                        {
                            "body": "Both LSB and JSM have sung in the past. LSB has proven she has strong vocal skills while JSM is noticeably weaker and clearly not a singer. Watch the clip OP posted. YJS agreed that LSB was a good candidate but was surprised and unsure about JSM. Even Mijoo only mentioned emotions rather than vocal skill for JSM\n\nYou can argue about it all you want. Even if JSM auditions, she'll be disqualified. Accusing me of not wanting her to participate is nonsensical and won't change the facts. I said in another comment that it would be fun if she joined for an acting project; I have nothing against her\n\nedit: word",
                            "author": "magablossom",
                            "id": "i49i9hy",
                            "parent_id": "t1_i49699d",
                            "score": -2,
                            "created_utc": 1649659269.0,
                            "replies": [
                                {
                                    "body": "enough that kjk invited her to sing in his concert. https://youtu.be/G3lRNfkh8gg",
                                    "author": "Cedosg",
                                    "id": "i4ah59q",
                                    "parent_id": "t1_i49i9hy",
                                    "score": 3,
                                    "created_utc": 1649683259.0,
                                    "replies": [
                                        {
                                            "body": "because she’s a coworker and friend",
                                            "author": "magablossom",
                                            "id": "i4b92kb",
                                            "parent_id": "t1_i4ah59q",
                                            "score": 0,
                                            "created_utc": 1649694798.0,
                                            "replies": [
                                                {
                                                    "body": "not for an actual concert that people pay for.",
                                                    "author": "Cedosg",
                                                    "id": "i4blel8",
                                                    "parent_id": "t1_i4b92kb",
                                                    "score": 0,
                                                    "created_utc": 1649699425.0,
                                                    "replies": [
                                                        {
                                                            "body": "What concert attendee wouldn’t enjoy seeing extra celebrities, regardless of whether they can sing or not? He invited Sechan too and a bunch of his celebrity friends who had time to appear. It was just for fun\n\nedit: added sentence",
                                                            "author": "magablossom",
                                                            "id": "i4dd3p7",
                                                            "parent_id": "t1_i4blel8",
                                                            "score": 1,
                                                            "created_utc": 1649726842.0,
                                                            "replies": [
                                                                {
                                                                    "body": "the concert attendees that don't care about running man?\n\nsomin isn't that popular as a celebrity too.\n\nPS: Se Chan is actually a pretty decent rapper.",
                                                                    "author": "Cedosg",
                                                                    "id": "i4dgq5x",
                                                                    "parent_id": "t1_i4dd3p7",
                                                                    "score": 1,
                                                                    "created_utc": 1649728407.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "so now move to  lee sun bin?..sun bin can sing? somin also, sun bin can dance? somin also, sun bin got trained? somin also....haha...just said u dont like somin to participate....let the people in charge to judge them..not us..Lol🤣..Bye",
            "author": "Next_Topic3790",
            "id": "i49699d",
            "parent_id": "t1_i490v1t",
            "score": 10,
            "created_utc": 1649651082.0,
            "replies": [
                {
                    "body": "Both LSB and JSM have sung in the past. LSB has proven she has strong vocal skills while JSM is noticeably weaker and clearly not a singer. Watch the clip OP posted. YJS agreed that LSB was a good candidate but was surprised and unsure about JSM. Even Mijoo only mentioned emotions rather than vocal skill for JSM\n\nYou can argue about it all you want. Even if JSM auditions, she'll be disqualified. Accusing me of not wanting her to participate is nonsensical and won't change the facts. I said in another comment that it would be fun if she joined for an acting project; I have nothing against her\n\nedit: word",
                    "author": "magablossom",
                    "id": "i49i9hy",
                    "parent_id": "t1_i49699d",
                    "score": -2,
                    "created_utc": 1649659269.0,
                    "replies": [
                        {
                            "body": "enough that kjk invited her to sing in his concert. https://youtu.be/G3lRNfkh8gg",
                            "author": "Cedosg",
                            "id": "i4ah59q",
                            "parent_id": "t1_i49i9hy",
                            "score": 3,
                            "created_utc": 1649683259.0,
                            "replies": [
                                {
                                    "body": "because she’s a coworker and friend",
                                    "author": "magablossom",
                                    "id": "i4b92kb",
                                    "parent_id": "t1_i4ah59q",
                                    "score": 0,
                                    "created_utc": 1649694798.0,
                                    "replies": [
                                        {
                                            "body": "not for an actual concert that people pay for.",
                                            "author": "Cedosg",
                                            "id": "i4blel8",
                                            "parent_id": "t1_i4b92kb",
                                            "score": 0,
                                            "created_utc": 1649699425.0,
                                            "replies": [
                                                {
                                                    "body": "What concert attendee wouldn’t enjoy seeing extra celebrities, regardless of whether they can sing or not? He invited Sechan too and a bunch of his celebrity friends who had time to appear. It was just for fun\n\nedit: added sentence",
                                                    "author": "magablossom",
                                                    "id": "i4dd3p7",
                                                    "parent_id": "t1_i4blel8",
                                                    "score": 1,
                                                    "created_utc": 1649726842.0,
                                                    "replies": [
                                                        {
                                                            "body": "the concert attendees that don't care about running man?\n\nsomin isn't that popular as a celebrity too.\n\nPS: Se Chan is actually a pretty decent rapper.",
                                                            "author": "Cedosg",
                                                            "id": "i4dgq5x",
                                                            "parent_id": "t1_i4dd3p7",
                                                            "score": 1,
                                                            "created_utc": 1649728407.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Both LSB and JSM have sung in the past. LSB has proven she has strong vocal skills while JSM is noticeably weaker and clearly not a singer. Watch the clip OP posted. YJS agreed that LSB was a good candidate but was surprised and unsure about JSM. Even Mijoo only mentioned emotions rather than vocal skill for JSM\n\nYou can argue about it all you want. Even if JSM auditions, she'll be disqualified. Accusing me of not wanting her to participate is nonsensical and won't change the facts. I said in another comment that it would be fun if she joined for an acting project; I have nothing against her\n\nedit: word",
            "author": "magablossom",
            "id": "i49i9hy",
            "parent_id": "t1_i49699d",
            "score": -2,
            "created_utc": 1649659269.0,
            "replies": [
                {
                    "body": "enough that kjk invited her to sing in his concert. https://youtu.be/G3lRNfkh8gg",
                    "author": "Cedosg",
                    "id": "i4ah59q",
                    "parent_id": "t1_i49i9hy",
                    "score": 3,
                    "created_utc": 1649683259.0,
                    "replies": [
                        {
                            "body": "because she’s a coworker and friend",
                            "author": "magablossom",
                            "id": "i4b92kb",
                            "parent_id": "t1_i4ah59q",
                            "score": 0,
                            "created_utc": 1649694798.0,
                            "replies": [
                                {
                                    "body": "not for an actual concert that people pay for.",
                                    "author": "Cedosg",
                                    "id": "i4blel8",
                                    "parent_id": "t1_i4b92kb",
                                    "score": 0,
                                    "created_utc": 1649699425.0,
                                    "replies": [
                                        {
                                            "body": "What concert attendee wouldn’t enjoy seeing extra celebrities, regardless of whether they can sing or not? He invited Sechan too and a bunch of his celebrity friends who had time to appear. It was just for fun\n\nedit: added sentence",
                                            "author": "magablossom",
                                            "id": "i4dd3p7",
                                            "parent_id": "t1_i4blel8",
                                            "score": 1,
                                            "created_utc": 1649726842.0,
                                            "replies": [
                                                {
                                                    "body": "the concert attendees that don't care about running man?\n\nsomin isn't that popular as a celebrity too.\n\nPS: Se Chan is actually a pretty decent rapper.",
                                                    "author": "Cedosg",
                                                    "id": "i4dgq5x",
                                                    "parent_id": "t1_i4dd3p7",
                                                    "score": 1,
                                                    "created_utc": 1649728407.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "enough that kjk invited her to sing in his concert. https://youtu.be/G3lRNfkh8gg",
            "author": "Cedosg",
            "id": "i4ah59q",
            "parent_id": "t1_i49i9hy",
            "score": 3,
            "created_utc": 1649683259.0,
            "replies": [
                {
                    "body": "because she’s a coworker and friend",
                    "author": "magablossom",
                    "id": "i4b92kb",
                    "parent_id": "t1_i4ah59q",
                    "score": 0,
                    "created_utc": 1649694798.0,
                    "replies": [
                        {
                            "body": "not for an actual concert that people pay for.",
                            "author": "Cedosg",
                            "id": "i4blel8",
                            "parent_id": "t1_i4b92kb",
                            "score": 0,
                            "created_utc": 1649699425.0,
                            "replies": [
                                {
                                    "body": "What concert attendee wouldn’t enjoy seeing extra celebrities, regardless of whether they can sing or not? He invited Sechan too and a bunch of his celebrity friends who had time to appear. It was just for fun\n\nedit: added sentence",
                                    "author": "magablossom",
                                    "id": "i4dd3p7",
                                    "parent_id": "t1_i4blel8",
                                    "score": 1,
                                    "created_utc": 1649726842.0,
                                    "replies": [
                                        {
                                            "body": "the concert attendees that don't care about running man?\n\nsomin isn't that popular as a celebrity too.\n\nPS: Se Chan is actually a pretty decent rapper.",
                                            "author": "Cedosg",
                                            "id": "i4dgq5x",
                                            "parent_id": "t1_i4dd3p7",
                                            "score": 1,
                                            "created_utc": 1649728407.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "because she’s a coworker and friend",
            "author": "magablossom",
            "id": "i4b92kb",
            "parent_id": "t1_i4ah59q",
            "score": 0,
            "created_utc": 1649694798.0,
            "replies": [
                {
                    "body": "not for an actual concert that people pay for.",
                    "author": "Cedosg",
                    "id": "i4blel8",
                    "parent_id": "t1_i4b92kb",
                    "score": 0,
                    "created_utc": 1649699425.0,
                    "replies": [
                        {
                            "body": "What concert attendee wouldn’t enjoy seeing extra celebrities, regardless of whether they can sing or not? He invited Sechan too and a bunch of his celebrity friends who had time to appear. It was just for fun\n\nedit: added sentence",
                            "author": "magablossom",
                            "id": "i4dd3p7",
                            "parent_id": "t1_i4blel8",
                            "score": 1,
                            "created_utc": 1649726842.0,
                            "replies": [
                                {
                                    "body": "the concert attendees that don't care about running man?\n\nsomin isn't that popular as a celebrity too.\n\nPS: Se Chan is actually a pretty decent rapper.",
                                    "author": "Cedosg",
                                    "id": "i4dgq5x",
                                    "parent_id": "t1_i4dd3p7",
                                    "score": 1,
                                    "created_utc": 1649728407.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "not for an actual concert that people pay for.",
            "author": "Cedosg",
            "id": "i4blel8",
            "parent_id": "t1_i4b92kb",
            "score": 0,
            "created_utc": 1649699425.0,
            "replies": [
                {
                    "body": "What concert attendee wouldn’t enjoy seeing extra celebrities, regardless of whether they can sing or not? He invited Sechan too and a bunch of his celebrity friends who had time to appear. It was just for fun\n\nedit: added sentence",
                    "author": "magablossom",
                    "id": "i4dd3p7",
                    "parent_id": "t1_i4blel8",
                    "score": 1,
                    "created_utc": 1649726842.0,
                    "replies": [
                        {
                            "body": "the concert attendees that don't care about running man?\n\nsomin isn't that popular as a celebrity too.\n\nPS: Se Chan is actually a pretty decent rapper.",
                            "author": "Cedosg",
                            "id": "i4dgq5x",
                            "parent_id": "t1_i4dd3p7",
                            "score": 1,
                            "created_utc": 1649728407.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "What concert attendee wouldn’t enjoy seeing extra celebrities, regardless of whether they can sing or not? He invited Sechan too and a bunch of his celebrity friends who had time to appear. It was just for fun\n\nedit: added sentence",
            "author": "magablossom",
            "id": "i4dd3p7",
            "parent_id": "t1_i4blel8",
            "score": 1,
            "created_utc": 1649726842.0,
            "replies": [
                {
                    "body": "the concert attendees that don't care about running man?\n\nsomin isn't that popular as a celebrity too.\n\nPS: Se Chan is actually a pretty decent rapper.",
                    "author": "Cedosg",
                    "id": "i4dgq5x",
                    "parent_id": "t1_i4dd3p7",
                    "score": 1,
                    "created_utc": 1649728407.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "the concert attendees that don't care about running man?\n\nsomin isn't that popular as a celebrity too.\n\nPS: Se Chan is actually a pretty decent rapper.",
            "author": "Cedosg",
            "id": "i4dgq5x",
            "parent_id": "t1_i4dd3p7",
            "score": 1,
            "created_utc": 1649728407.0,
            "replies": []
        }
    ]
}