{
    "title": "My TJMaxx test:",
    "post_id": "n3j5cm",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/n3j5cm/my_tjmaxx_test/",
    "author": "GenIISD",
    "body": "TJMaxx has almost everything, and some of the brands are pretty acceptable (Polo RL, Coach, MK, Kate Spade, Lauren RL, etc.). Also, I’m not anywhere near the shopping that a place like LA, NYC, Chicago or even Atlanta or WPB would provide, so a TJMaxx tends to compete with the same brands as the nicest department stores in my area.\n\nWith that background to hopefully avoid being judged as cheap, after a M&G if things went well, I enjoy suggesting shopping at a TJMaxx to keep the date going. We then play some variation of 20 questions to help me figure out what I’m going to get for her. The rules are after the last question is asked, I have to make the decision without any more feedback from her. It’s generally playful, allows for a bit of flirting and shoulder brushes/physical closeness and really puts a good gauge on chemistry in addition to showing you’re willing to invest time to get to know about her. \n\nAlso, between their handbags, luggage, clothing, jewelry and unique cuisine options (one time I built an Italian food “basket” with a pasta pot because that fit what the answers led to, and she loved it); normally you can find a nice 50-150 item(s) to get that the POT SB will like/use. Aside from the SDs that absolutely cannot stand going shopping, it is a great chance to spend 30-60 minutes learning about her favorite color, favorite precious metal, favorite body care scent, etc. If the shopping trip isn’t that enjoyable of a time, a SR probably isn’t going to be that great either.\n\nAnd to make sure it is clear, it isn’t a test for the SB, it is a test for chemistry. It is also the only place anywhere close that sells the name brands listed above, so it is a “great” option considering the local options. Best wishes to all, thank you for coming to my dread talk and stay well!",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/n3j5cm/my_tjmaxx_test/",
    "score": 142,
    "upvote_ratio": 0.88,
    "created_utc": 1619999572.0,
    "num_comments": 111,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "This is hella cute.\n\nEdit: And I love TJMaxx; I never walk out of there unhappy lmao. Their beauty and candle sections >>>>>>",
            "author": null,
            "id": "gwqckoi",
            "parent_id": "t3_n3j5cm",
            "score": 81,
            "created_utc": 1620004316.0,
            "replies": [
                {
                    "body": "Such a cute idea. Honestly, just the thoughtfulness alone of it not even the gifts would make me gush a bit. Great idea OP.",
                    "author": "tattoosandtail",
                    "id": "gwqzj00",
                    "parent_id": "t1_gwqckoi",
                    "score": 24,
                    "created_utc": 1620018364.0,
                    "replies": [
                        {
                            "body": "Thank you both for your kind words. Feels good knowing this is some SBs reaction to this approach. \n\nThe last time I did this, and I’m hoping things work out into a long term arrangement, the way the pot started looking at me about half way through is the only time I’ve ever had flashbacks to when my late fiancé would look at me when I was flirting with her. \n\nA pot that doesn’t appreciate a gift worth ten to thirty Starbucks drinks for just the M&G is definitely wanting to experience a different place in the bowl than where I hang.",
                            "author": "GenIISD",
                            "id": "gwtdsbj",
                            "parent_id": "t1_gwqzj00",
                            "score": 4,
                            "created_utc": 1620068202.0,
                            "replies": [
                                {
                                    "body": "This is a super great idea. The extra time to test the chemistry, the playful flirtation, the getting to know little oddball things about one another. Ugh, my heart would melt. \n\nAnd I don’t understand why people were not understanding the kind of area that you’re in and why TJ Maxx is one of the best options. Not everything gotta come straight out of Louis Vuitton.",
                                    "author": null,
                                    "id": "gwvuol3",
                                    "parent_id": "t1_gwtdsbj",
                                    "score": 2,
                                    "created_utc": 1620116899.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Like some other SBs I feel rather conflicted about this approach. Initially I want to balk at the idea of this - a M&G is just as much about the SB sizing you up as you are her - how is taking her to an off-price discount store going to impress her or incentivize her to want to continue with a relationship with you?\n\nPurely from my perspective currently living in a major metropolitan area (but having come from the Midwest) I would take this suggestion to continue our M&G at a TJMaxx as a either a joke in poor taste or immediately assume he is broke and cannot actually afford to sugar date, which would immediately put an end to the M&G no matter how great it was going up until that point. (Not to mention stores like TJ Maxx are typically not well-kept and being in a dirty, disorganized store is not my idea of a fun time during a M&G; on my own time I’m happy to find a hidden gem of a deal between the office supplies and the seasonal decor, but during a M&G? No thanks.)\n\nThe POT would be better off not saying anything about TJMaxx or taking me shopping (not to mention getting into a car with a POT you just met is rather unsafe). If the POT really wanted to show his appreciation at the end of a M&G the most I would expect is a small cash gift, not an invitation to go shopping, even if it was for a designer something.\n\nNow the idea of a little 20 questions style date with a gift at the end is super cute! Maybe this could work better as a one-off platonic date after the M&G on a different date where you agree to meet at a somewhat nicer location (like if she already said something about home decor during the M&G, ask her to meet at a Pottery Barn, if she said something about cooking, baking or enjoying being in the kitchen, take her to a Williams Sonoma, said she likes gaming or photography, take her to an electronics store- there are lots of options outside of department stores that you may consider that would still be a better option than TJ Maxx).",
            "author": "GlitterAndSugar",
            "id": "gwsd9q2",
            "parent_id": "t3_n3j5cm",
            "score": 26,
            "created_utc": 1620052807.0,
            "replies": [
                {
                    "body": "I agree. The 20 questions idea is cute but I'd assume the guy is cheap. Brands like MK and Kate Spade are very cheap and accessible.  I would rather have the monetary value and buy things I love or need instead of random junk",
                    "author": "MJline",
                    "id": "gwuv23i",
                    "parent_id": "t1_gwsd9q2",
                    "score": 8,
                    "created_utc": 1620092672.0,
                    "replies": []
                },
                {
                    "body": "100% on the thought process, but Pottery Barn and William Sonoma are about 45 minutes away. There is a furniture store in town, but it closes at 6pm. Literally the options are Target, Walmart, TJM, dollar stores or driving over 30 minutes. It’s a very different pond than what most on here seem to have at their disposal.\n\n(And all the restaurants are 3-5 minutes from the TJM, which is actually kept clean and pretty organized compared to most I’ve been in, but with the close proximity we both drive ourselves vs. her getting in my vehicle.)",
                    "author": "GenIISD",
                    "id": "gwsfnck",
                    "parent_id": "t1_gwsd9q2",
                    "score": 3,
                    "created_utc": 1620053876.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Damn if I did that I’d be viewed as a Splenda daddy",
            "author": "UnearthlyDinosaur",
            "id": "gwqii8w",
            "parent_id": "t3_n3j5cm",
            "score": 49,
            "created_utc": 1620007589.0,
            "replies": [
                {
                    "body": "As someone from NYC and currently living in a high COLA, I’d feel very conflicted by this. On one hand, I can afford to take myself to TJ Maxx (and I do often - recently bought myself some Burberry perfume and candles, who doesn’t love a good deal!). But when I’m in an SR, I want to experience things that I wouldn’t be able to do on my own, and I’m not sure going to TJ Maxx is that. \n\nOn the other hand, I can always go for more candles and beauty products, and most of my past SDs never offer gifts or anything beyond dinner and our agreed upon PPM. I’d appreciate anything extra",
                    "author": "Dax-718",
                    "id": "gws293f",
                    "parent_id": "t1_gwqii8w",
                    "score": 21,
                    "created_utc": 1620047702.0,
                    "replies": [
                        {
                            "body": "It’s more about getting to know the POT than the actual shopping experience for me. And it is just an extension of the M&G. What’s her favorite body care scent, color, precious metal, handbag type, precious/semi-precious stone, etc. Knowing that allows me to get random things to pair with the PPM/allowance down the road and make it seem/feel less transactional. Who gives a prostitute a bottle of bubble bath in their favorite scent or an anklet made with gold/rose gold/white gold with a birthstone charm based on favorite precious metal? For me and for the people I’ve sugar dated, it’s a nice little extra that elevates the experience. To each their own, but I enjoy knowing enough to spoil with things that will be used and enjoyed.",
                            "author": "GenIISD",
                            "id": "gws9yt2",
                            "parent_id": "t1_gws293f",
                            "score": 5,
                            "created_utc": 1620051292.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Do you live somewhere where at 8p after you finish a sushi dinner, the only options within 30+ minutes are TJMaxx, Target or Walmart? Or I guess technically dollar general too. \n\nThe pond you’re fishing in makes a big difference as to whether this would be a Splenda or sugar tactic.",
                    "author": "GenIISD",
                    "id": "gwqlfwm",
                    "parent_id": "t1_gwqii8w",
                    "score": 29,
                    "created_utc": 1620009239.0,
                    "replies": [
                        {
                            "body": "Nah. I’m not. Thank God I’m not in the Midwest. The only possible benefit is the PPM is possibly lower but you also have way fewer SB because everyone is married.",
                            "author": "UnearthlyDinosaur",
                            "id": "gwqrzqt",
                            "parent_id": "t1_gwqlfwm",
                            "score": 8,
                            "created_utc": 1620013135.0,
                            "replies": [
                                {
                                    "body": "Being in a more rural, LCOL area is definitely an exchange. There are SBs/aspiring SBs on SLF that wouldn’t consider it a mall if it didn’t have Neiman Marcus. I do definitely enjoy malls with Burberry, Brooks Brothers, etc., but that isn’t M&G shopping from my view, and that option is hours away. The closest mall has the Boscov, Kohls, JCPenny vibe; and it’s still over 30 minutes away.",
                                    "author": "GenIISD",
                                    "id": "gwqtekd",
                                    "parent_id": "t1_gwqrzqt",
                                    "score": 5,
                                    "created_utc": 1620014047.0,
                                    "replies": []
                                },
                                {
                                    "body": "So true..",
                                    "author": "DarkandHandsome987",
                                    "id": "gws74pg",
                                    "parent_id": "t1_gwqrzqt",
                                    "score": 2,
                                    "created_utc": 1620049962.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "IDK, I’m in a major metro area and I’m still a basic bitch who loves Target! I think this sounds really cute and fun.",
                            "author": null,
                            "id": "gwujnbt",
                            "parent_id": "t1_gwqlfwm",
                            "score": 3,
                            "created_utc": 1620087140.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gwrd11q",
            "parent_id": "t3_n3j5cm",
            "score": 21,
            "created_utc": 1620030185.0,
            "replies": [
                {
                    "body": "Some TJ Maxxs are more organized but I’ve also been to ones where things are messy and all over the floor. It depends on the area…but yes the things there are things rejected from other stores. I like shopping there for myself for fun and good deals, but also think it’s a little bit of an odd choice for the first meeting",
                    "author": null,
                    "id": "gwrgz1o",
                    "parent_id": "t1_gwrd11q",
                    "score": 19,
                    "created_utc": 1620033978.0,
                    "replies": []
                },
                {
                    "body": "It is somewhat different on this side of the pond (I’ve popped into a couple in Europe, and they have a more “goodwill” vibe than the ones in the US). Seconds, obvious returns, and piles aren’t really the norm. TJM has also negotiated with certain companies to not be left as a retail arbitrage player but to be a wholesale buyer to keep their shelves stocked with the variety they want. So they get to buy direct from some brands and not just have slower moving designs from the previous year and seconds.",
                    "author": "GenIISD",
                    "id": "gwrzfpb",
                    "parent_id": "t1_gwrd11q",
                    "score": 1,
                    "created_utc": 1620046283.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "This is so cute.!\nAfter reading comments: I think ppl are not paying attention to the fact that he mentions that’s his best option in his area. Anyone can do the same “gift basket of things I’ve learned about you” with a different store as the base. The idea is super thoughtful and attentive. I look for attentiveness in a man. I like to know that when I speak he’s listening.",
            "author": "luhshawty",
            "id": "gws693m",
            "parent_id": "t3_n3j5cm",
            "score": 13,
            "created_utc": 1620049566.0,
            "replies": [
                {
                    "body": "Thank you for your kind words and attention to detail. Hope your day is beyond marvelous!",
                    "author": "GenIISD",
                    "id": "gwte7ho",
                    "parent_id": "t1_gws693m",
                    "score": 3,
                    "created_utc": 1620068380.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "If I were an SB and a POT wanted to take me to TJ Maxx I'm quite sure I'd \"next\" him.  \n\nI mean, sure, there are some bargains there. But is that the message any SD wants to send immediately??  Is that a message SB's likely want to hear right off the bat?\n\nMaybe as talk progresses and you both want to do that, why not. Once a connection is established, go together whereever you want! But I'd not lead with that.",
            "author": null,
            "id": "gwqh8bf",
            "parent_id": "t3_n3j5cm",
            "score": 27,
            "created_utc": 1620006889.0,
            "replies": [
                {
                    "body": "I feel that, and would be glad to suggest elsewhere if better options where anywhere close. No other place in town sells Polo Ralph Lauren or Coach. An average 1-bed apt is under a grand, so TJMaxx is a “meh” fish in a tiny pond.",
                    "author": "GenIISD",
                    "id": "gwqinsx",
                    "parent_id": "t1_gwqh8bf",
                    "score": 4,
                    "created_utc": 1620007674.0,
                    "replies": [
                        {
                            "body": "There’s no Nordstrom or Neiman Marcus or something like that where you are? Even Macy’s?",
                            "author": null,
                            "id": "gwrgsi5",
                            "parent_id": "t1_gwqinsx",
                            "score": 7,
                            "created_utc": 1620033803.0,
                            "replies": [
                                {
                                    "body": "Nope - it’s Target, Walmart, Dollar General and TJM. It is the nice place to shop in town, otherwise you’re driving over an hour round trip.",
                                    "author": "GenIISD",
                                    "id": "gwrxuk9",
                                    "parent_id": "t1_gwrgsi5",
                                    "score": 3,
                                    "created_utc": 1620045431.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "The ranges around here amaze me. Everything from “i bought my SB a Tesla to, i take my SB to TJ Maxx”\n\nSometimes i feel a bit of impostor syndrome being an SD but, being between a Tesla and TJMaxx, im alright i guess. lol",
            "author": "slfsd20201",
            "id": "gwqnpxi",
            "parent_id": "t3_n3j5cm",
            "score": 17,
            "created_utc": 1620010550.0,
            "replies": [
                {
                    "body": "I’ll totally jet my SB out to WBP or LA for a weekend of shopping and sunbathing and sex. But for a POT to get gifted 10-50% of her PPM ask as a gift at the M&G - that respectfully doesn’t seem to be something that should be viewed as the bottom of the experience range in the bowl.",
                    "author": "GenIISD",
                    "id": "gwqq1h1",
                    "parent_id": "t1_gwqnpxi",
                    "score": 9,
                    "created_utc": 1620011921.0,
                    "replies": [
                        {
                            "body": "Im just teasing! :)",
                            "author": "slfsd20201",
                            "id": "gwqrvyo",
                            "parent_id": "t1_gwqq1h1",
                            "score": 2,
                            "created_utc": 1620013069.0,
                            "replies": [
                                {
                                    "body": "All good!",
                                    "author": "GenIISD",
                                    "id": "gwqsffg",
                                    "parent_id": "t1_gwqrvyo",
                                    "score": 2,
                                    "created_utc": 1620013416.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "As an SB, I wouldn’t be a fan of this, and would prefer something else engaging, but if it works for you that is wonderful!\n\nI don’t want to be taken shopping, I’d rather do it solo. You have to know your audience :)",
            "author": "Cdnsugarr",
            "id": "gwq5ysc",
            "parent_id": "t3_n3j5cm",
            "score": 30,
            "created_utc": 1620000698.0,
            "replies": [
                {
                    "body": "Definitely have to know your audience, and have to mesh well too. Isn’t a right or wrong thing, but we probably wouldn’t discover a good arrangement just because I very much enjoy taking my SB shopping, and you very much prefer doing it solo. Blueberries and tangerines exist for a reason, and it’s okay if your favorite is not mine.",
                    "author": "GenIISD",
                    "id": "gwq75iv",
                    "parent_id": "t1_gwq5ysc",
                    "score": 12,
                    "created_utc": 1620001342.0,
                    "replies": [
                        {
                            "body": "Agreed! \n\nIt’s always just made me feel awkward. 😂",
                            "author": "Cdnsugarr",
                            "id": "gwq7bq1",
                            "parent_id": "t1_gwq75iv",
                            "score": 10,
                            "created_utc": 1620001436.0,
                            "replies": [
                                {
                                    "body": "Definitely a bad idea then, and if we ever meet and I ask if you’d like to do it, please turn me down? \n\nWhat are some other engaging activities that you would enjoy to keep a M&G going if things went well?",
                                    "author": "GenIISD",
                                    "id": "gwq8piu",
                                    "parent_id": "t1_gwq7bq1",
                                    "score": 0,
                                    "created_utc": 1620002189.0,
                                    "replies": [
                                        {
                                            "body": "Well, most of mine have just been coffee but we are super locked down still. \n\nI live in a city with a wonderful river valley and full\nOf trails so if it’s warm, it’s great to get outside! We have a street here that’s full of more unique shops (local art, used book store with a shop cat and a great selection of unique and rare books, delicious and varying street foods like Filipino iced cream!) that are lovely for just wandering and sparking conversation. \n\nHowever, for M&G I really don’t prefer it to be very long, personally.",
                                            "author": "Cdnsugarr",
                                            "id": "gwq9mi8",
                                            "parent_id": "t1_gwq8piu",
                                            "score": 3,
                                            "created_utc": 1620002694.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "I've suggested going on shopping dates for vanilla dates in the past and the vast majority of females are disinterested in shopping dates. But I have been on 2 with mixed results. (Costco date was meh and Frederick's of Hollywood date was awesome)\n\nBig respect for thinking out of the box and I may field test this myself. On a first sugar date I usually ask \"What kind of gifts do you like/want?\". And the answers I usually get are cash, CashApp or PayPal. I've only had one SB have a non-financial reply and that was for a strawberry shake from McDonald's.",
                    "author": "Ray2020K",
                    "id": "gws151j",
                    "parent_id": "t1_gwq5ysc",
                    "score": 1,
                    "created_utc": 1620047154.0,
                    "replies": [
                        {
                            "body": "I do love the creativity! And I do love wandering those stores aimlessly. I just don’t want to combine the two when I don’t know someone yet. 😂\n\nI think it’s hard to tell someone what kind of gifts you want unless everything is laid out for you. What’s the value, is it on top of ppm/allowance, those kinds of things.",
                            "author": "Cdnsugarr",
                            "id": "gwsgrxq",
                            "parent_id": "t1_gws151j",
                            "score": 1,
                            "created_utc": 1620054379.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "I find most women love to be taking shopping",
                    "author": null,
                    "id": "gwq71r6",
                    "parent_id": "t1_gwq5ysc",
                    "score": -4,
                    "created_utc": 1620001286.0,
                    "replies": [
                        {
                            "body": "I’m glad you know most women. You can keep me up to date on the changes in our collective preferences.",
                            "author": "Cdnsugarr",
                            "id": "gwq7779",
                            "parent_id": "t1_gwq71r6",
                            "score": 18,
                            "created_utc": 1620001368.0,
                            "replies": [
                                {
                                    "body": "“I find most women” is specifically talking about his experience. It doesn’t seem he was trying to indicate women’s collective preferences, but rather his collective experience. Feel like this is a notable difference between someone being borderline sexist and what he did with just relating his personal experience.",
                                    "author": "GenIISD",
                                    "id": "gwq7pcv",
                                    "parent_id": "t1_gwq7779",
                                    "score": 2,
                                    "created_utc": 1620001646.0,
                                    "replies": [
                                        {
                                            "body": "I’m responding to him that way because of his history with how he comments, and specifically his past comments towards me. Not solely this one-off time.",
                                            "author": "Cdnsugarr",
                                            "id": "gwq7stx",
                                            "parent_id": "t1_gwq7pcv",
                                            "score": 13,
                                            "created_utc": 1620001696.0,
                                            "replies": [
                                                {
                                                    "body": "I see. I will recuse myself from any further comments because there are underlying factors that I am not knowledgeable of.",
                                                    "author": "GenIISD",
                                                    "id": "gwq8uza",
                                                    "parent_id": "t1_gwq7stx",
                                                    "score": 10,
                                                    "created_utc": 1620002270.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "That has been my experience too, but there are always outliers, and that’s okay.",
                            "author": "GenIISD",
                            "id": "gwq7c52",
                            "parent_id": "t1_gwq71r6",
                            "score": 4,
                            "created_utc": 1620001443.0,
                            "replies": [
                                {
                                    "body": "We probably just don’t connect with the outliers 😉",
                                    "author": null,
                                    "id": "gwq84b2",
                                    "parent_id": "t1_gwq7c52",
                                    "score": -9,
                                    "created_utc": 1620001870.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "This is one of those \"amazing idea if you and she are into shopping together\" things.  I can definitely see the 20 questions being full of flirting.  It wouldn't be my bag but I can see why, if you have the right SB, it might work out super well",
            "author": "Azurecole",
            "id": "gwqf5q2",
            "parent_id": "t3_n3j5cm",
            "score": 12,
            "created_utc": 1620005758.0,
            "replies": []
        },
        {
            "body": "Ok this is super fun and I’d freaking love it if my SD did this! Not everything has to be luxe and if you’re having fun and spending time together, it sounds like the perfect post-meal activity. I like when people can enjoy street food and fun activities like this, but are also down for nice vacations and fine dining. Hope your POT SBs enjoy it!!!",
            "author": "PrincessPeach9315",
            "id": "gwqmg8e",
            "parent_id": "t3_n3j5cm",
            "score": 21,
            "created_utc": 1620009809.0,
            "replies": [
                {
                    "body": "See, we would probably totally mesh. This isn’t for everyone, but I’m not for everyone either. In addition to me always gifting a grant or benji in a small thank-you note at the M&G, if we click and I think I want an arrangement, spending more time to learn about her and gifting something that is 10-50% of her PPM ask at the M&G has always gotten a positive response.",
                    "author": "GenIISD",
                    "id": "gwqqks5",
                    "parent_id": "t1_gwqmg8e",
                    "score": 8,
                    "created_utc": 1620012244.0,
                    "replies": [
                        {
                            "body": "That’s my take on my own experience in the bowl- I’m not going to be perfect for everyone, and that’s fine! Self-awareness is super important, so at least you’re owning that.\n\nI think people are also missing the point that this isn’t the only form of “allowance” you’re sharing, just a portion of it. It’s a great idea for getting to know someone better in an easy environment. I also grew up in a small town and places like TJ Maxx were all we had nearby, so I appreciate someone else recognizing that experience as a common reality.",
                            "author": "PrincessPeach9315",
                            "id": "gwqr8xq",
                            "parent_id": "t1_gwqqks5",
                            "score": 6,
                            "created_utc": 1620012668.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "i never want to shop with anyone. for me its a very personal activity. but if your SBs love that, thats great. good on  ya.",
            "author": "littlebobeep29",
            "id": "gwqw80g",
            "parent_id": "t3_n3j5cm",
            "score": 6,
            "created_utc": 1620015958.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gwqttb4",
            "parent_id": "t3_n3j5cm",
            "score": 18,
            "created_utc": 1620014319.0,
            "replies": [
                {
                    "body": "Thanks! Appreciate your kind words. And most astute point.",
                    "author": "GenIISD",
                    "id": "gwqu0nd",
                    "parent_id": "t1_gwqttb4",
                    "score": 5,
                    "created_utc": 1620014457.0,
                    "replies": []
                },
                {
                    "body": "I agree. TJM or not, it’s a cool, unique idea and has clearly worked for him.",
                    "author": "ekin77",
                    "id": "gwsbyq3",
                    "parent_id": "t1_gwqttb4",
                    "score": 3,
                    "created_utc": 1620052208.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "What's great about the sugar bowl is the variety of people in it each with their own expectations and priorities. In my experience, some SBs are going to go for this, some definitely aren't, and for some it will depend on the larger context--It will reinforce whatever opinion they've already formed. \n\nI once took a relatively new SB shopping, we hit a number of high end stores, and bought a couple of things, and then she suggested we go into a thrift shop she knew of. She proceeded to clean the place out for less than the cost of a pair of shoes I bought her earlier. And she was clearly much more comfortable shopping there than anywhere else we'd been. It was the most fun thing to watch.",
            "author": "midwesternguru",
            "id": "gwsm105",
            "parent_id": "t3_n3j5cm",
            "score": 4,
            "created_utc": 1620056573.0,
            "replies": [
                {
                    "body": "That’s an awesome story, thanks for sharing. One person’s trash is another one’s treasure. I remember one antique dealer that procures books for me talking about finding a book worth into the four figures for under a dollar at a thrift store. Another story I came across was of a thrift hunter finding a Louis Vuitton belt with a gold buckle that sold vintage into the four figures for her, but cost her under five at a thrift shop (and her “job” is going to thrift shops and garage sales and flipping their stuff online - makes generally double six figures yearly doing that).\n\nIt’s all about what people are comfortable with and open to, but our culture has seemed to blur the difference between cheap and good value, and some responses definitely reveal that.",
                    "author": "GenIISD",
                    "id": "gwsq7ug",
                    "parent_id": "t1_gwsm105",
                    "score": 2,
                    "created_utc": 1620058330.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gwq5ffe",
            "parent_id": "t3_n3j5cm",
            "score": 8,
            "created_utc": 1620000406.0,
            "replies": [
                {
                    "body": "That’s definitely your prerogative to hate shopping, and so this would be a bad plan for you. Not an indication of how good of a person or SD you are at all.\n\nIn regards to malls being everywhere, this sadly is not the case geographically for most of the United States anymore. Malls are closing left and right in smaller towns, and to get to a mall as opposed to just a good restaurant where I sugar, you’re talking about 45 minutes each way as opposed to 5-10.",
                    "author": "GenIISD",
                    "id": "gwq6vrz",
                    "parent_id": "t1_gwq5ffe",
                    "score": 1,
                    "created_utc": 1620001196.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "gwqds7u",
                            "parent_id": "t1_gwq6vrz",
                            "score": 6,
                            "created_utc": 1620004989.0,
                            "replies": [
                                {
                                    "body": "See though, TJMaxx tends to be an anchor store in those strip malls. Retail is changing, especially post Covid. The variety is also a draw. Maybe a purse is preferred, maybe a necklace, maybe a body care gift set. They also have later hours than most boutique places, and that tends to work with my schedule.\n\nHave to work with what you have available. The Lenox mall in Atlanta or similar would be my first choice, but that isn’t really an option.",
                                    "author": "GenIISD",
                                    "id": "gwqfqmn",
                                    "parent_id": "t1_gwqds7u",
                                    "score": 3,
                                    "created_utc": 1620006079.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Also, not all malls have 'High End' in them, if that's what you're specifically looking for. I'm in a city & the only malls with 'high end' are either Downtown or in very rich areas. The rest have average stores with average clothes.",
                            "author": "ShaArt5",
                            "id": "gwqrgf0",
                            "parent_id": "t1_gwq6vrz",
                            "score": 2,
                            "created_utc": 1620012798.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "TJMaxx, Marshalls and Home Goods are my happy places.  I really hate shopping in general, but for some reason I love these stores.  I could literally spend hours just wandering around looking at things! A+ idea you have!",
            "author": "Little_yellow_bird_",
            "id": "gwqax57",
            "parent_id": "t3_n3j5cm",
            "score": 14,
            "created_utc": 1620003404.0,
            "replies": [
                {
                    "body": "Thank you! Where else can you buy a Coleman sleeping bag, a Husky utility knife, a Kate Spade handbag, a Yeti cooler, gold earrings, pasta made in Italy and a Le Creuset enameled dutch oven?\n\nThey have done a unique job filling in a niche of in-person shopping that the internet cannot really threaten.",
                    "author": "GenIISD",
                    "id": "gwqd8fe",
                    "parent_id": "t1_gwqax57",
                    "score": 18,
                    "created_utc": 1620004687.0,
                    "replies": []
                }
            ]
        },
        {
            "body": " *WPB* \n\nWhat is WPB?",
            "author": "BinghamtonSD",
            "id": "gwq9r1e",
            "parent_id": "t3_n3j5cm",
            "score": 4,
            "created_utc": 1620002764.0,
            "replies": [
                {
                    "body": "West Palm Beach. It is one of my “jet off” locations to take my SB once things are well established. Luxury shopping, nice beach condos and quality restaurants.",
                    "author": "GenIISD",
                    "id": "gwqa2jt",
                    "parent_id": "t1_gwq9r1e",
                    "score": 7,
                    "created_utc": 1620002940.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "This is the bowl and SDs are eliminated for saying they love cheap stuff even if that is a perfectly good item and great value for its price.",
            "author": null,
            "id": "gws54ck",
            "parent_id": "t3_n3j5cm",
            "score": 5,
            "created_utc": 1620049056.0,
            "replies": []
        },
        {
            "body": "This actually could be a cute idea for a regular relationship as well.",
            "author": "Straight_and_Dirty_",
            "id": "gws82vo",
            "parent_id": "t3_n3j5cm",
            "score": 4,
            "created_utc": 1620050400.0,
            "replies": []
        },
        {
            "body": "I get the set up most are using their own experiences here and not reading the frame of reference.\n\nA little shopping close by not dragging her to hotel immediately ....place with nicest Brand selection that close.\n\nYou could easy do a lot worse like slobbering on her to graba hotel room, given the frame its cute and a little charming .....obviously you have already filtered to ppm range before this so someone looking for whale would not be there to begin with",
            "author": "Momopllc",
            "id": "gwt08o0",
            "parent_id": "t3_n3j5cm",
            "score": 4,
            "created_utc": 1620062565.0,
            "replies": []
        },
        {
            "body": "I appreciate the thought. But I dislike shopping in person and so does my SD. We DO shop a lot, separately, but not for items at malls and stuff. \n\nBut yes, if you know your audience 🤷🏻‍♀️ cool.",
            "author": "scorpiogirl26",
            "id": "gwq6ytz",
            "parent_id": "t3_n3j5cm",
            "score": 6,
            "created_utc": 1620001242.0,
            "replies": []
        },
        {
            "body": "Oh. My. God. This is a dream!!",
            "author": "KeeKeeRamone",
            "id": "gwt0k8d",
            "parent_id": "t3_n3j5cm",
            "score": 3,
            "created_utc": 1620062700.0,
            "replies": []
        },
        {
            "body": "Hint for some, TJMax selects merchandise for each store based on surrounding demographic.\n\n\nI have shopped where Gucci and other major brands we on the shelf. I bought a $2500 sport coat for $250 cause it was so much it didn't move and kept getting marked down.  Started at 1250 and no takers.  So if its an area with high income dont be afraid to step in to the affordable store you can find some amazing things.",
            "author": "Momopllc",
            "id": "gwt2ok6",
            "parent_id": "t3_n3j5cm",
            "score": 3,
            "created_utc": 1620063583.0,
            "replies": []
        },
        {
            "body": "Like you, I really enjoy TJMaxx, but the truth is I LOVE bargain hunting. So I also enjoy Ross, thrifts stores, Bargain Hunt and Flea Markets. There's a shoe store in my home town that utterly delights me. Their selection is totally random, but OMG the deals. I mostly wear boots and I have bought multiple pairs of Frye brand boots for $89.\n\nAnd over the years I have learned that I don't mesh well with SBs who are expecting a luxury experience. Fortunately, my location is a mid-sized college city in the south and the vast majority of pot SBs are looking for help with living expenses , tuition or student loan help. So they are happy with my above average (for my area) allowance with occasional  extras like trips. And they almost always are down for bargain shopping which is so much fun.",
            "author": "SouthernGentSD",
            "id": "gwt8ysl",
            "parent_id": "t3_n3j5cm",
            "score": 3,
            "created_utc": 1620066176.0,
            "replies": [
                {
                    "body": "Hi, would you mind if I DM you? I’d like to pick your brain. I’ve been reading here for a while, and your comment seems like you’d have some good advice/education.",
                    "author": "jb_ninja",
                    "id": "gwtcxpk",
                    "parent_id": "t1_gwt8ysl",
                    "score": 2,
                    "created_utc": 1620067842.0,
                    "replies": [
                        {
                            "body": "sure go right ahead.",
                            "author": "SouthernGentSD",
                            "id": "gwtflzn",
                            "parent_id": "t1_gwtcxpk",
                            "score": 2,
                            "created_utc": 1620068984.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": ".... I need to know of this magical shoe store. Also love your use of “utterly delights” 😂 \nSometimes I get embarrassed for my equal love of bargain stores but then I look cute as hell and I shrug it off.",
                    "author": "PrincessPeach9315",
                    "id": "gwulgnx",
                    "parent_id": "t1_gwt8ysl",
                    "score": 1,
                    "created_utc": 1620088011.0,
                    "replies": [
                        {
                            "body": "So the owners of this shoe store have agreements with distributors at a lot of retailers and I think some high-end department stores where they will take their seconds and unused inventories. They get shipments from these places every day. \n\nThe store itself is just row after row of tables with shoes on them. Whenever you go in there, you never know what you will find. The men’s section is much smaller than the women’s section and the men’s shoes are not ordered in any way, not even by size. However the women’s tables are labeled by size but are otherwise not ordered in any way. So the only way to find shoes is to look through the whole inventory. But I really enjoy doing that. \n\n“Utterly delighted” may be a bit of a flourish, but it’s  an accurate descriptor.",
                            "author": "SouthernGentSD",
                            "id": "gwumuf3",
                            "parent_id": "t1_gwulgnx",
                            "score": 1,
                            "created_utc": 1620088687.0,
                            "replies": [
                                {
                                    "body": "Sounds awesome! I’m also in the South so maybe I’ll stumble on it someday lol",
                                    "author": "PrincessPeach9315",
                                    "id": "gwuneit",
                                    "parent_id": "t1_gwumuf3",
                                    "score": 1,
                                    "created_utc": 1620088957.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "What ever floats your boat. Not my bag, as I prefer to be straight shooter, and just ask what she wants and then go from there (yes, no, maybe one day).",
            "author": "BigBearSD",
            "id": "gwqa6qc",
            "parent_id": "t3_n3j5cm",
            "score": 6,
            "created_utc": 1620003002.0,
            "replies": [
                {
                    "body": "It’s personal preference for sure, I like knowing enough to be able to have surprise gifts for her most visits that are things she’ll like/use. Different strokes for different folks.",
                    "author": "GenIISD",
                    "id": "gwqaxb0",
                    "parent_id": "t1_gwqa6qc",
                    "score": 1,
                    "created_utc": 1620003406.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "This would be fun for a meet & greet I suppose. I’m renovating/redecorating my house so I would definitely find some things I would like",
            "author": "ma-ri-ah",
            "id": "gwqfcie",
            "parent_id": "t3_n3j5cm",
            "score": 3,
            "created_utc": 1620005863.0,
            "replies": []
        },
        {
            "body": "I actually really like this. I like to talk and I love shopping. I honestly like when my SD gives me presents.",
            "author": "CompetitiveAppealSB",
            "id": "gwqqx1c",
            "parent_id": "t3_n3j5cm",
            "score": 2,
            "created_utc": 1620012458.0,
            "replies": []
        },
        {
            "body": "I absolutely love the idea, but I don’t know if I can pick stuff out within 30min... I need more time!",
            "author": "zuckdemtee",
            "id": "gwrbvn8",
            "parent_id": "t3_n3j5cm",
            "score": 5,
            "created_utc": 1620029114.0,
            "replies": [
                {
                    "body": "Same! I love TJMaxx but i couldn’t imagine having 30 minutes 😔",
                    "author": "Xx_spacey_kitten_xX",
                    "id": "gwrt4p8",
                    "parent_id": "t1_gwrbvn8",
                    "score": 2,
                    "created_utc": 1620042684.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "God, if any of the POT SDs I’ve met wanted to take me shopping on a M&G it would be a goddamn miracle. For some reason SDs around here all seem to be on a serious budget.",
            "author": "ozmafox",
            "id": "gws0a81",
            "parent_id": "t3_n3j5cm",
            "score": 2,
            "created_utc": 1620046721.0,
            "replies": [
                {
                    "body": "My MO is to have a grant or benji tucked inside a thank-you note and give it to them within a few minutes of the start of the M&G just to make sure gas/transportation/make-up/etc. doesn’t put them in the red for spending time - even briefly - with me. \n\nIt may be partially because I am under 40 and need to show I understand and am serious about being generous - at least relative to the competition - but spending time together with a potential SB and definitely once in an arrangement always has an outflow of money from me to her. It may be Broadway tickets or shopping or museum admission or Dave & Busters play card cost; but in addition to meal costs and allowance gifting, I am spending money on “dating” activities. \n\nThat’s how I feel a sugar arrangement should be. Sugar dating is dating, but with sugar. A strict budget takes the fun out of it. As a real SD, it shouldn’t matter if I spend twenty on museum admission or three benjis on show tickets or a couple benjis on a bit of shopping or fly her out to a beach resort for the weekend and drop a couple/few grand. It’s fun and the time together is fantastic, and that’s what matters.",
                    "author": "GenIISD",
                    "id": "gws3rl0",
                    "parent_id": "t1_gws0a81",
                    "score": 3,
                    "created_utc": 1620048431.0,
                    "replies": [
                        {
                            "body": "I see you may have posted a number which is most likely an amount in relations to an arrangement. If this is the case, you are violating Rule #4 - \"No dollar amounts that are in reference to allowance/PPM are allowed.\"\n\nIf you are curious about Allowances reported by SLF contributors please see the [Allowance Master Thread 2020-2021](/r/sugarlifestyleforum/comments/ja37xt/allowance_master_thread_20202021/).\n\nYour post will not be approved until you remove the amount.  Please read the sub [Rules](/r/sugarlifestyleforum/comments/748zta/updated_and_clarified_rules_for_slf/) prior to posting anything else. \n\nIf you simply posted a number not referencing a monetary amount, please message the MODs to approve your post.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/sugarlifestyleforum) if you have any questions or concerns.*",
                            "author": "AutoModerator",
                            "id": "gws3rmb",
                            "parent_id": "t1_gws3rl0",
                            "score": 0,
                            "created_utc": 1620048431.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "As someone who lives in rural New England, this is a dream.  🤩 i love how it will give the SB faith that you are generous, but it’s also an opportunity to get to know each other!",
            "author": "GlitteringOwl44",
            "id": "gwsarar",
            "parent_id": "t3_n3j5cm",
            "score": 2,
            "created_utc": 1620051654.0,
            "replies": []
        },
        {
            "body": "I love this - so cute. Some TJMaxxs can be very upscale and have a designer section (sometimes they have current szn items). I totally understand - I live in a similar area! A lot of wealthy people but the stores nearby don’t necessarily reflect that.",
            "author": "shesanewman",
            "id": "gwsgb4e",
            "parent_id": "t3_n3j5cm",
            "score": 2,
            "created_utc": 1620054172.0,
            "replies": []
        },
        {
            "body": "TJ Max is not a terrible idea at all, and $ goes further a smart SB will figure that out and not look at it as cheap.\n\nEspecially given the choices.  I may be wrong, but I suspect 90%  of real SBs will not have an issue with this.\n\nAnd to help everyone out. Using the free white paper here you can save 7% at Tjmax today without a coupon.  Www.spinnakersale.com. for the SBs have used method for ulta , Sephora,  VS  so dont poo poo on the free info.  I use to get SBs giftcards and can get more than planned so its a win for them.\n\nIf the SB is insulted by this effort of yours probably not a good fit, if the options in area are of same.....you can road trip to higher end stores for shopping outing when things have worked and you want to spoil a little.\n\nJust my opin",
            "author": "Momopllc",
            "id": "gwsz85a",
            "parent_id": "t3_n3j5cm",
            "score": 2,
            "created_utc": 1620062137.0,
            "replies": []
        },
        {
            "body": "Everyone loves tjmaxx right?",
            "author": "Elvishgirl",
            "id": "gwtbx78",
            "parent_id": "t3_n3j5cm",
            "score": 2,
            "created_utc": 1620067417.0,
            "replies": []
        },
        {
            "body": "I love going to t.j Maxx it is so fun and that is great idea!",
            "author": "sweetlikesunshine",
            "id": "gwtex73",
            "parent_id": "t3_n3j5cm",
            "score": 2,
            "created_utc": 1620068686.0,
            "replies": []
        },
        {
            "body": "This is adorable. And I just love TJMaxx 😂",
            "author": "brattysubsandwich",
            "id": "gwty2io",
            "parent_id": "t3_n3j5cm",
            "score": 2,
            "created_utc": 1620077036.0,
            "replies": []
        },
        {
            "body": "Um yes!!!!",
            "author": "dark_starling9",
            "id": "gwuh43v",
            "parent_id": "t3_n3j5cm",
            "score": 2,
            "created_utc": 1620085919.0,
            "replies": []
        },
        {
            "body": "You sound wonderful.",
            "author": "SassySugar4u",
            "id": "gynsmjn",
            "parent_id": "t3_n3j5cm",
            "score": 2,
            "created_utc": 1621399762.0,
            "replies": []
        },
        {
            "body": "First, I want to say that it looks like a lot of people who never get out of a big city don't really have the concept of living in a rural area.  Even though you repeatedly said it's the best alternative around, they just could not wrap their minds around it.\n\nI think that what you are doing here is great for many reasons:\n\n1. It's a pressure-free way to get to know more about each other.  You could learn much more about each other in an hour doing this than you could ever learn in an hour sitting and talking in a restaurant.\n2. The SB should be able to have a lot of fun with this, and if not, then you will know that she is not for you.\n3. You should be able to identify how driven by money the woman is.\n4. This provides a shared experience that should put each of you much more at ease the next time you meet.\n5. The SB will have a gift that you picked out for her with her guidance.  The gift and the experience will be something that she can think about before the next meeting, and also as long as the relationship lasts.\n\nReading the responses was interesting.  Your post was like an inkblot test.  Some people saw kittens, and some people saw dragons.  I think that the people who saw dragons see a lot of dragons everywhere they go.  They are the ones who are missing out on a lot of the pleasures of life.  This is truly one of the most outstanding posts I have ever seen on any forum.",
            "author": "ItsMeToo23333",
            "id": "gzhncen",
            "parent_id": "t3_n3j5cm",
            "score": 2,
            "created_utc": 1622015594.0,
            "replies": []
        },
        {
            "body": "I’m not familiar with TJ Maxx. Is it like Kohls?",
            "author": null,
            "id": "gwq9h8v",
            "parent_id": "t3_n3j5cm",
            "score": 4,
            "created_utc": 1620002612.0,
            "replies": [
                {
                    "body": "It's a discount store with brand name items.  Maybe from last year or slightly irregular.  Marshall's and Ross are similar if you know them.",
                    "author": "tamenwild",
                    "id": "gwqbxm4",
                    "parent_id": "t1_gwq9h8v",
                    "score": 9,
                    "created_utc": 1620003963.0,
                    "replies": []
                },
                {
                    "body": "It would have some overlap but with a wider range of brands and product lines.",
                    "author": "GenIISD",
                    "id": "gwqa5po",
                    "parent_id": "t1_gwq9h8v",
                    "score": 2,
                    "created_utc": 1620002987.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I limit shopping sprees to dollar tree. In all seriousness i hate shopping, fuck shopping.",
            "author": "pintodinosaur",
            "id": "gwqbska",
            "parent_id": "t3_n3j5cm",
            "score": 4,
            "created_utc": 1620003886.0,
            "replies": [
                {
                    "body": "I will hook you up with some Charleston Chew from Dollar Tree! \n\nFor me it’s really about learning more about the pot SB and being surrounded by props to create comedic/flirtatious opportunities than the actual shopping.  But if you hate shopping, fuck it, let’s do something you’re going to like and I’ll learn more about you then while we both enjoy ourselves.",
                    "author": "GenIISD",
                    "id": "gwqrwkv",
                    "parent_id": "t1_gwqbska",
                    "score": 1,
                    "created_utc": 1620013080.0,
                    "replies": [
                        {
                            "body": "Agreed, although i can imagine in this lifestyle it might be difficult. Women and men are different naturally, then you have the age gap to deal with. Despite the fact that i hate shopping i'll do it once in a while because i'm a team player.",
                            "author": "pintodinosaur",
                            "id": "gwsr2c3",
                            "parent_id": "t1_gwqrwkv",
                            "score": 1,
                            "created_utc": 1620058691.0,
                            "replies": [
                                {
                                    "body": "Age gap is normally only at 10-ish for me, so that does seem to change the dynamic too. I had one M&G that did not progress to TJM or any more time together, and the POT commented over a dozen times that she just can’t believe she is sitting across from someone who doesn’t have gray hair. Honestly made it awkward - she thought my pics were old/fake and still came to meet me. \n\nBut once I know scents and colors and a few other preferences, I do most of my surprise gift buying outside of time with my SB. I just like always having something little extra to make it feel like gifting and not paying. It helps me keep a more positive view of the situation.",
                                    "author": "GenIISD",
                                    "id": "gwss8kk",
                                    "parent_id": "t1_gwsr2c3",
                                    "score": 1,
                                    "created_utc": 1620059182.0,
                                    "replies": [
                                        {
                                            "body": "At 10 the age gap can still be big depending on ages. For example, i'm early thirties, for me 10 year age gap is early 20's. The difference between a 21-23 year old and my thought process/experience/likes are huge from what i have seen. I think it's cool you go the extra mile. I suck at gifting so even when i know someone for ever, it's still hard for me to gift.",
                                            "author": "pintodinosaur",
                                            "id": "gwt01gy",
                                            "parent_id": "t1_gwss8kk",
                                            "score": 1,
                                            "created_utc": 1620062483.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I would have her try on different items to get her sizes, styles etc and then you can order things.\n\nYou can also pick up an extra package of tight-whitey’s",
            "author": "daddoms",
            "id": "gwqnrzq",
            "parent_id": "t3_n3j5cm",
            "score": 2,
            "created_utc": 1620010582.0,
            "replies": []
        },
        {
            "body": "This is an excellent idea 🥺 this is so sweet and thoughtful too!",
            "author": "Xx_spacey_kitten_xX",
            "id": "gwrswnn",
            "parent_id": "t3_n3j5cm",
            "score": 2,
            "created_utc": 1620042551.0,
            "replies": []
        },
        {
            "body": "Sounds exhausting and I would consider a hernia repair rather than go through that.",
            "author": "GSSD",
            "id": "gwrzan8",
            "parent_id": "t3_n3j5cm",
            "score": 2,
            "created_utc": 1620046212.0,
            "replies": []
        },
        {
            "body": "LOVE LOVE LOVE TJMaxx!!!!! That is an amazing idea.",
            "author": "Layla_Fox2",
            "id": "gws7255",
            "parent_id": "t3_n3j5cm",
            "score": 2,
            "created_utc": 1620049929.0,
            "replies": []
        },
        {
            "body": "pass",
            "author": "bookworm010101",
            "id": "gwrg4w3",
            "parent_id": "t3_n3j5cm",
            "score": 1,
            "created_utc": 1620033169.0,
            "replies": []
        },
        {
            "body": "\\> It’s generally playful, allows for a bit of flirting and shoulder brushes/physical closeness\n\nCringe.",
            "author": "Anoonnyymmoous",
            "id": "gws95q3",
            "parent_id": "t3_n3j5cm",
            "score": 0,
            "created_utc": 1620050912.0,
            "replies": [
                {
                    "body": "If you’re talking about climbing into bed with someone the next time you’re together, but the thought of standing a few inches away/having your shoulders briefly brush when walking through a store is cringe, you’re not sugaring right. \n\nBut, you also communicate in other comments that aspiring SBs should “demand payment for a first meet.” So you’re definitely supporting a rinser/scammer/prostitute approach to the sugar bowl instead of the healthy sugar dating approach that I take and support. Natural attraction is vital for a fun SR, and if one or both parties isn’t feeling that, the search needs to continue.",
                    "author": "GenIISD",
                    "id": "gwsdwsj",
                    "parent_id": "t1_gws95q3",
                    "score": 1,
                    "created_utc": 1620053099.0,
                    "replies": [
                        {
                            "body": ">Natural attraction is vital for a fun SR\n\nI have bad news, buddy: for the most part, they're there for the money. Which is great, but don't delude yourself.\n\nThe cringeworthy part of what you said was the notion that you are grandstanding a rather sad way to impose physical contact.\n\nAnd I am absolutely not supporting a \"rinser/scammer/prostitute approach\". I'm advocating for techniques that reduce SB's exposure to men who won't provide sugar.",
                            "author": "Anoonnyymmoous",
                            "id": "gwstq2f",
                            "parent_id": "t1_gwsdwsj",
                            "score": 0,
                            "created_utc": 1620059815.0,
                            "replies": [
                                {
                                    "body": "Not deluded at all, and 100% accurate with what I’ve stated. I’m in my 30s and use sugaring to keep expectations in check (don’t want to do the ring thing/sugaring is a lot cheaper than having a lady run off with half my portfolio in five to ten years). Completely understand the money matters, and it is what opens the door. I’ve ended multiple SRs that were getting too clingy and been countered with switching to vanilla dating by the POT. So, there was a lot more in her eyes than the money once things got underway.\n\nThere is no imposition for physical contact in what I shared. If we are a foot apart and I move eight inches towards her and she moves four inches towards me and our shoulders touch; that isn’t imposition, that’s chemistry. I may be taking the lead a bit, but it isn’t imposition - it isn’t forced at all. I read her body language and act accordingly and with respect and reserve. My post is far from grandstanding. The last time I took a pot to TJM, her hands we’re definitely on me more than mine were beginning to come close to her.\n\nAnd demanding payment for the M&G isn’t a way to make sure you get sugar, it’s a way to drive off the kindest and most generous ones who have been burned in the past with the scammers that collect for a M&G and then ghost.",
                                    "author": "GenIISD",
                                    "id": "gwsx19c",
                                    "parent_id": "t1_gwstq2f",
                                    "score": 4,
                                    "created_utc": 1620061210.0,
                                    "replies": [
                                        {
                                            "body": "I love this comment",
                                            "author": "SassySugar4u",
                                            "id": "gynsowa",
                                            "parent_id": "t1_gwsx19c",
                                            "score": 3,
                                            "created_utc": 1621399800.0,
                                            "replies": []
                                        },
                                        {
                                            "body": ">And demanding payment for the M&G isn’t a way to make sure you get sugar, it’s a way to drive off the kindest and most generous ones who have been burned in the past with the scammers that collect for a M&G and then ghost.\n\nI'm of the opinion that the person with all of the power should be taking the risk. You disagree. I also think you have clearly demonstrated you are not \"the kindest and most generous\" through your words here. I'm sure you disagree about that, as well. We're done here.",
                                            "author": "Anoonnyymmoous",
                                            "id": "gwtbag3",
                                            "parent_id": "t1_gwsx19c",
                                            "score": 1,
                                            "created_utc": 1620067152.0,
                                            "replies": [
                                                {
                                                    "body": "This is a toxic mentality. There is NOT one person with all the power. Any SB that thinks she has no power has believed a lie. You have the power to demand respect and next if respect is not shown. You have the power to communicate your needs and next if they will not be met (not only financial needs but also mental, social and emotional). You have the power to insist upon meeting in public and not be forced to meet at a hotel first. You have the power to leave whenever you please. You have the power to insist upon a platonic first meet (you should next the pot if you’re having to insist upon it). You have the power to seek a quality sugar mentor of an experienced SB that can help you navigate the bowl. You have the power to say “no.” You have the power to keep you legs closed. To all aspiring and current SBs, don’t fall for the B.S. that you have no power. You do, and anyone that treats you like you don’t or attempts to brainwash you into thinking you don’t deserves to have their input and thoughts ignored. \n\nAny healthy relationship is about give and take. If the SD had ALL the power, there would be no need to have different allowances or to work to differentiate oneself as a better SD option than others. Sugar dating shifts the power from being the 95/5 split that normal dating has to probably a 40/60 to 20/80 split in favor of the sugar parent. But that does not mean ALL power rests with the SD. \n\nThe M&G is a two-way interview to see if there is compatibility to start an arrangement. I never commit to paying for one and next those with low level thinking that insist upon it, but I also always gift a small amount of cash to show I appreciate the SB and to show I will gift beyond commitment. It allows me to avoid rinser/scammers/idiots who believe what they see online and to meet quality and understanding pots that I tend to click with. I could have had a lot more M&Gs, but they would have been with lower caliber and generally conceited individuals and would not have led to a SR.",
                                                    "author": "GenIISD",
                                                    "id": "gwtq6s2",
                                                    "parent_id": "t1_gwtbag3",
                                                    "score": 2,
                                                    "created_utc": 1620073581.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gwqgwe5",
            "parent_id": "t3_n3j5cm",
            "score": -12,
            "created_utc": 1620006709.0,
            "replies": [
                {
                    "body": "Taking someone shopping that I want to pursue an arrangement with will set me up to be treated like a doormat?",
                    "author": "GenIISD",
                    "id": "gwqjdhq",
                    "parent_id": "t1_gwqgwe5",
                    "score": 5,
                    "created_utc": 1620008076.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "gwr5pzd",
                            "parent_id": "t1_gwqjdhq",
                            "score": -9,
                            "created_utc": 1620023449.0,
                            "replies": [
                                {
                                    "body": "can you elaborate on how they’d be treated like a doormat? 😳",
                                    "author": "Xx_spacey_kitten_xX",
                                    "id": "gwrt762",
                                    "parent_id": "t1_gwr5pzd",
                                    "score": 2,
                                    "created_utc": 1620042724.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Why do you think that?",
                    "author": "Aromatic_Advice1426",
                    "id": "gwrp36k",
                    "parent_id": "t1_gwqgwe5",
                    "score": 2,
                    "created_utc": 1620040121.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "this is a hard no for me. I go to TJ Maxx with my mom when I've needed things for my apartment or college dorm lol.",
            "author": "Stunning-Worth-6525",
            "id": "gwu2jnj",
            "parent_id": "t3_n3j5cm",
            "score": 1,
            "created_utc": 1620079035.0,
            "replies": []
        },
        {
            "body": "Such a cute idea. Honestly, just the thoughtfulness alone of it not even the gifts would make me gush a bit. Great idea OP.",
            "author": "tattoosandtail",
            "id": "gwqzj00",
            "parent_id": "t1_gwqckoi",
            "score": 24,
            "created_utc": 1620018364.0,
            "replies": [
                {
                    "body": "Thank you both for your kind words. Feels good knowing this is some SBs reaction to this approach. \n\nThe last time I did this, and I’m hoping things work out into a long term arrangement, the way the pot started looking at me about half way through is the only time I’ve ever had flashbacks to when my late fiancé would look at me when I was flirting with her. \n\nA pot that doesn’t appreciate a gift worth ten to thirty Starbucks drinks for just the M&G is definitely wanting to experience a different place in the bowl than where I hang.",
                    "author": "GenIISD",
                    "id": "gwtdsbj",
                    "parent_id": "t1_gwqzj00",
                    "score": 4,
                    "created_utc": 1620068202.0,
                    "replies": [
                        {
                            "body": "This is a super great idea. The extra time to test the chemistry, the playful flirtation, the getting to know little oddball things about one another. Ugh, my heart would melt. \n\nAnd I don’t understand why people were not understanding the kind of area that you’re in and why TJ Maxx is one of the best options. Not everything gotta come straight out of Louis Vuitton.",
                            "author": null,
                            "id": "gwvuol3",
                            "parent_id": "t1_gwtdsbj",
                            "score": 2,
                            "created_utc": 1620116899.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I agree. The 20 questions idea is cute but I'd assume the guy is cheap. Brands like MK and Kate Spade are very cheap and accessible.  I would rather have the monetary value and buy things I love or need instead of random junk",
            "author": "MJline",
            "id": "gwuv23i",
            "parent_id": "t1_gwsd9q2",
            "score": 8,
            "created_utc": 1620092672.0,
            "replies": []
        },
        {
            "body": "100% on the thought process, but Pottery Barn and William Sonoma are about 45 minutes away. There is a furniture store in town, but it closes at 6pm. Literally the options are Target, Walmart, TJM, dollar stores or driving over 30 minutes. It’s a very different pond than what most on here seem to have at their disposal.\n\n(And all the restaurants are 3-5 minutes from the TJM, which is actually kept clean and pretty organized compared to most I’ve been in, but with the close proximity we both drive ourselves vs. her getting in my vehicle.)",
            "author": "GenIISD",
            "id": "gwsfnck",
            "parent_id": "t1_gwsd9q2",
            "score": 3,
            "created_utc": 1620053876.0,
            "replies": []
        },
        {
            "body": "As someone from NYC and currently living in a high COLA, I’d feel very conflicted by this. On one hand, I can afford to take myself to TJ Maxx (and I do often - recently bought myself some Burberry perfume and candles, who doesn’t love a good deal!). But when I’m in an SR, I want to experience things that I wouldn’t be able to do on my own, and I’m not sure going to TJ Maxx is that. \n\nOn the other hand, I can always go for more candles and beauty products, and most of my past SDs never offer gifts or anything beyond dinner and our agreed upon PPM. I’d appreciate anything extra",
            "author": "Dax-718",
            "id": "gws293f",
            "parent_id": "t1_gwqii8w",
            "score": 21,
            "created_utc": 1620047702.0,
            "replies": [
                {
                    "body": "It’s more about getting to know the POT than the actual shopping experience for me. And it is just an extension of the M&G. What’s her favorite body care scent, color, precious metal, handbag type, precious/semi-precious stone, etc. Knowing that allows me to get random things to pair with the PPM/allowance down the road and make it seem/feel less transactional. Who gives a prostitute a bottle of bubble bath in their favorite scent or an anklet made with gold/rose gold/white gold with a birthstone charm based on favorite precious metal? For me and for the people I’ve sugar dated, it’s a nice little extra that elevates the experience. To each their own, but I enjoy knowing enough to spoil with things that will be used and enjoyed.",
                    "author": "GenIISD",
                    "id": "gws9yt2",
                    "parent_id": "t1_gws293f",
                    "score": 5,
                    "created_utc": 1620051292.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Do you live somewhere where at 8p after you finish a sushi dinner, the only options within 30+ minutes are TJMaxx, Target or Walmart? Or I guess technically dollar general too. \n\nThe pond you’re fishing in makes a big difference as to whether this would be a Splenda or sugar tactic.",
            "author": "GenIISD",
            "id": "gwqlfwm",
            "parent_id": "t1_gwqii8w",
            "score": 29,
            "created_utc": 1620009239.0,
            "replies": [
                {
                    "body": "Nah. I’m not. Thank God I’m not in the Midwest. The only possible benefit is the PPM is possibly lower but you also have way fewer SB because everyone is married.",
                    "author": "UnearthlyDinosaur",
                    "id": "gwqrzqt",
                    "parent_id": "t1_gwqlfwm",
                    "score": 8,
                    "created_utc": 1620013135.0,
                    "replies": [
                        {
                            "body": "Being in a more rural, LCOL area is definitely an exchange. There are SBs/aspiring SBs on SLF that wouldn’t consider it a mall if it didn’t have Neiman Marcus. I do definitely enjoy malls with Burberry, Brooks Brothers, etc., but that isn’t M&G shopping from my view, and that option is hours away. The closest mall has the Boscov, Kohls, JCPenny vibe; and it’s still over 30 minutes away.",
                            "author": "GenIISD",
                            "id": "gwqtekd",
                            "parent_id": "t1_gwqrzqt",
                            "score": 5,
                            "created_utc": 1620014047.0,
                            "replies": []
                        },
                        {
                            "body": "So true..",
                            "author": "DarkandHandsome987",
                            "id": "gws74pg",
                            "parent_id": "t1_gwqrzqt",
                            "score": 2,
                            "created_utc": 1620049962.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "IDK, I’m in a major metro area and I’m still a basic bitch who loves Target! I think this sounds really cute and fun.",
                    "author": null,
                    "id": "gwujnbt",
                    "parent_id": "t1_gwqlfwm",
                    "score": 3,
                    "created_utc": 1620087140.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Some TJ Maxxs are more organized but I’ve also been to ones where things are messy and all over the floor. It depends on the area…but yes the things there are things rejected from other stores. I like shopping there for myself for fun and good deals, but also think it’s a little bit of an odd choice for the first meeting",
            "author": null,
            "id": "gwrgz1o",
            "parent_id": "t1_gwrd11q",
            "score": 19,
            "created_utc": 1620033978.0,
            "replies": []
        },
        {
            "body": "It is somewhat different on this side of the pond (I’ve popped into a couple in Europe, and they have a more “goodwill” vibe than the ones in the US). Seconds, obvious returns, and piles aren’t really the norm. TJM has also negotiated with certain companies to not be left as a retail arbitrage player but to be a wholesale buyer to keep their shelves stocked with the variety they want. So they get to buy direct from some brands and not just have slower moving designs from the previous year and seconds.",
            "author": "GenIISD",
            "id": "gwrzfpb",
            "parent_id": "t1_gwrd11q",
            "score": 1,
            "created_utc": 1620046283.0,
            "replies": []
        },
        {
            "body": "Thank you for your kind words and attention to detail. Hope your day is beyond marvelous!",
            "author": "GenIISD",
            "id": "gwte7ho",
            "parent_id": "t1_gws693m",
            "score": 3,
            "created_utc": 1620068380.0,
            "replies": []
        },
        {
            "body": "I feel that, and would be glad to suggest elsewhere if better options where anywhere close. No other place in town sells Polo Ralph Lauren or Coach. An average 1-bed apt is under a grand, so TJMaxx is a “meh” fish in a tiny pond.",
            "author": "GenIISD",
            "id": "gwqinsx",
            "parent_id": "t1_gwqh8bf",
            "score": 4,
            "created_utc": 1620007674.0,
            "replies": [
                {
                    "body": "There’s no Nordstrom or Neiman Marcus or something like that where you are? Even Macy’s?",
                    "author": null,
                    "id": "gwrgsi5",
                    "parent_id": "t1_gwqinsx",
                    "score": 7,
                    "created_utc": 1620033803.0,
                    "replies": [
                        {
                            "body": "Nope - it’s Target, Walmart, Dollar General and TJM. It is the nice place to shop in town, otherwise you’re driving over an hour round trip.",
                            "author": "GenIISD",
                            "id": "gwrxuk9",
                            "parent_id": "t1_gwrgsi5",
                            "score": 3,
                            "created_utc": 1620045431.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I’ll totally jet my SB out to WBP or LA for a weekend of shopping and sunbathing and sex. But for a POT to get gifted 10-50% of her PPM ask as a gift at the M&G - that respectfully doesn’t seem to be something that should be viewed as the bottom of the experience range in the bowl.",
            "author": "GenIISD",
            "id": "gwqq1h1",
            "parent_id": "t1_gwqnpxi",
            "score": 9,
            "created_utc": 1620011921.0,
            "replies": [
                {
                    "body": "Im just teasing! :)",
                    "author": "slfsd20201",
                    "id": "gwqrvyo",
                    "parent_id": "t1_gwqq1h1",
                    "score": 2,
                    "created_utc": 1620013069.0,
                    "replies": [
                        {
                            "body": "All good!",
                            "author": "GenIISD",
                            "id": "gwqsffg",
                            "parent_id": "t1_gwqrvyo",
                            "score": 2,
                            "created_utc": 1620013416.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Definitely have to know your audience, and have to mesh well too. Isn’t a right or wrong thing, but we probably wouldn’t discover a good arrangement just because I very much enjoy taking my SB shopping, and you very much prefer doing it solo. Blueberries and tangerines exist for a reason, and it’s okay if your favorite is not mine.",
            "author": "GenIISD",
            "id": "gwq75iv",
            "parent_id": "t1_gwq5ysc",
            "score": 12,
            "created_utc": 1620001342.0,
            "replies": [
                {
                    "body": "Agreed! \n\nIt’s always just made me feel awkward. 😂",
                    "author": "Cdnsugarr",
                    "id": "gwq7bq1",
                    "parent_id": "t1_gwq75iv",
                    "score": 10,
                    "created_utc": 1620001436.0,
                    "replies": [
                        {
                            "body": "Definitely a bad idea then, and if we ever meet and I ask if you’d like to do it, please turn me down? \n\nWhat are some other engaging activities that you would enjoy to keep a M&G going if things went well?",
                            "author": "GenIISD",
                            "id": "gwq8piu",
                            "parent_id": "t1_gwq7bq1",
                            "score": 0,
                            "created_utc": 1620002189.0,
                            "replies": [
                                {
                                    "body": "Well, most of mine have just been coffee but we are super locked down still. \n\nI live in a city with a wonderful river valley and full\nOf trails so if it’s warm, it’s great to get outside! We have a street here that’s full of more unique shops (local art, used book store with a shop cat and a great selection of unique and rare books, delicious and varying street foods like Filipino iced cream!) that are lovely for just wandering and sparking conversation. \n\nHowever, for M&G I really don’t prefer it to be very long, personally.",
                                    "author": "Cdnsugarr",
                                    "id": "gwq9mi8",
                                    "parent_id": "t1_gwq8piu",
                                    "score": 3,
                                    "created_utc": 1620002694.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I've suggested going on shopping dates for vanilla dates in the past and the vast majority of females are disinterested in shopping dates. But I have been on 2 with mixed results. (Costco date was meh and Frederick's of Hollywood date was awesome)\n\nBig respect for thinking out of the box and I may field test this myself. On a first sugar date I usually ask \"What kind of gifts do you like/want?\". And the answers I usually get are cash, CashApp or PayPal. I've only had one SB have a non-financial reply and that was for a strawberry shake from McDonald's.",
            "author": "Ray2020K",
            "id": "gws151j",
            "parent_id": "t1_gwq5ysc",
            "score": 1,
            "created_utc": 1620047154.0,
            "replies": [
                {
                    "body": "I do love the creativity! And I do love wandering those stores aimlessly. I just don’t want to combine the two when I don’t know someone yet. 😂\n\nI think it’s hard to tell someone what kind of gifts you want unless everything is laid out for you. What’s the value, is it on top of ppm/allowance, those kinds of things.",
                    "author": "Cdnsugarr",
                    "id": "gwsgrxq",
                    "parent_id": "t1_gws151j",
                    "score": 1,
                    "created_utc": 1620054379.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I find most women love to be taking shopping",
            "author": null,
            "id": "gwq71r6",
            "parent_id": "t1_gwq5ysc",
            "score": -4,
            "created_utc": 1620001286.0,
            "replies": [
                {
                    "body": "I’m glad you know most women. You can keep me up to date on the changes in our collective preferences.",
                    "author": "Cdnsugarr",
                    "id": "gwq7779",
                    "parent_id": "t1_gwq71r6",
                    "score": 18,
                    "created_utc": 1620001368.0,
                    "replies": [
                        {
                            "body": "“I find most women” is specifically talking about his experience. It doesn’t seem he was trying to indicate women’s collective preferences, but rather his collective experience. Feel like this is a notable difference between someone being borderline sexist and what he did with just relating his personal experience.",
                            "author": "GenIISD",
                            "id": "gwq7pcv",
                            "parent_id": "t1_gwq7779",
                            "score": 2,
                            "created_utc": 1620001646.0,
                            "replies": [
                                {
                                    "body": "I’m responding to him that way because of his history with how he comments, and specifically his past comments towards me. Not solely this one-off time.",
                                    "author": "Cdnsugarr",
                                    "id": "gwq7stx",
                                    "parent_id": "t1_gwq7pcv",
                                    "score": 13,
                                    "created_utc": 1620001696.0,
                                    "replies": [
                                        {
                                            "body": "I see. I will recuse myself from any further comments because there are underlying factors that I am not knowledgeable of.",
                                            "author": "GenIISD",
                                            "id": "gwq8uza",
                                            "parent_id": "t1_gwq7stx",
                                            "score": 10,
                                            "created_utc": 1620002270.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "That has been my experience too, but there are always outliers, and that’s okay.",
                    "author": "GenIISD",
                    "id": "gwq7c52",
                    "parent_id": "t1_gwq71r6",
                    "score": 4,
                    "created_utc": 1620001443.0,
                    "replies": [
                        {
                            "body": "We probably just don’t connect with the outliers 😉",
                            "author": null,
                            "id": "gwq84b2",
                            "parent_id": "t1_gwq7c52",
                            "score": -9,
                            "created_utc": 1620001870.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "See, we would probably totally mesh. This isn’t for everyone, but I’m not for everyone either. In addition to me always gifting a grant or benji in a small thank-you note at the M&G, if we click and I think I want an arrangement, spending more time to learn about her and gifting something that is 10-50% of her PPM ask at the M&G has always gotten a positive response.",
            "author": "GenIISD",
            "id": "gwqqks5",
            "parent_id": "t1_gwqmg8e",
            "score": 8,
            "created_utc": 1620012244.0,
            "replies": [
                {
                    "body": "That’s my take on my own experience in the bowl- I’m not going to be perfect for everyone, and that’s fine! Self-awareness is super important, so at least you’re owning that.\n\nI think people are also missing the point that this isn’t the only form of “allowance” you’re sharing, just a portion of it. It’s a great idea for getting to know someone better in an easy environment. I also grew up in a small town and places like TJ Maxx were all we had nearby, so I appreciate someone else recognizing that experience as a common reality.",
                    "author": "PrincessPeach9315",
                    "id": "gwqr8xq",
                    "parent_id": "t1_gwqqks5",
                    "score": 6,
                    "created_utc": 1620012668.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Thanks! Appreciate your kind words. And most astute point.",
            "author": "GenIISD",
            "id": "gwqu0nd",
            "parent_id": "t1_gwqttb4",
            "score": 5,
            "created_utc": 1620014457.0,
            "replies": []
        },
        {
            "body": "I agree. TJM or not, it’s a cool, unique idea and has clearly worked for him.",
            "author": "ekin77",
            "id": "gwsbyq3",
            "parent_id": "t1_gwqttb4",
            "score": 3,
            "created_utc": 1620052208.0,
            "replies": []
        },
        {
            "body": "That’s an awesome story, thanks for sharing. One person’s trash is another one’s treasure. I remember one antique dealer that procures books for me talking about finding a book worth into the four figures for under a dollar at a thrift store. Another story I came across was of a thrift hunter finding a Louis Vuitton belt with a gold buckle that sold vintage into the four figures for her, but cost her under five at a thrift shop (and her “job” is going to thrift shops and garage sales and flipping their stuff online - makes generally double six figures yearly doing that).\n\nIt’s all about what people are comfortable with and open to, but our culture has seemed to blur the difference between cheap and good value, and some responses definitely reveal that.",
            "author": "GenIISD",
            "id": "gwsq7ug",
            "parent_id": "t1_gwsm105",
            "score": 2,
            "created_utc": 1620058330.0,
            "replies": []
        },
        {
            "body": "That’s definitely your prerogative to hate shopping, and so this would be a bad plan for you. Not an indication of how good of a person or SD you are at all.\n\nIn regards to malls being everywhere, this sadly is not the case geographically for most of the United States anymore. Malls are closing left and right in smaller towns, and to get to a mall as opposed to just a good restaurant where I sugar, you’re talking about 45 minutes each way as opposed to 5-10.",
            "author": "GenIISD",
            "id": "gwq6vrz",
            "parent_id": "t1_gwq5ffe",
            "score": 1,
            "created_utc": 1620001196.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "gwqds7u",
                    "parent_id": "t1_gwq6vrz",
                    "score": 6,
                    "created_utc": 1620004989.0,
                    "replies": [
                        {
                            "body": "See though, TJMaxx tends to be an anchor store in those strip malls. Retail is changing, especially post Covid. The variety is also a draw. Maybe a purse is preferred, maybe a necklace, maybe a body care gift set. They also have later hours than most boutique places, and that tends to work with my schedule.\n\nHave to work with what you have available. The Lenox mall in Atlanta or similar would be my first choice, but that isn’t really an option.",
                            "author": "GenIISD",
                            "id": "gwqfqmn",
                            "parent_id": "t1_gwqds7u",
                            "score": 3,
                            "created_utc": 1620006079.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Also, not all malls have 'High End' in them, if that's what you're specifically looking for. I'm in a city & the only malls with 'high end' are either Downtown or in very rich areas. The rest have average stores with average clothes.",
                    "author": "ShaArt5",
                    "id": "gwqrgf0",
                    "parent_id": "t1_gwq6vrz",
                    "score": 2,
                    "created_utc": 1620012798.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Thank you! Where else can you buy a Coleman sleeping bag, a Husky utility knife, a Kate Spade handbag, a Yeti cooler, gold earrings, pasta made in Italy and a Le Creuset enameled dutch oven?\n\nThey have done a unique job filling in a niche of in-person shopping that the internet cannot really threaten.",
            "author": "GenIISD",
            "id": "gwqd8fe",
            "parent_id": "t1_gwqax57",
            "score": 18,
            "created_utc": 1620004687.0,
            "replies": []
        },
        {
            "body": "West Palm Beach. It is one of my “jet off” locations to take my SB once things are well established. Luxury shopping, nice beach condos and quality restaurants.",
            "author": "GenIISD",
            "id": "gwqa2jt",
            "parent_id": "t1_gwq9r1e",
            "score": 7,
            "created_utc": 1620002940.0,
            "replies": []
        },
        {
            "body": "Hi, would you mind if I DM you? I’d like to pick your brain. I’ve been reading here for a while, and your comment seems like you’d have some good advice/education.",
            "author": "jb_ninja",
            "id": "gwtcxpk",
            "parent_id": "t1_gwt8ysl",
            "score": 2,
            "created_utc": 1620067842.0,
            "replies": [
                {
                    "body": "sure go right ahead.",
                    "author": "SouthernGentSD",
                    "id": "gwtflzn",
                    "parent_id": "t1_gwtcxpk",
                    "score": 2,
                    "created_utc": 1620068984.0,
                    "replies": []
                }
            ]
        },
        {
            "body": ".... I need to know of this magical shoe store. Also love your use of “utterly delights” 😂 \nSometimes I get embarrassed for my equal love of bargain stores but then I look cute as hell and I shrug it off.",
            "author": "PrincessPeach9315",
            "id": "gwulgnx",
            "parent_id": "t1_gwt8ysl",
            "score": 1,
            "created_utc": 1620088011.0,
            "replies": [
                {
                    "body": "So the owners of this shoe store have agreements with distributors at a lot of retailers and I think some high-end department stores where they will take their seconds and unused inventories. They get shipments from these places every day. \n\nThe store itself is just row after row of tables with shoes on them. Whenever you go in there, you never know what you will find. The men’s section is much smaller than the women’s section and the men’s shoes are not ordered in any way, not even by size. However the women’s tables are labeled by size but are otherwise not ordered in any way. So the only way to find shoes is to look through the whole inventory. But I really enjoy doing that. \n\n“Utterly delighted” may be a bit of a flourish, but it’s  an accurate descriptor.",
                    "author": "SouthernGentSD",
                    "id": "gwumuf3",
                    "parent_id": "t1_gwulgnx",
                    "score": 1,
                    "created_utc": 1620088687.0,
                    "replies": [
                        {
                            "body": "Sounds awesome! I’m also in the South so maybe I’ll stumble on it someday lol",
                            "author": "PrincessPeach9315",
                            "id": "gwuneit",
                            "parent_id": "t1_gwumuf3",
                            "score": 1,
                            "created_utc": 1620088957.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "It’s personal preference for sure, I like knowing enough to be able to have surprise gifts for her most visits that are things she’ll like/use. Different strokes for different folks.",
            "author": "GenIISD",
            "id": "gwqaxb0",
            "parent_id": "t1_gwqa6qc",
            "score": 1,
            "created_utc": 1620003406.0,
            "replies": []
        },
        {
            "body": "Same! I love TJMaxx but i couldn’t imagine having 30 minutes 😔",
            "author": "Xx_spacey_kitten_xX",
            "id": "gwrt4p8",
            "parent_id": "t1_gwrbvn8",
            "score": 2,
            "created_utc": 1620042684.0,
            "replies": []
        },
        {
            "body": "My MO is to have a grant or benji tucked inside a thank-you note and give it to them within a few minutes of the start of the M&G just to make sure gas/transportation/make-up/etc. doesn’t put them in the red for spending time - even briefly - with me. \n\nIt may be partially because I am under 40 and need to show I understand and am serious about being generous - at least relative to the competition - but spending time together with a potential SB and definitely once in an arrangement always has an outflow of money from me to her. It may be Broadway tickets or shopping or museum admission or Dave & Busters play card cost; but in addition to meal costs and allowance gifting, I am spending money on “dating” activities. \n\nThat’s how I feel a sugar arrangement should be. Sugar dating is dating, but with sugar. A strict budget takes the fun out of it. As a real SD, it shouldn’t matter if I spend twenty on museum admission or three benjis on show tickets or a couple benjis on a bit of shopping or fly her out to a beach resort for the weekend and drop a couple/few grand. It’s fun and the time together is fantastic, and that’s what matters.",
            "author": "GenIISD",
            "id": "gws3rl0",
            "parent_id": "t1_gws0a81",
            "score": 3,
            "created_utc": 1620048431.0,
            "replies": [
                {
                    "body": "I see you may have posted a number which is most likely an amount in relations to an arrangement. If this is the case, you are violating Rule #4 - \"No dollar amounts that are in reference to allowance/PPM are allowed.\"\n\nIf you are curious about Allowances reported by SLF contributors please see the [Allowance Master Thread 2020-2021](/r/sugarlifestyleforum/comments/ja37xt/allowance_master_thread_20202021/).\n\nYour post will not be approved until you remove the amount.  Please read the sub [Rules](/r/sugarlifestyleforum/comments/748zta/updated_and_clarified_rules_for_slf/) prior to posting anything else. \n\nIf you simply posted a number not referencing a monetary amount, please message the MODs to approve your post.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/sugarlifestyleforum) if you have any questions or concerns.*",
                    "author": "AutoModerator",
                    "id": "gws3rmb",
                    "parent_id": "t1_gws3rl0",
                    "score": 0,
                    "created_utc": 1620048431.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "It's a discount store with brand name items.  Maybe from last year or slightly irregular.  Marshall's and Ross are similar if you know them.",
            "author": "tamenwild",
            "id": "gwqbxm4",
            "parent_id": "t1_gwq9h8v",
            "score": 9,
            "created_utc": 1620003963.0,
            "replies": []
        },
        {
            "body": "It would have some overlap but with a wider range of brands and product lines.",
            "author": "GenIISD",
            "id": "gwqa5po",
            "parent_id": "t1_gwq9h8v",
            "score": 2,
            "created_utc": 1620002987.0,
            "replies": []
        },
        {
            "body": "I will hook you up with some Charleston Chew from Dollar Tree! \n\nFor me it’s really about learning more about the pot SB and being surrounded by props to create comedic/flirtatious opportunities than the actual shopping.  But if you hate shopping, fuck it, let’s do something you’re going to like and I’ll learn more about you then while we both enjoy ourselves.",
            "author": "GenIISD",
            "id": "gwqrwkv",
            "parent_id": "t1_gwqbska",
            "score": 1,
            "created_utc": 1620013080.0,
            "replies": [
                {
                    "body": "Agreed, although i can imagine in this lifestyle it might be difficult. Women and men are different naturally, then you have the age gap to deal with. Despite the fact that i hate shopping i'll do it once in a while because i'm a team player.",
                    "author": "pintodinosaur",
                    "id": "gwsr2c3",
                    "parent_id": "t1_gwqrwkv",
                    "score": 1,
                    "created_utc": 1620058691.0,
                    "replies": [
                        {
                            "body": "Age gap is normally only at 10-ish for me, so that does seem to change the dynamic too. I had one M&G that did not progress to TJM or any more time together, and the POT commented over a dozen times that she just can’t believe she is sitting across from someone who doesn’t have gray hair. Honestly made it awkward - she thought my pics were old/fake and still came to meet me. \n\nBut once I know scents and colors and a few other preferences, I do most of my surprise gift buying outside of time with my SB. I just like always having something little extra to make it feel like gifting and not paying. It helps me keep a more positive view of the situation.",
                            "author": "GenIISD",
                            "id": "gwss8kk",
                            "parent_id": "t1_gwsr2c3",
                            "score": 1,
                            "created_utc": 1620059182.0,
                            "replies": [
                                {
                                    "body": "At 10 the age gap can still be big depending on ages. For example, i'm early thirties, for me 10 year age gap is early 20's. The difference between a 21-23 year old and my thought process/experience/likes are huge from what i have seen. I think it's cool you go the extra mile. I suck at gifting so even when i know someone for ever, it's still hard for me to gift.",
                                    "author": "pintodinosaur",
                                    "id": "gwt01gy",
                                    "parent_id": "t1_gwss8kk",
                                    "score": 1,
                                    "created_utc": 1620062483.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "If you’re talking about climbing into bed with someone the next time you’re together, but the thought of standing a few inches away/having your shoulders briefly brush when walking through a store is cringe, you’re not sugaring right. \n\nBut, you also communicate in other comments that aspiring SBs should “demand payment for a first meet.” So you’re definitely supporting a rinser/scammer/prostitute approach to the sugar bowl instead of the healthy sugar dating approach that I take and support. Natural attraction is vital for a fun SR, and if one or both parties isn’t feeling that, the search needs to continue.",
            "author": "GenIISD",
            "id": "gwsdwsj",
            "parent_id": "t1_gws95q3",
            "score": 1,
            "created_utc": 1620053099.0,
            "replies": [
                {
                    "body": ">Natural attraction is vital for a fun SR\n\nI have bad news, buddy: for the most part, they're there for the money. Which is great, but don't delude yourself.\n\nThe cringeworthy part of what you said was the notion that you are grandstanding a rather sad way to impose physical contact.\n\nAnd I am absolutely not supporting a \"rinser/scammer/prostitute approach\". I'm advocating for techniques that reduce SB's exposure to men who won't provide sugar.",
                    "author": "Anoonnyymmoous",
                    "id": "gwstq2f",
                    "parent_id": "t1_gwsdwsj",
                    "score": 0,
                    "created_utc": 1620059815.0,
                    "replies": [
                        {
                            "body": "Not deluded at all, and 100% accurate with what I’ve stated. I’m in my 30s and use sugaring to keep expectations in check (don’t want to do the ring thing/sugaring is a lot cheaper than having a lady run off with half my portfolio in five to ten years). Completely understand the money matters, and it is what opens the door. I’ve ended multiple SRs that were getting too clingy and been countered with switching to vanilla dating by the POT. So, there was a lot more in her eyes than the money once things got underway.\n\nThere is no imposition for physical contact in what I shared. If we are a foot apart and I move eight inches towards her and she moves four inches towards me and our shoulders touch; that isn’t imposition, that’s chemistry. I may be taking the lead a bit, but it isn’t imposition - it isn’t forced at all. I read her body language and act accordingly and with respect and reserve. My post is far from grandstanding. The last time I took a pot to TJM, her hands we’re definitely on me more than mine were beginning to come close to her.\n\nAnd demanding payment for the M&G isn’t a way to make sure you get sugar, it’s a way to drive off the kindest and most generous ones who have been burned in the past with the scammers that collect for a M&G and then ghost.",
                            "author": "GenIISD",
                            "id": "gwsx19c",
                            "parent_id": "t1_gwstq2f",
                            "score": 4,
                            "created_utc": 1620061210.0,
                            "replies": [
                                {
                                    "body": "I love this comment",
                                    "author": "SassySugar4u",
                                    "id": "gynsowa",
                                    "parent_id": "t1_gwsx19c",
                                    "score": 3,
                                    "created_utc": 1621399800.0,
                                    "replies": []
                                },
                                {
                                    "body": ">And demanding payment for the M&G isn’t a way to make sure you get sugar, it’s a way to drive off the kindest and most generous ones who have been burned in the past with the scammers that collect for a M&G and then ghost.\n\nI'm of the opinion that the person with all of the power should be taking the risk. You disagree. I also think you have clearly demonstrated you are not \"the kindest and most generous\" through your words here. I'm sure you disagree about that, as well. We're done here.",
                                    "author": "Anoonnyymmoous",
                                    "id": "gwtbag3",
                                    "parent_id": "t1_gwsx19c",
                                    "score": 1,
                                    "created_utc": 1620067152.0,
                                    "replies": [
                                        {
                                            "body": "This is a toxic mentality. There is NOT one person with all the power. Any SB that thinks she has no power has believed a lie. You have the power to demand respect and next if respect is not shown. You have the power to communicate your needs and next if they will not be met (not only financial needs but also mental, social and emotional). You have the power to insist upon meeting in public and not be forced to meet at a hotel first. You have the power to leave whenever you please. You have the power to insist upon a platonic first meet (you should next the pot if you’re having to insist upon it). You have the power to seek a quality sugar mentor of an experienced SB that can help you navigate the bowl. You have the power to say “no.” You have the power to keep you legs closed. To all aspiring and current SBs, don’t fall for the B.S. that you have no power. You do, and anyone that treats you like you don’t or attempts to brainwash you into thinking you don’t deserves to have their input and thoughts ignored. \n\nAny healthy relationship is about give and take. If the SD had ALL the power, there would be no need to have different allowances or to work to differentiate oneself as a better SD option than others. Sugar dating shifts the power from being the 95/5 split that normal dating has to probably a 40/60 to 20/80 split in favor of the sugar parent. But that does not mean ALL power rests with the SD. \n\nThe M&G is a two-way interview to see if there is compatibility to start an arrangement. I never commit to paying for one and next those with low level thinking that insist upon it, but I also always gift a small amount of cash to show I appreciate the SB and to show I will gift beyond commitment. It allows me to avoid rinser/scammers/idiots who believe what they see online and to meet quality and understanding pots that I tend to click with. I could have had a lot more M&Gs, but they would have been with lower caliber and generally conceited individuals and would not have led to a SR.",
                                            "author": "GenIISD",
                                            "id": "gwtq6s2",
                                            "parent_id": "t1_gwtbag3",
                                            "score": 2,
                                            "created_utc": 1620073581.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Taking someone shopping that I want to pursue an arrangement with will set me up to be treated like a doormat?",
            "author": "GenIISD",
            "id": "gwqjdhq",
            "parent_id": "t1_gwqgwe5",
            "score": 5,
            "created_utc": 1620008076.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "gwr5pzd",
                    "parent_id": "t1_gwqjdhq",
                    "score": -9,
                    "created_utc": 1620023449.0,
                    "replies": [
                        {
                            "body": "can you elaborate on how they’d be treated like a doormat? 😳",
                            "author": "Xx_spacey_kitten_xX",
                            "id": "gwrt762",
                            "parent_id": "t1_gwr5pzd",
                            "score": 2,
                            "created_utc": 1620042724.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Why do you think that?",
            "author": "Aromatic_Advice1426",
            "id": "gwrp36k",
            "parent_id": "t1_gwqgwe5",
            "score": 2,
            "created_utc": 1620040121.0,
            "replies": []
        },
        {
            "body": "Thank you both for your kind words. Feels good knowing this is some SBs reaction to this approach. \n\nThe last time I did this, and I’m hoping things work out into a long term arrangement, the way the pot started looking at me about half way through is the only time I’ve ever had flashbacks to when my late fiancé would look at me when I was flirting with her. \n\nA pot that doesn’t appreciate a gift worth ten to thirty Starbucks drinks for just the M&G is definitely wanting to experience a different place in the bowl than where I hang.",
            "author": "GenIISD",
            "id": "gwtdsbj",
            "parent_id": "t1_gwqzj00",
            "score": 4,
            "created_utc": 1620068202.0,
            "replies": [
                {
                    "body": "This is a super great idea. The extra time to test the chemistry, the playful flirtation, the getting to know little oddball things about one another. Ugh, my heart would melt. \n\nAnd I don’t understand why people were not understanding the kind of area that you’re in and why TJ Maxx is one of the best options. Not everything gotta come straight out of Louis Vuitton.",
                    "author": null,
                    "id": "gwvuol3",
                    "parent_id": "t1_gwtdsbj",
                    "score": 2,
                    "created_utc": 1620116899.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "It’s more about getting to know the POT than the actual shopping experience for me. And it is just an extension of the M&G. What’s her favorite body care scent, color, precious metal, handbag type, precious/semi-precious stone, etc. Knowing that allows me to get random things to pair with the PPM/allowance down the road and make it seem/feel less transactional. Who gives a prostitute a bottle of bubble bath in their favorite scent or an anklet made with gold/rose gold/white gold with a birthstone charm based on favorite precious metal? For me and for the people I’ve sugar dated, it’s a nice little extra that elevates the experience. To each their own, but I enjoy knowing enough to spoil with things that will be used and enjoyed.",
            "author": "GenIISD",
            "id": "gws9yt2",
            "parent_id": "t1_gws293f",
            "score": 5,
            "created_utc": 1620051292.0,
            "replies": []
        },
        {
            "body": "Nah. I’m not. Thank God I’m not in the Midwest. The only possible benefit is the PPM is possibly lower but you also have way fewer SB because everyone is married.",
            "author": "UnearthlyDinosaur",
            "id": "gwqrzqt",
            "parent_id": "t1_gwqlfwm",
            "score": 8,
            "created_utc": 1620013135.0,
            "replies": [
                {
                    "body": "Being in a more rural, LCOL area is definitely an exchange. There are SBs/aspiring SBs on SLF that wouldn’t consider it a mall if it didn’t have Neiman Marcus. I do definitely enjoy malls with Burberry, Brooks Brothers, etc., but that isn’t M&G shopping from my view, and that option is hours away. The closest mall has the Boscov, Kohls, JCPenny vibe; and it’s still over 30 minutes away.",
                    "author": "GenIISD",
                    "id": "gwqtekd",
                    "parent_id": "t1_gwqrzqt",
                    "score": 5,
                    "created_utc": 1620014047.0,
                    "replies": []
                },
                {
                    "body": "So true..",
                    "author": "DarkandHandsome987",
                    "id": "gws74pg",
                    "parent_id": "t1_gwqrzqt",
                    "score": 2,
                    "created_utc": 1620049962.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "IDK, I’m in a major metro area and I’m still a basic bitch who loves Target! I think this sounds really cute and fun.",
            "author": null,
            "id": "gwujnbt",
            "parent_id": "t1_gwqlfwm",
            "score": 3,
            "created_utc": 1620087140.0,
            "replies": []
        },
        {
            "body": "There’s no Nordstrom or Neiman Marcus or something like that where you are? Even Macy’s?",
            "author": null,
            "id": "gwrgsi5",
            "parent_id": "t1_gwqinsx",
            "score": 7,
            "created_utc": 1620033803.0,
            "replies": [
                {
                    "body": "Nope - it’s Target, Walmart, Dollar General and TJM. It is the nice place to shop in town, otherwise you’re driving over an hour round trip.",
                    "author": "GenIISD",
                    "id": "gwrxuk9",
                    "parent_id": "t1_gwrgsi5",
                    "score": 3,
                    "created_utc": 1620045431.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Im just teasing! :)",
            "author": "slfsd20201",
            "id": "gwqrvyo",
            "parent_id": "t1_gwqq1h1",
            "score": 2,
            "created_utc": 1620013069.0,
            "replies": [
                {
                    "body": "All good!",
                    "author": "GenIISD",
                    "id": "gwqsffg",
                    "parent_id": "t1_gwqrvyo",
                    "score": 2,
                    "created_utc": 1620013416.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Agreed! \n\nIt’s always just made me feel awkward. 😂",
            "author": "Cdnsugarr",
            "id": "gwq7bq1",
            "parent_id": "t1_gwq75iv",
            "score": 10,
            "created_utc": 1620001436.0,
            "replies": [
                {
                    "body": "Definitely a bad idea then, and if we ever meet and I ask if you’d like to do it, please turn me down? \n\nWhat are some other engaging activities that you would enjoy to keep a M&G going if things went well?",
                    "author": "GenIISD",
                    "id": "gwq8piu",
                    "parent_id": "t1_gwq7bq1",
                    "score": 0,
                    "created_utc": 1620002189.0,
                    "replies": [
                        {
                            "body": "Well, most of mine have just been coffee but we are super locked down still. \n\nI live in a city with a wonderful river valley and full\nOf trails so if it’s warm, it’s great to get outside! We have a street here that’s full of more unique shops (local art, used book store with a shop cat and a great selection of unique and rare books, delicious and varying street foods like Filipino iced cream!) that are lovely for just wandering and sparking conversation. \n\nHowever, for M&G I really don’t prefer it to be very long, personally.",
                            "author": "Cdnsugarr",
                            "id": "gwq9mi8",
                            "parent_id": "t1_gwq8piu",
                            "score": 3,
                            "created_utc": 1620002694.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I do love the creativity! And I do love wandering those stores aimlessly. I just don’t want to combine the two when I don’t know someone yet. 😂\n\nI think it’s hard to tell someone what kind of gifts you want unless everything is laid out for you. What’s the value, is it on top of ppm/allowance, those kinds of things.",
            "author": "Cdnsugarr",
            "id": "gwsgrxq",
            "parent_id": "t1_gws151j",
            "score": 1,
            "created_utc": 1620054379.0,
            "replies": []
        },
        {
            "body": "I’m glad you know most women. You can keep me up to date on the changes in our collective preferences.",
            "author": "Cdnsugarr",
            "id": "gwq7779",
            "parent_id": "t1_gwq71r6",
            "score": 18,
            "created_utc": 1620001368.0,
            "replies": [
                {
                    "body": "“I find most women” is specifically talking about his experience. It doesn’t seem he was trying to indicate women’s collective preferences, but rather his collective experience. Feel like this is a notable difference between someone being borderline sexist and what he did with just relating his personal experience.",
                    "author": "GenIISD",
                    "id": "gwq7pcv",
                    "parent_id": "t1_gwq7779",
                    "score": 2,
                    "created_utc": 1620001646.0,
                    "replies": [
                        {
                            "body": "I’m responding to him that way because of his history with how he comments, and specifically his past comments towards me. Not solely this one-off time.",
                            "author": "Cdnsugarr",
                            "id": "gwq7stx",
                            "parent_id": "t1_gwq7pcv",
                            "score": 13,
                            "created_utc": 1620001696.0,
                            "replies": [
                                {
                                    "body": "I see. I will recuse myself from any further comments because there are underlying factors that I am not knowledgeable of.",
                                    "author": "GenIISD",
                                    "id": "gwq8uza",
                                    "parent_id": "t1_gwq7stx",
                                    "score": 10,
                                    "created_utc": 1620002270.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "That has been my experience too, but there are always outliers, and that’s okay.",
            "author": "GenIISD",
            "id": "gwq7c52",
            "parent_id": "t1_gwq71r6",
            "score": 4,
            "created_utc": 1620001443.0,
            "replies": [
                {
                    "body": "We probably just don’t connect with the outliers 😉",
                    "author": null,
                    "id": "gwq84b2",
                    "parent_id": "t1_gwq7c52",
                    "score": -9,
                    "created_utc": 1620001870.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "That’s my take on my own experience in the bowl- I’m not going to be perfect for everyone, and that’s fine! Self-awareness is super important, so at least you’re owning that.\n\nI think people are also missing the point that this isn’t the only form of “allowance” you’re sharing, just a portion of it. It’s a great idea for getting to know someone better in an easy environment. I also grew up in a small town and places like TJ Maxx were all we had nearby, so I appreciate someone else recognizing that experience as a common reality.",
            "author": "PrincessPeach9315",
            "id": "gwqr8xq",
            "parent_id": "t1_gwqqks5",
            "score": 6,
            "created_utc": 1620012668.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gwqds7u",
            "parent_id": "t1_gwq6vrz",
            "score": 6,
            "created_utc": 1620004989.0,
            "replies": [
                {
                    "body": "See though, TJMaxx tends to be an anchor store in those strip malls. Retail is changing, especially post Covid. The variety is also a draw. Maybe a purse is preferred, maybe a necklace, maybe a body care gift set. They also have later hours than most boutique places, and that tends to work with my schedule.\n\nHave to work with what you have available. The Lenox mall in Atlanta or similar would be my first choice, but that isn’t really an option.",
                    "author": "GenIISD",
                    "id": "gwqfqmn",
                    "parent_id": "t1_gwqds7u",
                    "score": 3,
                    "created_utc": 1620006079.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Also, not all malls have 'High End' in them, if that's what you're specifically looking for. I'm in a city & the only malls with 'high end' are either Downtown or in very rich areas. The rest have average stores with average clothes.",
            "author": "ShaArt5",
            "id": "gwqrgf0",
            "parent_id": "t1_gwq6vrz",
            "score": 2,
            "created_utc": 1620012798.0,
            "replies": []
        },
        {
            "body": "sure go right ahead.",
            "author": "SouthernGentSD",
            "id": "gwtflzn",
            "parent_id": "t1_gwtcxpk",
            "score": 2,
            "created_utc": 1620068984.0,
            "replies": []
        },
        {
            "body": "So the owners of this shoe store have agreements with distributors at a lot of retailers and I think some high-end department stores where they will take their seconds and unused inventories. They get shipments from these places every day. \n\nThe store itself is just row after row of tables with shoes on them. Whenever you go in there, you never know what you will find. The men’s section is much smaller than the women’s section and the men’s shoes are not ordered in any way, not even by size. However the women’s tables are labeled by size but are otherwise not ordered in any way. So the only way to find shoes is to look through the whole inventory. But I really enjoy doing that. \n\n“Utterly delighted” may be a bit of a flourish, but it’s  an accurate descriptor.",
            "author": "SouthernGentSD",
            "id": "gwumuf3",
            "parent_id": "t1_gwulgnx",
            "score": 1,
            "created_utc": 1620088687.0,
            "replies": [
                {
                    "body": "Sounds awesome! I’m also in the South so maybe I’ll stumble on it someday lol",
                    "author": "PrincessPeach9315",
                    "id": "gwuneit",
                    "parent_id": "t1_gwumuf3",
                    "score": 1,
                    "created_utc": 1620088957.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I see you may have posted a number which is most likely an amount in relations to an arrangement. If this is the case, you are violating Rule #4 - \"No dollar amounts that are in reference to allowance/PPM are allowed.\"\n\nIf you are curious about Allowances reported by SLF contributors please see the [Allowance Master Thread 2020-2021](/r/sugarlifestyleforum/comments/ja37xt/allowance_master_thread_20202021/).\n\nYour post will not be approved until you remove the amount.  Please read the sub [Rules](/r/sugarlifestyleforum/comments/748zta/updated_and_clarified_rules_for_slf/) prior to posting anything else. \n\nIf you simply posted a number not referencing a monetary amount, please message the MODs to approve your post.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/sugarlifestyleforum) if you have any questions or concerns.*",
            "author": "AutoModerator",
            "id": "gws3rmb",
            "parent_id": "t1_gws3rl0",
            "score": 0,
            "created_utc": 1620048431.0,
            "replies": []
        },
        {
            "body": "Agreed, although i can imagine in this lifestyle it might be difficult. Women and men are different naturally, then you have the age gap to deal with. Despite the fact that i hate shopping i'll do it once in a while because i'm a team player.",
            "author": "pintodinosaur",
            "id": "gwsr2c3",
            "parent_id": "t1_gwqrwkv",
            "score": 1,
            "created_utc": 1620058691.0,
            "replies": [
                {
                    "body": "Age gap is normally only at 10-ish for me, so that does seem to change the dynamic too. I had one M&G that did not progress to TJM or any more time together, and the POT commented over a dozen times that she just can’t believe she is sitting across from someone who doesn’t have gray hair. Honestly made it awkward - she thought my pics were old/fake and still came to meet me. \n\nBut once I know scents and colors and a few other preferences, I do most of my surprise gift buying outside of time with my SB. I just like always having something little extra to make it feel like gifting and not paying. It helps me keep a more positive view of the situation.",
                    "author": "GenIISD",
                    "id": "gwss8kk",
                    "parent_id": "t1_gwsr2c3",
                    "score": 1,
                    "created_utc": 1620059182.0,
                    "replies": [
                        {
                            "body": "At 10 the age gap can still be big depending on ages. For example, i'm early thirties, for me 10 year age gap is early 20's. The difference between a 21-23 year old and my thought process/experience/likes are huge from what i have seen. I think it's cool you go the extra mile. I suck at gifting so even when i know someone for ever, it's still hard for me to gift.",
                            "author": "pintodinosaur",
                            "id": "gwt01gy",
                            "parent_id": "t1_gwss8kk",
                            "score": 1,
                            "created_utc": 1620062483.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": ">Natural attraction is vital for a fun SR\n\nI have bad news, buddy: for the most part, they're there for the money. Which is great, but don't delude yourself.\n\nThe cringeworthy part of what you said was the notion that you are grandstanding a rather sad way to impose physical contact.\n\nAnd I am absolutely not supporting a \"rinser/scammer/prostitute approach\". I'm advocating for techniques that reduce SB's exposure to men who won't provide sugar.",
            "author": "Anoonnyymmoous",
            "id": "gwstq2f",
            "parent_id": "t1_gwsdwsj",
            "score": 0,
            "created_utc": 1620059815.0,
            "replies": [
                {
                    "body": "Not deluded at all, and 100% accurate with what I’ve stated. I’m in my 30s and use sugaring to keep expectations in check (don’t want to do the ring thing/sugaring is a lot cheaper than having a lady run off with half my portfolio in five to ten years). Completely understand the money matters, and it is what opens the door. I’ve ended multiple SRs that were getting too clingy and been countered with switching to vanilla dating by the POT. So, there was a lot more in her eyes than the money once things got underway.\n\nThere is no imposition for physical contact in what I shared. If we are a foot apart and I move eight inches towards her and she moves four inches towards me and our shoulders touch; that isn’t imposition, that’s chemistry. I may be taking the lead a bit, but it isn’t imposition - it isn’t forced at all. I read her body language and act accordingly and with respect and reserve. My post is far from grandstanding. The last time I took a pot to TJM, her hands we’re definitely on me more than mine were beginning to come close to her.\n\nAnd demanding payment for the M&G isn’t a way to make sure you get sugar, it’s a way to drive off the kindest and most generous ones who have been burned in the past with the scammers that collect for a M&G and then ghost.",
                    "author": "GenIISD",
                    "id": "gwsx19c",
                    "parent_id": "t1_gwstq2f",
                    "score": 4,
                    "created_utc": 1620061210.0,
                    "replies": [
                        {
                            "body": "I love this comment",
                            "author": "SassySugar4u",
                            "id": "gynsowa",
                            "parent_id": "t1_gwsx19c",
                            "score": 3,
                            "created_utc": 1621399800.0,
                            "replies": []
                        },
                        {
                            "body": ">And demanding payment for the M&G isn’t a way to make sure you get sugar, it’s a way to drive off the kindest and most generous ones who have been burned in the past with the scammers that collect for a M&G and then ghost.\n\nI'm of the opinion that the person with all of the power should be taking the risk. You disagree. I also think you have clearly demonstrated you are not \"the kindest and most generous\" through your words here. I'm sure you disagree about that, as well. We're done here.",
                            "author": "Anoonnyymmoous",
                            "id": "gwtbag3",
                            "parent_id": "t1_gwsx19c",
                            "score": 1,
                            "created_utc": 1620067152.0,
                            "replies": [
                                {
                                    "body": "This is a toxic mentality. There is NOT one person with all the power. Any SB that thinks she has no power has believed a lie. You have the power to demand respect and next if respect is not shown. You have the power to communicate your needs and next if they will not be met (not only financial needs but also mental, social and emotional). You have the power to insist upon meeting in public and not be forced to meet at a hotel first. You have the power to leave whenever you please. You have the power to insist upon a platonic first meet (you should next the pot if you’re having to insist upon it). You have the power to seek a quality sugar mentor of an experienced SB that can help you navigate the bowl. You have the power to say “no.” You have the power to keep you legs closed. To all aspiring and current SBs, don’t fall for the B.S. that you have no power. You do, and anyone that treats you like you don’t or attempts to brainwash you into thinking you don’t deserves to have their input and thoughts ignored. \n\nAny healthy relationship is about give and take. If the SD had ALL the power, there would be no need to have different allowances or to work to differentiate oneself as a better SD option than others. Sugar dating shifts the power from being the 95/5 split that normal dating has to probably a 40/60 to 20/80 split in favor of the sugar parent. But that does not mean ALL power rests with the SD. \n\nThe M&G is a two-way interview to see if there is compatibility to start an arrangement. I never commit to paying for one and next those with low level thinking that insist upon it, but I also always gift a small amount of cash to show I appreciate the SB and to show I will gift beyond commitment. It allows me to avoid rinser/scammers/idiots who believe what they see online and to meet quality and understanding pots that I tend to click with. I could have had a lot more M&Gs, but they would have been with lower caliber and generally conceited individuals and would not have led to a SR.",
                                    "author": "GenIISD",
                                    "id": "gwtq6s2",
                                    "parent_id": "t1_gwtbag3",
                                    "score": 2,
                                    "created_utc": 1620073581.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gwr5pzd",
            "parent_id": "t1_gwqjdhq",
            "score": -9,
            "created_utc": 1620023449.0,
            "replies": [
                {
                    "body": "can you elaborate on how they’d be treated like a doormat? 😳",
                    "author": "Xx_spacey_kitten_xX",
                    "id": "gwrt762",
                    "parent_id": "t1_gwr5pzd",
                    "score": 2,
                    "created_utc": 1620042724.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "This is a super great idea. The extra time to test the chemistry, the playful flirtation, the getting to know little oddball things about one another. Ugh, my heart would melt. \n\nAnd I don’t understand why people were not understanding the kind of area that you’re in and why TJ Maxx is one of the best options. Not everything gotta come straight out of Louis Vuitton.",
            "author": null,
            "id": "gwvuol3",
            "parent_id": "t1_gwtdsbj",
            "score": 2,
            "created_utc": 1620116899.0,
            "replies": []
        },
        {
            "body": "Being in a more rural, LCOL area is definitely an exchange. There are SBs/aspiring SBs on SLF that wouldn’t consider it a mall if it didn’t have Neiman Marcus. I do definitely enjoy malls with Burberry, Brooks Brothers, etc., but that isn’t M&G shopping from my view, and that option is hours away. The closest mall has the Boscov, Kohls, JCPenny vibe; and it’s still over 30 minutes away.",
            "author": "GenIISD",
            "id": "gwqtekd",
            "parent_id": "t1_gwqrzqt",
            "score": 5,
            "created_utc": 1620014047.0,
            "replies": []
        },
        {
            "body": "So true..",
            "author": "DarkandHandsome987",
            "id": "gws74pg",
            "parent_id": "t1_gwqrzqt",
            "score": 2,
            "created_utc": 1620049962.0,
            "replies": []
        },
        {
            "body": "Nope - it’s Target, Walmart, Dollar General and TJM. It is the nice place to shop in town, otherwise you’re driving over an hour round trip.",
            "author": "GenIISD",
            "id": "gwrxuk9",
            "parent_id": "t1_gwrgsi5",
            "score": 3,
            "created_utc": 1620045431.0,
            "replies": []
        },
        {
            "body": "All good!",
            "author": "GenIISD",
            "id": "gwqsffg",
            "parent_id": "t1_gwqrvyo",
            "score": 2,
            "created_utc": 1620013416.0,
            "replies": []
        },
        {
            "body": "Definitely a bad idea then, and if we ever meet and I ask if you’d like to do it, please turn me down? \n\nWhat are some other engaging activities that you would enjoy to keep a M&G going if things went well?",
            "author": "GenIISD",
            "id": "gwq8piu",
            "parent_id": "t1_gwq7bq1",
            "score": 0,
            "created_utc": 1620002189.0,
            "replies": [
                {
                    "body": "Well, most of mine have just been coffee but we are super locked down still. \n\nI live in a city with a wonderful river valley and full\nOf trails so if it’s warm, it’s great to get outside! We have a street here that’s full of more unique shops (local art, used book store with a shop cat and a great selection of unique and rare books, delicious and varying street foods like Filipino iced cream!) that are lovely for just wandering and sparking conversation. \n\nHowever, for M&G I really don’t prefer it to be very long, personally.",
                    "author": "Cdnsugarr",
                    "id": "gwq9mi8",
                    "parent_id": "t1_gwq8piu",
                    "score": 3,
                    "created_utc": 1620002694.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "“I find most women” is specifically talking about his experience. It doesn’t seem he was trying to indicate women’s collective preferences, but rather his collective experience. Feel like this is a notable difference between someone being borderline sexist and what he did with just relating his personal experience.",
            "author": "GenIISD",
            "id": "gwq7pcv",
            "parent_id": "t1_gwq7779",
            "score": 2,
            "created_utc": 1620001646.0,
            "replies": [
                {
                    "body": "I’m responding to him that way because of his history with how he comments, and specifically his past comments towards me. Not solely this one-off time.",
                    "author": "Cdnsugarr",
                    "id": "gwq7stx",
                    "parent_id": "t1_gwq7pcv",
                    "score": 13,
                    "created_utc": 1620001696.0,
                    "replies": [
                        {
                            "body": "I see. I will recuse myself from any further comments because there are underlying factors that I am not knowledgeable of.",
                            "author": "GenIISD",
                            "id": "gwq8uza",
                            "parent_id": "t1_gwq7stx",
                            "score": 10,
                            "created_utc": 1620002270.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "We probably just don’t connect with the outliers 😉",
            "author": null,
            "id": "gwq84b2",
            "parent_id": "t1_gwq7c52",
            "score": -9,
            "created_utc": 1620001870.0,
            "replies": []
        },
        {
            "body": "See though, TJMaxx tends to be an anchor store in those strip malls. Retail is changing, especially post Covid. The variety is also a draw. Maybe a purse is preferred, maybe a necklace, maybe a body care gift set. They also have later hours than most boutique places, and that tends to work with my schedule.\n\nHave to work with what you have available. The Lenox mall in Atlanta or similar would be my first choice, but that isn’t really an option.",
            "author": "GenIISD",
            "id": "gwqfqmn",
            "parent_id": "t1_gwqds7u",
            "score": 3,
            "created_utc": 1620006079.0,
            "replies": []
        },
        {
            "body": "Sounds awesome! I’m also in the South so maybe I’ll stumble on it someday lol",
            "author": "PrincessPeach9315",
            "id": "gwuneit",
            "parent_id": "t1_gwumuf3",
            "score": 1,
            "created_utc": 1620088957.0,
            "replies": []
        },
        {
            "body": "Age gap is normally only at 10-ish for me, so that does seem to change the dynamic too. I had one M&G that did not progress to TJM or any more time together, and the POT commented over a dozen times that she just can’t believe she is sitting across from someone who doesn’t have gray hair. Honestly made it awkward - she thought my pics were old/fake and still came to meet me. \n\nBut once I know scents and colors and a few other preferences, I do most of my surprise gift buying outside of time with my SB. I just like always having something little extra to make it feel like gifting and not paying. It helps me keep a more positive view of the situation.",
            "author": "GenIISD",
            "id": "gwss8kk",
            "parent_id": "t1_gwsr2c3",
            "score": 1,
            "created_utc": 1620059182.0,
            "replies": [
                {
                    "body": "At 10 the age gap can still be big depending on ages. For example, i'm early thirties, for me 10 year age gap is early 20's. The difference between a 21-23 year old and my thought process/experience/likes are huge from what i have seen. I think it's cool you go the extra mile. I suck at gifting so even when i know someone for ever, it's still hard for me to gift.",
                    "author": "pintodinosaur",
                    "id": "gwt01gy",
                    "parent_id": "t1_gwss8kk",
                    "score": 1,
                    "created_utc": 1620062483.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Not deluded at all, and 100% accurate with what I’ve stated. I’m in my 30s and use sugaring to keep expectations in check (don’t want to do the ring thing/sugaring is a lot cheaper than having a lady run off with half my portfolio in five to ten years). Completely understand the money matters, and it is what opens the door. I’ve ended multiple SRs that were getting too clingy and been countered with switching to vanilla dating by the POT. So, there was a lot more in her eyes than the money once things got underway.\n\nThere is no imposition for physical contact in what I shared. If we are a foot apart and I move eight inches towards her and she moves four inches towards me and our shoulders touch; that isn’t imposition, that’s chemistry. I may be taking the lead a bit, but it isn’t imposition - it isn’t forced at all. I read her body language and act accordingly and with respect and reserve. My post is far from grandstanding. The last time I took a pot to TJM, her hands we’re definitely on me more than mine were beginning to come close to her.\n\nAnd demanding payment for the M&G isn’t a way to make sure you get sugar, it’s a way to drive off the kindest and most generous ones who have been burned in the past with the scammers that collect for a M&G and then ghost.",
            "author": "GenIISD",
            "id": "gwsx19c",
            "parent_id": "t1_gwstq2f",
            "score": 4,
            "created_utc": 1620061210.0,
            "replies": [
                {
                    "body": "I love this comment",
                    "author": "SassySugar4u",
                    "id": "gynsowa",
                    "parent_id": "t1_gwsx19c",
                    "score": 3,
                    "created_utc": 1621399800.0,
                    "replies": []
                },
                {
                    "body": ">And demanding payment for the M&G isn’t a way to make sure you get sugar, it’s a way to drive off the kindest and most generous ones who have been burned in the past with the scammers that collect for a M&G and then ghost.\n\nI'm of the opinion that the person with all of the power should be taking the risk. You disagree. I also think you have clearly demonstrated you are not \"the kindest and most generous\" through your words here. I'm sure you disagree about that, as well. We're done here.",
                    "author": "Anoonnyymmoous",
                    "id": "gwtbag3",
                    "parent_id": "t1_gwsx19c",
                    "score": 1,
                    "created_utc": 1620067152.0,
                    "replies": [
                        {
                            "body": "This is a toxic mentality. There is NOT one person with all the power. Any SB that thinks she has no power has believed a lie. You have the power to demand respect and next if respect is not shown. You have the power to communicate your needs and next if they will not be met (not only financial needs but also mental, social and emotional). You have the power to insist upon meeting in public and not be forced to meet at a hotel first. You have the power to leave whenever you please. You have the power to insist upon a platonic first meet (you should next the pot if you’re having to insist upon it). You have the power to seek a quality sugar mentor of an experienced SB that can help you navigate the bowl. You have the power to say “no.” You have the power to keep you legs closed. To all aspiring and current SBs, don’t fall for the B.S. that you have no power. You do, and anyone that treats you like you don’t or attempts to brainwash you into thinking you don’t deserves to have their input and thoughts ignored. \n\nAny healthy relationship is about give and take. If the SD had ALL the power, there would be no need to have different allowances or to work to differentiate oneself as a better SD option than others. Sugar dating shifts the power from being the 95/5 split that normal dating has to probably a 40/60 to 20/80 split in favor of the sugar parent. But that does not mean ALL power rests with the SD. \n\nThe M&G is a two-way interview to see if there is compatibility to start an arrangement. I never commit to paying for one and next those with low level thinking that insist upon it, but I also always gift a small amount of cash to show I appreciate the SB and to show I will gift beyond commitment. It allows me to avoid rinser/scammers/idiots who believe what they see online and to meet quality and understanding pots that I tend to click with. I could have had a lot more M&Gs, but they would have been with lower caliber and generally conceited individuals and would not have led to a SR.",
                            "author": "GenIISD",
                            "id": "gwtq6s2",
                            "parent_id": "t1_gwtbag3",
                            "score": 2,
                            "created_utc": 1620073581.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "can you elaborate on how they’d be treated like a doormat? 😳",
            "author": "Xx_spacey_kitten_xX",
            "id": "gwrt762",
            "parent_id": "t1_gwr5pzd",
            "score": 2,
            "created_utc": 1620042724.0,
            "replies": []
        },
        {
            "body": "Well, most of mine have just been coffee but we are super locked down still. \n\nI live in a city with a wonderful river valley and full\nOf trails so if it’s warm, it’s great to get outside! We have a street here that’s full of more unique shops (local art, used book store with a shop cat and a great selection of unique and rare books, delicious and varying street foods like Filipino iced cream!) that are lovely for just wandering and sparking conversation. \n\nHowever, for M&G I really don’t prefer it to be very long, personally.",
            "author": "Cdnsugarr",
            "id": "gwq9mi8",
            "parent_id": "t1_gwq8piu",
            "score": 3,
            "created_utc": 1620002694.0,
            "replies": []
        },
        {
            "body": "I’m responding to him that way because of his history with how he comments, and specifically his past comments towards me. Not solely this one-off time.",
            "author": "Cdnsugarr",
            "id": "gwq7stx",
            "parent_id": "t1_gwq7pcv",
            "score": 13,
            "created_utc": 1620001696.0,
            "replies": [
                {
                    "body": "I see. I will recuse myself from any further comments because there are underlying factors that I am not knowledgeable of.",
                    "author": "GenIISD",
                    "id": "gwq8uza",
                    "parent_id": "t1_gwq7stx",
                    "score": 10,
                    "created_utc": 1620002270.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "At 10 the age gap can still be big depending on ages. For example, i'm early thirties, for me 10 year age gap is early 20's. The difference between a 21-23 year old and my thought process/experience/likes are huge from what i have seen. I think it's cool you go the extra mile. I suck at gifting so even when i know someone for ever, it's still hard for me to gift.",
            "author": "pintodinosaur",
            "id": "gwt01gy",
            "parent_id": "t1_gwss8kk",
            "score": 1,
            "created_utc": 1620062483.0,
            "replies": []
        },
        {
            "body": "I love this comment",
            "author": "SassySugar4u",
            "id": "gynsowa",
            "parent_id": "t1_gwsx19c",
            "score": 3,
            "created_utc": 1621399800.0,
            "replies": []
        },
        {
            "body": ">And demanding payment for the M&G isn’t a way to make sure you get sugar, it’s a way to drive off the kindest and most generous ones who have been burned in the past with the scammers that collect for a M&G and then ghost.\n\nI'm of the opinion that the person with all of the power should be taking the risk. You disagree. I also think you have clearly demonstrated you are not \"the kindest and most generous\" through your words here. I'm sure you disagree about that, as well. We're done here.",
            "author": "Anoonnyymmoous",
            "id": "gwtbag3",
            "parent_id": "t1_gwsx19c",
            "score": 1,
            "created_utc": 1620067152.0,
            "replies": [
                {
                    "body": "This is a toxic mentality. There is NOT one person with all the power. Any SB that thinks she has no power has believed a lie. You have the power to demand respect and next if respect is not shown. You have the power to communicate your needs and next if they will not be met (not only financial needs but also mental, social and emotional). You have the power to insist upon meeting in public and not be forced to meet at a hotel first. You have the power to leave whenever you please. You have the power to insist upon a platonic first meet (you should next the pot if you’re having to insist upon it). You have the power to seek a quality sugar mentor of an experienced SB that can help you navigate the bowl. You have the power to say “no.” You have the power to keep you legs closed. To all aspiring and current SBs, don’t fall for the B.S. that you have no power. You do, and anyone that treats you like you don’t or attempts to brainwash you into thinking you don’t deserves to have their input and thoughts ignored. \n\nAny healthy relationship is about give and take. If the SD had ALL the power, there would be no need to have different allowances or to work to differentiate oneself as a better SD option than others. Sugar dating shifts the power from being the 95/5 split that normal dating has to probably a 40/60 to 20/80 split in favor of the sugar parent. But that does not mean ALL power rests with the SD. \n\nThe M&G is a two-way interview to see if there is compatibility to start an arrangement. I never commit to paying for one and next those with low level thinking that insist upon it, but I also always gift a small amount of cash to show I appreciate the SB and to show I will gift beyond commitment. It allows me to avoid rinser/scammers/idiots who believe what they see online and to meet quality and understanding pots that I tend to click with. I could have had a lot more M&Gs, but they would have been with lower caliber and generally conceited individuals and would not have led to a SR.",
                    "author": "GenIISD",
                    "id": "gwtq6s2",
                    "parent_id": "t1_gwtbag3",
                    "score": 2,
                    "created_utc": 1620073581.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I see. I will recuse myself from any further comments because there are underlying factors that I am not knowledgeable of.",
            "author": "GenIISD",
            "id": "gwq8uza",
            "parent_id": "t1_gwq7stx",
            "score": 10,
            "created_utc": 1620002270.0,
            "replies": []
        },
        {
            "body": "This is a toxic mentality. There is NOT one person with all the power. Any SB that thinks she has no power has believed a lie. You have the power to demand respect and next if respect is not shown. You have the power to communicate your needs and next if they will not be met (not only financial needs but also mental, social and emotional). You have the power to insist upon meeting in public and not be forced to meet at a hotel first. You have the power to leave whenever you please. You have the power to insist upon a platonic first meet (you should next the pot if you’re having to insist upon it). You have the power to seek a quality sugar mentor of an experienced SB that can help you navigate the bowl. You have the power to say “no.” You have the power to keep you legs closed. To all aspiring and current SBs, don’t fall for the B.S. that you have no power. You do, and anyone that treats you like you don’t or attempts to brainwash you into thinking you don’t deserves to have their input and thoughts ignored. \n\nAny healthy relationship is about give and take. If the SD had ALL the power, there would be no need to have different allowances or to work to differentiate oneself as a better SD option than others. Sugar dating shifts the power from being the 95/5 split that normal dating has to probably a 40/60 to 20/80 split in favor of the sugar parent. But that does not mean ALL power rests with the SD. \n\nThe M&G is a two-way interview to see if there is compatibility to start an arrangement. I never commit to paying for one and next those with low level thinking that insist upon it, but I also always gift a small amount of cash to show I appreciate the SB and to show I will gift beyond commitment. It allows me to avoid rinser/scammers/idiots who believe what they see online and to meet quality and understanding pots that I tend to click with. I could have had a lot more M&Gs, but they would have been with lower caliber and generally conceited individuals and would not have led to a SR.",
            "author": "GenIISD",
            "id": "gwtq6s2",
            "parent_id": "t1_gwtbag3",
            "score": 2,
            "created_utc": 1620073581.0,
            "replies": []
        }
    ]
}