{
    "title": "Rock hard",
    "post_id": "jl04v3",
    "post_url": "https://www.reddit.com/r/dankruto/comments/jl04v3/rock_hard/",
    "author": "Tipex",
    "body": "",
    "url": "https://i.redd.it/dccmudz1f9w51.jpg",
    "score": 5574,
    "upvote_ratio": 0.99,
    "created_utc": 1604075699.0,
    "num_comments": 30,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "and he still pissed about his high school crush that liked you better",
            "author": "shadowylurking",
            "id": "gan3bqz",
            "parent_id": "t3_jl04v3",
            "score": 235,
            "created_utc": 1604093256.0,
            "replies": [
                {
                    "body": "Middle school innit?",
                    "author": "KinkyGCM",
                    "id": "gana73p",
                    "parent_id": "t1_gan3bqz",
                    "score": 84,
                    "created_utc": 1604097112.0,
                    "replies": [
                        {
                            "body": "I stand corrected. You're right. Homie just couldn't move on.\n\nMeanwhile Kakashi could be swimming in hot ninja women if he didn't have a crippling porn addiction",
                            "author": "shadowylurking",
                            "id": "ganbd6i",
                            "parent_id": "t1_gana73p",
                            "score": 105,
                            "created_utc": 1604097780.0,
                            "replies": [
                                {
                                    "body": "honestly tho but every major male character reads them except for Sasuke cuz he’s kinda gay",
                                    "author": "Cyber1969",
                                    "id": "ganc67x",
                                    "parent_id": "t1_ganbd6i",
                                    "score": 56,
                                    "created_utc": 1604098258.0,
                                    "replies": [
                                        {
                                            "body": "In Boruto SD he even reads it",
                                            "author": "tjd317",
                                            "id": "ganczz0",
                                            "parent_id": "t1_ganc67x",
                                            "score": 33,
                                            "created_utc": 1604098749.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "Even Hinata reads them. Naruto doesn't like them tho and only keep them around because Jiraya is the author, Boruto even found them.",
                                            "author": "DarkJayBR",
                                            "id": "gaoje3n",
                                            "parent_id": "t1_ganc67x",
                                            "score": 16,
                                            "created_utc": 1604130566.0,
                                            "replies": [
                                                {
                                                    "body": "wait wasn’t Hinata like “what is this?” when she caught Boruto?",
                                                    "author": "Cyber1969",
                                                    "id": "gapm843",
                                                    "parent_id": "t1_gaoje3n",
                                                    "score": 2,
                                                    "created_utc": 1604162668.0,
                                                    "replies": [
                                                        {
                                                            "body": "She started reading them in the novels soon after this.",
                                                            "author": "DarkJayBR",
                                                            "id": "gapo6qe",
                                                            "parent_id": "t1_gapm843",
                                                            "score": 1,
                                                            "created_utc": 1604163745.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Did ya mean, tommyinit",
                            "author": "-Oof-Keen-eye",
                            "id": "ganxwah",
                            "parent_id": "t1_gana73p",
                            "score": 1,
                            "created_utc": 1604111671.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Bruh he even said he didnt care about Rin or Kakashi, and that his actions didnt involve them.",
                    "author": "VeryCool6969",
                    "id": "gangi1d",
                    "parent_id": "t1_gan3bqz",
                    "score": 8,
                    "created_utc": 1604100843.0,
                    "replies": [
                        {
                            "body": "\"Y-you idiot, I obviously don't care about you or Rin baka\"\n\n-obito, great ninja war",
                            "author": null,
                            "id": "ganobhx",
                            "parent_id": "t1_gangi1d",
                            "score": 43,
                            "created_utc": 1604105569.0,
                            "replies": [
                                {
                                    "body": "After rewatching Naruto now into adulthood all I can say is \"dattebayo\"",
                                    "author": "imhere2downvote",
                                    "id": "gao5o0e",
                                    "parent_id": "t1_ganobhx",
                                    "score": 2,
                                    "created_utc": 1604117114.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "ganp5px",
                            "parent_id": "t1_gangi1d",
                            "score": 14,
                            "created_utc": 1604106094.0,
                            "replies": [
                                {
                                    "body": "He also said that when he was 14, and Madara hadn't explained the plan in detail beyond \"a world of dreams\". Later he figures out that the caster of infinite tsukoyomi cant actually enter the dream world, so how was it for Rin?\n\nHe knew he couldn't go into the dream world, yet he did the plan anyway, and that's where the popular belief that Obito started the war to see Rin again crumbles. \n\nWhen he accepted Madara's plan it was under the belief that what he was doing was for the good of humanity (much like Madara envisioned). He changed his goal from becoming Hokage to becoming \"savior\" of the world.\n\nIf he was just doing it for Rin then why did he try to convince others to join him in his plan? If it was all for him then why didnt he just slaughter everyone? Why did he ask the alliance LIKE 30 TIMES to just give up and let their dreams become reality?",
                                    "author": "VeryCool6969",
                                    "id": "ganpvt8",
                                    "parent_id": "t1_ganp5px",
                                    "score": 7,
                                    "created_utc": 1604106543.0,
                                    "replies": [
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "ganqwmb",
                                            "parent_id": "t1_ganpvt8",
                                            "score": 10,
                                            "created_utc": 1604107182.0,
                                            "replies": [
                                                {
                                                    "body": "I am fully aware of the flashback and the short \"conversation\" he had with Zetsu. Still, you fail to see my point. You're acting as if I claimed that he knew nothing of the plan, while that's just not true. I know he knew the basics of the plan. The point I was making was that he wasn't aware of the fact that he himself could not enter said dream world.\n\n   I also understand he wanted to create a world where \"Rin is alive again,\" and I never denied that. I simply said that when he made that statement, and when he had the flashback which you linked, it all took place before he was given the plan in full detail (which most likely encompassed the details which I mention).\n\nWhat we as the viewer are meant to draw from this is that Obito wants to create a world where no pain in felt, and \"dreams become a reality\". I will say it again, YES HE DID WANT RIN ALIVE AGAIN, but that wasn't what made him start the war. He started the war because he wanted everyone to be a part of the dream world, and so no one would have to endure the pain of loss. Obito said to Kakashi, \"To me, Rin was someone who wasn't supposed to die, so the dead Rin is an imposter. You were supposed to protect Rin, and because you failed at that, in my eyes you are an imposter as well!\" So at first he want to create a world where Rin can be ALIVE again (note how I didn't say WITH OBITO), after he had obviously learned of the duty of the caster of the eye of the moon plan (his conversation with Madara) he changed his goal from creating a world where Rin can exist, to creating a world where Rin can exist AS WELL AS THE REST OF THE WORLD. \n\n&#x200B;\n\nSo after all of this, you still didn't answer my question. (Blatant questions that each in their own right debunk your entire argument).\n\n&#x200B;\n\n1.) If Obito wanted to start the war to see Rin again, then why did he make such a fuss to not bring Madara back? In Madara's plan, Obito was supposed to bring him back so that Madara could CAST the jutsu (under the assumption Obito would be out in the genjutsu) but Obito wanted to keep him out of it. So given the chance to ACTUALLY SEE RIN AGAIN, he denies it. Why is that? Why does he want to be the one to cast the jutsu knowing he can't enter the world of dreams?\n\n&#x200B;\n\n2.) If Obito did it because of Rin, then what were his motivations to \"lie\" here- [https://i.redd.it/em9lkhvxx5g21.png](https://i.redd.it/em9lkhvxx5g21.png)\n\nNothing of the links you gave me \"contradicts\" this statement like you said. In all of the links you gave me, Obito says he will, \"create a world where Rin will be alive,\" not, \"where I can live with her\". These sentences don't equate to one another like you seem to think.\n\n&#x200B;\n\n3.) Why did Obito try to convince the allied shinobi forces, Naruto, Bee, Kakashi, ect, to all GIVE UP? Why was he attempting to spare as many lives as possible? If he only did it for Rin then why not go all out and kill everyone so HE ALONE could go into the jutsu? Why did he try to PREVENT the war from taking place, by asking the 5 Kage for the tailed beasts before he initiated war? \n\n&#x200B;\n\n4.) Why didn't he ASK to be put in a genjutsu? I know this sounds silly, but Obito (while resistant if necesary) knows of Itachi's Tsukoyomi, which is essentially the same. If he wanted to be with Rin again, which is what you're suggesting, then why didn't he find an alternative to WORLD WAR 4?? I'm pretty sure Obito knows Itachi would be MORE than willing to comply.\n\n&#x200B;\n\n&#x200B;\n\nThe list goes on, and just based on these four bullet points it's pretty obvious he didn't do it for Rin. Yes that was his initial motive, but it was made BLATANTLY OBVIOUS that after this statement his goals altered.",
                                                    "author": "VeryCool6969",
                                                    "id": "ganu15m",
                                                    "parent_id": "t1_ganqwmb",
                                                    "score": -3,
                                                    "created_utc": 1604109165.0,
                                                    "replies": [
                                                        {
                                                            "body": "[deleted]",
                                                            "author": null,
                                                            "id": "ganuxwe",
                                                            "parent_id": "t1_ganu15m",
                                                            "score": 4,
                                                            "created_utc": 1604109746.0,
                                                            "replies": [
                                                                {
                                                                    "body": "\" You're arguing that the war couldn't have been for Rin because the war was part of the plan and Obito didn't know about it in detail. \"\n\nNo, no i'm not. You're twisting what i'm trying to tell you. Obito declaring his association with the plan and 17 years later his involvement in the war do not correlate in the way you're trying to make it. Yes, Rin was Obito's catalyst. No, Rin wasn't why he started the war. Rin's death led Obito to want her alive again, which coincided with infinite Tsukuyomi. Obito DID NOT start the war with \"I want Rin alive again\" in mind. He wanted to be the \"savior\" as I said, (he calls himself such as well). Catalyst  **≠**  Motivation.\n\n&#x200B;\n\nYour argument stims from the fact that you believe the CATALYST for Obito's involvement is also his motive, which is not entirely true.\n\n&#x200B;\n\nJust because he wanted to create a world where Rin is alive DOES NOT mean that he acted ENTIRELY on that premise. You're jumping from point A-Z without paying attention to anything in the middle.\n\n&#x200B;\n\nI will once again repeat -  Catalyst  **≠**  Motivation - You seem to think they're synonyms.\n\n&#x200B;\n\nSo I will ask again, because at this point i'm genuinely curious to see how you answer these questions that you've been avoiding - \n\n&#x200B;\n\n \n\n1.) If Obito wanted to start the war to see Rin again, then why did he make such a fuss to not bring Madara back? In Madara's plan, Obito was supposed to bring him back so that Madara could CAST the jutsu (under the assumption Obito would be out in the genjutsu) but Obito wanted to keep him out of it. So given the chance to ACTUALLY SEE RIN AGAIN, he denies it. Why is that? Why does he want to be the one to cast the jutsu knowing he can't enter the world of dreams?\n\n2.) If Obito did it because of Rin, then what were his motivations to \"lie\" here- [https://i.redd.it/em9lkhvxx5g21.png](https://i.redd.it/em9lkhvxx5g21.png)\n\nNothing of the links you gave me \"contradicts\" this statement like you said. In all of the links you gave me, Obito says he will, \"create a world where Rin will be alive,\" not, \"where I can live with her\". These sentences don't equate to one another like you seem to think.\n\n3.) Why did Obito try to convince the allied shinobi forces, Naruto, Bee, Kakashi, ect, to all GIVE UP? Why was he attempting to spare as many lives as possible? If he only did it for Rin then why not go all out and kill everyone so HE ALONE could go into the jutsu? Why did he try to PREVENT the war from taking place, by asking the 5 Kage for the tailed beasts before he initiated war?\n\n4.) Why didn't he ASK to be put in a genjutsu? I know this sounds silly, but Obito (while resistant if necesary) knows of Itachi's Tsukoyomi, which is essentially the same. If he wanted to be with Rin again, which is what you're suggesting, then why didn't he find an alternative to WORLD WAR 4?? I'm pretty sure Obito knows Itachi would be MORE than willing to comply.",
                                                                    "author": "VeryCool6969",
                                                                    "id": "ganx5q6",
                                                                    "parent_id": "t1_ganuxwe",
                                                                    "score": 0,
                                                                    "created_utc": 1604111181.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "body": "Obito fans sure love their own headcanons huh, it doesn't matter what he fucking said, his actions proved otherwise (and those goddamn Rin flashbacks) \n\n1. Its never stated whether he knows he will enter the dream world or not. All Madara knew was the God Tree's eye will be reflected on the moon, he didn't even knew he could absorb the God Tree. \n\n2. he had no motivations to lie here, but Kishimoto had motivations to make him a better villain because of how bad he was (although it results in a total FAIL) because he still thinks about Rin 30 more times after this conversation LOL \n\n3. he summoned the 9 Tails on the Leaf 16 years ago for the lulz and you think he care about human lives LOL, until the worst Talk no Jutsu in the series of course, all of a sudden he is the cool guy \n\n4. What makes you think Itachi would give Obito his wet dreams just because he asked for it?",
                                                            "author": null,
                                                            "id": "ganvm7n",
                                                            "parent_id": "t1_ganu15m",
                                                            "score": 2,
                                                            "created_utc": 1604110180.0,
                                                            "replies": [
                                                                {
                                                                    "body": "1. Well then why did Obito want to be the one to cast the justu? Why did he have a massive dispute with Madara over who would proceed with the jutsu? If what you say is true, then what was the point of Madara taking back the ten tails? Why didn't he just let Obito do it, if he thought he would go to the dream world either way?\n2. So what you're saying is that i'm right.\n3. He didn't do it \"for the lulz\". He extracted it out of Kushina for Infinite Tsukoyomi, but he lost his fight against Minato and lost control of the Kyuubi. Yes, he cares about people, but in a very twisted way. He believes that anyone who gets in his way is someone that needs to die for the greater good. He said, \"Fear not, for you will be in a world I will create,\" when Yahiko died. In this instance it's obvious he decided the death of Yahiko was necessary, but he didn't see it as permanent. Once his plan was created through the sacrifice he deems the deaths of those he killed, he would \"bring them back\" in the world he wanted to make.\n4. Yeah, actually. Itachi knows Obito is dangerous, and if Obito is asking to die then I see no reason Itachi wouldn't comply.",
                                                                    "author": "VeryCool6969",
                                                                    "id": "gany05u",
                                                                    "parent_id": "t1_ganvm7n",
                                                                    "score": -1,
                                                                    "created_utc": 1604111744.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "It doesn't matter what he said, his actions proved otherwise (and those fucking Rin flasbacks)",
                            "author": null,
                            "id": "ganuggo",
                            "parent_id": "t1_gangi1d",
                            "score": 1,
                            "created_utc": 1604109434.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "So in short, he’s a simp",
                    "author": "Nuggoman",
                    "id": "gant0vm",
                    "parent_id": "t1_gan3bqz",
                    "score": 2,
                    "created_utc": 1604108522.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "\"And here I was sending his crush over to him so he wouldnt be lonely in the afterlife \"",
            "author": "faithtofu",
            "id": "gan6iuw",
            "parent_id": "t3_jl04v3",
            "score": 87,
            "created_utc": 1604095035.0,
            "replies": [
                {
                    "body": "Bruh",
                    "author": "jovovic98",
                    "id": "ganbwu8",
                    "parent_id": "t1_gan6iuw",
                    "score": 22,
                    "created_utc": 1604098101.0,
                    "replies": []
                },
                {
                    "body": "Why is this sentence in quote marks? Who said that?",
                    "author": "3727rhfh",
                    "id": "gane269",
                    "parent_id": "t1_gan6iuw",
                    "score": 3,
                    "created_utc": 1604099382.0,
                    "replies": [
                        {
                            "body": "\"Kakashi\"",
                            "author": "wisdomsharerv2",
                            "id": "gane9jl",
                            "parent_id": "t1_gane269",
                            "score": 16,
                            "created_utc": 1604099504.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Tell that mofo u nailed his bitch and u snooze u lose the sharingan",
            "author": "aeoure",
            "id": "gao3b4a",
            "parent_id": "t3_jl04v3",
            "score": 10,
            "created_utc": 1604115385.0,
            "replies": [
                {
                    "body": "If the sharingan was real there wouldn't be a single one safe from me. I'd wait until uchihas were asleep, uchihas went to shit. Yoink their sharingans at their most vulnerable. Pregnant uchihas giving birth? I'm hiding under table. Doctor catches the baby uchiha and that's when I strike and yoink his sharingan. Baby is last ofc but I call that the uchiha hat trick. Go into homes for the elderly. They don't need the sharingan anymore but I still do. I wouldn't stop at one arm like that wimp danzo. I'd put them on all my limbs and my back. I don't need a nose I need more sharingans damnit. 2 crushes kissing? 4 more sharingans. Is that man blacked out from drinking? His eyes are forfiet. Son I have 300 confirmed eyes. I can kill you in over 700 different ways with just my eyes. Is that a man crouching on the top of a pole at this time of night? Doesn't matter his eyes are mine",
                    "author": "imhere2downvote",
                    "id": "gao6org",
                    "parent_id": "t1_gao3b4a",
                    "score": 18,
                    "created_utc": 1604117909.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "The best meme I've never seen of Naruto",
            "author": "L64ok",
            "id": "gao2b05",
            "parent_id": "t3_jl04v3",
            "score": 5,
            "created_utc": 1604114683.0,
            "replies": []
        },
        {
            "body": "Twitter screenshots aren't memes",
            "author": "DerReudenboy",
            "id": "gaos065",
            "parent_id": "t3_jl04v3",
            "score": -1,
            "created_utc": 1604140973.0,
            "replies": []
        },
        {
            "body": "i lived bitch",
            "author": "AstroAngeI",
            "id": "gao5e6k",
            "parent_id": "t3_jl04v3",
            "score": 1,
            "created_utc": 1604116915.0,
            "replies": []
        },
        {
            "body": "Ah shit here we go again",
            "author": "Jack_Chara",
            "id": "gaoqmuk",
            "parent_id": "t3_jl04v3",
            "score": 1,
            "created_utc": 1604139485.0,
            "replies": []
        },
        {
            "body": "Hahaaaa\n\nI’m still alive _bitch_",
            "author": "TheUnkwownSherpa",
            "id": "gaosa4b",
            "parent_id": "t3_jl04v3",
            "score": 1,
            "created_utc": 1604141286.0,
            "replies": []
        },
        {
            "body": "Middle school innit?",
            "author": "KinkyGCM",
            "id": "gana73p",
            "parent_id": "t1_gan3bqz",
            "score": 84,
            "created_utc": 1604097112.0,
            "replies": [
                {
                    "body": "I stand corrected. You're right. Homie just couldn't move on.\n\nMeanwhile Kakashi could be swimming in hot ninja women if he didn't have a crippling porn addiction",
                    "author": "shadowylurking",
                    "id": "ganbd6i",
                    "parent_id": "t1_gana73p",
                    "score": 105,
                    "created_utc": 1604097780.0,
                    "replies": [
                        {
                            "body": "honestly tho but every major male character reads them except for Sasuke cuz he’s kinda gay",
                            "author": "Cyber1969",
                            "id": "ganc67x",
                            "parent_id": "t1_ganbd6i",
                            "score": 56,
                            "created_utc": 1604098258.0,
                            "replies": [
                                {
                                    "body": "In Boruto SD he even reads it",
                                    "author": "tjd317",
                                    "id": "ganczz0",
                                    "parent_id": "t1_ganc67x",
                                    "score": 33,
                                    "created_utc": 1604098749.0,
                                    "replies": []
                                },
                                {
                                    "body": "Even Hinata reads them. Naruto doesn't like them tho and only keep them around because Jiraya is the author, Boruto even found them.",
                                    "author": "DarkJayBR",
                                    "id": "gaoje3n",
                                    "parent_id": "t1_ganc67x",
                                    "score": 16,
                                    "created_utc": 1604130566.0,
                                    "replies": [
                                        {
                                            "body": "wait wasn’t Hinata like “what is this?” when she caught Boruto?",
                                            "author": "Cyber1969",
                                            "id": "gapm843",
                                            "parent_id": "t1_gaoje3n",
                                            "score": 2,
                                            "created_utc": 1604162668.0,
                                            "replies": [
                                                {
                                                    "body": "She started reading them in the novels soon after this.",
                                                    "author": "DarkJayBR",
                                                    "id": "gapo6qe",
                                                    "parent_id": "t1_gapm843",
                                                    "score": 1,
                                                    "created_utc": 1604163745.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Did ya mean, tommyinit",
                    "author": "-Oof-Keen-eye",
                    "id": "ganxwah",
                    "parent_id": "t1_gana73p",
                    "score": 1,
                    "created_utc": 1604111671.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Bruh he even said he didnt care about Rin or Kakashi, and that his actions didnt involve them.",
            "author": "VeryCool6969",
            "id": "gangi1d",
            "parent_id": "t1_gan3bqz",
            "score": 8,
            "created_utc": 1604100843.0,
            "replies": [
                {
                    "body": "\"Y-you idiot, I obviously don't care about you or Rin baka\"\n\n-obito, great ninja war",
                    "author": null,
                    "id": "ganobhx",
                    "parent_id": "t1_gangi1d",
                    "score": 43,
                    "created_utc": 1604105569.0,
                    "replies": [
                        {
                            "body": "After rewatching Naruto now into adulthood all I can say is \"dattebayo\"",
                            "author": "imhere2downvote",
                            "id": "gao5o0e",
                            "parent_id": "t1_ganobhx",
                            "score": 2,
                            "created_utc": 1604117114.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "ganp5px",
                    "parent_id": "t1_gangi1d",
                    "score": 14,
                    "created_utc": 1604106094.0,
                    "replies": [
                        {
                            "body": "He also said that when he was 14, and Madara hadn't explained the plan in detail beyond \"a world of dreams\". Later he figures out that the caster of infinite tsukoyomi cant actually enter the dream world, so how was it for Rin?\n\nHe knew he couldn't go into the dream world, yet he did the plan anyway, and that's where the popular belief that Obito started the war to see Rin again crumbles. \n\nWhen he accepted Madara's plan it was under the belief that what he was doing was for the good of humanity (much like Madara envisioned). He changed his goal from becoming Hokage to becoming \"savior\" of the world.\n\nIf he was just doing it for Rin then why did he try to convince others to join him in his plan? If it was all for him then why didnt he just slaughter everyone? Why did he ask the alliance LIKE 30 TIMES to just give up and let their dreams become reality?",
                            "author": "VeryCool6969",
                            "id": "ganpvt8",
                            "parent_id": "t1_ganp5px",
                            "score": 7,
                            "created_utc": 1604106543.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "ganqwmb",
                                    "parent_id": "t1_ganpvt8",
                                    "score": 10,
                                    "created_utc": 1604107182.0,
                                    "replies": [
                                        {
                                            "body": "I am fully aware of the flashback and the short \"conversation\" he had with Zetsu. Still, you fail to see my point. You're acting as if I claimed that he knew nothing of the plan, while that's just not true. I know he knew the basics of the plan. The point I was making was that he wasn't aware of the fact that he himself could not enter said dream world.\n\n   I also understand he wanted to create a world where \"Rin is alive again,\" and I never denied that. I simply said that when he made that statement, and when he had the flashback which you linked, it all took place before he was given the plan in full detail (which most likely encompassed the details which I mention).\n\nWhat we as the viewer are meant to draw from this is that Obito wants to create a world where no pain in felt, and \"dreams become a reality\". I will say it again, YES HE DID WANT RIN ALIVE AGAIN, but that wasn't what made him start the war. He started the war because he wanted everyone to be a part of the dream world, and so no one would have to endure the pain of loss. Obito said to Kakashi, \"To me, Rin was someone who wasn't supposed to die, so the dead Rin is an imposter. You were supposed to protect Rin, and because you failed at that, in my eyes you are an imposter as well!\" So at first he want to create a world where Rin can be ALIVE again (note how I didn't say WITH OBITO), after he had obviously learned of the duty of the caster of the eye of the moon plan (his conversation with Madara) he changed his goal from creating a world where Rin can exist, to creating a world where Rin can exist AS WELL AS THE REST OF THE WORLD. \n\n&#x200B;\n\nSo after all of this, you still didn't answer my question. (Blatant questions that each in their own right debunk your entire argument).\n\n&#x200B;\n\n1.) If Obito wanted to start the war to see Rin again, then why did he make such a fuss to not bring Madara back? In Madara's plan, Obito was supposed to bring him back so that Madara could CAST the jutsu (under the assumption Obito would be out in the genjutsu) but Obito wanted to keep him out of it. So given the chance to ACTUALLY SEE RIN AGAIN, he denies it. Why is that? Why does he want to be the one to cast the jutsu knowing he can't enter the world of dreams?\n\n&#x200B;\n\n2.) If Obito did it because of Rin, then what were his motivations to \"lie\" here- [https://i.redd.it/em9lkhvxx5g21.png](https://i.redd.it/em9lkhvxx5g21.png)\n\nNothing of the links you gave me \"contradicts\" this statement like you said. In all of the links you gave me, Obito says he will, \"create a world where Rin will be alive,\" not, \"where I can live with her\". These sentences don't equate to one another like you seem to think.\n\n&#x200B;\n\n3.) Why did Obito try to convince the allied shinobi forces, Naruto, Bee, Kakashi, ect, to all GIVE UP? Why was he attempting to spare as many lives as possible? If he only did it for Rin then why not go all out and kill everyone so HE ALONE could go into the jutsu? Why did he try to PREVENT the war from taking place, by asking the 5 Kage for the tailed beasts before he initiated war? \n\n&#x200B;\n\n4.) Why didn't he ASK to be put in a genjutsu? I know this sounds silly, but Obito (while resistant if necesary) knows of Itachi's Tsukoyomi, which is essentially the same. If he wanted to be with Rin again, which is what you're suggesting, then why didn't he find an alternative to WORLD WAR 4?? I'm pretty sure Obito knows Itachi would be MORE than willing to comply.\n\n&#x200B;\n\n&#x200B;\n\nThe list goes on, and just based on these four bullet points it's pretty obvious he didn't do it for Rin. Yes that was his initial motive, but it was made BLATANTLY OBVIOUS that after this statement his goals altered.",
                                            "author": "VeryCool6969",
                                            "id": "ganu15m",
                                            "parent_id": "t1_ganqwmb",
                                            "score": -3,
                                            "created_utc": 1604109165.0,
                                            "replies": [
                                                {
                                                    "body": "[deleted]",
                                                    "author": null,
                                                    "id": "ganuxwe",
                                                    "parent_id": "t1_ganu15m",
                                                    "score": 4,
                                                    "created_utc": 1604109746.0,
                                                    "replies": [
                                                        {
                                                            "body": "\" You're arguing that the war couldn't have been for Rin because the war was part of the plan and Obito didn't know about it in detail. \"\n\nNo, no i'm not. You're twisting what i'm trying to tell you. Obito declaring his association with the plan and 17 years later his involvement in the war do not correlate in the way you're trying to make it. Yes, Rin was Obito's catalyst. No, Rin wasn't why he started the war. Rin's death led Obito to want her alive again, which coincided with infinite Tsukuyomi. Obito DID NOT start the war with \"I want Rin alive again\" in mind. He wanted to be the \"savior\" as I said, (he calls himself such as well). Catalyst  **≠**  Motivation.\n\n&#x200B;\n\nYour argument stims from the fact that you believe the CATALYST for Obito's involvement is also his motive, which is not entirely true.\n\n&#x200B;\n\nJust because he wanted to create a world where Rin is alive DOES NOT mean that he acted ENTIRELY on that premise. You're jumping from point A-Z without paying attention to anything in the middle.\n\n&#x200B;\n\nI will once again repeat -  Catalyst  **≠**  Motivation - You seem to think they're synonyms.\n\n&#x200B;\n\nSo I will ask again, because at this point i'm genuinely curious to see how you answer these questions that you've been avoiding - \n\n&#x200B;\n\n \n\n1.) If Obito wanted to start the war to see Rin again, then why did he make such a fuss to not bring Madara back? In Madara's plan, Obito was supposed to bring him back so that Madara could CAST the jutsu (under the assumption Obito would be out in the genjutsu) but Obito wanted to keep him out of it. So given the chance to ACTUALLY SEE RIN AGAIN, he denies it. Why is that? Why does he want to be the one to cast the jutsu knowing he can't enter the world of dreams?\n\n2.) If Obito did it because of Rin, then what were his motivations to \"lie\" here- [https://i.redd.it/em9lkhvxx5g21.png](https://i.redd.it/em9lkhvxx5g21.png)\n\nNothing of the links you gave me \"contradicts\" this statement like you said. In all of the links you gave me, Obito says he will, \"create a world where Rin will be alive,\" not, \"where I can live with her\". These sentences don't equate to one another like you seem to think.\n\n3.) Why did Obito try to convince the allied shinobi forces, Naruto, Bee, Kakashi, ect, to all GIVE UP? Why was he attempting to spare as many lives as possible? If he only did it for Rin then why not go all out and kill everyone so HE ALONE could go into the jutsu? Why did he try to PREVENT the war from taking place, by asking the 5 Kage for the tailed beasts before he initiated war?\n\n4.) Why didn't he ASK to be put in a genjutsu? I know this sounds silly, but Obito (while resistant if necesary) knows of Itachi's Tsukoyomi, which is essentially the same. If he wanted to be with Rin again, which is what you're suggesting, then why didn't he find an alternative to WORLD WAR 4?? I'm pretty sure Obito knows Itachi would be MORE than willing to comply.",
                                                            "author": "VeryCool6969",
                                                            "id": "ganx5q6",
                                                            "parent_id": "t1_ganuxwe",
                                                            "score": 0,
                                                            "created_utc": 1604111181.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "body": "Obito fans sure love their own headcanons huh, it doesn't matter what he fucking said, his actions proved otherwise (and those goddamn Rin flashbacks) \n\n1. Its never stated whether he knows he will enter the dream world or not. All Madara knew was the God Tree's eye will be reflected on the moon, he didn't even knew he could absorb the God Tree. \n\n2. he had no motivations to lie here, but Kishimoto had motivations to make him a better villain because of how bad he was (although it results in a total FAIL) because he still thinks about Rin 30 more times after this conversation LOL \n\n3. he summoned the 9 Tails on the Leaf 16 years ago for the lulz and you think he care about human lives LOL, until the worst Talk no Jutsu in the series of course, all of a sudden he is the cool guy \n\n4. What makes you think Itachi would give Obito his wet dreams just because he asked for it?",
                                                    "author": null,
                                                    "id": "ganvm7n",
                                                    "parent_id": "t1_ganu15m",
                                                    "score": 2,
                                                    "created_utc": 1604110180.0,
                                                    "replies": [
                                                        {
                                                            "body": "1. Well then why did Obito want to be the one to cast the justu? Why did he have a massive dispute with Madara over who would proceed with the jutsu? If what you say is true, then what was the point of Madara taking back the ten tails? Why didn't he just let Obito do it, if he thought he would go to the dream world either way?\n2. So what you're saying is that i'm right.\n3. He didn't do it \"for the lulz\". He extracted it out of Kushina for Infinite Tsukoyomi, but he lost his fight against Minato and lost control of the Kyuubi. Yes, he cares about people, but in a very twisted way. He believes that anyone who gets in his way is someone that needs to die for the greater good. He said, \"Fear not, for you will be in a world I will create,\" when Yahiko died. In this instance it's obvious he decided the death of Yahiko was necessary, but he didn't see it as permanent. Once his plan was created through the sacrifice he deems the deaths of those he killed, he would \"bring them back\" in the world he wanted to make.\n4. Yeah, actually. Itachi knows Obito is dangerous, and if Obito is asking to die then I see no reason Itachi wouldn't comply.",
                                                            "author": "VeryCool6969",
                                                            "id": "gany05u",
                                                            "parent_id": "t1_ganvm7n",
                                                            "score": -1,
                                                            "created_utc": 1604111744.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "It doesn't matter what he said, his actions proved otherwise (and those fucking Rin flasbacks)",
                    "author": null,
                    "id": "ganuggo",
                    "parent_id": "t1_gangi1d",
                    "score": 1,
                    "created_utc": 1604109434.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "So in short, he’s a simp",
            "author": "Nuggoman",
            "id": "gant0vm",
            "parent_id": "t1_gan3bqz",
            "score": 2,
            "created_utc": 1604108522.0,
            "replies": []
        },
        {
            "body": "Bruh",
            "author": "jovovic98",
            "id": "ganbwu8",
            "parent_id": "t1_gan6iuw",
            "score": 22,
            "created_utc": 1604098101.0,
            "replies": []
        },
        {
            "body": "Why is this sentence in quote marks? Who said that?",
            "author": "3727rhfh",
            "id": "gane269",
            "parent_id": "t1_gan6iuw",
            "score": 3,
            "created_utc": 1604099382.0,
            "replies": [
                {
                    "body": "\"Kakashi\"",
                    "author": "wisdomsharerv2",
                    "id": "gane9jl",
                    "parent_id": "t1_gane269",
                    "score": 16,
                    "created_utc": 1604099504.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "If the sharingan was real there wouldn't be a single one safe from me. I'd wait until uchihas were asleep, uchihas went to shit. Yoink their sharingans at their most vulnerable. Pregnant uchihas giving birth? I'm hiding under table. Doctor catches the baby uchiha and that's when I strike and yoink his sharingan. Baby is last ofc but I call that the uchiha hat trick. Go into homes for the elderly. They don't need the sharingan anymore but I still do. I wouldn't stop at one arm like that wimp danzo. I'd put them on all my limbs and my back. I don't need a nose I need more sharingans damnit. 2 crushes kissing? 4 more sharingans. Is that man blacked out from drinking? His eyes are forfiet. Son I have 300 confirmed eyes. I can kill you in over 700 different ways with just my eyes. Is that a man crouching on the top of a pole at this time of night? Doesn't matter his eyes are mine",
            "author": "imhere2downvote",
            "id": "gao6org",
            "parent_id": "t1_gao3b4a",
            "score": 18,
            "created_utc": 1604117909.0,
            "replies": []
        },
        {
            "body": "I stand corrected. You're right. Homie just couldn't move on.\n\nMeanwhile Kakashi could be swimming in hot ninja women if he didn't have a crippling porn addiction",
            "author": "shadowylurking",
            "id": "ganbd6i",
            "parent_id": "t1_gana73p",
            "score": 105,
            "created_utc": 1604097780.0,
            "replies": [
                {
                    "body": "honestly tho but every major male character reads them except for Sasuke cuz he’s kinda gay",
                    "author": "Cyber1969",
                    "id": "ganc67x",
                    "parent_id": "t1_ganbd6i",
                    "score": 56,
                    "created_utc": 1604098258.0,
                    "replies": [
                        {
                            "body": "In Boruto SD he even reads it",
                            "author": "tjd317",
                            "id": "ganczz0",
                            "parent_id": "t1_ganc67x",
                            "score": 33,
                            "created_utc": 1604098749.0,
                            "replies": []
                        },
                        {
                            "body": "Even Hinata reads them. Naruto doesn't like them tho and only keep them around because Jiraya is the author, Boruto even found them.",
                            "author": "DarkJayBR",
                            "id": "gaoje3n",
                            "parent_id": "t1_ganc67x",
                            "score": 16,
                            "created_utc": 1604130566.0,
                            "replies": [
                                {
                                    "body": "wait wasn’t Hinata like “what is this?” when she caught Boruto?",
                                    "author": "Cyber1969",
                                    "id": "gapm843",
                                    "parent_id": "t1_gaoje3n",
                                    "score": 2,
                                    "created_utc": 1604162668.0,
                                    "replies": [
                                        {
                                            "body": "She started reading them in the novels soon after this.",
                                            "author": "DarkJayBR",
                                            "id": "gapo6qe",
                                            "parent_id": "t1_gapm843",
                                            "score": 1,
                                            "created_utc": 1604163745.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Did ya mean, tommyinit",
            "author": "-Oof-Keen-eye",
            "id": "ganxwah",
            "parent_id": "t1_gana73p",
            "score": 1,
            "created_utc": 1604111671.0,
            "replies": []
        },
        {
            "body": "\"Y-you idiot, I obviously don't care about you or Rin baka\"\n\n-obito, great ninja war",
            "author": null,
            "id": "ganobhx",
            "parent_id": "t1_gangi1d",
            "score": 43,
            "created_utc": 1604105569.0,
            "replies": [
                {
                    "body": "After rewatching Naruto now into adulthood all I can say is \"dattebayo\"",
                    "author": "imhere2downvote",
                    "id": "gao5o0e",
                    "parent_id": "t1_ganobhx",
                    "score": 2,
                    "created_utc": 1604117114.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "ganp5px",
            "parent_id": "t1_gangi1d",
            "score": 14,
            "created_utc": 1604106094.0,
            "replies": [
                {
                    "body": "He also said that when he was 14, and Madara hadn't explained the plan in detail beyond \"a world of dreams\". Later he figures out that the caster of infinite tsukoyomi cant actually enter the dream world, so how was it for Rin?\n\nHe knew he couldn't go into the dream world, yet he did the plan anyway, and that's where the popular belief that Obito started the war to see Rin again crumbles. \n\nWhen he accepted Madara's plan it was under the belief that what he was doing was for the good of humanity (much like Madara envisioned). He changed his goal from becoming Hokage to becoming \"savior\" of the world.\n\nIf he was just doing it for Rin then why did he try to convince others to join him in his plan? If it was all for him then why didnt he just slaughter everyone? Why did he ask the alliance LIKE 30 TIMES to just give up and let their dreams become reality?",
                    "author": "VeryCool6969",
                    "id": "ganpvt8",
                    "parent_id": "t1_ganp5px",
                    "score": 7,
                    "created_utc": 1604106543.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "ganqwmb",
                            "parent_id": "t1_ganpvt8",
                            "score": 10,
                            "created_utc": 1604107182.0,
                            "replies": [
                                {
                                    "body": "I am fully aware of the flashback and the short \"conversation\" he had with Zetsu. Still, you fail to see my point. You're acting as if I claimed that he knew nothing of the plan, while that's just not true. I know he knew the basics of the plan. The point I was making was that he wasn't aware of the fact that he himself could not enter said dream world.\n\n   I also understand he wanted to create a world where \"Rin is alive again,\" and I never denied that. I simply said that when he made that statement, and when he had the flashback which you linked, it all took place before he was given the plan in full detail (which most likely encompassed the details which I mention).\n\nWhat we as the viewer are meant to draw from this is that Obito wants to create a world where no pain in felt, and \"dreams become a reality\". I will say it again, YES HE DID WANT RIN ALIVE AGAIN, but that wasn't what made him start the war. He started the war because he wanted everyone to be a part of the dream world, and so no one would have to endure the pain of loss. Obito said to Kakashi, \"To me, Rin was someone who wasn't supposed to die, so the dead Rin is an imposter. You were supposed to protect Rin, and because you failed at that, in my eyes you are an imposter as well!\" So at first he want to create a world where Rin can be ALIVE again (note how I didn't say WITH OBITO), after he had obviously learned of the duty of the caster of the eye of the moon plan (his conversation with Madara) he changed his goal from creating a world where Rin can exist, to creating a world where Rin can exist AS WELL AS THE REST OF THE WORLD. \n\n&#x200B;\n\nSo after all of this, you still didn't answer my question. (Blatant questions that each in their own right debunk your entire argument).\n\n&#x200B;\n\n1.) If Obito wanted to start the war to see Rin again, then why did he make such a fuss to not bring Madara back? In Madara's plan, Obito was supposed to bring him back so that Madara could CAST the jutsu (under the assumption Obito would be out in the genjutsu) but Obito wanted to keep him out of it. So given the chance to ACTUALLY SEE RIN AGAIN, he denies it. Why is that? Why does he want to be the one to cast the jutsu knowing he can't enter the world of dreams?\n\n&#x200B;\n\n2.) If Obito did it because of Rin, then what were his motivations to \"lie\" here- [https://i.redd.it/em9lkhvxx5g21.png](https://i.redd.it/em9lkhvxx5g21.png)\n\nNothing of the links you gave me \"contradicts\" this statement like you said. In all of the links you gave me, Obito says he will, \"create a world where Rin will be alive,\" not, \"where I can live with her\". These sentences don't equate to one another like you seem to think.\n\n&#x200B;\n\n3.) Why did Obito try to convince the allied shinobi forces, Naruto, Bee, Kakashi, ect, to all GIVE UP? Why was he attempting to spare as many lives as possible? If he only did it for Rin then why not go all out and kill everyone so HE ALONE could go into the jutsu? Why did he try to PREVENT the war from taking place, by asking the 5 Kage for the tailed beasts before he initiated war? \n\n&#x200B;\n\n4.) Why didn't he ASK to be put in a genjutsu? I know this sounds silly, but Obito (while resistant if necesary) knows of Itachi's Tsukoyomi, which is essentially the same. If he wanted to be with Rin again, which is what you're suggesting, then why didn't he find an alternative to WORLD WAR 4?? I'm pretty sure Obito knows Itachi would be MORE than willing to comply.\n\n&#x200B;\n\n&#x200B;\n\nThe list goes on, and just based on these four bullet points it's pretty obvious he didn't do it for Rin. Yes that was his initial motive, but it was made BLATANTLY OBVIOUS that after this statement his goals altered.",
                                    "author": "VeryCool6969",
                                    "id": "ganu15m",
                                    "parent_id": "t1_ganqwmb",
                                    "score": -3,
                                    "created_utc": 1604109165.0,
                                    "replies": [
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "ganuxwe",
                                            "parent_id": "t1_ganu15m",
                                            "score": 4,
                                            "created_utc": 1604109746.0,
                                            "replies": [
                                                {
                                                    "body": "\" You're arguing that the war couldn't have been for Rin because the war was part of the plan and Obito didn't know about it in detail. \"\n\nNo, no i'm not. You're twisting what i'm trying to tell you. Obito declaring his association with the plan and 17 years later his involvement in the war do not correlate in the way you're trying to make it. Yes, Rin was Obito's catalyst. No, Rin wasn't why he started the war. Rin's death led Obito to want her alive again, which coincided with infinite Tsukuyomi. Obito DID NOT start the war with \"I want Rin alive again\" in mind. He wanted to be the \"savior\" as I said, (he calls himself such as well). Catalyst  **≠**  Motivation.\n\n&#x200B;\n\nYour argument stims from the fact that you believe the CATALYST for Obito's involvement is also his motive, which is not entirely true.\n\n&#x200B;\n\nJust because he wanted to create a world where Rin is alive DOES NOT mean that he acted ENTIRELY on that premise. You're jumping from point A-Z without paying attention to anything in the middle.\n\n&#x200B;\n\nI will once again repeat -  Catalyst  **≠**  Motivation - You seem to think they're synonyms.\n\n&#x200B;\n\nSo I will ask again, because at this point i'm genuinely curious to see how you answer these questions that you've been avoiding - \n\n&#x200B;\n\n \n\n1.) If Obito wanted to start the war to see Rin again, then why did he make such a fuss to not bring Madara back? In Madara's plan, Obito was supposed to bring him back so that Madara could CAST the jutsu (under the assumption Obito would be out in the genjutsu) but Obito wanted to keep him out of it. So given the chance to ACTUALLY SEE RIN AGAIN, he denies it. Why is that? Why does he want to be the one to cast the jutsu knowing he can't enter the world of dreams?\n\n2.) If Obito did it because of Rin, then what were his motivations to \"lie\" here- [https://i.redd.it/em9lkhvxx5g21.png](https://i.redd.it/em9lkhvxx5g21.png)\n\nNothing of the links you gave me \"contradicts\" this statement like you said. In all of the links you gave me, Obito says he will, \"create a world where Rin will be alive,\" not, \"where I can live with her\". These sentences don't equate to one another like you seem to think.\n\n3.) Why did Obito try to convince the allied shinobi forces, Naruto, Bee, Kakashi, ect, to all GIVE UP? Why was he attempting to spare as many lives as possible? If he only did it for Rin then why not go all out and kill everyone so HE ALONE could go into the jutsu? Why did he try to PREVENT the war from taking place, by asking the 5 Kage for the tailed beasts before he initiated war?\n\n4.) Why didn't he ASK to be put in a genjutsu? I know this sounds silly, but Obito (while resistant if necesary) knows of Itachi's Tsukoyomi, which is essentially the same. If he wanted to be with Rin again, which is what you're suggesting, then why didn't he find an alternative to WORLD WAR 4?? I'm pretty sure Obito knows Itachi would be MORE than willing to comply.",
                                                    "author": "VeryCool6969",
                                                    "id": "ganx5q6",
                                                    "parent_id": "t1_ganuxwe",
                                                    "score": 0,
                                                    "created_utc": 1604111181.0,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "body": "Obito fans sure love their own headcanons huh, it doesn't matter what he fucking said, his actions proved otherwise (and those goddamn Rin flashbacks) \n\n1. Its never stated whether he knows he will enter the dream world or not. All Madara knew was the God Tree's eye will be reflected on the moon, he didn't even knew he could absorb the God Tree. \n\n2. he had no motivations to lie here, but Kishimoto had motivations to make him a better villain because of how bad he was (although it results in a total FAIL) because he still thinks about Rin 30 more times after this conversation LOL \n\n3. he summoned the 9 Tails on the Leaf 16 years ago for the lulz and you think he care about human lives LOL, until the worst Talk no Jutsu in the series of course, all of a sudden he is the cool guy \n\n4. What makes you think Itachi would give Obito his wet dreams just because he asked for it?",
                                            "author": null,
                                            "id": "ganvm7n",
                                            "parent_id": "t1_ganu15m",
                                            "score": 2,
                                            "created_utc": 1604110180.0,
                                            "replies": [
                                                {
                                                    "body": "1. Well then why did Obito want to be the one to cast the justu? Why did he have a massive dispute with Madara over who would proceed with the jutsu? If what you say is true, then what was the point of Madara taking back the ten tails? Why didn't he just let Obito do it, if he thought he would go to the dream world either way?\n2. So what you're saying is that i'm right.\n3. He didn't do it \"for the lulz\". He extracted it out of Kushina for Infinite Tsukoyomi, but he lost his fight against Minato and lost control of the Kyuubi. Yes, he cares about people, but in a very twisted way. He believes that anyone who gets in his way is someone that needs to die for the greater good. He said, \"Fear not, for you will be in a world I will create,\" when Yahiko died. In this instance it's obvious he decided the death of Yahiko was necessary, but he didn't see it as permanent. Once his plan was created through the sacrifice he deems the deaths of those he killed, he would \"bring them back\" in the world he wanted to make.\n4. Yeah, actually. Itachi knows Obito is dangerous, and if Obito is asking to die then I see no reason Itachi wouldn't comply.",
                                                    "author": "VeryCool6969",
                                                    "id": "gany05u",
                                                    "parent_id": "t1_ganvm7n",
                                                    "score": -1,
                                                    "created_utc": 1604111744.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "It doesn't matter what he said, his actions proved otherwise (and those fucking Rin flasbacks)",
            "author": null,
            "id": "ganuggo",
            "parent_id": "t1_gangi1d",
            "score": 1,
            "created_utc": 1604109434.0,
            "replies": []
        },
        {
            "body": "\"Kakashi\"",
            "author": "wisdomsharerv2",
            "id": "gane9jl",
            "parent_id": "t1_gane269",
            "score": 16,
            "created_utc": 1604099504.0,
            "replies": []
        },
        {
            "body": "honestly tho but every major male character reads them except for Sasuke cuz he’s kinda gay",
            "author": "Cyber1969",
            "id": "ganc67x",
            "parent_id": "t1_ganbd6i",
            "score": 56,
            "created_utc": 1604098258.0,
            "replies": [
                {
                    "body": "In Boruto SD he even reads it",
                    "author": "tjd317",
                    "id": "ganczz0",
                    "parent_id": "t1_ganc67x",
                    "score": 33,
                    "created_utc": 1604098749.0,
                    "replies": []
                },
                {
                    "body": "Even Hinata reads them. Naruto doesn't like them tho and only keep them around because Jiraya is the author, Boruto even found them.",
                    "author": "DarkJayBR",
                    "id": "gaoje3n",
                    "parent_id": "t1_ganc67x",
                    "score": 16,
                    "created_utc": 1604130566.0,
                    "replies": [
                        {
                            "body": "wait wasn’t Hinata like “what is this?” when she caught Boruto?",
                            "author": "Cyber1969",
                            "id": "gapm843",
                            "parent_id": "t1_gaoje3n",
                            "score": 2,
                            "created_utc": 1604162668.0,
                            "replies": [
                                {
                                    "body": "She started reading them in the novels soon after this.",
                                    "author": "DarkJayBR",
                                    "id": "gapo6qe",
                                    "parent_id": "t1_gapm843",
                                    "score": 1,
                                    "created_utc": 1604163745.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "After rewatching Naruto now into adulthood all I can say is \"dattebayo\"",
            "author": "imhere2downvote",
            "id": "gao5o0e",
            "parent_id": "t1_ganobhx",
            "score": 2,
            "created_utc": 1604117114.0,
            "replies": []
        },
        {
            "body": "He also said that when he was 14, and Madara hadn't explained the plan in detail beyond \"a world of dreams\". Later he figures out that the caster of infinite tsukoyomi cant actually enter the dream world, so how was it for Rin?\n\nHe knew he couldn't go into the dream world, yet he did the plan anyway, and that's where the popular belief that Obito started the war to see Rin again crumbles. \n\nWhen he accepted Madara's plan it was under the belief that what he was doing was for the good of humanity (much like Madara envisioned). He changed his goal from becoming Hokage to becoming \"savior\" of the world.\n\nIf he was just doing it for Rin then why did he try to convince others to join him in his plan? If it was all for him then why didnt he just slaughter everyone? Why did he ask the alliance LIKE 30 TIMES to just give up and let their dreams become reality?",
            "author": "VeryCool6969",
            "id": "ganpvt8",
            "parent_id": "t1_ganp5px",
            "score": 7,
            "created_utc": 1604106543.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "ganqwmb",
                    "parent_id": "t1_ganpvt8",
                    "score": 10,
                    "created_utc": 1604107182.0,
                    "replies": [
                        {
                            "body": "I am fully aware of the flashback and the short \"conversation\" he had with Zetsu. Still, you fail to see my point. You're acting as if I claimed that he knew nothing of the plan, while that's just not true. I know he knew the basics of the plan. The point I was making was that he wasn't aware of the fact that he himself could not enter said dream world.\n\n   I also understand he wanted to create a world where \"Rin is alive again,\" and I never denied that. I simply said that when he made that statement, and when he had the flashback which you linked, it all took place before he was given the plan in full detail (which most likely encompassed the details which I mention).\n\nWhat we as the viewer are meant to draw from this is that Obito wants to create a world where no pain in felt, and \"dreams become a reality\". I will say it again, YES HE DID WANT RIN ALIVE AGAIN, but that wasn't what made him start the war. He started the war because he wanted everyone to be a part of the dream world, and so no one would have to endure the pain of loss. Obito said to Kakashi, \"To me, Rin was someone who wasn't supposed to die, so the dead Rin is an imposter. You were supposed to protect Rin, and because you failed at that, in my eyes you are an imposter as well!\" So at first he want to create a world where Rin can be ALIVE again (note how I didn't say WITH OBITO), after he had obviously learned of the duty of the caster of the eye of the moon plan (his conversation with Madara) he changed his goal from creating a world where Rin can exist, to creating a world where Rin can exist AS WELL AS THE REST OF THE WORLD. \n\n&#x200B;\n\nSo after all of this, you still didn't answer my question. (Blatant questions that each in their own right debunk your entire argument).\n\n&#x200B;\n\n1.) If Obito wanted to start the war to see Rin again, then why did he make such a fuss to not bring Madara back? In Madara's plan, Obito was supposed to bring him back so that Madara could CAST the jutsu (under the assumption Obito would be out in the genjutsu) but Obito wanted to keep him out of it. So given the chance to ACTUALLY SEE RIN AGAIN, he denies it. Why is that? Why does he want to be the one to cast the jutsu knowing he can't enter the world of dreams?\n\n&#x200B;\n\n2.) If Obito did it because of Rin, then what were his motivations to \"lie\" here- [https://i.redd.it/em9lkhvxx5g21.png](https://i.redd.it/em9lkhvxx5g21.png)\n\nNothing of the links you gave me \"contradicts\" this statement like you said. In all of the links you gave me, Obito says he will, \"create a world where Rin will be alive,\" not, \"where I can live with her\". These sentences don't equate to one another like you seem to think.\n\n&#x200B;\n\n3.) Why did Obito try to convince the allied shinobi forces, Naruto, Bee, Kakashi, ect, to all GIVE UP? Why was he attempting to spare as many lives as possible? If he only did it for Rin then why not go all out and kill everyone so HE ALONE could go into the jutsu? Why did he try to PREVENT the war from taking place, by asking the 5 Kage for the tailed beasts before he initiated war? \n\n&#x200B;\n\n4.) Why didn't he ASK to be put in a genjutsu? I know this sounds silly, but Obito (while resistant if necesary) knows of Itachi's Tsukoyomi, which is essentially the same. If he wanted to be with Rin again, which is what you're suggesting, then why didn't he find an alternative to WORLD WAR 4?? I'm pretty sure Obito knows Itachi would be MORE than willing to comply.\n\n&#x200B;\n\n&#x200B;\n\nThe list goes on, and just based on these four bullet points it's pretty obvious he didn't do it for Rin. Yes that was his initial motive, but it was made BLATANTLY OBVIOUS that after this statement his goals altered.",
                            "author": "VeryCool6969",
                            "id": "ganu15m",
                            "parent_id": "t1_ganqwmb",
                            "score": -3,
                            "created_utc": 1604109165.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "ganuxwe",
                                    "parent_id": "t1_ganu15m",
                                    "score": 4,
                                    "created_utc": 1604109746.0,
                                    "replies": [
                                        {
                                            "body": "\" You're arguing that the war couldn't have been for Rin because the war was part of the plan and Obito didn't know about it in detail. \"\n\nNo, no i'm not. You're twisting what i'm trying to tell you. Obito declaring his association with the plan and 17 years later his involvement in the war do not correlate in the way you're trying to make it. Yes, Rin was Obito's catalyst. No, Rin wasn't why he started the war. Rin's death led Obito to want her alive again, which coincided with infinite Tsukuyomi. Obito DID NOT start the war with \"I want Rin alive again\" in mind. He wanted to be the \"savior\" as I said, (he calls himself such as well). Catalyst  **≠**  Motivation.\n\n&#x200B;\n\nYour argument stims from the fact that you believe the CATALYST for Obito's involvement is also his motive, which is not entirely true.\n\n&#x200B;\n\nJust because he wanted to create a world where Rin is alive DOES NOT mean that he acted ENTIRELY on that premise. You're jumping from point A-Z without paying attention to anything in the middle.\n\n&#x200B;\n\nI will once again repeat -  Catalyst  **≠**  Motivation - You seem to think they're synonyms.\n\n&#x200B;\n\nSo I will ask again, because at this point i'm genuinely curious to see how you answer these questions that you've been avoiding - \n\n&#x200B;\n\n \n\n1.) If Obito wanted to start the war to see Rin again, then why did he make such a fuss to not bring Madara back? In Madara's plan, Obito was supposed to bring him back so that Madara could CAST the jutsu (under the assumption Obito would be out in the genjutsu) but Obito wanted to keep him out of it. So given the chance to ACTUALLY SEE RIN AGAIN, he denies it. Why is that? Why does he want to be the one to cast the jutsu knowing he can't enter the world of dreams?\n\n2.) If Obito did it because of Rin, then what were his motivations to \"lie\" here- [https://i.redd.it/em9lkhvxx5g21.png](https://i.redd.it/em9lkhvxx5g21.png)\n\nNothing of the links you gave me \"contradicts\" this statement like you said. In all of the links you gave me, Obito says he will, \"create a world where Rin will be alive,\" not, \"where I can live with her\". These sentences don't equate to one another like you seem to think.\n\n3.) Why did Obito try to convince the allied shinobi forces, Naruto, Bee, Kakashi, ect, to all GIVE UP? Why was he attempting to spare as many lives as possible? If he only did it for Rin then why not go all out and kill everyone so HE ALONE could go into the jutsu? Why did he try to PREVENT the war from taking place, by asking the 5 Kage for the tailed beasts before he initiated war?\n\n4.) Why didn't he ASK to be put in a genjutsu? I know this sounds silly, but Obito (while resistant if necesary) knows of Itachi's Tsukoyomi, which is essentially the same. If he wanted to be with Rin again, which is what you're suggesting, then why didn't he find an alternative to WORLD WAR 4?? I'm pretty sure Obito knows Itachi would be MORE than willing to comply.",
                                            "author": "VeryCool6969",
                                            "id": "ganx5q6",
                                            "parent_id": "t1_ganuxwe",
                                            "score": 0,
                                            "created_utc": 1604111181.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "Obito fans sure love their own headcanons huh, it doesn't matter what he fucking said, his actions proved otherwise (and those goddamn Rin flashbacks) \n\n1. Its never stated whether he knows he will enter the dream world or not. All Madara knew was the God Tree's eye will be reflected on the moon, he didn't even knew he could absorb the God Tree. \n\n2. he had no motivations to lie here, but Kishimoto had motivations to make him a better villain because of how bad he was (although it results in a total FAIL) because he still thinks about Rin 30 more times after this conversation LOL \n\n3. he summoned the 9 Tails on the Leaf 16 years ago for the lulz and you think he care about human lives LOL, until the worst Talk no Jutsu in the series of course, all of a sudden he is the cool guy \n\n4. What makes you think Itachi would give Obito his wet dreams just because he asked for it?",
                                    "author": null,
                                    "id": "ganvm7n",
                                    "parent_id": "t1_ganu15m",
                                    "score": 2,
                                    "created_utc": 1604110180.0,
                                    "replies": [
                                        {
                                            "body": "1. Well then why did Obito want to be the one to cast the justu? Why did he have a massive dispute with Madara over who would proceed with the jutsu? If what you say is true, then what was the point of Madara taking back the ten tails? Why didn't he just let Obito do it, if he thought he would go to the dream world either way?\n2. So what you're saying is that i'm right.\n3. He didn't do it \"for the lulz\". He extracted it out of Kushina for Infinite Tsukoyomi, but he lost his fight against Minato and lost control of the Kyuubi. Yes, he cares about people, but in a very twisted way. He believes that anyone who gets in his way is someone that needs to die for the greater good. He said, \"Fear not, for you will be in a world I will create,\" when Yahiko died. In this instance it's obvious he decided the death of Yahiko was necessary, but he didn't see it as permanent. Once his plan was created through the sacrifice he deems the deaths of those he killed, he would \"bring them back\" in the world he wanted to make.\n4. Yeah, actually. Itachi knows Obito is dangerous, and if Obito is asking to die then I see no reason Itachi wouldn't comply.",
                                            "author": "VeryCool6969",
                                            "id": "gany05u",
                                            "parent_id": "t1_ganvm7n",
                                            "score": -1,
                                            "created_utc": 1604111744.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "In Boruto SD he even reads it",
            "author": "tjd317",
            "id": "ganczz0",
            "parent_id": "t1_ganc67x",
            "score": 33,
            "created_utc": 1604098749.0,
            "replies": []
        },
        {
            "body": "Even Hinata reads them. Naruto doesn't like them tho and only keep them around because Jiraya is the author, Boruto even found them.",
            "author": "DarkJayBR",
            "id": "gaoje3n",
            "parent_id": "t1_ganc67x",
            "score": 16,
            "created_utc": 1604130566.0,
            "replies": [
                {
                    "body": "wait wasn’t Hinata like “what is this?” when she caught Boruto?",
                    "author": "Cyber1969",
                    "id": "gapm843",
                    "parent_id": "t1_gaoje3n",
                    "score": 2,
                    "created_utc": 1604162668.0,
                    "replies": [
                        {
                            "body": "She started reading them in the novels soon after this.",
                            "author": "DarkJayBR",
                            "id": "gapo6qe",
                            "parent_id": "t1_gapm843",
                            "score": 1,
                            "created_utc": 1604163745.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "ganqwmb",
            "parent_id": "t1_ganpvt8",
            "score": 10,
            "created_utc": 1604107182.0,
            "replies": [
                {
                    "body": "I am fully aware of the flashback and the short \"conversation\" he had with Zetsu. Still, you fail to see my point. You're acting as if I claimed that he knew nothing of the plan, while that's just not true. I know he knew the basics of the plan. The point I was making was that he wasn't aware of the fact that he himself could not enter said dream world.\n\n   I also understand he wanted to create a world where \"Rin is alive again,\" and I never denied that. I simply said that when he made that statement, and when he had the flashback which you linked, it all took place before he was given the plan in full detail (which most likely encompassed the details which I mention).\n\nWhat we as the viewer are meant to draw from this is that Obito wants to create a world where no pain in felt, and \"dreams become a reality\". I will say it again, YES HE DID WANT RIN ALIVE AGAIN, but that wasn't what made him start the war. He started the war because he wanted everyone to be a part of the dream world, and so no one would have to endure the pain of loss. Obito said to Kakashi, \"To me, Rin was someone who wasn't supposed to die, so the dead Rin is an imposter. You were supposed to protect Rin, and because you failed at that, in my eyes you are an imposter as well!\" So at first he want to create a world where Rin can be ALIVE again (note how I didn't say WITH OBITO), after he had obviously learned of the duty of the caster of the eye of the moon plan (his conversation with Madara) he changed his goal from creating a world where Rin can exist, to creating a world where Rin can exist AS WELL AS THE REST OF THE WORLD. \n\n&#x200B;\n\nSo after all of this, you still didn't answer my question. (Blatant questions that each in their own right debunk your entire argument).\n\n&#x200B;\n\n1.) If Obito wanted to start the war to see Rin again, then why did he make such a fuss to not bring Madara back? In Madara's plan, Obito was supposed to bring him back so that Madara could CAST the jutsu (under the assumption Obito would be out in the genjutsu) but Obito wanted to keep him out of it. So given the chance to ACTUALLY SEE RIN AGAIN, he denies it. Why is that? Why does he want to be the one to cast the jutsu knowing he can't enter the world of dreams?\n\n&#x200B;\n\n2.) If Obito did it because of Rin, then what were his motivations to \"lie\" here- [https://i.redd.it/em9lkhvxx5g21.png](https://i.redd.it/em9lkhvxx5g21.png)\n\nNothing of the links you gave me \"contradicts\" this statement like you said. In all of the links you gave me, Obito says he will, \"create a world where Rin will be alive,\" not, \"where I can live with her\". These sentences don't equate to one another like you seem to think.\n\n&#x200B;\n\n3.) Why did Obito try to convince the allied shinobi forces, Naruto, Bee, Kakashi, ect, to all GIVE UP? Why was he attempting to spare as many lives as possible? If he only did it for Rin then why not go all out and kill everyone so HE ALONE could go into the jutsu? Why did he try to PREVENT the war from taking place, by asking the 5 Kage for the tailed beasts before he initiated war? \n\n&#x200B;\n\n4.) Why didn't he ASK to be put in a genjutsu? I know this sounds silly, but Obito (while resistant if necesary) knows of Itachi's Tsukoyomi, which is essentially the same. If he wanted to be with Rin again, which is what you're suggesting, then why didn't he find an alternative to WORLD WAR 4?? I'm pretty sure Obito knows Itachi would be MORE than willing to comply.\n\n&#x200B;\n\n&#x200B;\n\nThe list goes on, and just based on these four bullet points it's pretty obvious he didn't do it for Rin. Yes that was his initial motive, but it was made BLATANTLY OBVIOUS that after this statement his goals altered.",
                    "author": "VeryCool6969",
                    "id": "ganu15m",
                    "parent_id": "t1_ganqwmb",
                    "score": -3,
                    "created_utc": 1604109165.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "ganuxwe",
                            "parent_id": "t1_ganu15m",
                            "score": 4,
                            "created_utc": 1604109746.0,
                            "replies": [
                                {
                                    "body": "\" You're arguing that the war couldn't have been for Rin because the war was part of the plan and Obito didn't know about it in detail. \"\n\nNo, no i'm not. You're twisting what i'm trying to tell you. Obito declaring his association with the plan and 17 years later his involvement in the war do not correlate in the way you're trying to make it. Yes, Rin was Obito's catalyst. No, Rin wasn't why he started the war. Rin's death led Obito to want her alive again, which coincided with infinite Tsukuyomi. Obito DID NOT start the war with \"I want Rin alive again\" in mind. He wanted to be the \"savior\" as I said, (he calls himself such as well). Catalyst  **≠**  Motivation.\n\n&#x200B;\n\nYour argument stims from the fact that you believe the CATALYST for Obito's involvement is also his motive, which is not entirely true.\n\n&#x200B;\n\nJust because he wanted to create a world where Rin is alive DOES NOT mean that he acted ENTIRELY on that premise. You're jumping from point A-Z without paying attention to anything in the middle.\n\n&#x200B;\n\nI will once again repeat -  Catalyst  **≠**  Motivation - You seem to think they're synonyms.\n\n&#x200B;\n\nSo I will ask again, because at this point i'm genuinely curious to see how you answer these questions that you've been avoiding - \n\n&#x200B;\n\n \n\n1.) If Obito wanted to start the war to see Rin again, then why did he make such a fuss to not bring Madara back? In Madara's plan, Obito was supposed to bring him back so that Madara could CAST the jutsu (under the assumption Obito would be out in the genjutsu) but Obito wanted to keep him out of it. So given the chance to ACTUALLY SEE RIN AGAIN, he denies it. Why is that? Why does he want to be the one to cast the jutsu knowing he can't enter the world of dreams?\n\n2.) If Obito did it because of Rin, then what were his motivations to \"lie\" here- [https://i.redd.it/em9lkhvxx5g21.png](https://i.redd.it/em9lkhvxx5g21.png)\n\nNothing of the links you gave me \"contradicts\" this statement like you said. In all of the links you gave me, Obito says he will, \"create a world where Rin will be alive,\" not, \"where I can live with her\". These sentences don't equate to one another like you seem to think.\n\n3.) Why did Obito try to convince the allied shinobi forces, Naruto, Bee, Kakashi, ect, to all GIVE UP? Why was he attempting to spare as many lives as possible? If he only did it for Rin then why not go all out and kill everyone so HE ALONE could go into the jutsu? Why did he try to PREVENT the war from taking place, by asking the 5 Kage for the tailed beasts before he initiated war?\n\n4.) Why didn't he ASK to be put in a genjutsu? I know this sounds silly, but Obito (while resistant if necesary) knows of Itachi's Tsukoyomi, which is essentially the same. If he wanted to be with Rin again, which is what you're suggesting, then why didn't he find an alternative to WORLD WAR 4?? I'm pretty sure Obito knows Itachi would be MORE than willing to comply.",
                                    "author": "VeryCool6969",
                                    "id": "ganx5q6",
                                    "parent_id": "t1_ganuxwe",
                                    "score": 0,
                                    "created_utc": 1604111181.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Obito fans sure love their own headcanons huh, it doesn't matter what he fucking said, his actions proved otherwise (and those goddamn Rin flashbacks) \n\n1. Its never stated whether he knows he will enter the dream world or not. All Madara knew was the God Tree's eye will be reflected on the moon, he didn't even knew he could absorb the God Tree. \n\n2. he had no motivations to lie here, but Kishimoto had motivations to make him a better villain because of how bad he was (although it results in a total FAIL) because he still thinks about Rin 30 more times after this conversation LOL \n\n3. he summoned the 9 Tails on the Leaf 16 years ago for the lulz and you think he care about human lives LOL, until the worst Talk no Jutsu in the series of course, all of a sudden he is the cool guy \n\n4. What makes you think Itachi would give Obito his wet dreams just because he asked for it?",
                            "author": null,
                            "id": "ganvm7n",
                            "parent_id": "t1_ganu15m",
                            "score": 2,
                            "created_utc": 1604110180.0,
                            "replies": [
                                {
                                    "body": "1. Well then why did Obito want to be the one to cast the justu? Why did he have a massive dispute with Madara over who would proceed with the jutsu? If what you say is true, then what was the point of Madara taking back the ten tails? Why didn't he just let Obito do it, if he thought he would go to the dream world either way?\n2. So what you're saying is that i'm right.\n3. He didn't do it \"for the lulz\". He extracted it out of Kushina for Infinite Tsukoyomi, but he lost his fight against Minato and lost control of the Kyuubi. Yes, he cares about people, but in a very twisted way. He believes that anyone who gets in his way is someone that needs to die for the greater good. He said, \"Fear not, for you will be in a world I will create,\" when Yahiko died. In this instance it's obvious he decided the death of Yahiko was necessary, but he didn't see it as permanent. Once his plan was created through the sacrifice he deems the deaths of those he killed, he would \"bring them back\" in the world he wanted to make.\n4. Yeah, actually. Itachi knows Obito is dangerous, and if Obito is asking to die then I see no reason Itachi wouldn't comply.",
                                    "author": "VeryCool6969",
                                    "id": "gany05u",
                                    "parent_id": "t1_ganvm7n",
                                    "score": -1,
                                    "created_utc": 1604111744.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "wait wasn’t Hinata like “what is this?” when she caught Boruto?",
            "author": "Cyber1969",
            "id": "gapm843",
            "parent_id": "t1_gaoje3n",
            "score": 2,
            "created_utc": 1604162668.0,
            "replies": [
                {
                    "body": "She started reading them in the novels soon after this.",
                    "author": "DarkJayBR",
                    "id": "gapo6qe",
                    "parent_id": "t1_gapm843",
                    "score": 1,
                    "created_utc": 1604163745.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I am fully aware of the flashback and the short \"conversation\" he had with Zetsu. Still, you fail to see my point. You're acting as if I claimed that he knew nothing of the plan, while that's just not true. I know he knew the basics of the plan. The point I was making was that he wasn't aware of the fact that he himself could not enter said dream world.\n\n   I also understand he wanted to create a world where \"Rin is alive again,\" and I never denied that. I simply said that when he made that statement, and when he had the flashback which you linked, it all took place before he was given the plan in full detail (which most likely encompassed the details which I mention).\n\nWhat we as the viewer are meant to draw from this is that Obito wants to create a world where no pain in felt, and \"dreams become a reality\". I will say it again, YES HE DID WANT RIN ALIVE AGAIN, but that wasn't what made him start the war. He started the war because he wanted everyone to be a part of the dream world, and so no one would have to endure the pain of loss. Obito said to Kakashi, \"To me, Rin was someone who wasn't supposed to die, so the dead Rin is an imposter. You were supposed to protect Rin, and because you failed at that, in my eyes you are an imposter as well!\" So at first he want to create a world where Rin can be ALIVE again (note how I didn't say WITH OBITO), after he had obviously learned of the duty of the caster of the eye of the moon plan (his conversation with Madara) he changed his goal from creating a world where Rin can exist, to creating a world where Rin can exist AS WELL AS THE REST OF THE WORLD. \n\n&#x200B;\n\nSo after all of this, you still didn't answer my question. (Blatant questions that each in their own right debunk your entire argument).\n\n&#x200B;\n\n1.) If Obito wanted to start the war to see Rin again, then why did he make such a fuss to not bring Madara back? In Madara's plan, Obito was supposed to bring him back so that Madara could CAST the jutsu (under the assumption Obito would be out in the genjutsu) but Obito wanted to keep him out of it. So given the chance to ACTUALLY SEE RIN AGAIN, he denies it. Why is that? Why does he want to be the one to cast the jutsu knowing he can't enter the world of dreams?\n\n&#x200B;\n\n2.) If Obito did it because of Rin, then what were his motivations to \"lie\" here- [https://i.redd.it/em9lkhvxx5g21.png](https://i.redd.it/em9lkhvxx5g21.png)\n\nNothing of the links you gave me \"contradicts\" this statement like you said. In all of the links you gave me, Obito says he will, \"create a world where Rin will be alive,\" not, \"where I can live with her\". These sentences don't equate to one another like you seem to think.\n\n&#x200B;\n\n3.) Why did Obito try to convince the allied shinobi forces, Naruto, Bee, Kakashi, ect, to all GIVE UP? Why was he attempting to spare as many lives as possible? If he only did it for Rin then why not go all out and kill everyone so HE ALONE could go into the jutsu? Why did he try to PREVENT the war from taking place, by asking the 5 Kage for the tailed beasts before he initiated war? \n\n&#x200B;\n\n4.) Why didn't he ASK to be put in a genjutsu? I know this sounds silly, but Obito (while resistant if necesary) knows of Itachi's Tsukoyomi, which is essentially the same. If he wanted to be with Rin again, which is what you're suggesting, then why didn't he find an alternative to WORLD WAR 4?? I'm pretty sure Obito knows Itachi would be MORE than willing to comply.\n\n&#x200B;\n\n&#x200B;\n\nThe list goes on, and just based on these four bullet points it's pretty obvious he didn't do it for Rin. Yes that was his initial motive, but it was made BLATANTLY OBVIOUS that after this statement his goals altered.",
            "author": "VeryCool6969",
            "id": "ganu15m",
            "parent_id": "t1_ganqwmb",
            "score": -3,
            "created_utc": 1604109165.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "ganuxwe",
                    "parent_id": "t1_ganu15m",
                    "score": 4,
                    "created_utc": 1604109746.0,
                    "replies": [
                        {
                            "body": "\" You're arguing that the war couldn't have been for Rin because the war was part of the plan and Obito didn't know about it in detail. \"\n\nNo, no i'm not. You're twisting what i'm trying to tell you. Obito declaring his association with the plan and 17 years later his involvement in the war do not correlate in the way you're trying to make it. Yes, Rin was Obito's catalyst. No, Rin wasn't why he started the war. Rin's death led Obito to want her alive again, which coincided with infinite Tsukuyomi. Obito DID NOT start the war with \"I want Rin alive again\" in mind. He wanted to be the \"savior\" as I said, (he calls himself such as well). Catalyst  **≠**  Motivation.\n\n&#x200B;\n\nYour argument stims from the fact that you believe the CATALYST for Obito's involvement is also his motive, which is not entirely true.\n\n&#x200B;\n\nJust because he wanted to create a world where Rin is alive DOES NOT mean that he acted ENTIRELY on that premise. You're jumping from point A-Z without paying attention to anything in the middle.\n\n&#x200B;\n\nI will once again repeat -  Catalyst  **≠**  Motivation - You seem to think they're synonyms.\n\n&#x200B;\n\nSo I will ask again, because at this point i'm genuinely curious to see how you answer these questions that you've been avoiding - \n\n&#x200B;\n\n \n\n1.) If Obito wanted to start the war to see Rin again, then why did he make such a fuss to not bring Madara back? In Madara's plan, Obito was supposed to bring him back so that Madara could CAST the jutsu (under the assumption Obito would be out in the genjutsu) but Obito wanted to keep him out of it. So given the chance to ACTUALLY SEE RIN AGAIN, he denies it. Why is that? Why does he want to be the one to cast the jutsu knowing he can't enter the world of dreams?\n\n2.) If Obito did it because of Rin, then what were his motivations to \"lie\" here- [https://i.redd.it/em9lkhvxx5g21.png](https://i.redd.it/em9lkhvxx5g21.png)\n\nNothing of the links you gave me \"contradicts\" this statement like you said. In all of the links you gave me, Obito says he will, \"create a world where Rin will be alive,\" not, \"where I can live with her\". These sentences don't equate to one another like you seem to think.\n\n3.) Why did Obito try to convince the allied shinobi forces, Naruto, Bee, Kakashi, ect, to all GIVE UP? Why was he attempting to spare as many lives as possible? If he only did it for Rin then why not go all out and kill everyone so HE ALONE could go into the jutsu? Why did he try to PREVENT the war from taking place, by asking the 5 Kage for the tailed beasts before he initiated war?\n\n4.) Why didn't he ASK to be put in a genjutsu? I know this sounds silly, but Obito (while resistant if necesary) knows of Itachi's Tsukoyomi, which is essentially the same. If he wanted to be with Rin again, which is what you're suggesting, then why didn't he find an alternative to WORLD WAR 4?? I'm pretty sure Obito knows Itachi would be MORE than willing to comply.",
                            "author": "VeryCool6969",
                            "id": "ganx5q6",
                            "parent_id": "t1_ganuxwe",
                            "score": 0,
                            "created_utc": 1604111181.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Obito fans sure love their own headcanons huh, it doesn't matter what he fucking said, his actions proved otherwise (and those goddamn Rin flashbacks) \n\n1. Its never stated whether he knows he will enter the dream world or not. All Madara knew was the God Tree's eye will be reflected on the moon, he didn't even knew he could absorb the God Tree. \n\n2. he had no motivations to lie here, but Kishimoto had motivations to make him a better villain because of how bad he was (although it results in a total FAIL) because he still thinks about Rin 30 more times after this conversation LOL \n\n3. he summoned the 9 Tails on the Leaf 16 years ago for the lulz and you think he care about human lives LOL, until the worst Talk no Jutsu in the series of course, all of a sudden he is the cool guy \n\n4. What makes you think Itachi would give Obito his wet dreams just because he asked for it?",
                    "author": null,
                    "id": "ganvm7n",
                    "parent_id": "t1_ganu15m",
                    "score": 2,
                    "created_utc": 1604110180.0,
                    "replies": [
                        {
                            "body": "1. Well then why did Obito want to be the one to cast the justu? Why did he have a massive dispute with Madara over who would proceed with the jutsu? If what you say is true, then what was the point of Madara taking back the ten tails? Why didn't he just let Obito do it, if he thought he would go to the dream world either way?\n2. So what you're saying is that i'm right.\n3. He didn't do it \"for the lulz\". He extracted it out of Kushina for Infinite Tsukoyomi, but he lost his fight against Minato and lost control of the Kyuubi. Yes, he cares about people, but in a very twisted way. He believes that anyone who gets in his way is someone that needs to die for the greater good. He said, \"Fear not, for you will be in a world I will create,\" when Yahiko died. In this instance it's obvious he decided the death of Yahiko was necessary, but he didn't see it as permanent. Once his plan was created through the sacrifice he deems the deaths of those he killed, he would \"bring them back\" in the world he wanted to make.\n4. Yeah, actually. Itachi knows Obito is dangerous, and if Obito is asking to die then I see no reason Itachi wouldn't comply.",
                            "author": "VeryCool6969",
                            "id": "gany05u",
                            "parent_id": "t1_ganvm7n",
                            "score": -1,
                            "created_utc": 1604111744.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "She started reading them in the novels soon after this.",
            "author": "DarkJayBR",
            "id": "gapo6qe",
            "parent_id": "t1_gapm843",
            "score": 1,
            "created_utc": 1604163745.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "ganuxwe",
            "parent_id": "t1_ganu15m",
            "score": 4,
            "created_utc": 1604109746.0,
            "replies": [
                {
                    "body": "\" You're arguing that the war couldn't have been for Rin because the war was part of the plan and Obito didn't know about it in detail. \"\n\nNo, no i'm not. You're twisting what i'm trying to tell you. Obito declaring his association with the plan and 17 years later his involvement in the war do not correlate in the way you're trying to make it. Yes, Rin was Obito's catalyst. No, Rin wasn't why he started the war. Rin's death led Obito to want her alive again, which coincided with infinite Tsukuyomi. Obito DID NOT start the war with \"I want Rin alive again\" in mind. He wanted to be the \"savior\" as I said, (he calls himself such as well). Catalyst  **≠**  Motivation.\n\n&#x200B;\n\nYour argument stims from the fact that you believe the CATALYST for Obito's involvement is also his motive, which is not entirely true.\n\n&#x200B;\n\nJust because he wanted to create a world where Rin is alive DOES NOT mean that he acted ENTIRELY on that premise. You're jumping from point A-Z without paying attention to anything in the middle.\n\n&#x200B;\n\nI will once again repeat -  Catalyst  **≠**  Motivation - You seem to think they're synonyms.\n\n&#x200B;\n\nSo I will ask again, because at this point i'm genuinely curious to see how you answer these questions that you've been avoiding - \n\n&#x200B;\n\n \n\n1.) If Obito wanted to start the war to see Rin again, then why did he make such a fuss to not bring Madara back? In Madara's plan, Obito was supposed to bring him back so that Madara could CAST the jutsu (under the assumption Obito would be out in the genjutsu) but Obito wanted to keep him out of it. So given the chance to ACTUALLY SEE RIN AGAIN, he denies it. Why is that? Why does he want to be the one to cast the jutsu knowing he can't enter the world of dreams?\n\n2.) If Obito did it because of Rin, then what were his motivations to \"lie\" here- [https://i.redd.it/em9lkhvxx5g21.png](https://i.redd.it/em9lkhvxx5g21.png)\n\nNothing of the links you gave me \"contradicts\" this statement like you said. In all of the links you gave me, Obito says he will, \"create a world where Rin will be alive,\" not, \"where I can live with her\". These sentences don't equate to one another like you seem to think.\n\n3.) Why did Obito try to convince the allied shinobi forces, Naruto, Bee, Kakashi, ect, to all GIVE UP? Why was he attempting to spare as many lives as possible? If he only did it for Rin then why not go all out and kill everyone so HE ALONE could go into the jutsu? Why did he try to PREVENT the war from taking place, by asking the 5 Kage for the tailed beasts before he initiated war?\n\n4.) Why didn't he ASK to be put in a genjutsu? I know this sounds silly, but Obito (while resistant if necesary) knows of Itachi's Tsukoyomi, which is essentially the same. If he wanted to be with Rin again, which is what you're suggesting, then why didn't he find an alternative to WORLD WAR 4?? I'm pretty sure Obito knows Itachi would be MORE than willing to comply.",
                    "author": "VeryCool6969",
                    "id": "ganx5q6",
                    "parent_id": "t1_ganuxwe",
                    "score": 0,
                    "created_utc": 1604111181.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Obito fans sure love their own headcanons huh, it doesn't matter what he fucking said, his actions proved otherwise (and those goddamn Rin flashbacks) \n\n1. Its never stated whether he knows he will enter the dream world or not. All Madara knew was the God Tree's eye will be reflected on the moon, he didn't even knew he could absorb the God Tree. \n\n2. he had no motivations to lie here, but Kishimoto had motivations to make him a better villain because of how bad he was (although it results in a total FAIL) because he still thinks about Rin 30 more times after this conversation LOL \n\n3. he summoned the 9 Tails on the Leaf 16 years ago for the lulz and you think he care about human lives LOL, until the worst Talk no Jutsu in the series of course, all of a sudden he is the cool guy \n\n4. What makes you think Itachi would give Obito his wet dreams just because he asked for it?",
            "author": null,
            "id": "ganvm7n",
            "parent_id": "t1_ganu15m",
            "score": 2,
            "created_utc": 1604110180.0,
            "replies": [
                {
                    "body": "1. Well then why did Obito want to be the one to cast the justu? Why did he have a massive dispute with Madara over who would proceed with the jutsu? If what you say is true, then what was the point of Madara taking back the ten tails? Why didn't he just let Obito do it, if he thought he would go to the dream world either way?\n2. So what you're saying is that i'm right.\n3. He didn't do it \"for the lulz\". He extracted it out of Kushina for Infinite Tsukoyomi, but he lost his fight against Minato and lost control of the Kyuubi. Yes, he cares about people, but in a very twisted way. He believes that anyone who gets in his way is someone that needs to die for the greater good. He said, \"Fear not, for you will be in a world I will create,\" when Yahiko died. In this instance it's obvious he decided the death of Yahiko was necessary, but he didn't see it as permanent. Once his plan was created through the sacrifice he deems the deaths of those he killed, he would \"bring them back\" in the world he wanted to make.\n4. Yeah, actually. Itachi knows Obito is dangerous, and if Obito is asking to die then I see no reason Itachi wouldn't comply.",
                    "author": "VeryCool6969",
                    "id": "gany05u",
                    "parent_id": "t1_ganvm7n",
                    "score": -1,
                    "created_utc": 1604111744.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "\" You're arguing that the war couldn't have been for Rin because the war was part of the plan and Obito didn't know about it in detail. \"\n\nNo, no i'm not. You're twisting what i'm trying to tell you. Obito declaring his association with the plan and 17 years later his involvement in the war do not correlate in the way you're trying to make it. Yes, Rin was Obito's catalyst. No, Rin wasn't why he started the war. Rin's death led Obito to want her alive again, which coincided with infinite Tsukuyomi. Obito DID NOT start the war with \"I want Rin alive again\" in mind. He wanted to be the \"savior\" as I said, (he calls himself such as well). Catalyst  **≠**  Motivation.\n\n&#x200B;\n\nYour argument stims from the fact that you believe the CATALYST for Obito's involvement is also his motive, which is not entirely true.\n\n&#x200B;\n\nJust because he wanted to create a world where Rin is alive DOES NOT mean that he acted ENTIRELY on that premise. You're jumping from point A-Z without paying attention to anything in the middle.\n\n&#x200B;\n\nI will once again repeat -  Catalyst  **≠**  Motivation - You seem to think they're synonyms.\n\n&#x200B;\n\nSo I will ask again, because at this point i'm genuinely curious to see how you answer these questions that you've been avoiding - \n\n&#x200B;\n\n \n\n1.) If Obito wanted to start the war to see Rin again, then why did he make such a fuss to not bring Madara back? In Madara's plan, Obito was supposed to bring him back so that Madara could CAST the jutsu (under the assumption Obito would be out in the genjutsu) but Obito wanted to keep him out of it. So given the chance to ACTUALLY SEE RIN AGAIN, he denies it. Why is that? Why does he want to be the one to cast the jutsu knowing he can't enter the world of dreams?\n\n2.) If Obito did it because of Rin, then what were his motivations to \"lie\" here- [https://i.redd.it/em9lkhvxx5g21.png](https://i.redd.it/em9lkhvxx5g21.png)\n\nNothing of the links you gave me \"contradicts\" this statement like you said. In all of the links you gave me, Obito says he will, \"create a world where Rin will be alive,\" not, \"where I can live with her\". These sentences don't equate to one another like you seem to think.\n\n3.) Why did Obito try to convince the allied shinobi forces, Naruto, Bee, Kakashi, ect, to all GIVE UP? Why was he attempting to spare as many lives as possible? If he only did it for Rin then why not go all out and kill everyone so HE ALONE could go into the jutsu? Why did he try to PREVENT the war from taking place, by asking the 5 Kage for the tailed beasts before he initiated war?\n\n4.) Why didn't he ASK to be put in a genjutsu? I know this sounds silly, but Obito (while resistant if necesary) knows of Itachi's Tsukoyomi, which is essentially the same. If he wanted to be with Rin again, which is what you're suggesting, then why didn't he find an alternative to WORLD WAR 4?? I'm pretty sure Obito knows Itachi would be MORE than willing to comply.",
            "author": "VeryCool6969",
            "id": "ganx5q6",
            "parent_id": "t1_ganuxwe",
            "score": 0,
            "created_utc": 1604111181.0,
            "replies": []
        },
        {
            "body": "1. Well then why did Obito want to be the one to cast the justu? Why did he have a massive dispute with Madara over who would proceed with the jutsu? If what you say is true, then what was the point of Madara taking back the ten tails? Why didn't he just let Obito do it, if he thought he would go to the dream world either way?\n2. So what you're saying is that i'm right.\n3. He didn't do it \"for the lulz\". He extracted it out of Kushina for Infinite Tsukoyomi, but he lost his fight against Minato and lost control of the Kyuubi. Yes, he cares about people, but in a very twisted way. He believes that anyone who gets in his way is someone that needs to die for the greater good. He said, \"Fear not, for you will be in a world I will create,\" when Yahiko died. In this instance it's obvious he decided the death of Yahiko was necessary, but he didn't see it as permanent. Once his plan was created through the sacrifice he deems the deaths of those he killed, he would \"bring them back\" in the world he wanted to make.\n4. Yeah, actually. Itachi knows Obito is dangerous, and if Obito is asking to die then I see no reason Itachi wouldn't comply.",
            "author": "VeryCool6969",
            "id": "gany05u",
            "parent_id": "t1_ganvm7n",
            "score": -1,
            "created_utc": 1604111744.0,
            "replies": []
        }
    ]
}