{
    "title": "35, divorced a few years back and trying (unsuccessfully) to get back into the dating world. With short hair, I'm compared to Jason Bateman, with long enough hair, I'm compared to Ozzy. Can we fix it?",
    "post_id": "jr0t93",
    "post_url": "https://www.reddit.com/r/malehairadvice/comments/jr0t93/35_divorced_a_few_years_back_and_trying/",
    "author": "Weneeddietbleach",
    "body": "",
    "url": "https://www.reddit.com/gallery/jr0t93",
    "score": 256,
    "upvote_ratio": 0.99,
    "created_utc": 1604939475.0,
    "num_comments": 66,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "**Constructive criticism**: Beard and hair look a bit neckbeardy in some of the pictures TBH. Hair is receding a bit (which is okay), but slicking / pulling it back accentuates it and makes it look more receded than it actually is. Cut it short, blow-dry after showering, and use some American Crew fiber to give it body, play with just parting it and combing it up a bit. You could even try some minoxidil on top if you wanted for extra growth.\n\n**Positive criticism:** Oh dude, *definitely* the Bateman look / first picture. You look great clean-shaven, 10 years younger, and it sounds like you prefer it anyway. Bateman is handsome as F and so are you.",
            "author": "scottyLogJobs",
            "id": "gbqid3z",
            "parent_id": "t3_jr0t93",
            "score": 217,
            "created_utc": 1604942444.0,
            "replies": [
                {
                    "body": "Well in all fairness, the first pic is about 2-3 years ago and before the stresses of the divorce and being a single father, the desire to date, and the feelings of hopelessness really did their damage.\n\nBut I agree with the neckbeardy look. I would only go 2-3 days max without shaving and just felt like seeing how it turns out. I'm sure my fivehead doesn't help with the rest though.",
                    "author": "Weneeddietbleach",
                    "id": "gbqj6pw",
                    "parent_id": "t1_gbqid3z",
                    "score": 64,
                    "created_utc": 1604942837.0,
                    "replies": [
                        {
                            "body": "Ha, nah man, I think you're still looking good, but yeah if you wanna go for the beard, keep the neck trimmed down either way and just do minoxidil on the face too, and you could go for the ol' viking look. it's pretty miraculous stuff:\n\nhttps://www.reddit.com/r/Minoxbeards/top/?sort=top&t=all",
                            "author": "scottyLogJobs",
                            "id": "gbqjttv",
                            "parent_id": "t1_gbqj6pw",
                            "score": 13,
                            "created_utc": 1604943140.0,
                            "replies": [
                                {
                                    "body": "That's actually not bad at all. I feel kind of weird with this \"in between\" state and have been itching to shave. Maybe I'll look for that instead. Granted, as white as it is, I still wonder if it would look as good for me as it does those guys.",
                                    "author": "Weneeddietbleach",
                                    "id": "gbqkd7v",
                                    "parent_id": "t1_gbqjttv",
                                    "score": 7,
                                    "created_utc": 1604943397.0,
                                    "replies": [
                                        {
                                            "body": "Only one way to find out pal! I've been doing minox on and off for the past few months too. Can't say I don't notice the gains.",
                                            "author": "DDESTRUCTOTRON",
                                            "id": "gbqy3kf",
                                            "parent_id": "t1_gbqkd7v",
                                            "score": 2,
                                            "created_utc": 1604949980.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Agree with everything but the American Crew Fiber part: to fine/receding hair it works awful, makes the locks greasy instantly.\n\nSpeaking from experience, Pacinos Matte Paste or something of this sort (paste or cream-like texture with no shine) would be the best, it’s more like a clay product but easier to apply.",
                    "author": "ladyzhenskyievg",
                    "id": "gbrwdwu",
                    "parent_id": "t1_gbqid3z",
                    "score": 4,
                    "created_utc": 1604966458.0,
                    "replies": [
                        {
                            "body": "Thanks, I'll look into it as well. I usually use layrite superhold or American Crew forming cream",
                            "author": "scottyLogJobs",
                            "id": "gbsf70y",
                            "parent_id": "t1_gbrwdwu",
                            "score": 1,
                            "created_utc": 1604976218.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "I saw Bateman before reading the title.  That’s the look, brother!  You rock it.",
                    "author": "shibbyoh",
                    "id": "gbs8jah",
                    "parent_id": "t1_gbqid3z",
                    "score": 1,
                    "created_utc": 1604972595.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gbqlf4p",
            "parent_id": "t3_jr0t93",
            "score": 28,
            "created_utc": 1604943900.0,
            "replies": [
                {
                    "body": "Yeah, the long hair gets mixed reviews. Anyone that cuts it goes on about how thick it is. The ex-wife liked it, most girls that comment didn't (though most were family so I didn't care).",
                    "author": "Weneeddietbleach",
                    "id": "gbqlvlm",
                    "parent_id": "t1_gbqlf4p",
                    "score": 6,
                    "created_utc": 1604944116.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "gbqmsae",
                            "parent_id": "t1_gbqlvlm",
                            "score": 10,
                            "created_utc": 1604944544.0,
                            "replies": [
                                {
                                    "body": "agree with the goatee, looks like a full beard might just not be in the cards without it looking patchy for months before the cheeks grow in. Shorter hair will be a much better look too.\n\nAnd super thick hair often means when the MPB does hit, it will hit hard. My dad and I both had amazing hair up until mid 20s. Now I just rock a hat most of the time and buzz my hair. Working my way up to the shaved head, partially because I'm somewhat in denial and because it seems like a lot of maintenance/expense to shave my whole head every morning and have to buy razors more frequently.",
                                    "author": "Tossup1010",
                                    "id": "gbrr0nu",
                                    "parent_id": "t1_gbqmsae",
                                    "score": 3,
                                    "created_utc": 1604964009.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Just going to slide in here to second the \"cut the short hair shorter\". The long hair is not a good look. It's not just your family thinking that, I promise you.",
                            "author": "techknowfile",
                            "id": "gbqs1fu",
                            "parent_id": "t1_gbqlvlm",
                            "score": 4,
                            "created_utc": 1604947081.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I agree with what other people are saying in here. Your style is obviously personal preference, so obviously feel free to ignore my opinion!\n\nI'd go completely clean shaven, I think it's much more mature looking for you.",
            "author": "GnoffPrince",
            "id": "gbqnb7d",
            "parent_id": "t3_jr0t93",
            "score": 13,
            "created_utc": 1604944798.0,
            "replies": [
                {
                    "body": "I wanna second this nice reply; you have a kind face and clean shaven suits you. \n\nPersonally, I always feel like I'm looking my best when I emphasize my strengths. Rather than trying to make up for my mediocreness. Thus, in your case, i would emphasize the thick hair by keeping some but not the long style that keeps your nice looking face hidden.",
                    "author": "ginghamshirt",
                    "id": "gbrk5yu",
                    "parent_id": "t1_gbqnb7d",
                    "score": 5,
                    "created_utc": 1604960806.0,
                    "replies": []
                },
                {
                    "body": "It definitely feels better, that's for sure.",
                    "author": "Weneeddietbleach",
                    "id": "gbqngo1",
                    "parent_id": "t1_gbqnb7d",
                    "score": 3,
                    "created_utc": 1604944870.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Mark Hoppus vibes in pic 1",
            "author": "OatmealApocalypse",
            "id": "gbqtgp0",
            "parent_id": "t3_jr0t93",
            "score": 6,
            "created_utc": 1604947762.0,
            "replies": [
                {
                    "body": "Who?",
                    "author": "Weneeddietbleach",
                    "id": "gbr3py5",
                    "parent_id": "t1_gbqtgp0",
                    "score": 2,
                    "created_utc": 1604952690.0,
                    "replies": [
                        {
                            "body": "Of Blink 182 fame",
                            "author": "OatmealApocalypse",
                            "id": "gbr4egx",
                            "parent_id": "t1_gbr3py5",
                            "score": 1,
                            "created_utc": 1604953018.0,
                            "replies": [
                                {
                                    "body": "Oh, okay. I don't even know the names of the people in most the bands I listen to, unless their name is the band (Ozzy, Manson, etc.)",
                                    "author": "Weneeddietbleach",
                                    "id": "gbr4tc5",
                                    "parent_id": "t1_gbr4egx",
                                    "score": 2,
                                    "created_utc": 1604953217.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Hello there, sorry about your divorce mate. For your beard try to go for a stubble and as for your hair maybe go for something like this ? https://www.pinterest.com/pin/179581103870381171/",
            "author": "SebasGuz96",
            "id": "gbqgef9",
            "parent_id": "t3_jr0t93",
            "score": 16,
            "created_utc": 1604941482.0,
            "replies": []
        },
        {
            "body": "I'd say more of a softer-featured Alec Newman maybe? Reckon you could try a good range if you check out his styles from The Last Kingdom, Greyhawk, Four Corners of Suburbia leading up to more traditional clean-cut looks like in Waterloo Road or Strike Back. Not that you may even need it since Bateman's charming as all hell and Ozzy is the bomb but good on you for getting back out there man and best of luck!",
            "author": null,
            "id": "gbqgna9",
            "parent_id": "t3_jr0t93",
            "score": 5,
            "created_utc": 1604941605.0,
            "replies": [
                {
                    "body": "I've never seen those movies/shows before and never heard of Alec Newman so I guess I'll have to check them out. Thanks, dude!",
                    "author": "Weneeddietbleach",
                    "id": "gbqhw07",
                    "parent_id": "t1_gbqgna9",
                    "score": 2,
                    "created_utc": 1604942214.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Get the beard back to a short beard or stubble and see if that fits else you can go clean-shaven. In my opinion you look best in the first picture, but your hair needs better styling (less gelled up).",
            "author": "Flowhill",
            "id": "gbqk0jw",
            "parent_id": "t3_jr0t93",
            "score": 3,
            "created_utc": 1604943228.0,
            "replies": [
                {
                    "body": "I was in better health then too- the divorce hasn't quite done its damage yet and I hadn't found out how hard dating has become (I was married before dating apps took off). But yeah, I was thinking of a softer, less gelled look might be worth a try.",
                    "author": "Weneeddietbleach",
                    "id": "gbqkq0f",
                    "parent_id": "t1_gbqk0jw",
                    "score": 2,
                    "created_utc": 1604943570.0,
                    "replies": [
                        {
                            "body": "It seems like you've just recently started to come to terms with everything that's happened and it's weighing hard on you. Be proud of yourself for doing this man. You're taking steps to get over the whole situation and are taking control of your life. The coming weeks will probably be hard as you have to take a good hard look in the mirror and be honest to yourself as to what you need to work on in your life.  \nI believe in you man!",
                            "author": "Flowhill",
                            "id": "gbtdz0a",
                            "parent_id": "t1_gbqkq0f",
                            "score": 2,
                            "created_utc": 1605004658.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "The bunny rabbit looks great.  Lol all kidding aside the first pic is the best and try to go for a shorter look.  Just a bit longer than buzzcut.  So a crew cut is what I would suggest since your hairline is like mine.  Also just a stubble kept trimmed to about 3mm looks best as long as it’s kept trimmed.  Also, a good workout routine does wonders.  For stress and the way you look.  We don’t notice but it helps a lot.",
            "author": "nordicpolarbear",
            "id": "gbqqa3b",
            "parent_id": "t3_jr0t93",
            "score": 3,
            "created_utc": 1604946235.0,
            "replies": []
        },
        {
            "body": "We definitely can! Check out \"The Side Part.\" It's a great style that's pretty close to your current one, just a bit more cleaned up and refined. Also take a look at something that has a light hold, like a clay or putty. This will give you the hold you need without making your hair look wet, giving it a fuller and more touchable appearance! [Check out the look here!](https://peteandpedro.com/blogs/the-pedro-post/2020-mens-look-book-hairstyling-guide) Also, a little 5 o'clock shadow never hurts to round out the look!",
            "author": "pete-pedro",
            "id": "gbszyxa",
            "parent_id": "t3_jr0t93",
            "score": 3,
            "created_utc": 1604990135.0,
            "replies": []
        },
        {
            "body": "In the shorter pic you look like Brandon Sanderson",
            "author": "charliepatrick",
            "id": "gbqs5az",
            "parent_id": "t3_jr0t93",
            "score": 2,
            "created_utc": 1604947133.0,
            "replies": [
                {
                    "body": "No idea who that is. I guess I'm going to be googling a lot of people soon.",
                    "author": "Weneeddietbleach",
                    "id": "gbr3yvx",
                    "parent_id": "t1_gbqs5az",
                    "score": 1,
                    "created_utc": 1604952808.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I agree, first pic the best.\n\nSingle fatherhood is tough, but the best thing we can do as dads is lead by example. If that means eating right and waking up extra early to hop on a bike before the kids wake up then so be it.",
            "author": "abacabbmk",
            "id": "gbqtwt5",
            "parent_id": "t3_jr0t93",
            "score": 2,
            "created_utc": 1604947976.0,
            "replies": [
                {
                    "body": "BUT I DON'T WANNA!",
                    "author": "Weneeddietbleach",
                    "id": "gbr3p8y",
                    "parent_id": "t1_gbqtwt5",
                    "score": 1,
                    "created_utc": 1604952681.0,
                    "replies": [
                        {
                            "body": "I know friend, me neither.",
                            "author": "abacabbmk",
                            "id": "gbr3zgs",
                            "parent_id": "t1_gbr3p8y",
                            "score": 1,
                            "created_utc": 1604952816.0,
                            "replies": [
                                {
                                    "body": "Can't I just eat a carrot or something?",
                                    "author": "Weneeddietbleach",
                                    "id": "gbr435c",
                                    "parent_id": "t1_gbr3zgs",
                                    "score": 1,
                                    "created_utc": 1604952865.0,
                                    "replies": [
                                        {
                                            "body": "eating carrots may help lol",
                                            "author": "abacabbmk",
                                            "id": "gbr6njj",
                                            "parent_id": "t1_gbr435c",
                                            "score": 2,
                                            "created_utc": 1604954098.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Clean shaven is great!",
            "author": "boilingpoint3",
            "id": "gbra94y",
            "parent_id": "t3_jr0t93",
            "score": 2,
            "created_utc": 1604955830.0,
            "replies": []
        },
        {
            "body": "like a bat out of heck",
            "author": "TonyAndrewWard",
            "id": "gbradrq",
            "parent_id": "t3_jr0t93",
            "score": 2,
            "created_utc": 1604955894.0,
            "replies": [
                {
                    "body": "Are you saying I look like Meat Loaf?",
                    "author": "Weneeddietbleach",
                    "id": "gbrai66",
                    "parent_id": "t1_gbradrq",
                    "score": 2,
                    "created_utc": 1604955954.0,
                    "replies": [
                        {
                            "body": "yes and i mean it in a good way, meat loaf is a fricking legend and never forget he played Bob in Fight Club",
                            "author": "TonyAndrewWard",
                            "id": "gbrburq",
                            "parent_id": "t1_gbrai66",
                            "score": 1,
                            "created_utc": 1604956613.0,
                            "replies": [
                                {
                                    "body": "I haven't seen any recent photos or videos of him.",
                                    "author": "Weneeddietbleach",
                                    "id": "gbrc5g4",
                                    "parent_id": "t1_gbrburq",
                                    "score": 2,
                                    "created_utc": 1604956757.0,
                                    "replies": [
                                        {
                                            "body": "https://www.youtube.com/watch?v=pMRl55U0eDw",
                                            "author": "TonyAndrewWard",
                                            "id": "gbt92ak",
                                            "parent_id": "t1_gbrc5g4",
                                            "score": 2,
                                            "created_utc": 1604999085.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[Just a suggestion](https://www.menshairstylestoday.com/wp-content/uploads/2016/05/Celebrity-Hairstyles-Bradley-Cooper.jpg)\n\n[also most male celebs end up going shorter as they recede](https://www.google.com/search?q=male+actors+with+receding+hairlines&tbm=isch&ved=2ahUKEwiSkcv3sfbsAhUNZRoKHYQMBzQQ2-cCegQIABAA&oq=male+actors++with+reced&gs_lcp=CgNpbWcQARgAMgIIADoECAAQQzoGCAAQBRAeUL2YCljBpgpgiqwKaABwAHgAgAGBAYgBmQaSAQM5LjGYAQCgAQGqAQtnd3Mtd2l6LWltZ8ABAQ&sclient=img&ei=b7KpX9KdEo3KaYSZnKAD&bih=795&biw=1359&client=firefox-b-d)",
            "author": "Lasmore",
            "id": "gbrcwoh",
            "parent_id": "t3_jr0t93",
            "score": 2,
            "created_utc": 1604957132.0,
            "replies": [
                {
                    "body": "Not bad. But there's that issue about my face.",
                    "author": "Weneeddietbleach",
                    "id": "gbrexdt",
                    "parent_id": "t1_gbrcwoh",
                    "score": 1,
                    "created_utc": 1604958135.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "i like the hair and beard, you look like a sick dwarf!!",
            "author": "ungobingbing",
            "id": "gbreih1",
            "parent_id": "t3_jr0t93",
            "score": 2,
            "created_utc": 1604957927.0,
            "replies": [
                {
                    "body": "I swear I'm not sick, I'm just naturally pale. B&W filters have no effect on me!",
                    "author": "Weneeddietbleach",
                    "id": "gbrerfx",
                    "parent_id": "t1_gbreih1",
                    "score": 1,
                    "created_utc": 1604958053.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "short spikey, with a fade on the sides a bit like modern day matt lablanc  \n&nbsp;  \nand just keep the beard as 1-2mm stubble levels",
            "author": "deanochips",
            "id": "gbrn2qm",
            "parent_id": "t3_jr0t93",
            "score": 2,
            "created_utc": 1604962229.0,
            "replies": []
        },
        {
            "body": "Short hair in first pic looks great. Love the rabbit too",
            "author": "bamboozles4dafoozles",
            "id": "gbs04yj",
            "parent_id": "t3_jr0t93",
            "score": 2,
            "created_utc": 1604968218.0,
            "replies": [
                {
                    "body": "Thanks. He was a bit of an antisocial turd, tbh. Sadly, Chopin died about 2 months ago. It's been a rough couple of years.",
                    "author": "Weneeddietbleach",
                    "id": "gbs0iyb",
                    "parent_id": "t1_gbs04yj",
                    "score": 1,
                    "created_utc": 1604968402.0,
                    "replies": [
                        {
                            "body": "Sorry to hear man. Hope you're doing better.",
                            "author": "bamboozles4dafoozles",
                            "id": "gbs11np",
                            "parent_id": "t1_gbs0iyb",
                            "score": 2,
                            "created_utc": 1604968650.0,
                            "replies": [
                                {
                                    "body": "I wish I could say I was. Thank you though.",
                                    "author": "Weneeddietbleach",
                                    "id": "gbs1kq7",
                                    "parent_id": "t1_gbs11np",
                                    "score": 1,
                                    "created_utc": 1604968902.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "My advice is shave or trim the ‘stache and beard if you have long hair. Short hair looks fine too.",
            "author": "winter_coffee",
            "id": "gbs7836",
            "parent_id": "t3_jr0t93",
            "score": 2,
            "created_utc": 1604971873.0,
            "replies": []
        },
        {
            "body": "Longer on top short on the sides bruh",
            "author": "pony1108",
            "id": "gbstfb0",
            "parent_id": "t3_jr0t93",
            "score": 2,
            "created_utc": 1604984852.0,
            "replies": []
        },
        {
            "body": "Personally, I really like the half up style in your last pic. You have nice thick, straight hair that looks great long. I would suggest though to trim the beard short. I have long hair as well and keep my facial hair at 3/8\" and I quite like it.",
            "author": "DrSeeker101",
            "id": "gbt2qak",
            "parent_id": "t3_jr0t93",
            "score": 2,
            "created_utc": 1604992639.0,
            "replies": []
        },
        {
            "body": "the dimples will go along way sadly i have no idea how to stlye older peoples hair. so ima assumeing your hair is long right now it does look good that way. the beard kinda has to go perhaps try a five oclock shadow",
            "author": "VivaLeGanja",
            "id": "gbtn9vo",
            "parent_id": "t3_jr0t93",
            "score": 2,
            "created_utc": 1605013302.0,
            "replies": []
        },
        {
            "body": "you look fine in all of them",
            "author": "Ferks_",
            "id": "gbqlh8v",
            "parent_id": "t3_jr0t93",
            "score": 1,
            "created_utc": 1604943927.0,
            "replies": [
                {
                    "body": "Well I don't know about that, haha. But thank you.",
                    "author": "Weneeddietbleach",
                    "id": "gbqllsc",
                    "parent_id": "t1_gbqlh8v",
                    "score": 2,
                    "created_utc": 1604943988.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Hey there! I’m a female barber and I’d like to offer my advice.\n\nI agree with pretty much everyone here. The long hair isn’t really working for you and neither is the long beard. It makes you look somewhat unkempt and if you’re trying to get back into the dating game that is not ideal.\n\nI would go to the barber shop and ask for a number 2 or 3 tapered on the sides and short and messy on top. For the beard, stubble at the most or clean shaven. \n\nGood luck out there ☺️",
            "author": "cutecemetery",
            "id": "gbr2h2w",
            "parent_id": "t3_jr0t93",
            "score": 1,
            "created_utc": 1604952093.0,
            "replies": [
                {
                    "body": "So what are the numbers in reference to anyways? Inches? I have no clue.\n\nMy step sister cuts hair too. I was asking for her advice a while back but this is just as Covid was exploding here. I was hoping she would offer an appointment as it sounded like business was dropping off but I wasn't going to push it. But I totally forgotten what she said since then anyways.",
                    "author": "Weneeddietbleach",
                    "id": "gbr3nca",
                    "parent_id": "t1_gbr2h2w",
                    "score": 2,
                    "created_utc": 1604952656.0,
                    "replies": [
                        {
                            "body": "The numbers are clipper blades. 2 is pretty short and 3 is a bit longer. Anything longer than a 3 gets scruffy very quickly in my opinion.\n\nAs someone who works in the industry, just ask for an appointment. She might not even know /realize you want one.",
                            "author": "cutecemetery",
                            "id": "gbr62km",
                            "parent_id": "t1_gbr3nca",
                            "score": 2,
                            "created_utc": 1604953816.0,
                            "replies": [
                                {
                                    "body": "Good to know. Thanks!",
                                    "author": "Weneeddietbleach",
                                    "id": "gbr6gok",
                                    "parent_id": "t1_gbr62km",
                                    "score": 2,
                                    "created_utc": 1604954006.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "How are you adding the captions? I’m unable to do this when I try to post.",
            "author": "chonchcreature",
            "id": "gbrbawi",
            "parent_id": "t3_jr0t93",
            "score": 1,
            "created_utc": 1604956343.0,
            "replies": [
                {
                    "body": "I had to download the official app first (I prefer Rif) just to be able to add multiple images. After adding a second image, it has an option underneath to add captions that will pop up.",
                    "author": "Weneeddietbleach",
                    "id": "gbrc0jx",
                    "parent_id": "t1_gbrbawi",
                    "score": 1,
                    "created_utc": 1604956692.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gbrco91",
            "parent_id": "t3_jr0t93",
            "score": 1,
            "created_utc": 1604957016.0,
            "replies": [
                {
                    "body": "I'm almost fitish, but a haircut does seem like a lot less effort.",
                    "author": "Weneeddietbleach",
                    "id": "gbrf5uz",
                    "parent_id": "t1_gbrco91",
                    "score": 1,
                    "created_utc": 1604958253.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "i would use the length of hair you have, but maybe just try different ways of styling it. try parting it in different areas, middle, left, right. if i were to cut any hair, it would be towards the back and sides, so you wouldnt have much hanging out like when you see the ponytail. If you cant find a style you like that way, id suggest cutting shorter and shorter until you find one that suits you. I think it’d be a shame to just let go and cut it all off in one go because there are many ways you could go about it.",
            "author": "shuwumi",
            "id": "gbrzgki",
            "parent_id": "t3_jr0t93",
            "score": 1,
            "created_utc": 1604967899.0,
            "replies": [
                {
                    "body": "Yeah. When it's long, I don't really do much other than comb it; it more or less just parts down the middle. Longest I had it was almost to my hips, but I usually just do that to donate it. I really get the Ozzy comments then.",
                    "author": "Weneeddietbleach",
                    "id": "gbrzw20",
                    "parent_id": "t1_gbrzgki",
                    "score": 1,
                    "created_utc": 1604968101.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Bro in some of those pics you look like Jason Bateman, look at some of his hairstyles and see which you like best",
            "author": "Dexinthecity",
            "id": "gbsass4",
            "parent_id": "t3_jr0t93",
            "score": 1,
            "created_utc": 1604973834.0,
            "replies": []
        },
        {
            "body": "Well in all fairness, the first pic is about 2-3 years ago and before the stresses of the divorce and being a single father, the desire to date, and the feelings of hopelessness really did their damage.\n\nBut I agree with the neckbeardy look. I would only go 2-3 days max without shaving and just felt like seeing how it turns out. I'm sure my fivehead doesn't help with the rest though.",
            "author": "Weneeddietbleach",
            "id": "gbqj6pw",
            "parent_id": "t1_gbqid3z",
            "score": 64,
            "created_utc": 1604942837.0,
            "replies": [
                {
                    "body": "Ha, nah man, I think you're still looking good, but yeah if you wanna go for the beard, keep the neck trimmed down either way and just do minoxidil on the face too, and you could go for the ol' viking look. it's pretty miraculous stuff:\n\nhttps://www.reddit.com/r/Minoxbeards/top/?sort=top&t=all",
                    "author": "scottyLogJobs",
                    "id": "gbqjttv",
                    "parent_id": "t1_gbqj6pw",
                    "score": 13,
                    "created_utc": 1604943140.0,
                    "replies": [
                        {
                            "body": "That's actually not bad at all. I feel kind of weird with this \"in between\" state and have been itching to shave. Maybe I'll look for that instead. Granted, as white as it is, I still wonder if it would look as good for me as it does those guys.",
                            "author": "Weneeddietbleach",
                            "id": "gbqkd7v",
                            "parent_id": "t1_gbqjttv",
                            "score": 7,
                            "created_utc": 1604943397.0,
                            "replies": [
                                {
                                    "body": "Only one way to find out pal! I've been doing minox on and off for the past few months too. Can't say I don't notice the gains.",
                                    "author": "DDESTRUCTOTRON",
                                    "id": "gbqy3kf",
                                    "parent_id": "t1_gbqkd7v",
                                    "score": 2,
                                    "created_utc": 1604949980.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Agree with everything but the American Crew Fiber part: to fine/receding hair it works awful, makes the locks greasy instantly.\n\nSpeaking from experience, Pacinos Matte Paste or something of this sort (paste or cream-like texture with no shine) would be the best, it’s more like a clay product but easier to apply.",
            "author": "ladyzhenskyievg",
            "id": "gbrwdwu",
            "parent_id": "t1_gbqid3z",
            "score": 4,
            "created_utc": 1604966458.0,
            "replies": [
                {
                    "body": "Thanks, I'll look into it as well. I usually use layrite superhold or American Crew forming cream",
                    "author": "scottyLogJobs",
                    "id": "gbsf70y",
                    "parent_id": "t1_gbrwdwu",
                    "score": 1,
                    "created_utc": 1604976218.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I saw Bateman before reading the title.  That’s the look, brother!  You rock it.",
            "author": "shibbyoh",
            "id": "gbs8jah",
            "parent_id": "t1_gbqid3z",
            "score": 1,
            "created_utc": 1604972595.0,
            "replies": []
        },
        {
            "body": "Yeah, the long hair gets mixed reviews. Anyone that cuts it goes on about how thick it is. The ex-wife liked it, most girls that comment didn't (though most were family so I didn't care).",
            "author": "Weneeddietbleach",
            "id": "gbqlvlm",
            "parent_id": "t1_gbqlf4p",
            "score": 6,
            "created_utc": 1604944116.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "gbqmsae",
                    "parent_id": "t1_gbqlvlm",
                    "score": 10,
                    "created_utc": 1604944544.0,
                    "replies": [
                        {
                            "body": "agree with the goatee, looks like a full beard might just not be in the cards without it looking patchy for months before the cheeks grow in. Shorter hair will be a much better look too.\n\nAnd super thick hair often means when the MPB does hit, it will hit hard. My dad and I both had amazing hair up until mid 20s. Now I just rock a hat most of the time and buzz my hair. Working my way up to the shaved head, partially because I'm somewhat in denial and because it seems like a lot of maintenance/expense to shave my whole head every morning and have to buy razors more frequently.",
                            "author": "Tossup1010",
                            "id": "gbrr0nu",
                            "parent_id": "t1_gbqmsae",
                            "score": 3,
                            "created_utc": 1604964009.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Just going to slide in here to second the \"cut the short hair shorter\". The long hair is not a good look. It's not just your family thinking that, I promise you.",
                    "author": "techknowfile",
                    "id": "gbqs1fu",
                    "parent_id": "t1_gbqlvlm",
                    "score": 4,
                    "created_utc": 1604947081.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I wanna second this nice reply; you have a kind face and clean shaven suits you. \n\nPersonally, I always feel like I'm looking my best when I emphasize my strengths. Rather than trying to make up for my mediocreness. Thus, in your case, i would emphasize the thick hair by keeping some but not the long style that keeps your nice looking face hidden.",
            "author": "ginghamshirt",
            "id": "gbrk5yu",
            "parent_id": "t1_gbqnb7d",
            "score": 5,
            "created_utc": 1604960806.0,
            "replies": []
        },
        {
            "body": "It definitely feels better, that's for sure.",
            "author": "Weneeddietbleach",
            "id": "gbqngo1",
            "parent_id": "t1_gbqnb7d",
            "score": 3,
            "created_utc": 1604944870.0,
            "replies": []
        },
        {
            "body": "Who?",
            "author": "Weneeddietbleach",
            "id": "gbr3py5",
            "parent_id": "t1_gbqtgp0",
            "score": 2,
            "created_utc": 1604952690.0,
            "replies": [
                {
                    "body": "Of Blink 182 fame",
                    "author": "OatmealApocalypse",
                    "id": "gbr4egx",
                    "parent_id": "t1_gbr3py5",
                    "score": 1,
                    "created_utc": 1604953018.0,
                    "replies": [
                        {
                            "body": "Oh, okay. I don't even know the names of the people in most the bands I listen to, unless their name is the band (Ozzy, Manson, etc.)",
                            "author": "Weneeddietbleach",
                            "id": "gbr4tc5",
                            "parent_id": "t1_gbr4egx",
                            "score": 2,
                            "created_utc": 1604953217.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I've never seen those movies/shows before and never heard of Alec Newman so I guess I'll have to check them out. Thanks, dude!",
            "author": "Weneeddietbleach",
            "id": "gbqhw07",
            "parent_id": "t1_gbqgna9",
            "score": 2,
            "created_utc": 1604942214.0,
            "replies": []
        },
        {
            "body": "I was in better health then too- the divorce hasn't quite done its damage yet and I hadn't found out how hard dating has become (I was married before dating apps took off). But yeah, I was thinking of a softer, less gelled look might be worth a try.",
            "author": "Weneeddietbleach",
            "id": "gbqkq0f",
            "parent_id": "t1_gbqk0jw",
            "score": 2,
            "created_utc": 1604943570.0,
            "replies": [
                {
                    "body": "It seems like you've just recently started to come to terms with everything that's happened and it's weighing hard on you. Be proud of yourself for doing this man. You're taking steps to get over the whole situation and are taking control of your life. The coming weeks will probably be hard as you have to take a good hard look in the mirror and be honest to yourself as to what you need to work on in your life.  \nI believe in you man!",
                    "author": "Flowhill",
                    "id": "gbtdz0a",
                    "parent_id": "t1_gbqkq0f",
                    "score": 2,
                    "created_utc": 1605004658.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "No idea who that is. I guess I'm going to be googling a lot of people soon.",
            "author": "Weneeddietbleach",
            "id": "gbr3yvx",
            "parent_id": "t1_gbqs5az",
            "score": 1,
            "created_utc": 1604952808.0,
            "replies": []
        },
        {
            "body": "BUT I DON'T WANNA!",
            "author": "Weneeddietbleach",
            "id": "gbr3p8y",
            "parent_id": "t1_gbqtwt5",
            "score": 1,
            "created_utc": 1604952681.0,
            "replies": [
                {
                    "body": "I know friend, me neither.",
                    "author": "abacabbmk",
                    "id": "gbr3zgs",
                    "parent_id": "t1_gbr3p8y",
                    "score": 1,
                    "created_utc": 1604952816.0,
                    "replies": [
                        {
                            "body": "Can't I just eat a carrot or something?",
                            "author": "Weneeddietbleach",
                            "id": "gbr435c",
                            "parent_id": "t1_gbr3zgs",
                            "score": 1,
                            "created_utc": 1604952865.0,
                            "replies": [
                                {
                                    "body": "eating carrots may help lol",
                                    "author": "abacabbmk",
                                    "id": "gbr6njj",
                                    "parent_id": "t1_gbr435c",
                                    "score": 2,
                                    "created_utc": 1604954098.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Are you saying I look like Meat Loaf?",
            "author": "Weneeddietbleach",
            "id": "gbrai66",
            "parent_id": "t1_gbradrq",
            "score": 2,
            "created_utc": 1604955954.0,
            "replies": [
                {
                    "body": "yes and i mean it in a good way, meat loaf is a fricking legend and never forget he played Bob in Fight Club",
                    "author": "TonyAndrewWard",
                    "id": "gbrburq",
                    "parent_id": "t1_gbrai66",
                    "score": 1,
                    "created_utc": 1604956613.0,
                    "replies": [
                        {
                            "body": "I haven't seen any recent photos or videos of him.",
                            "author": "Weneeddietbleach",
                            "id": "gbrc5g4",
                            "parent_id": "t1_gbrburq",
                            "score": 2,
                            "created_utc": 1604956757.0,
                            "replies": [
                                {
                                    "body": "https://www.youtube.com/watch?v=pMRl55U0eDw",
                                    "author": "TonyAndrewWard",
                                    "id": "gbt92ak",
                                    "parent_id": "t1_gbrc5g4",
                                    "score": 2,
                                    "created_utc": 1604999085.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Not bad. But there's that issue about my face.",
            "author": "Weneeddietbleach",
            "id": "gbrexdt",
            "parent_id": "t1_gbrcwoh",
            "score": 1,
            "created_utc": 1604958135.0,
            "replies": []
        },
        {
            "body": "I swear I'm not sick, I'm just naturally pale. B&W filters have no effect on me!",
            "author": "Weneeddietbleach",
            "id": "gbrerfx",
            "parent_id": "t1_gbreih1",
            "score": 1,
            "created_utc": 1604958053.0,
            "replies": []
        },
        {
            "body": "Thanks. He was a bit of an antisocial turd, tbh. Sadly, Chopin died about 2 months ago. It's been a rough couple of years.",
            "author": "Weneeddietbleach",
            "id": "gbs0iyb",
            "parent_id": "t1_gbs04yj",
            "score": 1,
            "created_utc": 1604968402.0,
            "replies": [
                {
                    "body": "Sorry to hear man. Hope you're doing better.",
                    "author": "bamboozles4dafoozles",
                    "id": "gbs11np",
                    "parent_id": "t1_gbs0iyb",
                    "score": 2,
                    "created_utc": 1604968650.0,
                    "replies": [
                        {
                            "body": "I wish I could say I was. Thank you though.",
                            "author": "Weneeddietbleach",
                            "id": "gbs1kq7",
                            "parent_id": "t1_gbs11np",
                            "score": 1,
                            "created_utc": 1604968902.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Well I don't know about that, haha. But thank you.",
            "author": "Weneeddietbleach",
            "id": "gbqllsc",
            "parent_id": "t1_gbqlh8v",
            "score": 2,
            "created_utc": 1604943988.0,
            "replies": []
        },
        {
            "body": "So what are the numbers in reference to anyways? Inches? I have no clue.\n\nMy step sister cuts hair too. I was asking for her advice a while back but this is just as Covid was exploding here. I was hoping she would offer an appointment as it sounded like business was dropping off but I wasn't going to push it. But I totally forgotten what she said since then anyways.",
            "author": "Weneeddietbleach",
            "id": "gbr3nca",
            "parent_id": "t1_gbr2h2w",
            "score": 2,
            "created_utc": 1604952656.0,
            "replies": [
                {
                    "body": "The numbers are clipper blades. 2 is pretty short and 3 is a bit longer. Anything longer than a 3 gets scruffy very quickly in my opinion.\n\nAs someone who works in the industry, just ask for an appointment. She might not even know /realize you want one.",
                    "author": "cutecemetery",
                    "id": "gbr62km",
                    "parent_id": "t1_gbr3nca",
                    "score": 2,
                    "created_utc": 1604953816.0,
                    "replies": [
                        {
                            "body": "Good to know. Thanks!",
                            "author": "Weneeddietbleach",
                            "id": "gbr6gok",
                            "parent_id": "t1_gbr62km",
                            "score": 2,
                            "created_utc": 1604954006.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I had to download the official app first (I prefer Rif) just to be able to add multiple images. After adding a second image, it has an option underneath to add captions that will pop up.",
            "author": "Weneeddietbleach",
            "id": "gbrc0jx",
            "parent_id": "t1_gbrbawi",
            "score": 1,
            "created_utc": 1604956692.0,
            "replies": []
        },
        {
            "body": "I'm almost fitish, but a haircut does seem like a lot less effort.",
            "author": "Weneeddietbleach",
            "id": "gbrf5uz",
            "parent_id": "t1_gbrco91",
            "score": 1,
            "created_utc": 1604958253.0,
            "replies": []
        },
        {
            "body": "Yeah. When it's long, I don't really do much other than comb it; it more or less just parts down the middle. Longest I had it was almost to my hips, but I usually just do that to donate it. I really get the Ozzy comments then.",
            "author": "Weneeddietbleach",
            "id": "gbrzw20",
            "parent_id": "t1_gbrzgki",
            "score": 1,
            "created_utc": 1604968101.0,
            "replies": []
        },
        {
            "body": "Ha, nah man, I think you're still looking good, but yeah if you wanna go for the beard, keep the neck trimmed down either way and just do minoxidil on the face too, and you could go for the ol' viking look. it's pretty miraculous stuff:\n\nhttps://www.reddit.com/r/Minoxbeards/top/?sort=top&t=all",
            "author": "scottyLogJobs",
            "id": "gbqjttv",
            "parent_id": "t1_gbqj6pw",
            "score": 13,
            "created_utc": 1604943140.0,
            "replies": [
                {
                    "body": "That's actually not bad at all. I feel kind of weird with this \"in between\" state and have been itching to shave. Maybe I'll look for that instead. Granted, as white as it is, I still wonder if it would look as good for me as it does those guys.",
                    "author": "Weneeddietbleach",
                    "id": "gbqkd7v",
                    "parent_id": "t1_gbqjttv",
                    "score": 7,
                    "created_utc": 1604943397.0,
                    "replies": [
                        {
                            "body": "Only one way to find out pal! I've been doing minox on and off for the past few months too. Can't say I don't notice the gains.",
                            "author": "DDESTRUCTOTRON",
                            "id": "gbqy3kf",
                            "parent_id": "t1_gbqkd7v",
                            "score": 2,
                            "created_utc": 1604949980.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Thanks, I'll look into it as well. I usually use layrite superhold or American Crew forming cream",
            "author": "scottyLogJobs",
            "id": "gbsf70y",
            "parent_id": "t1_gbrwdwu",
            "score": 1,
            "created_utc": 1604976218.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gbqmsae",
            "parent_id": "t1_gbqlvlm",
            "score": 10,
            "created_utc": 1604944544.0,
            "replies": [
                {
                    "body": "agree with the goatee, looks like a full beard might just not be in the cards without it looking patchy for months before the cheeks grow in. Shorter hair will be a much better look too.\n\nAnd super thick hair often means when the MPB does hit, it will hit hard. My dad and I both had amazing hair up until mid 20s. Now I just rock a hat most of the time and buzz my hair. Working my way up to the shaved head, partially because I'm somewhat in denial and because it seems like a lot of maintenance/expense to shave my whole head every morning and have to buy razors more frequently.",
                    "author": "Tossup1010",
                    "id": "gbrr0nu",
                    "parent_id": "t1_gbqmsae",
                    "score": 3,
                    "created_utc": 1604964009.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Just going to slide in here to second the \"cut the short hair shorter\". The long hair is not a good look. It's not just your family thinking that, I promise you.",
            "author": "techknowfile",
            "id": "gbqs1fu",
            "parent_id": "t1_gbqlvlm",
            "score": 4,
            "created_utc": 1604947081.0,
            "replies": []
        },
        {
            "body": "Of Blink 182 fame",
            "author": "OatmealApocalypse",
            "id": "gbr4egx",
            "parent_id": "t1_gbr3py5",
            "score": 1,
            "created_utc": 1604953018.0,
            "replies": [
                {
                    "body": "Oh, okay. I don't even know the names of the people in most the bands I listen to, unless their name is the band (Ozzy, Manson, etc.)",
                    "author": "Weneeddietbleach",
                    "id": "gbr4tc5",
                    "parent_id": "t1_gbr4egx",
                    "score": 2,
                    "created_utc": 1604953217.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "It seems like you've just recently started to come to terms with everything that's happened and it's weighing hard on you. Be proud of yourself for doing this man. You're taking steps to get over the whole situation and are taking control of your life. The coming weeks will probably be hard as you have to take a good hard look in the mirror and be honest to yourself as to what you need to work on in your life.  \nI believe in you man!",
            "author": "Flowhill",
            "id": "gbtdz0a",
            "parent_id": "t1_gbqkq0f",
            "score": 2,
            "created_utc": 1605004658.0,
            "replies": []
        },
        {
            "body": "I know friend, me neither.",
            "author": "abacabbmk",
            "id": "gbr3zgs",
            "parent_id": "t1_gbr3p8y",
            "score": 1,
            "created_utc": 1604952816.0,
            "replies": [
                {
                    "body": "Can't I just eat a carrot or something?",
                    "author": "Weneeddietbleach",
                    "id": "gbr435c",
                    "parent_id": "t1_gbr3zgs",
                    "score": 1,
                    "created_utc": 1604952865.0,
                    "replies": [
                        {
                            "body": "eating carrots may help lol",
                            "author": "abacabbmk",
                            "id": "gbr6njj",
                            "parent_id": "t1_gbr435c",
                            "score": 2,
                            "created_utc": 1604954098.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "yes and i mean it in a good way, meat loaf is a fricking legend and never forget he played Bob in Fight Club",
            "author": "TonyAndrewWard",
            "id": "gbrburq",
            "parent_id": "t1_gbrai66",
            "score": 1,
            "created_utc": 1604956613.0,
            "replies": [
                {
                    "body": "I haven't seen any recent photos or videos of him.",
                    "author": "Weneeddietbleach",
                    "id": "gbrc5g4",
                    "parent_id": "t1_gbrburq",
                    "score": 2,
                    "created_utc": 1604956757.0,
                    "replies": [
                        {
                            "body": "https://www.youtube.com/watch?v=pMRl55U0eDw",
                            "author": "TonyAndrewWard",
                            "id": "gbt92ak",
                            "parent_id": "t1_gbrc5g4",
                            "score": 2,
                            "created_utc": 1604999085.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Sorry to hear man. Hope you're doing better.",
            "author": "bamboozles4dafoozles",
            "id": "gbs11np",
            "parent_id": "t1_gbs0iyb",
            "score": 2,
            "created_utc": 1604968650.0,
            "replies": [
                {
                    "body": "I wish I could say I was. Thank you though.",
                    "author": "Weneeddietbleach",
                    "id": "gbs1kq7",
                    "parent_id": "t1_gbs11np",
                    "score": 1,
                    "created_utc": 1604968902.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "The numbers are clipper blades. 2 is pretty short and 3 is a bit longer. Anything longer than a 3 gets scruffy very quickly in my opinion.\n\nAs someone who works in the industry, just ask for an appointment. She might not even know /realize you want one.",
            "author": "cutecemetery",
            "id": "gbr62km",
            "parent_id": "t1_gbr3nca",
            "score": 2,
            "created_utc": 1604953816.0,
            "replies": [
                {
                    "body": "Good to know. Thanks!",
                    "author": "Weneeddietbleach",
                    "id": "gbr6gok",
                    "parent_id": "t1_gbr62km",
                    "score": 2,
                    "created_utc": 1604954006.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "That's actually not bad at all. I feel kind of weird with this \"in between\" state and have been itching to shave. Maybe I'll look for that instead. Granted, as white as it is, I still wonder if it would look as good for me as it does those guys.",
            "author": "Weneeddietbleach",
            "id": "gbqkd7v",
            "parent_id": "t1_gbqjttv",
            "score": 7,
            "created_utc": 1604943397.0,
            "replies": [
                {
                    "body": "Only one way to find out pal! I've been doing minox on and off for the past few months too. Can't say I don't notice the gains.",
                    "author": "DDESTRUCTOTRON",
                    "id": "gbqy3kf",
                    "parent_id": "t1_gbqkd7v",
                    "score": 2,
                    "created_utc": 1604949980.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "agree with the goatee, looks like a full beard might just not be in the cards without it looking patchy for months before the cheeks grow in. Shorter hair will be a much better look too.\n\nAnd super thick hair often means when the MPB does hit, it will hit hard. My dad and I both had amazing hair up until mid 20s. Now I just rock a hat most of the time and buzz my hair. Working my way up to the shaved head, partially because I'm somewhat in denial and because it seems like a lot of maintenance/expense to shave my whole head every morning and have to buy razors more frequently.",
            "author": "Tossup1010",
            "id": "gbrr0nu",
            "parent_id": "t1_gbqmsae",
            "score": 3,
            "created_utc": 1604964009.0,
            "replies": []
        },
        {
            "body": "Oh, okay. I don't even know the names of the people in most the bands I listen to, unless their name is the band (Ozzy, Manson, etc.)",
            "author": "Weneeddietbleach",
            "id": "gbr4tc5",
            "parent_id": "t1_gbr4egx",
            "score": 2,
            "created_utc": 1604953217.0,
            "replies": []
        },
        {
            "body": "Can't I just eat a carrot or something?",
            "author": "Weneeddietbleach",
            "id": "gbr435c",
            "parent_id": "t1_gbr3zgs",
            "score": 1,
            "created_utc": 1604952865.0,
            "replies": [
                {
                    "body": "eating carrots may help lol",
                    "author": "abacabbmk",
                    "id": "gbr6njj",
                    "parent_id": "t1_gbr435c",
                    "score": 2,
                    "created_utc": 1604954098.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I haven't seen any recent photos or videos of him.",
            "author": "Weneeddietbleach",
            "id": "gbrc5g4",
            "parent_id": "t1_gbrburq",
            "score": 2,
            "created_utc": 1604956757.0,
            "replies": [
                {
                    "body": "https://www.youtube.com/watch?v=pMRl55U0eDw",
                    "author": "TonyAndrewWard",
                    "id": "gbt92ak",
                    "parent_id": "t1_gbrc5g4",
                    "score": 2,
                    "created_utc": 1604999085.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I wish I could say I was. Thank you though.",
            "author": "Weneeddietbleach",
            "id": "gbs1kq7",
            "parent_id": "t1_gbs11np",
            "score": 1,
            "created_utc": 1604968902.0,
            "replies": []
        },
        {
            "body": "Good to know. Thanks!",
            "author": "Weneeddietbleach",
            "id": "gbr6gok",
            "parent_id": "t1_gbr62km",
            "score": 2,
            "created_utc": 1604954006.0,
            "replies": []
        },
        {
            "body": "Only one way to find out pal! I've been doing minox on and off for the past few months too. Can't say I don't notice the gains.",
            "author": "DDESTRUCTOTRON",
            "id": "gbqy3kf",
            "parent_id": "t1_gbqkd7v",
            "score": 2,
            "created_utc": 1604949980.0,
            "replies": []
        },
        {
            "body": "eating carrots may help lol",
            "author": "abacabbmk",
            "id": "gbr6njj",
            "parent_id": "t1_gbr435c",
            "score": 2,
            "created_utc": 1604954098.0,
            "replies": []
        },
        {
            "body": "https://www.youtube.com/watch?v=pMRl55U0eDw",
            "author": "TonyAndrewWard",
            "id": "gbt92ak",
            "parent_id": "t1_gbrc5g4",
            "score": 2,
            "created_utc": 1604999085.0,
            "replies": []
        }
    ]
}