{
    "title": "I have not had a SD yet, so I’m new with asking for what I want.. but wth is this?",
    "post_id": "od7ku9",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/od7ku9/i_have_not_had_a_sd_yet_so_im_new_with_asking_for/",
    "author": "NewJoMo",
    "body": "",
    "url": "https://i.redd.it/2lsoxph4o2971.jpg",
    "score": 104,
    "upvote_ratio": 0.97,
    "created_utc": 1625350543.0,
    "num_comments": 83,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "[deleted]",
            "author": null,
            "id": "h3yu6gk",
            "parent_id": "t3_od7ku9",
            "score": 144,
            "created_utc": 1625353047.0,
            "replies": [
                {
                    "body": "Lmao he ended up calling me a ‘broke loser’ a few minutes ago when I said I wasn’t interested.",
                    "author": "NewJoMo",
                    "id": "h3yufp7",
                    "parent_id": "t1_h3yu6gk",
                    "score": 71,
                    "created_utc": 1625353198.0,
                    "replies": [
                        {
                            "body": "he gives me abuser vibes",
                            "author": "AlinaDarling",
                            "id": "h40c85e",
                            "parent_id": "t1_h3yufp7",
                            "score": 45,
                            "created_utc": 1625392726.0,
                            "replies": []
                        },
                        {
                            "body": "Broke for not wanting his £££ (or$$$)? What a weirdo….",
                            "author": "Ghanaiantoffee",
                            "id": "h3yuub6",
                            "parent_id": "t1_h3yufp7",
                            "score": 32,
                            "created_utc": 1625353436.0,
                            "replies": []
                        },
                        {
                            "body": "That is some definite projection right there! The guy that wants all day of your time but probably wants to spend less than the cost of an hour w an average escort in his area too. Like sir, this isn't Burger King, you can't have it your way 🙄",
                            "author": "clair-cummings",
                            "id": "h3zx0nf",
                            "parent_id": "t1_h3yufp7",
                            "score": 26,
                            "created_utc": 1625378477.0,
                            "replies": []
                        },
                        {
                            "body": "😂 dodged a bullet !",
                            "author": "Cdnsugarr",
                            "id": "h41clgt",
                            "parent_id": "t1_h3yufp7",
                            "score": 2,
                            "created_utc": 1625416105.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "This is a man exposing himself as a douche bag.",
            "author": "thereadinessisall",
            "id": "h3ywbak",
            "parent_id": "t3_od7ku9",
            "score": 55,
            "created_utc": 1625354310.0,
            "replies": [
                {
                    "body": "Yup. And trying to subtly gaslight.",
                    "author": "clair-cummings",
                    "id": "h3zg9am",
                    "parent_id": "t1_h3ywbak",
                    "score": 26,
                    "created_utc": 1625366656.0,
                    "replies": []
                },
                {
                    "body": "He sounds every entitled.",
                    "author": "Tonight_Majestic",
                    "id": "h4623zn",
                    "parent_id": "t1_h3ywbak",
                    "score": 3,
                    "created_utc": 1625519479.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Him calling you entitled is beyond ironic. \n\nTell him to get an escort and then block him.",
            "author": "UnearthlyDinosaur",
            "id": "h3yuzje",
            "parent_id": "t3_od7ku9",
            "score": 94,
            "created_utc": 1625353519.0,
            "replies": [
                {
                    "body": "He can't afford an escort. He wants all day. I bet the amount he is willing to offer is less than an hour of what most escorts around him charge too.",
                    "author": "clair-cummings",
                    "id": "h3zg7po",
                    "parent_id": "t1_h3yuzje",
                    "score": 43,
                    "created_utc": 1625366628.0,
                    "replies": [
                        {
                            "body": "Yep. Which is why he’s scamming naive sugar baby’s. With this attitude he’s probably also black listed.",
                            "author": "MsDReid",
                            "id": "h41j8r8",
                            "parent_id": "t1_h3zg7po",
                            "score": 7,
                            "created_utc": 1625419351.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "He's a POS. Hard pass.\n\nIt goes without saying, entering a relationship with a man that wants to evidently control and degrade you is a terrible idea.",
            "author": "Samtaton",
            "id": "h3zfl3f",
            "parent_id": "t3_od7ku9",
            "score": 24,
            "created_utc": 1625366231.0,
            "replies": [
                {
                    "body": "I wish I had learned that at an earlier age. Unfortunately I didn't, and I married that type of person, and I've honestly paid for it a hundred times since. Its sad bc once you are with them they have a way of making you feel like you can't find anyone else. It makes it all that much harder to escape and flourish. From what I can tell in this brief series of texts, I would say he def comes across as potentially controlling and the type of person to stay away from. Already he has tried to make her doubt herself. That's EXACTLY what these type of men will have you doing...second guessing yourself and wondering if its YOU that is wrong.",
                    "author": "clair-cummings",
                    "id": "h3zycyz",
                    "parent_id": "t1_h3zfl3f",
                    "score": 13,
                    "created_utc": 1625379632.0,
                    "replies": [
                        {
                            "body": "Sorry you experienced that. I hope you're in a safer and more peaceful place now <3",
                            "author": "mochahoneylove",
                            "id": "h40vprq",
                            "parent_id": "t1_h3zycyz",
                            "score": 2,
                            "created_utc": 1625407601.0,
                            "replies": []
                        },
                        {
                            "body": "You should meet my wife",
                            "author": "ryder242",
                            "id": "h46gl0i",
                            "parent_id": "t1_h3zycyz",
                            "score": 1,
                            "created_utc": 1625527195.0,
                            "replies": [
                                {
                                    "body": "Why? I don't think I'm catching what you're trying to say.",
                                    "author": "clair-cummings",
                                    "id": "h46gr80",
                                    "parent_id": "t1_h46gl0i",
                                    "score": 2,
                                    "created_utc": 1625527286.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "This is what men hiring sex-workers do; they want to know \"how long\" you'll let them \"go\" for.  He's not SD material.",
            "author": null,
            "id": "h3zcu78",
            "parent_id": "t3_od7ku9",
            "score": 58,
            "created_utc": 1625364503.0,
            "replies": [
                {
                    "body": "[removed]",
                    "author": null,
                    "id": "h3zxmmj",
                    "parent_id": "t1_h3zcu78",
                    "score": 30,
                    "created_utc": 1625378995.0,
                    "replies": [
                        {
                            "body": "I wish every SB newbie would read this. It’s so important to realize that talk is free and the red flags could be dangerous not just time-wasting.",
                            "author": null,
                            "id": "h40t00l",
                            "parent_id": "t1_h3zxmmj",
                            "score": 9,
                            "created_utc": 1625406099.0,
                            "replies": []
                        },
                        {
                            "body": "Advocating what is essentially SBs setting their \"rates\" by comparing to escort rates is a clear rule 12 violation. \n\nRule #12: No Escorts/Johns\n\nNo escorts/Johns; although past personal experiences in escorting are fine, we will not allow promotion of this lifestyle or pricing discussion. We understand that some members of our community participate or have participated in both lifestyles but SLF is a Sugar-only sub. Breaking this rule may result in being banned without warning.",
                            "author": "Azurecole",
                            "id": "h42jj3z",
                            "parent_id": "t1_h3zxmmj",
                            "score": 1,
                            "created_utc": 1625437770.0,
                            "replies": [
                                {
                                    "body": "Did you read the part where I clarified that and said PPM instead? I explicitly did that. My WHOLE POINT is that many men on these SD sites posing as SD won't even meet the same amount that you would pay for an average escort in the area and that is messed up. Most SB's aren't escorts and don't want to be, but if they are going to be treated like one, its only fair that they receive the same amount or more in PPM for what is average in their area. I would argue that my point does not break any rules and I would suggest you take the time to read again and understand. This is NOT about promotion of this lifestyle, and if you can't see that then you may have some comprehension problems. This is about promoting what is right and safe for SB's. The only people that would be offended by what I said are the exact people I'm talking about: men who are not SD's but are scamming for young naive ignorant women to take advantage of.",
                                    "author": "clair-cummings",
                                    "id": "h42mnk8",
                                    "parent_id": "t1_h42jj3z",
                                    "score": 7,
                                    "created_utc": 1625439532.0,
                                    "replies": []
                                },
                                {
                                    "body": "Did you read the part where I clarified that and said PPM instead? I explicitly did that. My WHOLE POINT is that many men on these SD sites posing as SD won't even meet the same amount that you would pay for an average escort in the area and that is messed up. Most SB's aren't escorts and don't want to be, but if they are going to be treated like one, its only fair that they receive the same amount or more in PPM for what is average in their area. I would argue that my point does not break any rules and I would suggest you take the time to read again and understand. This is NOT about promotion of this lifestyle, and if you can't see that then you may have some comprehension problems. This is about promoting what is right and safe for SB's. The only people that would be offended by what I said are the exact people I'm talking about: men who are not SD's but are scamming for young naive ignorant women to take advantage of.",
                                    "author": "clair-cummings",
                                    "id": "h42moa4",
                                    "parent_id": "t1_h42jj3z",
                                    "score": 3,
                                    "created_utc": 1625439543.0,
                                    "replies": []
                                },
                                {
                                    "body": "I am advocating for what SB's should set as minimum PPM and I never mentioned an amount. You are arguing semantics here. In escorting that would be called rates and in sugaring it would be called PPM, or eventually allowance amount. I made clear clarification of that in my post. Show me where this has anything to do with the promotion of escorting?",
                                    "author": "clair-cummings",
                                    "id": "h42n3pj",
                                    "parent_id": "t1_h42jj3z",
                                    "score": 5,
                                    "created_utc": 1625439788.0,
                                    "replies": [
                                        {
                                            "body": ">I am advocating for what SB's should set as minimum PPM and I never mentioned an amount\n\nYou don't have to mention an amount.  If you're saying SBs in general should set their minimum according to escort rates, it's not allowed.  These are different activities, plumbers don't set their rates according to what masseuses charge either.   Sugar is not escorting, there is no tie-in, much to the chagrin of those whose business models would benefit.\n\nThat said, on a re-read it looks like you're talking about \"SDs\" who are really johns, treat SBs like escorts, and are doing it to take advantage ... and limited your comments to SDs who are actually johns (as per your previous reply)?  Or are you advocating that generally escort rates should apply as some global minimum for us all?",
                                            "author": "Azurecole",
                                            "id": "h42oaup",
                                            "parent_id": "t1_h42n3pj",
                                            "score": 2,
                                            "created_utc": 1625440469.0,
                                            "replies": [
                                                {
                                                    "body": "No. I'm saying if you're a SB and you're wondering if you're being shortchanged or taken advantage of, all you need to do is look up local escort rates. If he's asking for multiple hours of your time, he can't even provide what he'd have to pay for an average escort in your area for an hour, then there is a problem and yes you are being taken advantage of. No where am I advocating for the lifestyle of escorting. I am telling SB's to proactively watch out for men like this, they do exist and they are there to take advantage. SB's need to be warned about the bad side of things. Why would this not be in the best interest of all to discuss this? Unless you are literally one of these scummy predatory men, then saying this shouldn't bother you.\n\nNO WHERE am I advocating that SB's should become escorts or charge by the hour. \n\nMy whole point was in advocating for SB's to be aware of predatory men and understand they are out there and to be cautious and aware. They can use this info as they may. I see story after story of women being taken advantage of and at least understanding this side of things they are better prepared to spot men like this and know to value themselves better. Who wouldn't want that?",
                                                    "author": "clair-cummings",
                                                    "id": "h42puok",
                                                    "parent_id": "t1_h42oaup",
                                                    "score": 8,
                                                    "created_utc": 1625441364.0,
                                                    "replies": [
                                                        {
                                                            "body": ">No. I'm saying if you're a SB and you're wondering if you're being shortchanged or taken advantage of, all you need to do is look up local escort rates\n\nClaire, if a john came on here and made an equivalent argument, \"if you SDs want to see if you're getting taken advantage of, check out what johns pay.  I'm getting MSOG and around the world for less than PPM and I don't have to rent the room or pay for dinner\", we'd flag him on rule 12.   And rightfully so, what a john pays or what he gets for it means fuckall to me, it's not sugar.  Advocating for tying in to escort/john rates is not sugar and is a rule 12 violation.\n\n>I am telling SB's to proactively watch out for men like this, they doexist and they are there to take advantage. SB's need to be warned aboutthe bad side of things. Why would this not be in the best interest ofall to discuss this?\n\nI agree with all this.  SBs are at obvious, serious risk, and part of our most important goals is to protect them; but the position that only escorts and escorts rates can save them is not needed to do that -- and no, not buying into \"SBs should look at escort rates\" does not make men scummy and predatory.    There is no need to look up escort rates, adopt escort processes, or otherwise behave like an escort, in order to do this.   \"what do I get for my money\" \"how much time do I get for that\" are clear john/escort phrases, not sugar phrases.  That's what she needs to learn, He's a john, drop him if you're looking for an SD -- no need to try to tie escort rates in to keep her safe.",
                                                            "author": "Azurecole",
                                                            "id": "h42ywg8",
                                                            "parent_id": "t1_h42puok",
                                                            "score": 2,
                                                            "created_utc": 1625446859.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "This is a jackass.  Next!",
            "author": "hal99514",
            "id": "h3yu59u",
            "parent_id": "t3_od7ku9",
            "score": 12,
            "created_utc": 1625353027.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "h3ys7jm",
            "parent_id": "t3_od7ku9",
            "score": 21,
            "created_utc": 1625351906.0,
            "replies": [
                {
                    "body": "Yes. I knew there was a technical term for it.",
                    "author": "ChapterRelative",
                    "id": "h3yswou",
                    "parent_id": "t1_h3ys7jm",
                    "score": 9,
                    "created_utc": 1625352311.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "h3ytx22",
                            "parent_id": "t1_h3yswou",
                            "score": 2,
                            "created_utc": 1625352897.0,
                            "replies": [
                                {
                                    "body": "It’s weird because the men I’ve talked to have all been NICER than what I used to not worse. It caught me off guard.",
                                    "author": "NewJoMo",
                                    "id": "h3yu4w1",
                                    "parent_id": "t1_h3ytx22",
                                    "score": 5,
                                    "created_utc": 1625353021.0,
                                    "replies": [
                                        {
                                            "body": "That's the thing about men like this. Some how....some way....they have a way of making you second guess and doubt yourself. I don't know how they do it. But certain women fall for it. I married a man like this and it was awful. I still haven't recovered from the trauma I experienced there.",
                                            "author": "clair-cummings",
                                            "id": "h3zypfk",
                                            "parent_id": "t1_h3yu4w1",
                                            "score": 3,
                                            "created_utc": 1625379933.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "I shall call him JACKHAMMER.\n\nNo....let's call him JOHNHAMMER since he clearly wants an escort 😅",
                            "author": "clair-cummings",
                            "id": "h3zyjyg",
                            "parent_id": "t1_h3yswou",
                            "score": 3,
                            "created_utc": 1625379800.0,
                            "replies": [
                                {
                                    "body": "The name fits this douchenozzle turd perfectly😂",
                                    "author": "That_Millenial_Girl",
                                    "id": "h42f4af",
                                    "parent_id": "t1_h3zyjyg",
                                    "score": 1,
                                    "created_utc": 1625435375.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "This persons is insane",
            "author": "Own_Bill_906",
            "id": "h3yzm6g",
            "parent_id": "t3_od7ku9",
            "score": 10,
            "created_utc": 1625356267.0,
            "replies": []
        },
        {
            "body": "Anything after the 1st text is superfluous. Don't subject yourself to that.",
            "author": "HHSDPOT",
            "id": "h3z3l1e",
            "parent_id": "t3_od7ku9",
            "score": 9,
            "created_utc": 1625358721.0,
            "replies": []
        },
        {
            "body": "Ew. He’s talking like a John anyway, not to mention his attitude is fucking trash. To the bin he goes.",
            "author": "goingfivehole",
            "id": "h3yxhn0",
            "parent_id": "t3_od7ku9",
            "score": 16,
            "created_utc": 1625355003.0,
            "replies": []
        },
        {
            "body": "These people have to pay for others to interact with them. It should come as no surprise that they have poor social skills.",
            "author": "sadowsentry",
            "id": "h3zapmf",
            "parent_id": "t3_od7ku9",
            "score": 13,
            "created_utc": 1625363167.0,
            "replies": [
                {
                    "body": "Agree. There are some men that are such douche bags that its clear to see why they have resorted to paying for sex.\n\nNote that I do NOT put all men who \"pay\" for sex in that category. Some men \"pay\" and see hookers or get a SB bc they are married and this makes it all \"cleaner\" as far as less drama/hassle. Some men don't want to deal with the hassle and drama that accompanies a traditional relationship. Some men are virgins or inexperienced and don't want to deal with the hassles and disappointment of dating. And then there are the men that are such jerks or douchebags that turn to this bc traditional dating doesn't work for them bc they are such jerks regular women don't want to/aren't willing to deal w that!",
                    "author": "clair-cummings",
                    "id": "h3zy2z5",
                    "parent_id": "t1_h3zapmf",
                    "score": 8,
                    "created_utc": 1625379392.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Loser loser loser loser (he is).",
            "author": "bookworm010101",
            "id": "h3z1ana",
            "parent_id": "t3_od7ku9",
            "score": 6,
            "created_utc": 1625357300.0,
            "replies": []
        },
        {
            "body": "He's most likely cheap, and an entitled narcissist, that's doesn't respect women. So many red flags. Run!",
            "author": null,
            "id": "h3zdfu8",
            "parent_id": "t3_od7ku9",
            "score": 5,
            "created_utc": 1625364881.0,
            "replies": []
        },
        {
            "body": "He’s looking for an escort. Period. Whenever a man asks you how long, block.",
            "author": "tryingtobehappii",
            "id": "h403kwv",
            "parent_id": "t3_od7ku9",
            "score": 5,
            "created_utc": 1625384325.0,
            "replies": [
                {
                    "body": "The only exception to this is that the amount of time required can vary greatly… I’ve had arrangements where he really only had a couple of hours each week to spend with me… And then I’ve had other arrangements where we did spend the whole day together. And I really didn’t think it was fair for the two-hour guy to have to pay the same amount as the all day guy.  Plus it involved a lot more of my time, and I didn’t think it was fair to me either.  So that seems reasonable to me. If there’s a considerable amount of time involved, I would expect the gift/allowance to be higher.\n\nBut this particular guy is just awful.",
                    "author": "RealEarthAngel",
                    "id": "h42xggb",
                    "parent_id": "t1_h403kwv",
                    "score": 1,
                    "created_utc": 1625445953.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Le Wild BitchBoy appeared.",
            "author": null,
            "id": "h3zav9b",
            "parent_id": "t3_od7ku9",
            "score": 3,
            "created_utc": 1625363264.0,
            "replies": []
        },
        {
            "body": "I know that guys can change their information easily, but do sugar babies still not have a blacklist type place that they can verify if a guy has been crappy like this guu so they don't waste their time on them? (Obviously don't list it if there is a site, but I am genuinely curious in a protective way for the lady's safety.)",
            "author": "Abbyisafantasy",
            "id": "h415qhf",
            "parent_id": "t3_od7ku9",
            "score": 5,
            "created_utc": 1625412751.0,
            "replies": []
        },
        {
            "body": "All these SD are scammers these days",
            "author": "Femswitch91",
            "id": "h3z4qn5",
            "parent_id": "t3_od7ku9",
            "score": 6,
            "created_utc": 1625359434.0,
            "replies": [
                {
                    "body": "I really wish the ladies would see the truth. There really aren’t a ton of SDs. On SA, it’s mostly salty Johns",
                    "author": "JSBelle",
                    "id": "h3zizwq",
                    "parent_id": "t1_h3z4qn5",
                    "score": 5,
                    "created_utc": 1625368363.0,
                    "replies": [
                        {
                            "body": "But even worse, these are men looking for CHEAP prostitutes. And yes, there are some trashy women on seeking but too, there are lots of college educated good women who are NOT escorts but IF they were they wouldn't be charging street walker prices.\n\nBut wait! There's more! Not only do they hope you'll accept their low ball scummy PPM offer BUT! they hope to convince you not to wear protection and have bare sex. They couldn't find the type of escort they want bc the types they want aren't streetwalkers, charge more per hour, will make him wear a condom, and also make him screen. These are truly the scummiest of men. Run far away when you notice these behaviors.",
                            "author": "clair-cummings",
                            "id": "h3zz72i",
                            "parent_id": "t1_h3zizwq",
                            "score": 7,
                            "created_utc": 1625380366.0,
                            "replies": []
                        },
                        {
                            "body": "This. THIS is the truth. Real SD's are truly a diamond in the rough. If you find one you are blessed.",
                            "author": "clair-cummings",
                            "id": "h3zyub8",
                            "parent_id": "t1_h3zizwq",
                            "score": 5,
                            "created_utc": 1625380051.0,
                            "replies": []
                        },
                        {
                            "body": "I did a fake SB profile for a couple weeks to see how bad it was.  Not quite as bad as I thought but fairly bad.",
                            "author": "Aaronm989",
                            "id": "h3zt2uj",
                            "parent_id": "t1_h3zizwq",
                            "score": 2,
                            "created_utc": 1625375341.0,
                            "replies": []
                        },
                        {
                            "body": "I’ll be really honest and say I do not feel that sugaring is a good use of your time when you are young and pretty",
                            "author": "JSBelle",
                            "id": "h46ab5m",
                            "parent_id": "t1_h3zizwq",
                            "score": 2,
                            "created_utc": 1625523785.0,
                            "replies": []
                        },
                        {
                            "body": "This is true",
                            "author": "Femswitch91",
                            "id": "h3zp4z2",
                            "parent_id": "t1_h3zizwq",
                            "score": 1,
                            "created_utc": 1625372460.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "As I was reading I also thought, \"what does he want to do for the whole day?\"  Then the OP asked, and he went off.",
            "author": "Aaronm989",
            "id": "h3zszvc",
            "parent_id": "t3_od7ku9",
            "score": 3,
            "created_utc": 1625375278.0,
            "replies": []
        },
        {
            "body": "He's looking for a hooker. And wtf does he expect your attitude is supposed to be, being former military?\n\nI say he's a creep. And the actual entitled prima donna.",
            "author": "jimvasco",
            "id": "h400ddo",
            "parent_id": "t3_od7ku9",
            "score": 3,
            "created_utc": 1625381396.0,
            "replies": []
        },
        {
            "body": "Your replies were adorable\n\nThe only thing you did wrong was you were way too patient with this monster !",
            "author": "lookingforlaughter",
            "id": "h40d2on",
            "parent_id": "t3_od7ku9",
            "score": 3,
            "created_utc": 1625393548.0,
            "replies": []
        },
        {
            "body": "Girl….. RUN.",
            "author": "prettylilprostitute",
            "id": "h3yvwdy",
            "parent_id": "t3_od7ku9",
            "score": 5,
            "created_utc": 1625354058.0,
            "replies": []
        },
        {
            "body": "Dude is pushy for some bikls",
            "author": "ElKDog702",
            "id": "h3z3fys",
            "parent_id": "t3_od7ku9",
            "score": 2,
            "created_utc": 1625358633.0,
            "replies": []
        },
        {
            "body": "He honestly seems like a troll",
            "author": null,
            "id": "h3zaqkv",
            "parent_id": "t3_od7ku9",
            "score": 2,
            "created_utc": 1625363184.0,
            "replies": []
        },
        {
            "body": "That’s crazy, it’s so hard to form a connection, he was a straight up a$$hole",
            "author": "Shorty-027",
            "id": "h3zi78c",
            "parent_id": "t3_od7ku9",
            "score": 2,
            "created_utc": 1625367862.0,
            "replies": []
        },
        {
            "body": "well that guy made my fuckin skin crawl.",
            "author": "Sallyandmolly",
            "id": "h3zo7wn",
            "parent_id": "t3_od7ku9",
            "score": 2,
            "created_utc": 1625371817.0,
            "replies": []
        },
        {
            "body": "babe GET. OUT. ASAP.",
            "author": "AlinaDarling",
            "id": "h40c689",
            "parent_id": "t3_od7ku9",
            "score": 2,
            "created_utc": 1625392673.0,
            "replies": []
        },
        {
            "body": "You handled yourself perfectly.  My only suggestion would have been to block him sooner.  I make this same mistake though.  You just don't want to believe this person is such a douche, so you keep trying to reason with them.  block and move on.",
            "author": "NationalInspector511",
            "id": "h41y4wi",
            "parent_id": "t3_od7ku9",
            "score": 2,
            "created_utc": 1625426694.0,
            "replies": []
        },
        {
            "body": "god i hate men SD act like babies straight up u would think they have grown and their balls dropped some point but oh no",
            "author": "yodeleyeehaw",
            "id": "h3zb33k",
            "parent_id": "t3_od7ku9",
            "score": 2,
            "created_utc": 1625363400.0,
            "replies": []
        },
        {
            "body": "Dont know who you are but thank you for your service, OP.",
            "author": "Careful_Cherry4216",
            "id": "h3zn0a8",
            "parent_id": "t3_od7ku9",
            "score": 1,
            "created_utc": 1625370990.0,
            "replies": []
        },
        {
            "body": "You can pass him to me",
            "author": "Sweetlikehoney1992",
            "id": "h41ui8t",
            "parent_id": "t3_od7ku9",
            "score": 0,
            "created_utc": 1625424875.0,
            "replies": []
        },
        {
            "body": "The person on the left sounds like a dickhead.",
            "author": "RetdSgrDaddy",
            "id": "h3zcga0",
            "parent_id": "t3_od7ku9",
            "score": 1,
            "created_utc": 1625364260.0,
            "replies": []
        },
        {
            "body": "Lmao this dude sucks",
            "author": "__lolbruh",
            "id": "h3zdqm6",
            "parent_id": "t3_od7ku9",
            "score": 1,
            "created_utc": 1625365069.0,
            "replies": []
        },
        {
            "body": "stupid",
            "author": "singinggirl_a",
            "id": "h3zlr4l",
            "parent_id": "t3_od7ku9",
            "score": 1,
            "created_utc": 1625370154.0,
            "replies": []
        },
        {
            "body": "This guy is defiantly mentally unstable",
            "author": "sweet_ging",
            "id": "h3zshri",
            "parent_id": "t3_od7ku9",
            "score": 1,
            "created_utc": 1625374897.0,
            "replies": []
        },
        {
            "body": "That guy red flags.",
            "author": "singularitybot",
            "id": "h4040me",
            "parent_id": "t3_od7ku9",
            "score": 1,
            "created_utc": 1625384730.0,
            "replies": []
        },
        {
            "body": "Block him. A sugar daddy is more or less a romantic partner that takes care of you. If you don't se a relationship developing with him, YEET HIM.",
            "author": "sonalrandeny",
            "id": "h40gccv",
            "parent_id": "t3_od7ku9",
            "score": 1,
            "created_utc": 1625396675.0,
            "replies": []
        },
        {
            "body": "Clearly not SD material.  I’d consider wasting his time before moving him but the fact that your time is worth more than his invalidates my suggestion",
            "author": "caloriefather",
            "id": "h40gck5",
            "parent_id": "t3_od7ku9",
            "score": 1,
            "created_utc": 1625396681.0,
            "replies": []
        },
        {
            "body": "RUN",
            "author": "Annieinjammies",
            "id": "h40gqo5",
            "parent_id": "t3_od7ku9",
            "score": 1,
            "created_utc": 1625397044.0,
            "replies": []
        },
        {
            "body": "Wtf, all you did was ask a simple question and he went all crazy. BLOCKED.",
            "author": "U_got_no_jams",
            "id": "h40piys",
            "parent_id": "t3_od7ku9",
            "score": 1,
            "created_utc": 1625403991.0,
            "replies": []
        },
        {
            "body": "🤮",
            "author": null,
            "id": "h40t1r6",
            "parent_id": "t3_od7ku9",
            "score": 1,
            "created_utc": 1625406128.0,
            "replies": []
        },
        {
            "body": "He is 100% purposefully pushing your boundaries to try to see how far he can go without resistance, a disgusting attitude for a man in his position to have. Block immediately",
            "author": "alice414",
            "id": "h41ja9y",
            "parent_id": "t3_od7ku9",
            "score": 1,
            "created_utc": 1625419372.0,
            "replies": []
        },
        {
            "body": "Next!",
            "author": "LB-and-Remi",
            "id": "h41zcgv",
            "parent_id": "t3_od7ku9",
            "score": 1,
            "created_utc": 1625427308.0,
            "replies": []
        },
        {
            "body": "So weird …..",
            "author": "syla_happyfeet",
            "id": "h424zog",
            "parent_id": "t3_od7ku9",
            "score": 1,
            "created_utc": 1625430179.0,
            "replies": []
        },
        {
            "body": "That doesn't answer my question.  You need to give me an accurate count of all your pubic hairs complete with the length of each to the nearest millimeter!\n\nDOUCHE!!!!!!",
            "author": "NaughtyBoy4Fun",
            "id": "h42hztx",
            "parent_id": "t3_od7ku9",
            "score": 1,
            "created_utc": 1625436929.0,
            "replies": []
        },
        {
            "body": "I'm sure spending all day getting your teeth pulled would be more fun than spending all day with HIM!\n\nDOUCHE!!!",
            "author": "NaughtyBoy4Fun",
            "id": "h42i9ea",
            "parent_id": "t3_od7ku9",
            "score": 1,
            "created_utc": 1625437076.0,
            "replies": []
        },
        {
            "body": "Too much back and forth. Yall ladies need to start trusting your guts and immediately blocking these salties and stop wasting precious time.",
            "author": "w4termelonsug4r",
            "id": "h42lbm5",
            "parent_id": "t3_od7ku9",
            "score": 1,
            "created_utc": 1625438777.0,
            "replies": []
        },
        {
            "body": "Oh PLEASE next and block him ASAP. You do not want to become involved with anyone with that kind of attitude, it’s a complete red flag… be glad he’s showing his true colors now so you can dodge the bullet sooner rather than later.",
            "author": "RealEarthAngel",
            "id": "h42wubf",
            "parent_id": "t3_od7ku9",
            "score": 1,
            "created_utc": 1625445579.0,
            "replies": []
        },
        {
            "body": "\"For x bills I want all day\"\n\nUmm what? This is not escorting SIR. Gosh\n\nIts the audacity for me.",
            "author": "WorldwideLoving",
            "id": "h42wx1b",
            "parent_id": "t3_od7ku9",
            "score": 1,
            "created_utc": 1625445624.0,
            "replies": []
        },
        {
            "body": "He sounds like an ass hat.  Not sure why you were agreeing when he was being a dick.\n\nYou can do better than that guy for a SD.",
            "author": "johnties",
            "id": "h45l311",
            "parent_id": "t3_od7ku9",
            "score": 1,
            "created_utc": 1625510802.0,
            "replies": []
        },
        {
            "body": "Yikes bye",
            "author": "DarlingComrade",
            "id": "h47mzj3",
            "parent_id": "t3_od7ku9",
            "score": 1,
            "created_utc": 1625553602.0,
            "replies": []
        },
        {
            "body": "Lmao he ended up calling me a ‘broke loser’ a few minutes ago when I said I wasn’t interested.",
            "author": "NewJoMo",
            "id": "h3yufp7",
            "parent_id": "t1_h3yu6gk",
            "score": 71,
            "created_utc": 1625353198.0,
            "replies": [
                {
                    "body": "he gives me abuser vibes",
                    "author": "AlinaDarling",
                    "id": "h40c85e",
                    "parent_id": "t1_h3yufp7",
                    "score": 45,
                    "created_utc": 1625392726.0,
                    "replies": []
                },
                {
                    "body": "Broke for not wanting his £££ (or$$$)? What a weirdo….",
                    "author": "Ghanaiantoffee",
                    "id": "h3yuub6",
                    "parent_id": "t1_h3yufp7",
                    "score": 32,
                    "created_utc": 1625353436.0,
                    "replies": []
                },
                {
                    "body": "That is some definite projection right there! The guy that wants all day of your time but probably wants to spend less than the cost of an hour w an average escort in his area too. Like sir, this isn't Burger King, you can't have it your way 🙄",
                    "author": "clair-cummings",
                    "id": "h3zx0nf",
                    "parent_id": "t1_h3yufp7",
                    "score": 26,
                    "created_utc": 1625378477.0,
                    "replies": []
                },
                {
                    "body": "😂 dodged a bullet !",
                    "author": "Cdnsugarr",
                    "id": "h41clgt",
                    "parent_id": "t1_h3yufp7",
                    "score": 2,
                    "created_utc": 1625416105.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yup. And trying to subtly gaslight.",
            "author": "clair-cummings",
            "id": "h3zg9am",
            "parent_id": "t1_h3ywbak",
            "score": 26,
            "created_utc": 1625366656.0,
            "replies": []
        },
        {
            "body": "He sounds every entitled.",
            "author": "Tonight_Majestic",
            "id": "h4623zn",
            "parent_id": "t1_h3ywbak",
            "score": 3,
            "created_utc": 1625519479.0,
            "replies": []
        },
        {
            "body": "He can't afford an escort. He wants all day. I bet the amount he is willing to offer is less than an hour of what most escorts around him charge too.",
            "author": "clair-cummings",
            "id": "h3zg7po",
            "parent_id": "t1_h3yuzje",
            "score": 43,
            "created_utc": 1625366628.0,
            "replies": [
                {
                    "body": "Yep. Which is why he’s scamming naive sugar baby’s. With this attitude he’s probably also black listed.",
                    "author": "MsDReid",
                    "id": "h41j8r8",
                    "parent_id": "t1_h3zg7po",
                    "score": 7,
                    "created_utc": 1625419351.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I wish I had learned that at an earlier age. Unfortunately I didn't, and I married that type of person, and I've honestly paid for it a hundred times since. Its sad bc once you are with them they have a way of making you feel like you can't find anyone else. It makes it all that much harder to escape and flourish. From what I can tell in this brief series of texts, I would say he def comes across as potentially controlling and the type of person to stay away from. Already he has tried to make her doubt herself. That's EXACTLY what these type of men will have you doing...second guessing yourself and wondering if its YOU that is wrong.",
            "author": "clair-cummings",
            "id": "h3zycyz",
            "parent_id": "t1_h3zfl3f",
            "score": 13,
            "created_utc": 1625379632.0,
            "replies": [
                {
                    "body": "Sorry you experienced that. I hope you're in a safer and more peaceful place now <3",
                    "author": "mochahoneylove",
                    "id": "h40vprq",
                    "parent_id": "t1_h3zycyz",
                    "score": 2,
                    "created_utc": 1625407601.0,
                    "replies": []
                },
                {
                    "body": "You should meet my wife",
                    "author": "ryder242",
                    "id": "h46gl0i",
                    "parent_id": "t1_h3zycyz",
                    "score": 1,
                    "created_utc": 1625527195.0,
                    "replies": [
                        {
                            "body": "Why? I don't think I'm catching what you're trying to say.",
                            "author": "clair-cummings",
                            "id": "h46gr80",
                            "parent_id": "t1_h46gl0i",
                            "score": 2,
                            "created_utc": 1625527286.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "h3zxmmj",
            "parent_id": "t1_h3zcu78",
            "score": 30,
            "created_utc": 1625378995.0,
            "replies": [
                {
                    "body": "I wish every SB newbie would read this. It’s so important to realize that talk is free and the red flags could be dangerous not just time-wasting.",
                    "author": null,
                    "id": "h40t00l",
                    "parent_id": "t1_h3zxmmj",
                    "score": 9,
                    "created_utc": 1625406099.0,
                    "replies": []
                },
                {
                    "body": "Advocating what is essentially SBs setting their \"rates\" by comparing to escort rates is a clear rule 12 violation. \n\nRule #12: No Escorts/Johns\n\nNo escorts/Johns; although past personal experiences in escorting are fine, we will not allow promotion of this lifestyle or pricing discussion. We understand that some members of our community participate or have participated in both lifestyles but SLF is a Sugar-only sub. Breaking this rule may result in being banned without warning.",
                    "author": "Azurecole",
                    "id": "h42jj3z",
                    "parent_id": "t1_h3zxmmj",
                    "score": 1,
                    "created_utc": 1625437770.0,
                    "replies": [
                        {
                            "body": "Did you read the part where I clarified that and said PPM instead? I explicitly did that. My WHOLE POINT is that many men on these SD sites posing as SD won't even meet the same amount that you would pay for an average escort in the area and that is messed up. Most SB's aren't escorts and don't want to be, but if they are going to be treated like one, its only fair that they receive the same amount or more in PPM for what is average in their area. I would argue that my point does not break any rules and I would suggest you take the time to read again and understand. This is NOT about promotion of this lifestyle, and if you can't see that then you may have some comprehension problems. This is about promoting what is right and safe for SB's. The only people that would be offended by what I said are the exact people I'm talking about: men who are not SD's but are scamming for young naive ignorant women to take advantage of.",
                            "author": "clair-cummings",
                            "id": "h42mnk8",
                            "parent_id": "t1_h42jj3z",
                            "score": 7,
                            "created_utc": 1625439532.0,
                            "replies": []
                        },
                        {
                            "body": "Did you read the part where I clarified that and said PPM instead? I explicitly did that. My WHOLE POINT is that many men on these SD sites posing as SD won't even meet the same amount that you would pay for an average escort in the area and that is messed up. Most SB's aren't escorts and don't want to be, but if they are going to be treated like one, its only fair that they receive the same amount or more in PPM for what is average in their area. I would argue that my point does not break any rules and I would suggest you take the time to read again and understand. This is NOT about promotion of this lifestyle, and if you can't see that then you may have some comprehension problems. This is about promoting what is right and safe for SB's. The only people that would be offended by what I said are the exact people I'm talking about: men who are not SD's but are scamming for young naive ignorant women to take advantage of.",
                            "author": "clair-cummings",
                            "id": "h42moa4",
                            "parent_id": "t1_h42jj3z",
                            "score": 3,
                            "created_utc": 1625439543.0,
                            "replies": []
                        },
                        {
                            "body": "I am advocating for what SB's should set as minimum PPM and I never mentioned an amount. You are arguing semantics here. In escorting that would be called rates and in sugaring it would be called PPM, or eventually allowance amount. I made clear clarification of that in my post. Show me where this has anything to do with the promotion of escorting?",
                            "author": "clair-cummings",
                            "id": "h42n3pj",
                            "parent_id": "t1_h42jj3z",
                            "score": 5,
                            "created_utc": 1625439788.0,
                            "replies": [
                                {
                                    "body": ">I am advocating for what SB's should set as minimum PPM and I never mentioned an amount\n\nYou don't have to mention an amount.  If you're saying SBs in general should set their minimum according to escort rates, it's not allowed.  These are different activities, plumbers don't set their rates according to what masseuses charge either.   Sugar is not escorting, there is no tie-in, much to the chagrin of those whose business models would benefit.\n\nThat said, on a re-read it looks like you're talking about \"SDs\" who are really johns, treat SBs like escorts, and are doing it to take advantage ... and limited your comments to SDs who are actually johns (as per your previous reply)?  Or are you advocating that generally escort rates should apply as some global minimum for us all?",
                                    "author": "Azurecole",
                                    "id": "h42oaup",
                                    "parent_id": "t1_h42n3pj",
                                    "score": 2,
                                    "created_utc": 1625440469.0,
                                    "replies": [
                                        {
                                            "body": "No. I'm saying if you're a SB and you're wondering if you're being shortchanged or taken advantage of, all you need to do is look up local escort rates. If he's asking for multiple hours of your time, he can't even provide what he'd have to pay for an average escort in your area for an hour, then there is a problem and yes you are being taken advantage of. No where am I advocating for the lifestyle of escorting. I am telling SB's to proactively watch out for men like this, they do exist and they are there to take advantage. SB's need to be warned about the bad side of things. Why would this not be in the best interest of all to discuss this? Unless you are literally one of these scummy predatory men, then saying this shouldn't bother you.\n\nNO WHERE am I advocating that SB's should become escorts or charge by the hour. \n\nMy whole point was in advocating for SB's to be aware of predatory men and understand they are out there and to be cautious and aware. They can use this info as they may. I see story after story of women being taken advantage of and at least understanding this side of things they are better prepared to spot men like this and know to value themselves better. Who wouldn't want that?",
                                            "author": "clair-cummings",
                                            "id": "h42puok",
                                            "parent_id": "t1_h42oaup",
                                            "score": 8,
                                            "created_utc": 1625441364.0,
                                            "replies": [
                                                {
                                                    "body": ">No. I'm saying if you're a SB and you're wondering if you're being shortchanged or taken advantage of, all you need to do is look up local escort rates\n\nClaire, if a john came on here and made an equivalent argument, \"if you SDs want to see if you're getting taken advantage of, check out what johns pay.  I'm getting MSOG and around the world for less than PPM and I don't have to rent the room or pay for dinner\", we'd flag him on rule 12.   And rightfully so, what a john pays or what he gets for it means fuckall to me, it's not sugar.  Advocating for tying in to escort/john rates is not sugar and is a rule 12 violation.\n\n>I am telling SB's to proactively watch out for men like this, they doexist and they are there to take advantage. SB's need to be warned aboutthe bad side of things. Why would this not be in the best interest ofall to discuss this?\n\nI agree with all this.  SBs are at obvious, serious risk, and part of our most important goals is to protect them; but the position that only escorts and escorts rates can save them is not needed to do that -- and no, not buying into \"SBs should look at escort rates\" does not make men scummy and predatory.    There is no need to look up escort rates, adopt escort processes, or otherwise behave like an escort, in order to do this.   \"what do I get for my money\" \"how much time do I get for that\" are clear john/escort phrases, not sugar phrases.  That's what she needs to learn, He's a john, drop him if you're looking for an SD -- no need to try to tie escort rates in to keep her safe.",
                                                    "author": "Azurecole",
                                                    "id": "h42ywg8",
                                                    "parent_id": "t1_h42puok",
                                                    "score": 2,
                                                    "created_utc": 1625446859.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yes. I knew there was a technical term for it.",
            "author": "ChapterRelative",
            "id": "h3yswou",
            "parent_id": "t1_h3ys7jm",
            "score": 9,
            "created_utc": 1625352311.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "h3ytx22",
                    "parent_id": "t1_h3yswou",
                    "score": 2,
                    "created_utc": 1625352897.0,
                    "replies": [
                        {
                            "body": "It’s weird because the men I’ve talked to have all been NICER than what I used to not worse. It caught me off guard.",
                            "author": "NewJoMo",
                            "id": "h3yu4w1",
                            "parent_id": "t1_h3ytx22",
                            "score": 5,
                            "created_utc": 1625353021.0,
                            "replies": [
                                {
                                    "body": "That's the thing about men like this. Some how....some way....they have a way of making you second guess and doubt yourself. I don't know how they do it. But certain women fall for it. I married a man like this and it was awful. I still haven't recovered from the trauma I experienced there.",
                                    "author": "clair-cummings",
                                    "id": "h3zypfk",
                                    "parent_id": "t1_h3yu4w1",
                                    "score": 3,
                                    "created_utc": 1625379933.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "I shall call him JACKHAMMER.\n\nNo....let's call him JOHNHAMMER since he clearly wants an escort 😅",
                    "author": "clair-cummings",
                    "id": "h3zyjyg",
                    "parent_id": "t1_h3yswou",
                    "score": 3,
                    "created_utc": 1625379800.0,
                    "replies": [
                        {
                            "body": "The name fits this douchenozzle turd perfectly😂",
                            "author": "That_Millenial_Girl",
                            "id": "h42f4af",
                            "parent_id": "t1_h3zyjyg",
                            "score": 1,
                            "created_utc": 1625435375.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Agree. There are some men that are such douche bags that its clear to see why they have resorted to paying for sex.\n\nNote that I do NOT put all men who \"pay\" for sex in that category. Some men \"pay\" and see hookers or get a SB bc they are married and this makes it all \"cleaner\" as far as less drama/hassle. Some men don't want to deal with the hassle and drama that accompanies a traditional relationship. Some men are virgins or inexperienced and don't want to deal with the hassles and disappointment of dating. And then there are the men that are such jerks or douchebags that turn to this bc traditional dating doesn't work for them bc they are such jerks regular women don't want to/aren't willing to deal w that!",
            "author": "clair-cummings",
            "id": "h3zy2z5",
            "parent_id": "t1_h3zapmf",
            "score": 8,
            "created_utc": 1625379392.0,
            "replies": []
        },
        {
            "body": "The only exception to this is that the amount of time required can vary greatly… I’ve had arrangements where he really only had a couple of hours each week to spend with me… And then I’ve had other arrangements where we did spend the whole day together. And I really didn’t think it was fair for the two-hour guy to have to pay the same amount as the all day guy.  Plus it involved a lot more of my time, and I didn’t think it was fair to me either.  So that seems reasonable to me. If there’s a considerable amount of time involved, I would expect the gift/allowance to be higher.\n\nBut this particular guy is just awful.",
            "author": "RealEarthAngel",
            "id": "h42xggb",
            "parent_id": "t1_h403kwv",
            "score": 1,
            "created_utc": 1625445953.0,
            "replies": []
        },
        {
            "body": "I really wish the ladies would see the truth. There really aren’t a ton of SDs. On SA, it’s mostly salty Johns",
            "author": "JSBelle",
            "id": "h3zizwq",
            "parent_id": "t1_h3z4qn5",
            "score": 5,
            "created_utc": 1625368363.0,
            "replies": [
                {
                    "body": "But even worse, these are men looking for CHEAP prostitutes. And yes, there are some trashy women on seeking but too, there are lots of college educated good women who are NOT escorts but IF they were they wouldn't be charging street walker prices.\n\nBut wait! There's more! Not only do they hope you'll accept their low ball scummy PPM offer BUT! they hope to convince you not to wear protection and have bare sex. They couldn't find the type of escort they want bc the types they want aren't streetwalkers, charge more per hour, will make him wear a condom, and also make him screen. These are truly the scummiest of men. Run far away when you notice these behaviors.",
                    "author": "clair-cummings",
                    "id": "h3zz72i",
                    "parent_id": "t1_h3zizwq",
                    "score": 7,
                    "created_utc": 1625380366.0,
                    "replies": []
                },
                {
                    "body": "This. THIS is the truth. Real SD's are truly a diamond in the rough. If you find one you are blessed.",
                    "author": "clair-cummings",
                    "id": "h3zyub8",
                    "parent_id": "t1_h3zizwq",
                    "score": 5,
                    "created_utc": 1625380051.0,
                    "replies": []
                },
                {
                    "body": "I did a fake SB profile for a couple weeks to see how bad it was.  Not quite as bad as I thought but fairly bad.",
                    "author": "Aaronm989",
                    "id": "h3zt2uj",
                    "parent_id": "t1_h3zizwq",
                    "score": 2,
                    "created_utc": 1625375341.0,
                    "replies": []
                },
                {
                    "body": "I’ll be really honest and say I do not feel that sugaring is a good use of your time when you are young and pretty",
                    "author": "JSBelle",
                    "id": "h46ab5m",
                    "parent_id": "t1_h3zizwq",
                    "score": 2,
                    "created_utc": 1625523785.0,
                    "replies": []
                },
                {
                    "body": "This is true",
                    "author": "Femswitch91",
                    "id": "h3zp4z2",
                    "parent_id": "t1_h3zizwq",
                    "score": 1,
                    "created_utc": 1625372460.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "he gives me abuser vibes",
            "author": "AlinaDarling",
            "id": "h40c85e",
            "parent_id": "t1_h3yufp7",
            "score": 45,
            "created_utc": 1625392726.0,
            "replies": []
        },
        {
            "body": "Broke for not wanting his £££ (or$$$)? What a weirdo….",
            "author": "Ghanaiantoffee",
            "id": "h3yuub6",
            "parent_id": "t1_h3yufp7",
            "score": 32,
            "created_utc": 1625353436.0,
            "replies": []
        },
        {
            "body": "That is some definite projection right there! The guy that wants all day of your time but probably wants to spend less than the cost of an hour w an average escort in his area too. Like sir, this isn't Burger King, you can't have it your way 🙄",
            "author": "clair-cummings",
            "id": "h3zx0nf",
            "parent_id": "t1_h3yufp7",
            "score": 26,
            "created_utc": 1625378477.0,
            "replies": []
        },
        {
            "body": "😂 dodged a bullet !",
            "author": "Cdnsugarr",
            "id": "h41clgt",
            "parent_id": "t1_h3yufp7",
            "score": 2,
            "created_utc": 1625416105.0,
            "replies": []
        },
        {
            "body": "Yep. Which is why he’s scamming naive sugar baby’s. With this attitude he’s probably also black listed.",
            "author": "MsDReid",
            "id": "h41j8r8",
            "parent_id": "t1_h3zg7po",
            "score": 7,
            "created_utc": 1625419351.0,
            "replies": []
        },
        {
            "body": "Sorry you experienced that. I hope you're in a safer and more peaceful place now <3",
            "author": "mochahoneylove",
            "id": "h40vprq",
            "parent_id": "t1_h3zycyz",
            "score": 2,
            "created_utc": 1625407601.0,
            "replies": []
        },
        {
            "body": "You should meet my wife",
            "author": "ryder242",
            "id": "h46gl0i",
            "parent_id": "t1_h3zycyz",
            "score": 1,
            "created_utc": 1625527195.0,
            "replies": [
                {
                    "body": "Why? I don't think I'm catching what you're trying to say.",
                    "author": "clair-cummings",
                    "id": "h46gr80",
                    "parent_id": "t1_h46gl0i",
                    "score": 2,
                    "created_utc": 1625527286.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I wish every SB newbie would read this. It’s so important to realize that talk is free and the red flags could be dangerous not just time-wasting.",
            "author": null,
            "id": "h40t00l",
            "parent_id": "t1_h3zxmmj",
            "score": 9,
            "created_utc": 1625406099.0,
            "replies": []
        },
        {
            "body": "Advocating what is essentially SBs setting their \"rates\" by comparing to escort rates is a clear rule 12 violation. \n\nRule #12: No Escorts/Johns\n\nNo escorts/Johns; although past personal experiences in escorting are fine, we will not allow promotion of this lifestyle or pricing discussion. We understand that some members of our community participate or have participated in both lifestyles but SLF is a Sugar-only sub. Breaking this rule may result in being banned without warning.",
            "author": "Azurecole",
            "id": "h42jj3z",
            "parent_id": "t1_h3zxmmj",
            "score": 1,
            "created_utc": 1625437770.0,
            "replies": [
                {
                    "body": "Did you read the part where I clarified that and said PPM instead? I explicitly did that. My WHOLE POINT is that many men on these SD sites posing as SD won't even meet the same amount that you would pay for an average escort in the area and that is messed up. Most SB's aren't escorts and don't want to be, but if they are going to be treated like one, its only fair that they receive the same amount or more in PPM for what is average in their area. I would argue that my point does not break any rules and I would suggest you take the time to read again and understand. This is NOT about promotion of this lifestyle, and if you can't see that then you may have some comprehension problems. This is about promoting what is right and safe for SB's. The only people that would be offended by what I said are the exact people I'm talking about: men who are not SD's but are scamming for young naive ignorant women to take advantage of.",
                    "author": "clair-cummings",
                    "id": "h42mnk8",
                    "parent_id": "t1_h42jj3z",
                    "score": 7,
                    "created_utc": 1625439532.0,
                    "replies": []
                },
                {
                    "body": "Did you read the part where I clarified that and said PPM instead? I explicitly did that. My WHOLE POINT is that many men on these SD sites posing as SD won't even meet the same amount that you would pay for an average escort in the area and that is messed up. Most SB's aren't escorts and don't want to be, but if they are going to be treated like one, its only fair that they receive the same amount or more in PPM for what is average in their area. I would argue that my point does not break any rules and I would suggest you take the time to read again and understand. This is NOT about promotion of this lifestyle, and if you can't see that then you may have some comprehension problems. This is about promoting what is right and safe for SB's. The only people that would be offended by what I said are the exact people I'm talking about: men who are not SD's but are scamming for young naive ignorant women to take advantage of.",
                    "author": "clair-cummings",
                    "id": "h42moa4",
                    "parent_id": "t1_h42jj3z",
                    "score": 3,
                    "created_utc": 1625439543.0,
                    "replies": []
                },
                {
                    "body": "I am advocating for what SB's should set as minimum PPM and I never mentioned an amount. You are arguing semantics here. In escorting that would be called rates and in sugaring it would be called PPM, or eventually allowance amount. I made clear clarification of that in my post. Show me where this has anything to do with the promotion of escorting?",
                    "author": "clair-cummings",
                    "id": "h42n3pj",
                    "parent_id": "t1_h42jj3z",
                    "score": 5,
                    "created_utc": 1625439788.0,
                    "replies": [
                        {
                            "body": ">I am advocating for what SB's should set as minimum PPM and I never mentioned an amount\n\nYou don't have to mention an amount.  If you're saying SBs in general should set their minimum according to escort rates, it's not allowed.  These are different activities, plumbers don't set their rates according to what masseuses charge either.   Sugar is not escorting, there is no tie-in, much to the chagrin of those whose business models would benefit.\n\nThat said, on a re-read it looks like you're talking about \"SDs\" who are really johns, treat SBs like escorts, and are doing it to take advantage ... and limited your comments to SDs who are actually johns (as per your previous reply)?  Or are you advocating that generally escort rates should apply as some global minimum for us all?",
                            "author": "Azurecole",
                            "id": "h42oaup",
                            "parent_id": "t1_h42n3pj",
                            "score": 2,
                            "created_utc": 1625440469.0,
                            "replies": [
                                {
                                    "body": "No. I'm saying if you're a SB and you're wondering if you're being shortchanged or taken advantage of, all you need to do is look up local escort rates. If he's asking for multiple hours of your time, he can't even provide what he'd have to pay for an average escort in your area for an hour, then there is a problem and yes you are being taken advantage of. No where am I advocating for the lifestyle of escorting. I am telling SB's to proactively watch out for men like this, they do exist and they are there to take advantage. SB's need to be warned about the bad side of things. Why would this not be in the best interest of all to discuss this? Unless you are literally one of these scummy predatory men, then saying this shouldn't bother you.\n\nNO WHERE am I advocating that SB's should become escorts or charge by the hour. \n\nMy whole point was in advocating for SB's to be aware of predatory men and understand they are out there and to be cautious and aware. They can use this info as they may. I see story after story of women being taken advantage of and at least understanding this side of things they are better prepared to spot men like this and know to value themselves better. Who wouldn't want that?",
                                    "author": "clair-cummings",
                                    "id": "h42puok",
                                    "parent_id": "t1_h42oaup",
                                    "score": 8,
                                    "created_utc": 1625441364.0,
                                    "replies": [
                                        {
                                            "body": ">No. I'm saying if you're a SB and you're wondering if you're being shortchanged or taken advantage of, all you need to do is look up local escort rates\n\nClaire, if a john came on here and made an equivalent argument, \"if you SDs want to see if you're getting taken advantage of, check out what johns pay.  I'm getting MSOG and around the world for less than PPM and I don't have to rent the room or pay for dinner\", we'd flag him on rule 12.   And rightfully so, what a john pays or what he gets for it means fuckall to me, it's not sugar.  Advocating for tying in to escort/john rates is not sugar and is a rule 12 violation.\n\n>I am telling SB's to proactively watch out for men like this, they doexist and they are there to take advantage. SB's need to be warned aboutthe bad side of things. Why would this not be in the best interest ofall to discuss this?\n\nI agree with all this.  SBs are at obvious, serious risk, and part of our most important goals is to protect them; but the position that only escorts and escorts rates can save them is not needed to do that -- and no, not buying into \"SBs should look at escort rates\" does not make men scummy and predatory.    There is no need to look up escort rates, adopt escort processes, or otherwise behave like an escort, in order to do this.   \"what do I get for my money\" \"how much time do I get for that\" are clear john/escort phrases, not sugar phrases.  That's what she needs to learn, He's a john, drop him if you're looking for an SD -- no need to try to tie escort rates in to keep her safe.",
                                            "author": "Azurecole",
                                            "id": "h42ywg8",
                                            "parent_id": "t1_h42puok",
                                            "score": 2,
                                            "created_utc": 1625446859.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "h3ytx22",
            "parent_id": "t1_h3yswou",
            "score": 2,
            "created_utc": 1625352897.0,
            "replies": [
                {
                    "body": "It’s weird because the men I’ve talked to have all been NICER than what I used to not worse. It caught me off guard.",
                    "author": "NewJoMo",
                    "id": "h3yu4w1",
                    "parent_id": "t1_h3ytx22",
                    "score": 5,
                    "created_utc": 1625353021.0,
                    "replies": [
                        {
                            "body": "That's the thing about men like this. Some how....some way....they have a way of making you second guess and doubt yourself. I don't know how they do it. But certain women fall for it. I married a man like this and it was awful. I still haven't recovered from the trauma I experienced there.",
                            "author": "clair-cummings",
                            "id": "h3zypfk",
                            "parent_id": "t1_h3yu4w1",
                            "score": 3,
                            "created_utc": 1625379933.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I shall call him JACKHAMMER.\n\nNo....let's call him JOHNHAMMER since he clearly wants an escort 😅",
            "author": "clair-cummings",
            "id": "h3zyjyg",
            "parent_id": "t1_h3yswou",
            "score": 3,
            "created_utc": 1625379800.0,
            "replies": [
                {
                    "body": "The name fits this douchenozzle turd perfectly😂",
                    "author": "That_Millenial_Girl",
                    "id": "h42f4af",
                    "parent_id": "t1_h3zyjyg",
                    "score": 1,
                    "created_utc": 1625435375.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "But even worse, these are men looking for CHEAP prostitutes. And yes, there are some trashy women on seeking but too, there are lots of college educated good women who are NOT escorts but IF they were they wouldn't be charging street walker prices.\n\nBut wait! There's more! Not only do they hope you'll accept their low ball scummy PPM offer BUT! they hope to convince you not to wear protection and have bare sex. They couldn't find the type of escort they want bc the types they want aren't streetwalkers, charge more per hour, will make him wear a condom, and also make him screen. These are truly the scummiest of men. Run far away when you notice these behaviors.",
            "author": "clair-cummings",
            "id": "h3zz72i",
            "parent_id": "t1_h3zizwq",
            "score": 7,
            "created_utc": 1625380366.0,
            "replies": []
        },
        {
            "body": "This. THIS is the truth. Real SD's are truly a diamond in the rough. If you find one you are blessed.",
            "author": "clair-cummings",
            "id": "h3zyub8",
            "parent_id": "t1_h3zizwq",
            "score": 5,
            "created_utc": 1625380051.0,
            "replies": []
        },
        {
            "body": "I did a fake SB profile for a couple weeks to see how bad it was.  Not quite as bad as I thought but fairly bad.",
            "author": "Aaronm989",
            "id": "h3zt2uj",
            "parent_id": "t1_h3zizwq",
            "score": 2,
            "created_utc": 1625375341.0,
            "replies": []
        },
        {
            "body": "I’ll be really honest and say I do not feel that sugaring is a good use of your time when you are young and pretty",
            "author": "JSBelle",
            "id": "h46ab5m",
            "parent_id": "t1_h3zizwq",
            "score": 2,
            "created_utc": 1625523785.0,
            "replies": []
        },
        {
            "body": "This is true",
            "author": "Femswitch91",
            "id": "h3zp4z2",
            "parent_id": "t1_h3zizwq",
            "score": 1,
            "created_utc": 1625372460.0,
            "replies": []
        },
        {
            "body": "Why? I don't think I'm catching what you're trying to say.",
            "author": "clair-cummings",
            "id": "h46gr80",
            "parent_id": "t1_h46gl0i",
            "score": 2,
            "created_utc": 1625527286.0,
            "replies": []
        },
        {
            "body": "Did you read the part where I clarified that and said PPM instead? I explicitly did that. My WHOLE POINT is that many men on these SD sites posing as SD won't even meet the same amount that you would pay for an average escort in the area and that is messed up. Most SB's aren't escorts and don't want to be, but if they are going to be treated like one, its only fair that they receive the same amount or more in PPM for what is average in their area. I would argue that my point does not break any rules and I would suggest you take the time to read again and understand. This is NOT about promotion of this lifestyle, and if you can't see that then you may have some comprehension problems. This is about promoting what is right and safe for SB's. The only people that would be offended by what I said are the exact people I'm talking about: men who are not SD's but are scamming for young naive ignorant women to take advantage of.",
            "author": "clair-cummings",
            "id": "h42mnk8",
            "parent_id": "t1_h42jj3z",
            "score": 7,
            "created_utc": 1625439532.0,
            "replies": []
        },
        {
            "body": "Did you read the part where I clarified that and said PPM instead? I explicitly did that. My WHOLE POINT is that many men on these SD sites posing as SD won't even meet the same amount that you would pay for an average escort in the area and that is messed up. Most SB's aren't escorts and don't want to be, but if they are going to be treated like one, its only fair that they receive the same amount or more in PPM for what is average in their area. I would argue that my point does not break any rules and I would suggest you take the time to read again and understand. This is NOT about promotion of this lifestyle, and if you can't see that then you may have some comprehension problems. This is about promoting what is right and safe for SB's. The only people that would be offended by what I said are the exact people I'm talking about: men who are not SD's but are scamming for young naive ignorant women to take advantage of.",
            "author": "clair-cummings",
            "id": "h42moa4",
            "parent_id": "t1_h42jj3z",
            "score": 3,
            "created_utc": 1625439543.0,
            "replies": []
        },
        {
            "body": "I am advocating for what SB's should set as minimum PPM and I never mentioned an amount. You are arguing semantics here. In escorting that would be called rates and in sugaring it would be called PPM, or eventually allowance amount. I made clear clarification of that in my post. Show me where this has anything to do with the promotion of escorting?",
            "author": "clair-cummings",
            "id": "h42n3pj",
            "parent_id": "t1_h42jj3z",
            "score": 5,
            "created_utc": 1625439788.0,
            "replies": [
                {
                    "body": ">I am advocating for what SB's should set as minimum PPM and I never mentioned an amount\n\nYou don't have to mention an amount.  If you're saying SBs in general should set their minimum according to escort rates, it's not allowed.  These are different activities, plumbers don't set their rates according to what masseuses charge either.   Sugar is not escorting, there is no tie-in, much to the chagrin of those whose business models would benefit.\n\nThat said, on a re-read it looks like you're talking about \"SDs\" who are really johns, treat SBs like escorts, and are doing it to take advantage ... and limited your comments to SDs who are actually johns (as per your previous reply)?  Or are you advocating that generally escort rates should apply as some global minimum for us all?",
                    "author": "Azurecole",
                    "id": "h42oaup",
                    "parent_id": "t1_h42n3pj",
                    "score": 2,
                    "created_utc": 1625440469.0,
                    "replies": [
                        {
                            "body": "No. I'm saying if you're a SB and you're wondering if you're being shortchanged or taken advantage of, all you need to do is look up local escort rates. If he's asking for multiple hours of your time, he can't even provide what he'd have to pay for an average escort in your area for an hour, then there is a problem and yes you are being taken advantage of. No where am I advocating for the lifestyle of escorting. I am telling SB's to proactively watch out for men like this, they do exist and they are there to take advantage. SB's need to be warned about the bad side of things. Why would this not be in the best interest of all to discuss this? Unless you are literally one of these scummy predatory men, then saying this shouldn't bother you.\n\nNO WHERE am I advocating that SB's should become escorts or charge by the hour. \n\nMy whole point was in advocating for SB's to be aware of predatory men and understand they are out there and to be cautious and aware. They can use this info as they may. I see story after story of women being taken advantage of and at least understanding this side of things they are better prepared to spot men like this and know to value themselves better. Who wouldn't want that?",
                            "author": "clair-cummings",
                            "id": "h42puok",
                            "parent_id": "t1_h42oaup",
                            "score": 8,
                            "created_utc": 1625441364.0,
                            "replies": [
                                {
                                    "body": ">No. I'm saying if you're a SB and you're wondering if you're being shortchanged or taken advantage of, all you need to do is look up local escort rates\n\nClaire, if a john came on here and made an equivalent argument, \"if you SDs want to see if you're getting taken advantage of, check out what johns pay.  I'm getting MSOG and around the world for less than PPM and I don't have to rent the room or pay for dinner\", we'd flag him on rule 12.   And rightfully so, what a john pays or what he gets for it means fuckall to me, it's not sugar.  Advocating for tying in to escort/john rates is not sugar and is a rule 12 violation.\n\n>I am telling SB's to proactively watch out for men like this, they doexist and they are there to take advantage. SB's need to be warned aboutthe bad side of things. Why would this not be in the best interest ofall to discuss this?\n\nI agree with all this.  SBs are at obvious, serious risk, and part of our most important goals is to protect them; but the position that only escorts and escorts rates can save them is not needed to do that -- and no, not buying into \"SBs should look at escort rates\" does not make men scummy and predatory.    There is no need to look up escort rates, adopt escort processes, or otherwise behave like an escort, in order to do this.   \"what do I get for my money\" \"how much time do I get for that\" are clear john/escort phrases, not sugar phrases.  That's what she needs to learn, He's a john, drop him if you're looking for an SD -- no need to try to tie escort rates in to keep her safe.",
                                    "author": "Azurecole",
                                    "id": "h42ywg8",
                                    "parent_id": "t1_h42puok",
                                    "score": 2,
                                    "created_utc": 1625446859.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "It’s weird because the men I’ve talked to have all been NICER than what I used to not worse. It caught me off guard.",
            "author": "NewJoMo",
            "id": "h3yu4w1",
            "parent_id": "t1_h3ytx22",
            "score": 5,
            "created_utc": 1625353021.0,
            "replies": [
                {
                    "body": "That's the thing about men like this. Some how....some way....they have a way of making you second guess and doubt yourself. I don't know how they do it. But certain women fall for it. I married a man like this and it was awful. I still haven't recovered from the trauma I experienced there.",
                    "author": "clair-cummings",
                    "id": "h3zypfk",
                    "parent_id": "t1_h3yu4w1",
                    "score": 3,
                    "created_utc": 1625379933.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "The name fits this douchenozzle turd perfectly😂",
            "author": "That_Millenial_Girl",
            "id": "h42f4af",
            "parent_id": "t1_h3zyjyg",
            "score": 1,
            "created_utc": 1625435375.0,
            "replies": []
        },
        {
            "body": ">I am advocating for what SB's should set as minimum PPM and I never mentioned an amount\n\nYou don't have to mention an amount.  If you're saying SBs in general should set their minimum according to escort rates, it's not allowed.  These are different activities, plumbers don't set their rates according to what masseuses charge either.   Sugar is not escorting, there is no tie-in, much to the chagrin of those whose business models would benefit.\n\nThat said, on a re-read it looks like you're talking about \"SDs\" who are really johns, treat SBs like escorts, and are doing it to take advantage ... and limited your comments to SDs who are actually johns (as per your previous reply)?  Or are you advocating that generally escort rates should apply as some global minimum for us all?",
            "author": "Azurecole",
            "id": "h42oaup",
            "parent_id": "t1_h42n3pj",
            "score": 2,
            "created_utc": 1625440469.0,
            "replies": [
                {
                    "body": "No. I'm saying if you're a SB and you're wondering if you're being shortchanged or taken advantage of, all you need to do is look up local escort rates. If he's asking for multiple hours of your time, he can't even provide what he'd have to pay for an average escort in your area for an hour, then there is a problem and yes you are being taken advantage of. No where am I advocating for the lifestyle of escorting. I am telling SB's to proactively watch out for men like this, they do exist and they are there to take advantage. SB's need to be warned about the bad side of things. Why would this not be in the best interest of all to discuss this? Unless you are literally one of these scummy predatory men, then saying this shouldn't bother you.\n\nNO WHERE am I advocating that SB's should become escorts or charge by the hour. \n\nMy whole point was in advocating for SB's to be aware of predatory men and understand they are out there and to be cautious and aware. They can use this info as they may. I see story after story of women being taken advantage of and at least understanding this side of things they are better prepared to spot men like this and know to value themselves better. Who wouldn't want that?",
                    "author": "clair-cummings",
                    "id": "h42puok",
                    "parent_id": "t1_h42oaup",
                    "score": 8,
                    "created_utc": 1625441364.0,
                    "replies": [
                        {
                            "body": ">No. I'm saying if you're a SB and you're wondering if you're being shortchanged or taken advantage of, all you need to do is look up local escort rates\n\nClaire, if a john came on here and made an equivalent argument, \"if you SDs want to see if you're getting taken advantage of, check out what johns pay.  I'm getting MSOG and around the world for less than PPM and I don't have to rent the room or pay for dinner\", we'd flag him on rule 12.   And rightfully so, what a john pays or what he gets for it means fuckall to me, it's not sugar.  Advocating for tying in to escort/john rates is not sugar and is a rule 12 violation.\n\n>I am telling SB's to proactively watch out for men like this, they doexist and they are there to take advantage. SB's need to be warned aboutthe bad side of things. Why would this not be in the best interest ofall to discuss this?\n\nI agree with all this.  SBs are at obvious, serious risk, and part of our most important goals is to protect them; but the position that only escorts and escorts rates can save them is not needed to do that -- and no, not buying into \"SBs should look at escort rates\" does not make men scummy and predatory.    There is no need to look up escort rates, adopt escort processes, or otherwise behave like an escort, in order to do this.   \"what do I get for my money\" \"how much time do I get for that\" are clear john/escort phrases, not sugar phrases.  That's what she needs to learn, He's a john, drop him if you're looking for an SD -- no need to try to tie escort rates in to keep her safe.",
                            "author": "Azurecole",
                            "id": "h42ywg8",
                            "parent_id": "t1_h42puok",
                            "score": 2,
                            "created_utc": 1625446859.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "That's the thing about men like this. Some how....some way....they have a way of making you second guess and doubt yourself. I don't know how they do it. But certain women fall for it. I married a man like this and it was awful. I still haven't recovered from the trauma I experienced there.",
            "author": "clair-cummings",
            "id": "h3zypfk",
            "parent_id": "t1_h3yu4w1",
            "score": 3,
            "created_utc": 1625379933.0,
            "replies": []
        },
        {
            "body": "No. I'm saying if you're a SB and you're wondering if you're being shortchanged or taken advantage of, all you need to do is look up local escort rates. If he's asking for multiple hours of your time, he can't even provide what he'd have to pay for an average escort in your area for an hour, then there is a problem and yes you are being taken advantage of. No where am I advocating for the lifestyle of escorting. I am telling SB's to proactively watch out for men like this, they do exist and they are there to take advantage. SB's need to be warned about the bad side of things. Why would this not be in the best interest of all to discuss this? Unless you are literally one of these scummy predatory men, then saying this shouldn't bother you.\n\nNO WHERE am I advocating that SB's should become escorts or charge by the hour. \n\nMy whole point was in advocating for SB's to be aware of predatory men and understand they are out there and to be cautious and aware. They can use this info as they may. I see story after story of women being taken advantage of and at least understanding this side of things they are better prepared to spot men like this and know to value themselves better. Who wouldn't want that?",
            "author": "clair-cummings",
            "id": "h42puok",
            "parent_id": "t1_h42oaup",
            "score": 8,
            "created_utc": 1625441364.0,
            "replies": [
                {
                    "body": ">No. I'm saying if you're a SB and you're wondering if you're being shortchanged or taken advantage of, all you need to do is look up local escort rates\n\nClaire, if a john came on here and made an equivalent argument, \"if you SDs want to see if you're getting taken advantage of, check out what johns pay.  I'm getting MSOG and around the world for less than PPM and I don't have to rent the room or pay for dinner\", we'd flag him on rule 12.   And rightfully so, what a john pays or what he gets for it means fuckall to me, it's not sugar.  Advocating for tying in to escort/john rates is not sugar and is a rule 12 violation.\n\n>I am telling SB's to proactively watch out for men like this, they doexist and they are there to take advantage. SB's need to be warned aboutthe bad side of things. Why would this not be in the best interest ofall to discuss this?\n\nI agree with all this.  SBs are at obvious, serious risk, and part of our most important goals is to protect them; but the position that only escorts and escorts rates can save them is not needed to do that -- and no, not buying into \"SBs should look at escort rates\" does not make men scummy and predatory.    There is no need to look up escort rates, adopt escort processes, or otherwise behave like an escort, in order to do this.   \"what do I get for my money\" \"how much time do I get for that\" are clear john/escort phrases, not sugar phrases.  That's what she needs to learn, He's a john, drop him if you're looking for an SD -- no need to try to tie escort rates in to keep her safe.",
                    "author": "Azurecole",
                    "id": "h42ywg8",
                    "parent_id": "t1_h42puok",
                    "score": 2,
                    "created_utc": 1625446859.0,
                    "replies": []
                }
            ]
        },
        {
            "body": ">No. I'm saying if you're a SB and you're wondering if you're being shortchanged or taken advantage of, all you need to do is look up local escort rates\n\nClaire, if a john came on here and made an equivalent argument, \"if you SDs want to see if you're getting taken advantage of, check out what johns pay.  I'm getting MSOG and around the world for less than PPM and I don't have to rent the room or pay for dinner\", we'd flag him on rule 12.   And rightfully so, what a john pays or what he gets for it means fuckall to me, it's not sugar.  Advocating for tying in to escort/john rates is not sugar and is a rule 12 violation.\n\n>I am telling SB's to proactively watch out for men like this, they doexist and they are there to take advantage. SB's need to be warned aboutthe bad side of things. Why would this not be in the best interest ofall to discuss this?\n\nI agree with all this.  SBs are at obvious, serious risk, and part of our most important goals is to protect them; but the position that only escorts and escorts rates can save them is not needed to do that -- and no, not buying into \"SBs should look at escort rates\" does not make men scummy and predatory.    There is no need to look up escort rates, adopt escort processes, or otherwise behave like an escort, in order to do this.   \"what do I get for my money\" \"how much time do I get for that\" are clear john/escort phrases, not sugar phrases.  That's what she needs to learn, He's a john, drop him if you're looking for an SD -- no need to try to tie escort rates in to keep her safe.",
            "author": "Azurecole",
            "id": "h42ywg8",
            "parent_id": "t1_h42puok",
            "score": 2,
            "created_utc": 1625446859.0,
            "replies": []
        }
    ]
}