{
    "title": "Newbie looking for profile feedback 🙏🏻",
    "post_id": "o3n1k7",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/o3n1k7/newbie_looking_for_profile_feedback/",
    "author": "Thick_Ad_475",
    "body": "",
    "url": "https://www.reddit.com/gallery/o3n1k7",
    "score": 146,
    "upvote_ratio": 0.95,
    "created_utc": 1624128555.0,
    "num_comments": 96,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "A profile review, exciting! Reminder to reviewers to focus on constructive and actionable changes OP can make to increase their chances of success.\n\n**Do**:\n\n* Critique the quality of the pictures, eg the location of pictures, background, expression, attire, filters, etc.\n* Critique the tone and quality of the text and/or make suggestions for improvement, eg grammar, spelling, negativity, etc.\n\n**Don't**:\n\n* Critique the person, eg editorial comments on OP's weight, age, ethnicity, sexual identification, ugliness, etc.\n\nFor more do's and don'ts check out [the profile reviews post](/r/sugarlifestyleforum/comments/esuizg/profile_reviews/).\n\nThanks for helping OP!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/sugarlifestyleforum) if you have any questions or concerns.*",
            "author": "AutoModerator",
            "id": "h2cm00v",
            "parent_id": "t3_o3n1k7",
            "score": 1,
            "created_utc": 1624128556.0,
            "replies": []
        },
        {
            "body": "You have a terrific overall profile, and other than the investor tag (which has been addressed), I would err on the side of fewer changes than more. My suggestions are more of the same - nibbling around the edges on things:\n\nPhotos: You have more than you need, but nothing wrong with what you have. The pink teddy bear one is great but may be the first one to pull if you do want to limit things.\n\nAbout me: I would love seeing interests that I can plan some dates/activities around. However, you cover enough of your personality that I can see several fun conversations with you - so a small item.\n\nSeeking: A good description of what spending time with you is like - a vision of a date (conversation over wine or 'non-judgmental' latte) might add here.\n\nFinally, for any changes you make - keep in mind if that will appeal to the SD you are seeking. You really are using your profile to market to him and get him to engage you in messaging.",
            "author": "sfwinefan",
            "id": "h2da3bt",
            "parent_id": "t3_o3n1k7",
            "score": 39,
            "created_utc": 1624141510.0,
            "replies": [
                {
                    "body": "These are such helpful recommendations, THANK YOU! Makes complete sense, I will definitely make these updates 🙏🏻",
                    "author": "Thick_Ad_475",
                    "id": "h2dal8o",
                    "parent_id": "t1_h2da3bt",
                    "score": 15,
                    "created_utc": 1624141787.0,
                    "replies": [
                        {
                            "body": "I would think I am allotted 4.074 seconds of looking at my photos and limit those to perhaps only 1  that captivate . You are fortunate that one photo says overwhelming good things about you.  If you want to make a lasting impression the   skyline background   and the bathing suit photos simply say dreams come true .  At that point you want to be asking       dude do you measure up to the opportunity ?",
                            "author": "pinotandsugar",
                            "id": "h2ecrd1",
                            "parent_id": "t1_h2dal8o",
                            "score": 3,
                            "created_utc": 1624164765.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "This is interesting - it seems a common piece of advice given on profile reviews here is to trim down the number of photos, but I also see SBs frequently complaining of guys on SA always asking for more pics, haha. The mixed signals 😂",
                    "author": "stowawayxthrowaway",
                    "id": "h2dfawr",
                    "parent_id": "t1_h2da3bt",
                    "score": 7,
                    "created_utc": 1624144480.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Looks good. Youre in NYC. You don't really need to come right out and say intimacy or mutually beneficial. You're going to get an overwhelming amount of interest with your profile as is. Personally, I read your use of companionship as open enough that I wouldn't think your profile was platonic. And being more explicit than that in a market as big as NY really isn't necessary or likely to conduce to the type of SR it seems you're looking for. The explicitness of monthly allowance dovetails nicely with your goal of getting a benefactor as distinct from less dedicated/interested SDs. \n\nI would leave as is for now. Your pics will attract a lot of unwanted attention from people who don't read or care about profile text, because they're great (wheat timbs life). But for the rest it'll filter out some guys who are interested in something less involved or shorter duration. \n\nI take it you can afford to wait for the right match so you can afford a finely meshed sieve. It'll take a little longer, but your profile text, at present, will filter some of the less desirables and encourage legitimate SDs to approach you at a level you seem to want by encouraging a deeper relationship with monthly allowance as a short term goal.",
            "author": "OpenAirMarket901",
            "id": "h2ctr1a",
            "parent_id": "t3_o3n1k7",
            "score": 18,
            "created_utc": 1624132655.0,
            "replies": [
                {
                    "body": "Thank you so much for taking the time to write this! So helpful and a great reminder that good things take time. I really appreciate it. \n\nEdit: Wheat timbs for life ✊🏻",
                    "author": "Thick_Ad_475",
                    "id": "h2czsfm",
                    "parent_id": "t1_h2ctr1a",
                    "score": 9,
                    "created_utc": 1624135896.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I'd like to emphasize something u/bluelantern said: You need a full body photo dressed to the nines. I would use it to replace the one with the plants. You need one shot to let SDs see what it would be like to take you out to events, because all of your other photos depict nothing but the \"down home\" country girl. If you are looking for mentorship, investment, and education, then you want to appeal to a man who might well wish to take you out on the town or to corporate cocktail parties, and you should show him that you can fit in.\n\nSecond, there were several mentions of how explicit you need to be about intimacy being a part of the relationship. Part of the problem may be that all of your photos show nothing but \"cute.\" Even the bikini pic is a relatively conservative bottom, and it is all made of a gingham pattern. Maybe you should switch that pic out with a bikini shot that shows more sexuality. It doesn't have to be slutty, but it might help convey that you want to be part of an intimate relationship with the right person (without having to say the word intimate).",
            "author": "icedteasgp",
            "id": "h2f5bfn",
            "parent_id": "t3_o3n1k7",
            "score": 8,
            "created_utc": 1624190604.0,
            "replies": [
                {
                    "body": "That makes a lot of sense - I know I tend to give baby lamb vibes in general no matter what so I’m sure some of the photos aren’t helping haha. I did have trouble finding photos that weren’t already used on the internet somewhere and just as a layer of protection wanted to keep them completely new in that regard, so know they definitely not be ideal.\n\nFor now hopefully someone can imagine if they like what they see in gingham they’ll like what they see in a nice gown but will definitely try to take a new nice dressed up or bikini photo to add sometime soon! Do you think this will really be a huge hinderance or something that could wait a week or so until I get the chance?",
                    "author": "Thick_Ad_475",
                    "id": "h2fjt62",
                    "parent_id": "t1_h2f5bfn",
                    "score": 5,
                    "created_utc": 1624199461.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "h2e1qpi",
            "parent_id": "t3_o3n1k7",
            "score": 14,
            "created_utc": 1624157768.0,
            "replies": [
                {
                    "body": "Thank you so much! This was such a kind comment and I really appreciate it, fellow New Yorker. 💜",
                    "author": "Thick_Ad_475",
                    "id": "h2e7cob",
                    "parent_id": "t1_h2e1qpi",
                    "score": 3,
                    "created_utc": 1624161083.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "h2cvzxh",
            "parent_id": "t3_o3n1k7",
            "score": 12,
            "created_utc": 1624133864.0,
            "replies": [
                {
                    "body": "Thank you so much! That means a lot 🥲",
                    "author": "Thick_Ad_475",
                    "id": "h2cxdsl",
                    "parent_id": "t1_h2cvzxh",
                    "score": 3,
                    "created_utc": 1624134599.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "WOW thank you everyone so much for your feedback and sweet words. I’m so overwhelmed by everyones kindness; I’ve teared up at least twice today lol so thank you you lovely humans!! Talk about some solidarity amongst strangers 💜",
            "author": "Thick_Ad_475",
            "id": "h2ec0bz",
            "parent_id": "t3_o3n1k7",
            "score": 5,
            "created_utc": 1624164227.0,
            "replies": []
        },
        {
            "body": "Oh you’re so gorgeous there’s no way you’re real!!",
            "author": null,
            "id": "h2cmayh",
            "parent_id": "t3_o3n1k7",
            "score": 6,
            "created_utc": 1624128716.0,
            "replies": [
                {
                    "body": "Oh no I’m not sure if this is a compliment or critique!! If compliment thank you so much (😭) and if critique should I add in some less flattering photos?",
                    "author": "Thick_Ad_475",
                    "id": "h2cmg7v",
                    "parent_id": "t1_h2cmayh",
                    "score": 6,
                    "created_utc": 1624128796.0,
                    "replies": [
                        {
                            "body": "Compliment 🤍",
                            "author": null,
                            "id": "h2dcv4u",
                            "parent_id": "t1_h2cmg7v",
                            "score": 3,
                            "created_utc": 1624143079.0,
                            "replies": [
                                {
                                    "body": "Thank you!! You are also gorgeous 💜",
                                    "author": "Thick_Ad_475",
                                    "id": "h2dgpcx",
                                    "parent_id": "t1_h2dcv4u",
                                    "score": 2,
                                    "created_utc": 1624145291.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "It’s up to the SD to verify you’re real. Videoconferencing does the trick.",
                            "author": "chairman212121",
                            "id": "h2cs92o",
                            "parent_id": "t1_h2cmg7v",
                            "score": 1,
                            "created_utc": 1624131883.0,
                            "replies": [
                                {
                                    "body": "I heard SD don’t like videoconferencing or was that bad advice",
                                    "author": "Rommababy",
                                    "id": "h2dpz0x",
                                    "parent_id": "t1_h2cs92o",
                                    "score": 1,
                                    "created_utc": 1624150694.0,
                                    "replies": [
                                        {
                                            "body": "married SD dont like them, a lot of us single / divorced guys dont mind, because it gives us a chance to make sure she looks like her photos, and it also allows you to connect better then just a call",
                                            "author": null,
                                            "id": "h2f8ka4",
                                            "parent_id": "t1_h2dpz0x",
                                            "score": 3,
                                            "created_utc": 1624193043.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "I wouldn’t know as I don’t date them! General consensus amongst SBs please…",
                                            "author": "chairman212121",
                                            "id": "h2e4a38",
                                            "parent_id": "t1_h2dpz0x",
                                            "score": -1,
                                            "created_utc": 1624159285.0,
                                            "replies": [
                                                {
                                                    "body": "After the first ten or so messages I always ask if they'd like to arrange a video chat to see how we get on face to face. It's primarily for safety, but even if not for that reason I'd still do it, as it avoids those awful first meets where one or both of you know it's a no within minutes but you have to sit politely through the date anyway. Lots of guys I've spoken to hadn't done video calls before a M&G before, but none were unhappy to do it.",
                                                    "author": "assinoroyale",
                                                    "id": "h2f4c9i",
                                                    "parent_id": "t1_h2e4a38",
                                                    "score": 6,
                                                    "created_utc": 1624189811.0,
                                                    "replies": []
                                                },
                                                {
                                                    "body": "In my very limited experience of a day only one has not wanted to but quite a few brought it up themselves 🤷🏼‍♀️",
                                                    "author": "Thick_Ad_475",
                                                    "id": "h2eayj5",
                                                    "parent_id": "t1_h2e4a38",
                                                    "score": 4,
                                                    "created_utc": 1624163492.0,
                                                    "replies": []
                                                },
                                                {
                                                    "body": "If a guy asks me to video chat before we meet I typically stop responding. It’s a time waster/pic collector tactic the majority of the time. I simply say-\n\n“If you are eager to see me let’s move the meet and greet up:)”",
                                                    "author": "MsDReid",
                                                    "id": "h2eg78z",
                                                    "parent_id": "t1_h2e4a38",
                                                    "score": 5,
                                                    "created_utc": 1624167409.0,
                                                    "replies": [
                                                        {
                                                            "body": "But wouldn’t you want to check the guy in the pics is the guy in the video? Seems like a normal person etc?",
                                                            "author": "chairman212121",
                                                            "id": "h2ex0m6",
                                                            "parent_id": "t1_h2eg78z",
                                                            "score": 1,
                                                            "created_utc": 1624183194.0,
                                                            "replies": [
                                                                {
                                                                    "body": "No. That can all be done in public in person. Which if a man isn’t scheduling a meet to happen within the first 3-5 days of texting I concentrate on other connections. I’ll send a lighthearted “message me when you have free time to meet” and leave it at that. But most of the time the men asking for pics/video calls/putting off meeting are scammers. \n\nAdditionally I’m not giving someone my real number. But even if I could do it without doing so. No. Never. And if a guy asks and then doesn’t respond favorably to my text about a meet and greet…bye🤷‍♀️",
                                                                    "author": "MsDReid",
                                                                    "id": "h2exla1",
                                                                    "parent_id": "t1_h2ex0m6",
                                                                    "score": 4,
                                                                    "created_utc": 1624183750.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "Sounds like S’ing over there is way worse, more dangerous than here in Southern Europe. No SB would be that cautious with me.",
                                                                            "author": "chairman212121",
                                                                            "id": "h2ezq0b",
                                                                            "parent_id": "t1_h2exla1",
                                                                            "score": 3,
                                                                            "created_utc": 1624185764.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "that's because she's coming from the sex work world, and just being a normal woman that becomes a sugar baby. Sex workers have different protocols, especially here in the US.",
                                                                                    "author": null,
                                                                                    "id": "h2f8pr2",
                                                                                    "parent_id": "t1_h2ezq0b",
                                                                                    "score": 1,
                                                                                    "created_utc": 1624193147.0,
                                                                                    "replies": [
                                                                                        {
                                                                                            "body": "Aaahhhhhhhh. Explains everything.",
                                                                                            "author": "chairman212121",
                                                                                            "id": "h2fi18r",
                                                                                            "parent_id": "t1_h2f8pr2",
                                                                                            "score": 1,
                                                                                            "created_utc": 1624198508.0,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "You seem wholesome, kind and comfortable with who you are. Agree with some other comments that you’re a bit of a niche but if you’re patient you might find a great match.",
            "author": "Diditall4thecookie",
            "id": "h2f39e5",
            "parent_id": "t3_o3n1k7",
            "score": 3,
            "created_utc": 1624188919.0,
            "replies": [
                {
                    "body": "Thank you so much 💜",
                    "author": "Thick_Ad_475",
                    "id": "h2fkilv",
                    "parent_id": "t1_h2f39e5",
                    "score": 2,
                    "created_utc": 1624199821.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Pics are amazing.\n\nText is amazing.\n\nHonestly, you had me at running and 43 houseplants.\n\nI'd message you in a heartbeat as I suspect many others will.",
            "author": "soicansaywhatiwant",
            "id": "h2oaclu",
            "parent_id": "t3_o3n1k7",
            "score": 3,
            "created_utc": 1624383546.0,
            "replies": []
        },
        {
            "body": "* Reads a bit like a platonic profile.\n* Monthly allowances feel uncommon, I wonder if changing \"monthly allowance\" to \"regular allowance\" would help.\n* The Investor tag always makes me wonder if the person's on the right site.\n* If you expect more initial messages from POTs than what you're getting, double-check your profile is visible in Search. Go to Settings -> Search and Dashboard, and make sure \"Visible\" is selected.",
            "author": "SeattleLaserMeteor",
            "id": "h2cmhcr",
            "parent_id": "t3_o3n1k7",
            "score": 8,
            "created_utc": 1624128813.0,
            "replies": [
                {
                    "body": "Oh that’s a good tweak, I’ll change it to “regular allowance” thank you!\n\nI did investor because I’d love to find someone who could mentor me in my career (I’m not a great negotiator or good at selling myself etc) but if it’s an odd one no one uses I’ll definitely take it off!\n\nI didn’t intend for it to come across as platonic. Is there anything you suggest I should add to make it seem less so?",
                    "author": "Thick_Ad_475",
                    "id": "h2cmwpu",
                    "parent_id": "t1_h2cmhcr",
                    "score": 6,
                    "created_utc": 1624129043.0,
                    "replies": [
                        {
                            "body": "> who could mentor me in my career (I’m not a great negotiator or good at selling myself etc)\n\nYeah, I'd say bring this up with a guy after you've been chatting for a bit. Most people are happy to provide their opinions. (And best to avoid putting it on the profile as it might encourage people to take advantage of you.)\n\n> Is there anything you suggest I should add to make it seem less so?\n\nSomething as simple as adding \"and intimacy\" to \"While the mentorship and companionship are just as important\" can do the trick :)\n\nI agree with Thin-Resolution832, you'll do fine :)\n\nEdit: LeoFrenchGuy brings up a good point, it might help to add more on why an SD should pick you over the competition / why you're an amazing SB.",
                            "author": "SeattleLaserMeteor",
                            "id": "h2cnnb7",
                            "parent_id": "t1_h2cmwpu",
                            "score": 3,
                            "created_utc": 1624129437.0,
                            "replies": [
                                {
                                    "body": "All super helpful, thank you very much! You’re both definitely right I could work on the part of why an SD should pick me, I just feel so gross talking about myself 🤦🏼‍♀️Will try to view it as good practice selling myself!",
                                    "author": "Thick_Ad_475",
                                    "id": "h2coqgs",
                                    "parent_id": "t1_h2cnnb7",
                                    "score": 3,
                                    "created_utc": 1624130020.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": ">I did investor because I’d love to find someone who could mentor me in my career\n\nThen choose the mentorship tag. The investor tag is usually used by women that are looking for someone to help fund their business ventures, which most SD are kind of turned off by, because thats not the purpose of the site.",
                            "author": null,
                            "id": "h2f8u9v",
                            "parent_id": "t1_h2cmwpu",
                            "score": 2,
                            "created_utc": 1624193235.0,
                            "replies": [
                                {
                                    "body": "AHH thank you SO much for this very helpful info! Taking it off 🙏🏻",
                                    "author": "Thick_Ad_475",
                                    "id": "h2fk0qi",
                                    "parent_id": "t1_h2f8u9v",
                                    "score": 1,
                                    "created_utc": 1624199568.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "There is no kind of any sugar gain for a SD",
                            "author": "LeoFrenchGuy",
                            "id": "h2cnhks",
                            "parent_id": "t1_h2cmwpu",
                            "score": 1,
                            "created_utc": 1624129353.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "I actually found the pictures very appealing but very much agree with the investor tag.",
                    "author": null,
                    "id": "h2d7f32",
                    "parent_id": "t1_h2cmhcr",
                    "score": 1,
                    "created_utc": 1624140002.0,
                    "replies": [
                        {
                            "body": "Thank you! Took off the investor tag, good to know that was a mistake haha",
                            "author": "Thick_Ad_475",
                            "id": "h2dg8vv",
                            "parent_id": "t1_h2d7f32",
                            "score": 2,
                            "created_utc": 1624145028.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "A lot of SDs offer mentorship in their profiles.",
                    "author": "chairman212121",
                    "id": "h2crtvw",
                    "parent_id": "t1_h2cmhcr",
                    "score": 0,
                    "created_utc": 1624131676.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "One of the best profiles I've ever seen :)  You come through as a really fun person with diverse interests. Smart + attractive is the secret sauce, and you got it!  Wish I was in NYC right about now!",
            "author": "jeffzeke",
            "id": "h2e315p",
            "parent_id": "t3_o3n1k7",
            "score": 3,
            "created_utc": 1624158539.0,
            "replies": [
                {
                    "body": "Oh man thank you 😭",
                    "author": "Thick_Ad_475",
                    "id": "h2eb64r",
                    "parent_id": "t1_h2e315p",
                    "score": 1,
                    "created_utc": 1624163639.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Pros: very attractive, no red flags\n\nCons: little on what you have to offer and why I should choose you",
            "author": "throwawayrdu71",
            "id": "h2cv6xz",
            "parent_id": "t3_o3n1k7",
            "score": 4,
            "created_utc": 1624133434.0,
            "replies": [
                {
                    "body": "Do you mean I should be explicit about being a caring, fun, loyal person? It just feels so awful speaking explicitly about what I believe I offer. I’d rather show than tell, but understand that could be tricky in this format. What are examples of ways people have said what they have to offer that you’ve liked?",
                    "author": "Thick_Ad_475",
                    "id": "h2djd8i",
                    "parent_id": "t1_h2cv6xz",
                    "score": 6,
                    "created_utc": 1624146848.0,
                    "replies": [
                        {
                            "body": "It’s a good profile, don’t get me wrong.  I probably sound nit picky.\n\nIt’s hard to explain but what seems to be missing is a focus on your SD.  You could say “I am better at showing affection than explaining it!”",
                            "author": "throwawayrdu71",
                            "id": "h2dos8a",
                            "parent_id": "t1_h2djd8i",
                            "score": 1,
                            "created_utc": 1624150001.0,
                            "replies": [
                                {
                                    "body": "That makes sense, thank you so much!  Not nitpicky at all",
                                    "author": "Thick_Ad_475",
                                    "id": "h2dv2r7",
                                    "parent_id": "t1_h2dos8a",
                                    "score": 3,
                                    "created_utc": 1624153742.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "the overall profile is great, part of your value proposition should highlight on the value you bring to the relationship and what the SD brings as well. men are more literal and visual creatures",
                            "author": "Rich_Wishbone",
                            "id": "h2ecwbh",
                            "parent_id": "t1_h2djd8i",
                            "score": 0,
                            "created_utc": 1624164866.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Really great pictures.",
            "author": "pentakiller19",
            "id": "h2ddn81",
            "parent_id": "t3_o3n1k7",
            "score": 2,
            "created_utc": 1624143525.0,
            "replies": [
                {
                    "body": "Thank you so much 😊",
                    "author": "Thick_Ad_475",
                    "id": "h2diwuw",
                    "parent_id": "t1_h2ddn81",
                    "score": 1,
                    "created_utc": 1624146579.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Ab goals! My only recommendation is the one where you're wearing white, you clearly have a lot of makeup on and it hides from your genuine beauty. Maybe delete that one? However just my opinion, you'll have no trouble getting dates regardless!",
            "author": "Heartless_Weeknd",
            "id": "h2dw8r5",
            "parent_id": "t3_o3n1k7",
            "score": 2,
            "created_utc": 1624154448.0,
            "replies": [
                {
                    "body": "Oh funny, in actuality I wasn't wearing much makeup for that photo but I can definitely see how it'd look that way based on the lighting! I think I'll make the deer one the main one instead.",
                    "author": "Thick_Ad_475",
                    "id": "h2e7hzx",
                    "parent_id": "t1_h2dw8r5",
                    "score": 1,
                    "created_utc": 1624161178.0,
                    "replies": [
                        {
                            "body": "The deer one is super cute! They all are, honestly. I also hope you didn't think I was trying to say something condescending, I just know men can be weird about that sort of thing. Anyways, good luck in the bowl!",
                            "author": "Heartless_Weeknd",
                            "id": "h2e7uo9",
                            "parent_id": "t1_h2e7hzx",
                            "score": 0,
                            "created_utc": 1624161400.0,
                            "replies": [
                                {
                                    "body": "Oh no I didn’t take it in a condescending way at all! Thank you and appreciate the advice :)",
                                    "author": "Thick_Ad_475",
                                    "id": "h2eatoi",
                                    "parent_id": "t1_h2e7uo9",
                                    "score": 1,
                                    "created_utc": 1624163398.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "h2co6gn",
            "parent_id": "t3_o3n1k7",
            "score": 1,
            "created_utc": 1624129721.0,
            "replies": [
                {
                    "body": "Thank you so much! Are stepford wives vibes good or bad?\n\nThe third was in Nara! :)",
                    "author": "Thick_Ad_475",
                    "id": "h2coa2m",
                    "parent_id": "t1_h2co6gn",
                    "score": 3,
                    "created_utc": 1624129776.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "h2cp5lk",
                            "parent_id": "t1_h2coa2m",
                            "score": 4,
                            "created_utc": 1624130247.0,
                            "replies": [
                                {
                                    "body": "Yes, I learned quickly you’re only as valuable as the amount of cookies you have to them haha",
                                    "author": "Thick_Ad_475",
                                    "id": "h2d5vmb",
                                    "parent_id": "t1_h2cp5lk",
                                    "score": 5,
                                    "created_utc": 1624139152.0,
                                    "replies": [
                                        {
                                            "body": "LOL.  Remember that in your film career if you need a scene as a metaphor for the SD/SB dynamic.",
                                            "author": "pedxing1968",
                                            "id": "h2d92p6",
                                            "parent_id": "t1_h2d5vmb",
                                            "score": -1,
                                            "created_utc": 1624140947.0,
                                            "replies": [
                                                {
                                                    "body": "Lol the lesson I gleaned was always carry cookies 🍪😊",
                                                    "author": "Thick_Ad_475",
                                                    "id": "h2ec82m",
                                                    "parent_id": "t1_h2d92p6",
                                                    "score": 1,
                                                    "created_utc": 1624164380.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "You have to treat the males like the cracker shopkeepers do, if they start getting rowdy or line up for a ram you give them a firm slap in between their horns with a flat hand.  They just turn and walk away.",
                                    "author": "storm170",
                                    "id": "h2cpojp",
                                    "parent_id": "t1_h2cp5lk",
                                    "score": 3,
                                    "created_utc": 1624130531.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Good stuff: you’re gorgeous, in shape, seems easygoing, outgoing, multi-faceted, talented,\n\nNot so good stuff: some proofreading, editing/revising of the seeking section is needed. It’s a big paragraph, but it’s only two sentences long. Also mention something to the effect of mutually beneficial would be a good idea.\n\nNice pic in Hong Kong. I would suggest the bikini pic as the main, deer pic, or the one with the white cami.",
            "author": "ExExpectations",
            "id": "h2cspr1",
            "parent_id": "t3_o3n1k7",
            "score": 0,
            "created_utc": 1624132112.0,
            "replies": [
                {
                    "body": "Thanks for the advice! Hong Kong is the best. \n\nIt may not be the smartest move but I think I might go deer pic for the main just because they’ve always felt like kindred spirits haha",
                    "author": "Thick_Ad_475",
                    "id": "h2d5ncs",
                    "parent_id": "t1_h2cspr1",
                    "score": 2,
                    "created_utc": 1624139027.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Nice profile and lovely photos but why should an SD choose you over anyone else ?",
            "author": "Frosty-Surprise-6059",
            "id": "h2df205",
            "parent_id": "t3_o3n1k7",
            "score": -1,
            "created_utc": 1624144334.0,
            "replies": [
                {
                    "body": "Do you mean I need to explicitly say that I’m a caring, kind, enjoyable person? It just feels so gross to write about myself and what I think I provide.",
                    "author": "Thick_Ad_475",
                    "id": "h2dh3cn",
                    "parent_id": "t1_h2df205",
                    "score": 4,
                    "created_utc": 1624145517.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "How did studying painting in college result in you selling your soul? Minor point in an otherwise excellent profile, but I guess it's just curiosity on my part. Your photos are exceptional.",
            "author": "Intrepid_Seeker",
            "id": "h2cpjn9",
            "parent_id": "t3_o3n1k7",
            "score": -4,
            "created_utc": 1624130456.0,
            "replies": [
                {
                    "body": "> How did studying painting in college result in you selling your soul? \n\nShe mentions it directly afterwards: \n\n\"to sell my soul and work as an art director in advertising.\"\n\nArtistry vs Advertising for marketing",
                    "author": "BlueLantern",
                    "id": "h2dz9dv",
                    "parent_id": "t1_h2cpjn9",
                    "score": 4,
                    "created_utc": 1624156280.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Overall a solid profile and you can see how engaged SDs are in providing feedback. So know that this is doing well. Very sharp contrast to some of the other profiles that almost get no engagement from SDs with only SBs throwing all sorts of positive compliments which leaves us SDs thinking hmmm WTF.",
            "author": null,
            "id": "h2d8216",
            "parent_id": "t3_o3n1k7",
            "score": 0,
            "created_utc": 1624140358.0,
            "replies": [
                {
                    "body": "Thank you! Glad to know it's not disastrous haha",
                    "author": "Thick_Ad_475",
                    "id": "h2dv6pa",
                    "parent_id": "t1_h2d8216",
                    "score": 2,
                    "created_utc": 1624153809.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Not a fan of the benefactor, mentorship, and companionship line. It all sounds like a platonic profile. If you’re open to intimacy put something about wanting a mutually beneficial relationship.",
            "author": "Texasguy115",
            "id": "h2cprjq",
            "parent_id": "t3_o3n1k7",
            "score": -1,
            "created_utc": 1624130577.0,
            "replies": [
                {
                    "body": "Great advice, thank you! I guess I was trying to say I was looking for a relationship where there’s genuine care between us but it came out sounding like I’m only asking for things. I wouldn’t have realized it came off as platonic so this is very helpful",
                    "author": "Thick_Ad_475",
                    "id": "h2cxrxr",
                    "parent_id": "t1_h2cprjq",
                    "score": 2,
                    "created_utc": 1624134808.0,
                    "replies": [
                        {
                            "body": "Counterpoint- those statements did not come across as platonic to me.  They would make me more interested actually.",
                            "author": "MrBuzzard",
                            "id": "h2ddmbf",
                            "parent_id": "t1_h2cxrxr",
                            "score": 5,
                            "created_utc": 1624143509.0,
                            "replies": [
                                {
                                    "body": "Ahhh good to know! It was not intended to be a platonic profile, so glad not everyone reads it that way.",
                                    "author": "Thick_Ad_475",
                                    "id": "h2dge8j",
                                    "parent_id": "t1_h2ddmbf",
                                    "score": 2,
                                    "created_utc": 1624145114.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "What site is this?",
            "author": "FrequentTumbleweed00",
            "id": "h2cr0ey",
            "parent_id": "t3_o3n1k7",
            "score": -1,
            "created_utc": 1624131250.0,
            "replies": [
                {
                    "body": "It’s on Seeking",
                    "author": "Thick_Ad_475",
                    "id": "h2czbee",
                    "parent_id": "t1_h2cr0ey",
                    "score": 1,
                    "created_utc": 1624135642.0,
                    "replies": [
                        {
                            "body": "My account keeps getting deleted",
                            "author": "FrequentTumbleweed00",
                            "id": "h2fkwoy",
                            "parent_id": "t1_h2czbee",
                            "score": 1,
                            "created_utc": 1624200029.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Sounds way too much about what can you do for me rather than what you’re offering",
            "author": "bbmg69",
            "id": "h2dvuef",
            "parent_id": "t3_o3n1k7",
            "score": -2,
            "created_utc": 1624154206.0,
            "replies": [
                {
                    "body": "Isn't what I can do for you the same as what I'm offering?",
                    "author": "Thick_Ad_475",
                    "id": "h2e846c",
                    "parent_id": "t1_h2dvuef",
                    "score": 2,
                    "created_utc": 1624161570.0,
                    "replies": [
                        {
                            "body": "Like others have said, it reads as looking for an investment and not a companion. Right off the bat you are seeking a benefactor and leads into funding projects you want to pursue. What is in it for your SD? You don’t need to be graphic but might be a turn off for someone who could help you do these things for you",
                            "author": "bbmg69",
                            "id": "h2e95bs",
                            "parent_id": "t1_h2e846c",
                            "score": 0,
                            "created_utc": 1624162248.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "h2fk5dz",
            "parent_id": "t3_o3n1k7",
            "score": -2,
            "created_utc": 1624199634.0,
            "replies": [
                {
                    "body": "Charlie isn’t just a boys name - it’s short for Charlotte :)\n\nIt means that yes they’re online elsewhere and that yes, people do do reverse image searches to find you. I’m sure maybe you don’t, but it is a very real risk that I just can’t take.\n\nSorry you don’t like my blathering words or photos! They weren’t meant to be coded or coy.",
                    "author": "Thick_Ad_475",
                    "id": "h2foiuk",
                    "parent_id": "t1_h2fk5dz",
                    "score": 1,
                    "created_utc": 1624201922.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Very attractive profile that will attract more successful and intellectual sugar daddies ,\n\nNow you don't say much about the actuall.guy you are seeking , just about what he should give you , \n\nAlso even in NYC ( I live in NYC ).you come off as a high maintenance sugar baby , do you want to be more competitive??  It is really your choice \n\nYour schedule is also not mentioned at all \n\nGood luck",
            "author": "shamloo77",
            "id": "h2csun9",
            "parent_id": "t3_o3n1k7",
            "score": -3,
            "created_utc": 1624132183.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "h2cw3dc",
                    "parent_id": "t1_h2csun9",
                    "score": 9,
                    "created_utc": 1624133915.0,
                    "replies": [
                        {
                            "body": "It definitely was not my intention to come off high maintenance! I think I just felt a little self conscious at first writing what I was looking for in someone, but that seems silly now since saying you’re looking for an empathetic, kind, curious person isn’t a bad thing.",
                            "author": "Thick_Ad_475",
                            "id": "h2cxp0o",
                            "parent_id": "t1_h2cw3dc",
                            "score": 3,
                            "created_utc": 1624134765.0,
                            "replies": []
                        },
                        {
                            "body": "I compare it to similar profiles that I see in SA in NYC;\n\nIt shows long term serious and not small financial/work oriented goals ( again ) compared to others \n\nIt does not have the HAVING SOME FUN WHILE PAYING SOME BILLS casual VIBE that a lot of profiles have ,\n\nNothing wrong with that as long as she knows about her competition out there and is not based on there is a willing multi millionaire sugar daddy on every corner in NYC and there is a shortage of high quality sugar babies in NYC to have some casual dating fun with",
                            "author": "shamloo77",
                            "id": "h2cykxe",
                            "parent_id": "t1_h2cw3dc",
                            "score": -4,
                            "created_utc": 1624135240.0,
                            "replies": [
                                {
                                    "body": "So do you think it’d be better to have a more casual have some fun while paying bills vibe? As in there’s a larger untapped market there? I’m not completely opposed to that but just want those people to be kind, caring people even if it was casual.",
                                    "author": "Thick_Ad_475",
                                    "id": "h2d6le7",
                                    "parent_id": "t1_h2cykxe",
                                    "score": 4,
                                    "created_utc": 1624139540.0,
                                    "replies": [
                                        {
                                            "body": "That would totally depend on your personal preference ,\n\nI don't know how much interest you are getting and much about your views on casual dating etc ,, but if you are new then keep the vibe you have now for 1 or 2 months and if you felt  that it is not happening then make some changes \n\nI see you succeeding either way , one takes longer and can get complicated easily but if it works you get a solid financial future etc and in the other way you be casually dating a guy or guys who are financially supportive and hand over $$$ in a friend/lover dynamic to you \n\nYour choice really , just know your competition well",
                                            "author": "shamloo77",
                                            "id": "h2d7zh1",
                                            "parent_id": "t1_h2d6le7",
                                            "score": -2,
                                            "created_utc": 1624140317.0,
                                            "replies": [
                                                {
                                                    "body": "Very helpful advice, thank you! Either of those situations sound nice to me, since they both involve the kinship/relationship care even if the casualness of them differ. I’m not looking for someone to marry, just want to mean something to someone, even if it is just they enjoy my company casually here and there.",
                                                    "author": "Thick_Ad_475",
                                                    "id": "h2d94vg",
                                                    "parent_id": "t1_h2d7zh1",
                                                    "score": 3,
                                                    "created_utc": 1624140981.0,
                                                    "replies": [
                                                        {
                                                            "body": "You welcome ,",
                                                            "author": "shamloo77",
                                                            "id": "h2d9o6o",
                                                            "parent_id": "t1_h2d94vg",
                                                            "score": 0,
                                                            "created_utc": 1624141279.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Pics\n\n* Out of all your pics, I feel like the deer or beach pics are your best for a main pic. They both have attractive smiles and unique flair. It all depends on the first impression you want to give. Traveler/loves animals vs Flirty/Beach.\n* On the flip side, the buried in pink bears pic adds a fun flavor, but doesn't really add much in showcasing you since you're covered in bears.\n* I'd like to see a full body dressed to the nines pic. All your pics are very casual and I'd like to see the contrasting look. It'll also add to the portfolio since the only full body type pic is taken further away to showcase the cityscape.\n* Otherwise, great job on the pics. A nice variety of settings and unique flavors of you.\n\nText\n\n* Overall I like your about me. It feels uniquely you which is a nice change of pace.\n* \"I enjoy a nice balance of fun and ordering Seamless from my couch.\" This is kind of confusing for me. Are you balancing fun vs ordering food on an app?\n* You might consider adding a short paragraph if travel is important to you since at least 2 of your pics are in other countries.\n* I'd add the Long Term tag to your list.\n* I feel like you could add more to your seeking section. Besides the requirements you laid out, if feels very open ended on what you're actually looking for. That may end up working for you, or not depending on your local market. You might consider adding more details to describe your ideal arrangement. Ideal activities to do together, what you bring to the table/sets you apart from all the other women in your area, etc. Painting a picture for POTs to see themselves giving that to you may help you if the open ended approach doesn't work for you.",
            "author": "BlueLantern",
            "id": "h2e2fwq",
            "parent_id": "t3_o3n1k7",
            "score": 1,
            "created_utc": 1624158199.0,
            "replies": [
                {
                    "body": "This all makes sense, thank you! While I do love to travel, I’ll probably still leave it out just because right now I’m focused on saving for my parents retirement and my career transition.",
                    "author": "Thick_Ad_475",
                    "id": "h2eb40f",
                    "parent_id": "t1_h2e2fwq",
                    "score": 1,
                    "created_utc": 1624163598.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Uh spectacular",
            "author": "Darkside0127",
            "id": "h2e5ijp",
            "parent_id": "t3_o3n1k7",
            "score": 1,
            "created_utc": 1624159976.0,
            "replies": []
        },
        {
            "body": "👍👍👍",
            "author": "proone79",
            "id": "h2e5r9d",
            "parent_id": "t3_o3n1k7",
            "score": 1,
            "created_utc": 1624160112.0,
            "replies": []
        },
        {
            "body": "I don't really have helpful advice but wanted to just compliment you- you're gorgeous!",
            "author": "sugarthrowaway_095",
            "id": "h2e93ku",
            "parent_id": "t3_o3n1k7",
            "score": 1,
            "created_utc": 1624162216.0,
            "replies": [
                {
                    "body": "Thank you so much! I’m so overwhelmed by everyone’s kindness 💜",
                    "author": "Thick_Ad_475",
                    "id": "h2ebpjw",
                    "parent_id": "t1_h2e93ku",
                    "score": 2,
                    "created_utc": 1624164016.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "You’re going to do more than fine.",
            "author": "caloriefather",
            "id": "h2eabmh",
            "parent_id": "t3_o3n1k7",
            "score": 1,
            "created_utc": 1624163050.0,
            "replies": []
        },
        {
            "body": "Very Classy, elegant",
            "author": "Vandontgiveadamn",
            "id": "h2eb7kb",
            "parent_id": "t3_o3n1k7",
            "score": 1,
            "created_utc": 1624163668.0,
            "replies": []
        },
        {
            "body": "Well you are adorable.  If you were local I would hit you up! I like your profile.",
            "author": "Tough-Raisin1514",
            "id": "h2eb96r",
            "parent_id": "t3_o3n1k7",
            "score": 1,
            "created_utc": 1624163699.0,
            "replies": []
        },
        {
            "body": "You are gorgeous!",
            "author": "jetsetdreamer26",
            "id": "h2em1jp",
            "parent_id": "t3_o3n1k7",
            "score": 1,
            "created_utc": 1624172488.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "h2fbvld",
            "parent_id": "t3_o3n1k7",
            "score": 1,
            "created_utc": 1624195089.0,
            "replies": [
                {
                    "body": "Thank you for this sweet encouragement!! 💜",
                    "author": "Thick_Ad_475",
                    "id": "h2fikpc",
                    "parent_id": "t1_h2fbvld",
                    "score": 1,
                    "created_utc": 1624198801.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "These are such helpful recommendations, THANK YOU! Makes complete sense, I will definitely make these updates 🙏🏻",
            "author": "Thick_Ad_475",
            "id": "h2dal8o",
            "parent_id": "t1_h2da3bt",
            "score": 15,
            "created_utc": 1624141787.0,
            "replies": [
                {
                    "body": "I would think I am allotted 4.074 seconds of looking at my photos and limit those to perhaps only 1  that captivate . You are fortunate that one photo says overwhelming good things about you.  If you want to make a lasting impression the   skyline background   and the bathing suit photos simply say dreams come true .  At that point you want to be asking       dude do you measure up to the opportunity ?",
                    "author": "pinotandsugar",
                    "id": "h2ecrd1",
                    "parent_id": "t1_h2dal8o",
                    "score": 3,
                    "created_utc": 1624164765.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "This is interesting - it seems a common piece of advice given on profile reviews here is to trim down the number of photos, but I also see SBs frequently complaining of guys on SA always asking for more pics, haha. The mixed signals 😂",
            "author": "stowawayxthrowaway",
            "id": "h2dfawr",
            "parent_id": "t1_h2da3bt",
            "score": 7,
            "created_utc": 1624144480.0,
            "replies": []
        },
        {
            "body": "Thank you so much for taking the time to write this! So helpful and a great reminder that good things take time. I really appreciate it. \n\nEdit: Wheat timbs for life ✊🏻",
            "author": "Thick_Ad_475",
            "id": "h2czsfm",
            "parent_id": "t1_h2ctr1a",
            "score": 9,
            "created_utc": 1624135896.0,
            "replies": []
        },
        {
            "body": "That makes a lot of sense - I know I tend to give baby lamb vibes in general no matter what so I’m sure some of the photos aren’t helping haha. I did have trouble finding photos that weren’t already used on the internet somewhere and just as a layer of protection wanted to keep them completely new in that regard, so know they definitely not be ideal.\n\nFor now hopefully someone can imagine if they like what they see in gingham they’ll like what they see in a nice gown but will definitely try to take a new nice dressed up or bikini photo to add sometime soon! Do you think this will really be a huge hinderance or something that could wait a week or so until I get the chance?",
            "author": "Thick_Ad_475",
            "id": "h2fjt62",
            "parent_id": "t1_h2f5bfn",
            "score": 5,
            "created_utc": 1624199461.0,
            "replies": []
        },
        {
            "body": "Thank you so much! This was such a kind comment and I really appreciate it, fellow New Yorker. 💜",
            "author": "Thick_Ad_475",
            "id": "h2e7cob",
            "parent_id": "t1_h2e1qpi",
            "score": 3,
            "created_utc": 1624161083.0,
            "replies": []
        },
        {
            "body": "Thank you so much! That means a lot 🥲",
            "author": "Thick_Ad_475",
            "id": "h2cxdsl",
            "parent_id": "t1_h2cvzxh",
            "score": 3,
            "created_utc": 1624134599.0,
            "replies": []
        },
        {
            "body": "Oh no I’m not sure if this is a compliment or critique!! If compliment thank you so much (😭) and if critique should I add in some less flattering photos?",
            "author": "Thick_Ad_475",
            "id": "h2cmg7v",
            "parent_id": "t1_h2cmayh",
            "score": 6,
            "created_utc": 1624128796.0,
            "replies": [
                {
                    "body": "Compliment 🤍",
                    "author": null,
                    "id": "h2dcv4u",
                    "parent_id": "t1_h2cmg7v",
                    "score": 3,
                    "created_utc": 1624143079.0,
                    "replies": [
                        {
                            "body": "Thank you!! You are also gorgeous 💜",
                            "author": "Thick_Ad_475",
                            "id": "h2dgpcx",
                            "parent_id": "t1_h2dcv4u",
                            "score": 2,
                            "created_utc": 1624145291.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "It’s up to the SD to verify you’re real. Videoconferencing does the trick.",
                    "author": "chairman212121",
                    "id": "h2cs92o",
                    "parent_id": "t1_h2cmg7v",
                    "score": 1,
                    "created_utc": 1624131883.0,
                    "replies": [
                        {
                            "body": "I heard SD don’t like videoconferencing or was that bad advice",
                            "author": "Rommababy",
                            "id": "h2dpz0x",
                            "parent_id": "t1_h2cs92o",
                            "score": 1,
                            "created_utc": 1624150694.0,
                            "replies": [
                                {
                                    "body": "married SD dont like them, a lot of us single / divorced guys dont mind, because it gives us a chance to make sure she looks like her photos, and it also allows you to connect better then just a call",
                                    "author": null,
                                    "id": "h2f8ka4",
                                    "parent_id": "t1_h2dpz0x",
                                    "score": 3,
                                    "created_utc": 1624193043.0,
                                    "replies": []
                                },
                                {
                                    "body": "I wouldn’t know as I don’t date them! General consensus amongst SBs please…",
                                    "author": "chairman212121",
                                    "id": "h2e4a38",
                                    "parent_id": "t1_h2dpz0x",
                                    "score": -1,
                                    "created_utc": 1624159285.0,
                                    "replies": [
                                        {
                                            "body": "After the first ten or so messages I always ask if they'd like to arrange a video chat to see how we get on face to face. It's primarily for safety, but even if not for that reason I'd still do it, as it avoids those awful first meets where one or both of you know it's a no within minutes but you have to sit politely through the date anyway. Lots of guys I've spoken to hadn't done video calls before a M&G before, but none were unhappy to do it.",
                                            "author": "assinoroyale",
                                            "id": "h2f4c9i",
                                            "parent_id": "t1_h2e4a38",
                                            "score": 6,
                                            "created_utc": 1624189811.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "In my very limited experience of a day only one has not wanted to but quite a few brought it up themselves 🤷🏼‍♀️",
                                            "author": "Thick_Ad_475",
                                            "id": "h2eayj5",
                                            "parent_id": "t1_h2e4a38",
                                            "score": 4,
                                            "created_utc": 1624163492.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "If a guy asks me to video chat before we meet I typically stop responding. It’s a time waster/pic collector tactic the majority of the time. I simply say-\n\n“If you are eager to see me let’s move the meet and greet up:)”",
                                            "author": "MsDReid",
                                            "id": "h2eg78z",
                                            "parent_id": "t1_h2e4a38",
                                            "score": 5,
                                            "created_utc": 1624167409.0,
                                            "replies": [
                                                {
                                                    "body": "But wouldn’t you want to check the guy in the pics is the guy in the video? Seems like a normal person etc?",
                                                    "author": "chairman212121",
                                                    "id": "h2ex0m6",
                                                    "parent_id": "t1_h2eg78z",
                                                    "score": 1,
                                                    "created_utc": 1624183194.0,
                                                    "replies": [
                                                        {
                                                            "body": "No. That can all be done in public in person. Which if a man isn’t scheduling a meet to happen within the first 3-5 days of texting I concentrate on other connections. I’ll send a lighthearted “message me when you have free time to meet” and leave it at that. But most of the time the men asking for pics/video calls/putting off meeting are scammers. \n\nAdditionally I’m not giving someone my real number. But even if I could do it without doing so. No. Never. And if a guy asks and then doesn’t respond favorably to my text about a meet and greet…bye🤷‍♀️",
                                                            "author": "MsDReid",
                                                            "id": "h2exla1",
                                                            "parent_id": "t1_h2ex0m6",
                                                            "score": 4,
                                                            "created_utc": 1624183750.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Sounds like S’ing over there is way worse, more dangerous than here in Southern Europe. No SB would be that cautious with me.",
                                                                    "author": "chairman212121",
                                                                    "id": "h2ezq0b",
                                                                    "parent_id": "t1_h2exla1",
                                                                    "score": 3,
                                                                    "created_utc": 1624185764.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "that's because she's coming from the sex work world, and just being a normal woman that becomes a sugar baby. Sex workers have different protocols, especially here in the US.",
                                                                            "author": null,
                                                                            "id": "h2f8pr2",
                                                                            "parent_id": "t1_h2ezq0b",
                                                                            "score": 1,
                                                                            "created_utc": 1624193147.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "Aaahhhhhhhh. Explains everything.",
                                                                                    "author": "chairman212121",
                                                                                    "id": "h2fi18r",
                                                                                    "parent_id": "t1_h2f8pr2",
                                                                                    "score": 1,
                                                                                    "created_utc": 1624198508.0,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Thank you so much 💜",
            "author": "Thick_Ad_475",
            "id": "h2fkilv",
            "parent_id": "t1_h2f39e5",
            "score": 2,
            "created_utc": 1624199821.0,
            "replies": []
        },
        {
            "body": "Oh that’s a good tweak, I’ll change it to “regular allowance” thank you!\n\nI did investor because I’d love to find someone who could mentor me in my career (I’m not a great negotiator or good at selling myself etc) but if it’s an odd one no one uses I’ll definitely take it off!\n\nI didn’t intend for it to come across as platonic. Is there anything you suggest I should add to make it seem less so?",
            "author": "Thick_Ad_475",
            "id": "h2cmwpu",
            "parent_id": "t1_h2cmhcr",
            "score": 6,
            "created_utc": 1624129043.0,
            "replies": [
                {
                    "body": "> who could mentor me in my career (I’m not a great negotiator or good at selling myself etc)\n\nYeah, I'd say bring this up with a guy after you've been chatting for a bit. Most people are happy to provide their opinions. (And best to avoid putting it on the profile as it might encourage people to take advantage of you.)\n\n> Is there anything you suggest I should add to make it seem less so?\n\nSomething as simple as adding \"and intimacy\" to \"While the mentorship and companionship are just as important\" can do the trick :)\n\nI agree with Thin-Resolution832, you'll do fine :)\n\nEdit: LeoFrenchGuy brings up a good point, it might help to add more on why an SD should pick you over the competition / why you're an amazing SB.",
                    "author": "SeattleLaserMeteor",
                    "id": "h2cnnb7",
                    "parent_id": "t1_h2cmwpu",
                    "score": 3,
                    "created_utc": 1624129437.0,
                    "replies": [
                        {
                            "body": "All super helpful, thank you very much! You’re both definitely right I could work on the part of why an SD should pick me, I just feel so gross talking about myself 🤦🏼‍♀️Will try to view it as good practice selling myself!",
                            "author": "Thick_Ad_475",
                            "id": "h2coqgs",
                            "parent_id": "t1_h2cnnb7",
                            "score": 3,
                            "created_utc": 1624130020.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": ">I did investor because I’d love to find someone who could mentor me in my career\n\nThen choose the mentorship tag. The investor tag is usually used by women that are looking for someone to help fund their business ventures, which most SD are kind of turned off by, because thats not the purpose of the site.",
                    "author": null,
                    "id": "h2f8u9v",
                    "parent_id": "t1_h2cmwpu",
                    "score": 2,
                    "created_utc": 1624193235.0,
                    "replies": [
                        {
                            "body": "AHH thank you SO much for this very helpful info! Taking it off 🙏🏻",
                            "author": "Thick_Ad_475",
                            "id": "h2fk0qi",
                            "parent_id": "t1_h2f8u9v",
                            "score": 1,
                            "created_utc": 1624199568.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "There is no kind of any sugar gain for a SD",
                    "author": "LeoFrenchGuy",
                    "id": "h2cnhks",
                    "parent_id": "t1_h2cmwpu",
                    "score": 1,
                    "created_utc": 1624129353.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I actually found the pictures very appealing but very much agree with the investor tag.",
            "author": null,
            "id": "h2d7f32",
            "parent_id": "t1_h2cmhcr",
            "score": 1,
            "created_utc": 1624140002.0,
            "replies": [
                {
                    "body": "Thank you! Took off the investor tag, good to know that was a mistake haha",
                    "author": "Thick_Ad_475",
                    "id": "h2dg8vv",
                    "parent_id": "t1_h2d7f32",
                    "score": 2,
                    "created_utc": 1624145028.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "A lot of SDs offer mentorship in their profiles.",
            "author": "chairman212121",
            "id": "h2crtvw",
            "parent_id": "t1_h2cmhcr",
            "score": 0,
            "created_utc": 1624131676.0,
            "replies": []
        },
        {
            "body": "Oh man thank you 😭",
            "author": "Thick_Ad_475",
            "id": "h2eb64r",
            "parent_id": "t1_h2e315p",
            "score": 1,
            "created_utc": 1624163639.0,
            "replies": []
        },
        {
            "body": "Do you mean I should be explicit about being a caring, fun, loyal person? It just feels so awful speaking explicitly about what I believe I offer. I’d rather show than tell, but understand that could be tricky in this format. What are examples of ways people have said what they have to offer that you’ve liked?",
            "author": "Thick_Ad_475",
            "id": "h2djd8i",
            "parent_id": "t1_h2cv6xz",
            "score": 6,
            "created_utc": 1624146848.0,
            "replies": [
                {
                    "body": "It’s a good profile, don’t get me wrong.  I probably sound nit picky.\n\nIt’s hard to explain but what seems to be missing is a focus on your SD.  You could say “I am better at showing affection than explaining it!”",
                    "author": "throwawayrdu71",
                    "id": "h2dos8a",
                    "parent_id": "t1_h2djd8i",
                    "score": 1,
                    "created_utc": 1624150001.0,
                    "replies": [
                        {
                            "body": "That makes sense, thank you so much!  Not nitpicky at all",
                            "author": "Thick_Ad_475",
                            "id": "h2dv2r7",
                            "parent_id": "t1_h2dos8a",
                            "score": 3,
                            "created_utc": 1624153742.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "the overall profile is great, part of your value proposition should highlight on the value you bring to the relationship and what the SD brings as well. men are more literal and visual creatures",
                    "author": "Rich_Wishbone",
                    "id": "h2ecwbh",
                    "parent_id": "t1_h2djd8i",
                    "score": 0,
                    "created_utc": 1624164866.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Thank you so much 😊",
            "author": "Thick_Ad_475",
            "id": "h2diwuw",
            "parent_id": "t1_h2ddn81",
            "score": 1,
            "created_utc": 1624146579.0,
            "replies": []
        },
        {
            "body": "Oh funny, in actuality I wasn't wearing much makeup for that photo but I can definitely see how it'd look that way based on the lighting! I think I'll make the deer one the main one instead.",
            "author": "Thick_Ad_475",
            "id": "h2e7hzx",
            "parent_id": "t1_h2dw8r5",
            "score": 1,
            "created_utc": 1624161178.0,
            "replies": [
                {
                    "body": "The deer one is super cute! They all are, honestly. I also hope you didn't think I was trying to say something condescending, I just know men can be weird about that sort of thing. Anyways, good luck in the bowl!",
                    "author": "Heartless_Weeknd",
                    "id": "h2e7uo9",
                    "parent_id": "t1_h2e7hzx",
                    "score": 0,
                    "created_utc": 1624161400.0,
                    "replies": [
                        {
                            "body": "Oh no I didn’t take it in a condescending way at all! Thank you and appreciate the advice :)",
                            "author": "Thick_Ad_475",
                            "id": "h2eatoi",
                            "parent_id": "t1_h2e7uo9",
                            "score": 1,
                            "created_utc": 1624163398.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Thank you so much! Are stepford wives vibes good or bad?\n\nThe third was in Nara! :)",
            "author": "Thick_Ad_475",
            "id": "h2coa2m",
            "parent_id": "t1_h2co6gn",
            "score": 3,
            "created_utc": 1624129776.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "h2cp5lk",
                    "parent_id": "t1_h2coa2m",
                    "score": 4,
                    "created_utc": 1624130247.0,
                    "replies": [
                        {
                            "body": "Yes, I learned quickly you’re only as valuable as the amount of cookies you have to them haha",
                            "author": "Thick_Ad_475",
                            "id": "h2d5vmb",
                            "parent_id": "t1_h2cp5lk",
                            "score": 5,
                            "created_utc": 1624139152.0,
                            "replies": [
                                {
                                    "body": "LOL.  Remember that in your film career if you need a scene as a metaphor for the SD/SB dynamic.",
                                    "author": "pedxing1968",
                                    "id": "h2d92p6",
                                    "parent_id": "t1_h2d5vmb",
                                    "score": -1,
                                    "created_utc": 1624140947.0,
                                    "replies": [
                                        {
                                            "body": "Lol the lesson I gleaned was always carry cookies 🍪😊",
                                            "author": "Thick_Ad_475",
                                            "id": "h2ec82m",
                                            "parent_id": "t1_h2d92p6",
                                            "score": 1,
                                            "created_utc": 1624164380.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "You have to treat the males like the cracker shopkeepers do, if they start getting rowdy or line up for a ram you give them a firm slap in between their horns with a flat hand.  They just turn and walk away.",
                            "author": "storm170",
                            "id": "h2cpojp",
                            "parent_id": "t1_h2cp5lk",
                            "score": 3,
                            "created_utc": 1624130531.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Thanks for the advice! Hong Kong is the best. \n\nIt may not be the smartest move but I think I might go deer pic for the main just because they’ve always felt like kindred spirits haha",
            "author": "Thick_Ad_475",
            "id": "h2d5ncs",
            "parent_id": "t1_h2cspr1",
            "score": 2,
            "created_utc": 1624139027.0,
            "replies": []
        },
        {
            "body": "Do you mean I need to explicitly say that I’m a caring, kind, enjoyable person? It just feels so gross to write about myself and what I think I provide.",
            "author": "Thick_Ad_475",
            "id": "h2dh3cn",
            "parent_id": "t1_h2df205",
            "score": 4,
            "created_utc": 1624145517.0,
            "replies": []
        },
        {
            "body": "> How did studying painting in college result in you selling your soul? \n\nShe mentions it directly afterwards: \n\n\"to sell my soul and work as an art director in advertising.\"\n\nArtistry vs Advertising for marketing",
            "author": "BlueLantern",
            "id": "h2dz9dv",
            "parent_id": "t1_h2cpjn9",
            "score": 4,
            "created_utc": 1624156280.0,
            "replies": []
        },
        {
            "body": "Thank you! Glad to know it's not disastrous haha",
            "author": "Thick_Ad_475",
            "id": "h2dv6pa",
            "parent_id": "t1_h2d8216",
            "score": 2,
            "created_utc": 1624153809.0,
            "replies": []
        },
        {
            "body": "Great advice, thank you! I guess I was trying to say I was looking for a relationship where there’s genuine care between us but it came out sounding like I’m only asking for things. I wouldn’t have realized it came off as platonic so this is very helpful",
            "author": "Thick_Ad_475",
            "id": "h2cxrxr",
            "parent_id": "t1_h2cprjq",
            "score": 2,
            "created_utc": 1624134808.0,
            "replies": [
                {
                    "body": "Counterpoint- those statements did not come across as platonic to me.  They would make me more interested actually.",
                    "author": "MrBuzzard",
                    "id": "h2ddmbf",
                    "parent_id": "t1_h2cxrxr",
                    "score": 5,
                    "created_utc": 1624143509.0,
                    "replies": [
                        {
                            "body": "Ahhh good to know! It was not intended to be a platonic profile, so glad not everyone reads it that way.",
                            "author": "Thick_Ad_475",
                            "id": "h2dge8j",
                            "parent_id": "t1_h2ddmbf",
                            "score": 2,
                            "created_utc": 1624145114.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "It’s on Seeking",
            "author": "Thick_Ad_475",
            "id": "h2czbee",
            "parent_id": "t1_h2cr0ey",
            "score": 1,
            "created_utc": 1624135642.0,
            "replies": [
                {
                    "body": "My account keeps getting deleted",
                    "author": "FrequentTumbleweed00",
                    "id": "h2fkwoy",
                    "parent_id": "t1_h2czbee",
                    "score": 1,
                    "created_utc": 1624200029.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Isn't what I can do for you the same as what I'm offering?",
            "author": "Thick_Ad_475",
            "id": "h2e846c",
            "parent_id": "t1_h2dvuef",
            "score": 2,
            "created_utc": 1624161570.0,
            "replies": [
                {
                    "body": "Like others have said, it reads as looking for an investment and not a companion. Right off the bat you are seeking a benefactor and leads into funding projects you want to pursue. What is in it for your SD? You don’t need to be graphic but might be a turn off for someone who could help you do these things for you",
                    "author": "bbmg69",
                    "id": "h2e95bs",
                    "parent_id": "t1_h2e846c",
                    "score": 0,
                    "created_utc": 1624162248.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Charlie isn’t just a boys name - it’s short for Charlotte :)\n\nIt means that yes they’re online elsewhere and that yes, people do do reverse image searches to find you. I’m sure maybe you don’t, but it is a very real risk that I just can’t take.\n\nSorry you don’t like my blathering words or photos! They weren’t meant to be coded or coy.",
            "author": "Thick_Ad_475",
            "id": "h2foiuk",
            "parent_id": "t1_h2fk5dz",
            "score": 1,
            "created_utc": 1624201922.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "h2cw3dc",
            "parent_id": "t1_h2csun9",
            "score": 9,
            "created_utc": 1624133915.0,
            "replies": [
                {
                    "body": "It definitely was not my intention to come off high maintenance! I think I just felt a little self conscious at first writing what I was looking for in someone, but that seems silly now since saying you’re looking for an empathetic, kind, curious person isn’t a bad thing.",
                    "author": "Thick_Ad_475",
                    "id": "h2cxp0o",
                    "parent_id": "t1_h2cw3dc",
                    "score": 3,
                    "created_utc": 1624134765.0,
                    "replies": []
                },
                {
                    "body": "I compare it to similar profiles that I see in SA in NYC;\n\nIt shows long term serious and not small financial/work oriented goals ( again ) compared to others \n\nIt does not have the HAVING SOME FUN WHILE PAYING SOME BILLS casual VIBE that a lot of profiles have ,\n\nNothing wrong with that as long as she knows about her competition out there and is not based on there is a willing multi millionaire sugar daddy on every corner in NYC and there is a shortage of high quality sugar babies in NYC to have some casual dating fun with",
                    "author": "shamloo77",
                    "id": "h2cykxe",
                    "parent_id": "t1_h2cw3dc",
                    "score": -4,
                    "created_utc": 1624135240.0,
                    "replies": [
                        {
                            "body": "So do you think it’d be better to have a more casual have some fun while paying bills vibe? As in there’s a larger untapped market there? I’m not completely opposed to that but just want those people to be kind, caring people even if it was casual.",
                            "author": "Thick_Ad_475",
                            "id": "h2d6le7",
                            "parent_id": "t1_h2cykxe",
                            "score": 4,
                            "created_utc": 1624139540.0,
                            "replies": [
                                {
                                    "body": "That would totally depend on your personal preference ,\n\nI don't know how much interest you are getting and much about your views on casual dating etc ,, but if you are new then keep the vibe you have now for 1 or 2 months and if you felt  that it is not happening then make some changes \n\nI see you succeeding either way , one takes longer and can get complicated easily but if it works you get a solid financial future etc and in the other way you be casually dating a guy or guys who are financially supportive and hand over $$$ in a friend/lover dynamic to you \n\nYour choice really , just know your competition well",
                                    "author": "shamloo77",
                                    "id": "h2d7zh1",
                                    "parent_id": "t1_h2d6le7",
                                    "score": -2,
                                    "created_utc": 1624140317.0,
                                    "replies": [
                                        {
                                            "body": "Very helpful advice, thank you! Either of those situations sound nice to me, since they both involve the kinship/relationship care even if the casualness of them differ. I’m not looking for someone to marry, just want to mean something to someone, even if it is just they enjoy my company casually here and there.",
                                            "author": "Thick_Ad_475",
                                            "id": "h2d94vg",
                                            "parent_id": "t1_h2d7zh1",
                                            "score": 3,
                                            "created_utc": 1624140981.0,
                                            "replies": [
                                                {
                                                    "body": "You welcome ,",
                                                    "author": "shamloo77",
                                                    "id": "h2d9o6o",
                                                    "parent_id": "t1_h2d94vg",
                                                    "score": 0,
                                                    "created_utc": 1624141279.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "This all makes sense, thank you! While I do love to travel, I’ll probably still leave it out just because right now I’m focused on saving for my parents retirement and my career transition.",
            "author": "Thick_Ad_475",
            "id": "h2eb40f",
            "parent_id": "t1_h2e2fwq",
            "score": 1,
            "created_utc": 1624163598.0,
            "replies": []
        },
        {
            "body": "Thank you so much! I’m so overwhelmed by everyone’s kindness 💜",
            "author": "Thick_Ad_475",
            "id": "h2ebpjw",
            "parent_id": "t1_h2e93ku",
            "score": 2,
            "created_utc": 1624164016.0,
            "replies": []
        },
        {
            "body": "Thank you for this sweet encouragement!! 💜",
            "author": "Thick_Ad_475",
            "id": "h2fikpc",
            "parent_id": "t1_h2fbvld",
            "score": 1,
            "created_utc": 1624198801.0,
            "replies": []
        },
        {
            "body": "I would think I am allotted 4.074 seconds of looking at my photos and limit those to perhaps only 1  that captivate . You are fortunate that one photo says overwhelming good things about you.  If you want to make a lasting impression the   skyline background   and the bathing suit photos simply say dreams come true .  At that point you want to be asking       dude do you measure up to the opportunity ?",
            "author": "pinotandsugar",
            "id": "h2ecrd1",
            "parent_id": "t1_h2dal8o",
            "score": 3,
            "created_utc": 1624164765.0,
            "replies": []
        },
        {
            "body": "Compliment 🤍",
            "author": null,
            "id": "h2dcv4u",
            "parent_id": "t1_h2cmg7v",
            "score": 3,
            "created_utc": 1624143079.0,
            "replies": [
                {
                    "body": "Thank you!! You are also gorgeous 💜",
                    "author": "Thick_Ad_475",
                    "id": "h2dgpcx",
                    "parent_id": "t1_h2dcv4u",
                    "score": 2,
                    "created_utc": 1624145291.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "It’s up to the SD to verify you’re real. Videoconferencing does the trick.",
            "author": "chairman212121",
            "id": "h2cs92o",
            "parent_id": "t1_h2cmg7v",
            "score": 1,
            "created_utc": 1624131883.0,
            "replies": [
                {
                    "body": "I heard SD don’t like videoconferencing or was that bad advice",
                    "author": "Rommababy",
                    "id": "h2dpz0x",
                    "parent_id": "t1_h2cs92o",
                    "score": 1,
                    "created_utc": 1624150694.0,
                    "replies": [
                        {
                            "body": "married SD dont like them, a lot of us single / divorced guys dont mind, because it gives us a chance to make sure she looks like her photos, and it also allows you to connect better then just a call",
                            "author": null,
                            "id": "h2f8ka4",
                            "parent_id": "t1_h2dpz0x",
                            "score": 3,
                            "created_utc": 1624193043.0,
                            "replies": []
                        },
                        {
                            "body": "I wouldn’t know as I don’t date them! General consensus amongst SBs please…",
                            "author": "chairman212121",
                            "id": "h2e4a38",
                            "parent_id": "t1_h2dpz0x",
                            "score": -1,
                            "created_utc": 1624159285.0,
                            "replies": [
                                {
                                    "body": "After the first ten or so messages I always ask if they'd like to arrange a video chat to see how we get on face to face. It's primarily for safety, but even if not for that reason I'd still do it, as it avoids those awful first meets where one or both of you know it's a no within minutes but you have to sit politely through the date anyway. Lots of guys I've spoken to hadn't done video calls before a M&G before, but none were unhappy to do it.",
                                    "author": "assinoroyale",
                                    "id": "h2f4c9i",
                                    "parent_id": "t1_h2e4a38",
                                    "score": 6,
                                    "created_utc": 1624189811.0,
                                    "replies": []
                                },
                                {
                                    "body": "In my very limited experience of a day only one has not wanted to but quite a few brought it up themselves 🤷🏼‍♀️",
                                    "author": "Thick_Ad_475",
                                    "id": "h2eayj5",
                                    "parent_id": "t1_h2e4a38",
                                    "score": 4,
                                    "created_utc": 1624163492.0,
                                    "replies": []
                                },
                                {
                                    "body": "If a guy asks me to video chat before we meet I typically stop responding. It’s a time waster/pic collector tactic the majority of the time. I simply say-\n\n“If you are eager to see me let’s move the meet and greet up:)”",
                                    "author": "MsDReid",
                                    "id": "h2eg78z",
                                    "parent_id": "t1_h2e4a38",
                                    "score": 5,
                                    "created_utc": 1624167409.0,
                                    "replies": [
                                        {
                                            "body": "But wouldn’t you want to check the guy in the pics is the guy in the video? Seems like a normal person etc?",
                                            "author": "chairman212121",
                                            "id": "h2ex0m6",
                                            "parent_id": "t1_h2eg78z",
                                            "score": 1,
                                            "created_utc": 1624183194.0,
                                            "replies": [
                                                {
                                                    "body": "No. That can all be done in public in person. Which if a man isn’t scheduling a meet to happen within the first 3-5 days of texting I concentrate on other connections. I’ll send a lighthearted “message me when you have free time to meet” and leave it at that. But most of the time the men asking for pics/video calls/putting off meeting are scammers. \n\nAdditionally I’m not giving someone my real number. But even if I could do it without doing so. No. Never. And if a guy asks and then doesn’t respond favorably to my text about a meet and greet…bye🤷‍♀️",
                                                    "author": "MsDReid",
                                                    "id": "h2exla1",
                                                    "parent_id": "t1_h2ex0m6",
                                                    "score": 4,
                                                    "created_utc": 1624183750.0,
                                                    "replies": [
                                                        {
                                                            "body": "Sounds like S’ing over there is way worse, more dangerous than here in Southern Europe. No SB would be that cautious with me.",
                                                            "author": "chairman212121",
                                                            "id": "h2ezq0b",
                                                            "parent_id": "t1_h2exla1",
                                                            "score": 3,
                                                            "created_utc": 1624185764.0,
                                                            "replies": [
                                                                {
                                                                    "body": "that's because she's coming from the sex work world, and just being a normal woman that becomes a sugar baby. Sex workers have different protocols, especially here in the US.",
                                                                    "author": null,
                                                                    "id": "h2f8pr2",
                                                                    "parent_id": "t1_h2ezq0b",
                                                                    "score": 1,
                                                                    "created_utc": 1624193147.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "Aaahhhhhhhh. Explains everything.",
                                                                            "author": "chairman212121",
                                                                            "id": "h2fi18r",
                                                                            "parent_id": "t1_h2f8pr2",
                                                                            "score": 1,
                                                                            "created_utc": 1624198508.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "> who could mentor me in my career (I’m not a great negotiator or good at selling myself etc)\n\nYeah, I'd say bring this up with a guy after you've been chatting for a bit. Most people are happy to provide their opinions. (And best to avoid putting it on the profile as it might encourage people to take advantage of you.)\n\n> Is there anything you suggest I should add to make it seem less so?\n\nSomething as simple as adding \"and intimacy\" to \"While the mentorship and companionship are just as important\" can do the trick :)\n\nI agree with Thin-Resolution832, you'll do fine :)\n\nEdit: LeoFrenchGuy brings up a good point, it might help to add more on why an SD should pick you over the competition / why you're an amazing SB.",
            "author": "SeattleLaserMeteor",
            "id": "h2cnnb7",
            "parent_id": "t1_h2cmwpu",
            "score": 3,
            "created_utc": 1624129437.0,
            "replies": [
                {
                    "body": "All super helpful, thank you very much! You’re both definitely right I could work on the part of why an SD should pick me, I just feel so gross talking about myself 🤦🏼‍♀️Will try to view it as good practice selling myself!",
                    "author": "Thick_Ad_475",
                    "id": "h2coqgs",
                    "parent_id": "t1_h2cnnb7",
                    "score": 3,
                    "created_utc": 1624130020.0,
                    "replies": []
                }
            ]
        },
        {
            "body": ">I did investor because I’d love to find someone who could mentor me in my career\n\nThen choose the mentorship tag. The investor tag is usually used by women that are looking for someone to help fund their business ventures, which most SD are kind of turned off by, because thats not the purpose of the site.",
            "author": null,
            "id": "h2f8u9v",
            "parent_id": "t1_h2cmwpu",
            "score": 2,
            "created_utc": 1624193235.0,
            "replies": [
                {
                    "body": "AHH thank you SO much for this very helpful info! Taking it off 🙏🏻",
                    "author": "Thick_Ad_475",
                    "id": "h2fk0qi",
                    "parent_id": "t1_h2f8u9v",
                    "score": 1,
                    "created_utc": 1624199568.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "There is no kind of any sugar gain for a SD",
            "author": "LeoFrenchGuy",
            "id": "h2cnhks",
            "parent_id": "t1_h2cmwpu",
            "score": 1,
            "created_utc": 1624129353.0,
            "replies": []
        },
        {
            "body": "Thank you! Took off the investor tag, good to know that was a mistake haha",
            "author": "Thick_Ad_475",
            "id": "h2dg8vv",
            "parent_id": "t1_h2d7f32",
            "score": 2,
            "created_utc": 1624145028.0,
            "replies": []
        },
        {
            "body": "It’s a good profile, don’t get me wrong.  I probably sound nit picky.\n\nIt’s hard to explain but what seems to be missing is a focus on your SD.  You could say “I am better at showing affection than explaining it!”",
            "author": "throwawayrdu71",
            "id": "h2dos8a",
            "parent_id": "t1_h2djd8i",
            "score": 1,
            "created_utc": 1624150001.0,
            "replies": [
                {
                    "body": "That makes sense, thank you so much!  Not nitpicky at all",
                    "author": "Thick_Ad_475",
                    "id": "h2dv2r7",
                    "parent_id": "t1_h2dos8a",
                    "score": 3,
                    "created_utc": 1624153742.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "the overall profile is great, part of your value proposition should highlight on the value you bring to the relationship and what the SD brings as well. men are more literal and visual creatures",
            "author": "Rich_Wishbone",
            "id": "h2ecwbh",
            "parent_id": "t1_h2djd8i",
            "score": 0,
            "created_utc": 1624164866.0,
            "replies": []
        },
        {
            "body": "The deer one is super cute! They all are, honestly. I also hope you didn't think I was trying to say something condescending, I just know men can be weird about that sort of thing. Anyways, good luck in the bowl!",
            "author": "Heartless_Weeknd",
            "id": "h2e7uo9",
            "parent_id": "t1_h2e7hzx",
            "score": 0,
            "created_utc": 1624161400.0,
            "replies": [
                {
                    "body": "Oh no I didn’t take it in a condescending way at all! Thank you and appreciate the advice :)",
                    "author": "Thick_Ad_475",
                    "id": "h2eatoi",
                    "parent_id": "t1_h2e7uo9",
                    "score": 1,
                    "created_utc": 1624163398.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "h2cp5lk",
            "parent_id": "t1_h2coa2m",
            "score": 4,
            "created_utc": 1624130247.0,
            "replies": [
                {
                    "body": "Yes, I learned quickly you’re only as valuable as the amount of cookies you have to them haha",
                    "author": "Thick_Ad_475",
                    "id": "h2d5vmb",
                    "parent_id": "t1_h2cp5lk",
                    "score": 5,
                    "created_utc": 1624139152.0,
                    "replies": [
                        {
                            "body": "LOL.  Remember that in your film career if you need a scene as a metaphor for the SD/SB dynamic.",
                            "author": "pedxing1968",
                            "id": "h2d92p6",
                            "parent_id": "t1_h2d5vmb",
                            "score": -1,
                            "created_utc": 1624140947.0,
                            "replies": [
                                {
                                    "body": "Lol the lesson I gleaned was always carry cookies 🍪😊",
                                    "author": "Thick_Ad_475",
                                    "id": "h2ec82m",
                                    "parent_id": "t1_h2d92p6",
                                    "score": 1,
                                    "created_utc": 1624164380.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "You have to treat the males like the cracker shopkeepers do, if they start getting rowdy or line up for a ram you give them a firm slap in between their horns with a flat hand.  They just turn and walk away.",
                    "author": "storm170",
                    "id": "h2cpojp",
                    "parent_id": "t1_h2cp5lk",
                    "score": 3,
                    "created_utc": 1624130531.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Counterpoint- those statements did not come across as platonic to me.  They would make me more interested actually.",
            "author": "MrBuzzard",
            "id": "h2ddmbf",
            "parent_id": "t1_h2cxrxr",
            "score": 5,
            "created_utc": 1624143509.0,
            "replies": [
                {
                    "body": "Ahhh good to know! It was not intended to be a platonic profile, so glad not everyone reads it that way.",
                    "author": "Thick_Ad_475",
                    "id": "h2dge8j",
                    "parent_id": "t1_h2ddmbf",
                    "score": 2,
                    "created_utc": 1624145114.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "My account keeps getting deleted",
            "author": "FrequentTumbleweed00",
            "id": "h2fkwoy",
            "parent_id": "t1_h2czbee",
            "score": 1,
            "created_utc": 1624200029.0,
            "replies": []
        },
        {
            "body": "Like others have said, it reads as looking for an investment and not a companion. Right off the bat you are seeking a benefactor and leads into funding projects you want to pursue. What is in it for your SD? You don’t need to be graphic but might be a turn off for someone who could help you do these things for you",
            "author": "bbmg69",
            "id": "h2e95bs",
            "parent_id": "t1_h2e846c",
            "score": 0,
            "created_utc": 1624162248.0,
            "replies": []
        },
        {
            "body": "It definitely was not my intention to come off high maintenance! I think I just felt a little self conscious at first writing what I was looking for in someone, but that seems silly now since saying you’re looking for an empathetic, kind, curious person isn’t a bad thing.",
            "author": "Thick_Ad_475",
            "id": "h2cxp0o",
            "parent_id": "t1_h2cw3dc",
            "score": 3,
            "created_utc": 1624134765.0,
            "replies": []
        },
        {
            "body": "I compare it to similar profiles that I see in SA in NYC;\n\nIt shows long term serious and not small financial/work oriented goals ( again ) compared to others \n\nIt does not have the HAVING SOME FUN WHILE PAYING SOME BILLS casual VIBE that a lot of profiles have ,\n\nNothing wrong with that as long as she knows about her competition out there and is not based on there is a willing multi millionaire sugar daddy on every corner in NYC and there is a shortage of high quality sugar babies in NYC to have some casual dating fun with",
            "author": "shamloo77",
            "id": "h2cykxe",
            "parent_id": "t1_h2cw3dc",
            "score": -4,
            "created_utc": 1624135240.0,
            "replies": [
                {
                    "body": "So do you think it’d be better to have a more casual have some fun while paying bills vibe? As in there’s a larger untapped market there? I’m not completely opposed to that but just want those people to be kind, caring people even if it was casual.",
                    "author": "Thick_Ad_475",
                    "id": "h2d6le7",
                    "parent_id": "t1_h2cykxe",
                    "score": 4,
                    "created_utc": 1624139540.0,
                    "replies": [
                        {
                            "body": "That would totally depend on your personal preference ,\n\nI don't know how much interest you are getting and much about your views on casual dating etc ,, but if you are new then keep the vibe you have now for 1 or 2 months and if you felt  that it is not happening then make some changes \n\nI see you succeeding either way , one takes longer and can get complicated easily but if it works you get a solid financial future etc and in the other way you be casually dating a guy or guys who are financially supportive and hand over $$$ in a friend/lover dynamic to you \n\nYour choice really , just know your competition well",
                            "author": "shamloo77",
                            "id": "h2d7zh1",
                            "parent_id": "t1_h2d6le7",
                            "score": -2,
                            "created_utc": 1624140317.0,
                            "replies": [
                                {
                                    "body": "Very helpful advice, thank you! Either of those situations sound nice to me, since they both involve the kinship/relationship care even if the casualness of them differ. I’m not looking for someone to marry, just want to mean something to someone, even if it is just they enjoy my company casually here and there.",
                                    "author": "Thick_Ad_475",
                                    "id": "h2d94vg",
                                    "parent_id": "t1_h2d7zh1",
                                    "score": 3,
                                    "created_utc": 1624140981.0,
                                    "replies": [
                                        {
                                            "body": "You welcome ,",
                                            "author": "shamloo77",
                                            "id": "h2d9o6o",
                                            "parent_id": "t1_h2d94vg",
                                            "score": 0,
                                            "created_utc": 1624141279.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Thank you!! You are also gorgeous 💜",
            "author": "Thick_Ad_475",
            "id": "h2dgpcx",
            "parent_id": "t1_h2dcv4u",
            "score": 2,
            "created_utc": 1624145291.0,
            "replies": []
        },
        {
            "body": "I heard SD don’t like videoconferencing or was that bad advice",
            "author": "Rommababy",
            "id": "h2dpz0x",
            "parent_id": "t1_h2cs92o",
            "score": 1,
            "created_utc": 1624150694.0,
            "replies": [
                {
                    "body": "married SD dont like them, a lot of us single / divorced guys dont mind, because it gives us a chance to make sure she looks like her photos, and it also allows you to connect better then just a call",
                    "author": null,
                    "id": "h2f8ka4",
                    "parent_id": "t1_h2dpz0x",
                    "score": 3,
                    "created_utc": 1624193043.0,
                    "replies": []
                },
                {
                    "body": "I wouldn’t know as I don’t date them! General consensus amongst SBs please…",
                    "author": "chairman212121",
                    "id": "h2e4a38",
                    "parent_id": "t1_h2dpz0x",
                    "score": -1,
                    "created_utc": 1624159285.0,
                    "replies": [
                        {
                            "body": "After the first ten or so messages I always ask if they'd like to arrange a video chat to see how we get on face to face. It's primarily for safety, but even if not for that reason I'd still do it, as it avoids those awful first meets where one or both of you know it's a no within minutes but you have to sit politely through the date anyway. Lots of guys I've spoken to hadn't done video calls before a M&G before, but none were unhappy to do it.",
                            "author": "assinoroyale",
                            "id": "h2f4c9i",
                            "parent_id": "t1_h2e4a38",
                            "score": 6,
                            "created_utc": 1624189811.0,
                            "replies": []
                        },
                        {
                            "body": "In my very limited experience of a day only one has not wanted to but quite a few brought it up themselves 🤷🏼‍♀️",
                            "author": "Thick_Ad_475",
                            "id": "h2eayj5",
                            "parent_id": "t1_h2e4a38",
                            "score": 4,
                            "created_utc": 1624163492.0,
                            "replies": []
                        },
                        {
                            "body": "If a guy asks me to video chat before we meet I typically stop responding. It’s a time waster/pic collector tactic the majority of the time. I simply say-\n\n“If you are eager to see me let’s move the meet and greet up:)”",
                            "author": "MsDReid",
                            "id": "h2eg78z",
                            "parent_id": "t1_h2e4a38",
                            "score": 5,
                            "created_utc": 1624167409.0,
                            "replies": [
                                {
                                    "body": "But wouldn’t you want to check the guy in the pics is the guy in the video? Seems like a normal person etc?",
                                    "author": "chairman212121",
                                    "id": "h2ex0m6",
                                    "parent_id": "t1_h2eg78z",
                                    "score": 1,
                                    "created_utc": 1624183194.0,
                                    "replies": [
                                        {
                                            "body": "No. That can all be done in public in person. Which if a man isn’t scheduling a meet to happen within the first 3-5 days of texting I concentrate on other connections. I’ll send a lighthearted “message me when you have free time to meet” and leave it at that. But most of the time the men asking for pics/video calls/putting off meeting are scammers. \n\nAdditionally I’m not giving someone my real number. But even if I could do it without doing so. No. Never. And if a guy asks and then doesn’t respond favorably to my text about a meet and greet…bye🤷‍♀️",
                                            "author": "MsDReid",
                                            "id": "h2exla1",
                                            "parent_id": "t1_h2ex0m6",
                                            "score": 4,
                                            "created_utc": 1624183750.0,
                                            "replies": [
                                                {
                                                    "body": "Sounds like S’ing over there is way worse, more dangerous than here in Southern Europe. No SB would be that cautious with me.",
                                                    "author": "chairman212121",
                                                    "id": "h2ezq0b",
                                                    "parent_id": "t1_h2exla1",
                                                    "score": 3,
                                                    "created_utc": 1624185764.0,
                                                    "replies": [
                                                        {
                                                            "body": "that's because she's coming from the sex work world, and just being a normal woman that becomes a sugar baby. Sex workers have different protocols, especially here in the US.",
                                                            "author": null,
                                                            "id": "h2f8pr2",
                                                            "parent_id": "t1_h2ezq0b",
                                                            "score": 1,
                                                            "created_utc": 1624193147.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Aaahhhhhhhh. Explains everything.",
                                                                    "author": "chairman212121",
                                                                    "id": "h2fi18r",
                                                                    "parent_id": "t1_h2f8pr2",
                                                                    "score": 1,
                                                                    "created_utc": 1624198508.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "All super helpful, thank you very much! You’re both definitely right I could work on the part of why an SD should pick me, I just feel so gross talking about myself 🤦🏼‍♀️Will try to view it as good practice selling myself!",
            "author": "Thick_Ad_475",
            "id": "h2coqgs",
            "parent_id": "t1_h2cnnb7",
            "score": 3,
            "created_utc": 1624130020.0,
            "replies": []
        },
        {
            "body": "AHH thank you SO much for this very helpful info! Taking it off 🙏🏻",
            "author": "Thick_Ad_475",
            "id": "h2fk0qi",
            "parent_id": "t1_h2f8u9v",
            "score": 1,
            "created_utc": 1624199568.0,
            "replies": []
        },
        {
            "body": "That makes sense, thank you so much!  Not nitpicky at all",
            "author": "Thick_Ad_475",
            "id": "h2dv2r7",
            "parent_id": "t1_h2dos8a",
            "score": 3,
            "created_utc": 1624153742.0,
            "replies": []
        },
        {
            "body": "Oh no I didn’t take it in a condescending way at all! Thank you and appreciate the advice :)",
            "author": "Thick_Ad_475",
            "id": "h2eatoi",
            "parent_id": "t1_h2e7uo9",
            "score": 1,
            "created_utc": 1624163398.0,
            "replies": []
        },
        {
            "body": "Yes, I learned quickly you’re only as valuable as the amount of cookies you have to them haha",
            "author": "Thick_Ad_475",
            "id": "h2d5vmb",
            "parent_id": "t1_h2cp5lk",
            "score": 5,
            "created_utc": 1624139152.0,
            "replies": [
                {
                    "body": "LOL.  Remember that in your film career if you need a scene as a metaphor for the SD/SB dynamic.",
                    "author": "pedxing1968",
                    "id": "h2d92p6",
                    "parent_id": "t1_h2d5vmb",
                    "score": -1,
                    "created_utc": 1624140947.0,
                    "replies": [
                        {
                            "body": "Lol the lesson I gleaned was always carry cookies 🍪😊",
                            "author": "Thick_Ad_475",
                            "id": "h2ec82m",
                            "parent_id": "t1_h2d92p6",
                            "score": 1,
                            "created_utc": 1624164380.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "You have to treat the males like the cracker shopkeepers do, if they start getting rowdy or line up for a ram you give them a firm slap in between their horns with a flat hand.  They just turn and walk away.",
            "author": "storm170",
            "id": "h2cpojp",
            "parent_id": "t1_h2cp5lk",
            "score": 3,
            "created_utc": 1624130531.0,
            "replies": []
        },
        {
            "body": "Ahhh good to know! It was not intended to be a platonic profile, so glad not everyone reads it that way.",
            "author": "Thick_Ad_475",
            "id": "h2dge8j",
            "parent_id": "t1_h2ddmbf",
            "score": 2,
            "created_utc": 1624145114.0,
            "replies": []
        },
        {
            "body": "So do you think it’d be better to have a more casual have some fun while paying bills vibe? As in there’s a larger untapped market there? I’m not completely opposed to that but just want those people to be kind, caring people even if it was casual.",
            "author": "Thick_Ad_475",
            "id": "h2d6le7",
            "parent_id": "t1_h2cykxe",
            "score": 4,
            "created_utc": 1624139540.0,
            "replies": [
                {
                    "body": "That would totally depend on your personal preference ,\n\nI don't know how much interest you are getting and much about your views on casual dating etc ,, but if you are new then keep the vibe you have now for 1 or 2 months and if you felt  that it is not happening then make some changes \n\nI see you succeeding either way , one takes longer and can get complicated easily but if it works you get a solid financial future etc and in the other way you be casually dating a guy or guys who are financially supportive and hand over $$$ in a friend/lover dynamic to you \n\nYour choice really , just know your competition well",
                    "author": "shamloo77",
                    "id": "h2d7zh1",
                    "parent_id": "t1_h2d6le7",
                    "score": -2,
                    "created_utc": 1624140317.0,
                    "replies": [
                        {
                            "body": "Very helpful advice, thank you! Either of those situations sound nice to me, since they both involve the kinship/relationship care even if the casualness of them differ. I’m not looking for someone to marry, just want to mean something to someone, even if it is just they enjoy my company casually here and there.",
                            "author": "Thick_Ad_475",
                            "id": "h2d94vg",
                            "parent_id": "t1_h2d7zh1",
                            "score": 3,
                            "created_utc": 1624140981.0,
                            "replies": [
                                {
                                    "body": "You welcome ,",
                                    "author": "shamloo77",
                                    "id": "h2d9o6o",
                                    "parent_id": "t1_h2d94vg",
                                    "score": 0,
                                    "created_utc": 1624141279.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "married SD dont like them, a lot of us single / divorced guys dont mind, because it gives us a chance to make sure she looks like her photos, and it also allows you to connect better then just a call",
            "author": null,
            "id": "h2f8ka4",
            "parent_id": "t1_h2dpz0x",
            "score": 3,
            "created_utc": 1624193043.0,
            "replies": []
        },
        {
            "body": "I wouldn’t know as I don’t date them! General consensus amongst SBs please…",
            "author": "chairman212121",
            "id": "h2e4a38",
            "parent_id": "t1_h2dpz0x",
            "score": -1,
            "created_utc": 1624159285.0,
            "replies": [
                {
                    "body": "After the first ten or so messages I always ask if they'd like to arrange a video chat to see how we get on face to face. It's primarily for safety, but even if not for that reason I'd still do it, as it avoids those awful first meets where one or both of you know it's a no within minutes but you have to sit politely through the date anyway. Lots of guys I've spoken to hadn't done video calls before a M&G before, but none were unhappy to do it.",
                    "author": "assinoroyale",
                    "id": "h2f4c9i",
                    "parent_id": "t1_h2e4a38",
                    "score": 6,
                    "created_utc": 1624189811.0,
                    "replies": []
                },
                {
                    "body": "In my very limited experience of a day only one has not wanted to but quite a few brought it up themselves 🤷🏼‍♀️",
                    "author": "Thick_Ad_475",
                    "id": "h2eayj5",
                    "parent_id": "t1_h2e4a38",
                    "score": 4,
                    "created_utc": 1624163492.0,
                    "replies": []
                },
                {
                    "body": "If a guy asks me to video chat before we meet I typically stop responding. It’s a time waster/pic collector tactic the majority of the time. I simply say-\n\n“If you are eager to see me let’s move the meet and greet up:)”",
                    "author": "MsDReid",
                    "id": "h2eg78z",
                    "parent_id": "t1_h2e4a38",
                    "score": 5,
                    "created_utc": 1624167409.0,
                    "replies": [
                        {
                            "body": "But wouldn’t you want to check the guy in the pics is the guy in the video? Seems like a normal person etc?",
                            "author": "chairman212121",
                            "id": "h2ex0m6",
                            "parent_id": "t1_h2eg78z",
                            "score": 1,
                            "created_utc": 1624183194.0,
                            "replies": [
                                {
                                    "body": "No. That can all be done in public in person. Which if a man isn’t scheduling a meet to happen within the first 3-5 days of texting I concentrate on other connections. I’ll send a lighthearted “message me when you have free time to meet” and leave it at that. But most of the time the men asking for pics/video calls/putting off meeting are scammers. \n\nAdditionally I’m not giving someone my real number. But even if I could do it without doing so. No. Never. And if a guy asks and then doesn’t respond favorably to my text about a meet and greet…bye🤷‍♀️",
                                    "author": "MsDReid",
                                    "id": "h2exla1",
                                    "parent_id": "t1_h2ex0m6",
                                    "score": 4,
                                    "created_utc": 1624183750.0,
                                    "replies": [
                                        {
                                            "body": "Sounds like S’ing over there is way worse, more dangerous than here in Southern Europe. No SB would be that cautious with me.",
                                            "author": "chairman212121",
                                            "id": "h2ezq0b",
                                            "parent_id": "t1_h2exla1",
                                            "score": 3,
                                            "created_utc": 1624185764.0,
                                            "replies": [
                                                {
                                                    "body": "that's because she's coming from the sex work world, and just being a normal woman that becomes a sugar baby. Sex workers have different protocols, especially here in the US.",
                                                    "author": null,
                                                    "id": "h2f8pr2",
                                                    "parent_id": "t1_h2ezq0b",
                                                    "score": 1,
                                                    "created_utc": 1624193147.0,
                                                    "replies": [
                                                        {
                                                            "body": "Aaahhhhhhhh. Explains everything.",
                                                            "author": "chairman212121",
                                                            "id": "h2fi18r",
                                                            "parent_id": "t1_h2f8pr2",
                                                            "score": 1,
                                                            "created_utc": 1624198508.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "LOL.  Remember that in your film career if you need a scene as a metaphor for the SD/SB dynamic.",
            "author": "pedxing1968",
            "id": "h2d92p6",
            "parent_id": "t1_h2d5vmb",
            "score": -1,
            "created_utc": 1624140947.0,
            "replies": [
                {
                    "body": "Lol the lesson I gleaned was always carry cookies 🍪😊",
                    "author": "Thick_Ad_475",
                    "id": "h2ec82m",
                    "parent_id": "t1_h2d92p6",
                    "score": 1,
                    "created_utc": 1624164380.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "That would totally depend on your personal preference ,\n\nI don't know how much interest you are getting and much about your views on casual dating etc ,, but if you are new then keep the vibe you have now for 1 or 2 months and if you felt  that it is not happening then make some changes \n\nI see you succeeding either way , one takes longer and can get complicated easily but if it works you get a solid financial future etc and in the other way you be casually dating a guy or guys who are financially supportive and hand over $$$ in a friend/lover dynamic to you \n\nYour choice really , just know your competition well",
            "author": "shamloo77",
            "id": "h2d7zh1",
            "parent_id": "t1_h2d6le7",
            "score": -2,
            "created_utc": 1624140317.0,
            "replies": [
                {
                    "body": "Very helpful advice, thank you! Either of those situations sound nice to me, since they both involve the kinship/relationship care even if the casualness of them differ. I’m not looking for someone to marry, just want to mean something to someone, even if it is just they enjoy my company casually here and there.",
                    "author": "Thick_Ad_475",
                    "id": "h2d94vg",
                    "parent_id": "t1_h2d7zh1",
                    "score": 3,
                    "created_utc": 1624140981.0,
                    "replies": [
                        {
                            "body": "You welcome ,",
                            "author": "shamloo77",
                            "id": "h2d9o6o",
                            "parent_id": "t1_h2d94vg",
                            "score": 0,
                            "created_utc": 1624141279.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "After the first ten or so messages I always ask if they'd like to arrange a video chat to see how we get on face to face. It's primarily for safety, but even if not for that reason I'd still do it, as it avoids those awful first meets where one or both of you know it's a no within minutes but you have to sit politely through the date anyway. Lots of guys I've spoken to hadn't done video calls before a M&G before, but none were unhappy to do it.",
            "author": "assinoroyale",
            "id": "h2f4c9i",
            "parent_id": "t1_h2e4a38",
            "score": 6,
            "created_utc": 1624189811.0,
            "replies": []
        },
        {
            "body": "In my very limited experience of a day only one has not wanted to but quite a few brought it up themselves 🤷🏼‍♀️",
            "author": "Thick_Ad_475",
            "id": "h2eayj5",
            "parent_id": "t1_h2e4a38",
            "score": 4,
            "created_utc": 1624163492.0,
            "replies": []
        },
        {
            "body": "If a guy asks me to video chat before we meet I typically stop responding. It’s a time waster/pic collector tactic the majority of the time. I simply say-\n\n“If you are eager to see me let’s move the meet and greet up:)”",
            "author": "MsDReid",
            "id": "h2eg78z",
            "parent_id": "t1_h2e4a38",
            "score": 5,
            "created_utc": 1624167409.0,
            "replies": [
                {
                    "body": "But wouldn’t you want to check the guy in the pics is the guy in the video? Seems like a normal person etc?",
                    "author": "chairman212121",
                    "id": "h2ex0m6",
                    "parent_id": "t1_h2eg78z",
                    "score": 1,
                    "created_utc": 1624183194.0,
                    "replies": [
                        {
                            "body": "No. That can all be done in public in person. Which if a man isn’t scheduling a meet to happen within the first 3-5 days of texting I concentrate on other connections. I’ll send a lighthearted “message me when you have free time to meet” and leave it at that. But most of the time the men asking for pics/video calls/putting off meeting are scammers. \n\nAdditionally I’m not giving someone my real number. But even if I could do it without doing so. No. Never. And if a guy asks and then doesn’t respond favorably to my text about a meet and greet…bye🤷‍♀️",
                            "author": "MsDReid",
                            "id": "h2exla1",
                            "parent_id": "t1_h2ex0m6",
                            "score": 4,
                            "created_utc": 1624183750.0,
                            "replies": [
                                {
                                    "body": "Sounds like S’ing over there is way worse, more dangerous than here in Southern Europe. No SB would be that cautious with me.",
                                    "author": "chairman212121",
                                    "id": "h2ezq0b",
                                    "parent_id": "t1_h2exla1",
                                    "score": 3,
                                    "created_utc": 1624185764.0,
                                    "replies": [
                                        {
                                            "body": "that's because she's coming from the sex work world, and just being a normal woman that becomes a sugar baby. Sex workers have different protocols, especially here in the US.",
                                            "author": null,
                                            "id": "h2f8pr2",
                                            "parent_id": "t1_h2ezq0b",
                                            "score": 1,
                                            "created_utc": 1624193147.0,
                                            "replies": [
                                                {
                                                    "body": "Aaahhhhhhhh. Explains everything.",
                                                    "author": "chairman212121",
                                                    "id": "h2fi18r",
                                                    "parent_id": "t1_h2f8pr2",
                                                    "score": 1,
                                                    "created_utc": 1624198508.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Lol the lesson I gleaned was always carry cookies 🍪😊",
            "author": "Thick_Ad_475",
            "id": "h2ec82m",
            "parent_id": "t1_h2d92p6",
            "score": 1,
            "created_utc": 1624164380.0,
            "replies": []
        },
        {
            "body": "Very helpful advice, thank you! Either of those situations sound nice to me, since they both involve the kinship/relationship care even if the casualness of them differ. I’m not looking for someone to marry, just want to mean something to someone, even if it is just they enjoy my company casually here and there.",
            "author": "Thick_Ad_475",
            "id": "h2d94vg",
            "parent_id": "t1_h2d7zh1",
            "score": 3,
            "created_utc": 1624140981.0,
            "replies": [
                {
                    "body": "You welcome ,",
                    "author": "shamloo77",
                    "id": "h2d9o6o",
                    "parent_id": "t1_h2d94vg",
                    "score": 0,
                    "created_utc": 1624141279.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "But wouldn’t you want to check the guy in the pics is the guy in the video? Seems like a normal person etc?",
            "author": "chairman212121",
            "id": "h2ex0m6",
            "parent_id": "t1_h2eg78z",
            "score": 1,
            "created_utc": 1624183194.0,
            "replies": [
                {
                    "body": "No. That can all be done in public in person. Which if a man isn’t scheduling a meet to happen within the first 3-5 days of texting I concentrate on other connections. I’ll send a lighthearted “message me when you have free time to meet” and leave it at that. But most of the time the men asking for pics/video calls/putting off meeting are scammers. \n\nAdditionally I’m not giving someone my real number. But even if I could do it without doing so. No. Never. And if a guy asks and then doesn’t respond favorably to my text about a meet and greet…bye🤷‍♀️",
                    "author": "MsDReid",
                    "id": "h2exla1",
                    "parent_id": "t1_h2ex0m6",
                    "score": 4,
                    "created_utc": 1624183750.0,
                    "replies": [
                        {
                            "body": "Sounds like S’ing over there is way worse, more dangerous than here in Southern Europe. No SB would be that cautious with me.",
                            "author": "chairman212121",
                            "id": "h2ezq0b",
                            "parent_id": "t1_h2exla1",
                            "score": 3,
                            "created_utc": 1624185764.0,
                            "replies": [
                                {
                                    "body": "that's because she's coming from the sex work world, and just being a normal woman that becomes a sugar baby. Sex workers have different protocols, especially here in the US.",
                                    "author": null,
                                    "id": "h2f8pr2",
                                    "parent_id": "t1_h2ezq0b",
                                    "score": 1,
                                    "created_utc": 1624193147.0,
                                    "replies": [
                                        {
                                            "body": "Aaahhhhhhhh. Explains everything.",
                                            "author": "chairman212121",
                                            "id": "h2fi18r",
                                            "parent_id": "t1_h2f8pr2",
                                            "score": 1,
                                            "created_utc": 1624198508.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "You welcome ,",
            "author": "shamloo77",
            "id": "h2d9o6o",
            "parent_id": "t1_h2d94vg",
            "score": 0,
            "created_utc": 1624141279.0,
            "replies": []
        },
        {
            "body": "No. That can all be done in public in person. Which if a man isn’t scheduling a meet to happen within the first 3-5 days of texting I concentrate on other connections. I’ll send a lighthearted “message me when you have free time to meet” and leave it at that. But most of the time the men asking for pics/video calls/putting off meeting are scammers. \n\nAdditionally I’m not giving someone my real number. But even if I could do it without doing so. No. Never. And if a guy asks and then doesn’t respond favorably to my text about a meet and greet…bye🤷‍♀️",
            "author": "MsDReid",
            "id": "h2exla1",
            "parent_id": "t1_h2ex0m6",
            "score": 4,
            "created_utc": 1624183750.0,
            "replies": [
                {
                    "body": "Sounds like S’ing over there is way worse, more dangerous than here in Southern Europe. No SB would be that cautious with me.",
                    "author": "chairman212121",
                    "id": "h2ezq0b",
                    "parent_id": "t1_h2exla1",
                    "score": 3,
                    "created_utc": 1624185764.0,
                    "replies": [
                        {
                            "body": "that's because she's coming from the sex work world, and just being a normal woman that becomes a sugar baby. Sex workers have different protocols, especially here in the US.",
                            "author": null,
                            "id": "h2f8pr2",
                            "parent_id": "t1_h2ezq0b",
                            "score": 1,
                            "created_utc": 1624193147.0,
                            "replies": [
                                {
                                    "body": "Aaahhhhhhhh. Explains everything.",
                                    "author": "chairman212121",
                                    "id": "h2fi18r",
                                    "parent_id": "t1_h2f8pr2",
                                    "score": 1,
                                    "created_utc": 1624198508.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Sounds like S’ing over there is way worse, more dangerous than here in Southern Europe. No SB would be that cautious with me.",
            "author": "chairman212121",
            "id": "h2ezq0b",
            "parent_id": "t1_h2exla1",
            "score": 3,
            "created_utc": 1624185764.0,
            "replies": [
                {
                    "body": "that's because she's coming from the sex work world, and just being a normal woman that becomes a sugar baby. Sex workers have different protocols, especially here in the US.",
                    "author": null,
                    "id": "h2f8pr2",
                    "parent_id": "t1_h2ezq0b",
                    "score": 1,
                    "created_utc": 1624193147.0,
                    "replies": [
                        {
                            "body": "Aaahhhhhhhh. Explains everything.",
                            "author": "chairman212121",
                            "id": "h2fi18r",
                            "parent_id": "t1_h2f8pr2",
                            "score": 1,
                            "created_utc": 1624198508.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "that's because she's coming from the sex work world, and just being a normal woman that becomes a sugar baby. Sex workers have different protocols, especially here in the US.",
            "author": null,
            "id": "h2f8pr2",
            "parent_id": "t1_h2ezq0b",
            "score": 1,
            "created_utc": 1624193147.0,
            "replies": [
                {
                    "body": "Aaahhhhhhhh. Explains everything.",
                    "author": "chairman212121",
                    "id": "h2fi18r",
                    "parent_id": "t1_h2f8pr2",
                    "score": 1,
                    "created_utc": 1624198508.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Aaahhhhhhhh. Explains everything.",
            "author": "chairman212121",
            "id": "h2fi18r",
            "parent_id": "t1_h2f8pr2",
            "score": 1,
            "created_utc": 1624198508.0,
            "replies": []
        }
    ]
}