{
    "title": "What is a Mistress?",
    "post_id": "awv0to",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/awv0to/what_is_a_mistress/",
    "author": null,
    "body": "Quite some time ago I was in a loveless and sexless marriage. When you are married, post children and wake up one day to realize that sexual desire for more is burning so brightly in your soul - you’ll do almost anything to quench that thirst. \n\nSo there I was, considered still within my prime, but the tricky fact that I was married was holding me back from signing up on PoF. So, of course, I did what any woman would do. I signed up for a website, that shall not be named, shortly before it was hacked. \n\nMy initial affairs off that website are irrelevant. Mostly men who didn’t know their way around a woman’s body *or her mind*. But then one day, right before I was about to delete my profile, I received a message from a man that piqued my interest. He made a joke about my profile, told me he’d never *done this* before, and explained his reasoning for being there. \n\nWhen he opened his photos to me I thought - okay, I’m not really attracted, but he’s not *terrible* looking. We will call him J, and J was younger than me, bald, slightly to moderately overweight, with a big ol’ gap between his front teeth. But he had kind eyes, a witty sense of humor, and he loved to make me laugh.\n\nWe talked for weeks via apps. We played trivia online together, Pictionary, scrabble, and whole bunch of other games. Yet, we still hadn’t met. Almost 3 weeks went by and I knew everything about this man, except what he looked like in person. We’d opened up to each other about our marriages. We’d laughed together, I’d cried to him about a recent event, and we even watched movies on tv together and texted in between commercial breaks about the plot lines. \n\nJ was successful, in so much that he’d worked his way up the corporate ladder and was about halfway through where he wanted to be. Though he was young, he was driven. We never talked money, but I knew he made it.\n\nOne day, J asked me to meet him for lunch. I hesitantly agreed, as I was positive that the relationship would never go anywhere. I wasn’t attracted to the photos he’d sent in the traditional sense, and I felt that we’d moved more into friend territory. Actually, it came up at one point and he said to me: ‘If you and I just remain friends, I know that I’ll never try to find someone else to sleep with.’\n\nI arrived early to the restaurant. It was nice but in a crappy area. I had my back to the door and I was the only one there save for the waiters. I heard him walk in and I kept my menu up around my eyes. I was afraid to look. I was afraid that I would see him and be repulsed by what I saw. I remember seeing his shoes as he came to stand next to where I was sitting. I stared at the menu as he stared at me. I’m positive it was only seconds, but time stood still. The menu shook in my hands and I think I was sweating. \n\nI finally looked up. And there he was, all 6 feet burly man of him, the florescent light glistening off his bald head. At least, I think the light was glistening. I’m not quite sure because I couldn’t see anything but his smile. A smile so wide that I imagined animals going to roost in the gap between his front teeth. But that smile, it could kill a woman. It was the smile of every goofy, affable man in every romantic comedy ever written. When authors write about smiles that slay virgins they used this man as their inspiration. \n\nI don’t remember what we talked about that day. But we spent hours in the restaurant. When he finally kissed me 3 dates later, I’d worked myself up into such a tizzy over whether or not our kissing styles were compatible that he missed me the first pass at my face. I was trying to run away from him, prolong the possibility of the inevitable fall out from him being a bad kisser. When he moved, in I turned my cheek, and he got my ear. He laughed. He laughed in a way that meant - *I both love you and hate you right now*. And then he reached out with his hand, molded his fingers to the side of my face and held me there while his lips met mine. I’ve never before been kissed like that and I long for the day a man will kiss me like that again. \n\nOur affair was long and beautiful. The gifts started soon after our third date. Little trinkets that eventually led to gift cards and shopping sprees. I had money so I didn’t need the stuff and my husband never questioned where it came from. Eventually J started compensating my days I took off to be with him. We traveled to hotels but only in our own city. We ate take out in bed and then had sex on the empty boxes. Once we had a food fight that involved pizza and soda and a $500 room cleaning bill. My bra was the only casualty. We continued to play online games together every night. \n\nWe’d lay for hours while I ran my fingers over his skin. He was the first man I’d dated that had hair everywhere but his head. I loved the way the different textures of his body felt under my hands. He’d take conference calls with the video off while I gave him blow jobs under the hotel room desk. Once we even got our children together for a play date at the mall. Thankfully, our kids were too young to remember that. \n\nJ is the man that opened my eyes to the wonderful world of married men. They are passionate, and curious, and so loving. The right married man, though he cannot offer you the entire world, will give you a piece of heaven that is so glorious that you will want to set up shop and spend your end of days in his embrace. All the good and none of the bad. \n\nWhen I search for an SD now, I look for someone like J. Someone with the world to give, but where the money and gifts is secondary to all the other wonderful things he can provide. There are women like us out there. We live silently in the shadows because that is where we thrive. We are mistresses. And we love. We love who you are and what you do for us. Yes, sometimes we long for more, but we know - having more is never the same. \n\nI remember our days fondly, J. And I always will. I do not know whether I’ll find someone that makes me feel like you did. I’ve made peace with that. Someone else may have made me a woman. But you made me feel alive. ",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/awv0to/what_is_a_mistress/",
    "score": 117,
    "upvote_ratio": 0.87,
    "created_utc": 1551627250.0,
    "num_comments": 34,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "[deleted]",
            "author": null,
            "id": "ehpchpf",
            "parent_id": "t3_awv0to",
            "score": 31,
            "created_utc": 1551628366.0,
            "replies": [
                {
                    "body": "I’m looking forward to meeting my\nOwn J!  Thank you ladies for sharing ",
                    "author": "fadia512",
                    "id": "ehqjjro",
                    "parent_id": "t1_ehpchpf",
                    "score": 2,
                    "created_utc": 1551661897.0,
                    "replies": [
                        {
                            "body": "I’m not a jay but I’m a k. K? Ok. Bad joke.  ",
                            "author": "lonewolfcatchesfire",
                            "id": "ei24lsy",
                            "parent_id": "t1_ehqjjro",
                            "score": 1,
                            "created_utc": 1552035496.0,
                            "replies": [
                                {
                                    "body": "Hilarious- actually.  I like bad jokrs😂🤦🏾‍♀️",
                                    "author": "fadia512",
                                    "id": "ei26kw7",
                                    "parent_id": "t1_ei24lsy",
                                    "score": 1,
                                    "created_utc": 1552038939.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "This is freaking awesome! I currently have my own J and damn, after he and I part (which will be such a bitter-sweet day), it’s gonna be interesting trying to find someone like him. \n\nHe has completely shown me my worth and how to expect to be treated and loved. Though I’ll never get the chance to marry him, I’ll at least know what I want out of the man who does marry me. \n\nThanks for sharing, I damn near cried.",
            "author": "carlsfried",
            "id": "ehpd8vi",
            "parent_id": "t3_awv0to",
            "score": 12,
            "created_utc": 1551628987.0,
            "replies": []
        },
        {
            "body": "Did yall ever talk about leaving spouses and getting together?  It sounds better than a loveless, sexless marriage.",
            "author": "lifetimelurker808",
            "id": "ehq1spl",
            "parent_id": "t3_awv0to",
            "score": 4,
            "created_utc": 1551647785.0,
            "replies": [
                {
                    "body": "There was a mutual unspoken bond between J and I. We had memories that could not be tarnished if we left things casual. But making things real, is how dreams are shattered. I am grateful for what he gave me, and our time together has kept me warm many nights. \n\nIn the end, I broke things off with J because I knew I was nearing the point of no return. That I’d eventually fall so far in love with him that I’d lose another 10 years of my life. And it wasn’t just my life I’d have to upend, it would be his, too. And I’d never want that for him. I might have never loved my husband. But he loved his wife. And I’d never ask him to stop loving her.  ",
                    "author": null,
                    "id": "ehqkle4",
                    "parent_id": "t1_ehq1spl",
                    "score": 9,
                    "created_utc": 1551662788.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Oh my little baby heart, this is so well written it’s almost changed my mind about dating married men. ",
            "author": "Rosa_Velvet",
            "id": "ehpizjl",
            "parent_id": "t3_awv0to",
            "score": 4,
            "created_utc": 1551633553.0,
            "replies": [
                {
                    "body": "don't do it. There are 100 of me for every J",
                    "author": null,
                    "id": "ehq02ty",
                    "parent_id": "t1_ehpizjl",
                    "score": 8,
                    "created_utc": 1551646480.0,
                    "replies": [
                        {
                            "body": "😂",
                            "author": "raerae2526",
                            "id": "ehqgu57",
                            "parent_id": "t1_ehq02ty",
                            "score": 1,
                            "created_utc": 1551659565.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I'd say in my ideal, I'm far closer to a mistress than an SB and have toyed with including this in my profile.  Haven't decided.\n\nThanks for sharing your story 😊😘",
            "author": "CentralUSGal",
            "id": "ehpjf7j",
            "parent_id": "t3_awv0to",
            "score": 1,
            "created_utc": 1551633893.0,
            "replies": [
                {
                    "body": "Why would you say that\nyour closer to being a mistress rather than an SB",
                    "author": "sugarsusie",
                    "id": "ehpjtm7",
                    "parent_id": "t1_ehpjf7j",
                    "score": 2,
                    "created_utc": 1551634201.0,
                    "replies": [
                        {
                            "body": "With me having moved states, I sometimes feel am I being a mistress to my SD",
                            "author": "sugarsusie",
                            "id": "ehpk80f",
                            "parent_id": "t1_ehpjtm7",
                            "score": 0,
                            "created_utc": 1551634513.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Lovely piece of writing!  I can't help but wonder if J being married and wealthy really had anything to do with his charm? What's the connection? Why do you think that looking for an SD on a site like SA is your best bet in finding another J? I'd love to hear your thoughts on this! ",
            "author": "manlicksdog",
            "id": "ehpu6pe",
            "parent_id": "t3_awv0to",
            "score": 3,
            "created_utc": 1551642002.0,
            "replies": [
                {
                    "body": "Being married and wealthy had nothing to do with J’s charm. But it was the icing on my cake. \nThe connection is simply that he is the unicorn. Though what he gave wasn’t SLFs ‘unicorn’ status - he was MY unicorn. And for awhile, I’d managed to capture that. \n\nI’m no longer with my husband, so to rejoin an affair site seems silly. And I have no doubt I would need to date a few thousand men before I found another J. But SAs premise keeps the boundaries in place that J and I had. ‘All of the good, none of the bad.’ \n\nI’m a better person as a mistress. I’m less needy, less argumentative, less all-the-bad-hormonal-female-things. And from that, I get all the best parts of a man. The sexy, fun, playful, supporting parts. \n\nSA felt like a natural course of action for me. The man I see now isn’t like J. Our relationship is less organic, and there’s no amount of money that would change that. We don’t have the bond that J and I had, our lives are also very different. But we have fun. And it’s stress free. Who wouldn’t want that?",
                    "author": null,
                    "id": "ehqk1z4",
                    "parent_id": "t1_ehpu6pe",
                    "score": 3,
                    "created_utc": 1551662328.0,
                    "replies": [
                        {
                            "body": "That makes a lot of sense. I suspect there are many women out there with similar desires but have trouble finding a dating site or app that is really appropriate for them. I suppose that's because society doesn't view sexually adventurous women as appropriate. It's hard for women to pursue an \"affair\" without being slut shammed or  descended upon by hoards of perverted piranhas. Anyway, that's the feeling I get talking to other women. ",
                            "author": "manlicksdog",
                            "id": "ehqp2ti",
                            "parent_id": "t1_ehqk1z4",
                            "score": 2,
                            "created_utc": 1551666645.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "That warmed my heart on this cold morning. Thanks for taking the time to share your beautiful story with us.",
            "author": "Cledaddy23",
            "id": "ehpe072",
            "parent_id": "t3_awv0to",
            "score": 3,
            "created_utc": 1551629610.0,
            "replies": []
        },
        {
            "body": "❤️❤️❤️❤️❤️",
            "author": "lolal0l",
            "id": "ehqjb2b",
            "parent_id": "t3_awv0to",
            "score": 1,
            "created_utc": 1551661688.0,
            "replies": []
        },
        {
            "body": "Great post .....Thanks for sharing",
            "author": "bizguy4life",
            "id": "ehqt6t1",
            "parent_id": "t3_awv0to",
            "score": 1,
            "created_utc": 1551670301.0,
            "replies": []
        },
        {
            "body": ">J is the man that opened my eyes to the wonderful world of married men. They are passionate, and curious, and so loving.\n\nYes God, why God? Why married guys are so fluffy I gonna die but we can't end up together because he loves his wife too much or gets too clingy so I have to run 100 miles/hour. Why??? 😭\n\nWhat happens with single, hot, rich and young SD's? Yea, they don't want to commit, I know...\n\nWhy people think once you get married or you just have a serious relationship, all magic and freshness go away? I refuse to believe this!\n\nGosh, I sound like Charlotte 🙁\nhttps://youtu.be/-JVeFRRLdAc",
            "author": null,
            "id": "ehrmjbx",
            "parent_id": "t3_awv0to",
            "score": 1,
            "created_utc": 1551709056.0,
            "replies": []
        },
        {
            "body": "Really nice post.   This is the kind of relationship I'd love to have, but they are rare to find in the bowl for sure\n\n&#x200B;",
            "author": null,
            "id": "ehrs0ze",
            "parent_id": "t3_awv0to",
            "score": 1,
            "created_utc": 1551713576.0,
            "replies": []
        },
        {
            "body": "Awwww beautiful!!! ",
            "author": null,
            "id": "ehrvnus",
            "parent_id": "t3_awv0to",
            "score": 1,
            "created_utc": 1551716271.0,
            "replies": []
        },
        {
            "body": "Best thing I’ve read on here, ever. Sounds like a wonderful time of your lives. ",
            "author": "mraspencer",
            "id": "ehperin",
            "parent_id": "t3_awv0to",
            "score": 2,
            "created_utc": 1551630238.0,
            "replies": []
        },
        {
            "body": "Beautiful. So, so beautiful. Thank you for sharing this.",
            "author": "sweetpoly",
            "id": "ehpiurw",
            "parent_id": "t3_awv0to",
            "score": 1,
            "created_utc": 1551633449.0,
            "replies": []
        },
        {
            "body": "Beautiful ",
            "author": "sprite1200",
            "id": "ehpr1yw",
            "parent_id": "t3_awv0to",
            "score": 1,
            "created_utc": 1551639597.0,
            "replies": []
        },
        {
            "body": "Beautiful story. It did bring tears to my eyes. Thanks for sharing. I’m glad you had a great experience with J.",
            "author": "supportiveceo",
            "id": "ehpyqgz",
            "parent_id": "t3_awv0to",
            "score": 1,
            "created_utc": 1551645460.0,
            "replies": []
        },
        {
            "body": "Awesome story Ab 👍🏻",
            "author": "ruphun",
            "id": "ehpib5y",
            "parent_id": "t3_awv0to",
            "score": 0,
            "created_utc": 1551633031.0,
            "replies": []
        },
        {
            "body": "What a amazing love story, I almost cried 🤧🤧",
            "author": "CutiePatootana",
            "id": "ehpnn0f",
            "parent_id": "t3_awv0to",
            "score": 0,
            "created_utc": 1551637052.0,
            "replies": []
        },
        {
            "body": "This is amazing",
            "author": null,
            "id": "ehpzz3a",
            "parent_id": "t3_awv0to",
            "score": 0,
            "created_utc": 1551646402.0,
            "replies": []
        },
        {
            "body": "Flippantly, the definition of a mistress is someone between the master and the mattress......",
            "author": "corpuscle103",
            "id": "ehpd9fx",
            "parent_id": "t3_awv0to",
            "score": -6,
            "created_utc": 1551629000.0,
            "replies": [
                {
                    "body": "Here’s a guy that didn’t read the story \n\n/Frank Caliendo",
                    "author": "mraspencer",
                    "id": "ehpevct",
                    "parent_id": "t1_ehpd9fx",
                    "score": 4,
                    "created_utc": 1551630325.0,
                    "replies": [
                        {
                            "body": "And he definitely will never be a J.",
                            "author": "Volturi6271",
                            "id": "ehphhp1",
                            "parent_id": "t1_ehpevct",
                            "score": 6,
                            "created_utc": 1551632395.0,
                            "replies": [
                                {
                                    "body": "I’m happy as I am thanks.",
                                    "author": "corpuscle103",
                                    "id": "ehs0409",
                                    "parent_id": "t1_ehphhp1",
                                    "score": 2,
                                    "created_utc": 1551719387.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "I get what you were trying to do...I appreciate the inclusion of flippantly..",
                    "author": null,
                    "id": "ehqe414",
                    "parent_id": "t1_ehpd9fx",
                    "score": 1,
                    "created_utc": 1551657295.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I’m looking forward to meeting my\nOwn J!  Thank you ladies for sharing ",
            "author": "fadia512",
            "id": "ehqjjro",
            "parent_id": "t1_ehpchpf",
            "score": 2,
            "created_utc": 1551661897.0,
            "replies": [
                {
                    "body": "I’m not a jay but I’m a k. K? Ok. Bad joke.  ",
                    "author": "lonewolfcatchesfire",
                    "id": "ei24lsy",
                    "parent_id": "t1_ehqjjro",
                    "score": 1,
                    "created_utc": 1552035496.0,
                    "replies": [
                        {
                            "body": "Hilarious- actually.  I like bad jokrs😂🤦🏾‍♀️",
                            "author": "fadia512",
                            "id": "ei26kw7",
                            "parent_id": "t1_ei24lsy",
                            "score": 1,
                            "created_utc": 1552038939.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "There was a mutual unspoken bond between J and I. We had memories that could not be tarnished if we left things casual. But making things real, is how dreams are shattered. I am grateful for what he gave me, and our time together has kept me warm many nights. \n\nIn the end, I broke things off with J because I knew I was nearing the point of no return. That I’d eventually fall so far in love with him that I’d lose another 10 years of my life. And it wasn’t just my life I’d have to upend, it would be his, too. And I’d never want that for him. I might have never loved my husband. But he loved his wife. And I’d never ask him to stop loving her.  ",
            "author": null,
            "id": "ehqkle4",
            "parent_id": "t1_ehq1spl",
            "score": 9,
            "created_utc": 1551662788.0,
            "replies": []
        },
        {
            "body": "don't do it. There are 100 of me for every J",
            "author": null,
            "id": "ehq02ty",
            "parent_id": "t1_ehpizjl",
            "score": 8,
            "created_utc": 1551646480.0,
            "replies": [
                {
                    "body": "😂",
                    "author": "raerae2526",
                    "id": "ehqgu57",
                    "parent_id": "t1_ehq02ty",
                    "score": 1,
                    "created_utc": 1551659565.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Why would you say that\nyour closer to being a mistress rather than an SB",
            "author": "sugarsusie",
            "id": "ehpjtm7",
            "parent_id": "t1_ehpjf7j",
            "score": 2,
            "created_utc": 1551634201.0,
            "replies": [
                {
                    "body": "With me having moved states, I sometimes feel am I being a mistress to my SD",
                    "author": "sugarsusie",
                    "id": "ehpk80f",
                    "parent_id": "t1_ehpjtm7",
                    "score": 0,
                    "created_utc": 1551634513.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Being married and wealthy had nothing to do with J’s charm. But it was the icing on my cake. \nThe connection is simply that he is the unicorn. Though what he gave wasn’t SLFs ‘unicorn’ status - he was MY unicorn. And for awhile, I’d managed to capture that. \n\nI’m no longer with my husband, so to rejoin an affair site seems silly. And I have no doubt I would need to date a few thousand men before I found another J. But SAs premise keeps the boundaries in place that J and I had. ‘All of the good, none of the bad.’ \n\nI’m a better person as a mistress. I’m less needy, less argumentative, less all-the-bad-hormonal-female-things. And from that, I get all the best parts of a man. The sexy, fun, playful, supporting parts. \n\nSA felt like a natural course of action for me. The man I see now isn’t like J. Our relationship is less organic, and there’s no amount of money that would change that. We don’t have the bond that J and I had, our lives are also very different. But we have fun. And it’s stress free. Who wouldn’t want that?",
            "author": null,
            "id": "ehqk1z4",
            "parent_id": "t1_ehpu6pe",
            "score": 3,
            "created_utc": 1551662328.0,
            "replies": [
                {
                    "body": "That makes a lot of sense. I suspect there are many women out there with similar desires but have trouble finding a dating site or app that is really appropriate for them. I suppose that's because society doesn't view sexually adventurous women as appropriate. It's hard for women to pursue an \"affair\" without being slut shammed or  descended upon by hoards of perverted piranhas. Anyway, that's the feeling I get talking to other women. ",
                    "author": "manlicksdog",
                    "id": "ehqp2ti",
                    "parent_id": "t1_ehqk1z4",
                    "score": 2,
                    "created_utc": 1551666645.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Here’s a guy that didn’t read the story \n\n/Frank Caliendo",
            "author": "mraspencer",
            "id": "ehpevct",
            "parent_id": "t1_ehpd9fx",
            "score": 4,
            "created_utc": 1551630325.0,
            "replies": [
                {
                    "body": "And he definitely will never be a J.",
                    "author": "Volturi6271",
                    "id": "ehphhp1",
                    "parent_id": "t1_ehpevct",
                    "score": 6,
                    "created_utc": 1551632395.0,
                    "replies": [
                        {
                            "body": "I’m happy as I am thanks.",
                            "author": "corpuscle103",
                            "id": "ehs0409",
                            "parent_id": "t1_ehphhp1",
                            "score": 2,
                            "created_utc": 1551719387.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I get what you were trying to do...I appreciate the inclusion of flippantly..",
            "author": null,
            "id": "ehqe414",
            "parent_id": "t1_ehpd9fx",
            "score": 1,
            "created_utc": 1551657295.0,
            "replies": []
        },
        {
            "body": "I’m not a jay but I’m a k. K? Ok. Bad joke.  ",
            "author": "lonewolfcatchesfire",
            "id": "ei24lsy",
            "parent_id": "t1_ehqjjro",
            "score": 1,
            "created_utc": 1552035496.0,
            "replies": [
                {
                    "body": "Hilarious- actually.  I like bad jokrs😂🤦🏾‍♀️",
                    "author": "fadia512",
                    "id": "ei26kw7",
                    "parent_id": "t1_ei24lsy",
                    "score": 1,
                    "created_utc": 1552038939.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "😂",
            "author": "raerae2526",
            "id": "ehqgu57",
            "parent_id": "t1_ehq02ty",
            "score": 1,
            "created_utc": 1551659565.0,
            "replies": []
        },
        {
            "body": "With me having moved states, I sometimes feel am I being a mistress to my SD",
            "author": "sugarsusie",
            "id": "ehpk80f",
            "parent_id": "t1_ehpjtm7",
            "score": 0,
            "created_utc": 1551634513.0,
            "replies": []
        },
        {
            "body": "That makes a lot of sense. I suspect there are many women out there with similar desires but have trouble finding a dating site or app that is really appropriate for them. I suppose that's because society doesn't view sexually adventurous women as appropriate. It's hard for women to pursue an \"affair\" without being slut shammed or  descended upon by hoards of perverted piranhas. Anyway, that's the feeling I get talking to other women. ",
            "author": "manlicksdog",
            "id": "ehqp2ti",
            "parent_id": "t1_ehqk1z4",
            "score": 2,
            "created_utc": 1551666645.0,
            "replies": []
        },
        {
            "body": "And he definitely will never be a J.",
            "author": "Volturi6271",
            "id": "ehphhp1",
            "parent_id": "t1_ehpevct",
            "score": 6,
            "created_utc": 1551632395.0,
            "replies": [
                {
                    "body": "I’m happy as I am thanks.",
                    "author": "corpuscle103",
                    "id": "ehs0409",
                    "parent_id": "t1_ehphhp1",
                    "score": 2,
                    "created_utc": 1551719387.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Hilarious- actually.  I like bad jokrs😂🤦🏾‍♀️",
            "author": "fadia512",
            "id": "ei26kw7",
            "parent_id": "t1_ei24lsy",
            "score": 1,
            "created_utc": 1552038939.0,
            "replies": []
        },
        {
            "body": "I’m happy as I am thanks.",
            "author": "corpuscle103",
            "id": "ehs0409",
            "parent_id": "t1_ehphhp1",
            "score": 2,
            "created_utc": 1551719387.0,
            "replies": []
        }
    ]
}