{
    "title": "Horrible overnight experience with SD",
    "post_id": "xov1ls",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/xov1ls/horrible_overnight_experience_with_sd/",
    "author": "Putrid_Bread",
    "body": "I’ve been seeing this SD for about 2mo but this is the first time I’ve ever spent the night. At first everything was fine as it normally is. We went to spa/bathhouse first then had a nice dinner and dessert, then went to a hotel for intimacy. The problems started when it was time to sleep. We stayed up until around 1am (which is fine) but I had to leave at 8am for work. I love nighttime cuddles but SD just would not stop fondling me while I was trying to sleep. I had to push his hand away multiple times until I got so frustrated that I just moved to the other side of the bed. When he finally fell asleep his snoring was out of control so I didn’t fall asleep until much later. At around 5am he starts fondling me again, trying to wake me up for morning sex. Normally that’s not a problem but 5am???? Please be forreal.  I told him bluntly not to wake me up until 7. He let me sleep until 7 then wakes me up saying I’m “a mean grumpy bitch in the mornings.” I’ve never been so annoyed in my entire life. I left without giving him morning sex but still got my ppm.  The whole experience left a bad taste in my mouth. I actually enjoyed the previous dates I had with this SD and he was pretty generous but I don’t think I’ll ever want to see him again.",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/xov1ls/horrible_overnight_experience_with_sd/",
    "score": 171,
    "upvote_ratio": 0.94,
    "created_utc": 1664224616.0,
    "num_comments": 190,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "“I am human and I neeeeed to have sleeeep, just like everyone else does”",
            "author": "LadyoftheFlow4rs",
            "id": "iq0yzsr",
            "parent_id": "t3_xov1ls",
            "score": 106,
            "created_utc": 1664228965.0,
            "replies": [
                {
                    "body": "He was acting in a criminally vulgar manner",
                    "author": "Toojew4u",
                    "id": "iq10q85",
                    "parent_id": "t1_iq0yzsr",
                    "score": 27,
                    "created_utc": 1664229693.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "iq2ijr2",
                            "parent_id": "t1_iq10q85",
                            "score": -1,
                            "created_utc": 1664255672.0,
                            "replies": [
                                {
                                    "body": "Idk, pushing hands away multiple times seems like a pretty obvious no to me, especially if they said no during it. And stressing they needed to work in the morning and needed sleep was probably another way of not directly saying no, but still saying no. Even the moving to the other side of them bed and to have him continue *after that*, it just seems weird to me",
                                    "author": "antiftmftm",
                                    "id": "iq2kry0",
                                    "parent_id": "t1_iq2ijr2",
                                    "score": 11,
                                    "created_utc": 1664257236.0,
                                    "replies": [
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "iq2lbr2",
                                            "parent_id": "t1_iq2kry0",
                                            "score": 0,
                                            "created_utc": 1664257633.0,
                                            "replies": [
                                                {
                                                    "body": "He should control himself? They shouldn't have to control him cause he has his own will and unless prior consent is given then that shouldn't happen",
                                                    "author": "antiftmftm",
                                                    "id": "iq2lji6",
                                                    "parent_id": "t1_iq2lbr2",
                                                    "score": 6,
                                                    "created_utc": 1664257792.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "He definitely goes about things the wrong way",
                    "author": "Cledaddy23",
                    "id": "iq12rvp",
                    "parent_id": "t1_iq0yzsr",
                    "score": 16,
                    "created_utc": 1664230577.0,
                    "replies": [
                        {
                            "body": "How can you say?",
                            "author": "LadyoftheFlow4rs",
                            "id": "iq13mrj",
                            "parent_id": "t1_iq12rvp",
                            "score": 5,
                            "created_utc": 1664230945.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "How soon is now??",
                    "author": "LucidDion",
                    "id": "iq1q6hb",
                    "parent_id": "t1_iq0yzsr",
                    "score": 6,
                    "created_utc": 1664241102.0,
                    "replies": []
                },
                {
                    "body": "You shut your mouth, how can you say He goes about things the wrong way?",
                    "author": "MsBeasley11",
                    "id": "iq50uj9",
                    "parent_id": "t1_iq0yzsr",
                    "score": 1,
                    "created_utc": 1664304939.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Newton's first law of motion states that \"an object at rest will remain at rest so keep your fucking hands to yourself until 7 am.\"",
            "author": "treatmelikeaslut69",
            "id": "iq1sjap",
            "parent_id": "t3_xov1ls",
            "score": 99,
            "created_utc": 1664242166.0,
            "replies": [
                {
                    "body": "Love it",
                    "author": "hereyougococo",
                    "id": "iq25zzw",
                    "parent_id": "t1_iq1sjap",
                    "score": 4,
                    "created_utc": 1664248356.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Fwiw, this happens normally without the whole Sb Sd thing. Some people mesh well during the day but not at night. I’ve been with numerous people over numerous years both in arrangements and just normally, and I can tell you that actually sleeping together is a pretty big make/break thing. Some love the numerous mid-night short love making sessions. Some hate it. Some snore. Some are light sleepers. Some toss and turn. Some you just can’t get comfortable next to. Live and learn.",
            "author": "Prestigious_Rub6238",
            "id": "iq1f6r5",
            "parent_id": "t3_xov1ls",
            "score": 38,
            "created_utc": 1664236133.0,
            "replies": [
                {
                    "body": "Yep this is so true. One of my ex SBs and I would have like have couple evening session then go to sleep then 3 am sex and then morning sex. It was our routine and when I say I have to get up early cuz of some reason she would be like ..\" okay well then we have to wake up earlier for an sex...lol.  We were together for years.  Then I have had overnight after my ex later on when my expectations were very clear and had even asked the new SB multiple times if this and that would be fine with her she would say sure no problem. Then the night came there was no second evening round and no morning sex and she snored loudly that I couldn't sleep at all. So basically 1.5 times our regular ppm for twice the negative fun. And she wondered when we were gonna have our next overnight cuz she liked it. I basically told her I'm glad one of us did and never ever.  She contacted me like a year later out of the blue and asked me if I was seeing anyone I just told her yep and she inquired if we were exclusive and I just told her that our last date wasn't the great for me and that's why I never asked her out again. The overnight just showed me we just don't have the chemistry I need.  Chemistry outside the bedroom was awesome but in the bedroom it was painful. Like nothing was good.  She was hot too.",
                    "author": "Federal_Garage_4307",
                    "id": "iq4rqwo",
                    "parent_id": "t1_iq1f6r5",
                    "score": 3,
                    "created_utc": 1664301441.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I once dumped a vanilla boyfriend because of similar behavior. I fucking HATE being woken up for sex. It’s so selfish. For him to call you a name is out of pocket. So glad you got your PPM.",
            "author": null,
            "id": "iq17qzs",
            "parent_id": "t3_xov1ls",
            "score": 91,
            "created_utc": 1664232772.0,
            "replies": [
                {
                    "body": "You’re right. It’s so selfish!!! Why is your dick emergency more important than my rest?",
                    "author": "Putrid_Bread",
                    "id": "iq18dzr",
                    "parent_id": "t1_iq17qzs",
                    "score": 52,
                    "created_utc": 1664233055.0,
                    "replies": [
                        {
                            "body": "Exactly!! Why do I need to be woken up for some needy, probably sweaty, hasn’t showered from the night before, dick? #Next.",
                            "author": null,
                            "id": "iq18pju",
                            "parent_id": "t1_iq18dzr",
                            "score": 30,
                            "created_utc": 1664233198.0,
                            "replies": [
                                {
                                    "body": "and bad breath Ms mouthwash /s",
                                    "author": "GSSD",
                                    "id": "iq3jw1x",
                                    "parent_id": "t1_iq18pju",
                                    "score": 6,
                                    "created_utc": 1664283364.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Hea a selfish a rude guy.  Stay away.",
                            "author": "Bestyoucanbe4",
                            "id": "iq4u64e",
                            "parent_id": "t1_iq18dzr",
                            "score": 5,
                            "created_utc": 1664302374.0,
                            "replies": []
                        },
                        {
                            "body": "Because your not really a “person” to him. \n\nYour a thing he met in the chat box that’s he’s giving dead presidents to💀 to open her legs on command. \n\nLol 😂",
                            "author": "PomegranateMelodic70",
                            "id": "iq2eqjd",
                            "parent_id": "t1_iq18dzr",
                            "score": 8,
                            "created_utc": 1664253190.0,
                            "replies": []
                        },
                        {
                            "body": "Ugh, yuck. I just cannot deal with that.",
                            "author": "Koroleva7z",
                            "id": "iq219p2",
                            "parent_id": "t1_iq18dzr",
                            "score": -1,
                            "created_utc": 1664246120.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Yes, exactly!! Everyone is super groggy, with bad hair and bad breath in the morning... not exactly hot and ready for sex (!)",
                    "author": "shovelkun",
                    "id": "iq3012c",
                    "parent_id": "t1_iq17qzs",
                    "score": 8,
                    "created_utc": 1664269979.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "iq3k017",
                            "parent_id": "t1_iq3012c",
                            "score": -8,
                            "created_utc": 1664283419.0,
                            "replies": [
                                {
                                    "body": "Sounds like a you problem.",
                                    "author": "thehottubistoohawt",
                                    "id": "iq4yjie",
                                    "parent_id": "t1_iq3k017",
                                    "score": 2,
                                    "created_utc": 1664304062.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "While your 100% allowed to have that view....\n\nMy Vanilla ex loves it when I woke her up for sex in the night. It made her feel wanted. Then she started doing the same thing to me and it was super hot. \n\nMaybe OP needs to discuss preferences and boundaries with SD (if she wants to continue).",
                    "author": "evad111",
                    "id": "iq2fx08",
                    "parent_id": "t1_iq17qzs",
                    "score": 7,
                    "created_utc": 1664253937.0,
                    "replies": [
                        {
                            "body": "even on weekdays when you have work at 8am?\n\n\nI wouldn't mind that on the weekend, but getting woken up at 5am right before work sounds fucking terrible",
                            "author": "baasanka24",
                            "id": "iq2whlz",
                            "parent_id": "t1_iq2fx08",
                            "score": 11,
                            "created_utc": 1664266767.0,
                            "replies": [
                                {
                                    "body": "That's absolutely ok for you to feel that way.\n\nBut this should be communicated with the SD in an adult manner. \n\nNot all people have the same desires and boundaries.\n\n Communicate and compromise.",
                                    "author": "evad111",
                                    "id": "iq2wqvv",
                                    "parent_id": "t1_iq2whlz",
                                    "score": 6,
                                    "created_utc": 1664266994.0,
                                    "replies": [
                                        {
                                            "body": "Sounds like she made it pretty clear. He crossed the line using inappropriate language and not respecting her body language of pushing him away and even moving away. Communication is key just sucks he decided to not listen and respond horribly.",
                                            "author": "eshtahnohs",
                                            "id": "iq57nba",
                                            "parent_id": "t1_iq2wqvv",
                                            "score": 7,
                                            "created_utc": 1664307555.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Sounds like he doesn’t respect boundaries. You can’t teach an old dog new tricks.",
                            "author": "thehottubistoohawt",
                            "id": "iq4yn4s",
                            "parent_id": "t1_iq2fx08",
                            "score": 5,
                            "created_utc": 1664304100.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Don’t ever see him again.",
            "author": "Unlikely_Garbage_861",
            "id": "iq17klv",
            "parent_id": "t3_xov1ls",
            "score": 30,
            "created_utc": 1664232693.0,
            "replies": []
        },
        {
            "body": "I’ve been woken up being touched by several men and it is a very violating, frustrating, and angering experience.",
            "author": "darthveevles",
            "id": "iq1fzhp",
            "parent_id": "t3_xov1ls",
            "score": 33,
            "created_utc": 1664236498.0,
            "replies": [
                {
                    "body": "I had a bf who did this too and I told him to stop or else. He said he did it in his sleep. Okay, bring on the body pillow barrier.",
                    "author": "thehottubistoohawt",
                    "id": "iq4yuh3",
                    "parent_id": "t1_iq1fzhp",
                    "score": 3,
                    "created_utc": 1664304177.0,
                    "replies": [
                        {
                            "body": "I legit don’t understand it… like what do you think you’re doing trying to finger me while I’m asleep?",
                            "author": "darthveevles",
                            "id": "iq50gq0",
                            "parent_id": "t1_iq4yuh3",
                            "score": 5,
                            "created_utc": 1664304792.0,
                            "replies": [
                                {
                                    "body": "Men are perverse and they will always see what they can get away with.",
                                    "author": "thehottubistoohawt",
                                    "id": "iqxcq97",
                                    "parent_id": "t1_iq50gq0",
                                    "score": 2,
                                    "created_utc": 1664827035.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "At once?",
                    "author": "DarthNylus",
                    "id": "iq225pb",
                    "parent_id": "t1_iq1fzhp",
                    "score": 2,
                    "created_utc": 1664246530.0,
                    "replies": [
                        {
                            "body": "😎",
                            "author": "hereyougococo",
                            "id": "iq2635o",
                            "parent_id": "t1_iq225pb",
                            "score": 0,
                            "created_utc": 1664248399.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "He needs to respect you, your boundaries and treat you properly.",
            "author": "Awkward_Solution_567",
            "id": "iq0uv20",
            "parent_id": "t3_xov1ls",
            "score": 44,
            "created_utc": 1664227281.0,
            "replies": []
        },
        {
            "body": "So let's see.... late night fondling, snoring, 5 am horniness, morning grumpiness... you left out drooling, stealing the covers, bad breathe and cold feet.",
            "author": "BinghamtonSD",
            "id": "iq0yta7",
            "parent_id": "t3_xov1ls",
            "score": 30,
            "created_utc": 1664228890.0,
            "replies": []
        },
        {
            "body": "I commented to someone else trying to downplay this, but I want to extend my sincere apologies that you experienced something like this. There is absolutely never a situation where your boundaries should be violated no matter how “small” or “insignificant” it might seem on the surface. A boundary is a boundary and not all boundaries need to be explicitly stated in order for them to be respected. Micro traumas like this can have an effect on the body, nervous system, and subconscious. Do whatever you need to do to process, block the guy, and move forward. Sending you some light & love. 💕",
            "author": null,
            "id": "iq1oezc",
            "parent_id": "t3_xov1ls",
            "score": 22,
            "created_utc": 1664240321.0,
            "replies": [
                {
                    "body": "The amount of men in this thread making it seem like it was somehow my fault is really astounding",
                    "author": "Putrid_Bread",
                    "id": "iq3jyp0",
                    "parent_id": "t1_iq1oezc",
                    "score": 12,
                    "created_utc": 1664283400.0,
                    "replies": [
                        {
                            "body": "This is why men are from mars and women are from Venus, except today’s world women are from Mercury.   Regardless, you had boundaries and expectations that were defined.  In a long term relationship, couples usually already worked this stuff out and becomes a non-issue.  The same thing with SR, I’ve had multiple stay overs and it only takes 1-2 nights to sort it out.  I’ve had SB that enjoyed the middle of night fondling and touching, she looks forward to being touched than just sex.  Men here aren’t blaming you, it’s the sort of adjustments or compromising that you need to learn if you want to have any sort of meaningful relationship in the future.",
                            "author": "MKTekke",
                            "id": "iq3qf1k",
                            "parent_id": "t1_iq3jyp0",
                            "score": -3,
                            "created_utc": 1664286495.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Completely agree. This topic really shouldn’t be downplayed.\n\nIf someone likes being woken up by sex, that’s great, but it needs to be agreed upon beforehand. Let’s not forget that consent cannot be given when you are asleep.",
                    "author": "Gee_n_tonic",
                    "id": "iq3fwut",
                    "parent_id": "t1_iq1oezc",
                    "score": 8,
                    "created_utc": 1664281276.0,
                    "replies": [
                        {
                            "body": "Yes, this behavior is super rapey.",
                            "author": "thehottubistoohawt",
                            "id": "iq4z5no",
                            "parent_id": "t1_iq3fwut",
                            "score": 5,
                            "created_utc": 1664304296.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Exactly why in 7 years of being a SB I’ve NEVER spent a night with a SD. I appreciate people like you who share your experience and am sorry this happened, he’s clearly a 🐷",
            "author": "spicycookie26",
            "id": "iq169ab",
            "parent_id": "t3_xov1ls",
            "score": 34,
            "created_utc": 1664232107.0,
            "replies": [
                {
                    "body": "I think I’ve just been spoiled by my SBF. As soon as he falls asleep he turns in the opposite direction and doesn’t move until 8am 😭",
                    "author": "Putrid_Bread",
                    "id": "iq17hal",
                    "parent_id": "t1_iq169ab",
                    "score": 35,
                    "created_utc": 1664232653.0,
                    "replies": [
                        {
                            "body": "AS HE SHOULD 🫡",
                            "author": "spicycookie26",
                            "id": "iq1dd3d",
                            "parent_id": "t1_iq17hal",
                            "score": 22,
                            "created_utc": 1664235307.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Sure seems like an overnight date would ruin the SD/SB fantasy of it all. Glad I read this, I actually suggested it to my SB but now no way I want it.",
            "author": "PonyboyCurtisss",
            "id": "iq2pfpj",
            "parent_id": "t3_xov1ls",
            "score": 6,
            "created_utc": 1664260751.0,
            "replies": []
        },
        {
            "body": "Honestly that is sexual harassment. I did a ppm with a guy I just met and we stayed in a hotel but he was so Fcking gross (he was like burping multiple times and stuff). We did the deed and I was ready to go to sleep, but he kept dry humping me even when I told him to stop. I would ignore it but then he’d put his hands down my pants and scratch up my vag. He would also lick my neck. This fucking happened until like 3am and it was the worst. I felt so gross after I immediately had a shower and tried to forget about it . Looking back now I would have fcking slapped him and walked out but I couldn’t coz I can’t drive and it was in a small town in the middle of the night. Definitely not ever doing that again but he still messages me til this day once a month lol",
            "author": "neutralvibez",
            "id": "iq3cdho",
            "parent_id": "t3_xov1ls",
            "score": 13,
            "created_utc": 1664279252.0,
            "replies": [
                {
                    "body": "Ugh that’s so disgusting. I’m sorry that happened to you. A lot of men on this thread think that it’s okay to harass a girl while she’s sleeping if they’re paying her it’s very concerning",
                    "author": "Putrid_Bread",
                    "id": "iq3l5mb",
                    "parent_id": "t1_iq3cdho",
                    "score": 7,
                    "created_utc": 1664283993.0,
                    "replies": [
                        {
                            "body": "and those same men will complain that SBs don't want to do overnight!",
                            "author": "LightOLove",
                            "id": "iq3uwy5",
                            "parent_id": "t1_iq3l5mb",
                            "score": 8,
                            "created_utc": 1664288462.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Reasons I don’t do overnights or vacations. SD’s just treat them like a fuckfest.",
            "author": "jaystanding",
            "id": "iq45e2l",
            "parent_id": "t3_xov1ls",
            "score": 2,
            "created_utc": 1664292762.0,
            "replies": []
        },
        {
            "body": "I'm sorry this happened to you and I'm sorry so many of the sugar daddies on here are showing their whole ass.  Fondling someone while they are sleeping is never okay unless they have given you explicit permission to do it.  It's not cool to just treat someone like a sex object; for all of the talk sugar daddies have on here about SR being special, they get mighty annoyed when anyone enforces a boundary.",
            "author": "throwaway38729384729",
            "id": "iq4e5wk",
            "parent_id": "t3_xov1ls",
            "score": 5,
            "created_utc": 1664296189.0,
            "replies": [
                {
                    "body": "Because they use the word sugar daddy to cover up what they really are. I’m glad that you as a man can see this. This isn’t a safe sub for women.",
                    "author": "Callistolady",
                    "id": "iq9h2s8",
                    "parent_id": "t1_iq4e5wk",
                    "score": 5,
                    "created_utc": 1664387361.0,
                    "replies": [
                        {
                            "body": "I completely agree, I dont think any sub on reddit is safe for anyone, especially women.",
                            "author": "Silly-Investment-598",
                            "id": "itg15m4",
                            "parent_id": "t1_iq9h2s8",
                            "score": 1,
                            "created_utc": 1666524090.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "You should have farted and killed the mood.....unless he’s into that sort of thing 😂",
            "author": "genericMaker",
            "id": "iq57mbc",
            "parent_id": "t3_xov1ls",
            "score": 4,
            "created_utc": 1664307545.0,
            "replies": []
        },
        {
            "body": "It’s so insane how horniness can cause someone ppl to become insanely inconsiderate.",
            "author": "Agitated_Ruin132",
            "id": "iq1uyzz",
            "parent_id": "t3_xov1ls",
            "score": 12,
            "created_utc": 1664243252.0,
            "replies": [
                {
                    "body": "Men, you mean men.",
                    "author": "thehottubistoohawt",
                    "id": "iq4yxr3",
                    "parent_id": "t1_iq1uyzz",
                    "score": 5,
                    "created_utc": 1664304211.0,
                    "replies": [
                        {
                            "body": "lmao exactly",
                            "author": "Agitated_Ruin132",
                            "id": "iq4zo5v",
                            "parent_id": "t1_iq4yxr3",
                            "score": 3,
                            "created_utc": 1664304491.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I’m so sorry you had to go through that OP. No one has the right to touch anyone who is sleeping unless they discuss it beforehand. We aren’t slabs of meat. We are humans who deserve respect at minimum. He sounds like a desperate loser who can’t handle rejection.",
            "author": "who-is-that-",
            "id": "iq1h0vg",
            "parent_id": "t3_xov1ls",
            "score": 13,
            "created_utc": 1664236977.0,
            "replies": [
                {
                    "body": "Thank you! It’s really wild that some of the men in this thread are trying to make it seem like it’s normal and should be expected",
                    "author": "Putrid_Bread",
                    "id": "iq1nfdg",
                    "parent_id": "t1_iq1h0vg",
                    "score": 11,
                    "created_utc": 1664239870.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Personally I would not do an overnight where she has to be at work at 8am. Preferably weekend night overnight where both of us can sleep in. Morning sex won't be rushed.\n\nI do snore. For the next overnight I do I will put a breath right on so she can get sleep.",
            "author": "southernslick",
            "id": "iq1fqs0",
            "parent_id": "t3_xov1ls",
            "score": 13,
            "created_utc": 1664236386.0,
            "replies": [
                {
                    "body": "I always schedule when she's off work, unless she doesn't have a job so it doesn't matter much. But not going to set up an overnight where one of us has to leave early. I'm not a morning person so Iike time to have coffee and not be rushed",
                    "author": "Daddy_Dom_47",
                    "id": "iq2brp5",
                    "parent_id": "t1_iq1fqs0",
                    "score": 4,
                    "created_utc": 1664251406.0,
                    "replies": []
                },
                {
                    "body": "Yeah I was surprised to read the first overnight was the day before morning work. \nI always assume I won’t sleep well with a new person in bed. Nonetheless, SD should have been more respectful of OP’s request.",
                    "author": "261chameleons",
                    "id": "iq23kqb",
                    "parent_id": "t1_iq1fqs0",
                    "score": 7,
                    "created_utc": 1664247197.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yep, he’s a bad one…",
            "author": "BigTinBaltimore",
            "id": "iq2am4m",
            "parent_id": "t3_xov1ls",
            "score": 8,
            "created_utc": 1664250750.0,
            "replies": []
        },
        {
            "body": "Rule on morning sex is give both a chance to brush their teeth first. A few do like to wake you up with a bj, which is always welcome! \n\nAs for over night. Always drop a hint at dinner time about how I like to cuddle then... when sleep time comes there should be an imaginary line between us for the night!",
            "author": "SD_AU",
            "id": "iq1dln3",
            "parent_id": "t3_xov1ls",
            "score": 9,
            "created_utc": 1664235413.0,
            "replies": [
                {
                    "body": "I'm not a morning person so I always give a heads up. \"Hey, when I wake up, just leave me alone. Let me go to the bathroom, get a cigarette and a cup of coffee.\" Thought that was common courtesy.",
                    "author": "Daddy_Dom_47",
                    "id": "iq2by49",
                    "parent_id": "t1_iq1dln3",
                    "score": 6,
                    "created_utc": 1664251506.0,
                    "replies": [
                        {
                            "body": "I am totally good with a surprise heads up myself :P",
                            "author": "SD_AU",
                            "id": "iq68dk5",
                            "parent_id": "t1_iq2by49",
                            "score": 1,
                            "created_utc": 1664322913.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I'm so sorry this happened to you. He was completely out of line. It does not matter how much someone pays you, they do not have free agency over you. You held up your end of the bargain, how does one feel ok to continuously make another person feel uncomfortable then call you a bitch?? F that. That man is a scum bag and I can't believe anyone is defending him.",
            "author": "gaytoradee",
            "id": "iq1n246",
            "parent_id": "t3_xov1ls",
            "score": 8,
            "created_utc": 1664239708.0,
            "replies": []
        },
        {
            "body": "SD or not… I KNOW THAT EXACT FEELING OF IMMENSE IRRITATION!!!\n\nOmg, I thought I was the only one too — then I felt guilty that I was irritated with the guy, even tho I’d told him I had to be up for work by 6AM.\n\nI. Was. Pissed. \n\nThen I have to go in and work with sick patients all day feeling exhausted. It’s misery at its best.",
            "author": "Koroleva7z",
            "id": "iq213jl",
            "parent_id": "t3_xov1ls",
            "score": 10,
            "created_utc": 1664246040.0,
            "replies": []
        },
        {
            "body": "You are nice because i like my sleep lmao.",
            "author": "Awkward_Pop_3996",
            "id": "iq185f4",
            "parent_id": "t3_xov1ls",
            "score": 6,
            "created_utc": 1664232949.0,
            "replies": []
        },
        {
            "body": "I'm sorry this happened to you! I have a firm boundary of not sleeping over. On the rare chance we've been dating a while and I feel comfortable with them (and we are planning ahead for a trip or something) I'll request my own bedroom (or bed, if it's a yurt in Taos) where I am sleeping by myself after intimacy. I definitely didn't know how to discuss it in the beginning!",
            "author": "nipstittykitty",
            "id": "iq1yxf4",
            "parent_id": "t3_xov1ls",
            "score": 6,
            "created_utc": 1664245046.0,
            "replies": []
        },
        {
            "body": "I’m not big on overnights for this reason.  I might be the only SD that gets separate rooms or at least separate beds.  You",
            "author": "LotBuilder",
            "id": "iq22oa0",
            "parent_id": "t3_xov1ls",
            "score": 7,
            "created_utc": 1664246777.0,
            "replies": []
        },
        {
            "body": "Ugh, I don't blame you, he sounds thoughtless(and rude).",
            "author": "SDInLeather",
            "id": "iq47hcj",
            "parent_id": "t3_xov1ls",
            "score": 3,
            "created_utc": 1664293590.0,
            "replies": []
        },
        {
            "body": "I'm not sure about your particular situation but if he's your SD why are you still working? Isn't the entire idea is that you no longer need to work? I'm not critiquing just confused :)",
            "author": null,
            "id": "iq5dwql",
            "parent_id": "t3_xov1ls",
            "score": 3,
            "created_utc": 1664309944.0,
            "replies": [
                {
                    "body": "So I’m supposed to rely on a man I’ve only known for two months for all of my income?\n\nThe men on this sub are so funny. If a girl relies on a SD for all of her income y’all berate her for being desperate and not having a job. I actually have a job and you’re saying “why are you working if you have a SD” please be fucking for real",
                    "author": "Putrid_Bread",
                    "id": "iq5g2sk",
                    "parent_id": "t1_iq5dwql",
                    "score": 6,
                    "created_utc": 1664310777.0,
                    "replies": [
                        {
                            "body": "I am female. \n\nI was asking a genuine question, you've answered it thank you.",
                            "author": null,
                            "id": "iq5gxxw",
                            "parent_id": "t1_iq5g2sk",
                            "score": 2,
                            "created_utc": 1664311106.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Never rely entirely on a man regardless of his generosity or the nature of your relationship. Always have your own source of income  because you never know what tomorrow could bring. He could pass away, drop you or even turn abusive.\n\nBeing a kept woman is great but always make sure that if your relationship ended abruptly you have enough money coming in to keep a roof over your head and support yourself.",
                    "author": "LightOLove",
                    "id": "iq8ql8c",
                    "parent_id": "t1_iq5dwql",
                    "score": 2,
                    "created_utc": 1664377009.0,
                    "replies": [
                        {
                            "body": "That makes sense, it's an interesting relationship model. I think I'm too insubordinate to ever seriously consider that path.",
                            "author": null,
                            "id": "iq9k8cl",
                            "parent_id": "t1_iq8ql8c",
                            "score": 3,
                            "created_utc": 1664388594.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "This is why I don't sleep in the same room as men.",
            "author": null,
            "id": "iq0xirb",
            "parent_id": "t3_xov1ls",
            "score": 17,
            "created_utc": 1664228360.0,
            "replies": [
                {
                    "body": "Same here, Wagyu.",
                    "author": "ORD-inary",
                    "id": "iq1h4fl",
                    "parent_id": "t1_iq0xirb",
                    "score": 4,
                    "created_utc": 1664237022.0,
                    "replies": [
                        {
                            "body": "Technically, you are a man, and you sleep in the same room as yourself.\n\nThis message brought to you be Pedantics-R-Us.",
                            "author": "SD6ix",
                            "id": "iq1rins",
                            "parent_id": "t1_iq1h4fl",
                            "score": 6,
                            "created_utc": 1664241698.0,
                            "replies": [
                                {
                                    "body": "Brought to you by -XXL-pedantics, but unless he's more than one man, his statement stands.",
                                    "author": "justabebeh",
                                    "id": "iq24v54",
                                    "parent_id": "t1_iq1rins",
                                    "score": 5,
                                    "created_utc": 1664247801.0,
                                    "replies": [
                                        {
                                            "body": "I stand out-pedanted!",
                                            "author": "SD6ix",
                                            "id": "iq5njkk",
                                            "parent_id": "t1_iq24v54",
                                            "score": 1,
                                            "created_utc": 1664313701.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "If he's generous, communicate your needs to him ASAP and tell him you enjoy spending time with him but for overnights, you need X, Y and Z .. can he respect that?",
            "author": "vince539839",
            "id": "iq152jh",
            "parent_id": "t3_xov1ls",
            "score": 4,
            "created_utc": 1664231579.0,
            "replies": []
        },
        {
            "body": "His fault! He started to think he has loser vanilla privileges of long cuddle time and super early am sex! You should next his ass.",
            "author": null,
            "id": "iq0tbyk",
            "parent_id": "t3_xov1ls",
            "score": 1,
            "created_utc": 1664226673.0,
            "replies": [
                {
                    "body": "Why are those “loser” privileges lol?",
                    "author": "JDMultralight",
                    "id": "iq1rwya",
                    "parent_id": "t1_iq0tbyk",
                    "score": 2,
                    "created_utc": 1664241879.0,
                    "replies": [
                        {
                            "body": "It’s because the same chica won’t bat an eyelid if a loser vanilla who had nothing  to offer financially did exactly the same thing as this SD. She might take all of that as signs of “true love”!!!!!",
                            "author": null,
                            "id": "iq1xizu",
                            "parent_id": "t1_iq1rwya",
                            "score": -4,
                            "created_utc": 1664244411.0,
                            "replies": [
                                {
                                    "body": "Lol who is the sample size here, I can just about tolerate extended cuddles in the morning if I'm getting paid, but some 'loser vanilla' is getting kicked out...",
                                    "author": "shovelkun",
                                    "id": "iq306ck",
                                    "parent_id": "t1_iq1xizu",
                                    "score": 5,
                                    "created_utc": 1664270114.0,
                                    "replies": []
                                },
                                {
                                    "body": "I mean keeping her up when she’s stressed she won’t sleep for work is probably something she’d probably have a big problem with anyone.  \n\nYou’re right that an instance of annoying sexual persistence wouldn’t be met with the same kind of outrage.  I think a lot of the time the dynamic is the SD harvesting sex from SB and her “giving it up” even in cases where she really likes it.  It’s one reason to be very careful with BDSM etc in SRs.  Its tough because the sex I prefer is often with me taking an “uncompromising” stance for the sake of the energy, but it could be read as regular demands rather than artfully contrived demanding vibe.",
                                    "author": "JDMultralight",
                                    "id": "iq46it5",
                                    "parent_id": "t1_iq1xizu",
                                    "score": 2,
                                    "created_utc": 1664293211.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "No. I’m sorry this is rude and disrespectful vanilla or not. It would be an issue vanilla or not. \nHilarious comments.",
                    "author": "blndy2022",
                    "id": "iq5bxu2",
                    "parent_id": "t1_iq0tbyk",
                    "score": 1,
                    "created_utc": 1664309185.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "SD just would not stop fondling me\n\nAh, the old \"I paid you so you have to grin and bear it\" syndrome. This should be discussed by all partners before the first overnight.One SB told me ahead of time that when she's asleep no hugging, spooning,of generally sexually assaulting her. I appreciated it, but missed the cuddling. \n\nThat is also the difference between a couple who love each other or are equally turned on together vs an arrangement that doesn't involve those things.  \n\nSo have that talk if you ever do another ON. More likely, just don't do ONs at all. Sadly, a good SR is likely over because the guy acted badly on the ON.",
            "author": "GSSD",
            "id": "iq3jh6i",
            "parent_id": "t3_xov1ls",
            "score": 2,
            "created_utc": 1664283158.0,
            "replies": [
                {
                    "body": "Im always worried about the “I paid you to grin and bear it” dynamic given that I think my best persona/style has a demanding/dom kind or vibe.  Sex early in an SR can be rough because I want to bring my “best self” while communicating that my harsher attitude is a flavor of me she can choose - or she can have another.\n\nHard to communicate this because submissiveness can look the same whether it’s being tolerated or enjoyed.",
                    "author": "JDMultralight",
                    "id": "iq47mbs",
                    "parent_id": "t1_iq3jh6i",
                    "score": 3,
                    "created_utc": 1664293644.0,
                    "replies": []
                },
                {
                    "body": "I don’t think this has anything to do with if the couple loves one another or not. In fact it sounds like you’re downplaying it like it’s only irritating because she doesn’t love him and it’s an arrangement. I can almost guarantee most women in love or not would not like to be fondled all night long and woken up multiple hours before they have to work all day. \nOn the weekend? Sure probably not a big deal. \nBut this had nothing to do with love or an arrangement and everything to do with someone overstepping boundaries he didn’t discuss beforehand and being rude only caring about himself when she had to work the next day.",
                    "author": "blndy2022",
                    "id": "iq5bl08",
                    "parent_id": "t1_iq3jh6i",
                    "score": 1,
                    "created_utc": 1664309048.0,
                    "replies": [
                        {
                            "body": ">  it sounds like -- it’s only irritating because she doesn’t love him and it’s an arrangement.\n\ntrue that. That is not to say a loving couple should submit to random fondling, but some actually welcome it. But anything can get old after a long time together.",
                            "author": "GSSD",
                            "id": "iq5nl3y",
                            "parent_id": "t1_iq5bl08",
                            "score": 1,
                            "created_utc": 1664313719.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "My main complaints about SBs who sleep over is that often they don’t sleep until like 4-5am.  After intimacy, they usually live on their phone for 2-3 hours until like 4-5am.  That’s usually how they put up with the snoring, since men usually don’t snore the entire night.  Once men goes into deep sleep then the snoring stops.  That’s when the SB goes to sleep and usually they wake up around 11am.  One of my SBs in the past basically a night owl so it works out for her staying over my place.",
            "author": "MKTekke",
            "id": "iq3regu",
            "parent_id": "t3_xov1ls",
            "score": 1,
            "created_utc": 1664286934.0,
            "replies": []
        },
        {
            "body": "Why did you go for an overnight when you had work at 8am is my question? \n\nHe’s def a dick, but yeah I would’ve told my SB to not come by with work in the AM. Don’t wanna be on a time constraint or rush her or myself",
            "author": "lagrangianblunt",
            "id": "iq1m4zw",
            "parent_id": "t3_xov1ls",
            "score": -6,
            "created_utc": 1664239295.0,
            "replies": [
                {
                    "body": "Because he insisted? Just because you wouldn’t do it doesn’t mean someone else won’t. Even if I didn’t have to be anywhere in the morning that still doesn’t make what he did okay. \n\nNormally I try to go home around midnight but this time he said “why not just stay the night? It’s already late. I’ll get you an Uber to work in the morning.” We had another round before agreeing to go to sleep. Nothing out of the ordinary.",
                    "author": "Putrid_Bread",
                    "id": "iq1o3ef",
                    "parent_id": "t1_iq1m4zw",
                    "score": 11,
                    "created_utc": 1664240175.0,
                    "replies": [
                        {
                            "body": "As I said in my first comment he is still in the wrong, but yeah an overnight with work at 8am just doesn’t sound like it’ll be fun for either involved. \n\nIf I pay for an overnight I’d want morning sex or else what’s the point really, and if she had work at 8am I don’t think that’s doable. So yeah, just wouldn’t do it.",
                            "author": "lagrangianblunt",
                            "id": "iq1ou5v",
                            "parent_id": "t1_iq1o3ef",
                            "score": -7,
                            "created_utc": 1664240506.0,
                            "replies": [
                                {
                                    "body": "As I said in the post I had to *leave* at 8 so there was plenty of time. I told him to wake me up at 7am specifically so we could have morning sex. I would’ve had sex with him in the morning if he hadn’t pestered me all night and call me a bitch in the morning. So what you’re saying doesn’t really apply",
                                    "author": "Putrid_Bread",
                                    "id": "iq1rnfm",
                                    "parent_id": "t1_iq1ou5v",
                                    "score": 19,
                                    "created_utc": 1664241760.0,
                                    "replies": [
                                        {
                                            "body": "He acted wrong but I’m just saying, I can see how an overnight ppm when you have early plans the next day can result in a negative situation.",
                                            "author": "lagrangianblunt",
                                            "id": "iq26qxq",
                                            "parent_id": "t1_iq1rnfm",
                                            "score": -8,
                                            "created_utc": 1664248730.0,
                                            "replies": [
                                                {
                                                    "body": "It was a negative situation because he kept foundling  her in her sleep and woke her up at 5am for morning sex, if you want morning sex at least be considerate and set a time with you're partner And he didn't have a problem with her having to leave at a certain time so that argument doesn't matter at all to the situation",
                                                    "author": "throwthewholepieaway",
                                                    "id": "iq485kh",
                                                    "parent_id": "t1_iq26qxq",
                                                    "score": 2,
                                                    "created_utc": 1664293851.0,
                                                    "replies": [
                                                        {
                                                            "body": "You’re disgusting",
                                                            "author": null,
                                                            "id": "iryg0th",
                                                            "parent_id": "t1_iq485kh",
                                                            "score": 1,
                                                            "created_utc": 1665531530.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "body": "“Overnight ppm”? So you admit you’re paying for sexual services. Genuine question, why don’t you just hire an escort? Oh right, you’re broke and need to exploit an underprivileged young girl who can’t say no",
                                                    "author": "okkk0",
                                                    "id": "iqljr2k",
                                                    "parent_id": "t1_iq26qxq",
                                                    "score": 0,
                                                    "created_utc": 1664607641.0,
                                                    "replies": [
                                                        {
                                                            "body": "Do you see the Reddit page you’re on? Lol. Nice try. \n\nDon’t see you giving OP shit for sugaring? When she literally was planning to do the same",
                                                            "author": "lagrangianblunt",
                                                            "id": "iqlkfbz",
                                                            "parent_id": "t1_iqljr2k",
                                                            "score": 1,
                                                            "created_utc": 1664608200.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Idk what you’re talking about but aren’t you late for your shift at Walmart?",
                                                                    "author": "okkk0",
                                                                    "id": "iqlkl51",
                                                                    "parent_id": "t1_iqlkfbz",
                                                                    "score": 1,
                                                                    "created_utc": 1664608334.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Money money money !!!!",
                    "author": null,
                    "id": "iq39cdc",
                    "parent_id": "t1_iq1m4zw",
                    "score": -2,
                    "created_utc": 1664277347.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Lots of guys get horny in the morning. It is biological. Early morning sex is a great part of a sleepover. I think your problems came from poor communication, poor understanding (respect) of the fact that you needed to get to work early, and sleeping compatibility.\n\n”Look, I can stay over tonight but I need uninterrupted sleep from 1 AM until 7 AM… (maybe with a quickie at 7 AM) OR we can plan it on another night when I don’t have to get up for work in the morning.”\n\nI don’t fault him for wanting early morning sex but it was really inconsiderate if you clearly stated that you need to sleep because of work.\n\nIt also sounds like an issue of compatibility. Clearly you’re not up for the 5 AM sex. Lots of people just need to sleep alone even if they love affection. Sometimes I’ll get a room with two beds for flexability, especially if I’m uncertain of a SBs sleeping habits. It doesn’t necessarily mean that we will use two beds, but the option is there if needed.",
            "author": "SDchat",
            "id": "iq39321",
            "parent_id": "t3_xov1ls",
            "score": -2,
            "created_utc": 1664277172.0,
            "replies": []
        },
        {
            "body": "I'm gonna go on blast for this probably .. but if he's being financially generous and you're spending the night...don't expect to get much sleep.  I basically write off any night I spend with a Man and try to make sure I have the next afternoon free to sleep, after he's done with me.",
            "author": null,
            "id": "iq1g5c9",
            "parent_id": "t3_xov1ls",
            "score": -17,
            "created_utc": 1664236573.0,
            "replies": [
                {
                    "body": "We were already up fucking until 1am. It’s fine if you don’t have boundaries but I do",
                    "author": "Putrid_Bread",
                    "id": "iq1lhx1",
                    "parent_id": "t1_iq1g5c9",
                    "score": 19,
                    "created_utc": 1664239006.0,
                    "replies": []
                },
                {
                    "body": "Yikes",
                    "author": "LightOLove",
                    "id": "iq2cf33",
                    "parent_id": "t1_iq1g5c9",
                    "score": 6,
                    "created_utc": 1664251785.0,
                    "replies": []
                },
                {
                    "body": "Just…ew",
                    "author": "Lar5031",
                    "id": "iq2b0cg",
                    "parent_id": "t1_iq1g5c9",
                    "score": 7,
                    "created_utc": 1664250974.0,
                    "replies": []
                },
                {
                    "body": "Not getting much sleep isn’t the issue here. It’s the lack of respect for her boundaries and the egregious oversight on his part that somehow any part of her body suddenly becomes ripe for his touching regardless of money being exchanged. Micro traumas such as this can have lasting impacts on the body and subconscious. In no way does spending the night give anyone a free pass to do whatever they want to you as you sleep.",
                    "author": null,
                    "id": "iq1kbml",
                    "parent_id": "t1_iq1g5c9",
                    "score": 17,
                    "created_utc": 1664238477.0,
                    "replies": []
                },
                {
                    "body": "> after he's done with me\n\nDoesn't sound like sugar to me.",
                    "author": "GSSD",
                    "id": "iq3l980",
                    "parent_id": "t1_iq1g5c9",
                    "score": 3,
                    "created_utc": 1664284042.0,
                    "replies": []
                },
                {
                    "body": "After he's done with you? This is sugar relationships, not escorting. \n\nThe point of spending the night is to cuddle and sleep together. Not to have more sex or am sex. It's not a 2fer...",
                    "author": "WhisperingPetals",
                    "id": "iq1wsrh",
                    "parent_id": "t1_iq1g5c9",
                    "score": 7,
                    "created_utc": 1664244081.0,
                    "replies": [
                        {
                            "body": "I stopped reading at the ”after he’s done with me” part",
                            "author": null,
                            "id": "iq24aax",
                            "parent_id": "t1_iq1wsrh",
                            "score": 5,
                            "created_utc": 1664247527.0,
                            "replies": []
                        },
                        {
                            "body": "You can't have it both ways. It's either an sr or escorting. In an \"sr\" there's no such thing as a 2fer. You don't count the number of times you have sex. \n\nI agree with OP 100%. I'm just pointing out your inconsistency.",
                            "author": "DarthNylus",
                            "id": "iq23ko4",
                            "parent_id": "t1_iq1wsrh",
                            "score": 1,
                            "created_utc": 1664247195.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Seriously, why are You down voting me?  I'm being realistic",
                    "author": null,
                    "id": "iq1kfjx",
                    "parent_id": "t1_iq1g5c9",
                    "score": -10,
                    "created_utc": 1664238526.0,
                    "replies": [
                        {
                            "body": "Being expected to stay awake all night is not realistic, it’s being taken advantage of",
                            "author": "RealEarthAngel",
                            "id": "iq1xupx",
                            "parent_id": "t1_iq1kfjx",
                            "score": 10,
                            "created_utc": 1664244557.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Denying morning sex is a capital sin!  😀",
            "author": "gapaf",
            "id": "iq1egjm",
            "parent_id": "t3_xov1ls",
            "score": -19,
            "created_utc": 1664235804.0,
            "replies": [
                {
                    "body": "She didn’t deny morning sex, she asked for it to happen after 7am. Not to be woken up multiple times throughout the night and into the wee morning hours. There’s definitely a difference!",
                    "author": null,
                    "id": "iq2ch5x",
                    "parent_id": "t1_iq1egjm",
                    "score": 8,
                    "created_utc": 1664251819.0,
                    "replies": [
                        {
                            "body": "I wonder what happened to sense of humor?  Plus I never heard there was a function or setup you could do so your cock would get morning wood at specific time. \nI agree with the guy, OP is a grump biatch. She didn’t feel bad for his generosity. \nI don’t buy this 8AM shit. She has her whole life to sleep, why doing it exactly on the night or her sleepover? \nAs I usually say, many SBs are delusional on reality and expectations.",
                            "author": "gapaf",
                            "id": "iq2n5c3",
                            "parent_id": "t1_iq2ch5x",
                            "score": -8,
                            "created_utc": 1664258978.0,
                            "replies": [
                                {
                                    "body": "No wonder some of y’all have to pay for a girlfriend. You’re all insufferable",
                                    "author": "Putrid_Bread",
                                    "id": "iq3kaj7",
                                    "parent_id": "t1_iq2n5c3",
                                    "score": 9,
                                    "created_utc": 1664283564.0,
                                    "replies": [
                                        {
                                            "body": "No wonder you have to resort to sugar!  It is a two face coin babe! 😀",
                                            "author": "gapaf",
                                            "id": "iq3xky0",
                                            "parent_id": "t1_iq3kaj7",
                                            "score": -4,
                                            "created_utc": 1664289584.0,
                                            "replies": [
                                                {
                                                    "body": "Embarrassing that you’re proud of exploiting vulnerable women",
                                                    "author": "okkk0",
                                                    "id": "iqljfiy",
                                                    "parent_id": "t1_iq3xky0",
                                                    "score": 2,
                                                    "created_utc": 1664607375.0,
                                                    "replies": [
                                                        {
                                                            "body": "Embarassed you don’t understand the basics of what you intend to do. You are not vulnerable, mostly weak, probably lazy.",
                                                            "author": "gapaf",
                                                            "id": "iqlvwh0",
                                                            "parent_id": "t1_iqljfiy",
                                                            "score": 1,
                                                            "created_utc": 1664618345.0,
                                                            "replies": [
                                                                {
                                                                    "body": "You’re literally a social pariah who’s been outcasted from society and has to pay for basic human companionship😂",
                                                                    "author": "okkk0",
                                                                    "id": "iqnbrpq",
                                                                    "parent_id": "t1_iqlvwh0",
                                                                    "score": 2,
                                                                    "created_utc": 1664645536.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "It seems that you are just not that into him. I can't believe this would be anywhere near like this for you, if you were both crazy about each other.",
            "author": "karanaka6721",
            "id": "iq131nt",
            "parent_id": "t3_xov1ls",
            "score": -16,
            "created_utc": 1664230694.0,
            "replies": [
                {
                    "body": "I don’t see how you gathered that I’m not into him from what I posted? We’ve been seeing each other for 2mo prior to this and everything was good but it’s not like we were in love with each other. It’s an arrangement. If it were vanilla dating I’d still be pissed if someone was fondling me while I was trying to sleep, especially after already having sex, no matter how into them I am. That’s an automatic ick",
                    "author": "Putrid_Bread",
                    "id": "iq14csa",
                    "parent_id": "t1_iq131nt",
                    "score": 18,
                    "created_utc": 1664231262.0,
                    "replies": []
                },
                {
                    "body": "It’s called priorities, maturity, consent, respecting boundaries, and by not calling someone out of their name over not getting your way. \n\nHe violated her boundaries — she was tired, has a real job that she has also committed to.  \n\nWe should be allowed to sleep in a bed with our partner and not expect to be up all night on a work night.",
                    "author": "Koroleva7z",
                    "id": "iq22tt2",
                    "parent_id": "t1_iq131nt",
                    "score": 9,
                    "created_utc": 1664246850.0,
                    "replies": []
                },
                {
                    "body": "You don't have to be in love with your sugar partner. And she said she had work at 8am. They ended at 1am. Why is he fondling her throughout the night not letting her sleep and then waking her up by fondling her at 5am. \n\nIf anything he should wake her up with breakfast in bed at 7 am that he cooked early am if he has no problem waking up at 5am. \n\nThink better and do better.",
                    "author": "WhisperingPetals",
                    "id": "iq1x97n",
                    "parent_id": "t1_iq131nt",
                    "score": 11,
                    "created_utc": 1664244287.0,
                    "replies": []
                },
                {
                    "body": "It seems like you don’t understand what consensual sexual contact is",
                    "author": "darthveevles",
                    "id": "iq1g9h4",
                    "parent_id": "t1_iq131nt",
                    "score": 14,
                    "created_utc": 1664236627.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "You say you love nighttime cuddles.. by that you mean?",
            "author": "UnearthlyDinosaur",
            "id": "iq1qvid",
            "parent_id": "t3_xov1ls",
            "score": -3,
            "created_utc": 1664241412.0,
            "replies": [
                {
                    "body": "Cuddling at night…\nEmbracing each other…\nHolding each other and falling asleep…\n\nSome people actually enjoy legit cuddling, without the sex. Night time cuddles doesn’t give someone automatic permission to penetrate either.\n\nCuddling and sex are two different things. \n\nSure, it’s possible that it’ll turn into sex, but it’s not mandatory.  I’ve dated guys who respected that boundary with me before and it created a much deeper bond/trust.",
                    "author": "Koroleva7z",
                    "id": "iq22a8i",
                    "parent_id": "t1_iq1qvid",
                    "score": 11,
                    "created_utc": 1664246590.0,
                    "replies": [
                        {
                            "body": "THIS 👏🏼👏🏼👏🏼",
                            "author": null,
                            "id": "iq2cko1",
                            "parent_id": "t1_iq22a8i",
                            "score": 5,
                            "created_utc": 1664251876.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "iq10ef5",
            "parent_id": "t3_xov1ls",
            "score": -1,
            "created_utc": 1664229555.0,
            "replies": [
                {
                    "body": "The grass is always greener lol",
                    "author": "Putrid_Bread",
                    "id": "iq13tcy",
                    "parent_id": "t1_iq10ef5",
                    "score": 5,
                    "created_utc": 1664231025.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "You should’ve set the expectations before the overnight. Of course he felt that since he is paying he can do anything he wants.",
            "author": "macz786",
            "id": "iq16yr8",
            "parent_id": "t3_xov1ls",
            "score": -16,
            "created_utc": 1664232426.0,
            "replies": [
                {
                    "body": "Why should I have to tell someone not to play with my nipples or 😻 while I’m sleeping? He should’ve asked beforehand and I would’ve said no. He’s not entitled to do anything to me without consent just because he gives me money. Escorts don’t even allow anyone to do just anything to them and they’re being paid directly for their services, so why should I?",
                    "author": "Putrid_Bread",
                    "id": "iq17zme",
                    "parent_id": "t1_iq16yr8",
                    "score": 22,
                    "created_utc": 1664232879.0,
                    "replies": []
                },
                {
                    "body": "*Blink*blink*blink*\nNo one paying for anything can do *anything* they want. No one, under any circumstance, is entitled to free and liberal access to another person’s body for their use. This SD clearly does not understand basic respect of someone’s physical personhood, specifically a woman’s physical person. His behavior is beyond atrocious and qualifies as sexual assault, as it was non-consensual, she told him to stop, and he didn’t. It’s kinda freaky that you think that a woman under any circumstance should “set the expectation” that she not be sexually assaulted.",
                    "author": "darthveevles",
                    "id": "iq1gqto",
                    "parent_id": "t1_iq16yr8",
                    "score": 20,
                    "created_utc": 1664236850.0,
                    "replies": [
                        {
                            "body": "Again I am not saying it is right at all. Just sharing my opinion from her SDs perspective.",
                            "author": "macz786",
                            "id": "iq23xo7",
                            "parent_id": "t1_iq1gqto",
                            "score": -3,
                            "created_utc": 1664247361.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Since when does paying someone mean you can sexually assault or rape someone or cause bodily harm, etc..??? \n\nShe said no. And you think it's ok for him to keep going? \n\nDo YOU seriously grope women in their sleep without their consent? You know you're sexually assaulting them, right?",
                    "author": "WhisperingPetals",
                    "id": "iq1xpi9",
                    "parent_id": "t1_iq16yr8",
                    "score": 7,
                    "created_utc": 1664244493.0,
                    "replies": [
                        {
                            "body": "I am not saying it is right at all. I am just saying what her SD might have thought. He sounded entitled in her case. Don’t kill the messenger.",
                            "author": "macz786",
                            "id": "iq23jmh",
                            "parent_id": "t1_iq1xpi9",
                            "score": -2,
                            "created_utc": 1664247182.0,
                            "replies": [
                                {
                                    "body": "Okay, got it. Yea, who knows what this douchebag thought... some guys are so weird",
                                    "author": "WhisperingPetals",
                                    "id": "iq7cdhz",
                                    "parent_id": "t1_iq23jmh",
                                    "score": 1,
                                    "created_utc": 1664344308.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "I can not BELIEVE I have just read that 🤬 payment or not, stop means STOP!!! sick to death of this \"well I paid you, so you have to let me do whatever I want to you or I want my money back\" attitude. Just because a man has paid her doesn't mean he owns her body and can do what he wants with it even if she isn't comfortable with it. The entitlement of the men on this thread is disgusting, to think that you can over step boundaries and that consent doesn't matter because you've thrown a few hundred at her and think you're owed it. Predators.",
                    "author": "savvylove69",
                    "id": "iq8hbvc",
                    "parent_id": "t1_iq16yr8",
                    "score": 2,
                    "created_utc": 1664373123.0,
                    "replies": [
                        {
                            "body": "Well said, completely agree",
                            "author": "macz786",
                            "id": "iqaxrv1",
                            "parent_id": "t1_iq8hbvc",
                            "score": 2,
                            "created_utc": 1664409093.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Don’t ever get married or have a long term vanilla relationship yet, you’ll learn relationships are about compromises and you’re not ready to compromise yet.",
            "author": "MKTekke",
            "id": "iq3j94b",
            "parent_id": "t3_xov1ls",
            "score": -7,
            "created_utc": 1664283044.0,
            "replies": [
                {
                    "body": "How long is a marriage going to last if you won't let the other person sleep?",
                    "author": "sirthunksalot",
                    "id": "iq479p5",
                    "parent_id": "t1_iq3j94b",
                    "score": 3,
                    "created_utc": 1664293505.0,
                    "replies": [
                        {
                            "body": "When you get married, you have to make adjustments and adapt to each other.  Anyone who has been married or lived with anyone for long time knows that you get used to each other and make adjustments.  The 1st night is always rough regardless what kind of relationship you’re in.  I’ve had debates about which side of bedsheets.  This is why it’s important to be adaptable too.  You wouldn’t want to sleep alone forever.  Nobody does.",
                            "author": "MKTekke",
                            "id": "iq48fem",
                            "parent_id": "t1_iq479p5",
                            "score": 1,
                            "created_utc": 1664293959.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "This is just disrespectful and rude. Has nothing to do with compromise.",
                    "author": "blndy2022",
                    "id": "iq5ccdz",
                    "parent_id": "t1_iq3j94b",
                    "score": 2,
                    "created_utc": 1664309338.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Perhaps talk with him and arrange overnights when you do not need to go to work the following morning. \n\nor  \n\n\"It's great if you wake me up in the middle of the night  but understand that i'll probably be half asleep and leap on top, whip in hand for some real cowgirl oral, but don't worry I keep a first aid kit   in my purse with an ample supply of celox   \"",
            "author": "pinotandsugar",
            "id": "iq11zy1",
            "parent_id": "t3_xov1ls",
            "score": -3,
            "created_utc": 1664230238.0,
            "replies": [
                {
                    "body": "I have no intention of seeing him again after he called me a mean bitch",
                    "author": "Putrid_Bread",
                    "id": "iq13jnf",
                    "parent_id": "t1_iq11zy1",
                    "score": 24,
                    "created_utc": 1664230908.0,
                    "replies": [
                        {
                            "body": "And by that you mean you have no intentions of seeing him again after he disrespected your boundaries by groping you in your sleep, right? Calling you a bitch is the least of it. Imo. Stay safe and healthy.",
                            "author": "Miss_TinyToes",
                            "id": "iq178x3",
                            "parent_id": "t1_iq13jnf",
                            "score": 13,
                            "created_utc": 1664232553.0,
                            "replies": [
                                {
                                    "body": "Well yes, at first I was gonna give him the benefit of the doubt and address it when I woke up. But then he called me a bitch and that was the last straw",
                                    "author": "Putrid_Bread",
                                    "id": "iq18i52",
                                    "parent_id": "t1_iq178x3",
                                    "score": 11,
                                    "created_utc": 1664233106.0,
                                    "replies": [
                                        {
                                            "body": "I completely understand that! It’s really kind of sad. As a women we cannot give men the “benefit of the doubt” they take that as acceptance of the behavior. At least in my experiences. Peace and love. Be careful out there! Lol",
                                            "author": "Miss_TinyToes",
                                            "id": "iq1aj5q",
                                            "parent_id": "t1_iq18i52",
                                            "score": 14,
                                            "created_utc": 1664234016.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "The use of the word \"bitch\" to someone you are intimate with (you) indicates a serious flaw in the SD and his vision of the relationship or self control.",
                                            "author": "pinotandsugar",
                                            "id": "iq1tvq7",
                                            "parent_id": "t1_iq18i52",
                                            "score": 7,
                                            "created_utc": 1664242764.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "I think the problem is his insistence which demonstrated both a lack of concern for her day and her boundaries. If you have sex with someone and they’re lying in bed with you, you can try to wake them up for sex with touching but you have to back off if they don’t respond affirmatively.",
                                    "author": "JDMultralight",
                                    "id": "iq1uw07",
                                    "parent_id": "t1_iq178x3",
                                    "score": 3,
                                    "created_utc": 1664243214.0,
                                    "replies": [
                                        {
                                            "body": "No. Don't wake them up. If you want to wake them up after they've rested for a long while wake them up with kisses on the face and breakfast in bed.",
                                            "author": "WhisperingPetals",
                                            "id": "iq1y57z",
                                            "parent_id": "t1_iq1uw07",
                                            "score": 8,
                                            "created_utc": 1664244689.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Amen to this — never tolerate being called out of your name… ESPECIALLY when it’s just because he didn’t get his way. Smh",
                            "author": "Koroleva7z",
                            "id": "iq234ow",
                            "parent_id": "t1_iq13jnf",
                            "score": 3,
                            "created_utc": 1664246989.0,
                            "replies": []
                        },
                        {
                            "body": "I missed that part......\n\nAnything resembling that should be instant termination",
                            "author": "pinotandsugar",
                            "id": "iq2lzpn",
                            "parent_id": "t1_iq13jnf",
                            "score": 1,
                            "created_utc": 1664258125.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "iq19tt1",
            "parent_id": "t3_xov1ls",
            "score": -3,
            "created_utc": 1664233695.0,
            "replies": [
                {
                    "body": "I personally don’t think it’s normal to fondle someone while they’re sleeping without prior consent. And I think you’re missing the part where I stopped him from touching me multiple times and told him to let me sleep and he called me a bitch for that. Not sure why I should try to fix things with someone who pushed my boundaries multiple times",
                    "author": "Putrid_Bread",
                    "id": "iq1b2oy",
                    "parent_id": "t1_iq19tt1",
                    "score": 12,
                    "created_utc": 1664234266.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Lord, the White Knights. LMAO",
            "author": "Beginning_Pear_1263",
            "id": "iq1p2o3",
            "parent_id": "t3_xov1ls",
            "score": -9,
            "created_utc": 1664240607.0,
            "replies": [
                {
                    "body": "What white knights? I’m confused by your comment",
                    "author": "Putrid_Bread",
                    "id": "iq1rwnv",
                    "parent_id": "t1_iq1p2o3",
                    "score": 4,
                    "created_utc": 1664241875.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "\nWe all must remember....\nLack of communication is the death of many great things..\nOnes own innability to properly communicate creates the chaos/confussion in articles as these.\n****SB  did you hook up that night because you needed ppm immediately?  If so then truly whos fault is it?\nImmediate ppm implies poor management of your funds so immediate gratuity was needed\nIf ppm was not needed immediately then why schedule a night as that with work the following day?",
            "author": "max_sphinx",
            "id": "iq3a894",
            "parent_id": "t3_xov1ls",
            "score": -6,
            "created_utc": 1664277921.0,
            "replies": [
                {
                    "body": "Where did you get the information that I stayed the night because I needed the ppm? You’re reaching because you somehow want to justify that I deserved to assaulted in my sleep. Like I said in another comment HE suggested that I sleep over and offered me an Uber to work the next morning. He knew when I had to leave and why. Not my fault he’s a creep",
                    "author": "Putrid_Bread",
                    "id": "iq3kx6r",
                    "parent_id": "t1_iq3a894",
                    "score": 3,
                    "created_utc": 1664283878.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "iq2k2y6",
            "parent_id": "t3_xov1ls",
            "score": -9,
            "created_utc": 1664256739.0,
            "replies": [
                {
                    "body": "Negative.",
                    "author": "blndy2022",
                    "id": "iq5ch7w",
                    "parent_id": "t1_iq2k2y6",
                    "score": 1,
                    "created_utc": 1664309389.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "iq2l964",
            "parent_id": "t3_xov1ls",
            "score": -8,
            "created_utc": 1664257579.0,
            "replies": [
                {
                    "body": "I thought this wasn’t prostitution 🤔",
                    "author": "Putrid_Bread",
                    "id": "iq3nuui",
                    "parent_id": "t1_iq2l964",
                    "score": 3,
                    "created_utc": 1664285305.0,
                    "replies": [
                        {
                            "body": "[removed]",
                            "author": null,
                            "id": "iq3ofx9",
                            "parent_id": "t1_iq3nuui",
                            "score": -2,
                            "created_utc": 1664285582.0,
                            "replies": [
                                {
                                    "body": "He gives me the same amount every time so if anything he already got more than his money’s worth since I stayed over longer than I normally do. Maybe if he gave me even more money I would’ve been more willing",
                                    "author": "Putrid_Bread",
                                    "id": "iq3pis6",
                                    "parent_id": "t1_iq3ofx9",
                                    "score": 2,
                                    "created_utc": 1664286086.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Sounds like you didn't give quite enough intimacy, he may have a higher sex drive than you're used to.I'd take it as a compliment but you should probably let your future SD know that you need to sleep ahead of time...\n\nalso guys don't really care what you or he may have to do in the morning if they're horny, known character flaw",
            "author": "be1tran",
            "id": "iq23hve",
            "parent_id": "t3_xov1ls",
            "score": -17,
            "created_utc": 1664247158.0,
            "replies": [
                {
                    "body": "Holy warped view here.",
                    "author": null,
                    "id": "iq2cvbl",
                    "parent_id": "t1_iq23hve",
                    "score": 8,
                    "created_utc": 1664252051.0,
                    "replies": []
                },
                {
                    "body": "So sexual assault is ok if he’s horny? Good to know.",
                    "author": "blndy2022",
                    "id": "iq5cfw6",
                    "parent_id": "t1_iq23hve",
                    "score": 2,
                    "created_utc": 1664309375.0,
                    "replies": [
                        {
                            "body": "If you find yourself being the little spoon and not wanting to be touched I encourage you to speak up and communicate effectively that you do not want to be touched and if that doesn't work leave and go home.",
                            "author": "be1tran",
                            "id": "iq780g2",
                            "parent_id": "t1_iq5cfw6",
                            "score": 1,
                            "created_utc": 1664341224.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "iq29ltt",
            "parent_id": "t3_xov1ls",
            "score": 1,
            "created_utc": 1664250197.0,
            "replies": [
                {
                    "body": "Rule #5: SLF is a sex-positive sub\n\nAdult descriptions of sex are welcome. Graphic sexual posts and how to posts on performing certain sexual acts are prohibited. Disrespectful or demeaning sexual descriptions (i.e. cumbucket, fuckboy, etc.,) will not be tolerated. Shaming of other participants (i.e. escort, John, pro SB, etc.) for having multiple sugar partners is not allowed. Nor is using those terms in a derogatory fashion to insult others allowed.",
                    "author": "sugarlifestyleforum-ModTeam",
                    "id": "iq3pt07",
                    "parent_id": "t1_iq29ltt",
                    "score": 2,
                    "created_utc": 1664286214.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Maybe message him about what bothered you before cutting off ties so abruptly. Tell him that you didn't enjoy spending the night there because of the fondling, snoring, etc.    He should apologize and say that it won't happen again.",
            "author": "Frank1009",
            "id": "iq2nz2y",
            "parent_id": "t3_xov1ls",
            "score": 1,
            "created_utc": 1664259616.0,
            "replies": []
        },
        {
            "body": "No I mentioned that could be a possibility.\nNot a reason you did",
            "author": "max_sphinx",
            "id": "iq3l8g2",
            "parent_id": "t3_xov1ls",
            "score": 1,
            "created_utc": 1664284031.0,
            "replies": []
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "iq3zhji",
            "parent_id": "t3_xov1ls",
            "score": 1,
            "created_utc": 1664290374.0,
            "replies": [
                {
                    "body": "Rule #12: No Escorts/Johns\n\nNo escorts/Johns; although past personal experiences in escorting are fine, we will not allow promotion of this lifestyle or pricing discussion. We understand that some members of our community participate or have participated in both lifestyles but SLF is a Sugar-only sub. Breaking this rule may result in being banned without warning.",
                    "author": "sugarlifestyleforum-ModTeam",
                    "id": "iq46neo",
                    "parent_id": "t1_iq3zhji",
                    "score": 2,
                    "created_utc": 1664293260.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Ew, selfish POS. This will only get worse. He was only think about himself and that is a big red flag.",
            "author": "thehottubistoohawt",
            "id": "iq4yd0e",
            "parent_id": "t3_xov1ls",
            "score": 1,
            "created_utc": 1664303994.0,
            "replies": []
        },
        {
            "body": "Compared to some stories on here, it actually wasn't that bad. I was prepared for the worst. Have a calm discussion with him about overnights, explain to him that if you have work you need adequate and unbothered sleep. Don't be so quick to jump ship from a good reliable allowance from one misunderstanding.",
            "author": "malcolm_reyn0lds",
            "id": "iq5181t",
            "parent_id": "t3_xov1ls",
            "score": 1,
            "created_utc": 1664305082.0,
            "replies": [
                {
                    "body": "I have no intentions of being with someone who calls me a bitch no matter how much money they give me",
                    "author": "Putrid_Bread",
                    "id": "iq5dbje",
                    "parent_id": "t1_iq5181t",
                    "score": 3,
                    "created_utc": 1664309712.0,
                    "replies": [
                        {
                            "body": "Then time to block and move on.",
                            "author": "malcolm_reyn0lds",
                            "id": "iq65ksn",
                            "parent_id": "t1_iq5dbje",
                            "score": 1,
                            "created_utc": 1664321605.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "guys with ED - often the only time it works for them is 5am without viagra or cialis.",
            "author": "Magenta_Octopus",
            "id": "iq573e6",
            "parent_id": "t3_xov1ls",
            "score": 1,
            "created_utc": 1664307343.0,
            "replies": []
        },
        {
            "body": "Ok  I'm going to say this, BUT I don't want you to think I'm putting blame on you or him for that matter. It's just an observation with only a small portion of yalls SR history. Also I'm discussing what should have happened prior to the sleepover not what actually happened. I don't condone any type of sexual violence.\nThat being said this is a great example it looks like of a lack of communication. Both of you failed at talking about boundaries on sleep over nights and also what to expect. It's not really anyone's fault to not do that. Don't blame yourself, it's a common mistake. But just think how the night would have been if the two of you had a conversation that went something like...\n\"So beings this is our first sleep over I like to be cuddled but play time is over, also I really enjoy morning sex but only after a good night's sleep. So please don't wake me until around 7am. I promise you won't regret waiting. One more thing Captian Studmuffin I'm a quit sleeper, if you happen to not be it's no big deal just let me know so I can be prepared is all wink wink hugs hugs.\n\nOr from his prospective which from someonewho is supposed to be more mature should have handled it....\n\" So I know this is our first sleepover and I just wanted to clear the air on a few things before we actually spend the night. #1 I'm a loud sleeper, I hope that doesn't bother you but if it does let me know and either we can make other arrangements like once we have fun and cuddle a bit ill go sleep on the couch or wherever... #2 since this is our first sleepover are there any extra boundaries I need to know about? Like are you ok with being woke up for sex you know know things like that also sometimes I can get a little handsy when cuddling just because you turn me on so much, please let me know if that is inappropriate or if it becomes that way. I look forward to our night together Cinderella hope you do too\"\n\nI say these things because communication is always vital, and ongoing. Anything that becomes new in the relationship needs to be discussed.",
            "author": "woody0690",
            "id": "itg5mlr",
            "parent_id": "t3_xov1ls",
            "score": 1,
            "created_utc": 1666527083.0,
            "replies": []
        },
        {
            "body": "He was acting in a criminally vulgar manner",
            "author": "Toojew4u",
            "id": "iq10q85",
            "parent_id": "t1_iq0yzsr",
            "score": 27,
            "created_utc": 1664229693.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "iq2ijr2",
                    "parent_id": "t1_iq10q85",
                    "score": -1,
                    "created_utc": 1664255672.0,
                    "replies": [
                        {
                            "body": "Idk, pushing hands away multiple times seems like a pretty obvious no to me, especially if they said no during it. And stressing they needed to work in the morning and needed sleep was probably another way of not directly saying no, but still saying no. Even the moving to the other side of them bed and to have him continue *after that*, it just seems weird to me",
                            "author": "antiftmftm",
                            "id": "iq2kry0",
                            "parent_id": "t1_iq2ijr2",
                            "score": 11,
                            "created_utc": 1664257236.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "iq2lbr2",
                                    "parent_id": "t1_iq2kry0",
                                    "score": 0,
                                    "created_utc": 1664257633.0,
                                    "replies": [
                                        {
                                            "body": "He should control himself? They shouldn't have to control him cause he has his own will and unless prior consent is given then that shouldn't happen",
                                            "author": "antiftmftm",
                                            "id": "iq2lji6",
                                            "parent_id": "t1_iq2lbr2",
                                            "score": 6,
                                            "created_utc": 1664257792.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "He definitely goes about things the wrong way",
            "author": "Cledaddy23",
            "id": "iq12rvp",
            "parent_id": "t1_iq0yzsr",
            "score": 16,
            "created_utc": 1664230577.0,
            "replies": [
                {
                    "body": "How can you say?",
                    "author": "LadyoftheFlow4rs",
                    "id": "iq13mrj",
                    "parent_id": "t1_iq12rvp",
                    "score": 5,
                    "created_utc": 1664230945.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "How soon is now??",
            "author": "LucidDion",
            "id": "iq1q6hb",
            "parent_id": "t1_iq0yzsr",
            "score": 6,
            "created_utc": 1664241102.0,
            "replies": []
        },
        {
            "body": "You shut your mouth, how can you say He goes about things the wrong way?",
            "author": "MsBeasley11",
            "id": "iq50uj9",
            "parent_id": "t1_iq0yzsr",
            "score": 1,
            "created_utc": 1664304939.0,
            "replies": []
        },
        {
            "body": "Love it",
            "author": "hereyougococo",
            "id": "iq25zzw",
            "parent_id": "t1_iq1sjap",
            "score": 4,
            "created_utc": 1664248356.0,
            "replies": []
        },
        {
            "body": "Yep this is so true. One of my ex SBs and I would have like have couple evening session then go to sleep then 3 am sex and then morning sex. It was our routine and when I say I have to get up early cuz of some reason she would be like ..\" okay well then we have to wake up earlier for an sex...lol.  We were together for years.  Then I have had overnight after my ex later on when my expectations were very clear and had even asked the new SB multiple times if this and that would be fine with her she would say sure no problem. Then the night came there was no second evening round and no morning sex and she snored loudly that I couldn't sleep at all. So basically 1.5 times our regular ppm for twice the negative fun. And she wondered when we were gonna have our next overnight cuz she liked it. I basically told her I'm glad one of us did and never ever.  She contacted me like a year later out of the blue and asked me if I was seeing anyone I just told her yep and she inquired if we were exclusive and I just told her that our last date wasn't the great for me and that's why I never asked her out again. The overnight just showed me we just don't have the chemistry I need.  Chemistry outside the bedroom was awesome but in the bedroom it was painful. Like nothing was good.  She was hot too.",
            "author": "Federal_Garage_4307",
            "id": "iq4rqwo",
            "parent_id": "t1_iq1f6r5",
            "score": 3,
            "created_utc": 1664301441.0,
            "replies": []
        },
        {
            "body": "You’re right. It’s so selfish!!! Why is your dick emergency more important than my rest?",
            "author": "Putrid_Bread",
            "id": "iq18dzr",
            "parent_id": "t1_iq17qzs",
            "score": 52,
            "created_utc": 1664233055.0,
            "replies": [
                {
                    "body": "Exactly!! Why do I need to be woken up for some needy, probably sweaty, hasn’t showered from the night before, dick? #Next.",
                    "author": null,
                    "id": "iq18pju",
                    "parent_id": "t1_iq18dzr",
                    "score": 30,
                    "created_utc": 1664233198.0,
                    "replies": [
                        {
                            "body": "and bad breath Ms mouthwash /s",
                            "author": "GSSD",
                            "id": "iq3jw1x",
                            "parent_id": "t1_iq18pju",
                            "score": 6,
                            "created_utc": 1664283364.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Hea a selfish a rude guy.  Stay away.",
                    "author": "Bestyoucanbe4",
                    "id": "iq4u64e",
                    "parent_id": "t1_iq18dzr",
                    "score": 5,
                    "created_utc": 1664302374.0,
                    "replies": []
                },
                {
                    "body": "Because your not really a “person” to him. \n\nYour a thing he met in the chat box that’s he’s giving dead presidents to💀 to open her legs on command. \n\nLol 😂",
                    "author": "PomegranateMelodic70",
                    "id": "iq2eqjd",
                    "parent_id": "t1_iq18dzr",
                    "score": 8,
                    "created_utc": 1664253190.0,
                    "replies": []
                },
                {
                    "body": "Ugh, yuck. I just cannot deal with that.",
                    "author": "Koroleva7z",
                    "id": "iq219p2",
                    "parent_id": "t1_iq18dzr",
                    "score": -1,
                    "created_utc": 1664246120.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yes, exactly!! Everyone is super groggy, with bad hair and bad breath in the morning... not exactly hot and ready for sex (!)",
            "author": "shovelkun",
            "id": "iq3012c",
            "parent_id": "t1_iq17qzs",
            "score": 8,
            "created_utc": 1664269979.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "iq3k017",
                    "parent_id": "t1_iq3012c",
                    "score": -8,
                    "created_utc": 1664283419.0,
                    "replies": [
                        {
                            "body": "Sounds like a you problem.",
                            "author": "thehottubistoohawt",
                            "id": "iq4yjie",
                            "parent_id": "t1_iq3k017",
                            "score": 2,
                            "created_utc": 1664304062.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "While your 100% allowed to have that view....\n\nMy Vanilla ex loves it when I woke her up for sex in the night. It made her feel wanted. Then she started doing the same thing to me and it was super hot. \n\nMaybe OP needs to discuss preferences and boundaries with SD (if she wants to continue).",
            "author": "evad111",
            "id": "iq2fx08",
            "parent_id": "t1_iq17qzs",
            "score": 7,
            "created_utc": 1664253937.0,
            "replies": [
                {
                    "body": "even on weekdays when you have work at 8am?\n\n\nI wouldn't mind that on the weekend, but getting woken up at 5am right before work sounds fucking terrible",
                    "author": "baasanka24",
                    "id": "iq2whlz",
                    "parent_id": "t1_iq2fx08",
                    "score": 11,
                    "created_utc": 1664266767.0,
                    "replies": [
                        {
                            "body": "That's absolutely ok for you to feel that way.\n\nBut this should be communicated with the SD in an adult manner. \n\nNot all people have the same desires and boundaries.\n\n Communicate and compromise.",
                            "author": "evad111",
                            "id": "iq2wqvv",
                            "parent_id": "t1_iq2whlz",
                            "score": 6,
                            "created_utc": 1664266994.0,
                            "replies": [
                                {
                                    "body": "Sounds like she made it pretty clear. He crossed the line using inappropriate language and not respecting her body language of pushing him away and even moving away. Communication is key just sucks he decided to not listen and respond horribly.",
                                    "author": "eshtahnohs",
                                    "id": "iq57nba",
                                    "parent_id": "t1_iq2wqvv",
                                    "score": 7,
                                    "created_utc": 1664307555.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Sounds like he doesn’t respect boundaries. You can’t teach an old dog new tricks.",
                    "author": "thehottubistoohawt",
                    "id": "iq4yn4s",
                    "parent_id": "t1_iq2fx08",
                    "score": 5,
                    "created_utc": 1664304100.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I had a bf who did this too and I told him to stop or else. He said he did it in his sleep. Okay, bring on the body pillow barrier.",
            "author": "thehottubistoohawt",
            "id": "iq4yuh3",
            "parent_id": "t1_iq1fzhp",
            "score": 3,
            "created_utc": 1664304177.0,
            "replies": [
                {
                    "body": "I legit don’t understand it… like what do you think you’re doing trying to finger me while I’m asleep?",
                    "author": "darthveevles",
                    "id": "iq50gq0",
                    "parent_id": "t1_iq4yuh3",
                    "score": 5,
                    "created_utc": 1664304792.0,
                    "replies": [
                        {
                            "body": "Men are perverse and they will always see what they can get away with.",
                            "author": "thehottubistoohawt",
                            "id": "iqxcq97",
                            "parent_id": "t1_iq50gq0",
                            "score": 2,
                            "created_utc": 1664827035.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "At once?",
            "author": "DarthNylus",
            "id": "iq225pb",
            "parent_id": "t1_iq1fzhp",
            "score": 2,
            "created_utc": 1664246530.0,
            "replies": [
                {
                    "body": "😎",
                    "author": "hereyougococo",
                    "id": "iq2635o",
                    "parent_id": "t1_iq225pb",
                    "score": 0,
                    "created_utc": 1664248399.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "The amount of men in this thread making it seem like it was somehow my fault is really astounding",
            "author": "Putrid_Bread",
            "id": "iq3jyp0",
            "parent_id": "t1_iq1oezc",
            "score": 12,
            "created_utc": 1664283400.0,
            "replies": [
                {
                    "body": "This is why men are from mars and women are from Venus, except today’s world women are from Mercury.   Regardless, you had boundaries and expectations that were defined.  In a long term relationship, couples usually already worked this stuff out and becomes a non-issue.  The same thing with SR, I’ve had multiple stay overs and it only takes 1-2 nights to sort it out.  I’ve had SB that enjoyed the middle of night fondling and touching, she looks forward to being touched than just sex.  Men here aren’t blaming you, it’s the sort of adjustments or compromising that you need to learn if you want to have any sort of meaningful relationship in the future.",
                    "author": "MKTekke",
                    "id": "iq3qf1k",
                    "parent_id": "t1_iq3jyp0",
                    "score": -3,
                    "created_utc": 1664286495.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Completely agree. This topic really shouldn’t be downplayed.\n\nIf someone likes being woken up by sex, that’s great, but it needs to be agreed upon beforehand. Let’s not forget that consent cannot be given when you are asleep.",
            "author": "Gee_n_tonic",
            "id": "iq3fwut",
            "parent_id": "t1_iq1oezc",
            "score": 8,
            "created_utc": 1664281276.0,
            "replies": [
                {
                    "body": "Yes, this behavior is super rapey.",
                    "author": "thehottubistoohawt",
                    "id": "iq4z5no",
                    "parent_id": "t1_iq3fwut",
                    "score": 5,
                    "created_utc": 1664304296.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I think I’ve just been spoiled by my SBF. As soon as he falls asleep he turns in the opposite direction and doesn’t move until 8am 😭",
            "author": "Putrid_Bread",
            "id": "iq17hal",
            "parent_id": "t1_iq169ab",
            "score": 35,
            "created_utc": 1664232653.0,
            "replies": [
                {
                    "body": "AS HE SHOULD 🫡",
                    "author": "spicycookie26",
                    "id": "iq1dd3d",
                    "parent_id": "t1_iq17hal",
                    "score": 22,
                    "created_utc": 1664235307.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Ugh that’s so disgusting. I’m sorry that happened to you. A lot of men on this thread think that it’s okay to harass a girl while she’s sleeping if they’re paying her it’s very concerning",
            "author": "Putrid_Bread",
            "id": "iq3l5mb",
            "parent_id": "t1_iq3cdho",
            "score": 7,
            "created_utc": 1664283993.0,
            "replies": [
                {
                    "body": "and those same men will complain that SBs don't want to do overnight!",
                    "author": "LightOLove",
                    "id": "iq3uwy5",
                    "parent_id": "t1_iq3l5mb",
                    "score": 8,
                    "created_utc": 1664288462.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Because they use the word sugar daddy to cover up what they really are. I’m glad that you as a man can see this. This isn’t a safe sub for women.",
            "author": "Callistolady",
            "id": "iq9h2s8",
            "parent_id": "t1_iq4e5wk",
            "score": 5,
            "created_utc": 1664387361.0,
            "replies": [
                {
                    "body": "I completely agree, I dont think any sub on reddit is safe for anyone, especially women.",
                    "author": "Silly-Investment-598",
                    "id": "itg15m4",
                    "parent_id": "t1_iq9h2s8",
                    "score": 1,
                    "created_utc": 1666524090.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Men, you mean men.",
            "author": "thehottubistoohawt",
            "id": "iq4yxr3",
            "parent_id": "t1_iq1uyzz",
            "score": 5,
            "created_utc": 1664304211.0,
            "replies": [
                {
                    "body": "lmao exactly",
                    "author": "Agitated_Ruin132",
                    "id": "iq4zo5v",
                    "parent_id": "t1_iq4yxr3",
                    "score": 3,
                    "created_utc": 1664304491.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Thank you! It’s really wild that some of the men in this thread are trying to make it seem like it’s normal and should be expected",
            "author": "Putrid_Bread",
            "id": "iq1nfdg",
            "parent_id": "t1_iq1h0vg",
            "score": 11,
            "created_utc": 1664239870.0,
            "replies": []
        },
        {
            "body": "I always schedule when she's off work, unless she doesn't have a job so it doesn't matter much. But not going to set up an overnight where one of us has to leave early. I'm not a morning person so Iike time to have coffee and not be rushed",
            "author": "Daddy_Dom_47",
            "id": "iq2brp5",
            "parent_id": "t1_iq1fqs0",
            "score": 4,
            "created_utc": 1664251406.0,
            "replies": []
        },
        {
            "body": "Yeah I was surprised to read the first overnight was the day before morning work. \nI always assume I won’t sleep well with a new person in bed. Nonetheless, SD should have been more respectful of OP’s request.",
            "author": "261chameleons",
            "id": "iq23kqb",
            "parent_id": "t1_iq1fqs0",
            "score": 7,
            "created_utc": 1664247197.0,
            "replies": []
        },
        {
            "body": "I'm not a morning person so I always give a heads up. \"Hey, when I wake up, just leave me alone. Let me go to the bathroom, get a cigarette and a cup of coffee.\" Thought that was common courtesy.",
            "author": "Daddy_Dom_47",
            "id": "iq2by49",
            "parent_id": "t1_iq1dln3",
            "score": 6,
            "created_utc": 1664251506.0,
            "replies": [
                {
                    "body": "I am totally good with a surprise heads up myself :P",
                    "author": "SD_AU",
                    "id": "iq68dk5",
                    "parent_id": "t1_iq2by49",
                    "score": 1,
                    "created_utc": 1664322913.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "So I’m supposed to rely on a man I’ve only known for two months for all of my income?\n\nThe men on this sub are so funny. If a girl relies on a SD for all of her income y’all berate her for being desperate and not having a job. I actually have a job and you’re saying “why are you working if you have a SD” please be fucking for real",
            "author": "Putrid_Bread",
            "id": "iq5g2sk",
            "parent_id": "t1_iq5dwql",
            "score": 6,
            "created_utc": 1664310777.0,
            "replies": [
                {
                    "body": "I am female. \n\nI was asking a genuine question, you've answered it thank you.",
                    "author": null,
                    "id": "iq5gxxw",
                    "parent_id": "t1_iq5g2sk",
                    "score": 2,
                    "created_utc": 1664311106.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Never rely entirely on a man regardless of his generosity or the nature of your relationship. Always have your own source of income  because you never know what tomorrow could bring. He could pass away, drop you or even turn abusive.\n\nBeing a kept woman is great but always make sure that if your relationship ended abruptly you have enough money coming in to keep a roof over your head and support yourself.",
            "author": "LightOLove",
            "id": "iq8ql8c",
            "parent_id": "t1_iq5dwql",
            "score": 2,
            "created_utc": 1664377009.0,
            "replies": [
                {
                    "body": "That makes sense, it's an interesting relationship model. I think I'm too insubordinate to ever seriously consider that path.",
                    "author": null,
                    "id": "iq9k8cl",
                    "parent_id": "t1_iq8ql8c",
                    "score": 3,
                    "created_utc": 1664388594.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Same here, Wagyu.",
            "author": "ORD-inary",
            "id": "iq1h4fl",
            "parent_id": "t1_iq0xirb",
            "score": 4,
            "created_utc": 1664237022.0,
            "replies": [
                {
                    "body": "Technically, you are a man, and you sleep in the same room as yourself.\n\nThis message brought to you be Pedantics-R-Us.",
                    "author": "SD6ix",
                    "id": "iq1rins",
                    "parent_id": "t1_iq1h4fl",
                    "score": 6,
                    "created_utc": 1664241698.0,
                    "replies": [
                        {
                            "body": "Brought to you by -XXL-pedantics, but unless he's more than one man, his statement stands.",
                            "author": "justabebeh",
                            "id": "iq24v54",
                            "parent_id": "t1_iq1rins",
                            "score": 5,
                            "created_utc": 1664247801.0,
                            "replies": [
                                {
                                    "body": "I stand out-pedanted!",
                                    "author": "SD6ix",
                                    "id": "iq5njkk",
                                    "parent_id": "t1_iq24v54",
                                    "score": 1,
                                    "created_utc": 1664313701.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Why are those “loser” privileges lol?",
            "author": "JDMultralight",
            "id": "iq1rwya",
            "parent_id": "t1_iq0tbyk",
            "score": 2,
            "created_utc": 1664241879.0,
            "replies": [
                {
                    "body": "It’s because the same chica won’t bat an eyelid if a loser vanilla who had nothing  to offer financially did exactly the same thing as this SD. She might take all of that as signs of “true love”!!!!!",
                    "author": null,
                    "id": "iq1xizu",
                    "parent_id": "t1_iq1rwya",
                    "score": -4,
                    "created_utc": 1664244411.0,
                    "replies": [
                        {
                            "body": "Lol who is the sample size here, I can just about tolerate extended cuddles in the morning if I'm getting paid, but some 'loser vanilla' is getting kicked out...",
                            "author": "shovelkun",
                            "id": "iq306ck",
                            "parent_id": "t1_iq1xizu",
                            "score": 5,
                            "created_utc": 1664270114.0,
                            "replies": []
                        },
                        {
                            "body": "I mean keeping her up when she’s stressed she won’t sleep for work is probably something she’d probably have a big problem with anyone.  \n\nYou’re right that an instance of annoying sexual persistence wouldn’t be met with the same kind of outrage.  I think a lot of the time the dynamic is the SD harvesting sex from SB and her “giving it up” even in cases where she really likes it.  It’s one reason to be very careful with BDSM etc in SRs.  Its tough because the sex I prefer is often with me taking an “uncompromising” stance for the sake of the energy, but it could be read as regular demands rather than artfully contrived demanding vibe.",
                            "author": "JDMultralight",
                            "id": "iq46it5",
                            "parent_id": "t1_iq1xizu",
                            "score": 2,
                            "created_utc": 1664293211.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "No. I’m sorry this is rude and disrespectful vanilla or not. It would be an issue vanilla or not. \nHilarious comments.",
            "author": "blndy2022",
            "id": "iq5bxu2",
            "parent_id": "t1_iq0tbyk",
            "score": 1,
            "created_utc": 1664309185.0,
            "replies": []
        },
        {
            "body": "Im always worried about the “I paid you to grin and bear it” dynamic given that I think my best persona/style has a demanding/dom kind or vibe.  Sex early in an SR can be rough because I want to bring my “best self” while communicating that my harsher attitude is a flavor of me she can choose - or she can have another.\n\nHard to communicate this because submissiveness can look the same whether it’s being tolerated or enjoyed.",
            "author": "JDMultralight",
            "id": "iq47mbs",
            "parent_id": "t1_iq3jh6i",
            "score": 3,
            "created_utc": 1664293644.0,
            "replies": []
        },
        {
            "body": "I don’t think this has anything to do with if the couple loves one another or not. In fact it sounds like you’re downplaying it like it’s only irritating because she doesn’t love him and it’s an arrangement. I can almost guarantee most women in love or not would not like to be fondled all night long and woken up multiple hours before they have to work all day. \nOn the weekend? Sure probably not a big deal. \nBut this had nothing to do with love or an arrangement and everything to do with someone overstepping boundaries he didn’t discuss beforehand and being rude only caring about himself when she had to work the next day.",
            "author": "blndy2022",
            "id": "iq5bl08",
            "parent_id": "t1_iq3jh6i",
            "score": 1,
            "created_utc": 1664309048.0,
            "replies": [
                {
                    "body": ">  it sounds like -- it’s only irritating because she doesn’t love him and it’s an arrangement.\n\ntrue that. That is not to say a loving couple should submit to random fondling, but some actually welcome it. But anything can get old after a long time together.",
                    "author": "GSSD",
                    "id": "iq5nl3y",
                    "parent_id": "t1_iq5bl08",
                    "score": 1,
                    "created_utc": 1664313719.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Because he insisted? Just because you wouldn’t do it doesn’t mean someone else won’t. Even if I didn’t have to be anywhere in the morning that still doesn’t make what he did okay. \n\nNormally I try to go home around midnight but this time he said “why not just stay the night? It’s already late. I’ll get you an Uber to work in the morning.” We had another round before agreeing to go to sleep. Nothing out of the ordinary.",
            "author": "Putrid_Bread",
            "id": "iq1o3ef",
            "parent_id": "t1_iq1m4zw",
            "score": 11,
            "created_utc": 1664240175.0,
            "replies": [
                {
                    "body": "As I said in my first comment he is still in the wrong, but yeah an overnight with work at 8am just doesn’t sound like it’ll be fun for either involved. \n\nIf I pay for an overnight I’d want morning sex or else what’s the point really, and if she had work at 8am I don’t think that’s doable. So yeah, just wouldn’t do it.",
                    "author": "lagrangianblunt",
                    "id": "iq1ou5v",
                    "parent_id": "t1_iq1o3ef",
                    "score": -7,
                    "created_utc": 1664240506.0,
                    "replies": [
                        {
                            "body": "As I said in the post I had to *leave* at 8 so there was plenty of time. I told him to wake me up at 7am specifically so we could have morning sex. I would’ve had sex with him in the morning if he hadn’t pestered me all night and call me a bitch in the morning. So what you’re saying doesn’t really apply",
                            "author": "Putrid_Bread",
                            "id": "iq1rnfm",
                            "parent_id": "t1_iq1ou5v",
                            "score": 19,
                            "created_utc": 1664241760.0,
                            "replies": [
                                {
                                    "body": "He acted wrong but I’m just saying, I can see how an overnight ppm when you have early plans the next day can result in a negative situation.",
                                    "author": "lagrangianblunt",
                                    "id": "iq26qxq",
                                    "parent_id": "t1_iq1rnfm",
                                    "score": -8,
                                    "created_utc": 1664248730.0,
                                    "replies": [
                                        {
                                            "body": "It was a negative situation because he kept foundling  her in her sleep and woke her up at 5am for morning sex, if you want morning sex at least be considerate and set a time with you're partner And he didn't have a problem with her having to leave at a certain time so that argument doesn't matter at all to the situation",
                                            "author": "throwthewholepieaway",
                                            "id": "iq485kh",
                                            "parent_id": "t1_iq26qxq",
                                            "score": 2,
                                            "created_utc": 1664293851.0,
                                            "replies": [
                                                {
                                                    "body": "You’re disgusting",
                                                    "author": null,
                                                    "id": "iryg0th",
                                                    "parent_id": "t1_iq485kh",
                                                    "score": 1,
                                                    "created_utc": 1665531530.0,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "body": "“Overnight ppm”? So you admit you’re paying for sexual services. Genuine question, why don’t you just hire an escort? Oh right, you’re broke and need to exploit an underprivileged young girl who can’t say no",
                                            "author": "okkk0",
                                            "id": "iqljr2k",
                                            "parent_id": "t1_iq26qxq",
                                            "score": 0,
                                            "created_utc": 1664607641.0,
                                            "replies": [
                                                {
                                                    "body": "Do you see the Reddit page you’re on? Lol. Nice try. \n\nDon’t see you giving OP shit for sugaring? When she literally was planning to do the same",
                                                    "author": "lagrangianblunt",
                                                    "id": "iqlkfbz",
                                                    "parent_id": "t1_iqljr2k",
                                                    "score": 1,
                                                    "created_utc": 1664608200.0,
                                                    "replies": [
                                                        {
                                                            "body": "Idk what you’re talking about but aren’t you late for your shift at Walmart?",
                                                            "author": "okkk0",
                                                            "id": "iqlkl51",
                                                            "parent_id": "t1_iqlkfbz",
                                                            "score": 1,
                                                            "created_utc": 1664608334.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Money money money !!!!",
            "author": null,
            "id": "iq39cdc",
            "parent_id": "t1_iq1m4zw",
            "score": -2,
            "created_utc": 1664277347.0,
            "replies": []
        },
        {
            "body": "We were already up fucking until 1am. It’s fine if you don’t have boundaries but I do",
            "author": "Putrid_Bread",
            "id": "iq1lhx1",
            "parent_id": "t1_iq1g5c9",
            "score": 19,
            "created_utc": 1664239006.0,
            "replies": []
        },
        {
            "body": "Yikes",
            "author": "LightOLove",
            "id": "iq2cf33",
            "parent_id": "t1_iq1g5c9",
            "score": 6,
            "created_utc": 1664251785.0,
            "replies": []
        },
        {
            "body": "Just…ew",
            "author": "Lar5031",
            "id": "iq2b0cg",
            "parent_id": "t1_iq1g5c9",
            "score": 7,
            "created_utc": 1664250974.0,
            "replies": []
        },
        {
            "body": "Not getting much sleep isn’t the issue here. It’s the lack of respect for her boundaries and the egregious oversight on his part that somehow any part of her body suddenly becomes ripe for his touching regardless of money being exchanged. Micro traumas such as this can have lasting impacts on the body and subconscious. In no way does spending the night give anyone a free pass to do whatever they want to you as you sleep.",
            "author": null,
            "id": "iq1kbml",
            "parent_id": "t1_iq1g5c9",
            "score": 17,
            "created_utc": 1664238477.0,
            "replies": []
        },
        {
            "body": "> after he's done with me\n\nDoesn't sound like sugar to me.",
            "author": "GSSD",
            "id": "iq3l980",
            "parent_id": "t1_iq1g5c9",
            "score": 3,
            "created_utc": 1664284042.0,
            "replies": []
        },
        {
            "body": "After he's done with you? This is sugar relationships, not escorting. \n\nThe point of spending the night is to cuddle and sleep together. Not to have more sex or am sex. It's not a 2fer...",
            "author": "WhisperingPetals",
            "id": "iq1wsrh",
            "parent_id": "t1_iq1g5c9",
            "score": 7,
            "created_utc": 1664244081.0,
            "replies": [
                {
                    "body": "I stopped reading at the ”after he’s done with me” part",
                    "author": null,
                    "id": "iq24aax",
                    "parent_id": "t1_iq1wsrh",
                    "score": 5,
                    "created_utc": 1664247527.0,
                    "replies": []
                },
                {
                    "body": "You can't have it both ways. It's either an sr or escorting. In an \"sr\" there's no such thing as a 2fer. You don't count the number of times you have sex. \n\nI agree with OP 100%. I'm just pointing out your inconsistency.",
                    "author": "DarthNylus",
                    "id": "iq23ko4",
                    "parent_id": "t1_iq1wsrh",
                    "score": 1,
                    "created_utc": 1664247195.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Seriously, why are You down voting me?  I'm being realistic",
            "author": null,
            "id": "iq1kfjx",
            "parent_id": "t1_iq1g5c9",
            "score": -10,
            "created_utc": 1664238526.0,
            "replies": [
                {
                    "body": "Being expected to stay awake all night is not realistic, it’s being taken advantage of",
                    "author": "RealEarthAngel",
                    "id": "iq1xupx",
                    "parent_id": "t1_iq1kfjx",
                    "score": 10,
                    "created_utc": 1664244557.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "She didn’t deny morning sex, she asked for it to happen after 7am. Not to be woken up multiple times throughout the night and into the wee morning hours. There’s definitely a difference!",
            "author": null,
            "id": "iq2ch5x",
            "parent_id": "t1_iq1egjm",
            "score": 8,
            "created_utc": 1664251819.0,
            "replies": [
                {
                    "body": "I wonder what happened to sense of humor?  Plus I never heard there was a function or setup you could do so your cock would get morning wood at specific time. \nI agree with the guy, OP is a grump biatch. She didn’t feel bad for his generosity. \nI don’t buy this 8AM shit. She has her whole life to sleep, why doing it exactly on the night or her sleepover? \nAs I usually say, many SBs are delusional on reality and expectations.",
                    "author": "gapaf",
                    "id": "iq2n5c3",
                    "parent_id": "t1_iq2ch5x",
                    "score": -8,
                    "created_utc": 1664258978.0,
                    "replies": [
                        {
                            "body": "No wonder some of y’all have to pay for a girlfriend. You’re all insufferable",
                            "author": "Putrid_Bread",
                            "id": "iq3kaj7",
                            "parent_id": "t1_iq2n5c3",
                            "score": 9,
                            "created_utc": 1664283564.0,
                            "replies": [
                                {
                                    "body": "No wonder you have to resort to sugar!  It is a two face coin babe! 😀",
                                    "author": "gapaf",
                                    "id": "iq3xky0",
                                    "parent_id": "t1_iq3kaj7",
                                    "score": -4,
                                    "created_utc": 1664289584.0,
                                    "replies": [
                                        {
                                            "body": "Embarrassing that you’re proud of exploiting vulnerable women",
                                            "author": "okkk0",
                                            "id": "iqljfiy",
                                            "parent_id": "t1_iq3xky0",
                                            "score": 2,
                                            "created_utc": 1664607375.0,
                                            "replies": [
                                                {
                                                    "body": "Embarassed you don’t understand the basics of what you intend to do. You are not vulnerable, mostly weak, probably lazy.",
                                                    "author": "gapaf",
                                                    "id": "iqlvwh0",
                                                    "parent_id": "t1_iqljfiy",
                                                    "score": 1,
                                                    "created_utc": 1664618345.0,
                                                    "replies": [
                                                        {
                                                            "body": "You’re literally a social pariah who’s been outcasted from society and has to pay for basic human companionship😂",
                                                            "author": "okkk0",
                                                            "id": "iqnbrpq",
                                                            "parent_id": "t1_iqlvwh0",
                                                            "score": 2,
                                                            "created_utc": 1664645536.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I don’t see how you gathered that I’m not into him from what I posted? We’ve been seeing each other for 2mo prior to this and everything was good but it’s not like we were in love with each other. It’s an arrangement. If it were vanilla dating I’d still be pissed if someone was fondling me while I was trying to sleep, especially after already having sex, no matter how into them I am. That’s an automatic ick",
            "author": "Putrid_Bread",
            "id": "iq14csa",
            "parent_id": "t1_iq131nt",
            "score": 18,
            "created_utc": 1664231262.0,
            "replies": []
        },
        {
            "body": "It’s called priorities, maturity, consent, respecting boundaries, and by not calling someone out of their name over not getting your way. \n\nHe violated her boundaries — she was tired, has a real job that she has also committed to.  \n\nWe should be allowed to sleep in a bed with our partner and not expect to be up all night on a work night.",
            "author": "Koroleva7z",
            "id": "iq22tt2",
            "parent_id": "t1_iq131nt",
            "score": 9,
            "created_utc": 1664246850.0,
            "replies": []
        },
        {
            "body": "You don't have to be in love with your sugar partner. And she said she had work at 8am. They ended at 1am. Why is he fondling her throughout the night not letting her sleep and then waking her up by fondling her at 5am. \n\nIf anything he should wake her up with breakfast in bed at 7 am that he cooked early am if he has no problem waking up at 5am. \n\nThink better and do better.",
            "author": "WhisperingPetals",
            "id": "iq1x97n",
            "parent_id": "t1_iq131nt",
            "score": 11,
            "created_utc": 1664244287.0,
            "replies": []
        },
        {
            "body": "It seems like you don’t understand what consensual sexual contact is",
            "author": "darthveevles",
            "id": "iq1g9h4",
            "parent_id": "t1_iq131nt",
            "score": 14,
            "created_utc": 1664236627.0,
            "replies": []
        },
        {
            "body": "Cuddling at night…\nEmbracing each other…\nHolding each other and falling asleep…\n\nSome people actually enjoy legit cuddling, without the sex. Night time cuddles doesn’t give someone automatic permission to penetrate either.\n\nCuddling and sex are two different things. \n\nSure, it’s possible that it’ll turn into sex, but it’s not mandatory.  I’ve dated guys who respected that boundary with me before and it created a much deeper bond/trust.",
            "author": "Koroleva7z",
            "id": "iq22a8i",
            "parent_id": "t1_iq1qvid",
            "score": 11,
            "created_utc": 1664246590.0,
            "replies": [
                {
                    "body": "THIS 👏🏼👏🏼👏🏼",
                    "author": null,
                    "id": "iq2cko1",
                    "parent_id": "t1_iq22a8i",
                    "score": 5,
                    "created_utc": 1664251876.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "The grass is always greener lol",
            "author": "Putrid_Bread",
            "id": "iq13tcy",
            "parent_id": "t1_iq10ef5",
            "score": 5,
            "created_utc": 1664231025.0,
            "replies": []
        },
        {
            "body": "Why should I have to tell someone not to play with my nipples or 😻 while I’m sleeping? He should’ve asked beforehand and I would’ve said no. He’s not entitled to do anything to me without consent just because he gives me money. Escorts don’t even allow anyone to do just anything to them and they’re being paid directly for their services, so why should I?",
            "author": "Putrid_Bread",
            "id": "iq17zme",
            "parent_id": "t1_iq16yr8",
            "score": 22,
            "created_utc": 1664232879.0,
            "replies": []
        },
        {
            "body": "*Blink*blink*blink*\nNo one paying for anything can do *anything* they want. No one, under any circumstance, is entitled to free and liberal access to another person’s body for their use. This SD clearly does not understand basic respect of someone’s physical personhood, specifically a woman’s physical person. His behavior is beyond atrocious and qualifies as sexual assault, as it was non-consensual, she told him to stop, and he didn’t. It’s kinda freaky that you think that a woman under any circumstance should “set the expectation” that she not be sexually assaulted.",
            "author": "darthveevles",
            "id": "iq1gqto",
            "parent_id": "t1_iq16yr8",
            "score": 20,
            "created_utc": 1664236850.0,
            "replies": [
                {
                    "body": "Again I am not saying it is right at all. Just sharing my opinion from her SDs perspective.",
                    "author": "macz786",
                    "id": "iq23xo7",
                    "parent_id": "t1_iq1gqto",
                    "score": -3,
                    "created_utc": 1664247361.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Since when does paying someone mean you can sexually assault or rape someone or cause bodily harm, etc..??? \n\nShe said no. And you think it's ok for him to keep going? \n\nDo YOU seriously grope women in their sleep without their consent? You know you're sexually assaulting them, right?",
            "author": "WhisperingPetals",
            "id": "iq1xpi9",
            "parent_id": "t1_iq16yr8",
            "score": 7,
            "created_utc": 1664244493.0,
            "replies": [
                {
                    "body": "I am not saying it is right at all. I am just saying what her SD might have thought. He sounded entitled in her case. Don’t kill the messenger.",
                    "author": "macz786",
                    "id": "iq23jmh",
                    "parent_id": "t1_iq1xpi9",
                    "score": -2,
                    "created_utc": 1664247182.0,
                    "replies": [
                        {
                            "body": "Okay, got it. Yea, who knows what this douchebag thought... some guys are so weird",
                            "author": "WhisperingPetals",
                            "id": "iq7cdhz",
                            "parent_id": "t1_iq23jmh",
                            "score": 1,
                            "created_utc": 1664344308.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I can not BELIEVE I have just read that 🤬 payment or not, stop means STOP!!! sick to death of this \"well I paid you, so you have to let me do whatever I want to you or I want my money back\" attitude. Just because a man has paid her doesn't mean he owns her body and can do what he wants with it even if she isn't comfortable with it. The entitlement of the men on this thread is disgusting, to think that you can over step boundaries and that consent doesn't matter because you've thrown a few hundred at her and think you're owed it. Predators.",
            "author": "savvylove69",
            "id": "iq8hbvc",
            "parent_id": "t1_iq16yr8",
            "score": 2,
            "created_utc": 1664373123.0,
            "replies": [
                {
                    "body": "Well said, completely agree",
                    "author": "macz786",
                    "id": "iqaxrv1",
                    "parent_id": "t1_iq8hbvc",
                    "score": 2,
                    "created_utc": 1664409093.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "How long is a marriage going to last if you won't let the other person sleep?",
            "author": "sirthunksalot",
            "id": "iq479p5",
            "parent_id": "t1_iq3j94b",
            "score": 3,
            "created_utc": 1664293505.0,
            "replies": [
                {
                    "body": "When you get married, you have to make adjustments and adapt to each other.  Anyone who has been married or lived with anyone for long time knows that you get used to each other and make adjustments.  The 1st night is always rough regardless what kind of relationship you’re in.  I’ve had debates about which side of bedsheets.  This is why it’s important to be adaptable too.  You wouldn’t want to sleep alone forever.  Nobody does.",
                    "author": "MKTekke",
                    "id": "iq48fem",
                    "parent_id": "t1_iq479p5",
                    "score": 1,
                    "created_utc": 1664293959.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "This is just disrespectful and rude. Has nothing to do with compromise.",
            "author": "blndy2022",
            "id": "iq5ccdz",
            "parent_id": "t1_iq3j94b",
            "score": 2,
            "created_utc": 1664309338.0,
            "replies": []
        },
        {
            "body": "I have no intention of seeing him again after he called me a mean bitch",
            "author": "Putrid_Bread",
            "id": "iq13jnf",
            "parent_id": "t1_iq11zy1",
            "score": 24,
            "created_utc": 1664230908.0,
            "replies": [
                {
                    "body": "And by that you mean you have no intentions of seeing him again after he disrespected your boundaries by groping you in your sleep, right? Calling you a bitch is the least of it. Imo. Stay safe and healthy.",
                    "author": "Miss_TinyToes",
                    "id": "iq178x3",
                    "parent_id": "t1_iq13jnf",
                    "score": 13,
                    "created_utc": 1664232553.0,
                    "replies": [
                        {
                            "body": "Well yes, at first I was gonna give him the benefit of the doubt and address it when I woke up. But then he called me a bitch and that was the last straw",
                            "author": "Putrid_Bread",
                            "id": "iq18i52",
                            "parent_id": "t1_iq178x3",
                            "score": 11,
                            "created_utc": 1664233106.0,
                            "replies": [
                                {
                                    "body": "I completely understand that! It’s really kind of sad. As a women we cannot give men the “benefit of the doubt” they take that as acceptance of the behavior. At least in my experiences. Peace and love. Be careful out there! Lol",
                                    "author": "Miss_TinyToes",
                                    "id": "iq1aj5q",
                                    "parent_id": "t1_iq18i52",
                                    "score": 14,
                                    "created_utc": 1664234016.0,
                                    "replies": []
                                },
                                {
                                    "body": "The use of the word \"bitch\" to someone you are intimate with (you) indicates a serious flaw in the SD and his vision of the relationship or self control.",
                                    "author": "pinotandsugar",
                                    "id": "iq1tvq7",
                                    "parent_id": "t1_iq18i52",
                                    "score": 7,
                                    "created_utc": 1664242764.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "I think the problem is his insistence which demonstrated both a lack of concern for her day and her boundaries. If you have sex with someone and they’re lying in bed with you, you can try to wake them up for sex with touching but you have to back off if they don’t respond affirmatively.",
                            "author": "JDMultralight",
                            "id": "iq1uw07",
                            "parent_id": "t1_iq178x3",
                            "score": 3,
                            "created_utc": 1664243214.0,
                            "replies": [
                                {
                                    "body": "No. Don't wake them up. If you want to wake them up after they've rested for a long while wake them up with kisses on the face and breakfast in bed.",
                                    "author": "WhisperingPetals",
                                    "id": "iq1y57z",
                                    "parent_id": "t1_iq1uw07",
                                    "score": 8,
                                    "created_utc": 1664244689.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Amen to this — never tolerate being called out of your name… ESPECIALLY when it’s just because he didn’t get his way. Smh",
                    "author": "Koroleva7z",
                    "id": "iq234ow",
                    "parent_id": "t1_iq13jnf",
                    "score": 3,
                    "created_utc": 1664246989.0,
                    "replies": []
                },
                {
                    "body": "I missed that part......\n\nAnything resembling that should be instant termination",
                    "author": "pinotandsugar",
                    "id": "iq2lzpn",
                    "parent_id": "t1_iq13jnf",
                    "score": 1,
                    "created_utc": 1664258125.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I personally don’t think it’s normal to fondle someone while they’re sleeping without prior consent. And I think you’re missing the part where I stopped him from touching me multiple times and told him to let me sleep and he called me a bitch for that. Not sure why I should try to fix things with someone who pushed my boundaries multiple times",
            "author": "Putrid_Bread",
            "id": "iq1b2oy",
            "parent_id": "t1_iq19tt1",
            "score": 12,
            "created_utc": 1664234266.0,
            "replies": []
        },
        {
            "body": "What white knights? I’m confused by your comment",
            "author": "Putrid_Bread",
            "id": "iq1rwnv",
            "parent_id": "t1_iq1p2o3",
            "score": 4,
            "created_utc": 1664241875.0,
            "replies": []
        },
        {
            "body": "Where did you get the information that I stayed the night because I needed the ppm? You’re reaching because you somehow want to justify that I deserved to assaulted in my sleep. Like I said in another comment HE suggested that I sleep over and offered me an Uber to work the next morning. He knew when I had to leave and why. Not my fault he’s a creep",
            "author": "Putrid_Bread",
            "id": "iq3kx6r",
            "parent_id": "t1_iq3a894",
            "score": 3,
            "created_utc": 1664283878.0,
            "replies": []
        },
        {
            "body": "Negative.",
            "author": "blndy2022",
            "id": "iq5ch7w",
            "parent_id": "t1_iq2k2y6",
            "score": 1,
            "created_utc": 1664309389.0,
            "replies": []
        },
        {
            "body": "I thought this wasn’t prostitution 🤔",
            "author": "Putrid_Bread",
            "id": "iq3nuui",
            "parent_id": "t1_iq2l964",
            "score": 3,
            "created_utc": 1664285305.0,
            "replies": [
                {
                    "body": "[removed]",
                    "author": null,
                    "id": "iq3ofx9",
                    "parent_id": "t1_iq3nuui",
                    "score": -2,
                    "created_utc": 1664285582.0,
                    "replies": [
                        {
                            "body": "He gives me the same amount every time so if anything he already got more than his money’s worth since I stayed over longer than I normally do. Maybe if he gave me even more money I would’ve been more willing",
                            "author": "Putrid_Bread",
                            "id": "iq3pis6",
                            "parent_id": "t1_iq3ofx9",
                            "score": 2,
                            "created_utc": 1664286086.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Holy warped view here.",
            "author": null,
            "id": "iq2cvbl",
            "parent_id": "t1_iq23hve",
            "score": 8,
            "created_utc": 1664252051.0,
            "replies": []
        },
        {
            "body": "So sexual assault is ok if he’s horny? Good to know.",
            "author": "blndy2022",
            "id": "iq5cfw6",
            "parent_id": "t1_iq23hve",
            "score": 2,
            "created_utc": 1664309375.0,
            "replies": [
                {
                    "body": "If you find yourself being the little spoon and not wanting to be touched I encourage you to speak up and communicate effectively that you do not want to be touched and if that doesn't work leave and go home.",
                    "author": "be1tran",
                    "id": "iq780g2",
                    "parent_id": "t1_iq5cfw6",
                    "score": 1,
                    "created_utc": 1664341224.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Rule #5: SLF is a sex-positive sub\n\nAdult descriptions of sex are welcome. Graphic sexual posts and how to posts on performing certain sexual acts are prohibited. Disrespectful or demeaning sexual descriptions (i.e. cumbucket, fuckboy, etc.,) will not be tolerated. Shaming of other participants (i.e. escort, John, pro SB, etc.) for having multiple sugar partners is not allowed. Nor is using those terms in a derogatory fashion to insult others allowed.",
            "author": "sugarlifestyleforum-ModTeam",
            "id": "iq3pt07",
            "parent_id": "t1_iq29ltt",
            "score": 2,
            "created_utc": 1664286214.0,
            "replies": []
        },
        {
            "body": "Rule #12: No Escorts/Johns\n\nNo escorts/Johns; although past personal experiences in escorting are fine, we will not allow promotion of this lifestyle or pricing discussion. We understand that some members of our community participate or have participated in both lifestyles but SLF is a Sugar-only sub. Breaking this rule may result in being banned without warning.",
            "author": "sugarlifestyleforum-ModTeam",
            "id": "iq46neo",
            "parent_id": "t1_iq3zhji",
            "score": 2,
            "created_utc": 1664293260.0,
            "replies": []
        },
        {
            "body": "I have no intentions of being with someone who calls me a bitch no matter how much money they give me",
            "author": "Putrid_Bread",
            "id": "iq5dbje",
            "parent_id": "t1_iq5181t",
            "score": 3,
            "created_utc": 1664309712.0,
            "replies": [
                {
                    "body": "Then time to block and move on.",
                    "author": "malcolm_reyn0lds",
                    "id": "iq65ksn",
                    "parent_id": "t1_iq5dbje",
                    "score": 1,
                    "created_utc": 1664321605.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "iq2ijr2",
            "parent_id": "t1_iq10q85",
            "score": -1,
            "created_utc": 1664255672.0,
            "replies": [
                {
                    "body": "Idk, pushing hands away multiple times seems like a pretty obvious no to me, especially if they said no during it. And stressing they needed to work in the morning and needed sleep was probably another way of not directly saying no, but still saying no. Even the moving to the other side of them bed and to have him continue *after that*, it just seems weird to me",
                    "author": "antiftmftm",
                    "id": "iq2kry0",
                    "parent_id": "t1_iq2ijr2",
                    "score": 11,
                    "created_utc": 1664257236.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "iq2lbr2",
                            "parent_id": "t1_iq2kry0",
                            "score": 0,
                            "created_utc": 1664257633.0,
                            "replies": [
                                {
                                    "body": "He should control himself? They shouldn't have to control him cause he has his own will and unless prior consent is given then that shouldn't happen",
                                    "author": "antiftmftm",
                                    "id": "iq2lji6",
                                    "parent_id": "t1_iq2lbr2",
                                    "score": 6,
                                    "created_utc": 1664257792.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "How can you say?",
            "author": "LadyoftheFlow4rs",
            "id": "iq13mrj",
            "parent_id": "t1_iq12rvp",
            "score": 5,
            "created_utc": 1664230945.0,
            "replies": []
        },
        {
            "body": "Exactly!! Why do I need to be woken up for some needy, probably sweaty, hasn’t showered from the night before, dick? #Next.",
            "author": null,
            "id": "iq18pju",
            "parent_id": "t1_iq18dzr",
            "score": 30,
            "created_utc": 1664233198.0,
            "replies": [
                {
                    "body": "and bad breath Ms mouthwash /s",
                    "author": "GSSD",
                    "id": "iq3jw1x",
                    "parent_id": "t1_iq18pju",
                    "score": 6,
                    "created_utc": 1664283364.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Hea a selfish a rude guy.  Stay away.",
            "author": "Bestyoucanbe4",
            "id": "iq4u64e",
            "parent_id": "t1_iq18dzr",
            "score": 5,
            "created_utc": 1664302374.0,
            "replies": []
        },
        {
            "body": "Because your not really a “person” to him. \n\nYour a thing he met in the chat box that’s he’s giving dead presidents to💀 to open her legs on command. \n\nLol 😂",
            "author": "PomegranateMelodic70",
            "id": "iq2eqjd",
            "parent_id": "t1_iq18dzr",
            "score": 8,
            "created_utc": 1664253190.0,
            "replies": []
        },
        {
            "body": "Ugh, yuck. I just cannot deal with that.",
            "author": "Koroleva7z",
            "id": "iq219p2",
            "parent_id": "t1_iq18dzr",
            "score": -1,
            "created_utc": 1664246120.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "iq3k017",
            "parent_id": "t1_iq3012c",
            "score": -8,
            "created_utc": 1664283419.0,
            "replies": [
                {
                    "body": "Sounds like a you problem.",
                    "author": "thehottubistoohawt",
                    "id": "iq4yjie",
                    "parent_id": "t1_iq3k017",
                    "score": 2,
                    "created_utc": 1664304062.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "even on weekdays when you have work at 8am?\n\n\nI wouldn't mind that on the weekend, but getting woken up at 5am right before work sounds fucking terrible",
            "author": "baasanka24",
            "id": "iq2whlz",
            "parent_id": "t1_iq2fx08",
            "score": 11,
            "created_utc": 1664266767.0,
            "replies": [
                {
                    "body": "That's absolutely ok for you to feel that way.\n\nBut this should be communicated with the SD in an adult manner. \n\nNot all people have the same desires and boundaries.\n\n Communicate and compromise.",
                    "author": "evad111",
                    "id": "iq2wqvv",
                    "parent_id": "t1_iq2whlz",
                    "score": 6,
                    "created_utc": 1664266994.0,
                    "replies": [
                        {
                            "body": "Sounds like she made it pretty clear. He crossed the line using inappropriate language and not respecting her body language of pushing him away and even moving away. Communication is key just sucks he decided to not listen and respond horribly.",
                            "author": "eshtahnohs",
                            "id": "iq57nba",
                            "parent_id": "t1_iq2wqvv",
                            "score": 7,
                            "created_utc": 1664307555.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Sounds like he doesn’t respect boundaries. You can’t teach an old dog new tricks.",
            "author": "thehottubistoohawt",
            "id": "iq4yn4s",
            "parent_id": "t1_iq2fx08",
            "score": 5,
            "created_utc": 1664304100.0,
            "replies": []
        },
        {
            "body": "I legit don’t understand it… like what do you think you’re doing trying to finger me while I’m asleep?",
            "author": "darthveevles",
            "id": "iq50gq0",
            "parent_id": "t1_iq4yuh3",
            "score": 5,
            "created_utc": 1664304792.0,
            "replies": [
                {
                    "body": "Men are perverse and they will always see what they can get away with.",
                    "author": "thehottubistoohawt",
                    "id": "iqxcq97",
                    "parent_id": "t1_iq50gq0",
                    "score": 2,
                    "created_utc": 1664827035.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "😎",
            "author": "hereyougococo",
            "id": "iq2635o",
            "parent_id": "t1_iq225pb",
            "score": 0,
            "created_utc": 1664248399.0,
            "replies": []
        },
        {
            "body": "This is why men are from mars and women are from Venus, except today’s world women are from Mercury.   Regardless, you had boundaries and expectations that were defined.  In a long term relationship, couples usually already worked this stuff out and becomes a non-issue.  The same thing with SR, I’ve had multiple stay overs and it only takes 1-2 nights to sort it out.  I’ve had SB that enjoyed the middle of night fondling and touching, she looks forward to being touched than just sex.  Men here aren’t blaming you, it’s the sort of adjustments or compromising that you need to learn if you want to have any sort of meaningful relationship in the future.",
            "author": "MKTekke",
            "id": "iq3qf1k",
            "parent_id": "t1_iq3jyp0",
            "score": -3,
            "created_utc": 1664286495.0,
            "replies": []
        },
        {
            "body": "Yes, this behavior is super rapey.",
            "author": "thehottubistoohawt",
            "id": "iq4z5no",
            "parent_id": "t1_iq3fwut",
            "score": 5,
            "created_utc": 1664304296.0,
            "replies": []
        },
        {
            "body": "AS HE SHOULD 🫡",
            "author": "spicycookie26",
            "id": "iq1dd3d",
            "parent_id": "t1_iq17hal",
            "score": 22,
            "created_utc": 1664235307.0,
            "replies": []
        },
        {
            "body": "and those same men will complain that SBs don't want to do overnight!",
            "author": "LightOLove",
            "id": "iq3uwy5",
            "parent_id": "t1_iq3l5mb",
            "score": 8,
            "created_utc": 1664288462.0,
            "replies": []
        },
        {
            "body": "I completely agree, I dont think any sub on reddit is safe for anyone, especially women.",
            "author": "Silly-Investment-598",
            "id": "itg15m4",
            "parent_id": "t1_iq9h2s8",
            "score": 1,
            "created_utc": 1666524090.0,
            "replies": []
        },
        {
            "body": "lmao exactly",
            "author": "Agitated_Ruin132",
            "id": "iq4zo5v",
            "parent_id": "t1_iq4yxr3",
            "score": 3,
            "created_utc": 1664304491.0,
            "replies": []
        },
        {
            "body": "I am totally good with a surprise heads up myself :P",
            "author": "SD_AU",
            "id": "iq68dk5",
            "parent_id": "t1_iq2by49",
            "score": 1,
            "created_utc": 1664322913.0,
            "replies": []
        },
        {
            "body": "I am female. \n\nI was asking a genuine question, you've answered it thank you.",
            "author": null,
            "id": "iq5gxxw",
            "parent_id": "t1_iq5g2sk",
            "score": 2,
            "created_utc": 1664311106.0,
            "replies": []
        },
        {
            "body": "That makes sense, it's an interesting relationship model. I think I'm too insubordinate to ever seriously consider that path.",
            "author": null,
            "id": "iq9k8cl",
            "parent_id": "t1_iq8ql8c",
            "score": 3,
            "created_utc": 1664388594.0,
            "replies": []
        },
        {
            "body": "Technically, you are a man, and you sleep in the same room as yourself.\n\nThis message brought to you be Pedantics-R-Us.",
            "author": "SD6ix",
            "id": "iq1rins",
            "parent_id": "t1_iq1h4fl",
            "score": 6,
            "created_utc": 1664241698.0,
            "replies": [
                {
                    "body": "Brought to you by -XXL-pedantics, but unless he's more than one man, his statement stands.",
                    "author": "justabebeh",
                    "id": "iq24v54",
                    "parent_id": "t1_iq1rins",
                    "score": 5,
                    "created_utc": 1664247801.0,
                    "replies": [
                        {
                            "body": "I stand out-pedanted!",
                            "author": "SD6ix",
                            "id": "iq5njkk",
                            "parent_id": "t1_iq24v54",
                            "score": 1,
                            "created_utc": 1664313701.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "It’s because the same chica won’t bat an eyelid if a loser vanilla who had nothing  to offer financially did exactly the same thing as this SD. She might take all of that as signs of “true love”!!!!!",
            "author": null,
            "id": "iq1xizu",
            "parent_id": "t1_iq1rwya",
            "score": -4,
            "created_utc": 1664244411.0,
            "replies": [
                {
                    "body": "Lol who is the sample size here, I can just about tolerate extended cuddles in the morning if I'm getting paid, but some 'loser vanilla' is getting kicked out...",
                    "author": "shovelkun",
                    "id": "iq306ck",
                    "parent_id": "t1_iq1xizu",
                    "score": 5,
                    "created_utc": 1664270114.0,
                    "replies": []
                },
                {
                    "body": "I mean keeping her up when she’s stressed she won’t sleep for work is probably something she’d probably have a big problem with anyone.  \n\nYou’re right that an instance of annoying sexual persistence wouldn’t be met with the same kind of outrage.  I think a lot of the time the dynamic is the SD harvesting sex from SB and her “giving it up” even in cases where she really likes it.  It’s one reason to be very careful with BDSM etc in SRs.  Its tough because the sex I prefer is often with me taking an “uncompromising” stance for the sake of the energy, but it could be read as regular demands rather than artfully contrived demanding vibe.",
                    "author": "JDMultralight",
                    "id": "iq46it5",
                    "parent_id": "t1_iq1xizu",
                    "score": 2,
                    "created_utc": 1664293211.0,
                    "replies": []
                }
            ]
        },
        {
            "body": ">  it sounds like -- it’s only irritating because she doesn’t love him and it’s an arrangement.\n\ntrue that. That is not to say a loving couple should submit to random fondling, but some actually welcome it. But anything can get old after a long time together.",
            "author": "GSSD",
            "id": "iq5nl3y",
            "parent_id": "t1_iq5bl08",
            "score": 1,
            "created_utc": 1664313719.0,
            "replies": []
        },
        {
            "body": "As I said in my first comment he is still in the wrong, but yeah an overnight with work at 8am just doesn’t sound like it’ll be fun for either involved. \n\nIf I pay for an overnight I’d want morning sex or else what’s the point really, and if she had work at 8am I don’t think that’s doable. So yeah, just wouldn’t do it.",
            "author": "lagrangianblunt",
            "id": "iq1ou5v",
            "parent_id": "t1_iq1o3ef",
            "score": -7,
            "created_utc": 1664240506.0,
            "replies": [
                {
                    "body": "As I said in the post I had to *leave* at 8 so there was plenty of time. I told him to wake me up at 7am specifically so we could have morning sex. I would’ve had sex with him in the morning if he hadn’t pestered me all night and call me a bitch in the morning. So what you’re saying doesn’t really apply",
                    "author": "Putrid_Bread",
                    "id": "iq1rnfm",
                    "parent_id": "t1_iq1ou5v",
                    "score": 19,
                    "created_utc": 1664241760.0,
                    "replies": [
                        {
                            "body": "He acted wrong but I’m just saying, I can see how an overnight ppm when you have early plans the next day can result in a negative situation.",
                            "author": "lagrangianblunt",
                            "id": "iq26qxq",
                            "parent_id": "t1_iq1rnfm",
                            "score": -8,
                            "created_utc": 1664248730.0,
                            "replies": [
                                {
                                    "body": "It was a negative situation because he kept foundling  her in her sleep and woke her up at 5am for morning sex, if you want morning sex at least be considerate and set a time with you're partner And he didn't have a problem with her having to leave at a certain time so that argument doesn't matter at all to the situation",
                                    "author": "throwthewholepieaway",
                                    "id": "iq485kh",
                                    "parent_id": "t1_iq26qxq",
                                    "score": 2,
                                    "created_utc": 1664293851.0,
                                    "replies": [
                                        {
                                            "body": "You’re disgusting",
                                            "author": null,
                                            "id": "iryg0th",
                                            "parent_id": "t1_iq485kh",
                                            "score": 1,
                                            "created_utc": 1665531530.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "“Overnight ppm”? So you admit you’re paying for sexual services. Genuine question, why don’t you just hire an escort? Oh right, you’re broke and need to exploit an underprivileged young girl who can’t say no",
                                    "author": "okkk0",
                                    "id": "iqljr2k",
                                    "parent_id": "t1_iq26qxq",
                                    "score": 0,
                                    "created_utc": 1664607641.0,
                                    "replies": [
                                        {
                                            "body": "Do you see the Reddit page you’re on? Lol. Nice try. \n\nDon’t see you giving OP shit for sugaring? When she literally was planning to do the same",
                                            "author": "lagrangianblunt",
                                            "id": "iqlkfbz",
                                            "parent_id": "t1_iqljr2k",
                                            "score": 1,
                                            "created_utc": 1664608200.0,
                                            "replies": [
                                                {
                                                    "body": "Idk what you’re talking about but aren’t you late for your shift at Walmart?",
                                                    "author": "okkk0",
                                                    "id": "iqlkl51",
                                                    "parent_id": "t1_iqlkfbz",
                                                    "score": 1,
                                                    "created_utc": 1664608334.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I stopped reading at the ”after he’s done with me” part",
            "author": null,
            "id": "iq24aax",
            "parent_id": "t1_iq1wsrh",
            "score": 5,
            "created_utc": 1664247527.0,
            "replies": []
        },
        {
            "body": "You can't have it both ways. It's either an sr or escorting. In an \"sr\" there's no such thing as a 2fer. You don't count the number of times you have sex. \n\nI agree with OP 100%. I'm just pointing out your inconsistency.",
            "author": "DarthNylus",
            "id": "iq23ko4",
            "parent_id": "t1_iq1wsrh",
            "score": 1,
            "created_utc": 1664247195.0,
            "replies": []
        },
        {
            "body": "Being expected to stay awake all night is not realistic, it’s being taken advantage of",
            "author": "RealEarthAngel",
            "id": "iq1xupx",
            "parent_id": "t1_iq1kfjx",
            "score": 10,
            "created_utc": 1664244557.0,
            "replies": []
        },
        {
            "body": "I wonder what happened to sense of humor?  Plus I never heard there was a function or setup you could do so your cock would get morning wood at specific time. \nI agree with the guy, OP is a grump biatch. She didn’t feel bad for his generosity. \nI don’t buy this 8AM shit. She has her whole life to sleep, why doing it exactly on the night or her sleepover? \nAs I usually say, many SBs are delusional on reality and expectations.",
            "author": "gapaf",
            "id": "iq2n5c3",
            "parent_id": "t1_iq2ch5x",
            "score": -8,
            "created_utc": 1664258978.0,
            "replies": [
                {
                    "body": "No wonder some of y’all have to pay for a girlfriend. You’re all insufferable",
                    "author": "Putrid_Bread",
                    "id": "iq3kaj7",
                    "parent_id": "t1_iq2n5c3",
                    "score": 9,
                    "created_utc": 1664283564.0,
                    "replies": [
                        {
                            "body": "No wonder you have to resort to sugar!  It is a two face coin babe! 😀",
                            "author": "gapaf",
                            "id": "iq3xky0",
                            "parent_id": "t1_iq3kaj7",
                            "score": -4,
                            "created_utc": 1664289584.0,
                            "replies": [
                                {
                                    "body": "Embarrassing that you’re proud of exploiting vulnerable women",
                                    "author": "okkk0",
                                    "id": "iqljfiy",
                                    "parent_id": "t1_iq3xky0",
                                    "score": 2,
                                    "created_utc": 1664607375.0,
                                    "replies": [
                                        {
                                            "body": "Embarassed you don’t understand the basics of what you intend to do. You are not vulnerable, mostly weak, probably lazy.",
                                            "author": "gapaf",
                                            "id": "iqlvwh0",
                                            "parent_id": "t1_iqljfiy",
                                            "score": 1,
                                            "created_utc": 1664618345.0,
                                            "replies": [
                                                {
                                                    "body": "You’re literally a social pariah who’s been outcasted from society and has to pay for basic human companionship😂",
                                                    "author": "okkk0",
                                                    "id": "iqnbrpq",
                                                    "parent_id": "t1_iqlvwh0",
                                                    "score": 2,
                                                    "created_utc": 1664645536.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "THIS 👏🏼👏🏼👏🏼",
            "author": null,
            "id": "iq2cko1",
            "parent_id": "t1_iq22a8i",
            "score": 5,
            "created_utc": 1664251876.0,
            "replies": []
        },
        {
            "body": "Again I am not saying it is right at all. Just sharing my opinion from her SDs perspective.",
            "author": "macz786",
            "id": "iq23xo7",
            "parent_id": "t1_iq1gqto",
            "score": -3,
            "created_utc": 1664247361.0,
            "replies": []
        },
        {
            "body": "I am not saying it is right at all. I am just saying what her SD might have thought. He sounded entitled in her case. Don’t kill the messenger.",
            "author": "macz786",
            "id": "iq23jmh",
            "parent_id": "t1_iq1xpi9",
            "score": -2,
            "created_utc": 1664247182.0,
            "replies": [
                {
                    "body": "Okay, got it. Yea, who knows what this douchebag thought... some guys are so weird",
                    "author": "WhisperingPetals",
                    "id": "iq7cdhz",
                    "parent_id": "t1_iq23jmh",
                    "score": 1,
                    "created_utc": 1664344308.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Well said, completely agree",
            "author": "macz786",
            "id": "iqaxrv1",
            "parent_id": "t1_iq8hbvc",
            "score": 2,
            "created_utc": 1664409093.0,
            "replies": []
        },
        {
            "body": "When you get married, you have to make adjustments and adapt to each other.  Anyone who has been married or lived with anyone for long time knows that you get used to each other and make adjustments.  The 1st night is always rough regardless what kind of relationship you’re in.  I’ve had debates about which side of bedsheets.  This is why it’s important to be adaptable too.  You wouldn’t want to sleep alone forever.  Nobody does.",
            "author": "MKTekke",
            "id": "iq48fem",
            "parent_id": "t1_iq479p5",
            "score": 1,
            "created_utc": 1664293959.0,
            "replies": []
        },
        {
            "body": "And by that you mean you have no intentions of seeing him again after he disrespected your boundaries by groping you in your sleep, right? Calling you a bitch is the least of it. Imo. Stay safe and healthy.",
            "author": "Miss_TinyToes",
            "id": "iq178x3",
            "parent_id": "t1_iq13jnf",
            "score": 13,
            "created_utc": 1664232553.0,
            "replies": [
                {
                    "body": "Well yes, at first I was gonna give him the benefit of the doubt and address it when I woke up. But then he called me a bitch and that was the last straw",
                    "author": "Putrid_Bread",
                    "id": "iq18i52",
                    "parent_id": "t1_iq178x3",
                    "score": 11,
                    "created_utc": 1664233106.0,
                    "replies": [
                        {
                            "body": "I completely understand that! It’s really kind of sad. As a women we cannot give men the “benefit of the doubt” they take that as acceptance of the behavior. At least in my experiences. Peace and love. Be careful out there! Lol",
                            "author": "Miss_TinyToes",
                            "id": "iq1aj5q",
                            "parent_id": "t1_iq18i52",
                            "score": 14,
                            "created_utc": 1664234016.0,
                            "replies": []
                        },
                        {
                            "body": "The use of the word \"bitch\" to someone you are intimate with (you) indicates a serious flaw in the SD and his vision of the relationship or self control.",
                            "author": "pinotandsugar",
                            "id": "iq1tvq7",
                            "parent_id": "t1_iq18i52",
                            "score": 7,
                            "created_utc": 1664242764.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "I think the problem is his insistence which demonstrated both a lack of concern for her day and her boundaries. If you have sex with someone and they’re lying in bed with you, you can try to wake them up for sex with touching but you have to back off if they don’t respond affirmatively.",
                    "author": "JDMultralight",
                    "id": "iq1uw07",
                    "parent_id": "t1_iq178x3",
                    "score": 3,
                    "created_utc": 1664243214.0,
                    "replies": [
                        {
                            "body": "No. Don't wake them up. If you want to wake them up after they've rested for a long while wake them up with kisses on the face and breakfast in bed.",
                            "author": "WhisperingPetals",
                            "id": "iq1y57z",
                            "parent_id": "t1_iq1uw07",
                            "score": 8,
                            "created_utc": 1664244689.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Amen to this — never tolerate being called out of your name… ESPECIALLY when it’s just because he didn’t get his way. Smh",
            "author": "Koroleva7z",
            "id": "iq234ow",
            "parent_id": "t1_iq13jnf",
            "score": 3,
            "created_utc": 1664246989.0,
            "replies": []
        },
        {
            "body": "I missed that part......\n\nAnything resembling that should be instant termination",
            "author": "pinotandsugar",
            "id": "iq2lzpn",
            "parent_id": "t1_iq13jnf",
            "score": 1,
            "created_utc": 1664258125.0,
            "replies": []
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "iq3ofx9",
            "parent_id": "t1_iq3nuui",
            "score": -2,
            "created_utc": 1664285582.0,
            "replies": [
                {
                    "body": "He gives me the same amount every time so if anything he already got more than his money’s worth since I stayed over longer than I normally do. Maybe if he gave me even more money I would’ve been more willing",
                    "author": "Putrid_Bread",
                    "id": "iq3pis6",
                    "parent_id": "t1_iq3ofx9",
                    "score": 2,
                    "created_utc": 1664286086.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "If you find yourself being the little spoon and not wanting to be touched I encourage you to speak up and communicate effectively that you do not want to be touched and if that doesn't work leave and go home.",
            "author": "be1tran",
            "id": "iq780g2",
            "parent_id": "t1_iq5cfw6",
            "score": 1,
            "created_utc": 1664341224.0,
            "replies": []
        },
        {
            "body": "Then time to block and move on.",
            "author": "malcolm_reyn0lds",
            "id": "iq65ksn",
            "parent_id": "t1_iq5dbje",
            "score": 1,
            "created_utc": 1664321605.0,
            "replies": []
        },
        {
            "body": "Idk, pushing hands away multiple times seems like a pretty obvious no to me, especially if they said no during it. And stressing they needed to work in the morning and needed sleep was probably another way of not directly saying no, but still saying no. Even the moving to the other side of them bed and to have him continue *after that*, it just seems weird to me",
            "author": "antiftmftm",
            "id": "iq2kry0",
            "parent_id": "t1_iq2ijr2",
            "score": 11,
            "created_utc": 1664257236.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "iq2lbr2",
                    "parent_id": "t1_iq2kry0",
                    "score": 0,
                    "created_utc": 1664257633.0,
                    "replies": [
                        {
                            "body": "He should control himself? They shouldn't have to control him cause he has his own will and unless prior consent is given then that shouldn't happen",
                            "author": "antiftmftm",
                            "id": "iq2lji6",
                            "parent_id": "t1_iq2lbr2",
                            "score": 6,
                            "created_utc": 1664257792.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "and bad breath Ms mouthwash /s",
            "author": "GSSD",
            "id": "iq3jw1x",
            "parent_id": "t1_iq18pju",
            "score": 6,
            "created_utc": 1664283364.0,
            "replies": []
        },
        {
            "body": "Sounds like a you problem.",
            "author": "thehottubistoohawt",
            "id": "iq4yjie",
            "parent_id": "t1_iq3k017",
            "score": 2,
            "created_utc": 1664304062.0,
            "replies": []
        },
        {
            "body": "That's absolutely ok for you to feel that way.\n\nBut this should be communicated with the SD in an adult manner. \n\nNot all people have the same desires and boundaries.\n\n Communicate and compromise.",
            "author": "evad111",
            "id": "iq2wqvv",
            "parent_id": "t1_iq2whlz",
            "score": 6,
            "created_utc": 1664266994.0,
            "replies": [
                {
                    "body": "Sounds like she made it pretty clear. He crossed the line using inappropriate language and not respecting her body language of pushing him away and even moving away. Communication is key just sucks he decided to not listen and respond horribly.",
                    "author": "eshtahnohs",
                    "id": "iq57nba",
                    "parent_id": "t1_iq2wqvv",
                    "score": 7,
                    "created_utc": 1664307555.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Men are perverse and they will always see what they can get away with.",
            "author": "thehottubistoohawt",
            "id": "iqxcq97",
            "parent_id": "t1_iq50gq0",
            "score": 2,
            "created_utc": 1664827035.0,
            "replies": []
        },
        {
            "body": "Brought to you by -XXL-pedantics, but unless he's more than one man, his statement stands.",
            "author": "justabebeh",
            "id": "iq24v54",
            "parent_id": "t1_iq1rins",
            "score": 5,
            "created_utc": 1664247801.0,
            "replies": [
                {
                    "body": "I stand out-pedanted!",
                    "author": "SD6ix",
                    "id": "iq5njkk",
                    "parent_id": "t1_iq24v54",
                    "score": 1,
                    "created_utc": 1664313701.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Lol who is the sample size here, I can just about tolerate extended cuddles in the morning if I'm getting paid, but some 'loser vanilla' is getting kicked out...",
            "author": "shovelkun",
            "id": "iq306ck",
            "parent_id": "t1_iq1xizu",
            "score": 5,
            "created_utc": 1664270114.0,
            "replies": []
        },
        {
            "body": "I mean keeping her up when she’s stressed she won’t sleep for work is probably something she’d probably have a big problem with anyone.  \n\nYou’re right that an instance of annoying sexual persistence wouldn’t be met with the same kind of outrage.  I think a lot of the time the dynamic is the SD harvesting sex from SB and her “giving it up” even in cases where she really likes it.  It’s one reason to be very careful with BDSM etc in SRs.  Its tough because the sex I prefer is often with me taking an “uncompromising” stance for the sake of the energy, but it could be read as regular demands rather than artfully contrived demanding vibe.",
            "author": "JDMultralight",
            "id": "iq46it5",
            "parent_id": "t1_iq1xizu",
            "score": 2,
            "created_utc": 1664293211.0,
            "replies": []
        },
        {
            "body": "As I said in the post I had to *leave* at 8 so there was plenty of time. I told him to wake me up at 7am specifically so we could have morning sex. I would’ve had sex with him in the morning if he hadn’t pestered me all night and call me a bitch in the morning. So what you’re saying doesn’t really apply",
            "author": "Putrid_Bread",
            "id": "iq1rnfm",
            "parent_id": "t1_iq1ou5v",
            "score": 19,
            "created_utc": 1664241760.0,
            "replies": [
                {
                    "body": "He acted wrong but I’m just saying, I can see how an overnight ppm when you have early plans the next day can result in a negative situation.",
                    "author": "lagrangianblunt",
                    "id": "iq26qxq",
                    "parent_id": "t1_iq1rnfm",
                    "score": -8,
                    "created_utc": 1664248730.0,
                    "replies": [
                        {
                            "body": "It was a negative situation because he kept foundling  her in her sleep and woke her up at 5am for morning sex, if you want morning sex at least be considerate and set a time with you're partner And he didn't have a problem with her having to leave at a certain time so that argument doesn't matter at all to the situation",
                            "author": "throwthewholepieaway",
                            "id": "iq485kh",
                            "parent_id": "t1_iq26qxq",
                            "score": 2,
                            "created_utc": 1664293851.0,
                            "replies": [
                                {
                                    "body": "You’re disgusting",
                                    "author": null,
                                    "id": "iryg0th",
                                    "parent_id": "t1_iq485kh",
                                    "score": 1,
                                    "created_utc": 1665531530.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "“Overnight ppm”? So you admit you’re paying for sexual services. Genuine question, why don’t you just hire an escort? Oh right, you’re broke and need to exploit an underprivileged young girl who can’t say no",
                            "author": "okkk0",
                            "id": "iqljr2k",
                            "parent_id": "t1_iq26qxq",
                            "score": 0,
                            "created_utc": 1664607641.0,
                            "replies": [
                                {
                                    "body": "Do you see the Reddit page you’re on? Lol. Nice try. \n\nDon’t see you giving OP shit for sugaring? When she literally was planning to do the same",
                                    "author": "lagrangianblunt",
                                    "id": "iqlkfbz",
                                    "parent_id": "t1_iqljr2k",
                                    "score": 1,
                                    "created_utc": 1664608200.0,
                                    "replies": [
                                        {
                                            "body": "Idk what you’re talking about but aren’t you late for your shift at Walmart?",
                                            "author": "okkk0",
                                            "id": "iqlkl51",
                                            "parent_id": "t1_iqlkfbz",
                                            "score": 1,
                                            "created_utc": 1664608334.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "No wonder some of y’all have to pay for a girlfriend. You’re all insufferable",
            "author": "Putrid_Bread",
            "id": "iq3kaj7",
            "parent_id": "t1_iq2n5c3",
            "score": 9,
            "created_utc": 1664283564.0,
            "replies": [
                {
                    "body": "No wonder you have to resort to sugar!  It is a two face coin babe! 😀",
                    "author": "gapaf",
                    "id": "iq3xky0",
                    "parent_id": "t1_iq3kaj7",
                    "score": -4,
                    "created_utc": 1664289584.0,
                    "replies": [
                        {
                            "body": "Embarrassing that you’re proud of exploiting vulnerable women",
                            "author": "okkk0",
                            "id": "iqljfiy",
                            "parent_id": "t1_iq3xky0",
                            "score": 2,
                            "created_utc": 1664607375.0,
                            "replies": [
                                {
                                    "body": "Embarassed you don’t understand the basics of what you intend to do. You are not vulnerable, mostly weak, probably lazy.",
                                    "author": "gapaf",
                                    "id": "iqlvwh0",
                                    "parent_id": "t1_iqljfiy",
                                    "score": 1,
                                    "created_utc": 1664618345.0,
                                    "replies": [
                                        {
                                            "body": "You’re literally a social pariah who’s been outcasted from society and has to pay for basic human companionship😂",
                                            "author": "okkk0",
                                            "id": "iqnbrpq",
                                            "parent_id": "t1_iqlvwh0",
                                            "score": 2,
                                            "created_utc": 1664645536.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Okay, got it. Yea, who knows what this douchebag thought... some guys are so weird",
            "author": "WhisperingPetals",
            "id": "iq7cdhz",
            "parent_id": "t1_iq23jmh",
            "score": 1,
            "created_utc": 1664344308.0,
            "replies": []
        },
        {
            "body": "Well yes, at first I was gonna give him the benefit of the doubt and address it when I woke up. But then he called me a bitch and that was the last straw",
            "author": "Putrid_Bread",
            "id": "iq18i52",
            "parent_id": "t1_iq178x3",
            "score": 11,
            "created_utc": 1664233106.0,
            "replies": [
                {
                    "body": "I completely understand that! It’s really kind of sad. As a women we cannot give men the “benefit of the doubt” they take that as acceptance of the behavior. At least in my experiences. Peace and love. Be careful out there! Lol",
                    "author": "Miss_TinyToes",
                    "id": "iq1aj5q",
                    "parent_id": "t1_iq18i52",
                    "score": 14,
                    "created_utc": 1664234016.0,
                    "replies": []
                },
                {
                    "body": "The use of the word \"bitch\" to someone you are intimate with (you) indicates a serious flaw in the SD and his vision of the relationship or self control.",
                    "author": "pinotandsugar",
                    "id": "iq1tvq7",
                    "parent_id": "t1_iq18i52",
                    "score": 7,
                    "created_utc": 1664242764.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I think the problem is his insistence which demonstrated both a lack of concern for her day and her boundaries. If you have sex with someone and they’re lying in bed with you, you can try to wake them up for sex with touching but you have to back off if they don’t respond affirmatively.",
            "author": "JDMultralight",
            "id": "iq1uw07",
            "parent_id": "t1_iq178x3",
            "score": 3,
            "created_utc": 1664243214.0,
            "replies": [
                {
                    "body": "No. Don't wake them up. If you want to wake them up after they've rested for a long while wake them up with kisses on the face and breakfast in bed.",
                    "author": "WhisperingPetals",
                    "id": "iq1y57z",
                    "parent_id": "t1_iq1uw07",
                    "score": 8,
                    "created_utc": 1664244689.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "He gives me the same amount every time so if anything he already got more than his money’s worth since I stayed over longer than I normally do. Maybe if he gave me even more money I would’ve been more willing",
            "author": "Putrid_Bread",
            "id": "iq3pis6",
            "parent_id": "t1_iq3ofx9",
            "score": 2,
            "created_utc": 1664286086.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "iq2lbr2",
            "parent_id": "t1_iq2kry0",
            "score": 0,
            "created_utc": 1664257633.0,
            "replies": [
                {
                    "body": "He should control himself? They shouldn't have to control him cause he has his own will and unless prior consent is given then that shouldn't happen",
                    "author": "antiftmftm",
                    "id": "iq2lji6",
                    "parent_id": "t1_iq2lbr2",
                    "score": 6,
                    "created_utc": 1664257792.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Sounds like she made it pretty clear. He crossed the line using inappropriate language and not respecting her body language of pushing him away and even moving away. Communication is key just sucks he decided to not listen and respond horribly.",
            "author": "eshtahnohs",
            "id": "iq57nba",
            "parent_id": "t1_iq2wqvv",
            "score": 7,
            "created_utc": 1664307555.0,
            "replies": []
        },
        {
            "body": "I stand out-pedanted!",
            "author": "SD6ix",
            "id": "iq5njkk",
            "parent_id": "t1_iq24v54",
            "score": 1,
            "created_utc": 1664313701.0,
            "replies": []
        },
        {
            "body": "He acted wrong but I’m just saying, I can see how an overnight ppm when you have early plans the next day can result in a negative situation.",
            "author": "lagrangianblunt",
            "id": "iq26qxq",
            "parent_id": "t1_iq1rnfm",
            "score": -8,
            "created_utc": 1664248730.0,
            "replies": [
                {
                    "body": "It was a negative situation because he kept foundling  her in her sleep and woke her up at 5am for morning sex, if you want morning sex at least be considerate and set a time with you're partner And he didn't have a problem with her having to leave at a certain time so that argument doesn't matter at all to the situation",
                    "author": "throwthewholepieaway",
                    "id": "iq485kh",
                    "parent_id": "t1_iq26qxq",
                    "score": 2,
                    "created_utc": 1664293851.0,
                    "replies": [
                        {
                            "body": "You’re disgusting",
                            "author": null,
                            "id": "iryg0th",
                            "parent_id": "t1_iq485kh",
                            "score": 1,
                            "created_utc": 1665531530.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "“Overnight ppm”? So you admit you’re paying for sexual services. Genuine question, why don’t you just hire an escort? Oh right, you’re broke and need to exploit an underprivileged young girl who can’t say no",
                    "author": "okkk0",
                    "id": "iqljr2k",
                    "parent_id": "t1_iq26qxq",
                    "score": 0,
                    "created_utc": 1664607641.0,
                    "replies": [
                        {
                            "body": "Do you see the Reddit page you’re on? Lol. Nice try. \n\nDon’t see you giving OP shit for sugaring? When she literally was planning to do the same",
                            "author": "lagrangianblunt",
                            "id": "iqlkfbz",
                            "parent_id": "t1_iqljr2k",
                            "score": 1,
                            "created_utc": 1664608200.0,
                            "replies": [
                                {
                                    "body": "Idk what you’re talking about but aren’t you late for your shift at Walmart?",
                                    "author": "okkk0",
                                    "id": "iqlkl51",
                                    "parent_id": "t1_iqlkfbz",
                                    "score": 1,
                                    "created_utc": 1664608334.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "No wonder you have to resort to sugar!  It is a two face coin babe! 😀",
            "author": "gapaf",
            "id": "iq3xky0",
            "parent_id": "t1_iq3kaj7",
            "score": -4,
            "created_utc": 1664289584.0,
            "replies": [
                {
                    "body": "Embarrassing that you’re proud of exploiting vulnerable women",
                    "author": "okkk0",
                    "id": "iqljfiy",
                    "parent_id": "t1_iq3xky0",
                    "score": 2,
                    "created_utc": 1664607375.0,
                    "replies": [
                        {
                            "body": "Embarassed you don’t understand the basics of what you intend to do. You are not vulnerable, mostly weak, probably lazy.",
                            "author": "gapaf",
                            "id": "iqlvwh0",
                            "parent_id": "t1_iqljfiy",
                            "score": 1,
                            "created_utc": 1664618345.0,
                            "replies": [
                                {
                                    "body": "You’re literally a social pariah who’s been outcasted from society and has to pay for basic human companionship😂",
                                    "author": "okkk0",
                                    "id": "iqnbrpq",
                                    "parent_id": "t1_iqlvwh0",
                                    "score": 2,
                                    "created_utc": 1664645536.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I completely understand that! It’s really kind of sad. As a women we cannot give men the “benefit of the doubt” they take that as acceptance of the behavior. At least in my experiences. Peace and love. Be careful out there! Lol",
            "author": "Miss_TinyToes",
            "id": "iq1aj5q",
            "parent_id": "t1_iq18i52",
            "score": 14,
            "created_utc": 1664234016.0,
            "replies": []
        },
        {
            "body": "The use of the word \"bitch\" to someone you are intimate with (you) indicates a serious flaw in the SD and his vision of the relationship or self control.",
            "author": "pinotandsugar",
            "id": "iq1tvq7",
            "parent_id": "t1_iq18i52",
            "score": 7,
            "created_utc": 1664242764.0,
            "replies": []
        },
        {
            "body": "No. Don't wake them up. If you want to wake them up after they've rested for a long while wake them up with kisses on the face and breakfast in bed.",
            "author": "WhisperingPetals",
            "id": "iq1y57z",
            "parent_id": "t1_iq1uw07",
            "score": 8,
            "created_utc": 1664244689.0,
            "replies": []
        },
        {
            "body": "He should control himself? They shouldn't have to control him cause he has his own will and unless prior consent is given then that shouldn't happen",
            "author": "antiftmftm",
            "id": "iq2lji6",
            "parent_id": "t1_iq2lbr2",
            "score": 6,
            "created_utc": 1664257792.0,
            "replies": []
        },
        {
            "body": "It was a negative situation because he kept foundling  her in her sleep and woke her up at 5am for morning sex, if you want morning sex at least be considerate and set a time with you're partner And he didn't have a problem with her having to leave at a certain time so that argument doesn't matter at all to the situation",
            "author": "throwthewholepieaway",
            "id": "iq485kh",
            "parent_id": "t1_iq26qxq",
            "score": 2,
            "created_utc": 1664293851.0,
            "replies": [
                {
                    "body": "You’re disgusting",
                    "author": null,
                    "id": "iryg0th",
                    "parent_id": "t1_iq485kh",
                    "score": 1,
                    "created_utc": 1665531530.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "“Overnight ppm”? So you admit you’re paying for sexual services. Genuine question, why don’t you just hire an escort? Oh right, you’re broke and need to exploit an underprivileged young girl who can’t say no",
            "author": "okkk0",
            "id": "iqljr2k",
            "parent_id": "t1_iq26qxq",
            "score": 0,
            "created_utc": 1664607641.0,
            "replies": [
                {
                    "body": "Do you see the Reddit page you’re on? Lol. Nice try. \n\nDon’t see you giving OP shit for sugaring? When she literally was planning to do the same",
                    "author": "lagrangianblunt",
                    "id": "iqlkfbz",
                    "parent_id": "t1_iqljr2k",
                    "score": 1,
                    "created_utc": 1664608200.0,
                    "replies": [
                        {
                            "body": "Idk what you’re talking about but aren’t you late for your shift at Walmart?",
                            "author": "okkk0",
                            "id": "iqlkl51",
                            "parent_id": "t1_iqlkfbz",
                            "score": 1,
                            "created_utc": 1664608334.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Embarrassing that you’re proud of exploiting vulnerable women",
            "author": "okkk0",
            "id": "iqljfiy",
            "parent_id": "t1_iq3xky0",
            "score": 2,
            "created_utc": 1664607375.0,
            "replies": [
                {
                    "body": "Embarassed you don’t understand the basics of what you intend to do. You are not vulnerable, mostly weak, probably lazy.",
                    "author": "gapaf",
                    "id": "iqlvwh0",
                    "parent_id": "t1_iqljfiy",
                    "score": 1,
                    "created_utc": 1664618345.0,
                    "replies": [
                        {
                            "body": "You’re literally a social pariah who’s been outcasted from society and has to pay for basic human companionship😂",
                            "author": "okkk0",
                            "id": "iqnbrpq",
                            "parent_id": "t1_iqlvwh0",
                            "score": 2,
                            "created_utc": 1664645536.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "You’re disgusting",
            "author": null,
            "id": "iryg0th",
            "parent_id": "t1_iq485kh",
            "score": 1,
            "created_utc": 1665531530.0,
            "replies": []
        },
        {
            "body": "Do you see the Reddit page you’re on? Lol. Nice try. \n\nDon’t see you giving OP shit for sugaring? When she literally was planning to do the same",
            "author": "lagrangianblunt",
            "id": "iqlkfbz",
            "parent_id": "t1_iqljr2k",
            "score": 1,
            "created_utc": 1664608200.0,
            "replies": [
                {
                    "body": "Idk what you’re talking about but aren’t you late for your shift at Walmart?",
                    "author": "okkk0",
                    "id": "iqlkl51",
                    "parent_id": "t1_iqlkfbz",
                    "score": 1,
                    "created_utc": 1664608334.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Embarassed you don’t understand the basics of what you intend to do. You are not vulnerable, mostly weak, probably lazy.",
            "author": "gapaf",
            "id": "iqlvwh0",
            "parent_id": "t1_iqljfiy",
            "score": 1,
            "created_utc": 1664618345.0,
            "replies": [
                {
                    "body": "You’re literally a social pariah who’s been outcasted from society and has to pay for basic human companionship😂",
                    "author": "okkk0",
                    "id": "iqnbrpq",
                    "parent_id": "t1_iqlvwh0",
                    "score": 2,
                    "created_utc": 1664645536.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Idk what you’re talking about but aren’t you late for your shift at Walmart?",
            "author": "okkk0",
            "id": "iqlkl51",
            "parent_id": "t1_iqlkfbz",
            "score": 1,
            "created_utc": 1664608334.0,
            "replies": []
        },
        {
            "body": "You’re literally a social pariah who’s been outcasted from society and has to pay for basic human companionship😂",
            "author": "okkk0",
            "id": "iqnbrpq",
            "parent_id": "t1_iqlvwh0",
            "score": 2,
            "created_utc": 1664645536.0,
            "replies": []
        }
    ]
}