{
    "title": "The fact that Somin blends in so well into girl groups is a true statement of her beauty",
    "post_id": "jf5yvy",
    "post_url": "https://www.reddit.com/r/runningman/comments/jf5yvy/the_fact_that_somin_blends_in_so_well_into_girl/",
    "author": "lzyan",
    "body": "",
    "url": "https://i.redd.it/1u00mgfnidu51.jpg",
    "score": 480,
    "upvote_ratio": 0.97,
    "created_utc": 1603253675.0,
    "num_comments": 59,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "So-min H2H talk with Nayeon when they were in jail was an underrated scene",
            "author": "echofades",
            "id": "g9ipi76",
            "parent_id": "t3_jf5yvy",
            "score": 78,
            "created_utc": 1603263904.0,
            "replies": [
                {
                    "body": "So true. I really like how confident Nayeon has gotten since debut (I’m a once). I don’t think she would’ve done that 5 years ago. I also really like how she and Somin and even Jeongyeon were able to talk. I feel like Somin gets treated like she doesn’t have the feelings every woman has.",
                    "author": "NellyJelly_",
                    "id": "g9ljy16",
                    "parent_id": "t1_g9ipi76",
                    "score": 16,
                    "created_utc": 1603325783.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "It is not like it was handed over to her... Her career has so many up and downs. she really worked hard to be where she is now. The women is so talented in many aspects. Her face didn't help her (unlike many others) , but it her blood and sweat. Her story of struggling and maltreatment reminds me a lot of KJK, her hardworking nature and work ethics even more. There are many times when we hear her say \"i'm just working hard\" \"i'm doing my job\", unlike many others think, she don't shows up to RM to play, but to contribute and lift the burden from her seniors, and that's why they adore her.",
            "author": "Minguri22",
            "id": "g9iyyi4",
            "parent_id": "t3_jf5yvy",
            "score": 64,
            "created_utc": 1603274415.0,
            "replies": []
        },
        {
            "body": "From Twice's manager to 5th Blackpink member good job somin! :D",
            "author": "dota696969",
            "id": "g9j1662",
            "parent_id": "t3_jf5yvy",
            "score": 31,
            "created_utc": 1603276796.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "g9l2dv3",
                    "parent_id": "t1_g9j1662",
                    "score": 6,
                    "created_utc": 1603316392.0,
                    "replies": [
                        {
                            "body": "Her name is Jasu! Hehehe. ❤️❤️❤️",
                            "author": "neriz01",
                            "id": "g9pc2ck",
                            "parent_id": "t1_g9l2dv3",
                            "score": 3,
                            "created_utc": 1603409435.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I really thought Somin was in her mid-20s when she first joined RM, and honestly until now..",
            "author": null,
            "id": "g9ijkf0",
            "parent_id": "t3_jf5yvy",
            "score": 81,
            "created_utc": 1603258367.0,
            "replies": []
        },
        {
            "body": "Honestly what it boils down to is Somin is beautiful, talented, successful, funny, creative, and gets paid to spend a lot of time with other celebrities. And there are just awful people in this world who can’t deal with how jealous they are because that happens to be her life and not theirs.",
            "author": "UnderOurPants",
            "id": "g9ix1es",
            "parent_id": "t3_jf5yvy",
            "score": 50,
            "created_utc": 1603272263.0,
            "replies": []
        },
        {
            "body": "Somin is so refreshing on the show! I love the different girl dynamic she brings along! Her dance with BP was sooooo cute 🥺",
            "author": "forlorn_ranger",
            "id": "g9iny3p",
            "parent_id": "t3_jf5yvy",
            "score": 55,
            "created_utc": 1603262379.0,
            "replies": []
        },
        {
            "body": "I think it's not as noticeable usually but when girl groups come on, you can see that So Min is actually pretty tall. She mentioned in a recent article she had a complex about her height because she's ~170cm.",
            "author": "zaichii",
            "id": "g9j79jq",
            "parent_id": "t3_jf5yvy",
            "score": 19,
            "created_utc": 1603282224.0,
            "replies": []
        },
        {
            "body": "JASU is my new bias now",
            "author": "namputz",
            "id": "g9j4n0d",
            "parent_id": "t3_jf5yvy",
            "score": 23,
            "created_utc": 1603280110.0,
            "replies": []
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "g9iy8k8",
            "parent_id": "t3_jf5yvy",
            "score": 22,
            "created_utc": 1603273609.0,
            "replies": [
                {
                    "body": "people are actively reporting those now! im proud of the real fans!",
                    "author": "Cat4Why7",
                    "id": "g9lz7bs",
                    "parent_id": "t1_g9iy8k8",
                    "score": 8,
                    "created_utc": 1603334645.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "why are the members themselves are not voicing out on the hate comments somin receives?",
            "author": "jarball",
            "id": "g9iqnp6",
            "parent_id": "t3_jf5yvy",
            "score": 35,
            "created_utc": 1603265089.0,
            "replies": [
                {
                    "body": "when SJH fans attack JSJ for not take picture with SJH, instead to ignore them. he was kind of apologies and post photo with SJH!  and I think he write comments about sjh wasn't there with them!\n\nonce I saw that I know that why they can't say anything to her because her toxic fans",
                    "author": "3lmy3lmk",
                    "id": "g9j09qz",
                    "parent_id": "t1_g9iqnp6",
                    "score": 26,
                    "created_utc": 1603275846.0,
                    "replies": [
                        {
                            "body": "Sjh fans just asking 'where jihyo' 🙊 how is this so called toxic????",
                            "author": "Nogold84",
                            "id": "g9j2kuf",
                            "parent_id": "t1_g9j09qz",
                            "score": -24,
                            "created_utc": 1603278229.0,
                            "replies": [
                                {
                                    "body": "Its toxic when fans keep insisting the producers/editors delibrately cut SJH out lmao. I would love to watch a 5 hour compilation of SJH saying a maximum of 10 sentences and only reacting/laughing to what others said",
                                    "author": "jarball",
                                    "id": "g9j6xfd",
                                    "parent_id": "t1_g9j2kuf",
                                    "score": 27,
                                    "created_utc": 1603281966.0,
                                    "replies": []
                                },
                                {
                                    "body": ">They ask that even for shows that don't have SJH as a member or guest, they ask it for Happy Together, Michuri & Sixth Sense videos, like trying to terrorize JSM fans, since JSM was a guest or permanent member on those shows.",
                                    "author": "jhdnhc",
                                    "id": "g9k6dla",
                                    "parent_id": "t1_g9j2kuf",
                                    "score": 12,
                                    "created_utc": 1603301101.0,
                                    "replies": []
                                },
                                {
                                    "body": "Coz the fans victimize her, thinking she's being left out.",
                                    "author": "loldiiij",
                                    "id": "g9j38lq",
                                    "parent_id": "t1_g9j2kuf",
                                    "score": 21,
                                    "created_utc": 1603278857.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "i've always disliked the way the members only make jokes about the hate comments. i still remember one episode where hong jin young said that one of spartace fans sent her a death threat if she comes between jongkook and jihyo and the members just said \"they are violent just like their fave\" and that was it. that whole scene left a bad taste in my mouth. like i understand the need for them to keep things light and breezy on the show but they really should address it in an interview or sth instead of just playing it off as a joke. because when they say that, those antis will just keep using it as an excuse, thinking if the members are cool with it they have permission to continue. even after they terrorized somin into taking a break and even her family had to come forward and spoke about the hate comments, you can just tell those people don't feel any remorse for hurting her like that. it sucks and hard to talk about but the members and crew should really try to address the problem directly.",
                    "author": "kdramayes",
                    "id": "g9j63f8",
                    "parent_id": "t1_g9iqnp6",
                    "score": 21,
                    "created_utc": 1603281310.0,
                    "replies": [
                        {
                            "body": "I understand members want to protect their 'fans' but KJK should have either bluntly told their fans to shut up or tone down.\n\nAll he did was saying like the fans mean no harm when that particular fan started private message HJY which is clearly wrong.\n\nI know celebrities can have their careers ended by 1 small mistakes but it clearly time for their government to step up their law regarding online harassment.",
                            "author": null,
                            "id": "g9kkptb",
                            "parent_id": "t1_g9j63f8",
                            "score": 6,
                            "created_utc": 1603307893.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "I love Somin since from the very first episode of her as a guest. She is a public figure, I understand it is hurt in some way but she just need to be who she want herself to be. If I have a chance to say something to her personally, I want to tell her , just continue what she want to do but every celebrities and public figures have to find balance in their life and it is the most difficult thing to do, just find the balance and be happy. \n\nTo those Jiho fans, I love her too but she worked hard many years already and she don't want anything now, she accomplished everything already. You can see that in her expression, she love to see Somin and she really enjoy just being in RM. Just let her focus on acting, don't forget she is actress not variety star.",
                    "author": "chanmo14",
                    "id": "g9jybd0",
                    "parent_id": "t1_g9iqnp6",
                    "score": 8,
                    "created_utc": 1603297234.0,
                    "replies": []
                },
                {
                    "body": "Probably because people from upper management told them not to.\n\nThe people writing hateful comments are disgusting but hey they do generate revenue for SBS, whether that's through more views on online platforms (Kowoca, Youtube clips etc) or when the RM members go to like Vietnam to hold a concert. It's a lot of money.\n\nAlso maybe less of a reason but it can also redirect the hate towards them",
                    "author": "KawaiCuddle",
                    "id": "g9ivg35",
                    "parent_id": "t1_g9iqnp6",
                    "score": 17,
                    "created_utc": 1603270430.0,
                    "replies": [
                        {
                            "body": "You probably right but the hate she's getting is so undeserving that its probably bullying now, they kinda need to step up tbh",
                            "author": "jarball",
                            "id": "g9iylii",
                            "parent_id": "t1_g9ivg35",
                            "score": 31,
                            "created_utc": 1603274009.0,
                            "replies": [
                                {
                                    "body": "Yeah sadly. and it's clear Somin is very much affected by this (remember she had to take a break from RM before?). I feel like the best person to do it would be jihyo herself since it's her fans. They would probably listen to her more than SBS's threats.",
                                    "author": "KawaiCuddle",
                                    "id": "g9j01sw",
                                    "parent_id": "t1_g9iylii",
                                    "score": 26,
                                    "created_utc": 1603275612.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "But we are talking about big names who are worth companies... You think KJK or YJS can be told no to do something good??\n\nMy guess is that, they are experienced enough and don't want it to escalate to the point of it to be called scandal or incident. Shows in Korea cannot survive that. Or, my unpopular opinion, is that they know who do this, and they are not RM fans... so adressing someone else's fans is a bit...",
                            "author": "Itamitsuki",
                            "id": "g9j1rs3",
                            "parent_id": "t1_g9ivg35",
                            "score": 6,
                            "created_utc": 1603277412.0,
                            "replies": []
                        },
                        {
                            "body": "well the fanmeetings are over for a few years, and haters are a complete minority that can't affect the views platforms. At the end you're saying that money is more important than her and because of that the members, PDs and SBS are ok with that.",
                            "author": "NiallCraig",
                            "id": "g9iz2zy",
                            "parent_id": "t1_g9ivg35",
                            "score": 3,
                            "created_utc": 1603274552.0,
                            "replies": [
                                {
                                    "body": "“Haters are a complete minority” \nI’m sorry,have u been under a rock??",
                                    "author": "andreafatgirlslim",
                                    "id": "g9jd5uo",
                                    "parent_id": "t1_g9iz2zy",
                                    "score": 14,
                                    "created_utc": 1603286210.0,
                                    "replies": [
                                        {
                                            "body": "no, but the people who loves and supports somin surpasses by far the haters (thas why they're a minority).",
                                            "author": "NiallCraig",
                                            "id": "g9jievg",
                                            "parent_id": "t1_g9jd5uo",
                                            "score": 4,
                                            "created_utc": 1603289228.0,
                                            "replies": [
                                                {
                                                    "body": "[deleted]",
                                                    "author": null,
                                                    "id": "g9jjfhk",
                                                    "parent_id": "t1_g9jievg",
                                                    "score": -1,
                                                    "created_utc": 1603289778.0,
                                                    "replies": [
                                                        {
                                                            "body": "so what do you want??? this people are far far far away from korea anyway, they will hate her forever, there's nothing you can't do about that. So its better to look at the good things, they're a complete minority.",
                                                            "author": "NiallCraig",
                                                            "id": "g9k8zbb",
                                                            "parent_id": "t1_g9jjfhk",
                                                            "score": 1,
                                                            "created_utc": 1603302332.0,
                                                            "replies": [
                                                                {
                                                                    "body": "That it shouldn’t be ignored and it will only get worst if we continue to do so?",
                                                                    "author": "andreafatgirlslim",
                                                                    "id": "g9ko3ar",
                                                                    "parent_id": "t1_g9k8zbb",
                                                                    "score": 2,
                                                                    "created_utc": 1603309508.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "no one can't do anything, especially bcs this people are not even in korea, so the korean law can't touch them. The best thing is disable somin and RM comment section from IG.",
                                                                            "author": "NiallCraig",
                                                                            "id": "g9krgu4",
                                                                            "parent_id": "t1_g9ko3ar",
                                                                            "score": 1,
                                                                            "created_utc": 1603311140.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "I'm not justifying the company's actions of not telling the haters to GTFO, just providing a likely explanation. We don't actually know the numbers but they seem to amount to several hundreds at least to a few thousands, which SBS could see as significant. They had a fanmeeting in Vietnam and Indonesia in 2019. Sure with Covid it might not happen until a vaccine is developped, but it is not impossible in the near future. Thousands of people buying a 50$ concert ticket? Yeah that's a lot of money.\n\nI too wish the members or the company would do something like take legal actions, but unfortunately I do think SBS values money more than their contractual employees. That's how most big business operate, sadly. The PDs have 0 say in this, unless they want to get fired by SBS.",
                                    "author": "KawaiCuddle",
                                    "id": "g9izmq6",
                                    "parent_id": "t1_g9iz2zy",
                                    "score": -1,
                                    "created_utc": 1603275153.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "I think because it's a variety show and generally meant to be kept entertaining and light. The only time they ever go serious is if they need to apologise for any member's scandal usually.",
                    "author": "zaichii",
                    "id": "g9j73no",
                    "parent_id": "t1_g9iqnp6",
                    "score": 3,
                    "created_utc": 1603282101.0,
                    "replies": []
                },
                {
                    "body": "It's not in their own best interest to scold their own fan base, like it doesn't directly impact their own careers, the most they've done is make jokes about the online bullying/death threats.",
                    "author": "jhdnhc",
                    "id": "g9k7a7n",
                    "parent_id": "t1_g9iqnp6",
                    "score": 2,
                    "created_utc": 1603301534.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "She got the best chemistry with female guest on and off camera..like with kang hanna, jessi, lee da hae.",
            "author": "ptolemyshark",
            "id": "g9leozq",
            "parent_id": "t3_jf5yvy",
            "score": 16,
            "created_utc": 1603322757.0,
            "replies": []
        },
        {
            "body": "Honestly,that is the problem too. She is beautiful. I do believe if she not beautiful. She won't receive as much hate from the vocal minority of sjh fanbase. They seem so scared that the entire focus will be on jsm. \n\nIts funny to think,we used to hate the sbs head department for the way the treat sjh wanting to push her out. But seeing soo many toxicity from her fanbase makes me think,maybe that would've been the best option. I just don't know. I like both. Maybe she should come out and address her fans or say something like \" please support jsm \" ..",
            "author": null,
            "id": "g9ig6wh",
            "parent_id": "t3_jf5yvy",
            "score": 32,
            "created_utc": 1603255586.0,
            "replies": [
                {
                    "body": "I always got the impression from the show that Koreans do consider her as the \"cute\" type and not as beauty (\"kim tae hee\" type). Whereas SJH was a beauty type. I also never heard any mentions about her beauty on other shows (which doesn't mean much, I dont watch a lot). My point is: I don't think SJH's fans are worried about JSM's beauty. Those fans are simply very young, vocal on socials and a bit crazy.",
                    "author": "0moe",
                    "id": "g9ixt53",
                    "parent_id": "t1_g9ig6wh",
                    "score": 8,
                    "created_utc": 1603273138.0,
                    "replies": [
                        {
                            "body": "Yup. She's considered the cute type. I am not korean therefore i am not sure what korean beauty standard is. But i do know them being homogeneous,they have a beauty standard. \n\nYes,you might be right. They're not worried about jsm beauty. Rather a bunch of young edgy fans. We used to be young too. Fortunately in our time the presence of social media isn't that huge. As such we are spared from commenting or showing our stupidity online lol. \n\nNevertheless,its never right to hate on someone to show your appreciation for another. Hope they grow up and realise, everything in RM is for entertainment.",
                            "author": null,
                            "id": "g9iywkt",
                            "parent_id": "t1_g9ixt53",
                            "score": 12,
                            "created_utc": 1603274354.0,
                            "replies": []
                        },
                        {
                            "body": "SJH is a beauty but so boring, she's nothing special, you got tired of her so easly. Somin is what SJH never will be, bcs she's not talented enough, that's why she got hate, bcs the jealousy and envy from SJH fans.",
                            "author": "NiallCraig",
                            "id": "g9izfzq",
                            "parent_id": "t1_g9ixt53",
                            "score": -7,
                            "created_utc": 1603274950.0,
                            "replies": [
                                {
                                    "body": "We don’t need to put SJH down to support SoMin- they are so different and the idea of putting two woman against each other or that one needs to be pushed down to support the other is just so disappointing.  \nThey are apples and oranges- an introvert and an extrovert! \nThat said SJH’s fanatical and obsessive base is really dangerous. They are never going to be happy until RM is just half close ups of SJH laughing with her hand over her mouth.  You’d think her fans would realize and accept that SJH is a quiet maturing person and that quiet people don’t get the majority edit in a variety show and that playing up the love line as she continues to mature is probably pretty exhausting /insulting to SJH. It’s bizarre that they feel entitled to send so much hate on behalf of somebody they supposedly care about.",
                                    "author": "ImpossibleWarning6",
                                    "id": "g9j4p0z",
                                    "parent_id": "t1_g9izfzq",
                                    "score": 10,
                                    "created_utc": 1603280158.0,
                                    "replies": [
                                        {
                                            "body": "im not putting anyone down, im explain you why people hate her. Many people thought that SJH was so special and somin proved them wrong (they're angry and can't accept the truth and they need to hate someone to feel better). So are you saying that SJH is so funny and entertaining???? the thing she likes the most is sleep. Seriously do you think that she's so interesting??? She seems soulless and apatethic about evertything. My main point is that SJH always was so overrated.",
                                            "author": "NiallCraig",
                                            "id": "g9j7cn5",
                                            "parent_id": "t1_g9j4p0z",
                                            "score": 9,
                                            "created_utc": 1603282286.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "Nothing? Boring? Is just for u dude",
                                    "author": "Nogold84",
                                    "id": "g9j2mqm",
                                    "parent_id": "t1_g9izfzq",
                                    "score": 0,
                                    "created_utc": 1603278280.0,
                                    "replies": [
                                        {
                                            "body": "sjh is so boring, the only thing you can tell about her all the time is how pretty/beautiful she is and that's all (she's only a pretty girl, that's why she got famous). RM is not a beauty contest you need something more, that's why she doesnt get any screentime. As guy, i will choose a girl like somin over SJH without thinking about it. I dont find anyting intersting about SJH sorry, but yes, its my opinion, that's why comments exist for telling the people's opinion.",
                                            "author": "NiallCraig",
                                            "id": "g9j7gf5",
                                            "parent_id": "t1_g9j2mqm",
                                            "score": 6,
                                            "created_utc": 1603282366.0,
                                            "replies": [
                                                {
                                                    "body": "K.",
                                                    "author": "farnnie123",
                                                    "id": "g9k7osb",
                                                    "parent_id": "t1_g9j7gf5",
                                                    "score": 0,
                                                    "created_utc": 1603301729.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "Somin is what sjh never be ? 😀😀 the funniest joke ever",
                                    "author": "Nogold84",
                                    "id": "g9j2ogx",
                                    "parent_id": "t1_g9izfzq",
                                    "score": -2,
                                    "created_utc": 1603278327.0,
                                    "replies": [
                                        {
                                            "body": "in the variety world YES.",
                                            "author": "NiallCraig",
                                            "id": "g9ji36e",
                                            "parent_id": "t1_g9j2ogx",
                                            "score": 12,
                                            "created_utc": 1603289046.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "What episodes are these two?",
            "author": "Suzukinobuko",
            "id": "g9ivfnu",
            "parent_id": "t3_jf5yvy",
            "score": 3,
            "created_utc": 1603270416.0,
            "replies": [
                {
                    "body": "Twice - 506\n\nBlackPink - 525",
                    "author": "Gaikoz",
                    "id": "g9iwp6o",
                    "parent_id": "t1_g9ivfnu",
                    "score": 4,
                    "created_utc": 1603271879.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "g9l2ael",
            "parent_id": "t3_jf5yvy",
            "score": 3,
            "created_utc": 1603316349.0,
            "replies": [
                {
                    "body": "What I heard is that she was a trainee to become a faceless singer (seems like something trendy at that time) but the guy scammed her and ran away to Japan.",
                    "author": "rainsunicecream",
                    "id": "g9mq21y",
                    "parent_id": "t1_g9l2ael",
                    "score": 5,
                    "created_utc": 1603357490.0,
                    "replies": []
                },
                {
                    "body": "I don't remember her saying it but I've heard it quite a bit from comments and stuff. That would explain how she picked up the choreo for their group performance relatively quick",
                    "author": "p1n6",
                    "id": "g9lsize",
                    "parent_id": "t1_g9l2ael",
                    "score": 1,
                    "created_utc": 1603330705.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I agree that Somin is beautiful but in Korea standard, actress are supposed to be more beautiful than idols. I'm not saying this view is right or wrong, I just find it funny because by saying she blends so well with girl groups, OP title actually lowering the beauty of Somin. \n\nI know OP didn't mean it that way but when I think about it in Korean standard i just got a good laugh out of it. Btw, just so you know, I am a big fan of Somin and not a hater. I love her character and her beauty on the show",
            "author": "KTDLegend",
            "id": "g9iqckt",
            "parent_id": "t3_jf5yvy",
            "score": -21,
            "created_utc": 1603264771.0,
            "replies": [
                {
                    "body": "You have a point but I meant it in a way like \"idol\" beauty. Like she not only has the actor beauty, but also can be cutesy, smily, dances well and has good proportion, which makes her have the kind of idol-ish beauty.\n\nLike Jihyo is also very pretty, but she does not blend well in girl groups, because they are beautiful in a different kind of way.",
                    "author": "lzyan",
                    "id": "g9j0ql2",
                    "parent_id": "t1_g9iqckt",
                    "score": 7,
                    "created_utc": 1603276344.0,
                    "replies": []
                },
                {
                    "body": "Bae suzy and Yoona weren't idols?? They were known to be visual in their idol time, and now successful as actresses. Even if you have the visual and not the talent, you alwaya will be a C rank actress. Specially nowdays, in Korea the best actresses are not known by their beauty.",
                    "author": "Itamitsuki",
                    "id": "g9j1dci",
                    "parent_id": "t1_g9iqckt",
                    "score": 3,
                    "created_utc": 1603277003.0,
                    "replies": []
                },
                {
                    "body": ">but in Korea standard, actress are supposed to be more beautiful than idols\n\nfor real? wow. never know that.\n\nbut correct me if im wrong, somin wasn't that famous as an actress as well right? before she joined RM i mean. because i remembered she did mentioned she only stay at home do nothing and she's trying so hard looking for sponsor/adv agency to cast when she was a guest in one of the episode?\n\n(by no mean i'm downgrading here. just stating the fact)",
                    "author": "najmiii",
                    "id": "g9iqztj",
                    "parent_id": "t1_g9iqckt",
                    "score": 5,
                    "created_utc": 1603265450.0,
                    "replies": [
                        {
                            "body": "Yes,\nShe actually did well in princess aurora earning her the new best actress award in 2013. But there is no follow up after that. \n\nThe thing is,korean acting industry is tough. Once you miss the train,its hard to get back up. She's already 33. Its hard for her to suddenly become popular through acting again. \n\nSon dam bi Once said that the moment you step in the variety world as a permanent cast especially when you're an actress,its hard to get casted for acting again.",
                            "author": null,
                            "id": "g9is66p",
                            "parent_id": "t1_g9iqztj",
                            "score": 7,
                            "created_utc": 1603266727.0,
                            "replies": []
                        },
                        {
                            "body": "Yeh she wasn't that famous, similar to Kang Hanna during the period where she appears for many episode within consecutive weeks.\n\nActually now I find it funny because as a singer/idol, even if you are not very famous you can still get gags to sing at different social events, at clubs or festivals or places like that, but if you are an actor/actress and your not famous, you pretty much has nothing to do when you are not casted lol.",
                            "author": "KTDLegend",
                            "id": "g9irc38",
                            "parent_id": "t1_g9iqztj",
                            "score": -6,
                            "created_utc": 1603265817.0,
                            "replies": [
                                {
                                    "body": "yeahh true that.",
                                    "author": "najmiii",
                                    "id": "g9irj05",
                                    "parent_id": "t1_g9irc38",
                                    "score": 1,
                                    "created_utc": 1603266022.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Yes true. \nThe thing is we look at them from a foreign eyes. What we deemed beautiful isn't necessarily beautiful in korean eyes. Korean eyes is what matters at the end of the day. That is their market. \n\nTo put it politely,To them jsm is beautiful. Yet not beautiful enough to be a top top actress. She is indeed considered as one of the most beautiful variety stars. \n\nThey are a homogeneous society. As such they have a standardized beauty standard.",
                    "author": null,
                    "id": "g9irq8m",
                    "parent_id": "t1_g9iqckt",
                    "score": -5,
                    "created_utc": 1603266243.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "So true. I really like how confident Nayeon has gotten since debut (I’m a once). I don’t think she would’ve done that 5 years ago. I also really like how she and Somin and even Jeongyeon were able to talk. I feel like Somin gets treated like she doesn’t have the feelings every woman has.",
            "author": "NellyJelly_",
            "id": "g9ljy16",
            "parent_id": "t1_g9ipi76",
            "score": 16,
            "created_utc": 1603325783.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "g9l2dv3",
            "parent_id": "t1_g9j1662",
            "score": 6,
            "created_utc": 1603316392.0,
            "replies": [
                {
                    "body": "Her name is Jasu! Hehehe. ❤️❤️❤️",
                    "author": "neriz01",
                    "id": "g9pc2ck",
                    "parent_id": "t1_g9l2dv3",
                    "score": 3,
                    "created_utc": 1603409435.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "people are actively reporting those now! im proud of the real fans!",
            "author": "Cat4Why7",
            "id": "g9lz7bs",
            "parent_id": "t1_g9iy8k8",
            "score": 8,
            "created_utc": 1603334645.0,
            "replies": []
        },
        {
            "body": "when SJH fans attack JSJ for not take picture with SJH, instead to ignore them. he was kind of apologies and post photo with SJH!  and I think he write comments about sjh wasn't there with them!\n\nonce I saw that I know that why they can't say anything to her because her toxic fans",
            "author": "3lmy3lmk",
            "id": "g9j09qz",
            "parent_id": "t1_g9iqnp6",
            "score": 26,
            "created_utc": 1603275846.0,
            "replies": [
                {
                    "body": "Sjh fans just asking 'where jihyo' 🙊 how is this so called toxic????",
                    "author": "Nogold84",
                    "id": "g9j2kuf",
                    "parent_id": "t1_g9j09qz",
                    "score": -24,
                    "created_utc": 1603278229.0,
                    "replies": [
                        {
                            "body": "Its toxic when fans keep insisting the producers/editors delibrately cut SJH out lmao. I would love to watch a 5 hour compilation of SJH saying a maximum of 10 sentences and only reacting/laughing to what others said",
                            "author": "jarball",
                            "id": "g9j6xfd",
                            "parent_id": "t1_g9j2kuf",
                            "score": 27,
                            "created_utc": 1603281966.0,
                            "replies": []
                        },
                        {
                            "body": ">They ask that even for shows that don't have SJH as a member or guest, they ask it for Happy Together, Michuri & Sixth Sense videos, like trying to terrorize JSM fans, since JSM was a guest or permanent member on those shows.",
                            "author": "jhdnhc",
                            "id": "g9k6dla",
                            "parent_id": "t1_g9j2kuf",
                            "score": 12,
                            "created_utc": 1603301101.0,
                            "replies": []
                        },
                        {
                            "body": "Coz the fans victimize her, thinking she's being left out.",
                            "author": "loldiiij",
                            "id": "g9j38lq",
                            "parent_id": "t1_g9j2kuf",
                            "score": 21,
                            "created_utc": 1603278857.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "i've always disliked the way the members only make jokes about the hate comments. i still remember one episode where hong jin young said that one of spartace fans sent her a death threat if she comes between jongkook and jihyo and the members just said \"they are violent just like their fave\" and that was it. that whole scene left a bad taste in my mouth. like i understand the need for them to keep things light and breezy on the show but they really should address it in an interview or sth instead of just playing it off as a joke. because when they say that, those antis will just keep using it as an excuse, thinking if the members are cool with it they have permission to continue. even after they terrorized somin into taking a break and even her family had to come forward and spoke about the hate comments, you can just tell those people don't feel any remorse for hurting her like that. it sucks and hard to talk about but the members and crew should really try to address the problem directly.",
            "author": "kdramayes",
            "id": "g9j63f8",
            "parent_id": "t1_g9iqnp6",
            "score": 21,
            "created_utc": 1603281310.0,
            "replies": [
                {
                    "body": "I understand members want to protect their 'fans' but KJK should have either bluntly told their fans to shut up or tone down.\n\nAll he did was saying like the fans mean no harm when that particular fan started private message HJY which is clearly wrong.\n\nI know celebrities can have their careers ended by 1 small mistakes but it clearly time for their government to step up their law regarding online harassment.",
                    "author": null,
                    "id": "g9kkptb",
                    "parent_id": "t1_g9j63f8",
                    "score": 6,
                    "created_utc": 1603307893.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I love Somin since from the very first episode of her as a guest. She is a public figure, I understand it is hurt in some way but she just need to be who she want herself to be. If I have a chance to say something to her personally, I want to tell her , just continue what she want to do but every celebrities and public figures have to find balance in their life and it is the most difficult thing to do, just find the balance and be happy. \n\nTo those Jiho fans, I love her too but she worked hard many years already and she don't want anything now, she accomplished everything already. You can see that in her expression, she love to see Somin and she really enjoy just being in RM. Just let her focus on acting, don't forget she is actress not variety star.",
            "author": "chanmo14",
            "id": "g9jybd0",
            "parent_id": "t1_g9iqnp6",
            "score": 8,
            "created_utc": 1603297234.0,
            "replies": []
        },
        {
            "body": "Probably because people from upper management told them not to.\n\nThe people writing hateful comments are disgusting but hey they do generate revenue for SBS, whether that's through more views on online platforms (Kowoca, Youtube clips etc) or when the RM members go to like Vietnam to hold a concert. It's a lot of money.\n\nAlso maybe less of a reason but it can also redirect the hate towards them",
            "author": "KawaiCuddle",
            "id": "g9ivg35",
            "parent_id": "t1_g9iqnp6",
            "score": 17,
            "created_utc": 1603270430.0,
            "replies": [
                {
                    "body": "You probably right but the hate she's getting is so undeserving that its probably bullying now, they kinda need to step up tbh",
                    "author": "jarball",
                    "id": "g9iylii",
                    "parent_id": "t1_g9ivg35",
                    "score": 31,
                    "created_utc": 1603274009.0,
                    "replies": [
                        {
                            "body": "Yeah sadly. and it's clear Somin is very much affected by this (remember she had to take a break from RM before?). I feel like the best person to do it would be jihyo herself since it's her fans. They would probably listen to her more than SBS's threats.",
                            "author": "KawaiCuddle",
                            "id": "g9j01sw",
                            "parent_id": "t1_g9iylii",
                            "score": 26,
                            "created_utc": 1603275612.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "But we are talking about big names who are worth companies... You think KJK or YJS can be told no to do something good??\n\nMy guess is that, they are experienced enough and don't want it to escalate to the point of it to be called scandal or incident. Shows in Korea cannot survive that. Or, my unpopular opinion, is that they know who do this, and they are not RM fans... so adressing someone else's fans is a bit...",
                    "author": "Itamitsuki",
                    "id": "g9j1rs3",
                    "parent_id": "t1_g9ivg35",
                    "score": 6,
                    "created_utc": 1603277412.0,
                    "replies": []
                },
                {
                    "body": "well the fanmeetings are over for a few years, and haters are a complete minority that can't affect the views platforms. At the end you're saying that money is more important than her and because of that the members, PDs and SBS are ok with that.",
                    "author": "NiallCraig",
                    "id": "g9iz2zy",
                    "parent_id": "t1_g9ivg35",
                    "score": 3,
                    "created_utc": 1603274552.0,
                    "replies": [
                        {
                            "body": "“Haters are a complete minority” \nI’m sorry,have u been under a rock??",
                            "author": "andreafatgirlslim",
                            "id": "g9jd5uo",
                            "parent_id": "t1_g9iz2zy",
                            "score": 14,
                            "created_utc": 1603286210.0,
                            "replies": [
                                {
                                    "body": "no, but the people who loves and supports somin surpasses by far the haters (thas why they're a minority).",
                                    "author": "NiallCraig",
                                    "id": "g9jievg",
                                    "parent_id": "t1_g9jd5uo",
                                    "score": 4,
                                    "created_utc": 1603289228.0,
                                    "replies": [
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "g9jjfhk",
                                            "parent_id": "t1_g9jievg",
                                            "score": -1,
                                            "created_utc": 1603289778.0,
                                            "replies": [
                                                {
                                                    "body": "so what do you want??? this people are far far far away from korea anyway, they will hate her forever, there's nothing you can't do about that. So its better to look at the good things, they're a complete minority.",
                                                    "author": "NiallCraig",
                                                    "id": "g9k8zbb",
                                                    "parent_id": "t1_g9jjfhk",
                                                    "score": 1,
                                                    "created_utc": 1603302332.0,
                                                    "replies": [
                                                        {
                                                            "body": "That it shouldn’t be ignored and it will only get worst if we continue to do so?",
                                                            "author": "andreafatgirlslim",
                                                            "id": "g9ko3ar",
                                                            "parent_id": "t1_g9k8zbb",
                                                            "score": 2,
                                                            "created_utc": 1603309508.0,
                                                            "replies": [
                                                                {
                                                                    "body": "no one can't do anything, especially bcs this people are not even in korea, so the korean law can't touch them. The best thing is disable somin and RM comment section from IG.",
                                                                    "author": "NiallCraig",
                                                                    "id": "g9krgu4",
                                                                    "parent_id": "t1_g9ko3ar",
                                                                    "score": 1,
                                                                    "created_utc": 1603311140.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "I'm not justifying the company's actions of not telling the haters to GTFO, just providing a likely explanation. We don't actually know the numbers but they seem to amount to several hundreds at least to a few thousands, which SBS could see as significant. They had a fanmeeting in Vietnam and Indonesia in 2019. Sure with Covid it might not happen until a vaccine is developped, but it is not impossible in the near future. Thousands of people buying a 50$ concert ticket? Yeah that's a lot of money.\n\nI too wish the members or the company would do something like take legal actions, but unfortunately I do think SBS values money more than their contractual employees. That's how most big business operate, sadly. The PDs have 0 say in this, unless they want to get fired by SBS.",
                            "author": "KawaiCuddle",
                            "id": "g9izmq6",
                            "parent_id": "t1_g9iz2zy",
                            "score": -1,
                            "created_utc": 1603275153.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I think because it's a variety show and generally meant to be kept entertaining and light. The only time they ever go serious is if they need to apologise for any member's scandal usually.",
            "author": "zaichii",
            "id": "g9j73no",
            "parent_id": "t1_g9iqnp6",
            "score": 3,
            "created_utc": 1603282101.0,
            "replies": []
        },
        {
            "body": "It's not in their own best interest to scold their own fan base, like it doesn't directly impact their own careers, the most they've done is make jokes about the online bullying/death threats.",
            "author": "jhdnhc",
            "id": "g9k7a7n",
            "parent_id": "t1_g9iqnp6",
            "score": 2,
            "created_utc": 1603301534.0,
            "replies": []
        },
        {
            "body": "I always got the impression from the show that Koreans do consider her as the \"cute\" type and not as beauty (\"kim tae hee\" type). Whereas SJH was a beauty type. I also never heard any mentions about her beauty on other shows (which doesn't mean much, I dont watch a lot). My point is: I don't think SJH's fans are worried about JSM's beauty. Those fans are simply very young, vocal on socials and a bit crazy.",
            "author": "0moe",
            "id": "g9ixt53",
            "parent_id": "t1_g9ig6wh",
            "score": 8,
            "created_utc": 1603273138.0,
            "replies": [
                {
                    "body": "Yup. She's considered the cute type. I am not korean therefore i am not sure what korean beauty standard is. But i do know them being homogeneous,they have a beauty standard. \n\nYes,you might be right. They're not worried about jsm beauty. Rather a bunch of young edgy fans. We used to be young too. Fortunately in our time the presence of social media isn't that huge. As such we are spared from commenting or showing our stupidity online lol. \n\nNevertheless,its never right to hate on someone to show your appreciation for another. Hope they grow up and realise, everything in RM is for entertainment.",
                    "author": null,
                    "id": "g9iywkt",
                    "parent_id": "t1_g9ixt53",
                    "score": 12,
                    "created_utc": 1603274354.0,
                    "replies": []
                },
                {
                    "body": "SJH is a beauty but so boring, she's nothing special, you got tired of her so easly. Somin is what SJH never will be, bcs she's not talented enough, that's why she got hate, bcs the jealousy and envy from SJH fans.",
                    "author": "NiallCraig",
                    "id": "g9izfzq",
                    "parent_id": "t1_g9ixt53",
                    "score": -7,
                    "created_utc": 1603274950.0,
                    "replies": [
                        {
                            "body": "We don’t need to put SJH down to support SoMin- they are so different and the idea of putting two woman against each other or that one needs to be pushed down to support the other is just so disappointing.  \nThey are apples and oranges- an introvert and an extrovert! \nThat said SJH’s fanatical and obsessive base is really dangerous. They are never going to be happy until RM is just half close ups of SJH laughing with her hand over her mouth.  You’d think her fans would realize and accept that SJH is a quiet maturing person and that quiet people don’t get the majority edit in a variety show and that playing up the love line as she continues to mature is probably pretty exhausting /insulting to SJH. It’s bizarre that they feel entitled to send so much hate on behalf of somebody they supposedly care about.",
                            "author": "ImpossibleWarning6",
                            "id": "g9j4p0z",
                            "parent_id": "t1_g9izfzq",
                            "score": 10,
                            "created_utc": 1603280158.0,
                            "replies": [
                                {
                                    "body": "im not putting anyone down, im explain you why people hate her. Many people thought that SJH was so special and somin proved them wrong (they're angry and can't accept the truth and they need to hate someone to feel better). So are you saying that SJH is so funny and entertaining???? the thing she likes the most is sleep. Seriously do you think that she's so interesting??? She seems soulless and apatethic about evertything. My main point is that SJH always was so overrated.",
                                    "author": "NiallCraig",
                                    "id": "g9j7cn5",
                                    "parent_id": "t1_g9j4p0z",
                                    "score": 9,
                                    "created_utc": 1603282286.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Nothing? Boring? Is just for u dude",
                            "author": "Nogold84",
                            "id": "g9j2mqm",
                            "parent_id": "t1_g9izfzq",
                            "score": 0,
                            "created_utc": 1603278280.0,
                            "replies": [
                                {
                                    "body": "sjh is so boring, the only thing you can tell about her all the time is how pretty/beautiful she is and that's all (she's only a pretty girl, that's why she got famous). RM is not a beauty contest you need something more, that's why she doesnt get any screentime. As guy, i will choose a girl like somin over SJH without thinking about it. I dont find anyting intersting about SJH sorry, but yes, its my opinion, that's why comments exist for telling the people's opinion.",
                                    "author": "NiallCraig",
                                    "id": "g9j7gf5",
                                    "parent_id": "t1_g9j2mqm",
                                    "score": 6,
                                    "created_utc": 1603282366.0,
                                    "replies": [
                                        {
                                            "body": "K.",
                                            "author": "farnnie123",
                                            "id": "g9k7osb",
                                            "parent_id": "t1_g9j7gf5",
                                            "score": 0,
                                            "created_utc": 1603301729.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Somin is what sjh never be ? 😀😀 the funniest joke ever",
                            "author": "Nogold84",
                            "id": "g9j2ogx",
                            "parent_id": "t1_g9izfzq",
                            "score": -2,
                            "created_utc": 1603278327.0,
                            "replies": [
                                {
                                    "body": "in the variety world YES.",
                                    "author": "NiallCraig",
                                    "id": "g9ji36e",
                                    "parent_id": "t1_g9j2ogx",
                                    "score": 12,
                                    "created_utc": 1603289046.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Twice - 506\n\nBlackPink - 525",
            "author": "Gaikoz",
            "id": "g9iwp6o",
            "parent_id": "t1_g9ivfnu",
            "score": 4,
            "created_utc": 1603271879.0,
            "replies": []
        },
        {
            "body": "What I heard is that she was a trainee to become a faceless singer (seems like something trendy at that time) but the guy scammed her and ran away to Japan.",
            "author": "rainsunicecream",
            "id": "g9mq21y",
            "parent_id": "t1_g9l2ael",
            "score": 5,
            "created_utc": 1603357490.0,
            "replies": []
        },
        {
            "body": "I don't remember her saying it but I've heard it quite a bit from comments and stuff. That would explain how she picked up the choreo for their group performance relatively quick",
            "author": "p1n6",
            "id": "g9lsize",
            "parent_id": "t1_g9l2ael",
            "score": 1,
            "created_utc": 1603330705.0,
            "replies": []
        },
        {
            "body": "You have a point but I meant it in a way like \"idol\" beauty. Like she not only has the actor beauty, but also can be cutesy, smily, dances well and has good proportion, which makes her have the kind of idol-ish beauty.\n\nLike Jihyo is also very pretty, but she does not blend well in girl groups, because they are beautiful in a different kind of way.",
            "author": "lzyan",
            "id": "g9j0ql2",
            "parent_id": "t1_g9iqckt",
            "score": 7,
            "created_utc": 1603276344.0,
            "replies": []
        },
        {
            "body": "Bae suzy and Yoona weren't idols?? They were known to be visual in their idol time, and now successful as actresses. Even if you have the visual and not the talent, you alwaya will be a C rank actress. Specially nowdays, in Korea the best actresses are not known by their beauty.",
            "author": "Itamitsuki",
            "id": "g9j1dci",
            "parent_id": "t1_g9iqckt",
            "score": 3,
            "created_utc": 1603277003.0,
            "replies": []
        },
        {
            "body": ">but in Korea standard, actress are supposed to be more beautiful than idols\n\nfor real? wow. never know that.\n\nbut correct me if im wrong, somin wasn't that famous as an actress as well right? before she joined RM i mean. because i remembered she did mentioned she only stay at home do nothing and she's trying so hard looking for sponsor/adv agency to cast when she was a guest in one of the episode?\n\n(by no mean i'm downgrading here. just stating the fact)",
            "author": "najmiii",
            "id": "g9iqztj",
            "parent_id": "t1_g9iqckt",
            "score": 5,
            "created_utc": 1603265450.0,
            "replies": [
                {
                    "body": "Yes,\nShe actually did well in princess aurora earning her the new best actress award in 2013. But there is no follow up after that. \n\nThe thing is,korean acting industry is tough. Once you miss the train,its hard to get back up. She's already 33. Its hard for her to suddenly become popular through acting again. \n\nSon dam bi Once said that the moment you step in the variety world as a permanent cast especially when you're an actress,its hard to get casted for acting again.",
                    "author": null,
                    "id": "g9is66p",
                    "parent_id": "t1_g9iqztj",
                    "score": 7,
                    "created_utc": 1603266727.0,
                    "replies": []
                },
                {
                    "body": "Yeh she wasn't that famous, similar to Kang Hanna during the period where she appears for many episode within consecutive weeks.\n\nActually now I find it funny because as a singer/idol, even if you are not very famous you can still get gags to sing at different social events, at clubs or festivals or places like that, but if you are an actor/actress and your not famous, you pretty much has nothing to do when you are not casted lol.",
                    "author": "KTDLegend",
                    "id": "g9irc38",
                    "parent_id": "t1_g9iqztj",
                    "score": -6,
                    "created_utc": 1603265817.0,
                    "replies": [
                        {
                            "body": "yeahh true that.",
                            "author": "najmiii",
                            "id": "g9irj05",
                            "parent_id": "t1_g9irc38",
                            "score": 1,
                            "created_utc": 1603266022.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yes true. \nThe thing is we look at them from a foreign eyes. What we deemed beautiful isn't necessarily beautiful in korean eyes. Korean eyes is what matters at the end of the day. That is their market. \n\nTo put it politely,To them jsm is beautiful. Yet not beautiful enough to be a top top actress. She is indeed considered as one of the most beautiful variety stars. \n\nThey are a homogeneous society. As such they have a standardized beauty standard.",
            "author": null,
            "id": "g9irq8m",
            "parent_id": "t1_g9iqckt",
            "score": -5,
            "created_utc": 1603266243.0,
            "replies": []
        },
        {
            "body": "Her name is Jasu! Hehehe. ❤️❤️❤️",
            "author": "neriz01",
            "id": "g9pc2ck",
            "parent_id": "t1_g9l2dv3",
            "score": 3,
            "created_utc": 1603409435.0,
            "replies": []
        },
        {
            "body": "Sjh fans just asking 'where jihyo' 🙊 how is this so called toxic????",
            "author": "Nogold84",
            "id": "g9j2kuf",
            "parent_id": "t1_g9j09qz",
            "score": -24,
            "created_utc": 1603278229.0,
            "replies": [
                {
                    "body": "Its toxic when fans keep insisting the producers/editors delibrately cut SJH out lmao. I would love to watch a 5 hour compilation of SJH saying a maximum of 10 sentences and only reacting/laughing to what others said",
                    "author": "jarball",
                    "id": "g9j6xfd",
                    "parent_id": "t1_g9j2kuf",
                    "score": 27,
                    "created_utc": 1603281966.0,
                    "replies": []
                },
                {
                    "body": ">They ask that even for shows that don't have SJH as a member or guest, they ask it for Happy Together, Michuri & Sixth Sense videos, like trying to terrorize JSM fans, since JSM was a guest or permanent member on those shows.",
                    "author": "jhdnhc",
                    "id": "g9k6dla",
                    "parent_id": "t1_g9j2kuf",
                    "score": 12,
                    "created_utc": 1603301101.0,
                    "replies": []
                },
                {
                    "body": "Coz the fans victimize her, thinking she's being left out.",
                    "author": "loldiiij",
                    "id": "g9j38lq",
                    "parent_id": "t1_g9j2kuf",
                    "score": 21,
                    "created_utc": 1603278857.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I understand members want to protect their 'fans' but KJK should have either bluntly told their fans to shut up or tone down.\n\nAll he did was saying like the fans mean no harm when that particular fan started private message HJY which is clearly wrong.\n\nI know celebrities can have their careers ended by 1 small mistakes but it clearly time for their government to step up their law regarding online harassment.",
            "author": null,
            "id": "g9kkptb",
            "parent_id": "t1_g9j63f8",
            "score": 6,
            "created_utc": 1603307893.0,
            "replies": []
        },
        {
            "body": "You probably right but the hate she's getting is so undeserving that its probably bullying now, they kinda need to step up tbh",
            "author": "jarball",
            "id": "g9iylii",
            "parent_id": "t1_g9ivg35",
            "score": 31,
            "created_utc": 1603274009.0,
            "replies": [
                {
                    "body": "Yeah sadly. and it's clear Somin is very much affected by this (remember she had to take a break from RM before?). I feel like the best person to do it would be jihyo herself since it's her fans. They would probably listen to her more than SBS's threats.",
                    "author": "KawaiCuddle",
                    "id": "g9j01sw",
                    "parent_id": "t1_g9iylii",
                    "score": 26,
                    "created_utc": 1603275612.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "But we are talking about big names who are worth companies... You think KJK or YJS can be told no to do something good??\n\nMy guess is that, they are experienced enough and don't want it to escalate to the point of it to be called scandal or incident. Shows in Korea cannot survive that. Or, my unpopular opinion, is that they know who do this, and they are not RM fans... so adressing someone else's fans is a bit...",
            "author": "Itamitsuki",
            "id": "g9j1rs3",
            "parent_id": "t1_g9ivg35",
            "score": 6,
            "created_utc": 1603277412.0,
            "replies": []
        },
        {
            "body": "well the fanmeetings are over for a few years, and haters are a complete minority that can't affect the views platforms. At the end you're saying that money is more important than her and because of that the members, PDs and SBS are ok with that.",
            "author": "NiallCraig",
            "id": "g9iz2zy",
            "parent_id": "t1_g9ivg35",
            "score": 3,
            "created_utc": 1603274552.0,
            "replies": [
                {
                    "body": "“Haters are a complete minority” \nI’m sorry,have u been under a rock??",
                    "author": "andreafatgirlslim",
                    "id": "g9jd5uo",
                    "parent_id": "t1_g9iz2zy",
                    "score": 14,
                    "created_utc": 1603286210.0,
                    "replies": [
                        {
                            "body": "no, but the people who loves and supports somin surpasses by far the haters (thas why they're a minority).",
                            "author": "NiallCraig",
                            "id": "g9jievg",
                            "parent_id": "t1_g9jd5uo",
                            "score": 4,
                            "created_utc": 1603289228.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "g9jjfhk",
                                    "parent_id": "t1_g9jievg",
                                    "score": -1,
                                    "created_utc": 1603289778.0,
                                    "replies": [
                                        {
                                            "body": "so what do you want??? this people are far far far away from korea anyway, they will hate her forever, there's nothing you can't do about that. So its better to look at the good things, they're a complete minority.",
                                            "author": "NiallCraig",
                                            "id": "g9k8zbb",
                                            "parent_id": "t1_g9jjfhk",
                                            "score": 1,
                                            "created_utc": 1603302332.0,
                                            "replies": [
                                                {
                                                    "body": "That it shouldn’t be ignored and it will only get worst if we continue to do so?",
                                                    "author": "andreafatgirlslim",
                                                    "id": "g9ko3ar",
                                                    "parent_id": "t1_g9k8zbb",
                                                    "score": 2,
                                                    "created_utc": 1603309508.0,
                                                    "replies": [
                                                        {
                                                            "body": "no one can't do anything, especially bcs this people are not even in korea, so the korean law can't touch them. The best thing is disable somin and RM comment section from IG.",
                                                            "author": "NiallCraig",
                                                            "id": "g9krgu4",
                                                            "parent_id": "t1_g9ko3ar",
                                                            "score": 1,
                                                            "created_utc": 1603311140.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "I'm not justifying the company's actions of not telling the haters to GTFO, just providing a likely explanation. We don't actually know the numbers but they seem to amount to several hundreds at least to a few thousands, which SBS could see as significant. They had a fanmeeting in Vietnam and Indonesia in 2019. Sure with Covid it might not happen until a vaccine is developped, but it is not impossible in the near future. Thousands of people buying a 50$ concert ticket? Yeah that's a lot of money.\n\nI too wish the members or the company would do something like take legal actions, but unfortunately I do think SBS values money more than their contractual employees. That's how most big business operate, sadly. The PDs have 0 say in this, unless they want to get fired by SBS.",
                    "author": "KawaiCuddle",
                    "id": "g9izmq6",
                    "parent_id": "t1_g9iz2zy",
                    "score": -1,
                    "created_utc": 1603275153.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yup. She's considered the cute type. I am not korean therefore i am not sure what korean beauty standard is. But i do know them being homogeneous,they have a beauty standard. \n\nYes,you might be right. They're not worried about jsm beauty. Rather a bunch of young edgy fans. We used to be young too. Fortunately in our time the presence of social media isn't that huge. As such we are spared from commenting or showing our stupidity online lol. \n\nNevertheless,its never right to hate on someone to show your appreciation for another. Hope they grow up and realise, everything in RM is for entertainment.",
            "author": null,
            "id": "g9iywkt",
            "parent_id": "t1_g9ixt53",
            "score": 12,
            "created_utc": 1603274354.0,
            "replies": []
        },
        {
            "body": "SJH is a beauty but so boring, she's nothing special, you got tired of her so easly. Somin is what SJH never will be, bcs she's not talented enough, that's why she got hate, bcs the jealousy and envy from SJH fans.",
            "author": "NiallCraig",
            "id": "g9izfzq",
            "parent_id": "t1_g9ixt53",
            "score": -7,
            "created_utc": 1603274950.0,
            "replies": [
                {
                    "body": "We don’t need to put SJH down to support SoMin- they are so different and the idea of putting two woman against each other or that one needs to be pushed down to support the other is just so disappointing.  \nThey are apples and oranges- an introvert and an extrovert! \nThat said SJH’s fanatical and obsessive base is really dangerous. They are never going to be happy until RM is just half close ups of SJH laughing with her hand over her mouth.  You’d think her fans would realize and accept that SJH is a quiet maturing person and that quiet people don’t get the majority edit in a variety show and that playing up the love line as she continues to mature is probably pretty exhausting /insulting to SJH. It’s bizarre that they feel entitled to send so much hate on behalf of somebody they supposedly care about.",
                    "author": "ImpossibleWarning6",
                    "id": "g9j4p0z",
                    "parent_id": "t1_g9izfzq",
                    "score": 10,
                    "created_utc": 1603280158.0,
                    "replies": [
                        {
                            "body": "im not putting anyone down, im explain you why people hate her. Many people thought that SJH was so special and somin proved them wrong (they're angry and can't accept the truth and they need to hate someone to feel better). So are you saying that SJH is so funny and entertaining???? the thing she likes the most is sleep. Seriously do you think that she's so interesting??? She seems soulless and apatethic about evertything. My main point is that SJH always was so overrated.",
                            "author": "NiallCraig",
                            "id": "g9j7cn5",
                            "parent_id": "t1_g9j4p0z",
                            "score": 9,
                            "created_utc": 1603282286.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Nothing? Boring? Is just for u dude",
                    "author": "Nogold84",
                    "id": "g9j2mqm",
                    "parent_id": "t1_g9izfzq",
                    "score": 0,
                    "created_utc": 1603278280.0,
                    "replies": [
                        {
                            "body": "sjh is so boring, the only thing you can tell about her all the time is how pretty/beautiful she is and that's all (she's only a pretty girl, that's why she got famous). RM is not a beauty contest you need something more, that's why she doesnt get any screentime. As guy, i will choose a girl like somin over SJH without thinking about it. I dont find anyting intersting about SJH sorry, but yes, its my opinion, that's why comments exist for telling the people's opinion.",
                            "author": "NiallCraig",
                            "id": "g9j7gf5",
                            "parent_id": "t1_g9j2mqm",
                            "score": 6,
                            "created_utc": 1603282366.0,
                            "replies": [
                                {
                                    "body": "K.",
                                    "author": "farnnie123",
                                    "id": "g9k7osb",
                                    "parent_id": "t1_g9j7gf5",
                                    "score": 0,
                                    "created_utc": 1603301729.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Somin is what sjh never be ? 😀😀 the funniest joke ever",
                    "author": "Nogold84",
                    "id": "g9j2ogx",
                    "parent_id": "t1_g9izfzq",
                    "score": -2,
                    "created_utc": 1603278327.0,
                    "replies": [
                        {
                            "body": "in the variety world YES.",
                            "author": "NiallCraig",
                            "id": "g9ji36e",
                            "parent_id": "t1_g9j2ogx",
                            "score": 12,
                            "created_utc": 1603289046.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yes,\nShe actually did well in princess aurora earning her the new best actress award in 2013. But there is no follow up after that. \n\nThe thing is,korean acting industry is tough. Once you miss the train,its hard to get back up. She's already 33. Its hard for her to suddenly become popular through acting again. \n\nSon dam bi Once said that the moment you step in the variety world as a permanent cast especially when you're an actress,its hard to get casted for acting again.",
            "author": null,
            "id": "g9is66p",
            "parent_id": "t1_g9iqztj",
            "score": 7,
            "created_utc": 1603266727.0,
            "replies": []
        },
        {
            "body": "Yeh she wasn't that famous, similar to Kang Hanna during the period where she appears for many episode within consecutive weeks.\n\nActually now I find it funny because as a singer/idol, even if you are not very famous you can still get gags to sing at different social events, at clubs or festivals or places like that, but if you are an actor/actress and your not famous, you pretty much has nothing to do when you are not casted lol.",
            "author": "KTDLegend",
            "id": "g9irc38",
            "parent_id": "t1_g9iqztj",
            "score": -6,
            "created_utc": 1603265817.0,
            "replies": [
                {
                    "body": "yeahh true that.",
                    "author": "najmiii",
                    "id": "g9irj05",
                    "parent_id": "t1_g9irc38",
                    "score": 1,
                    "created_utc": 1603266022.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Its toxic when fans keep insisting the producers/editors delibrately cut SJH out lmao. I would love to watch a 5 hour compilation of SJH saying a maximum of 10 sentences and only reacting/laughing to what others said",
            "author": "jarball",
            "id": "g9j6xfd",
            "parent_id": "t1_g9j2kuf",
            "score": 27,
            "created_utc": 1603281966.0,
            "replies": []
        },
        {
            "body": ">They ask that even for shows that don't have SJH as a member or guest, they ask it for Happy Together, Michuri & Sixth Sense videos, like trying to terrorize JSM fans, since JSM was a guest or permanent member on those shows.",
            "author": "jhdnhc",
            "id": "g9k6dla",
            "parent_id": "t1_g9j2kuf",
            "score": 12,
            "created_utc": 1603301101.0,
            "replies": []
        },
        {
            "body": "Coz the fans victimize her, thinking she's being left out.",
            "author": "loldiiij",
            "id": "g9j38lq",
            "parent_id": "t1_g9j2kuf",
            "score": 21,
            "created_utc": 1603278857.0,
            "replies": []
        },
        {
            "body": "Yeah sadly. and it's clear Somin is very much affected by this (remember she had to take a break from RM before?). I feel like the best person to do it would be jihyo herself since it's her fans. They would probably listen to her more than SBS's threats.",
            "author": "KawaiCuddle",
            "id": "g9j01sw",
            "parent_id": "t1_g9iylii",
            "score": 26,
            "created_utc": 1603275612.0,
            "replies": []
        },
        {
            "body": "“Haters are a complete minority” \nI’m sorry,have u been under a rock??",
            "author": "andreafatgirlslim",
            "id": "g9jd5uo",
            "parent_id": "t1_g9iz2zy",
            "score": 14,
            "created_utc": 1603286210.0,
            "replies": [
                {
                    "body": "no, but the people who loves and supports somin surpasses by far the haters (thas why they're a minority).",
                    "author": "NiallCraig",
                    "id": "g9jievg",
                    "parent_id": "t1_g9jd5uo",
                    "score": 4,
                    "created_utc": 1603289228.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "g9jjfhk",
                            "parent_id": "t1_g9jievg",
                            "score": -1,
                            "created_utc": 1603289778.0,
                            "replies": [
                                {
                                    "body": "so what do you want??? this people are far far far away from korea anyway, they will hate her forever, there's nothing you can't do about that. So its better to look at the good things, they're a complete minority.",
                                    "author": "NiallCraig",
                                    "id": "g9k8zbb",
                                    "parent_id": "t1_g9jjfhk",
                                    "score": 1,
                                    "created_utc": 1603302332.0,
                                    "replies": [
                                        {
                                            "body": "That it shouldn’t be ignored and it will only get worst if we continue to do so?",
                                            "author": "andreafatgirlslim",
                                            "id": "g9ko3ar",
                                            "parent_id": "t1_g9k8zbb",
                                            "score": 2,
                                            "created_utc": 1603309508.0,
                                            "replies": [
                                                {
                                                    "body": "no one can't do anything, especially bcs this people are not even in korea, so the korean law can't touch them. The best thing is disable somin and RM comment section from IG.",
                                                    "author": "NiallCraig",
                                                    "id": "g9krgu4",
                                                    "parent_id": "t1_g9ko3ar",
                                                    "score": 1,
                                                    "created_utc": 1603311140.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I'm not justifying the company's actions of not telling the haters to GTFO, just providing a likely explanation. We don't actually know the numbers but they seem to amount to several hundreds at least to a few thousands, which SBS could see as significant. They had a fanmeeting in Vietnam and Indonesia in 2019. Sure with Covid it might not happen until a vaccine is developped, but it is not impossible in the near future. Thousands of people buying a 50$ concert ticket? Yeah that's a lot of money.\n\nI too wish the members or the company would do something like take legal actions, but unfortunately I do think SBS values money more than their contractual employees. That's how most big business operate, sadly. The PDs have 0 say in this, unless they want to get fired by SBS.",
            "author": "KawaiCuddle",
            "id": "g9izmq6",
            "parent_id": "t1_g9iz2zy",
            "score": -1,
            "created_utc": 1603275153.0,
            "replies": []
        },
        {
            "body": "We don’t need to put SJH down to support SoMin- they are so different and the idea of putting two woman against each other or that one needs to be pushed down to support the other is just so disappointing.  \nThey are apples and oranges- an introvert and an extrovert! \nThat said SJH’s fanatical and obsessive base is really dangerous. They are never going to be happy until RM is just half close ups of SJH laughing with her hand over her mouth.  You’d think her fans would realize and accept that SJH is a quiet maturing person and that quiet people don’t get the majority edit in a variety show and that playing up the love line as she continues to mature is probably pretty exhausting /insulting to SJH. It’s bizarre that they feel entitled to send so much hate on behalf of somebody they supposedly care about.",
            "author": "ImpossibleWarning6",
            "id": "g9j4p0z",
            "parent_id": "t1_g9izfzq",
            "score": 10,
            "created_utc": 1603280158.0,
            "replies": [
                {
                    "body": "im not putting anyone down, im explain you why people hate her. Many people thought that SJH was so special and somin proved them wrong (they're angry and can't accept the truth and they need to hate someone to feel better). So are you saying that SJH is so funny and entertaining???? the thing she likes the most is sleep. Seriously do you think that she's so interesting??? She seems soulless and apatethic about evertything. My main point is that SJH always was so overrated.",
                    "author": "NiallCraig",
                    "id": "g9j7cn5",
                    "parent_id": "t1_g9j4p0z",
                    "score": 9,
                    "created_utc": 1603282286.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Nothing? Boring? Is just for u dude",
            "author": "Nogold84",
            "id": "g9j2mqm",
            "parent_id": "t1_g9izfzq",
            "score": 0,
            "created_utc": 1603278280.0,
            "replies": [
                {
                    "body": "sjh is so boring, the only thing you can tell about her all the time is how pretty/beautiful she is and that's all (she's only a pretty girl, that's why she got famous). RM is not a beauty contest you need something more, that's why she doesnt get any screentime. As guy, i will choose a girl like somin over SJH without thinking about it. I dont find anyting intersting about SJH sorry, but yes, its my opinion, that's why comments exist for telling the people's opinion.",
                    "author": "NiallCraig",
                    "id": "g9j7gf5",
                    "parent_id": "t1_g9j2mqm",
                    "score": 6,
                    "created_utc": 1603282366.0,
                    "replies": [
                        {
                            "body": "K.",
                            "author": "farnnie123",
                            "id": "g9k7osb",
                            "parent_id": "t1_g9j7gf5",
                            "score": 0,
                            "created_utc": 1603301729.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Somin is what sjh never be ? 😀😀 the funniest joke ever",
            "author": "Nogold84",
            "id": "g9j2ogx",
            "parent_id": "t1_g9izfzq",
            "score": -2,
            "created_utc": 1603278327.0,
            "replies": [
                {
                    "body": "in the variety world YES.",
                    "author": "NiallCraig",
                    "id": "g9ji36e",
                    "parent_id": "t1_g9j2ogx",
                    "score": 12,
                    "created_utc": 1603289046.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "yeahh true that.",
            "author": "najmiii",
            "id": "g9irj05",
            "parent_id": "t1_g9irc38",
            "score": 1,
            "created_utc": 1603266022.0,
            "replies": []
        },
        {
            "body": "no, but the people who loves and supports somin surpasses by far the haters (thas why they're a minority).",
            "author": "NiallCraig",
            "id": "g9jievg",
            "parent_id": "t1_g9jd5uo",
            "score": 4,
            "created_utc": 1603289228.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "g9jjfhk",
                    "parent_id": "t1_g9jievg",
                    "score": -1,
                    "created_utc": 1603289778.0,
                    "replies": [
                        {
                            "body": "so what do you want??? this people are far far far away from korea anyway, they will hate her forever, there's nothing you can't do about that. So its better to look at the good things, they're a complete minority.",
                            "author": "NiallCraig",
                            "id": "g9k8zbb",
                            "parent_id": "t1_g9jjfhk",
                            "score": 1,
                            "created_utc": 1603302332.0,
                            "replies": [
                                {
                                    "body": "That it shouldn’t be ignored and it will only get worst if we continue to do so?",
                                    "author": "andreafatgirlslim",
                                    "id": "g9ko3ar",
                                    "parent_id": "t1_g9k8zbb",
                                    "score": 2,
                                    "created_utc": 1603309508.0,
                                    "replies": [
                                        {
                                            "body": "no one can't do anything, especially bcs this people are not even in korea, so the korean law can't touch them. The best thing is disable somin and RM comment section from IG.",
                                            "author": "NiallCraig",
                                            "id": "g9krgu4",
                                            "parent_id": "t1_g9ko3ar",
                                            "score": 1,
                                            "created_utc": 1603311140.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "im not putting anyone down, im explain you why people hate her. Many people thought that SJH was so special and somin proved them wrong (they're angry and can't accept the truth and they need to hate someone to feel better). So are you saying that SJH is so funny and entertaining???? the thing she likes the most is sleep. Seriously do you think that she's so interesting??? She seems soulless and apatethic about evertything. My main point is that SJH always was so overrated.",
            "author": "NiallCraig",
            "id": "g9j7cn5",
            "parent_id": "t1_g9j4p0z",
            "score": 9,
            "created_utc": 1603282286.0,
            "replies": []
        },
        {
            "body": "sjh is so boring, the only thing you can tell about her all the time is how pretty/beautiful she is and that's all (she's only a pretty girl, that's why she got famous). RM is not a beauty contest you need something more, that's why she doesnt get any screentime. As guy, i will choose a girl like somin over SJH without thinking about it. I dont find anyting intersting about SJH sorry, but yes, its my opinion, that's why comments exist for telling the people's opinion.",
            "author": "NiallCraig",
            "id": "g9j7gf5",
            "parent_id": "t1_g9j2mqm",
            "score": 6,
            "created_utc": 1603282366.0,
            "replies": [
                {
                    "body": "K.",
                    "author": "farnnie123",
                    "id": "g9k7osb",
                    "parent_id": "t1_g9j7gf5",
                    "score": 0,
                    "created_utc": 1603301729.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "in the variety world YES.",
            "author": "NiallCraig",
            "id": "g9ji36e",
            "parent_id": "t1_g9j2ogx",
            "score": 12,
            "created_utc": 1603289046.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "g9jjfhk",
            "parent_id": "t1_g9jievg",
            "score": -1,
            "created_utc": 1603289778.0,
            "replies": [
                {
                    "body": "so what do you want??? this people are far far far away from korea anyway, they will hate her forever, there's nothing you can't do about that. So its better to look at the good things, they're a complete minority.",
                    "author": "NiallCraig",
                    "id": "g9k8zbb",
                    "parent_id": "t1_g9jjfhk",
                    "score": 1,
                    "created_utc": 1603302332.0,
                    "replies": [
                        {
                            "body": "That it shouldn’t be ignored and it will only get worst if we continue to do so?",
                            "author": "andreafatgirlslim",
                            "id": "g9ko3ar",
                            "parent_id": "t1_g9k8zbb",
                            "score": 2,
                            "created_utc": 1603309508.0,
                            "replies": [
                                {
                                    "body": "no one can't do anything, especially bcs this people are not even in korea, so the korean law can't touch them. The best thing is disable somin and RM comment section from IG.",
                                    "author": "NiallCraig",
                                    "id": "g9krgu4",
                                    "parent_id": "t1_g9ko3ar",
                                    "score": 1,
                                    "created_utc": 1603311140.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "K.",
            "author": "farnnie123",
            "id": "g9k7osb",
            "parent_id": "t1_g9j7gf5",
            "score": 0,
            "created_utc": 1603301729.0,
            "replies": []
        },
        {
            "body": "so what do you want??? this people are far far far away from korea anyway, they will hate her forever, there's nothing you can't do about that. So its better to look at the good things, they're a complete minority.",
            "author": "NiallCraig",
            "id": "g9k8zbb",
            "parent_id": "t1_g9jjfhk",
            "score": 1,
            "created_utc": 1603302332.0,
            "replies": [
                {
                    "body": "That it shouldn’t be ignored and it will only get worst if we continue to do so?",
                    "author": "andreafatgirlslim",
                    "id": "g9ko3ar",
                    "parent_id": "t1_g9k8zbb",
                    "score": 2,
                    "created_utc": 1603309508.0,
                    "replies": [
                        {
                            "body": "no one can't do anything, especially bcs this people are not even in korea, so the korean law can't touch them. The best thing is disable somin and RM comment section from IG.",
                            "author": "NiallCraig",
                            "id": "g9krgu4",
                            "parent_id": "t1_g9ko3ar",
                            "score": 1,
                            "created_utc": 1603311140.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "That it shouldn’t be ignored and it will only get worst if we continue to do so?",
            "author": "andreafatgirlslim",
            "id": "g9ko3ar",
            "parent_id": "t1_g9k8zbb",
            "score": 2,
            "created_utc": 1603309508.0,
            "replies": [
                {
                    "body": "no one can't do anything, especially bcs this people are not even in korea, so the korean law can't touch them. The best thing is disable somin and RM comment section from IG.",
                    "author": "NiallCraig",
                    "id": "g9krgu4",
                    "parent_id": "t1_g9ko3ar",
                    "score": 1,
                    "created_utc": 1603311140.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "no one can't do anything, especially bcs this people are not even in korea, so the korean law can't touch them. The best thing is disable somin and RM comment section from IG.",
            "author": "NiallCraig",
            "id": "g9krgu4",
            "parent_id": "t1_g9ko3ar",
            "score": 1,
            "created_utc": 1603311140.0,
            "replies": []
        }
    ]
}