{
    "title": "What Does Your Arrangement Look Like?",
    "post_id": "ebuz3d",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/ebuz3d/what_does_your_arrangement_look_like/",
    "author": null,
    "body": "Quite often I see mentioned that happy people don’t post about their arrangements. Because of this many newbies and others on this forum have no compass for what a relationship of this nature looks like. I thought I’d share something my guy did for me in the hopes that it can be a baseline for others. \n\nMy SD and I have been together for four months. In that time we have had good and bad days. He’s not the best at communicating and I tend to purposely overlook this which leads to me becoming overly emotional while my feelings fester. We are working on these small nits we have. \n\nOne thing we do well, though, is support each other. So when I was told I needed to have a medical procedure my guy immediately offered to take the day off for me. This was the type of medical procedure even a husband would balk at attending. \n\nThe day of the event he feeds me a big breakfast and then accompanies me over to the office. He waited with me in the waiting room and even offered to go back with me. The procedure took longer than usual, was more difficult (and painful) than we’d expected, but was thankfully successful. Just having him in the waiting room was soothing to me.\n\nAfter the procedure he holds me up while we walk to the hotel he booked next door. He grabs Tylenol and water for me and then tucks me into bed. I fall asleep and wake up hours later to him texting with friends on his phone. He hadn’t moved the entire time. \n\nHe encourages me to get food, even though I’m not that hungry. We talk about going out after dinner but halfway through dinner I’m in pain again. He escorts me back to the room, plys me with more Tylenol and water  and runs his fingers through my hair until I fall asleep again. I wake up later and he’s still laying next to me, happily looking at his phone. He ensures I’m okay to head home and we part ways. \n\nI could’ve easily done this procedure myself. I could’ve gone alone and made it home to bed and recuperated alone. Instead my guy blew an entire day off to watch me sleep. He didn’t once complain. He happily amused himself while I was snoozing and doted on me when I was awake. He was tender and loving. He gave me something I didn’t know I needed: Comfort. I felt restored after our day together. It was as if laying next to him helped heal me. \n\nSometimes I honestly don’t know what he derives from this relationship. He indulges my every whim and takes care of me when I’m down. We cuddle, and talk and laugh together. I make jokes about the fact that he’s dating a white girl. He tries (and fails) to get me to eat something other than Hamburgers and Steak. Sometimes I ogle the way his boxers hug his groin. Mostly he buys me books and does whatever I want. Except for that one time he refused to see the Trans-Siberian Orchestra with me. That he refused. \n\nThis is what our relationship looks like. Us supporting each other. But mostly him supporting me... and watching me sleep. \n\n(Still iso a Trans-Siberian Orchestra partner.)",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/ebuz3d/what_does_your_arrangement_look_like/",
    "score": 99,
    "upvote_ratio": 0.94,
    "created_utc": 1576584173.0,
    "num_comments": 27,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "What a great post and thought-provoking question you pose.  Makes me want to tell my story here.  \n\nThis needs to start with a bit of background on my situation.   I have spent my entire working life starting and building companies.   There is a downside to this for some of us.  It can be all-consuming.   You spend a serious amount of time on planes and continually dealing with complex business challenges.  Friendships and relationships suffer.   People you are close to can pull away, especially if you experience success and enter a different level financially.   For example, I had a really good friend tell me that people like to associate with others who are similar to them from a financial and career perspective.   He is the only one who came out and said it.  But I know others felt the same way.  \n\nI entered the bowl because of a long term and irreversible decline in my wife’s health.  She is at the point now, where travel is such a challenge, that she cannot really do it any more.  \n\nOne of my post-career goals has always been to relax and see the places around the world that have always eluded me.  It was going to be one of my rewards for all the long hours and crazy work intensity.  I made a major change in my business life this year, when I chose to step out of an operating role.  I was ready for that reward.  I have known the day was coming for a couple of years now.  But a burning question emerged when I looked at the facts.  Was I going to experience these things on my own?  My wife was no longer capable, and longer term friends had drifted away.  \n\nIn parallel to all of the above, I entered the bowl.  With reasonable success.  Not really knowing what to expect.  Spent some time with a a small number of women.  Got quite close to one in particular, but had to stop seeing her due to never ending drama.  Which was too bad, because she was great in other ways.\n\nThen a little over 8 months ago, I took a flyer and messaged someone with an outrageous profile.  She seemed wrong on so many levels.  She was just 21 at the time.  Creating what I thought was an insurmountable age gap.  She had some arrangement experience, but with guys who had vanilla potential. I ended up being her first arrangement where there was no possibility of it ever being vanilla.  So our first month or so was kind of awkward and difficult.  But we saw enough in each other to keep going.  \n\nThings blossomed a couple of months in.  We took a trip together and it was awesome.  We got closer and closer.  I have posted a few times about our travel fun.\n\nThen my world totally changed this fall.  I finally made the decision to exit from my day-to-day role at my company.  Within days of that, SB told me she was moving away to go to school.  I immediately jumped to the conclusion that this would end the SR.  She was very upset about this, and we decided to keep going in spite of the distance.  After her move, there was a period of freedom for her before school in January.  We have done three trips now in under two months.  \n\nSomehow the distance has gotten us closer.  On our trip last week, she confided in me on how hard the move has been.  I was only the second person she ever told this to.  She has come to trust me with her feelings and fears.  She was crying in my arms, while at the same time feeling bad about being emotional on a great vacation.  I assured her that everything was OK.  I make this point to illustrate how far beyond transactional we have become.  \n\nIf you have read this far, you are likely wondering how all of this ties together.  Her school start date has been pushed for 9 months, and she has a job where she can come and go as she pleases.  And I am free to go anywhere and do whatever I want.  My wife is pushing me to get out there and enjoy myself.  She is happy to see me free of the unrelenting pressure and stress of running a demanding tech company.  \n\nThis thread posed the question about what your arrangement looks like.  For me, the standard stuff is there.  Combined with a level of affection I never expected.  \n\nBut somehow, this SB has come into my life at the same time that I made the biggest life change since getting married.  As already mentioned, I had a burning question about whether I would need to experience my new-found freedom on my own.  Then along comes a person, who I enjoy immensely who happens to also be free to experience the world.  Who has made it clear that she want to have those experiences with me.\n\nSo my arrangement has morphed from what most people expect in a great SR, to an SR plus travel partner.  We are in the middle of planning our next adventure for January.  We think we know the destination, and she had been begging me over text to go there.  \n\nSomeday soon, I expect she finds a boyfriend, and this will all be over.  But in the meantime, I will jump in with both feet and enjoy it.  Somehow I got very lucky for a number of factors to combine together to help me through a major life change.  With an attractive and compelling 22 year old.  Who would have thought it?",
            "author": "MrBuzzard",
            "id": "fb7kz4r",
            "parent_id": "t3_ebuz3d",
            "score": 24,
            "created_utc": 1576593031.0,
            "replies": []
        },
        {
            "body": "Shoot. That is so wholesome. My SR can seriously relate to what you two have. We’ve only been in an arrangement for 3 months, and of course we have our bad days.... Of course there’s something we—especially I—have to work on. Yet, we are so good at being there for each other. Thick and thin, we’re always there.\n\nA while ago, I’ve dealt with a heartbreaking situation with a man I’ve met during the summer. He was manipulating me. This was my first ever experience with manipulation. I didn’t know what I was doing wrong. He was making me question my sanity. Thankfully, I was (and still am) in a SR with an amazing man during that time. This man let me come over, late at night, so I could cry on his shoulder. This man let me use his t-shirt for my snot and tears. Throughout the moment was peace and comfort. That was all I needed—oh, and him.\n\nI am in the happiest SR I’ve ever been in... out of my total two.... Lol. And I cannot thank him enough for all he’s done for me. Hopefully, I’m doing the exact much he’s doing for me... or more.",
            "author": "beheadedSB",
            "id": "fb7co8d",
            "parent_id": "t3_ebuz3d",
            "score": 17,
            "created_utc": 1576585382.0,
            "replies": []
        },
        {
            "body": ">This was the type of medical procedure even a husband would balk at attending.\n\nNot a good husband.",
            "author": "marker3000",
            "id": "fb81qus",
            "parent_id": "t3_ebuz3d",
            "score": 15,
            "created_utc": 1576604244.0,
            "replies": [
                {
                    "body": "That's why they're no longer our husbands!",
                    "author": "socharmer",
                    "id": "fb9dzmn",
                    "parent_id": "t1_fb81qus",
                    "score": 6,
                    "created_utc": 1576636108.0,
                    "replies": [
                        {
                            "body": "😂🙌",
                            "author": "_hello_sugar_",
                            "id": "fed50tj",
                            "parent_id": "t1_fb9dzmn",
                            "score": 1,
                            "created_utc": 1578999188.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Somewhat related to your post but I made one yesterday about how Asian households don't show affection in the same way, [well, white people do](https://www.reddit.com/r/sugarlifestyleforum/comments/ebr01a/an_epiphany_or_i_just_finally_caught_up/fb6rnfw/).\n\nHugs and talking about feelings have always been an issue in relationships I've been in and it's been brought up many times even when I've tried to work at it and think I've improved--but ultimately its actions that show our actual feelings.\n\nSo while I may not hug my mom or even say I love you or whatever, if she calls/asks me to do something I'll immediately drop everything and do it--and vice versa. Maybe our actions that show love are to make up our lack of saying it.",
            "author": "tenmillionplus",
            "id": "fb7rnk2",
            "parent_id": "t3_ebuz3d",
            "score": 7,
            "created_utc": 1576597795.0,
            "replies": [
                {
                    "body": "Black people and Indian people and Latin people hug as well in families.....it’s not a white exclusive thing. Where on earth could you get that idea from?????",
                    "author": "genericMaker",
                    "id": "fnhu73n",
                    "parent_id": "t1_fb7rnk2",
                    "score": 1,
                    "created_utc": 1586968916.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "So from your post, you will dump SD, when you find the following partner.\n\n1. Trans - you should specify pre or post op.\n2. Originally from Siberia\n3. Plays in an orchestra  - does it matter what instrument?  \n\nSeems kinda picky, so I think Initial is safe for a while.",
            "author": "MrBuzzard",
            "id": "fb7vbxq",
            "parent_id": "t3_ebuz3d",
            "score": 7,
            "created_utc": 1576600208.0,
            "replies": [
                {
                    "body": "If he’s in an orchestra, I’m thinking harmonica. All that mouth work should make him nice and strong in the tongue. 😳",
                    "author": null,
                    "id": "fb7ww2l",
                    "parent_id": "t1_fb7vbxq",
                    "score": 5,
                    "created_utc": 1576601198.0,
                    "replies": [
                        {
                            "body": "Touché. That is perfect.  😆",
                            "author": "MrBuzzard",
                            "id": "fb7xec9",
                            "parent_id": "t1_fb7ww2l",
                            "score": 2,
                            "created_utc": 1576601517.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "LMFAO",
                    "author": "BratinaHat",
                    "id": "fb862qu",
                    "parent_id": "t1_fb7vbxq",
                    "score": 1,
                    "created_utc": 1576606952.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fb7ej0j",
            "parent_id": "t3_ebuz3d",
            "score": 10,
            "created_utc": 1576587359.0,
            "replies": [
                {
                    "body": "I know what you mean by threw all those rules out the window.   I had great rules and boundaries with my other LT SBs but out the window they went when my current SB showed up. We support each other and have a great time together. Oops, but that’s relationships.",
                    "author": "ab1035",
                    "id": "fb7s017",
                    "parent_id": "t1_fb7ej0j",
                    "score": 2,
                    "created_utc": 1576598025.0,
                    "replies": []
                },
                {
                    "body": "I love hearing about how happy you are in your relationship. I bet you’re both awesome together!",
                    "author": null,
                    "id": "fb960iz",
                    "parent_id": "t1_fb7ej0j",
                    "score": 1,
                    "created_utc": 1576630248.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "> Except for that one time he refused to see the Trans-Siberian Orchestra with me. That he refused. \n\nOMG what kind of human defect are you dealing with?!  Who doesn't love the TSO? :(\n\nBut seriously, it's always nice to hear about the relationships that are going so well. <3",
            "author": "Ranger3752",
            "id": "fb7p2io",
            "parent_id": "t3_ebuz3d",
            "score": 6,
            "created_utc": 1576596026.0,
            "replies": []
        },
        {
            "body": "Very happy for you!. Having said that, must share my opinion, and get down voted to abyss as the debbie downer of the day. But someones gotto say it. What you have is the top 1-2 percentile of an arrangement, very much like a platonic. There is nothing wrong with others to aspire for what you have but 98% wont make it!",
            "author": "captainIsBack4u",
            "id": "fb8dvcv",
            "parent_id": "t3_ebuz3d",
            "score": 6,
            "created_utc": 1576611780.0,
            "replies": [
                {
                    "body": "Interested in what makes you think this arrangement makes it top 1-2%?",
                    "author": null,
                    "id": "fb8t8w7",
                    "parent_id": "t1_fb8dvcv",
                    "score": 5,
                    "created_utc": 1576621367.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "SGF nursed me through a situation where I was in a bad way. It was that day that I knew I could trust her 100%.\n\n>(Still iso a Trans-Siberian Orchestra partner.)\n\nAll last week, I had the giant 80\" display in the conference room playing TSO concert videos from YouTube.  I would be your TSO partner any day.",
            "author": "joc13",
            "id": "fb7zjwq",
            "parent_id": "t3_ebuz3d",
            "score": 3,
            "created_utc": 1576602879.0,
            "replies": [
                {
                    "body": "It’s honestly not Christmas without TSO. Maybe we should make an SLF- TSO meetup?!?",
                    "author": null,
                    "id": "fb963am",
                    "parent_id": "t1_fb7zjwq",
                    "score": 1,
                    "created_utc": 1576630306.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I agree with this. Same way. I am glad you and him are still going so strong!",
            "author": "BigBearSD",
            "id": "fb7ifnj",
            "parent_id": "t3_ebuz3d",
            "score": 3,
            "created_utc": 1576590988.0,
            "replies": []
        },
        {
            "body": "So glad the procedure went well and that he was there to support you!\n\nAlso, you two are so eloquent with your words, love it, it's adorable.  I'm more numbers/facts than pretty words and I'm envious of your writing skills 😘\n\nP.s.  I like TSO 😉",
            "author": "CentralUSGal",
            "id": "fb8dzp5",
            "parent_id": "t3_ebuz3d",
            "score": 2,
            "created_utc": 1576611854.0,
            "replies": [
                {
                    "body": "I told him to fly you to nyc just so we can see the show. I’ll be the sugar mama for the day. 🥰",
                    "author": null,
                    "id": "fb8jn2j",
                    "parent_id": "t1_fb8dzp5",
                    "score": 2,
                    "created_utc": 1576615366.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "fb8s8mw",
                            "parent_id": "t1_fb8jn2j",
                            "score": 1,
                            "created_utc": 1576620716.0,
                            "replies": [
                                {
                                    "body": "Of course! You’ll be the slightly older sugar-son I’ve always wanted! ♥️",
                                    "author": null,
                                    "id": "fb936os",
                                    "parent_id": "t1_fb8s8mw",
                                    "score": 2,
                                    "created_utc": 1576628201.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "😍🥰",
                            "author": "CentralUSGal",
                            "id": "fb9mpeg",
                            "parent_id": "t1_fb8jn2j",
                            "score": 1,
                            "created_utc": 1576642848.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "RIP your inbox with all the Trans-Siberian Orchestra date offers. 🙄\n\nGo with u/CentralUSgal",
            "author": "InitialD-86",
            "id": "fb8eswn",
            "parent_id": "t3_ebuz3d",
            "score": 2,
            "created_utc": 1576612347.0,
            "replies": [
                {
                    "body": "Stop bossing me around.",
                    "author": null,
                    "id": "fb8jf19",
                    "parent_id": "t1_fb8eswn",
                    "score": 2,
                    "created_utc": 1576615231.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "He’s a lucky bastard.  Best wishes.",
            "author": "SubstantialPeakie",
            "id": "fb9p1zi",
            "parent_id": "t3_ebuz3d",
            "score": 2,
            "created_utc": 1576644897.0,
            "replies": []
        },
        {
            "body": "This post is adorable. I don't have any answers but thanks for posting <3",
            "author": "BratinaHat",
            "id": "fb85v14",
            "parent_id": "t3_ebuz3d",
            "score": 1,
            "created_utc": 1576606819.0,
            "replies": []
        },
        {
            "body": "That's why they're no longer our husbands!",
            "author": "socharmer",
            "id": "fb9dzmn",
            "parent_id": "t1_fb81qus",
            "score": 6,
            "created_utc": 1576636108.0,
            "replies": [
                {
                    "body": "😂🙌",
                    "author": "_hello_sugar_",
                    "id": "fed50tj",
                    "parent_id": "t1_fb9dzmn",
                    "score": 1,
                    "created_utc": 1578999188.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Black people and Indian people and Latin people hug as well in families.....it’s not a white exclusive thing. Where on earth could you get that idea from?????",
            "author": "genericMaker",
            "id": "fnhu73n",
            "parent_id": "t1_fb7rnk2",
            "score": 1,
            "created_utc": 1586968916.0,
            "replies": []
        },
        {
            "body": "If he’s in an orchestra, I’m thinking harmonica. All that mouth work should make him nice and strong in the tongue. 😳",
            "author": null,
            "id": "fb7ww2l",
            "parent_id": "t1_fb7vbxq",
            "score": 5,
            "created_utc": 1576601198.0,
            "replies": [
                {
                    "body": "Touché. That is perfect.  😆",
                    "author": "MrBuzzard",
                    "id": "fb7xec9",
                    "parent_id": "t1_fb7ww2l",
                    "score": 2,
                    "created_utc": 1576601517.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "LMFAO",
            "author": "BratinaHat",
            "id": "fb862qu",
            "parent_id": "t1_fb7vbxq",
            "score": 1,
            "created_utc": 1576606952.0,
            "replies": []
        },
        {
            "body": "I know what you mean by threw all those rules out the window.   I had great rules and boundaries with my other LT SBs but out the window they went when my current SB showed up. We support each other and have a great time together. Oops, but that’s relationships.",
            "author": "ab1035",
            "id": "fb7s017",
            "parent_id": "t1_fb7ej0j",
            "score": 2,
            "created_utc": 1576598025.0,
            "replies": []
        },
        {
            "body": "I love hearing about how happy you are in your relationship. I bet you’re both awesome together!",
            "author": null,
            "id": "fb960iz",
            "parent_id": "t1_fb7ej0j",
            "score": 1,
            "created_utc": 1576630248.0,
            "replies": []
        },
        {
            "body": "Interested in what makes you think this arrangement makes it top 1-2%?",
            "author": null,
            "id": "fb8t8w7",
            "parent_id": "t1_fb8dvcv",
            "score": 5,
            "created_utc": 1576621367.0,
            "replies": []
        },
        {
            "body": "It’s honestly not Christmas without TSO. Maybe we should make an SLF- TSO meetup?!?",
            "author": null,
            "id": "fb963am",
            "parent_id": "t1_fb7zjwq",
            "score": 1,
            "created_utc": 1576630306.0,
            "replies": []
        },
        {
            "body": "I told him to fly you to nyc just so we can see the show. I’ll be the sugar mama for the day. 🥰",
            "author": null,
            "id": "fb8jn2j",
            "parent_id": "t1_fb8dzp5",
            "score": 2,
            "created_utc": 1576615366.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "fb8s8mw",
                    "parent_id": "t1_fb8jn2j",
                    "score": 1,
                    "created_utc": 1576620716.0,
                    "replies": [
                        {
                            "body": "Of course! You’ll be the slightly older sugar-son I’ve always wanted! ♥️",
                            "author": null,
                            "id": "fb936os",
                            "parent_id": "t1_fb8s8mw",
                            "score": 2,
                            "created_utc": 1576628201.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "😍🥰",
                    "author": "CentralUSGal",
                    "id": "fb9mpeg",
                    "parent_id": "t1_fb8jn2j",
                    "score": 1,
                    "created_utc": 1576642848.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Stop bossing me around.",
            "author": null,
            "id": "fb8jf19",
            "parent_id": "t1_fb8eswn",
            "score": 2,
            "created_utc": 1576615231.0,
            "replies": []
        },
        {
            "body": "😂🙌",
            "author": "_hello_sugar_",
            "id": "fed50tj",
            "parent_id": "t1_fb9dzmn",
            "score": 1,
            "created_utc": 1578999188.0,
            "replies": []
        },
        {
            "body": "Touché. That is perfect.  😆",
            "author": "MrBuzzard",
            "id": "fb7xec9",
            "parent_id": "t1_fb7ww2l",
            "score": 2,
            "created_utc": 1576601517.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fb8s8mw",
            "parent_id": "t1_fb8jn2j",
            "score": 1,
            "created_utc": 1576620716.0,
            "replies": [
                {
                    "body": "Of course! You’ll be the slightly older sugar-son I’ve always wanted! ♥️",
                    "author": null,
                    "id": "fb936os",
                    "parent_id": "t1_fb8s8mw",
                    "score": 2,
                    "created_utc": 1576628201.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "😍🥰",
            "author": "CentralUSGal",
            "id": "fb9mpeg",
            "parent_id": "t1_fb8jn2j",
            "score": 1,
            "created_utc": 1576642848.0,
            "replies": []
        },
        {
            "body": "Of course! You’ll be the slightly older sugar-son I’ve always wanted! ♥️",
            "author": null,
            "id": "fb936os",
            "parent_id": "t1_fb8s8mw",
            "score": 2,
            "created_utc": 1576628201.0,
            "replies": []
        }
    ]
}