{
    "title": "Rant...",
    "post_id": "hotvif",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/hotvif/rant/",
    "author": "ophiserys",
    "body": "Went on a few dates with a POT, at one point he was going on about how anybody can be rich and if you aren’t rich you obviously don’t want to be. how he worked hard to get where he is and his rich parents didn’t get him there all they did was pay for his schooling and cover all his bills while in school then gave him 30k to start a business. But that all has nothing to do with his success.\n\nIf someone gave me 30k with no repercussions of losing it my business would be successful ... \n\n\nFuck this guy\n\nWould also like to add that this guy makes a stupid amount of money (take my word for this) but kept trying to get me to agree to ppm That is half of the norm in my city sex multiple times every time only at His house\n\nBut it has to be half of the norm in my city so it’s not about money\nBut it’s perfectly fine to use me for sex but according to him isn’t using me for sex\n\nEdit** messed up the numbers *",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/hotvif/rant/",
    "score": 106,
    "upvote_ratio": 0.91,
    "created_utc": 1594404461.0,
    "num_comments": 65,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "[deleted]",
            "author": null,
            "id": "fxkxyld",
            "parent_id": "t3_hotvif",
            "score": 78,
            "created_utc": 1594422567.0,
            "replies": [
                {
                    "body": "This was great. 😂",
                    "author": "pumpkinspicedcream",
                    "id": "fxkytpl",
                    "parent_id": "t1_fxkxyld",
                    "score": 13,
                    "created_utc": 1594423053.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Tell him you would like to try to replicate his experiment. He can seed you capital and pay for your schooling the same way as his parents did. If you succeed in the same way he did it will show he was right. \n\nLets get started!",
            "author": "amigodeface",
            "id": "fxk8ak8",
            "parent_id": "t3_hotvif",
            "score": 79,
            "created_utc": 1594409144.0,
            "replies": [
                {
                    "body": "Best response. Time for him to send the elevator of success back down to let someone else use it.",
                    "author": "LoftDaddy",
                    "id": "fxkhzpb",
                    "parent_id": "t1_fxk8ak8",
                    "score": 24,
                    "created_utc": 1594414042.0,
                    "replies": [
                        {
                            "body": "Something something \\*trickle down economics\\*",
                            "author": "_Fortuna_",
                            "id": "fxlk1f0",
                            "parent_id": "t1_fxkhzpb",
                            "score": 11,
                            "created_utc": 1594436002.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": ">at one point he was going on about how anybody can be rich and if you aren’t rich you obviously don’t want to be.\n\nBut if everyone were rich, nobody would actually be rich.  Prices would just be adjusted upward to reflect that reality.  Guess he's never taken an econ class.\n\nReminds me of a friend (I guess) during college.  We lived with 6 other guys and while me and him both came from white collar families, everyone else had blue collar parents.  When I wasn't around, he said to everyone else \"blue collar workers are blue collar because they didn't work hard enough in life\".  I'd ask if you were talking to the same guy, but I know he'd never be on SA.\n\nEff that POT.  While somewhat in the same boat (parents paid what scholarships didn't), after college, I made my own success without any help from my parents.  Least unlike your POT, I realize the huge leg up my folks gave me.",
            "author": "Church42",
            "id": "fxk05dp",
            "parent_id": "t3_hotvif",
            "score": 32,
            "created_utc": 1594405177.0,
            "replies": [
                {
                    "body": "you know what this really is? \n\n\"I don't want to feel guilty about my privilege so I'll label other people stupid or lazy.\"\n\nI've seen it a million times.",
                    "author": "Gemini-Fox",
                    "id": "fxk3dgb",
                    "parent_id": "t1_fxk05dp",
                    "score": 34,
                    "created_utc": 1594406729.0,
                    "replies": []
                },
                {
                    "body": "Everyone of us with money has at least some sort of privilege, my family was dirt poor. I barely finished HS, college was never an option, for me I was blessed with a very analytical brain which I found great use for and used to my advantage.",
                    "author": null,
                    "id": "fxk9iq5",
                    "parent_id": "t1_fxk05dp",
                    "score": 5,
                    "created_utc": 1594409761.0,
                    "replies": []
                },
                {
                    "body": "> But if everyone were rich, nobody would actually be rich.\n\nNot entirely true. We live in a post-scarcity environment where we introduce artificial scarcity. Those things have arbitrary nonsense values. One of the first such objects was the diamond. A current such object are limited run watches or limited run sneakers that are done for one reason only, to create demand by limiting supply on purpose though supply can easily be created. Nobody WANTS to create the supply because you make more money by limiting supply... of factory made goods.\n\nIf everyone is rich it means:\n\n1. everyone can get education to the extent they desire\n2. everyone can purchase services that they need to be healthy (health, mental)\n3. everyone can purchase all of the necessities of life (water, shelter, sanitation, etc)\n4. everyone can live in security \n\nIf you do that everyone is rich.\n\nIf you want to invent a brand of shoes that has only 10 copies made, yeah people will fight over them but that is artificial scarcity. The people buying those are not defined as \"rich\". \n\nRich is just defined as being able to lead the lifestyle above.",
                    "author": "amigodeface",
                    "id": "fxk8nm1",
                    "parent_id": "t1_fxk05dp",
                    "score": 2,
                    "created_utc": 1594409325.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "This is unfortunately a common perception among the rich. Even if parents didn't give them money, they don't understand the loving caring home is a huge leg up on alot of people. Then you start tacking on good, safe schools, safe neighborhoods a community that supports you. Being born to a wealthy household or even a lower middle class one puts you ahead by miles.",
            "author": "ZonaCouple",
            "id": "fxjzhll",
            "parent_id": "t3_hotvif",
            "score": 30,
            "created_utc": 1594404857.0,
            "replies": [
                {
                    "body": "But they paid for his school and gave him enough to not have to work during school which makes a massive difference, I still owe 10k in debt from my schooling that I didn’t even finish because I had to work 5 days a week to barely afford living",
                    "author": "ophiserys",
                    "id": "fxjzwcw",
                    "parent_id": "t1_fxjzhll",
                    "score": 11,
                    "created_utc": 1594405055.0,
                    "replies": [
                        {
                            "body": "Yeah that just makes this particular guy worse.",
                            "author": "ZonaCouple",
                            "id": "fxk85n0",
                            "parent_id": "t1_fxjzwcw",
                            "score": 6,
                            "created_utc": 1594409076.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "This is a wonderful, concise synopsis of everything that comes with an enlightened upbringing. Thank you.",
                    "author": "_Fortuna_",
                    "id": "fxllevg",
                    "parent_id": "t1_fxjzhll",
                    "score": 1,
                    "created_utc": 1594436903.0,
                    "replies": []
                },
                {
                    "body": "I find it amazing that the people with the most trans-generational advantages claim that hard work and their own doing made them successful.\n\nIt varies from working in the family business, to marrying a well off/connected wife (who got someone a great job), or an in law who got a huge salaried job because they knew someone in their rich neighborhood. It’s really quite amazing.",
                    "author": "garret6758",
                    "id": "fxly3n1",
                    "parent_id": "t1_fxjzhll",
                    "score": 1,
                    "created_utc": 1594444542.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "So many of these SD stories makes me look like the kindest and most considerate SD in history, haha.",
            "author": "garret6758",
            "id": "fxkeheb",
            "parent_id": "t3_hotvif",
            "score": 8,
            "created_utc": 1594412256.0,
            "replies": [
                {
                    "body": "I know, right?",
                    "author": "BinghamtonSD",
                    "id": "fxkqzdz",
                    "parent_id": "t1_fxkeheb",
                    "score": 2,
                    "created_utc": 1594418735.0,
                    "replies": []
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "fxl7h2u",
                    "parent_id": "t1_fxkeheb",
                    "score": 2,
                    "created_utc": 1594428169.0,
                    "replies": [
                        {
                            "body": "I know, I’m the total package. 🤪",
                            "author": "garret6758",
                            "id": "fxnvadr",
                            "parent_id": "t1_fxl7h2u",
                            "score": 1,
                            "created_utc": 1594472248.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Funny, this sounds exactly like a POT that I just had a M&G with. He talked and acted exactly like Trump, it was awful... He hit basically every red flag possible.\n\nSome highlights from the conversation: \n\n>\"What are you? are you Oriental?\"  \n>  \n>\"Your biological clock is running out. You won't be attractive for much longer!\"  \n>  \n>\"I'm extremely influential in this city you know. I meet with multiple billionaires every day, and I came from nothing. It's all about hard work. No one works as hard as I do.\"  \n>  \n>\"\\[while staring at my crotch\\] At least you look like you're ALL woman...\"  \n>  \n>\"I can get a hot 19 year old to come to my condo and fuck me for (*extremely* low xxx), and she would walk away happy! Of course I would never do that because there's no chase.\"  \n>  \n>\"Men HAVE to cheat. It's a biological necessity that women wouldn't understand. Every man cheats.\"\n\nI sat through about 30 minutes of him monologuing before I couldn't take it anymore.",
            "author": "bi_ochemist",
            "id": "fxkh4ul",
            "parent_id": "t3_hotvif",
            "score": 14,
            "created_utc": 1594413600.0,
            "replies": [
                {
                    "body": "30 mins!!! that's a long time to hold in your eye rolls!",
                    "author": "jinjinb",
                    "id": "fxl29on",
                    "parent_id": "t1_fxkh4ul",
                    "score": 4,
                    "created_utc": 1594425049.0,
                    "replies": [
                        {
                            "body": "My eyes would roll back into my head",
                            "author": "highjinx411",
                            "id": "fxmtdik",
                            "parent_id": "t1_fxl29on",
                            "score": 1,
                            "created_utc": 1594455078.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "A lot of people who think they did it all themselves actually had  lot of help.",
            "author": null,
            "id": "fxkuugn",
            "parent_id": "t3_hotvif",
            "score": 5,
            "created_utc": 1594420829.0,
            "replies": []
        },
        {
            "body": "Did you go on a date with the president? Lol",
            "author": null,
            "id": "fxjyuo3",
            "parent_id": "t3_hotvif",
            "score": 20,
            "created_utc": 1594404545.0,
            "replies": [
                {
                    "body": "Right?! Lmao",
                    "author": "ophiserys",
                    "id": "fxjz3zz",
                    "parent_id": "t1_fxjyuo3",
                    "score": 9,
                    "created_utc": 1594404673.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "In case you needed more evidence that money doesnt cure ignorance...",
            "author": "TastySpermDispenser",
            "id": "fxk3pvj",
            "parent_id": "t3_hotvif",
            "score": 8,
            "created_utc": 1594406896.0,
            "replies": []
        },
        {
            "body": "Hmmmm. The so-called rich are not as secure as they seem. Doom hangs over them like a sword and they fret over imminent poverty. Which is why they cling to their money. They are aware how quickly their wealth can evaporate and how precarious is their good fortune. Which is why so many marry and tie down relatively guaranteed access to sex. Well as guaranteed as marriages can be today. Few like Epstein or Hefner can enjoy multiple partners all the way through life and those men tend to be involved in sex trafficking for profit.",
            "author": null,
            "id": "fxl0mn2",
            "parent_id": "t3_hotvif",
            "score": 2,
            "created_utc": 1594424089.0,
            "replies": []
        },
        {
            "body": "LOL I swear to god before I started sugaring these extreme personalities were only caricatures of humanity. Now, however, I have realized that they are very, very real, and I lived a blessed life before I discovered this.\n\n&#x200B;\n\nYou're feelings are completely rational.  \n\nYou're a saint for putting up with this as long as you did. ❤",
            "author": "_Fortuna_",
            "id": "fxljwx1",
            "parent_id": "t3_hotvif",
            "score": 2,
            "created_utc": 1594435921.0,
            "replies": []
        },
        {
            "body": "So few privileged people seem to get this (disclaimer, I'm one of them).  This is what privilege looks like:\n\n* Being born into a family where your parents are married and stay together\n* Parents who are both native English speakers\n* Your neighborhood is safe enough that you can get to/from school without having to run/look over your shoulder\n* You have good role models in your life, high expectations are set for you\n* Bonus: Your way through school is paid\n* Double bonus:  Your family helps you in your early professional life\n\nThese may seem like norms to the successful, but to everyone else they're a fantasy.",
            "author": "Eauboy2015",
            "id": "fxqj8hp",
            "parent_id": "t3_hotvif",
            "score": 2,
            "created_utc": 1594497328.0,
            "replies": []
        },
        {
            "body": "Things like listening to these types of rants and agreeing is part of why we are paid for these dates. Lol.",
            "author": "prettylilprostitute",
            "id": "fxjzdvt",
            "parent_id": "t3_hotvif",
            "score": 7,
            "created_utc": 1594404807.0,
            "replies": [
                {
                    "body": "Really? I absolutely wouldn't be able to just listen and agree if it's not something I agree with. I'm happy to have an open dialogue and debate (civil... yes, they exist) as to why my opinion (I'd like to think it's fact 😏) is very different. And then if HE'S not civil and isn't open to listening to different viewpoints , then it probably wouldn't work between the two of us. \n\nNote: I come from what would be considered a wealthy family, though by all means not uber wealth.",
                    "author": "1SweetCheeks",
                    "id": "fxk241a",
                    "parent_id": "t1_fxjzdvt",
                    "score": 3,
                    "created_utc": 1594406125.0,
                    "replies": [
                        {
                            "body": "It it’s something related to racism or what they are saying is like really inappropriate then I wouldn’t agree and I would be very up front with my feelings about it. But something like that is just annoying and I would let it go. It depends on the guy if I’ll have dialogue. I’m not going to change my opinion or talk as though I agree but I wouldn’t debate it.. if that makes sense.",
                            "author": "prettylilprostitute",
                            "id": "fxk2na9",
                            "parent_id": "t1_fxk241a",
                            "score": 0,
                            "created_utc": 1594406381.0,
                            "replies": [
                                {
                                    "body": "Yeah, I get it. Sometimes, it's just not worth the effort, but I definitely wouldn't be in an arrangement with a man like that. Hah.",
                                    "author": "1SweetCheeks",
                                    "id": "fxk3e5s",
                                    "parent_id": "t1_fxk2na9",
                                    "score": 5,
                                    "created_utc": 1594406739.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Didn’t pay me for any of the platonic dates, didn’t even bother with intimacy since his offer was less than 1/3 of what my last arrangements were... I told him what I wanted at the beginning but he thinks he’s so hot (younger, his pictures he did look great but in person he was about 40lb heavier and just looked not attractive at all)",
                    "author": "ophiserys",
                    "id": "fxjzpn2",
                    "parent_id": "t1_fxjzdvt",
                    "score": 0,
                    "created_utc": 1594404965.0,
                    "replies": [
                        {
                            "body": "Do you feel like you're going to be annoyed, grossed out, offended all the time with this man? If so, next him. I know some need the money, but I doubt it's worth your mental health.",
                            "author": "1SweetCheeks",
                            "id": "fxk2976",
                            "parent_id": "t1_fxjzpn2",
                            "score": 4,
                            "created_utc": 1594406195.0,
                            "replies": [
                                {
                                    "body": "Oh yeah no blocked him fuck that",
                                    "author": "ophiserys",
                                    "id": "fxk2vbm",
                                    "parent_id": "t1_fxk2976",
                                    "score": 5,
                                    "created_utc": 1594406489.0,
                                    "replies": [
                                        {
                                            "body": "🙌🏻",
                                            "author": "1SweetCheeks",
                                            "id": "fxk31zw",
                                            "parent_id": "t1_fxk2vbm",
                                            "score": 2,
                                            "created_utc": 1594406578.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "Good move, you don’t need that noise.",
                                            "author": "SunnyWinter85",
                                            "id": "fxk42zo",
                                            "parent_id": "t1_fxk2vbm",
                                            "score": 2,
                                            "created_utc": 1594407071.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Get paid for platonic girl!",
                            "author": "prettylilprostitute",
                            "id": "fxk2oj5",
                            "parent_id": "t1_fxjzpn2",
                            "score": -8,
                            "created_utc": 1594406397.0,
                            "replies": [
                                {
                                    "body": "How??!! What do you even say?! M&gs too?",
                                    "author": "ophiserys",
                                    "id": "fxk2teu",
                                    "parent_id": "t1_fxk2oj5",
                                    "score": -1,
                                    "created_utc": 1594406463.0,
                                    "replies": [
                                        {
                                            "body": "Don't do this, you will lose more legit opportunities with actual SDs than you will gain in the few guys that are willing to pay for platonic dates.",
                                            "author": "storm170",
                                            "id": "fxkbiq8",
                                            "parent_id": "t1_fxk2teu",
                                            "score": 2,
                                            "created_utc": 1594410759.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "Unlikely to get paid for M&Gs.\n\nBefore an arrangement starts, you may want to ask about platonic dates and comp for them.  If he's open to it, he may do so but not at full PPM.\n\nCourse if you're on allowance, platonic/intimate dates are being paid regardless.",
                                            "author": "Church42",
                                            "id": "fxk3qps",
                                            "parent_id": "t1_fxk2teu",
                                            "score": 1,
                                            "created_utc": 1594406907.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "I don’t use SA girl. It seems normal for M&Gs to be unpaid which is why I won’t be joining SA. \n\nBut any date even platonic after an arrangement is set should be paid (until allowance).",
                                            "author": "prettylilprostitute",
                                            "id": "fxkb8fs",
                                            "parent_id": "t1_fxk2teu",
                                            "score": 0,
                                            "created_utc": 1594410615.0,
                                            "replies": [
                                                {
                                                    "body": "What do you do instead of SA???",
                                                    "author": "ophiserys",
                                                    "id": "fxkcdz5",
                                                    "parent_id": "t1_fxkb8fs",
                                                    "score": 2,
                                                    "created_utc": 1594411196.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Sounds like a douchebag. \nHe should do some research on the statistics of those that grew up/ raised in poverty, fuck, or those that were not “privileged”. \n\nWhen I say privileged I’m not referring specifically to race either.",
            "author": "GLA-2020",
            "id": "fxk0j1h",
            "parent_id": "t3_hotvif",
            "score": 3,
            "created_utc": 1594405363.0,
            "replies": []
        },
        {
            "body": "He's a jerk. Plain and simple. And a tightwad. While it's true yes everybody can get rich in this country, the opportunity is there, it's a lot easier if you're already on the first or second step. It's also a lot easier if you have no moral ground and don't mind stepping on everybody's toes and basically fucking people around. And that's why I'm not rich. I'm not poor but I'm not rich either. I'm not that ruthless",
            "author": "Jdn345",
            "id": "fxk3v1m",
            "parent_id": "t3_hotvif",
            "score": 3,
            "created_utc": 1594406966.0,
            "replies": []
        },
        {
            "body": "By any chance was this guy the President of the United States?",
            "author": "TY2022",
            "id": "fxk3b3o",
            "parent_id": "t3_hotvif",
            "score": 2,
            "created_utc": 1594406700.0,
            "replies": []
        },
        {
            "body": "He ain't rare, unfortunately.   That also explains why I don't have many friends.  I have enough fuck you money  that I refuse to hold my tongue when dealing with such assholes.  This also explains why my wife bans me from all her social events.  Deep down inside I think she agrees with them.  Common theme if you came from money.",
            "author": "iamjusthonest",
            "id": "fxk5ujr",
            "parent_id": "t3_hotvif",
            "score": 2,
            "created_utc": 1594407926.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fxkwkaf",
            "parent_id": "t3_hotvif",
            "score": 1,
            "created_utc": 1594421788.0,
            "replies": [
                {
                    "body": "But her point was that he brags about being a self starter, but would he have made it so far if he had graduated from college 100k in debt and unable to get a business loan instead of debt free and with a gift of 30k to start his business? People who have such immense privilege and deny so vehemently that it had any bearing on the success they claim as solely their own are hyprocrites and liars.\n\nHe might be great at business, but the point is that he may not have been able to start that business if he had had to work his way through college. It’s not a crime to have privilege, but to deny that it had some part in one’s current success is obtuse, at best.",
                    "author": "lasswithaleash",
                    "id": "fxl36wd",
                    "parent_id": "t1_fxkwkaf",
                    "score": 7,
                    "created_utc": 1594425598.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Complain, Block and Move On!!",
            "author": "tankbinding",
            "id": "fxl0umv",
            "parent_id": "t3_hotvif",
            "score": 1,
            "created_utc": 1594424218.0,
            "replies": [
                {
                    "body": "Oppps did I say that \"out loud\"?!? Maybe just screen better!!",
                    "author": "tankbinding",
                    "id": "fxl0x46",
                    "parent_id": "t1_fxl0umv",
                    "score": 1,
                    "created_utc": 1594424259.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "You're wise and fortunate not to fall for the shell game..\n\nMany moneyed people exhibit what they possess as a means to curry favors from folks who have less.  It makes no sense, yet too many humans operate on the assumption that the ***haves*** are decent, refined, and fair-minded—because that's how they-themselves would behave if they had means.\n\nThe stinginess is his defect of character, his cross to bear.  You're letting it be his burden to find cut-rate intimacy and not be found out for a miser or a fraud.  Good for you!",
            "author": null,
            "id": "fxlpdb8",
            "parent_id": "t3_hotvif",
            "score": 1,
            "created_utc": 1594439589.0,
            "replies": []
        },
        {
            "body": "Sounds like fucktard Donald trump and his million dollar startup loan.",
            "author": "sdthrowout23",
            "id": "fxo1rk5",
            "parent_id": "t3_hotvif",
            "score": 1,
            "created_utc": 1594474480.0,
            "replies": []
        },
        {
            "body": "What an awesome post!\n\nI saw a bunch of references to...generational wealth.  Not just money, we inherit a boatload of advantages from our parents.  It builds over generations (20-30 years).  I am a child of this culture as are my kids.  Minorities to a large extent are children of generational poverty.  Lack of a safe, stable home, diet, education, and many other cultural norms puts so many people at a disadvantage.\n\nAt it's core, conservatism is simply about helping to pass all the advantages I enjoyed down to the next generation.  Not just family, conservative cultures are about the entire community helping the next generation.\n\nProgressives on the other hands want opportunity over community.  They want a level playing field, a fair race.  \n\nFascism (Trump) comes in when the conservative community breaks down.  Entitlement goes out the window as a generation stumbles due to unforseen, typically economic, forces decimate a well planned social structure.  Entitled jerks get pissed when they can't retire in their 50's to a big golf community in Naples. \n\nThe crash of 2008 killed millions of well-paying jobs.  Middle management disappeared as did all the positions that kept them safe for decades.  Guys making $150k per year struggled to find work for $50k.   The system was broken and they were refugees.   Life was suddenly unfair and they were too old to do anything about it.  Conservatism let them down and they were too broken to compete with the next generation.\n\nSo, Obama rides a wave of hopeful progressives into the White House while a huge chunk of the country tried to figure out what went wrong.  Along comes Trump with possible answers...Immigrants, China and most importantly...the old guard.   Trump became the middle finger to America...a chance for their formerly entitled asses to be heard.\n\nYou can't feel sorry for your POT.  He comes from a different planet.   A planet of entitled jerks.  Sadly that's my home planet too.   But, I recognize the other worlds out there as being very different from my own.  My Ex was from a different world.  I naturally assumed she would praise & cherish me forever for bringing her over to my planet.  I had no idea what a jerk I was back then (or still am).\n\nMy only advise to you is this:  When in Rome.....enjoy the culture for what it is...different.",
            "author": "sdphilly",
            "id": "fxxfrlo",
            "parent_id": "t3_hotvif",
            "score": 1,
            "created_utc": 1594647978.0,
            "replies": []
        },
        {
            "body": "Fuck him and his ignorance.",
            "author": "InnerRadio7",
            "id": "fy3n5gm",
            "parent_id": "t3_hotvif",
            "score": 1,
            "created_utc": 1594777592.0,
            "replies": []
        },
        {
            "body": "I think there is observable karma for people like this. His family's wealth can buy him a lot, but it can't buy him character. It probably enabled and accelerated his descent into loserdom. \n\nThe disgust you felt is felt by everyone who meets him - at least everyone who matters. \n\nAny friend he makes is probably taking advantage of his wealth, or has similarly shitty qualities. If he lands a woman, she'll be a cold-blooded huntress. \n\nHe'll be a loser forever. Even if he turns it all around (which he won't), he'll wear the black mark of someone who's been a loser.",
            "author": "KingBeefFrank",
            "id": "fy8f1ak",
            "parent_id": "t3_hotvif",
            "score": 1,
            "created_utc": 1594887028.0,
            "replies": []
        },
        {
            "body": "Sounds like you bumped into a bit of a narcissist, and understandably weren't a match.\n\nBut.... isn't there a way to merge this into the Friday Rants and Raves post? I thought the whole point of the weekly Rants&Raves was to consolidate stuff like this.",
            "author": "sdthrowaway006",
            "id": "fxk9et7",
            "parent_id": "t3_hotvif",
            "score": 1,
            "created_utc": 1594409707.0,
            "replies": []
        },
        {
            "body": "Born on third base and bragging about hitting a triple.  These are the most obnoxious types.  Just get a different SD,  this dickhead will never be worth your time.",
            "author": "LotBuilder",
            "id": "fxlet52",
            "parent_id": "t3_hotvif",
            "score": 1,
            "created_utc": 1594432650.0,
            "replies": []
        },
        {
            "body": "So....Trump?",
            "author": "LikeHoney99",
            "id": "fxk2233",
            "parent_id": "t3_hotvif",
            "score": 1,
            "created_utc": 1594406099.0,
            "replies": []
        },
        {
            "body": "> Edit\\*\\* messed up the numbers \\* \n\nMessed up by including numbers against sub rules...",
            "author": "UseTheForceRey",
            "id": "fxkda4i",
            "parent_id": "t3_hotvif",
            "score": 0,
            "created_utc": 1594411647.0,
            "replies": [
                {
                    "body": "THERE YOU GO",
                    "author": "ophiserys",
                    "id": "fxkdguo",
                    "parent_id": "t1_fxkda4i",
                    "score": 3,
                    "created_utc": 1594411743.0,
                    "replies": [
                        {
                            "body": "Thanks for downvoting me for pointing out your error.",
                            "author": "UseTheForceRey",
                            "id": "fxkdo1m",
                            "parent_id": "t1_fxkdguo",
                            "score": -2,
                            "created_utc": 1594411842.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "1.  If everyone were rich there would be no SBs.\n2.  SBs make me happy.\n3.  Therefore, if everyone were rich, I wouldn’t be happy.  \n😂 \nIn any event, that guy’s a d-bag.",
            "author": "leyapaul",
            "id": "fxlvo0m",
            "parent_id": "t3_hotvif",
            "score": 0,
            "created_utc": 1594443201.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fxk4u82",
            "parent_id": "t3_hotvif",
            "score": -4,
            "created_utc": 1594407435.0,
            "replies": [
                {
                    "body": "That’s literally just being cheap man, why would you want to confidently lowball..... sure don’t be generous at work but don’t mix pleasure with business, if you want to be a real SD you Need to be generous, not cheap",
                    "author": "ophiserys",
                    "id": "fxk9sl3",
                    "parent_id": "t1_fxk4u82",
                    "score": 6,
                    "created_utc": 1594409895.0,
                    "replies": [
                        {
                            "body": "I think (hope) he’s being sarcastic?",
                            "author": "BGDDDY1",
                            "id": "fxkqjgq",
                            "parent_id": "t1_fxk9sl3",
                            "score": 5,
                            "created_utc": 1594418499.0,
                            "replies": [
                                {
                                    "body": "Right? Otherwise way to out yourself as being cheap in the worst sub reddit to do so lol",
                                    "author": "ophiserys",
                                    "id": "fxkwnww",
                                    "parent_id": "t1_fxkqjgq",
                                    "score": 2,
                                    "created_utc": 1594421843.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "lots of people came from nothing.   i worked my ass to the bone to get here.  90hr weeks for 2.5 years to get started. i had 15 hours of leisure over that time.. total\n\nive come to understand thst starting a business, the stress and the workload aint for  everyone.  it is in large part.. a choice.  and not for everyone. \n\ni drive a 5000 used car and am a millionairre.  many of you have less money than me, but would not swap your life for mine.  \n\nsome people start ahead, some people start as an farmhand and become sucessful business.\n\nits not fair. but if you want yo become rich, dont focus on the whata not fair.  focus on what u can do.",
            "author": "anonyree",
            "id": "fxl4s2r",
            "parent_id": "t3_hotvif",
            "score": -1,
            "created_utc": 1594426537.0,
            "replies": [
                {
                    "body": "That’s not what this post was about it was literally just a complaint about a shitty SD, I literally work 90 hours a week and my ‘leisure time’ is spent making sure I don’t die because of an autoimmune disease ...... I have met significantly more sds who came from wealth than ones that came from nothing",
                    "author": "ophiserys",
                    "id": "fxl5pq7",
                    "parent_id": "t1_fxl4s2r",
                    "score": 2,
                    "created_utc": 1594427097.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "This was great. 😂",
            "author": "pumpkinspicedcream",
            "id": "fxkytpl",
            "parent_id": "t1_fxkxyld",
            "score": 13,
            "created_utc": 1594423053.0,
            "replies": []
        },
        {
            "body": "Best response. Time for him to send the elevator of success back down to let someone else use it.",
            "author": "LoftDaddy",
            "id": "fxkhzpb",
            "parent_id": "t1_fxk8ak8",
            "score": 24,
            "created_utc": 1594414042.0,
            "replies": [
                {
                    "body": "Something something \\*trickle down economics\\*",
                    "author": "_Fortuna_",
                    "id": "fxlk1f0",
                    "parent_id": "t1_fxkhzpb",
                    "score": 11,
                    "created_utc": 1594436002.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "you know what this really is? \n\n\"I don't want to feel guilty about my privilege so I'll label other people stupid or lazy.\"\n\nI've seen it a million times.",
            "author": "Gemini-Fox",
            "id": "fxk3dgb",
            "parent_id": "t1_fxk05dp",
            "score": 34,
            "created_utc": 1594406729.0,
            "replies": []
        },
        {
            "body": "Everyone of us with money has at least some sort of privilege, my family was dirt poor. I barely finished HS, college was never an option, for me I was blessed with a very analytical brain which I found great use for and used to my advantage.",
            "author": null,
            "id": "fxk9iq5",
            "parent_id": "t1_fxk05dp",
            "score": 5,
            "created_utc": 1594409761.0,
            "replies": []
        },
        {
            "body": "> But if everyone were rich, nobody would actually be rich.\n\nNot entirely true. We live in a post-scarcity environment where we introduce artificial scarcity. Those things have arbitrary nonsense values. One of the first such objects was the diamond. A current such object are limited run watches or limited run sneakers that are done for one reason only, to create demand by limiting supply on purpose though supply can easily be created. Nobody WANTS to create the supply because you make more money by limiting supply... of factory made goods.\n\nIf everyone is rich it means:\n\n1. everyone can get education to the extent they desire\n2. everyone can purchase services that they need to be healthy (health, mental)\n3. everyone can purchase all of the necessities of life (water, shelter, sanitation, etc)\n4. everyone can live in security \n\nIf you do that everyone is rich.\n\nIf you want to invent a brand of shoes that has only 10 copies made, yeah people will fight over them but that is artificial scarcity. The people buying those are not defined as \"rich\". \n\nRich is just defined as being able to lead the lifestyle above.",
            "author": "amigodeface",
            "id": "fxk8nm1",
            "parent_id": "t1_fxk05dp",
            "score": 2,
            "created_utc": 1594409325.0,
            "replies": []
        },
        {
            "body": "But they paid for his school and gave him enough to not have to work during school which makes a massive difference, I still owe 10k in debt from my schooling that I didn’t even finish because I had to work 5 days a week to barely afford living",
            "author": "ophiserys",
            "id": "fxjzwcw",
            "parent_id": "t1_fxjzhll",
            "score": 11,
            "created_utc": 1594405055.0,
            "replies": [
                {
                    "body": "Yeah that just makes this particular guy worse.",
                    "author": "ZonaCouple",
                    "id": "fxk85n0",
                    "parent_id": "t1_fxjzwcw",
                    "score": 6,
                    "created_utc": 1594409076.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "This is a wonderful, concise synopsis of everything that comes with an enlightened upbringing. Thank you.",
            "author": "_Fortuna_",
            "id": "fxllevg",
            "parent_id": "t1_fxjzhll",
            "score": 1,
            "created_utc": 1594436903.0,
            "replies": []
        },
        {
            "body": "I find it amazing that the people with the most trans-generational advantages claim that hard work and their own doing made them successful.\n\nIt varies from working in the family business, to marrying a well off/connected wife (who got someone a great job), or an in law who got a huge salaried job because they knew someone in their rich neighborhood. It’s really quite amazing.",
            "author": "garret6758",
            "id": "fxly3n1",
            "parent_id": "t1_fxjzhll",
            "score": 1,
            "created_utc": 1594444542.0,
            "replies": []
        },
        {
            "body": "I know, right?",
            "author": "BinghamtonSD",
            "id": "fxkqzdz",
            "parent_id": "t1_fxkeheb",
            "score": 2,
            "created_utc": 1594418735.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fxl7h2u",
            "parent_id": "t1_fxkeheb",
            "score": 2,
            "created_utc": 1594428169.0,
            "replies": [
                {
                    "body": "I know, I’m the total package. 🤪",
                    "author": "garret6758",
                    "id": "fxnvadr",
                    "parent_id": "t1_fxl7h2u",
                    "score": 1,
                    "created_utc": 1594472248.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "30 mins!!! that's a long time to hold in your eye rolls!",
            "author": "jinjinb",
            "id": "fxl29on",
            "parent_id": "t1_fxkh4ul",
            "score": 4,
            "created_utc": 1594425049.0,
            "replies": [
                {
                    "body": "My eyes would roll back into my head",
                    "author": "highjinx411",
                    "id": "fxmtdik",
                    "parent_id": "t1_fxl29on",
                    "score": 1,
                    "created_utc": 1594455078.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Right?! Lmao",
            "author": "ophiserys",
            "id": "fxjz3zz",
            "parent_id": "t1_fxjyuo3",
            "score": 9,
            "created_utc": 1594404673.0,
            "replies": []
        },
        {
            "body": "Really? I absolutely wouldn't be able to just listen and agree if it's not something I agree with. I'm happy to have an open dialogue and debate (civil... yes, they exist) as to why my opinion (I'd like to think it's fact 😏) is very different. And then if HE'S not civil and isn't open to listening to different viewpoints , then it probably wouldn't work between the two of us. \n\nNote: I come from what would be considered a wealthy family, though by all means not uber wealth.",
            "author": "1SweetCheeks",
            "id": "fxk241a",
            "parent_id": "t1_fxjzdvt",
            "score": 3,
            "created_utc": 1594406125.0,
            "replies": [
                {
                    "body": "It it’s something related to racism or what they are saying is like really inappropriate then I wouldn’t agree and I would be very up front with my feelings about it. But something like that is just annoying and I would let it go. It depends on the guy if I’ll have dialogue. I’m not going to change my opinion or talk as though I agree but I wouldn’t debate it.. if that makes sense.",
                    "author": "prettylilprostitute",
                    "id": "fxk2na9",
                    "parent_id": "t1_fxk241a",
                    "score": 0,
                    "created_utc": 1594406381.0,
                    "replies": [
                        {
                            "body": "Yeah, I get it. Sometimes, it's just not worth the effort, but I definitely wouldn't be in an arrangement with a man like that. Hah.",
                            "author": "1SweetCheeks",
                            "id": "fxk3e5s",
                            "parent_id": "t1_fxk2na9",
                            "score": 5,
                            "created_utc": 1594406739.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Didn’t pay me for any of the platonic dates, didn’t even bother with intimacy since his offer was less than 1/3 of what my last arrangements were... I told him what I wanted at the beginning but he thinks he’s so hot (younger, his pictures he did look great but in person he was about 40lb heavier and just looked not attractive at all)",
            "author": "ophiserys",
            "id": "fxjzpn2",
            "parent_id": "t1_fxjzdvt",
            "score": 0,
            "created_utc": 1594404965.0,
            "replies": [
                {
                    "body": "Do you feel like you're going to be annoyed, grossed out, offended all the time with this man? If so, next him. I know some need the money, but I doubt it's worth your mental health.",
                    "author": "1SweetCheeks",
                    "id": "fxk2976",
                    "parent_id": "t1_fxjzpn2",
                    "score": 4,
                    "created_utc": 1594406195.0,
                    "replies": [
                        {
                            "body": "Oh yeah no blocked him fuck that",
                            "author": "ophiserys",
                            "id": "fxk2vbm",
                            "parent_id": "t1_fxk2976",
                            "score": 5,
                            "created_utc": 1594406489.0,
                            "replies": [
                                {
                                    "body": "🙌🏻",
                                    "author": "1SweetCheeks",
                                    "id": "fxk31zw",
                                    "parent_id": "t1_fxk2vbm",
                                    "score": 2,
                                    "created_utc": 1594406578.0,
                                    "replies": []
                                },
                                {
                                    "body": "Good move, you don’t need that noise.",
                                    "author": "SunnyWinter85",
                                    "id": "fxk42zo",
                                    "parent_id": "t1_fxk2vbm",
                                    "score": 2,
                                    "created_utc": 1594407071.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Get paid for platonic girl!",
                    "author": "prettylilprostitute",
                    "id": "fxk2oj5",
                    "parent_id": "t1_fxjzpn2",
                    "score": -8,
                    "created_utc": 1594406397.0,
                    "replies": [
                        {
                            "body": "How??!! What do you even say?! M&gs too?",
                            "author": "ophiserys",
                            "id": "fxk2teu",
                            "parent_id": "t1_fxk2oj5",
                            "score": -1,
                            "created_utc": 1594406463.0,
                            "replies": [
                                {
                                    "body": "Don't do this, you will lose more legit opportunities with actual SDs than you will gain in the few guys that are willing to pay for platonic dates.",
                                    "author": "storm170",
                                    "id": "fxkbiq8",
                                    "parent_id": "t1_fxk2teu",
                                    "score": 2,
                                    "created_utc": 1594410759.0,
                                    "replies": []
                                },
                                {
                                    "body": "Unlikely to get paid for M&Gs.\n\nBefore an arrangement starts, you may want to ask about platonic dates and comp for them.  If he's open to it, he may do so but not at full PPM.\n\nCourse if you're on allowance, platonic/intimate dates are being paid regardless.",
                                    "author": "Church42",
                                    "id": "fxk3qps",
                                    "parent_id": "t1_fxk2teu",
                                    "score": 1,
                                    "created_utc": 1594406907.0,
                                    "replies": []
                                },
                                {
                                    "body": "I don’t use SA girl. It seems normal for M&Gs to be unpaid which is why I won’t be joining SA. \n\nBut any date even platonic after an arrangement is set should be paid (until allowance).",
                                    "author": "prettylilprostitute",
                                    "id": "fxkb8fs",
                                    "parent_id": "t1_fxk2teu",
                                    "score": 0,
                                    "created_utc": 1594410615.0,
                                    "replies": [
                                        {
                                            "body": "What do you do instead of SA???",
                                            "author": "ophiserys",
                                            "id": "fxkcdz5",
                                            "parent_id": "t1_fxkb8fs",
                                            "score": 2,
                                            "created_utc": 1594411196.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "But her point was that he brags about being a self starter, but would he have made it so far if he had graduated from college 100k in debt and unable to get a business loan instead of debt free and with a gift of 30k to start his business? People who have such immense privilege and deny so vehemently that it had any bearing on the success they claim as solely their own are hyprocrites and liars.\n\nHe might be great at business, but the point is that he may not have been able to start that business if he had had to work his way through college. It’s not a crime to have privilege, but to deny that it had some part in one’s current success is obtuse, at best.",
            "author": "lasswithaleash",
            "id": "fxl36wd",
            "parent_id": "t1_fxkwkaf",
            "score": 7,
            "created_utc": 1594425598.0,
            "replies": []
        },
        {
            "body": "Oppps did I say that \"out loud\"?!? Maybe just screen better!!",
            "author": "tankbinding",
            "id": "fxl0x46",
            "parent_id": "t1_fxl0umv",
            "score": 1,
            "created_utc": 1594424259.0,
            "replies": []
        },
        {
            "body": "THERE YOU GO",
            "author": "ophiserys",
            "id": "fxkdguo",
            "parent_id": "t1_fxkda4i",
            "score": 3,
            "created_utc": 1594411743.0,
            "replies": [
                {
                    "body": "Thanks for downvoting me for pointing out your error.",
                    "author": "UseTheForceRey",
                    "id": "fxkdo1m",
                    "parent_id": "t1_fxkdguo",
                    "score": -2,
                    "created_utc": 1594411842.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "That’s literally just being cheap man, why would you want to confidently lowball..... sure don’t be generous at work but don’t mix pleasure with business, if you want to be a real SD you Need to be generous, not cheap",
            "author": "ophiserys",
            "id": "fxk9sl3",
            "parent_id": "t1_fxk4u82",
            "score": 6,
            "created_utc": 1594409895.0,
            "replies": [
                {
                    "body": "I think (hope) he’s being sarcastic?",
                    "author": "BGDDDY1",
                    "id": "fxkqjgq",
                    "parent_id": "t1_fxk9sl3",
                    "score": 5,
                    "created_utc": 1594418499.0,
                    "replies": [
                        {
                            "body": "Right? Otherwise way to out yourself as being cheap in the worst sub reddit to do so lol",
                            "author": "ophiserys",
                            "id": "fxkwnww",
                            "parent_id": "t1_fxkqjgq",
                            "score": 2,
                            "created_utc": 1594421843.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "That’s not what this post was about it was literally just a complaint about a shitty SD, I literally work 90 hours a week and my ‘leisure time’ is spent making sure I don’t die because of an autoimmune disease ...... I have met significantly more sds who came from wealth than ones that came from nothing",
            "author": "ophiserys",
            "id": "fxl5pq7",
            "parent_id": "t1_fxl4s2r",
            "score": 2,
            "created_utc": 1594427097.0,
            "replies": []
        },
        {
            "body": "Something something \\*trickle down economics\\*",
            "author": "_Fortuna_",
            "id": "fxlk1f0",
            "parent_id": "t1_fxkhzpb",
            "score": 11,
            "created_utc": 1594436002.0,
            "replies": []
        },
        {
            "body": "Yeah that just makes this particular guy worse.",
            "author": "ZonaCouple",
            "id": "fxk85n0",
            "parent_id": "t1_fxjzwcw",
            "score": 6,
            "created_utc": 1594409076.0,
            "replies": []
        },
        {
            "body": "I know, I’m the total package. 🤪",
            "author": "garret6758",
            "id": "fxnvadr",
            "parent_id": "t1_fxl7h2u",
            "score": 1,
            "created_utc": 1594472248.0,
            "replies": []
        },
        {
            "body": "My eyes would roll back into my head",
            "author": "highjinx411",
            "id": "fxmtdik",
            "parent_id": "t1_fxl29on",
            "score": 1,
            "created_utc": 1594455078.0,
            "replies": []
        },
        {
            "body": "It it’s something related to racism or what they are saying is like really inappropriate then I wouldn’t agree and I would be very up front with my feelings about it. But something like that is just annoying and I would let it go. It depends on the guy if I’ll have dialogue. I’m not going to change my opinion or talk as though I agree but I wouldn’t debate it.. if that makes sense.",
            "author": "prettylilprostitute",
            "id": "fxk2na9",
            "parent_id": "t1_fxk241a",
            "score": 0,
            "created_utc": 1594406381.0,
            "replies": [
                {
                    "body": "Yeah, I get it. Sometimes, it's just not worth the effort, but I definitely wouldn't be in an arrangement with a man like that. Hah.",
                    "author": "1SweetCheeks",
                    "id": "fxk3e5s",
                    "parent_id": "t1_fxk2na9",
                    "score": 5,
                    "created_utc": 1594406739.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Do you feel like you're going to be annoyed, grossed out, offended all the time with this man? If so, next him. I know some need the money, but I doubt it's worth your mental health.",
            "author": "1SweetCheeks",
            "id": "fxk2976",
            "parent_id": "t1_fxjzpn2",
            "score": 4,
            "created_utc": 1594406195.0,
            "replies": [
                {
                    "body": "Oh yeah no blocked him fuck that",
                    "author": "ophiserys",
                    "id": "fxk2vbm",
                    "parent_id": "t1_fxk2976",
                    "score": 5,
                    "created_utc": 1594406489.0,
                    "replies": [
                        {
                            "body": "🙌🏻",
                            "author": "1SweetCheeks",
                            "id": "fxk31zw",
                            "parent_id": "t1_fxk2vbm",
                            "score": 2,
                            "created_utc": 1594406578.0,
                            "replies": []
                        },
                        {
                            "body": "Good move, you don’t need that noise.",
                            "author": "SunnyWinter85",
                            "id": "fxk42zo",
                            "parent_id": "t1_fxk2vbm",
                            "score": 2,
                            "created_utc": 1594407071.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Get paid for platonic girl!",
            "author": "prettylilprostitute",
            "id": "fxk2oj5",
            "parent_id": "t1_fxjzpn2",
            "score": -8,
            "created_utc": 1594406397.0,
            "replies": [
                {
                    "body": "How??!! What do you even say?! M&gs too?",
                    "author": "ophiserys",
                    "id": "fxk2teu",
                    "parent_id": "t1_fxk2oj5",
                    "score": -1,
                    "created_utc": 1594406463.0,
                    "replies": [
                        {
                            "body": "Don't do this, you will lose more legit opportunities with actual SDs than you will gain in the few guys that are willing to pay for platonic dates.",
                            "author": "storm170",
                            "id": "fxkbiq8",
                            "parent_id": "t1_fxk2teu",
                            "score": 2,
                            "created_utc": 1594410759.0,
                            "replies": []
                        },
                        {
                            "body": "Unlikely to get paid for M&Gs.\n\nBefore an arrangement starts, you may want to ask about platonic dates and comp for them.  If he's open to it, he may do so but not at full PPM.\n\nCourse if you're on allowance, platonic/intimate dates are being paid regardless.",
                            "author": "Church42",
                            "id": "fxk3qps",
                            "parent_id": "t1_fxk2teu",
                            "score": 1,
                            "created_utc": 1594406907.0,
                            "replies": []
                        },
                        {
                            "body": "I don’t use SA girl. It seems normal for M&Gs to be unpaid which is why I won’t be joining SA. \n\nBut any date even platonic after an arrangement is set should be paid (until allowance).",
                            "author": "prettylilprostitute",
                            "id": "fxkb8fs",
                            "parent_id": "t1_fxk2teu",
                            "score": 0,
                            "created_utc": 1594410615.0,
                            "replies": [
                                {
                                    "body": "What do you do instead of SA???",
                                    "author": "ophiserys",
                                    "id": "fxkcdz5",
                                    "parent_id": "t1_fxkb8fs",
                                    "score": 2,
                                    "created_utc": 1594411196.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Thanks for downvoting me for pointing out your error.",
            "author": "UseTheForceRey",
            "id": "fxkdo1m",
            "parent_id": "t1_fxkdguo",
            "score": -2,
            "created_utc": 1594411842.0,
            "replies": []
        },
        {
            "body": "I think (hope) he’s being sarcastic?",
            "author": "BGDDDY1",
            "id": "fxkqjgq",
            "parent_id": "t1_fxk9sl3",
            "score": 5,
            "created_utc": 1594418499.0,
            "replies": [
                {
                    "body": "Right? Otherwise way to out yourself as being cheap in the worst sub reddit to do so lol",
                    "author": "ophiserys",
                    "id": "fxkwnww",
                    "parent_id": "t1_fxkqjgq",
                    "score": 2,
                    "created_utc": 1594421843.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yeah, I get it. Sometimes, it's just not worth the effort, but I definitely wouldn't be in an arrangement with a man like that. Hah.",
            "author": "1SweetCheeks",
            "id": "fxk3e5s",
            "parent_id": "t1_fxk2na9",
            "score": 5,
            "created_utc": 1594406739.0,
            "replies": []
        },
        {
            "body": "Oh yeah no blocked him fuck that",
            "author": "ophiserys",
            "id": "fxk2vbm",
            "parent_id": "t1_fxk2976",
            "score": 5,
            "created_utc": 1594406489.0,
            "replies": [
                {
                    "body": "🙌🏻",
                    "author": "1SweetCheeks",
                    "id": "fxk31zw",
                    "parent_id": "t1_fxk2vbm",
                    "score": 2,
                    "created_utc": 1594406578.0,
                    "replies": []
                },
                {
                    "body": "Good move, you don’t need that noise.",
                    "author": "SunnyWinter85",
                    "id": "fxk42zo",
                    "parent_id": "t1_fxk2vbm",
                    "score": 2,
                    "created_utc": 1594407071.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "How??!! What do you even say?! M&gs too?",
            "author": "ophiserys",
            "id": "fxk2teu",
            "parent_id": "t1_fxk2oj5",
            "score": -1,
            "created_utc": 1594406463.0,
            "replies": [
                {
                    "body": "Don't do this, you will lose more legit opportunities with actual SDs than you will gain in the few guys that are willing to pay for platonic dates.",
                    "author": "storm170",
                    "id": "fxkbiq8",
                    "parent_id": "t1_fxk2teu",
                    "score": 2,
                    "created_utc": 1594410759.0,
                    "replies": []
                },
                {
                    "body": "Unlikely to get paid for M&Gs.\n\nBefore an arrangement starts, you may want to ask about platonic dates and comp for them.  If he's open to it, he may do so but not at full PPM.\n\nCourse if you're on allowance, platonic/intimate dates are being paid regardless.",
                    "author": "Church42",
                    "id": "fxk3qps",
                    "parent_id": "t1_fxk2teu",
                    "score": 1,
                    "created_utc": 1594406907.0,
                    "replies": []
                },
                {
                    "body": "I don’t use SA girl. It seems normal for M&Gs to be unpaid which is why I won’t be joining SA. \n\nBut any date even platonic after an arrangement is set should be paid (until allowance).",
                    "author": "prettylilprostitute",
                    "id": "fxkb8fs",
                    "parent_id": "t1_fxk2teu",
                    "score": 0,
                    "created_utc": 1594410615.0,
                    "replies": [
                        {
                            "body": "What do you do instead of SA???",
                            "author": "ophiserys",
                            "id": "fxkcdz5",
                            "parent_id": "t1_fxkb8fs",
                            "score": 2,
                            "created_utc": 1594411196.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Right? Otherwise way to out yourself as being cheap in the worst sub reddit to do so lol",
            "author": "ophiserys",
            "id": "fxkwnww",
            "parent_id": "t1_fxkqjgq",
            "score": 2,
            "created_utc": 1594421843.0,
            "replies": []
        },
        {
            "body": "🙌🏻",
            "author": "1SweetCheeks",
            "id": "fxk31zw",
            "parent_id": "t1_fxk2vbm",
            "score": 2,
            "created_utc": 1594406578.0,
            "replies": []
        },
        {
            "body": "Good move, you don’t need that noise.",
            "author": "SunnyWinter85",
            "id": "fxk42zo",
            "parent_id": "t1_fxk2vbm",
            "score": 2,
            "created_utc": 1594407071.0,
            "replies": []
        },
        {
            "body": "Don't do this, you will lose more legit opportunities with actual SDs than you will gain in the few guys that are willing to pay for platonic dates.",
            "author": "storm170",
            "id": "fxkbiq8",
            "parent_id": "t1_fxk2teu",
            "score": 2,
            "created_utc": 1594410759.0,
            "replies": []
        },
        {
            "body": "Unlikely to get paid for M&Gs.\n\nBefore an arrangement starts, you may want to ask about platonic dates and comp for them.  If he's open to it, he may do so but not at full PPM.\n\nCourse if you're on allowance, platonic/intimate dates are being paid regardless.",
            "author": "Church42",
            "id": "fxk3qps",
            "parent_id": "t1_fxk2teu",
            "score": 1,
            "created_utc": 1594406907.0,
            "replies": []
        },
        {
            "body": "I don’t use SA girl. It seems normal for M&Gs to be unpaid which is why I won’t be joining SA. \n\nBut any date even platonic after an arrangement is set should be paid (until allowance).",
            "author": "prettylilprostitute",
            "id": "fxkb8fs",
            "parent_id": "t1_fxk2teu",
            "score": 0,
            "created_utc": 1594410615.0,
            "replies": [
                {
                    "body": "What do you do instead of SA???",
                    "author": "ophiserys",
                    "id": "fxkcdz5",
                    "parent_id": "t1_fxkb8fs",
                    "score": 2,
                    "created_utc": 1594411196.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "What do you do instead of SA???",
            "author": "ophiserys",
            "id": "fxkcdz5",
            "parent_id": "t1_fxkb8fs",
            "score": 2,
            "created_utc": 1594411196.0,
            "replies": []
        }
    ]
}