{
    "title": "POTS who can’t take a hint",
    "post_id": "bzr8mk",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/bzr8mk/pots_who_cant_take_a_hint/",
    "author": "GabR156",
    "body": "I had a  m&g last week with a very domineering and misogynistic man who was pretty good at making himself appear otherwise. When I told him that I needed at least some form of ppm before I joined him at his house he launched into a rant about “not buying a time share in Maui if I haven’t ever been to the island.” \nI wished him well and he came back with it being too much about money/ he wasn’t an atm and that wasn’t how he worked- so typical, AND about how he thought I was really immature. \n\nHe said something like “I deal with professionals all day at work and you, my dear, are an amateur.”\n\nAs well as\n\n“Frankly, it was a huge red flag this morning when you decided it was more important to run mundane errands than to spend 2 hours in the woods with me. As I said last evening...people do what they want to do. You demonstrated to me where I fit on your hierarchy of importance which grew my concerns.” \n\nAll because I choose to finish a paper and go running rather than hang out behind his house in the friggin woods \n\nLMAO\n\nSo last night I get a message from him on another sugar site asking if I would reconsider. Silly silly boy. I’ve met you ONE time and you’ve already lost your darn marbles. \n\nAnyone else have stories about POTs who keep coming back?",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/bzr8mk/pots_who_cant_take_a_hint/",
    "score": 130,
    "upvote_ratio": 0.95,
    "created_utc": 1560346141.0,
    "num_comments": 84,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "[removed]",
            "author": null,
            "id": "eqvmtnp",
            "parent_id": "t3_bzr8mk",
            "score": 92,
            "created_utc": 1560347132.0,
            "replies": [
                {
                    "body": "You wouldn't get murdered...he just wanted to show you where the bodies are buried. ( ͡° ͜ʖ ͡°)",
                    "author": null,
                    "id": "eqvojkf",
                    "parent_id": "t1_eqvmtnp",
                    "score": 34,
                    "created_utc": 1560347734.0,
                    "replies": [
                        {
                            "body": "Was his name Bluebeard?",
                            "author": null,
                            "id": "eqvt63s",
                            "parent_id": "t1_eqvojkf",
                            "score": 7,
                            "created_utc": 1560349345.0,
                            "replies": [
                                {
                                    "body": "I want to hug you for this reference!",
                                    "author": "curlygoddess93",
                                    "id": "er05erv",
                                    "parent_id": "t1_eqvt63s",
                                    "score": 1,
                                    "created_utc": 1560411064.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "> In the woods?\n\nhe wanted to play in the bush",
                    "author": "GSSD",
                    "id": "eqw104n",
                    "parent_id": "t1_eqvmtnp",
                    "score": 11,
                    "created_utc": 1560351955.0,
                    "replies": [
                        {
                            "body": "That’s about the only place you can find a bush these days I believe",
                            "author": "puckhead4",
                            "id": "eqw84i0",
                            "parent_id": "t1_eqw104n",
                            "score": 8,
                            "created_utc": 1560354176.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Rotfl Daryl",
                    "author": "puckhead4",
                    "id": "eqw80d5",
                    "parent_id": "t1_eqvmtnp",
                    "score": 6,
                    "created_utc": 1560354139.0,
                    "replies": []
                },
                {
                    "body": "[woods can be ok!](https://i.pinimg.com/originals/ec/25/98/ec2598189acaa18eeee0dcbbc2d5606a.jpg)",
                    "author": null,
                    "id": "eqw0xki",
                    "parent_id": "t1_eqvmtnp",
                    "score": 4,
                    "created_utc": 1560351931.0,
                    "replies": [
                        {
                            "body": "[removed]",
                            "author": null,
                            "id": "eqybwl0",
                            "parent_id": "t1_eqw0xki",
                            "score": 2,
                            "created_utc": 1560380770.0,
                            "replies": [
                                {
                                    "body": "[we can go into these kind of woods](http://www.orangesmile.com/extreme/img/main/underwater-park-gruner-see_1.jpg) 🧜‍♀️",
                                    "author": null,
                                    "id": "eqywtf2",
                                    "parent_id": "t1_eqybwl0",
                                    "score": 4,
                                    "created_utc": 1560390599.0,
                                    "replies": [
                                        {
                                            "body": "Any idea where that is? It’s so pretty",
                                            "author": "avocadosonpizza",
                                            "id": "er3f2fl",
                                            "parent_id": "t1_eqywtf2",
                                            "score": 1,
                                            "created_utc": 1560461870.0,
                                            "replies": [
                                                {
                                                    "body": "nope. I was just doing some googling for an image and found it!",
                                                    "author": null,
                                                    "id": "er3o882",
                                                    "parent_id": "t1_er3f2fl",
                                                    "score": 1,
                                                    "created_utc": 1560468209.0,
                                                    "replies": [
                                                        {
                                                            "body": "Aw dang it looked super cool",
                                                            "author": "avocadosonpizza",
                                                            "id": "er3pshj",
                                                            "parent_id": "t1_er3o882",
                                                            "score": 1,
                                                            "created_utc": 1560469424.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "While I usually think most of the girls on Seeking are a little to worried about there safety. Even I think this is insane. Hey come hang out in the woods with me, really?",
                    "author": "ZonaCouple",
                    "id": "eqwte26",
                    "parent_id": "t1_eqvmtnp",
                    "score": -11,
                    "created_utc": 1560361310.0,
                    "replies": [
                        {
                            "body": "There’s no such thing as *too worried about their safety*. That kind of attitude is how bad situations and violence against them happens; and then when they go missing due to being too trusting it’s *”why wasn’t she more concerned about her safety?”* \n\nTurn on the news. We can never be too safe. This was just a beyond ignorant statement.",
                            "author": "RussianAsshole",
                            "id": "eqx6ke6",
                            "parent_id": "t1_eqwte26",
                            "score": 26,
                            "created_utc": 1560365726.0,
                            "replies": [
                                {
                                    "body": "No it's gone to an extreme because of the news. We live in an era of some of the lowest violent crime rates in the countries history. There are fewer murders, and kidnappings then since the 1950s.\n\nI don't mind being safe but some girls take it way to far. Like someone is going to try to kidnap you at a Starbucks in broad daylight? So you have to bring a friend come on its just ridiculous.",
                                    "author": "ZonaCouple",
                                    "id": "eqxdec4",
                                    "parent_id": "t1_eqx6ke6",
                                    "score": -6,
                                    "created_utc": 1560367911.0,
                                    "replies": [
                                        {
                                            "body": "[lowest violent crime rates in history but women are still being punched, shot, having their jaws broken, and receiving threats to have their pregnant wombs kicked in that same broad daylight you speak of at the hands of men who swear there’s no reason to be afraid of them and don’t understand why we care more about our safety than their feelings.](https://www.mic.com/articles/135394/14-women-were-brutally-attacked-for-rejecting-men-why-arent-we-talking-about-it)\n\n\nLowest crime rates but we’re still huge targets for unwarranted violence while being told that we have little to worry about. And these are only the *reported* cases.",
                                            "author": "RussianAsshole",
                                            "id": "eqxgfx8",
                                            "parent_id": "t1_eqxdec4",
                                            "score": 12,
                                            "created_utc": 1560369015.0,
                                            "replies": [
                                                {
                                                    "body": "Of course violence still exists and always will. But it's rare for that to happen between strangers and I am sure that vast majority is domestic abuse. You don't think there was a hell of alot more unreported abuse and violence against women in the 60s and 70s then today? You think the black girl who was raped in the 60s got any attention or even a police report filed in Alabama back then? Come on.",
                                                    "author": "ZonaCouple",
                                                    "id": "eqxj7qs",
                                                    "parent_id": "t1_eqxgfx8",
                                                    "score": -3,
                                                    "created_utc": 1560370109.0,
                                                    "replies": [
                                                        {
                                                            "body": "Um what lmao. The abuses of the 60s and 70s matter just as the ones in the present day do. My point is that you’ve said we’re much safer now and I disproved that, betraying your original point. Sounds a lot like “you should be okay with the abuses women suffer today, you should be grateful you aren’t in the 60s when you would’ve been treated even worse despite the present day abuses still being abhorrent!”. Seems like you’re being obtuse on purpose and purposely missing the point so hey, thanks for proving me right.",
                                                            "author": "RussianAsshole",
                                                            "id": "eqxjuqn",
                                                            "parent_id": "t1_eqxj7qs",
                                                            "score": 6,
                                                            "created_utc": 1560370436.0,
                                                            "replies": [
                                                                {
                                                                    "body": "No you haven't anyway you cut the cake the crime rates are lower now then then they were. Saying tons of crime goes unreported today only works if you assume all crime was reported in the 60s and 70s which of course it wasn't. The United States is significantly safer today then it was even 20 years ago. That's easily verifiable through the FBI statistics.",
                                                                    "author": "ZonaCouple",
                                                                    "id": "eqxr1c6",
                                                                    "parent_id": "t1_eqxjuqn",
                                                                    "score": -1,
                                                                    "created_utc": 1560372891.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "Oh gosh, could a correlation possibly exist between these historically low crime rates and our current medias' emphases on this 'can't be too safe' rhetoric?? Hm...",
                                                                            "author": "cldavisch",
                                                                            "id": "er0hw2h",
                                                                            "parent_id": "t1_eqxr1c6",
                                                                            "score": 3,
                                                                            "created_utc": 1560417181.0,
                                                                            "replies": []
                                                                        },
                                                                        {
                                                                            "body": "There are only two crimes for which accurate statistics are maintained   \n\nmurder because there is almost always a body  \n\nand\n\nBank Robbery because it must be reported to the feds and is almost always on tape. \n\nBoth dipped after citizens initiated 3 strike laws but have risen significantly  over the past decade.  \n\nCalifornia's catch and release programs have also spawned a vast underreporting of serious but not fatal crimes.  Twenty years ago it was far easier to get crime reports filed. \n\n\nWhile the left is obsessed with gun control they conveniently ignore the fact that the ANNUAL losses from opiate abuse (including synthetics) exceeds our total losses during the 10 year Vietnam war",
                                                                            "author": "pinotandsugar",
                                                                            "id": "er223gi",
                                                                            "parent_id": "t1_eqxr1c6",
                                                                            "score": 0,
                                                                            "created_utc": 1560439316.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": ">Both dipped after citizens initiated 3 strike laws but have risen significantly over the past decade. \n\nAny source for murders going up in the last 10 years? Bank robberies don't really apply to sugar babies. Also not all states have 3 strike laws. \n\n>California's catch and release programs have also spawned a vast underreporting of serious but not fatal crimes. Twenty years ago it was far easier to get crime reports filed. \n\nAgain any source? I just heard a big thing on NPR about how crimes are reported much faster and better then ever before. Because of cell phone use since the 90s going up. Not to mention by almost every statistic all crimes but property and rape (they changed the way it was defined) have been going down for years. Plus every cop that worked in the 80s and 90s will tell you it's way better then back then. With a few cities excluded for local reasons. \n\n>While the left is obsessed with gun control they conveniently ignore the fact that the ANNUAL losses from opiate abuse (including synthetics) exceeds our total losses during the 10 year Vietnam war\n\nAh never mind your one of those.",
                                                                                    "author": "ZonaCouple",
                                                                                    "id": "er3hd1j",
                                                                                    "parent_id": "t1_er223gi",
                                                                                    "score": 1,
                                                                                    "created_utc": 1560463271.0,
                                                                                    "replies": [
                                                                                        {
                                                                                            "body": "Crimes may be \"reported to the police \"  but they do not make the \"reported crime\" stats until the police fill out and file a crime report.  For departments like LAPD this is a major effort unless there is a dead body or somebody headed for the hospital.",
                                                                                            "author": "pinotandsugar",
                                                                                            "id": "er3n7wd",
                                                                                            "parent_id": "t1_er3hd1j",
                                                                                            "score": 0,
                                                                                            "created_utc": 1560467403.0,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "body": "Okay.",
                                                                                                    "author": "ZonaCouple",
                                                                                                    "id": "er3nfp8",
                                                                                                    "parent_id": "t1_er3n7wd",
                                                                                                    "score": 1,
                                                                                                    "created_utc": 1560467578.0,
                                                                                                    "replies": []
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "You think women are too concerned with their safety when they are meeting up with a lot of very entitled wealthy men? A lot of whom aren’t used to having to deal with negative consequences???? I’m not trying to be rude but you must be a man. We can’t even go for a walk at night with the dog without being concerned and bringing pepper spray or a gun. There is no such thing as being TOO CONCERNED when it comes to your life.",
                            "author": "sugarbabyhopeful",
                            "id": "eqxabxl",
                            "parent_id": "t1_eqwte26",
                            "score": 26,
                            "created_utc": 1560366953.0,
                            "replies": [
                                {
                                    "body": "These SD men are the most entitled, whiny, selfish people I’ve ever met. My sweet toddler cousin doesn’t throw nearly the tantrum that they do when they don’t get what they want. These men will assault you and put you in life threatening danger if you don’t give them what they want because they’ve never had to hear no once in their life and are used to getting whatever they want and we’re too concerned about something as crucial as our safety?? Men have no empathy for us and no desire to learn about what we go through and how our safety is constantly at risk.\n\n\nMen. I expect the worst and you still find a way to disappoint.",
                                    "author": "RussianAsshole",
                                    "id": "eqxdlqy",
                                    "parent_id": "t1_eqxabxl",
                                    "score": 17,
                                    "created_utc": 1560367976.0,
                                    "replies": []
                                },
                                {
                                    "body": "I am a women and you only think the world is out to get you. Everytime I have been hit or abused it was by a family member or boyfriend not a stranger. Strangers are usually the ones who want to help. I have never had an issue on a first date or a hookup. I have never had a problem walking alone no matter what part of town I was in. Cat called sure but no actual issues.",
                                    "author": "ZonaCouple",
                                    "id": "eqxiumv",
                                    "parent_id": "t1_eqxabxl",
                                    "score": -3,
                                    "created_utc": 1560369917.0,
                                    "replies": [
                                        {
                                            "body": "Just because you haven’t doesn’t mean most others haven’t either. Some of these “sugar daddies” are creepy old douche canoes who literally HAVE to buy women’s attention. Clearly you are very sheltered and that’s great for you but please, value your safety more and don’t be so naive. Especially when dealing with men who aren’t used to the word no",
                                            "author": "sugarbabyhopeful",
                                            "id": "eqxlxl8",
                                            "parent_id": "t1_eqxiumv",
                                            "score": 15,
                                            "created_utc": 1560371164.0,
                                            "replies": [
                                                {
                                                    "body": "“It doesn’t happen to me therefore it doesn’t happen” imagine living in the city that's the capital of catcalling and strange men harassing you in this country yet being told that this barely ever happens when I’ve experienced it and so have all of my female friends at one point, and despite not knowing what part of the country you live in unfortunately I can bet on you experiencing the same. the link I posted would also beg to differ about violence strangers lmao. Girl you said nothing but the truth in response.",
                                                    "author": "RussianAsshole",
                                                    "id": "eqxot6j",
                                                    "parent_id": "t1_eqxlxl8",
                                                    "score": 12,
                                                    "created_utc": 1560372111.0,
                                                    "replies": [
                                                        {
                                                            "body": "Isn't NYC like of the safest cities on the planet by crime rates? I mean you should have gone with Chicago or Detroit or something. Being catcalled and harassed is no where near the same thing as abuse. Every women gets catcalled and told disgusting things or sent unsolicited dick pics. Unfortunately that's just life, buys it's far from abuse or murder or kidnapping.",
                                                            "author": "ZonaCouple",
                                                            "id": "eqxqmvq",
                                                            "parent_id": "t1_eqxot6j",
                                                            "score": 0,
                                                            "created_utc": 1560372749.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "body": "And lots of those daddies have been robbed and beat up by the girls real boyfriends, It goes both ways trust me. walking around in fear thinking things are going to happen to you just makes you a victim before it happens. \n\nI can promise you I have seen things and lived places you have only heard about. I am the furthest thing from sheltered. It's more likely that your sheltered, privileged upbringing has made you scared of your own shadow.",
                                                    "author": "ZonaCouple",
                                                    "id": "eqxq7eh",
                                                    "parent_id": "t1_eqxlxl8",
                                                    "score": 0,
                                                    "created_utc": 1560372601.0,
                                                    "replies": [
                                                        {
                                                            "body": "[deleted]",
                                                            "author": null,
                                                            "id": "eqxxwcf",
                                                            "parent_id": "t1_eqxq7eh",
                                                            "score": 0,
                                                            "created_utc": 1560375182.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Well your the hopeful and I married my SD so apparently it does.",
                                                                    "author": "ZonaCouple",
                                                                    "id": "eqxyrxk",
                                                                    "parent_id": "t1_eqxxwcf",
                                                                    "score": 3,
                                                                    "created_utc": 1560375484.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "I am a hopeful. I don’t need to marry one 🤷🏻‍♀️",
                                                                            "author": "sugarbabyhopeful",
                                                                            "id": "eqxz3oo",
                                                                            "parent_id": "t1_eqxyrxk",
                                                                            "score": 3,
                                                                            "created_utc": 1560375590.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "I didn't need to marry him just wanted too. But keep trying you might get lucky.",
                                                                                    "author": "ZonaCouple",
                                                                                    "id": "eqy0fs3",
                                                                                    "parent_id": "t1_eqxz3oo",
                                                                                    "score": 3,
                                                                                    "created_utc": 1560376047.0,
                                                                                    "replies": [
                                                                                        {
                                                                                            "body": "No thank you. I don’t buy human beings from Walmart... I respected you and your decisions until that ☹️",
                                                                                            "author": "sugarbabyhopeful",
                                                                                            "id": "eqy18zx",
                                                                                            "parent_id": "t1_eqy0fs3",
                                                                                            "score": 1,
                                                                                            "created_utc": 1560376313.0,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "body": "Mmm, so much fun though.",
                                                                                                    "author": "ZonaCouple",
                                                                                                    "id": "eqy2w49",
                                                                                                    "parent_id": "t1_eqy18zx",
                                                                                                    "score": 1,
                                                                                                    "created_utc": 1560376880.0,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "body": "what was this whole thread. lmao.",
                                                                                                            "author": "curlygoddess93",
                                                                                                            "id": "er05ojy",
                                                                                                            "parent_id": "t1_eqy2w49",
                                                                                                            "score": 1,
                                                                                                            "created_utc": 1560411200.0,
                                                                                                            "replies": []
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "body": "This is a bit like saying \"I have never had an issue not wearing a seatbelt in a car.\" \n\nIt seems to work fine, until you're dead and can no longer post on message boards about how your risky approach works just fine.",
                                            "author": "antonivs",
                                            "id": "eqy1srt",
                                            "parent_id": "t1_eqxiumv",
                                            "score": 3,
                                            "created_utc": 1560376504.0,
                                            "replies": [
                                                {
                                                    "body": "No it's nothing like that. It's a bit like saying I have a better chance of winning the lotto then getting struck by lightning so I am not going to be afraid to go outside in a thunderstorm.",
                                                    "author": "ZonaCouple",
                                                    "id": "eqy35hm",
                                                    "parent_id": "t1_eqy1srt",
                                                    "score": 2,
                                                    "created_utc": 1560376969.0,
                                                    "replies": [
                                                        {
                                                            "body": "On average there are more than 50 deaths from lightning per year in the US.\n\nIt's likely that 100% of the people who die from lightning strikes are those who weren't careful enough.\n\nSome simple precautions can reduce your chances of dying this way significantly. The same goes for intimate meetings with strangers.",
                                                            "author": "antonivs",
                                                            "id": "eqy6udi",
                                                            "parent_id": "t1_eqy35hm",
                                                            "score": 1,
                                                            "created_utc": 1560378355.0,
                                                            "replies": [
                                                                {
                                                                    "body": "I never said don't take precautions but alot of these girls go way overboard with them for both platonic m&g and sexy fun time. Acting as if a handful of girls a day gets taken off the streets randomly. It just doesn't happen that often. \n\nI am not going to be scared to go out in a thunderstorm, but I am not going to play golf through one. There is some common sense involved.",
                                                                    "author": "ZonaCouple",
                                                                    "id": "eqyavht",
                                                                    "parent_id": "t1_eqy6udi",
                                                                    "score": 3,
                                                                    "created_utc": 1560380276.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Oh Jesus Christ. He was hoping he could gaslight you into feeling guilty and letting him ravage your sexy bod. Good for you for sticking to your guns!",
            "author": "slinkyinthebag",
            "id": "eqvmm10",
            "parent_id": "t3_bzr8mk",
            "score": 36,
            "created_utc": 1560347067.0,
            "replies": [
                {
                    "body": "😂 I wish I could insert a photo because I don’t think Ol’ Stuart Little could ravage his way out of a paper bag",
                    "author": "GabR156",
                    "id": "eqvmrln",
                    "parent_id": "t1_eqvmm10",
                    "score": 40,
                    "created_utc": 1560347115.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "What a weirdo. Thank goodness you know better not to agree to such unreasonable requests from an entitled man.",
            "author": null,
            "id": "eqvmcmr",
            "parent_id": "t3_bzr8mk",
            "score": 20,
            "created_utc": 1560346986.0,
            "replies": []
        },
        {
            "body": ">not buying a timeshare in Maui if I haven’t ever been to the island.\n\nYou are not \"buying\" something, asshole.  You are paying for her time.\n\nI read so many of these from both sides, I'm beginning to think I'm too nice for the Bowl.  Might have to go back to vanilla dating as much of a shitshow as that is.",
            "author": "soicansaywhatiwant",
            "id": "eqwrsf7",
            "parent_id": "t3_bzr8mk",
            "score": 17,
            "created_utc": 1560360753.0,
            "replies": [
                {
                    "body": "I've learned to accept that there are fakes, flakes, scammers and crazies on both sides in the bowl.   Ive found there are also real genuine honest SBs and SDs. \n\nI maintain my guard and protect myself against the pretenders, but dont allow myrself to become jaded and overlook the real thing.\n\nIt's a balance.",
                    "author": "willfromvb",
                    "id": "eqx40op",
                    "parent_id": "t1_eqwrsf7",
                    "score": 6,
                    "created_utc": 1560364887.0,
                    "replies": []
                },
                {
                    "body": "Right? A lot of the phrasing and things I read like this play a large part in stopping me from entering the bowl altogether. Yes, money is being exchanged, but let’s not talk about it like it’s some benign financial transaction or like you’re buying or renting a piece of property... she’s a human dude. \n\nJust try to remind yourself that oftentimes it’s just semantics (hopefully) and some of us are just big softies who need to ignore things like that to cope lol.",
                    "author": "LaLaLiiisa",
                    "id": "eqxvr76",
                    "parent_id": "t1_eqwrsf7",
                    "score": 5,
                    "created_utc": 1560374481.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Lmao these men think women want to spend time with them for their winning personalities??? Please be serious 😒",
            "author": "yelenagrant",
            "id": "eqwmw8o",
            "parent_id": "t3_bzr8mk",
            "score": 11,
            "created_utc": 1560359056.0,
            "replies": []
        },
        {
            "body": "“not buying a time share in Maui if I haven’t ever been to the island.” \n\nThat's a new one. I go with \"don't buy the cow if you haven't tasted the milk\" \n\nHe's hitting all the red pill dictums.",
            "author": "GSSD",
            "id": "eqw1i29",
            "parent_id": "t3_bzr8mk",
            "score": 24,
            "created_utc": 1560352109.0,
            "replies": [
                {
                    "body": "My favorite thing is specifically calling them out on the ideologies they use. “You’ve read The Game/follow The Red Pill philosophy?” Always catchs them off guard because they never expect you to do a play-by-play of the strategy they’re trying to use.",
                    "author": "RussianAsshole",
                    "id": "eqxed4k",
                    "parent_id": "t1_eqw1i29",
                    "score": 15,
                    "created_utc": 1560368223.0,
                    "replies": []
                },
                {
                    "body": "\"Why buy the car when you haven't test driven it yet?\" Lol",
                    "author": "smol_chan",
                    "id": "eqwwat7",
                    "parent_id": "t1_eqw1i29",
                    "score": 2,
                    "created_utc": 1560362320.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "When people show you who they are... believe them.  I’m not paying a full ppm for the meet and greet but if I want to move forward after the M&G then a intimate date with ppm is expected.  If we don’t click then at least nobody feels slighted.",
            "author": "LotBuilder",
            "id": "eqwf0gf",
            "parent_id": "t3_bzr8mk",
            "score": 13,
            "created_utc": 1560356352.0,
            "replies": [
                {
                    "body": "Exactly this!  \n\nThis guy knows this too, but is trying to manipulate women into free sex.  I believe there are even well off men who do this as a power play not because they cant afford to pay.",
                    "author": "willfromvb",
                    "id": "eqx33l7",
                    "parent_id": "t1_eqwf0gf",
                    "score": 10,
                    "created_utc": 1560364584.0,
                    "replies": [
                        {
                            "body": "Totally.  There are guys that have a lot of resentment from decades of women ignoring them so when they get a little money they try to turn the tables.    It wouldn’t make me feel good about myself.",
                            "author": "LotBuilder",
                            "id": "eqx9z7g",
                            "parent_id": "t1_eqx33l7",
                            "score": 7,
                            "created_utc": 1560366843.0,
                            "replies": [
                                {
                                    "body": ">  There are guys that have a lot of resentment from decades of women ignoring them so when they get a little money they try to turn the tables\n\nI really believe this is a huge part of it.",
                                    "author": "pintodinosaur",
                                    "id": "eqxvrpu",
                                    "parent_id": "t1_eqx9z7g",
                                    "score": 5,
                                    "created_utc": 1560374486.0,
                                    "replies": [
                                        {
                                            "body": "It has to be.  How does someone have enough anger and venom in them to try to get over on some 22 year old girl.  I won’t pretend all of my SB’s are perfect angels but they were just young ladies trying to get by in a world of fractured families, crushing student loan debt and guys their age that bring little to the table beyond video game and porn addiction.   There is no reason to get over on them because a dude couldn’t get laid 25 years ago when he was 19.  It’s not her fault.",
                                            "author": "LotBuilder",
                                            "id": "eqy4ahh",
                                            "parent_id": "t1_eqxvrpu",
                                            "score": 6,
                                            "created_utc": 1560377368.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "POT = Pervy Old Twat?",
            "author": null,
            "id": "eqxv28k",
            "parent_id": "t3_bzr8mk",
            "score": 11,
            "created_utc": 1560374258.0,
            "replies": []
        },
        {
            "body": "blockkkk and move on. It blows my mind how pathetic and fragile some of these dudes’ egos are.",
            "author": "vulgarlydebonair",
            "id": "eqvqzg1",
            "parent_id": "t3_bzr8mk",
            "score": 18,
            "created_utc": 1560348593.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "eqw36rg",
                    "parent_id": "t1_eqvqzg1",
                    "score": 12,
                    "created_utc": 1560352636.0,
                    "replies": [
                        {
                            "body": "Yes! It’s so refreshing to hear a man admit this. Men are far more emotional. For proof, see how men react when they get rejected.\n\n Their egos are far more fragile. Their reactions when you state *just that* are all the proof you need.",
                            "author": "RussianAsshole",
                            "id": "eqxeop2",
                            "parent_id": "t1_eqw36rg",
                            "score": 8,
                            "created_utc": 1560368336.0,
                            "replies": []
                        },
                        {
                            "body": "I have to read something academic to truly believe this one",
                            "author": "puckhead4",
                            "id": "eqw8bhc",
                            "parent_id": "t1_eqw36rg",
                            "score": -3,
                            "created_utc": 1560354242.0,
                            "replies": []
                        },
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "eqx60wp",
                            "parent_id": "t1_eqw36rg",
                            "score": -4,
                            "created_utc": 1560365547.0,
                            "replies": [
                                {
                                    "body": "[But were you punched twice in the face, killed, have your jaw broken, get shot, or threatened to have the baby in your womb kicked?](https://www.mic.com/articles/135394/14-women-were-brutally-attacked-for-rejecting-men-why-arent-we-talking-about-it)",
                                    "author": "RussianAsshole",
                                    "id": "eqxfcr1",
                                    "parent_id": "t1_eqx60wp",
                                    "score": 2,
                                    "created_utc": 1560368563.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "that part. and hence, the need for wealth to overcompensate for their lack of everything else. in this case, morality and common sense. lmao.",
                    "author": "curlygoddess93",
                    "id": "er05we8",
                    "parent_id": "t1_eqvqzg1",
                    "score": 2,
                    "created_utc": 1560411320.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Had a great M&G Monday, really got along wonderfully, hung out for a few hours, the time passed quickly. \n\nAt the end we had an electric kiss in the parking lot. Then he asked me if I'd go back to his place right then and there... but he has less than half of the ppm. \n\nI said no.\n\nHe texted me all night asking. Told him no and it's making me uncomfortable. \n\nAll the next day, same thing. Now he just wants me to come over for free.\n\nI finally said I'm not negotiating and please contact me when you're ready for the agreed upon arrangement. I am...or was...actually really into this guy.\n\nToday, same thing, still bugging me with no ppm. \n\nUgh...\n\nAt least there was no woods behind the house! That's much worse!",
            "author": "voluptuous_vanessa",
            "id": "eqxc387",
            "parent_id": "t3_bzr8mk",
            "score": 8,
            "created_utc": 1560367504.0,
            "replies": [
                {
                    "body": "Ahhhh. See I blocked the doofus from my story but he found me on another sugar site -___-",
                    "author": "GabR156",
                    "id": "eqxc904",
                    "parent_id": "t1_eqxc387",
                    "score": 7,
                    "created_utc": 1560367555.0,
                    "replies": [
                        {
                            "body": "Damn, rude and a stalker lol. What other sites are there? I only know of SA.",
                            "author": "voluptuous_vanessa",
                            "id": "eqxcl4q",
                            "parent_id": "t1_eqxc904",
                            "score": 3,
                            "created_utc": 1560367661.0,
                            "replies": []
                        },
                        {
                            "body": "Is there something out there beyond SA?",
                            "author": "sdphilly",
                            "id": "er1dycr",
                            "parent_id": "t1_eqxc904",
                            "score": 1,
                            "created_utc": 1560430510.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yeah the hell with that guy he’s full of shit you dodged a bullet miss",
            "author": "puckhead4",
            "id": "eqw7x0g",
            "parent_id": "t3_bzr8mk",
            "score": 6,
            "created_utc": 1560354110.0,
            "replies": [
                {
                    "body": "Its so endearing how you always put Miss in your comments ☺️ noticed it a couple of times",
                    "author": null,
                    "id": "eqwq5h2",
                    "parent_id": "t1_eqw7x0g",
                    "score": 3,
                    "created_utc": 1560360184.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "LOLOLOL WHAT A WEAK ASS MAN. wannabe tough and “mature” but cant fuckin handle rejection. thats basically what not taking a hint is; hitting them up again because you refuse to believe they not into you. smh. yeah no money or not, i’d never take up a hang offer behind a stranger’s house. ESPECIALLY with an ego like that.",
            "author": "minjibaby",
            "id": "eqwpbz3",
            "parent_id": "t3_bzr8mk",
            "score": 6,
            "created_utc": 1560359893.0,
            "replies": []
        },
        {
            "body": "You could have made it a shorter story.\n\nSD: \"Let's meet for a couple of hours in the woods behind my house\".\n\nSB: \"Haveanicelifebye.\"\n\nOne reason for rejecting POTS quickly when they show unacceptable behavior is it saves time.",
            "author": "highfructoseSD",
            "id": "eqz63of",
            "parent_id": "t3_bzr8mk",
            "score": 4,
            "created_utc": 1560394501.0,
            "replies": []
        },
        {
            "body": "Ugh this is taking me back to my days in the bowl....good for you for not giving in to that asshole! I’ve run into soo many guys like him who assume you’re vulnerable and they can take advantage! What a waste of time",
            "author": "waistefulfillment",
            "id": "eqwpykz",
            "parent_id": "t3_bzr8mk",
            "score": 3,
            "created_utc": 1560360118.0,
            "replies": []
        },
        {
            "body": "Well, I guess you could reply \"You, unkind sir, are an arrogant, stingy, pumping and dumping, naïve, unrealistic piece of crap, rack off\" but in my experience ranting against unreasonable people online achieves absolutely nothing and is a waste of time. Block. Move on...",
            "author": "aesthete2061",
            "id": "eqyeouj",
            "parent_id": "t3_bzr8mk",
            "score": 3,
            "created_utc": 1560382087.0,
            "replies": []
        },
        {
            "body": "Men like this are literally just little boys. You’d think he would have learnt how to handle a little rejection by now",
            "author": "ybarling",
            "id": "eqzyhvc",
            "parent_id": "t3_bzr8mk",
            "score": 3,
            "created_utc": 1560407990.0,
            "replies": [
                {
                    "body": "Hey, at least his behavior  makes for laughs on SLF.",
                    "author": "GabR156",
                    "id": "er0vkb6",
                    "parent_id": "t1_eqzyhvc",
                    "score": 1,
                    "created_utc": 1560422960.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "😂",
            "author": "love-to-lick",
            "id": "eqvkkbz",
            "parent_id": "t3_bzr8mk",
            "score": 4,
            "created_utc": 1560346353.0,
            "replies": []
        },
        {
            "body": "I can't even.",
            "author": "2fast-2curious",
            "id": "eqvrsz2",
            "parent_id": "t3_bzr8mk",
            "score": 2,
            "created_utc": 1560348874.0,
            "replies": []
        },
        {
            "body": "The reason men cant \"take hints\" is because women manipulate and lie. Dont leave 'hints', just tell the truth and be as direct as possible about everything. You shouldnt have lied to him and told him you were \"running errands\", you should have just said \"no\" and that you refuse to meet in the woods or you arent interested.  Also most SDs are not going to pay you anything online an advance - that is a ridiculous expectation. Im actually wondering why you are talking to this guy for so long - I think something is missing here from the story.",
            "author": "DoomAndSouls",
            "id": "eqznh8s",
            "parent_id": "t3_bzr8mk",
            "score": 0,
            "created_utc": 1560403146.0,
            "replies": [
                {
                    "body": "Haha ^ that’s the reason I posted- so that folks know that some grown men really walk through this world with their prefrontal cortex development somehow having halted when they were 10 years old. \n\nMy decision to do errands is what sparked his ranting about the woods and my maturity and his feelings got hurt when SURPRISE, an essential stranger wasn’t acting as if the world revolves around him. \nNothing “online in advanced.” He asked me to come over to his house at the day after we met in person. \n\nThanks for your input though hun 😂",
                    "author": "GabR156",
                    "id": "er0vhbp",
                    "parent_id": "t1_eqznh8s",
                    "score": 4,
                    "created_utc": 1560422928.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "> a very domineering and misogynistic man\n\nHow well did you vet this POS before you agreed to meet with him? Yeah I know he was pretty good at making himself appear otherwise... but...  Were your expectations aligned in your opinion? Did you ask the hard questions?\n\n&#x200B;\n\n>last night I get a message from him asking if I would reconsider\n\nHow is he able to still message you? Why did you leave the lines of communication open after such a stellar M&G??\n\n&#x200B;\n\nAre there lessons here for other SBs??",
            "author": "tankbinding",
            "id": "eqwuxz3",
            "parent_id": "t3_bzr8mk",
            "score": -1,
            "created_utc": 1560361843.0,
            "replies": [
                {
                    "body": "He messaged me on seeking, we initially met on secret benefits. A lesson- always post your funny encounters on Reddit so that all the hilarious sb’s and sd’s can post their thoughts on the sitch. 😂",
                    "author": "GabR156",
                    "id": "eqwvg84",
                    "parent_id": "t1_eqwuxz3",
                    "score": 4,
                    "created_utc": 1560362016.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "You wouldn't get murdered...he just wanted to show you where the bodies are buried. ( ͡° ͜ʖ ͡°)",
            "author": null,
            "id": "eqvojkf",
            "parent_id": "t1_eqvmtnp",
            "score": 34,
            "created_utc": 1560347734.0,
            "replies": [
                {
                    "body": "Was his name Bluebeard?",
                    "author": null,
                    "id": "eqvt63s",
                    "parent_id": "t1_eqvojkf",
                    "score": 7,
                    "created_utc": 1560349345.0,
                    "replies": [
                        {
                            "body": "I want to hug you for this reference!",
                            "author": "curlygoddess93",
                            "id": "er05erv",
                            "parent_id": "t1_eqvt63s",
                            "score": 1,
                            "created_utc": 1560411064.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "> In the woods?\n\nhe wanted to play in the bush",
            "author": "GSSD",
            "id": "eqw104n",
            "parent_id": "t1_eqvmtnp",
            "score": 11,
            "created_utc": 1560351955.0,
            "replies": [
                {
                    "body": "That’s about the only place you can find a bush these days I believe",
                    "author": "puckhead4",
                    "id": "eqw84i0",
                    "parent_id": "t1_eqw104n",
                    "score": 8,
                    "created_utc": 1560354176.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Rotfl Daryl",
            "author": "puckhead4",
            "id": "eqw80d5",
            "parent_id": "t1_eqvmtnp",
            "score": 6,
            "created_utc": 1560354139.0,
            "replies": []
        },
        {
            "body": "[woods can be ok!](https://i.pinimg.com/originals/ec/25/98/ec2598189acaa18eeee0dcbbc2d5606a.jpg)",
            "author": null,
            "id": "eqw0xki",
            "parent_id": "t1_eqvmtnp",
            "score": 4,
            "created_utc": 1560351931.0,
            "replies": [
                {
                    "body": "[removed]",
                    "author": null,
                    "id": "eqybwl0",
                    "parent_id": "t1_eqw0xki",
                    "score": 2,
                    "created_utc": 1560380770.0,
                    "replies": [
                        {
                            "body": "[we can go into these kind of woods](http://www.orangesmile.com/extreme/img/main/underwater-park-gruner-see_1.jpg) 🧜‍♀️",
                            "author": null,
                            "id": "eqywtf2",
                            "parent_id": "t1_eqybwl0",
                            "score": 4,
                            "created_utc": 1560390599.0,
                            "replies": [
                                {
                                    "body": "Any idea where that is? It’s so pretty",
                                    "author": "avocadosonpizza",
                                    "id": "er3f2fl",
                                    "parent_id": "t1_eqywtf2",
                                    "score": 1,
                                    "created_utc": 1560461870.0,
                                    "replies": [
                                        {
                                            "body": "nope. I was just doing some googling for an image and found it!",
                                            "author": null,
                                            "id": "er3o882",
                                            "parent_id": "t1_er3f2fl",
                                            "score": 1,
                                            "created_utc": 1560468209.0,
                                            "replies": [
                                                {
                                                    "body": "Aw dang it looked super cool",
                                                    "author": "avocadosonpizza",
                                                    "id": "er3pshj",
                                                    "parent_id": "t1_er3o882",
                                                    "score": 1,
                                                    "created_utc": 1560469424.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "While I usually think most of the girls on Seeking are a little to worried about there safety. Even I think this is insane. Hey come hang out in the woods with me, really?",
            "author": "ZonaCouple",
            "id": "eqwte26",
            "parent_id": "t1_eqvmtnp",
            "score": -11,
            "created_utc": 1560361310.0,
            "replies": [
                {
                    "body": "There’s no such thing as *too worried about their safety*. That kind of attitude is how bad situations and violence against them happens; and then when they go missing due to being too trusting it’s *”why wasn’t she more concerned about her safety?”* \n\nTurn on the news. We can never be too safe. This was just a beyond ignorant statement.",
                    "author": "RussianAsshole",
                    "id": "eqx6ke6",
                    "parent_id": "t1_eqwte26",
                    "score": 26,
                    "created_utc": 1560365726.0,
                    "replies": [
                        {
                            "body": "No it's gone to an extreme because of the news. We live in an era of some of the lowest violent crime rates in the countries history. There are fewer murders, and kidnappings then since the 1950s.\n\nI don't mind being safe but some girls take it way to far. Like someone is going to try to kidnap you at a Starbucks in broad daylight? So you have to bring a friend come on its just ridiculous.",
                            "author": "ZonaCouple",
                            "id": "eqxdec4",
                            "parent_id": "t1_eqx6ke6",
                            "score": -6,
                            "created_utc": 1560367911.0,
                            "replies": [
                                {
                                    "body": "[lowest violent crime rates in history but women are still being punched, shot, having their jaws broken, and receiving threats to have their pregnant wombs kicked in that same broad daylight you speak of at the hands of men who swear there’s no reason to be afraid of them and don’t understand why we care more about our safety than their feelings.](https://www.mic.com/articles/135394/14-women-were-brutally-attacked-for-rejecting-men-why-arent-we-talking-about-it)\n\n\nLowest crime rates but we’re still huge targets for unwarranted violence while being told that we have little to worry about. And these are only the *reported* cases.",
                                    "author": "RussianAsshole",
                                    "id": "eqxgfx8",
                                    "parent_id": "t1_eqxdec4",
                                    "score": 12,
                                    "created_utc": 1560369015.0,
                                    "replies": [
                                        {
                                            "body": "Of course violence still exists and always will. But it's rare for that to happen between strangers and I am sure that vast majority is domestic abuse. You don't think there was a hell of alot more unreported abuse and violence against women in the 60s and 70s then today? You think the black girl who was raped in the 60s got any attention or even a police report filed in Alabama back then? Come on.",
                                            "author": "ZonaCouple",
                                            "id": "eqxj7qs",
                                            "parent_id": "t1_eqxgfx8",
                                            "score": -3,
                                            "created_utc": 1560370109.0,
                                            "replies": [
                                                {
                                                    "body": "Um what lmao. The abuses of the 60s and 70s matter just as the ones in the present day do. My point is that you’ve said we’re much safer now and I disproved that, betraying your original point. Sounds a lot like “you should be okay with the abuses women suffer today, you should be grateful you aren’t in the 60s when you would’ve been treated even worse despite the present day abuses still being abhorrent!”. Seems like you’re being obtuse on purpose and purposely missing the point so hey, thanks for proving me right.",
                                                    "author": "RussianAsshole",
                                                    "id": "eqxjuqn",
                                                    "parent_id": "t1_eqxj7qs",
                                                    "score": 6,
                                                    "created_utc": 1560370436.0,
                                                    "replies": [
                                                        {
                                                            "body": "No you haven't anyway you cut the cake the crime rates are lower now then then they were. Saying tons of crime goes unreported today only works if you assume all crime was reported in the 60s and 70s which of course it wasn't. The United States is significantly safer today then it was even 20 years ago. That's easily verifiable through the FBI statistics.",
                                                            "author": "ZonaCouple",
                                                            "id": "eqxr1c6",
                                                            "parent_id": "t1_eqxjuqn",
                                                            "score": -1,
                                                            "created_utc": 1560372891.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Oh gosh, could a correlation possibly exist between these historically low crime rates and our current medias' emphases on this 'can't be too safe' rhetoric?? Hm...",
                                                                    "author": "cldavisch",
                                                                    "id": "er0hw2h",
                                                                    "parent_id": "t1_eqxr1c6",
                                                                    "score": 3,
                                                                    "created_utc": 1560417181.0,
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "body": "There are only two crimes for which accurate statistics are maintained   \n\nmurder because there is almost always a body  \n\nand\n\nBank Robbery because it must be reported to the feds and is almost always on tape. \n\nBoth dipped after citizens initiated 3 strike laws but have risen significantly  over the past decade.  \n\nCalifornia's catch and release programs have also spawned a vast underreporting of serious but not fatal crimes.  Twenty years ago it was far easier to get crime reports filed. \n\n\nWhile the left is obsessed with gun control they conveniently ignore the fact that the ANNUAL losses from opiate abuse (including synthetics) exceeds our total losses during the 10 year Vietnam war",
                                                                    "author": "pinotandsugar",
                                                                    "id": "er223gi",
                                                                    "parent_id": "t1_eqxr1c6",
                                                                    "score": 0,
                                                                    "created_utc": 1560439316.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": ">Both dipped after citizens initiated 3 strike laws but have risen significantly over the past decade. \n\nAny source for murders going up in the last 10 years? Bank robberies don't really apply to sugar babies. Also not all states have 3 strike laws. \n\n>California's catch and release programs have also spawned a vast underreporting of serious but not fatal crimes. Twenty years ago it was far easier to get crime reports filed. \n\nAgain any source? I just heard a big thing on NPR about how crimes are reported much faster and better then ever before. Because of cell phone use since the 90s going up. Not to mention by almost every statistic all crimes but property and rape (they changed the way it was defined) have been going down for years. Plus every cop that worked in the 80s and 90s will tell you it's way better then back then. With a few cities excluded for local reasons. \n\n>While the left is obsessed with gun control they conveniently ignore the fact that the ANNUAL losses from opiate abuse (including synthetics) exceeds our total losses during the 10 year Vietnam war\n\nAh never mind your one of those.",
                                                                            "author": "ZonaCouple",
                                                                            "id": "er3hd1j",
                                                                            "parent_id": "t1_er223gi",
                                                                            "score": 1,
                                                                            "created_utc": 1560463271.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "Crimes may be \"reported to the police \"  but they do not make the \"reported crime\" stats until the police fill out and file a crime report.  For departments like LAPD this is a major effort unless there is a dead body or somebody headed for the hospital.",
                                                                                    "author": "pinotandsugar",
                                                                                    "id": "er3n7wd",
                                                                                    "parent_id": "t1_er3hd1j",
                                                                                    "score": 0,
                                                                                    "created_utc": 1560467403.0,
                                                                                    "replies": [
                                                                                        {
                                                                                            "body": "Okay.",
                                                                                            "author": "ZonaCouple",
                                                                                            "id": "er3nfp8",
                                                                                            "parent_id": "t1_er3n7wd",
                                                                                            "score": 1,
                                                                                            "created_utc": 1560467578.0,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "You think women are too concerned with their safety when they are meeting up with a lot of very entitled wealthy men? A lot of whom aren’t used to having to deal with negative consequences???? I’m not trying to be rude but you must be a man. We can’t even go for a walk at night with the dog without being concerned and bringing pepper spray or a gun. There is no such thing as being TOO CONCERNED when it comes to your life.",
                    "author": "sugarbabyhopeful",
                    "id": "eqxabxl",
                    "parent_id": "t1_eqwte26",
                    "score": 26,
                    "created_utc": 1560366953.0,
                    "replies": [
                        {
                            "body": "These SD men are the most entitled, whiny, selfish people I’ve ever met. My sweet toddler cousin doesn’t throw nearly the tantrum that they do when they don’t get what they want. These men will assault you and put you in life threatening danger if you don’t give them what they want because they’ve never had to hear no once in their life and are used to getting whatever they want and we’re too concerned about something as crucial as our safety?? Men have no empathy for us and no desire to learn about what we go through and how our safety is constantly at risk.\n\n\nMen. I expect the worst and you still find a way to disappoint.",
                            "author": "RussianAsshole",
                            "id": "eqxdlqy",
                            "parent_id": "t1_eqxabxl",
                            "score": 17,
                            "created_utc": 1560367976.0,
                            "replies": []
                        },
                        {
                            "body": "I am a women and you only think the world is out to get you. Everytime I have been hit or abused it was by a family member or boyfriend not a stranger. Strangers are usually the ones who want to help. I have never had an issue on a first date or a hookup. I have never had a problem walking alone no matter what part of town I was in. Cat called sure but no actual issues.",
                            "author": "ZonaCouple",
                            "id": "eqxiumv",
                            "parent_id": "t1_eqxabxl",
                            "score": -3,
                            "created_utc": 1560369917.0,
                            "replies": [
                                {
                                    "body": "Just because you haven’t doesn’t mean most others haven’t either. Some of these “sugar daddies” are creepy old douche canoes who literally HAVE to buy women’s attention. Clearly you are very sheltered and that’s great for you but please, value your safety more and don’t be so naive. Especially when dealing with men who aren’t used to the word no",
                                    "author": "sugarbabyhopeful",
                                    "id": "eqxlxl8",
                                    "parent_id": "t1_eqxiumv",
                                    "score": 15,
                                    "created_utc": 1560371164.0,
                                    "replies": [
                                        {
                                            "body": "“It doesn’t happen to me therefore it doesn’t happen” imagine living in the city that's the capital of catcalling and strange men harassing you in this country yet being told that this barely ever happens when I’ve experienced it and so have all of my female friends at one point, and despite not knowing what part of the country you live in unfortunately I can bet on you experiencing the same. the link I posted would also beg to differ about violence strangers lmao. Girl you said nothing but the truth in response.",
                                            "author": "RussianAsshole",
                                            "id": "eqxot6j",
                                            "parent_id": "t1_eqxlxl8",
                                            "score": 12,
                                            "created_utc": 1560372111.0,
                                            "replies": [
                                                {
                                                    "body": "Isn't NYC like of the safest cities on the planet by crime rates? I mean you should have gone with Chicago or Detroit or something. Being catcalled and harassed is no where near the same thing as abuse. Every women gets catcalled and told disgusting things or sent unsolicited dick pics. Unfortunately that's just life, buys it's far from abuse or murder or kidnapping.",
                                                    "author": "ZonaCouple",
                                                    "id": "eqxqmvq",
                                                    "parent_id": "t1_eqxot6j",
                                                    "score": 0,
                                                    "created_utc": 1560372749.0,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "body": "And lots of those daddies have been robbed and beat up by the girls real boyfriends, It goes both ways trust me. walking around in fear thinking things are going to happen to you just makes you a victim before it happens. \n\nI can promise you I have seen things and lived places you have only heard about. I am the furthest thing from sheltered. It's more likely that your sheltered, privileged upbringing has made you scared of your own shadow.",
                                            "author": "ZonaCouple",
                                            "id": "eqxq7eh",
                                            "parent_id": "t1_eqxlxl8",
                                            "score": 0,
                                            "created_utc": 1560372601.0,
                                            "replies": [
                                                {
                                                    "body": "[deleted]",
                                                    "author": null,
                                                    "id": "eqxxwcf",
                                                    "parent_id": "t1_eqxq7eh",
                                                    "score": 0,
                                                    "created_utc": 1560375182.0,
                                                    "replies": [
                                                        {
                                                            "body": "Well your the hopeful and I married my SD so apparently it does.",
                                                            "author": "ZonaCouple",
                                                            "id": "eqxyrxk",
                                                            "parent_id": "t1_eqxxwcf",
                                                            "score": 3,
                                                            "created_utc": 1560375484.0,
                                                            "replies": [
                                                                {
                                                                    "body": "I am a hopeful. I don’t need to marry one 🤷🏻‍♀️",
                                                                    "author": "sugarbabyhopeful",
                                                                    "id": "eqxz3oo",
                                                                    "parent_id": "t1_eqxyrxk",
                                                                    "score": 3,
                                                                    "created_utc": 1560375590.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "I didn't need to marry him just wanted too. But keep trying you might get lucky.",
                                                                            "author": "ZonaCouple",
                                                                            "id": "eqy0fs3",
                                                                            "parent_id": "t1_eqxz3oo",
                                                                            "score": 3,
                                                                            "created_utc": 1560376047.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "No thank you. I don’t buy human beings from Walmart... I respected you and your decisions until that ☹️",
                                                                                    "author": "sugarbabyhopeful",
                                                                                    "id": "eqy18zx",
                                                                                    "parent_id": "t1_eqy0fs3",
                                                                                    "score": 1,
                                                                                    "created_utc": 1560376313.0,
                                                                                    "replies": [
                                                                                        {
                                                                                            "body": "Mmm, so much fun though.",
                                                                                            "author": "ZonaCouple",
                                                                                            "id": "eqy2w49",
                                                                                            "parent_id": "t1_eqy18zx",
                                                                                            "score": 1,
                                                                                            "created_utc": 1560376880.0,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "body": "what was this whole thread. lmao.",
                                                                                                    "author": "curlygoddess93",
                                                                                                    "id": "er05ojy",
                                                                                                    "parent_id": "t1_eqy2w49",
                                                                                                    "score": 1,
                                                                                                    "created_utc": 1560411200.0,
                                                                                                    "replies": []
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "This is a bit like saying \"I have never had an issue not wearing a seatbelt in a car.\" \n\nIt seems to work fine, until you're dead and can no longer post on message boards about how your risky approach works just fine.",
                                    "author": "antonivs",
                                    "id": "eqy1srt",
                                    "parent_id": "t1_eqxiumv",
                                    "score": 3,
                                    "created_utc": 1560376504.0,
                                    "replies": [
                                        {
                                            "body": "No it's nothing like that. It's a bit like saying I have a better chance of winning the lotto then getting struck by lightning so I am not going to be afraid to go outside in a thunderstorm.",
                                            "author": "ZonaCouple",
                                            "id": "eqy35hm",
                                            "parent_id": "t1_eqy1srt",
                                            "score": 2,
                                            "created_utc": 1560376969.0,
                                            "replies": [
                                                {
                                                    "body": "On average there are more than 50 deaths from lightning per year in the US.\n\nIt's likely that 100% of the people who die from lightning strikes are those who weren't careful enough.\n\nSome simple precautions can reduce your chances of dying this way significantly. The same goes for intimate meetings with strangers.",
                                                    "author": "antonivs",
                                                    "id": "eqy6udi",
                                                    "parent_id": "t1_eqy35hm",
                                                    "score": 1,
                                                    "created_utc": 1560378355.0,
                                                    "replies": [
                                                        {
                                                            "body": "I never said don't take precautions but alot of these girls go way overboard with them for both platonic m&g and sexy fun time. Acting as if a handful of girls a day gets taken off the streets randomly. It just doesn't happen that often. \n\nI am not going to be scared to go out in a thunderstorm, but I am not going to play golf through one. There is some common sense involved.",
                                                            "author": "ZonaCouple",
                                                            "id": "eqyavht",
                                                            "parent_id": "t1_eqy6udi",
                                                            "score": 3,
                                                            "created_utc": 1560380276.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "😂 I wish I could insert a photo because I don’t think Ol’ Stuart Little could ravage his way out of a paper bag",
            "author": "GabR156",
            "id": "eqvmrln",
            "parent_id": "t1_eqvmm10",
            "score": 40,
            "created_utc": 1560347115.0,
            "replies": []
        },
        {
            "body": "I've learned to accept that there are fakes, flakes, scammers and crazies on both sides in the bowl.   Ive found there are also real genuine honest SBs and SDs. \n\nI maintain my guard and protect myself against the pretenders, but dont allow myrself to become jaded and overlook the real thing.\n\nIt's a balance.",
            "author": "willfromvb",
            "id": "eqx40op",
            "parent_id": "t1_eqwrsf7",
            "score": 6,
            "created_utc": 1560364887.0,
            "replies": []
        },
        {
            "body": "Right? A lot of the phrasing and things I read like this play a large part in stopping me from entering the bowl altogether. Yes, money is being exchanged, but let’s not talk about it like it’s some benign financial transaction or like you’re buying or renting a piece of property... she’s a human dude. \n\nJust try to remind yourself that oftentimes it’s just semantics (hopefully) and some of us are just big softies who need to ignore things like that to cope lol.",
            "author": "LaLaLiiisa",
            "id": "eqxvr76",
            "parent_id": "t1_eqwrsf7",
            "score": 5,
            "created_utc": 1560374481.0,
            "replies": []
        },
        {
            "body": "My favorite thing is specifically calling them out on the ideologies they use. “You’ve read The Game/follow The Red Pill philosophy?” Always catchs them off guard because they never expect you to do a play-by-play of the strategy they’re trying to use.",
            "author": "RussianAsshole",
            "id": "eqxed4k",
            "parent_id": "t1_eqw1i29",
            "score": 15,
            "created_utc": 1560368223.0,
            "replies": []
        },
        {
            "body": "\"Why buy the car when you haven't test driven it yet?\" Lol",
            "author": "smol_chan",
            "id": "eqwwat7",
            "parent_id": "t1_eqw1i29",
            "score": 2,
            "created_utc": 1560362320.0,
            "replies": []
        },
        {
            "body": "Exactly this!  \n\nThis guy knows this too, but is trying to manipulate women into free sex.  I believe there are even well off men who do this as a power play not because they cant afford to pay.",
            "author": "willfromvb",
            "id": "eqx33l7",
            "parent_id": "t1_eqwf0gf",
            "score": 10,
            "created_utc": 1560364584.0,
            "replies": [
                {
                    "body": "Totally.  There are guys that have a lot of resentment from decades of women ignoring them so when they get a little money they try to turn the tables.    It wouldn’t make me feel good about myself.",
                    "author": "LotBuilder",
                    "id": "eqx9z7g",
                    "parent_id": "t1_eqx33l7",
                    "score": 7,
                    "created_utc": 1560366843.0,
                    "replies": [
                        {
                            "body": ">  There are guys that have a lot of resentment from decades of women ignoring them so when they get a little money they try to turn the tables\n\nI really believe this is a huge part of it.",
                            "author": "pintodinosaur",
                            "id": "eqxvrpu",
                            "parent_id": "t1_eqx9z7g",
                            "score": 5,
                            "created_utc": 1560374486.0,
                            "replies": [
                                {
                                    "body": "It has to be.  How does someone have enough anger and venom in them to try to get over on some 22 year old girl.  I won’t pretend all of my SB’s are perfect angels but they were just young ladies trying to get by in a world of fractured families, crushing student loan debt and guys their age that bring little to the table beyond video game and porn addiction.   There is no reason to get over on them because a dude couldn’t get laid 25 years ago when he was 19.  It’s not her fault.",
                                    "author": "LotBuilder",
                                    "id": "eqy4ahh",
                                    "parent_id": "t1_eqxvrpu",
                                    "score": 6,
                                    "created_utc": 1560377368.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "eqw36rg",
            "parent_id": "t1_eqvqzg1",
            "score": 12,
            "created_utc": 1560352636.0,
            "replies": [
                {
                    "body": "Yes! It’s so refreshing to hear a man admit this. Men are far more emotional. For proof, see how men react when they get rejected.\n\n Their egos are far more fragile. Their reactions when you state *just that* are all the proof you need.",
                    "author": "RussianAsshole",
                    "id": "eqxeop2",
                    "parent_id": "t1_eqw36rg",
                    "score": 8,
                    "created_utc": 1560368336.0,
                    "replies": []
                },
                {
                    "body": "I have to read something academic to truly believe this one",
                    "author": "puckhead4",
                    "id": "eqw8bhc",
                    "parent_id": "t1_eqw36rg",
                    "score": -3,
                    "created_utc": 1560354242.0,
                    "replies": []
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "eqx60wp",
                    "parent_id": "t1_eqw36rg",
                    "score": -4,
                    "created_utc": 1560365547.0,
                    "replies": [
                        {
                            "body": "[But were you punched twice in the face, killed, have your jaw broken, get shot, or threatened to have the baby in your womb kicked?](https://www.mic.com/articles/135394/14-women-were-brutally-attacked-for-rejecting-men-why-arent-we-talking-about-it)",
                            "author": "RussianAsshole",
                            "id": "eqxfcr1",
                            "parent_id": "t1_eqx60wp",
                            "score": 2,
                            "created_utc": 1560368563.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "that part. and hence, the need for wealth to overcompensate for their lack of everything else. in this case, morality and common sense. lmao.",
            "author": "curlygoddess93",
            "id": "er05we8",
            "parent_id": "t1_eqvqzg1",
            "score": 2,
            "created_utc": 1560411320.0,
            "replies": []
        },
        {
            "body": "Ahhhh. See I blocked the doofus from my story but he found me on another sugar site -___-",
            "author": "GabR156",
            "id": "eqxc904",
            "parent_id": "t1_eqxc387",
            "score": 7,
            "created_utc": 1560367555.0,
            "replies": [
                {
                    "body": "Damn, rude and a stalker lol. What other sites are there? I only know of SA.",
                    "author": "voluptuous_vanessa",
                    "id": "eqxcl4q",
                    "parent_id": "t1_eqxc904",
                    "score": 3,
                    "created_utc": 1560367661.0,
                    "replies": []
                },
                {
                    "body": "Is there something out there beyond SA?",
                    "author": "sdphilly",
                    "id": "er1dycr",
                    "parent_id": "t1_eqxc904",
                    "score": 1,
                    "created_utc": 1560430510.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Its so endearing how you always put Miss in your comments ☺️ noticed it a couple of times",
            "author": null,
            "id": "eqwq5h2",
            "parent_id": "t1_eqw7x0g",
            "score": 3,
            "created_utc": 1560360184.0,
            "replies": []
        },
        {
            "body": "Hey, at least his behavior  makes for laughs on SLF.",
            "author": "GabR156",
            "id": "er0vkb6",
            "parent_id": "t1_eqzyhvc",
            "score": 1,
            "created_utc": 1560422960.0,
            "replies": []
        },
        {
            "body": "Haha ^ that’s the reason I posted- so that folks know that some grown men really walk through this world with their prefrontal cortex development somehow having halted when they were 10 years old. \n\nMy decision to do errands is what sparked his ranting about the woods and my maturity and his feelings got hurt when SURPRISE, an essential stranger wasn’t acting as if the world revolves around him. \nNothing “online in advanced.” He asked me to come over to his house at the day after we met in person. \n\nThanks for your input though hun 😂",
            "author": "GabR156",
            "id": "er0vhbp",
            "parent_id": "t1_eqznh8s",
            "score": 4,
            "created_utc": 1560422928.0,
            "replies": []
        },
        {
            "body": "He messaged me on seeking, we initially met on secret benefits. A lesson- always post your funny encounters on Reddit so that all the hilarious sb’s and sd’s can post their thoughts on the sitch. 😂",
            "author": "GabR156",
            "id": "eqwvg84",
            "parent_id": "t1_eqwuxz3",
            "score": 4,
            "created_utc": 1560362016.0,
            "replies": []
        },
        {
            "body": "Was his name Bluebeard?",
            "author": null,
            "id": "eqvt63s",
            "parent_id": "t1_eqvojkf",
            "score": 7,
            "created_utc": 1560349345.0,
            "replies": [
                {
                    "body": "I want to hug you for this reference!",
                    "author": "curlygoddess93",
                    "id": "er05erv",
                    "parent_id": "t1_eqvt63s",
                    "score": 1,
                    "created_utc": 1560411064.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "That’s about the only place you can find a bush these days I believe",
            "author": "puckhead4",
            "id": "eqw84i0",
            "parent_id": "t1_eqw104n",
            "score": 8,
            "created_utc": 1560354176.0,
            "replies": []
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "eqybwl0",
            "parent_id": "t1_eqw0xki",
            "score": 2,
            "created_utc": 1560380770.0,
            "replies": [
                {
                    "body": "[we can go into these kind of woods](http://www.orangesmile.com/extreme/img/main/underwater-park-gruner-see_1.jpg) 🧜‍♀️",
                    "author": null,
                    "id": "eqywtf2",
                    "parent_id": "t1_eqybwl0",
                    "score": 4,
                    "created_utc": 1560390599.0,
                    "replies": [
                        {
                            "body": "Any idea where that is? It’s so pretty",
                            "author": "avocadosonpizza",
                            "id": "er3f2fl",
                            "parent_id": "t1_eqywtf2",
                            "score": 1,
                            "created_utc": 1560461870.0,
                            "replies": [
                                {
                                    "body": "nope. I was just doing some googling for an image and found it!",
                                    "author": null,
                                    "id": "er3o882",
                                    "parent_id": "t1_er3f2fl",
                                    "score": 1,
                                    "created_utc": 1560468209.0,
                                    "replies": [
                                        {
                                            "body": "Aw dang it looked super cool",
                                            "author": "avocadosonpizza",
                                            "id": "er3pshj",
                                            "parent_id": "t1_er3o882",
                                            "score": 1,
                                            "created_utc": 1560469424.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "There’s no such thing as *too worried about their safety*. That kind of attitude is how bad situations and violence against them happens; and then when they go missing due to being too trusting it’s *”why wasn’t she more concerned about her safety?”* \n\nTurn on the news. We can never be too safe. This was just a beyond ignorant statement.",
            "author": "RussianAsshole",
            "id": "eqx6ke6",
            "parent_id": "t1_eqwte26",
            "score": 26,
            "created_utc": 1560365726.0,
            "replies": [
                {
                    "body": "No it's gone to an extreme because of the news. We live in an era of some of the lowest violent crime rates in the countries history. There are fewer murders, and kidnappings then since the 1950s.\n\nI don't mind being safe but some girls take it way to far. Like someone is going to try to kidnap you at a Starbucks in broad daylight? So you have to bring a friend come on its just ridiculous.",
                    "author": "ZonaCouple",
                    "id": "eqxdec4",
                    "parent_id": "t1_eqx6ke6",
                    "score": -6,
                    "created_utc": 1560367911.0,
                    "replies": [
                        {
                            "body": "[lowest violent crime rates in history but women are still being punched, shot, having their jaws broken, and receiving threats to have their pregnant wombs kicked in that same broad daylight you speak of at the hands of men who swear there’s no reason to be afraid of them and don’t understand why we care more about our safety than their feelings.](https://www.mic.com/articles/135394/14-women-were-brutally-attacked-for-rejecting-men-why-arent-we-talking-about-it)\n\n\nLowest crime rates but we’re still huge targets for unwarranted violence while being told that we have little to worry about. And these are only the *reported* cases.",
                            "author": "RussianAsshole",
                            "id": "eqxgfx8",
                            "parent_id": "t1_eqxdec4",
                            "score": 12,
                            "created_utc": 1560369015.0,
                            "replies": [
                                {
                                    "body": "Of course violence still exists and always will. But it's rare for that to happen between strangers and I am sure that vast majority is domestic abuse. You don't think there was a hell of alot more unreported abuse and violence against women in the 60s and 70s then today? You think the black girl who was raped in the 60s got any attention or even a police report filed in Alabama back then? Come on.",
                                    "author": "ZonaCouple",
                                    "id": "eqxj7qs",
                                    "parent_id": "t1_eqxgfx8",
                                    "score": -3,
                                    "created_utc": 1560370109.0,
                                    "replies": [
                                        {
                                            "body": "Um what lmao. The abuses of the 60s and 70s matter just as the ones in the present day do. My point is that you’ve said we’re much safer now and I disproved that, betraying your original point. Sounds a lot like “you should be okay with the abuses women suffer today, you should be grateful you aren’t in the 60s when you would’ve been treated even worse despite the present day abuses still being abhorrent!”. Seems like you’re being obtuse on purpose and purposely missing the point so hey, thanks for proving me right.",
                                            "author": "RussianAsshole",
                                            "id": "eqxjuqn",
                                            "parent_id": "t1_eqxj7qs",
                                            "score": 6,
                                            "created_utc": 1560370436.0,
                                            "replies": [
                                                {
                                                    "body": "No you haven't anyway you cut the cake the crime rates are lower now then then they were. Saying tons of crime goes unreported today only works if you assume all crime was reported in the 60s and 70s which of course it wasn't. The United States is significantly safer today then it was even 20 years ago. That's easily verifiable through the FBI statistics.",
                                                    "author": "ZonaCouple",
                                                    "id": "eqxr1c6",
                                                    "parent_id": "t1_eqxjuqn",
                                                    "score": -1,
                                                    "created_utc": 1560372891.0,
                                                    "replies": [
                                                        {
                                                            "body": "Oh gosh, could a correlation possibly exist between these historically low crime rates and our current medias' emphases on this 'can't be too safe' rhetoric?? Hm...",
                                                            "author": "cldavisch",
                                                            "id": "er0hw2h",
                                                            "parent_id": "t1_eqxr1c6",
                                                            "score": 3,
                                                            "created_utc": 1560417181.0,
                                                            "replies": []
                                                        },
                                                        {
                                                            "body": "There are only two crimes for which accurate statistics are maintained   \n\nmurder because there is almost always a body  \n\nand\n\nBank Robbery because it must be reported to the feds and is almost always on tape. \n\nBoth dipped after citizens initiated 3 strike laws but have risen significantly  over the past decade.  \n\nCalifornia's catch and release programs have also spawned a vast underreporting of serious but not fatal crimes.  Twenty years ago it was far easier to get crime reports filed. \n\n\nWhile the left is obsessed with gun control they conveniently ignore the fact that the ANNUAL losses from opiate abuse (including synthetics) exceeds our total losses during the 10 year Vietnam war",
                                                            "author": "pinotandsugar",
                                                            "id": "er223gi",
                                                            "parent_id": "t1_eqxr1c6",
                                                            "score": 0,
                                                            "created_utc": 1560439316.0,
                                                            "replies": [
                                                                {
                                                                    "body": ">Both dipped after citizens initiated 3 strike laws but have risen significantly over the past decade. \n\nAny source for murders going up in the last 10 years? Bank robberies don't really apply to sugar babies. Also not all states have 3 strike laws. \n\n>California's catch and release programs have also spawned a vast underreporting of serious but not fatal crimes. Twenty years ago it was far easier to get crime reports filed. \n\nAgain any source? I just heard a big thing on NPR about how crimes are reported much faster and better then ever before. Because of cell phone use since the 90s going up. Not to mention by almost every statistic all crimes but property and rape (they changed the way it was defined) have been going down for years. Plus every cop that worked in the 80s and 90s will tell you it's way better then back then. With a few cities excluded for local reasons. \n\n>While the left is obsessed with gun control they conveniently ignore the fact that the ANNUAL losses from opiate abuse (including synthetics) exceeds our total losses during the 10 year Vietnam war\n\nAh never mind your one of those.",
                                                                    "author": "ZonaCouple",
                                                                    "id": "er3hd1j",
                                                                    "parent_id": "t1_er223gi",
                                                                    "score": 1,
                                                                    "created_utc": 1560463271.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "Crimes may be \"reported to the police \"  but they do not make the \"reported crime\" stats until the police fill out and file a crime report.  For departments like LAPD this is a major effort unless there is a dead body or somebody headed for the hospital.",
                                                                            "author": "pinotandsugar",
                                                                            "id": "er3n7wd",
                                                                            "parent_id": "t1_er3hd1j",
                                                                            "score": 0,
                                                                            "created_utc": 1560467403.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "Okay.",
                                                                                    "author": "ZonaCouple",
                                                                                    "id": "er3nfp8",
                                                                                    "parent_id": "t1_er3n7wd",
                                                                                    "score": 1,
                                                                                    "created_utc": 1560467578.0,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "You think women are too concerned with their safety when they are meeting up with a lot of very entitled wealthy men? A lot of whom aren’t used to having to deal with negative consequences???? I’m not trying to be rude but you must be a man. We can’t even go for a walk at night with the dog without being concerned and bringing pepper spray or a gun. There is no such thing as being TOO CONCERNED when it comes to your life.",
            "author": "sugarbabyhopeful",
            "id": "eqxabxl",
            "parent_id": "t1_eqwte26",
            "score": 26,
            "created_utc": 1560366953.0,
            "replies": [
                {
                    "body": "These SD men are the most entitled, whiny, selfish people I’ve ever met. My sweet toddler cousin doesn’t throw nearly the tantrum that they do when they don’t get what they want. These men will assault you and put you in life threatening danger if you don’t give them what they want because they’ve never had to hear no once in their life and are used to getting whatever they want and we’re too concerned about something as crucial as our safety?? Men have no empathy for us and no desire to learn about what we go through and how our safety is constantly at risk.\n\n\nMen. I expect the worst and you still find a way to disappoint.",
                    "author": "RussianAsshole",
                    "id": "eqxdlqy",
                    "parent_id": "t1_eqxabxl",
                    "score": 17,
                    "created_utc": 1560367976.0,
                    "replies": []
                },
                {
                    "body": "I am a women and you only think the world is out to get you. Everytime I have been hit or abused it was by a family member or boyfriend not a stranger. Strangers are usually the ones who want to help. I have never had an issue on a first date or a hookup. I have never had a problem walking alone no matter what part of town I was in. Cat called sure but no actual issues.",
                    "author": "ZonaCouple",
                    "id": "eqxiumv",
                    "parent_id": "t1_eqxabxl",
                    "score": -3,
                    "created_utc": 1560369917.0,
                    "replies": [
                        {
                            "body": "Just because you haven’t doesn’t mean most others haven’t either. Some of these “sugar daddies” are creepy old douche canoes who literally HAVE to buy women’s attention. Clearly you are very sheltered and that’s great for you but please, value your safety more and don’t be so naive. Especially when dealing with men who aren’t used to the word no",
                            "author": "sugarbabyhopeful",
                            "id": "eqxlxl8",
                            "parent_id": "t1_eqxiumv",
                            "score": 15,
                            "created_utc": 1560371164.0,
                            "replies": [
                                {
                                    "body": "“It doesn’t happen to me therefore it doesn’t happen” imagine living in the city that's the capital of catcalling and strange men harassing you in this country yet being told that this barely ever happens when I’ve experienced it and so have all of my female friends at one point, and despite not knowing what part of the country you live in unfortunately I can bet on you experiencing the same. the link I posted would also beg to differ about violence strangers lmao. Girl you said nothing but the truth in response.",
                                    "author": "RussianAsshole",
                                    "id": "eqxot6j",
                                    "parent_id": "t1_eqxlxl8",
                                    "score": 12,
                                    "created_utc": 1560372111.0,
                                    "replies": [
                                        {
                                            "body": "Isn't NYC like of the safest cities on the planet by crime rates? I mean you should have gone with Chicago or Detroit or something. Being catcalled and harassed is no where near the same thing as abuse. Every women gets catcalled and told disgusting things or sent unsolicited dick pics. Unfortunately that's just life, buys it's far from abuse or murder or kidnapping.",
                                            "author": "ZonaCouple",
                                            "id": "eqxqmvq",
                                            "parent_id": "t1_eqxot6j",
                                            "score": 0,
                                            "created_utc": 1560372749.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "And lots of those daddies have been robbed and beat up by the girls real boyfriends, It goes both ways trust me. walking around in fear thinking things are going to happen to you just makes you a victim before it happens. \n\nI can promise you I have seen things and lived places you have only heard about. I am the furthest thing from sheltered. It's more likely that your sheltered, privileged upbringing has made you scared of your own shadow.",
                                    "author": "ZonaCouple",
                                    "id": "eqxq7eh",
                                    "parent_id": "t1_eqxlxl8",
                                    "score": 0,
                                    "created_utc": 1560372601.0,
                                    "replies": [
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "eqxxwcf",
                                            "parent_id": "t1_eqxq7eh",
                                            "score": 0,
                                            "created_utc": 1560375182.0,
                                            "replies": [
                                                {
                                                    "body": "Well your the hopeful and I married my SD so apparently it does.",
                                                    "author": "ZonaCouple",
                                                    "id": "eqxyrxk",
                                                    "parent_id": "t1_eqxxwcf",
                                                    "score": 3,
                                                    "created_utc": 1560375484.0,
                                                    "replies": [
                                                        {
                                                            "body": "I am a hopeful. I don’t need to marry one 🤷🏻‍♀️",
                                                            "author": "sugarbabyhopeful",
                                                            "id": "eqxz3oo",
                                                            "parent_id": "t1_eqxyrxk",
                                                            "score": 3,
                                                            "created_utc": 1560375590.0,
                                                            "replies": [
                                                                {
                                                                    "body": "I didn't need to marry him just wanted too. But keep trying you might get lucky.",
                                                                    "author": "ZonaCouple",
                                                                    "id": "eqy0fs3",
                                                                    "parent_id": "t1_eqxz3oo",
                                                                    "score": 3,
                                                                    "created_utc": 1560376047.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "No thank you. I don’t buy human beings from Walmart... I respected you and your decisions until that ☹️",
                                                                            "author": "sugarbabyhopeful",
                                                                            "id": "eqy18zx",
                                                                            "parent_id": "t1_eqy0fs3",
                                                                            "score": 1,
                                                                            "created_utc": 1560376313.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "Mmm, so much fun though.",
                                                                                    "author": "ZonaCouple",
                                                                                    "id": "eqy2w49",
                                                                                    "parent_id": "t1_eqy18zx",
                                                                                    "score": 1,
                                                                                    "created_utc": 1560376880.0,
                                                                                    "replies": [
                                                                                        {
                                                                                            "body": "what was this whole thread. lmao.",
                                                                                            "author": "curlygoddess93",
                                                                                            "id": "er05ojy",
                                                                                            "parent_id": "t1_eqy2w49",
                                                                                            "score": 1,
                                                                                            "created_utc": 1560411200.0,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "This is a bit like saying \"I have never had an issue not wearing a seatbelt in a car.\" \n\nIt seems to work fine, until you're dead and can no longer post on message boards about how your risky approach works just fine.",
                            "author": "antonivs",
                            "id": "eqy1srt",
                            "parent_id": "t1_eqxiumv",
                            "score": 3,
                            "created_utc": 1560376504.0,
                            "replies": [
                                {
                                    "body": "No it's nothing like that. It's a bit like saying I have a better chance of winning the lotto then getting struck by lightning so I am not going to be afraid to go outside in a thunderstorm.",
                                    "author": "ZonaCouple",
                                    "id": "eqy35hm",
                                    "parent_id": "t1_eqy1srt",
                                    "score": 2,
                                    "created_utc": 1560376969.0,
                                    "replies": [
                                        {
                                            "body": "On average there are more than 50 deaths from lightning per year in the US.\n\nIt's likely that 100% of the people who die from lightning strikes are those who weren't careful enough.\n\nSome simple precautions can reduce your chances of dying this way significantly. The same goes for intimate meetings with strangers.",
                                            "author": "antonivs",
                                            "id": "eqy6udi",
                                            "parent_id": "t1_eqy35hm",
                                            "score": 1,
                                            "created_utc": 1560378355.0,
                                            "replies": [
                                                {
                                                    "body": "I never said don't take precautions but alot of these girls go way overboard with them for both platonic m&g and sexy fun time. Acting as if a handful of girls a day gets taken off the streets randomly. It just doesn't happen that often. \n\nI am not going to be scared to go out in a thunderstorm, but I am not going to play golf through one. There is some common sense involved.",
                                                    "author": "ZonaCouple",
                                                    "id": "eqyavht",
                                                    "parent_id": "t1_eqy6udi",
                                                    "score": 3,
                                                    "created_utc": 1560380276.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Totally.  There are guys that have a lot of resentment from decades of women ignoring them so when they get a little money they try to turn the tables.    It wouldn’t make me feel good about myself.",
            "author": "LotBuilder",
            "id": "eqx9z7g",
            "parent_id": "t1_eqx33l7",
            "score": 7,
            "created_utc": 1560366843.0,
            "replies": [
                {
                    "body": ">  There are guys that have a lot of resentment from decades of women ignoring them so when they get a little money they try to turn the tables\n\nI really believe this is a huge part of it.",
                    "author": "pintodinosaur",
                    "id": "eqxvrpu",
                    "parent_id": "t1_eqx9z7g",
                    "score": 5,
                    "created_utc": 1560374486.0,
                    "replies": [
                        {
                            "body": "It has to be.  How does someone have enough anger and venom in them to try to get over on some 22 year old girl.  I won’t pretend all of my SB’s are perfect angels but they were just young ladies trying to get by in a world of fractured families, crushing student loan debt and guys their age that bring little to the table beyond video game and porn addiction.   There is no reason to get over on them because a dude couldn’t get laid 25 years ago when he was 19.  It’s not her fault.",
                            "author": "LotBuilder",
                            "id": "eqy4ahh",
                            "parent_id": "t1_eqxvrpu",
                            "score": 6,
                            "created_utc": 1560377368.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yes! It’s so refreshing to hear a man admit this. Men are far more emotional. For proof, see how men react when they get rejected.\n\n Their egos are far more fragile. Their reactions when you state *just that* are all the proof you need.",
            "author": "RussianAsshole",
            "id": "eqxeop2",
            "parent_id": "t1_eqw36rg",
            "score": 8,
            "created_utc": 1560368336.0,
            "replies": []
        },
        {
            "body": "I have to read something academic to truly believe this one",
            "author": "puckhead4",
            "id": "eqw8bhc",
            "parent_id": "t1_eqw36rg",
            "score": -3,
            "created_utc": 1560354242.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "eqx60wp",
            "parent_id": "t1_eqw36rg",
            "score": -4,
            "created_utc": 1560365547.0,
            "replies": [
                {
                    "body": "[But were you punched twice in the face, killed, have your jaw broken, get shot, or threatened to have the baby in your womb kicked?](https://www.mic.com/articles/135394/14-women-were-brutally-attacked-for-rejecting-men-why-arent-we-talking-about-it)",
                    "author": "RussianAsshole",
                    "id": "eqxfcr1",
                    "parent_id": "t1_eqx60wp",
                    "score": 2,
                    "created_utc": 1560368563.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Damn, rude and a stalker lol. What other sites are there? I only know of SA.",
            "author": "voluptuous_vanessa",
            "id": "eqxcl4q",
            "parent_id": "t1_eqxc904",
            "score": 3,
            "created_utc": 1560367661.0,
            "replies": []
        },
        {
            "body": "Is there something out there beyond SA?",
            "author": "sdphilly",
            "id": "er1dycr",
            "parent_id": "t1_eqxc904",
            "score": 1,
            "created_utc": 1560430510.0,
            "replies": []
        },
        {
            "body": "I want to hug you for this reference!",
            "author": "curlygoddess93",
            "id": "er05erv",
            "parent_id": "t1_eqvt63s",
            "score": 1,
            "created_utc": 1560411064.0,
            "replies": []
        },
        {
            "body": "[we can go into these kind of woods](http://www.orangesmile.com/extreme/img/main/underwater-park-gruner-see_1.jpg) 🧜‍♀️",
            "author": null,
            "id": "eqywtf2",
            "parent_id": "t1_eqybwl0",
            "score": 4,
            "created_utc": 1560390599.0,
            "replies": [
                {
                    "body": "Any idea where that is? It’s so pretty",
                    "author": "avocadosonpizza",
                    "id": "er3f2fl",
                    "parent_id": "t1_eqywtf2",
                    "score": 1,
                    "created_utc": 1560461870.0,
                    "replies": [
                        {
                            "body": "nope. I was just doing some googling for an image and found it!",
                            "author": null,
                            "id": "er3o882",
                            "parent_id": "t1_er3f2fl",
                            "score": 1,
                            "created_utc": 1560468209.0,
                            "replies": [
                                {
                                    "body": "Aw dang it looked super cool",
                                    "author": "avocadosonpizza",
                                    "id": "er3pshj",
                                    "parent_id": "t1_er3o882",
                                    "score": 1,
                                    "created_utc": 1560469424.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "No it's gone to an extreme because of the news. We live in an era of some of the lowest violent crime rates in the countries history. There are fewer murders, and kidnappings then since the 1950s.\n\nI don't mind being safe but some girls take it way to far. Like someone is going to try to kidnap you at a Starbucks in broad daylight? So you have to bring a friend come on its just ridiculous.",
            "author": "ZonaCouple",
            "id": "eqxdec4",
            "parent_id": "t1_eqx6ke6",
            "score": -6,
            "created_utc": 1560367911.0,
            "replies": [
                {
                    "body": "[lowest violent crime rates in history but women are still being punched, shot, having their jaws broken, and receiving threats to have their pregnant wombs kicked in that same broad daylight you speak of at the hands of men who swear there’s no reason to be afraid of them and don’t understand why we care more about our safety than their feelings.](https://www.mic.com/articles/135394/14-women-were-brutally-attacked-for-rejecting-men-why-arent-we-talking-about-it)\n\n\nLowest crime rates but we’re still huge targets for unwarranted violence while being told that we have little to worry about. And these are only the *reported* cases.",
                    "author": "RussianAsshole",
                    "id": "eqxgfx8",
                    "parent_id": "t1_eqxdec4",
                    "score": 12,
                    "created_utc": 1560369015.0,
                    "replies": [
                        {
                            "body": "Of course violence still exists and always will. But it's rare for that to happen between strangers and I am sure that vast majority is domestic abuse. You don't think there was a hell of alot more unreported abuse and violence against women in the 60s and 70s then today? You think the black girl who was raped in the 60s got any attention or even a police report filed in Alabama back then? Come on.",
                            "author": "ZonaCouple",
                            "id": "eqxj7qs",
                            "parent_id": "t1_eqxgfx8",
                            "score": -3,
                            "created_utc": 1560370109.0,
                            "replies": [
                                {
                                    "body": "Um what lmao. The abuses of the 60s and 70s matter just as the ones in the present day do. My point is that you’ve said we’re much safer now and I disproved that, betraying your original point. Sounds a lot like “you should be okay with the abuses women suffer today, you should be grateful you aren’t in the 60s when you would’ve been treated even worse despite the present day abuses still being abhorrent!”. Seems like you’re being obtuse on purpose and purposely missing the point so hey, thanks for proving me right.",
                                    "author": "RussianAsshole",
                                    "id": "eqxjuqn",
                                    "parent_id": "t1_eqxj7qs",
                                    "score": 6,
                                    "created_utc": 1560370436.0,
                                    "replies": [
                                        {
                                            "body": "No you haven't anyway you cut the cake the crime rates are lower now then then they were. Saying tons of crime goes unreported today only works if you assume all crime was reported in the 60s and 70s which of course it wasn't. The United States is significantly safer today then it was even 20 years ago. That's easily verifiable through the FBI statistics.",
                                            "author": "ZonaCouple",
                                            "id": "eqxr1c6",
                                            "parent_id": "t1_eqxjuqn",
                                            "score": -1,
                                            "created_utc": 1560372891.0,
                                            "replies": [
                                                {
                                                    "body": "Oh gosh, could a correlation possibly exist between these historically low crime rates and our current medias' emphases on this 'can't be too safe' rhetoric?? Hm...",
                                                    "author": "cldavisch",
                                                    "id": "er0hw2h",
                                                    "parent_id": "t1_eqxr1c6",
                                                    "score": 3,
                                                    "created_utc": 1560417181.0,
                                                    "replies": []
                                                },
                                                {
                                                    "body": "There are only two crimes for which accurate statistics are maintained   \n\nmurder because there is almost always a body  \n\nand\n\nBank Robbery because it must be reported to the feds and is almost always on tape. \n\nBoth dipped after citizens initiated 3 strike laws but have risen significantly  over the past decade.  \n\nCalifornia's catch and release programs have also spawned a vast underreporting of serious but not fatal crimes.  Twenty years ago it was far easier to get crime reports filed. \n\n\nWhile the left is obsessed with gun control they conveniently ignore the fact that the ANNUAL losses from opiate abuse (including synthetics) exceeds our total losses during the 10 year Vietnam war",
                                                    "author": "pinotandsugar",
                                                    "id": "er223gi",
                                                    "parent_id": "t1_eqxr1c6",
                                                    "score": 0,
                                                    "created_utc": 1560439316.0,
                                                    "replies": [
                                                        {
                                                            "body": ">Both dipped after citizens initiated 3 strike laws but have risen significantly over the past decade. \n\nAny source for murders going up in the last 10 years? Bank robberies don't really apply to sugar babies. Also not all states have 3 strike laws. \n\n>California's catch and release programs have also spawned a vast underreporting of serious but not fatal crimes. Twenty years ago it was far easier to get crime reports filed. \n\nAgain any source? I just heard a big thing on NPR about how crimes are reported much faster and better then ever before. Because of cell phone use since the 90s going up. Not to mention by almost every statistic all crimes but property and rape (they changed the way it was defined) have been going down for years. Plus every cop that worked in the 80s and 90s will tell you it's way better then back then. With a few cities excluded for local reasons. \n\n>While the left is obsessed with gun control they conveniently ignore the fact that the ANNUAL losses from opiate abuse (including synthetics) exceeds our total losses during the 10 year Vietnam war\n\nAh never mind your one of those.",
                                                            "author": "ZonaCouple",
                                                            "id": "er3hd1j",
                                                            "parent_id": "t1_er223gi",
                                                            "score": 1,
                                                            "created_utc": 1560463271.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Crimes may be \"reported to the police \"  but they do not make the \"reported crime\" stats until the police fill out and file a crime report.  For departments like LAPD this is a major effort unless there is a dead body or somebody headed for the hospital.",
                                                                    "author": "pinotandsugar",
                                                                    "id": "er3n7wd",
                                                                    "parent_id": "t1_er3hd1j",
                                                                    "score": 0,
                                                                    "created_utc": 1560467403.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "Okay.",
                                                                            "author": "ZonaCouple",
                                                                            "id": "er3nfp8",
                                                                            "parent_id": "t1_er3n7wd",
                                                                            "score": 1,
                                                                            "created_utc": 1560467578.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "These SD men are the most entitled, whiny, selfish people I’ve ever met. My sweet toddler cousin doesn’t throw nearly the tantrum that they do when they don’t get what they want. These men will assault you and put you in life threatening danger if you don’t give them what they want because they’ve never had to hear no once in their life and are used to getting whatever they want and we’re too concerned about something as crucial as our safety?? Men have no empathy for us and no desire to learn about what we go through and how our safety is constantly at risk.\n\n\nMen. I expect the worst and you still find a way to disappoint.",
            "author": "RussianAsshole",
            "id": "eqxdlqy",
            "parent_id": "t1_eqxabxl",
            "score": 17,
            "created_utc": 1560367976.0,
            "replies": []
        },
        {
            "body": "I am a women and you only think the world is out to get you. Everytime I have been hit or abused it was by a family member or boyfriend not a stranger. Strangers are usually the ones who want to help. I have never had an issue on a first date or a hookup. I have never had a problem walking alone no matter what part of town I was in. Cat called sure but no actual issues.",
            "author": "ZonaCouple",
            "id": "eqxiumv",
            "parent_id": "t1_eqxabxl",
            "score": -3,
            "created_utc": 1560369917.0,
            "replies": [
                {
                    "body": "Just because you haven’t doesn’t mean most others haven’t either. Some of these “sugar daddies” are creepy old douche canoes who literally HAVE to buy women’s attention. Clearly you are very sheltered and that’s great for you but please, value your safety more and don’t be so naive. Especially when dealing with men who aren’t used to the word no",
                    "author": "sugarbabyhopeful",
                    "id": "eqxlxl8",
                    "parent_id": "t1_eqxiumv",
                    "score": 15,
                    "created_utc": 1560371164.0,
                    "replies": [
                        {
                            "body": "“It doesn’t happen to me therefore it doesn’t happen” imagine living in the city that's the capital of catcalling and strange men harassing you in this country yet being told that this barely ever happens when I’ve experienced it and so have all of my female friends at one point, and despite not knowing what part of the country you live in unfortunately I can bet on you experiencing the same. the link I posted would also beg to differ about violence strangers lmao. Girl you said nothing but the truth in response.",
                            "author": "RussianAsshole",
                            "id": "eqxot6j",
                            "parent_id": "t1_eqxlxl8",
                            "score": 12,
                            "created_utc": 1560372111.0,
                            "replies": [
                                {
                                    "body": "Isn't NYC like of the safest cities on the planet by crime rates? I mean you should have gone with Chicago or Detroit or something. Being catcalled and harassed is no where near the same thing as abuse. Every women gets catcalled and told disgusting things or sent unsolicited dick pics. Unfortunately that's just life, buys it's far from abuse or murder or kidnapping.",
                                    "author": "ZonaCouple",
                                    "id": "eqxqmvq",
                                    "parent_id": "t1_eqxot6j",
                                    "score": 0,
                                    "created_utc": 1560372749.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "And lots of those daddies have been robbed and beat up by the girls real boyfriends, It goes both ways trust me. walking around in fear thinking things are going to happen to you just makes you a victim before it happens. \n\nI can promise you I have seen things and lived places you have only heard about. I am the furthest thing from sheltered. It's more likely that your sheltered, privileged upbringing has made you scared of your own shadow.",
                            "author": "ZonaCouple",
                            "id": "eqxq7eh",
                            "parent_id": "t1_eqxlxl8",
                            "score": 0,
                            "created_utc": 1560372601.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "eqxxwcf",
                                    "parent_id": "t1_eqxq7eh",
                                    "score": 0,
                                    "created_utc": 1560375182.0,
                                    "replies": [
                                        {
                                            "body": "Well your the hopeful and I married my SD so apparently it does.",
                                            "author": "ZonaCouple",
                                            "id": "eqxyrxk",
                                            "parent_id": "t1_eqxxwcf",
                                            "score": 3,
                                            "created_utc": 1560375484.0,
                                            "replies": [
                                                {
                                                    "body": "I am a hopeful. I don’t need to marry one 🤷🏻‍♀️",
                                                    "author": "sugarbabyhopeful",
                                                    "id": "eqxz3oo",
                                                    "parent_id": "t1_eqxyrxk",
                                                    "score": 3,
                                                    "created_utc": 1560375590.0,
                                                    "replies": [
                                                        {
                                                            "body": "I didn't need to marry him just wanted too. But keep trying you might get lucky.",
                                                            "author": "ZonaCouple",
                                                            "id": "eqy0fs3",
                                                            "parent_id": "t1_eqxz3oo",
                                                            "score": 3,
                                                            "created_utc": 1560376047.0,
                                                            "replies": [
                                                                {
                                                                    "body": "No thank you. I don’t buy human beings from Walmart... I respected you and your decisions until that ☹️",
                                                                    "author": "sugarbabyhopeful",
                                                                    "id": "eqy18zx",
                                                                    "parent_id": "t1_eqy0fs3",
                                                                    "score": 1,
                                                                    "created_utc": 1560376313.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "Mmm, so much fun though.",
                                                                            "author": "ZonaCouple",
                                                                            "id": "eqy2w49",
                                                                            "parent_id": "t1_eqy18zx",
                                                                            "score": 1,
                                                                            "created_utc": 1560376880.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "what was this whole thread. lmao.",
                                                                                    "author": "curlygoddess93",
                                                                                    "id": "er05ojy",
                                                                                    "parent_id": "t1_eqy2w49",
                                                                                    "score": 1,
                                                                                    "created_utc": 1560411200.0,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "This is a bit like saying \"I have never had an issue not wearing a seatbelt in a car.\" \n\nIt seems to work fine, until you're dead and can no longer post on message boards about how your risky approach works just fine.",
                    "author": "antonivs",
                    "id": "eqy1srt",
                    "parent_id": "t1_eqxiumv",
                    "score": 3,
                    "created_utc": 1560376504.0,
                    "replies": [
                        {
                            "body": "No it's nothing like that. It's a bit like saying I have a better chance of winning the lotto then getting struck by lightning so I am not going to be afraid to go outside in a thunderstorm.",
                            "author": "ZonaCouple",
                            "id": "eqy35hm",
                            "parent_id": "t1_eqy1srt",
                            "score": 2,
                            "created_utc": 1560376969.0,
                            "replies": [
                                {
                                    "body": "On average there are more than 50 deaths from lightning per year in the US.\n\nIt's likely that 100% of the people who die from lightning strikes are those who weren't careful enough.\n\nSome simple precautions can reduce your chances of dying this way significantly. The same goes for intimate meetings with strangers.",
                                    "author": "antonivs",
                                    "id": "eqy6udi",
                                    "parent_id": "t1_eqy35hm",
                                    "score": 1,
                                    "created_utc": 1560378355.0,
                                    "replies": [
                                        {
                                            "body": "I never said don't take precautions but alot of these girls go way overboard with them for both platonic m&g and sexy fun time. Acting as if a handful of girls a day gets taken off the streets randomly. It just doesn't happen that often. \n\nI am not going to be scared to go out in a thunderstorm, but I am not going to play golf through one. There is some common sense involved.",
                                            "author": "ZonaCouple",
                                            "id": "eqyavht",
                                            "parent_id": "t1_eqy6udi",
                                            "score": 3,
                                            "created_utc": 1560380276.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": ">  There are guys that have a lot of resentment from decades of women ignoring them so when they get a little money they try to turn the tables\n\nI really believe this is a huge part of it.",
            "author": "pintodinosaur",
            "id": "eqxvrpu",
            "parent_id": "t1_eqx9z7g",
            "score": 5,
            "created_utc": 1560374486.0,
            "replies": [
                {
                    "body": "It has to be.  How does someone have enough anger and venom in them to try to get over on some 22 year old girl.  I won’t pretend all of my SB’s are perfect angels but they were just young ladies trying to get by in a world of fractured families, crushing student loan debt and guys their age that bring little to the table beyond video game and porn addiction.   There is no reason to get over on them because a dude couldn’t get laid 25 years ago when he was 19.  It’s not her fault.",
                    "author": "LotBuilder",
                    "id": "eqy4ahh",
                    "parent_id": "t1_eqxvrpu",
                    "score": 6,
                    "created_utc": 1560377368.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[But were you punched twice in the face, killed, have your jaw broken, get shot, or threatened to have the baby in your womb kicked?](https://www.mic.com/articles/135394/14-women-were-brutally-attacked-for-rejecting-men-why-arent-we-talking-about-it)",
            "author": "RussianAsshole",
            "id": "eqxfcr1",
            "parent_id": "t1_eqx60wp",
            "score": 2,
            "created_utc": 1560368563.0,
            "replies": []
        },
        {
            "body": "Any idea where that is? It’s so pretty",
            "author": "avocadosonpizza",
            "id": "er3f2fl",
            "parent_id": "t1_eqywtf2",
            "score": 1,
            "created_utc": 1560461870.0,
            "replies": [
                {
                    "body": "nope. I was just doing some googling for an image and found it!",
                    "author": null,
                    "id": "er3o882",
                    "parent_id": "t1_er3f2fl",
                    "score": 1,
                    "created_utc": 1560468209.0,
                    "replies": [
                        {
                            "body": "Aw dang it looked super cool",
                            "author": "avocadosonpizza",
                            "id": "er3pshj",
                            "parent_id": "t1_er3o882",
                            "score": 1,
                            "created_utc": 1560469424.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "[lowest violent crime rates in history but women are still being punched, shot, having their jaws broken, and receiving threats to have their pregnant wombs kicked in that same broad daylight you speak of at the hands of men who swear there’s no reason to be afraid of them and don’t understand why we care more about our safety than their feelings.](https://www.mic.com/articles/135394/14-women-were-brutally-attacked-for-rejecting-men-why-arent-we-talking-about-it)\n\n\nLowest crime rates but we’re still huge targets for unwarranted violence while being told that we have little to worry about. And these are only the *reported* cases.",
            "author": "RussianAsshole",
            "id": "eqxgfx8",
            "parent_id": "t1_eqxdec4",
            "score": 12,
            "created_utc": 1560369015.0,
            "replies": [
                {
                    "body": "Of course violence still exists and always will. But it's rare for that to happen between strangers and I am sure that vast majority is domestic abuse. You don't think there was a hell of alot more unreported abuse and violence against women in the 60s and 70s then today? You think the black girl who was raped in the 60s got any attention or even a police report filed in Alabama back then? Come on.",
                    "author": "ZonaCouple",
                    "id": "eqxj7qs",
                    "parent_id": "t1_eqxgfx8",
                    "score": -3,
                    "created_utc": 1560370109.0,
                    "replies": [
                        {
                            "body": "Um what lmao. The abuses of the 60s and 70s matter just as the ones in the present day do. My point is that you’ve said we’re much safer now and I disproved that, betraying your original point. Sounds a lot like “you should be okay with the abuses women suffer today, you should be grateful you aren’t in the 60s when you would’ve been treated even worse despite the present day abuses still being abhorrent!”. Seems like you’re being obtuse on purpose and purposely missing the point so hey, thanks for proving me right.",
                            "author": "RussianAsshole",
                            "id": "eqxjuqn",
                            "parent_id": "t1_eqxj7qs",
                            "score": 6,
                            "created_utc": 1560370436.0,
                            "replies": [
                                {
                                    "body": "No you haven't anyway you cut the cake the crime rates are lower now then then they were. Saying tons of crime goes unreported today only works if you assume all crime was reported in the 60s and 70s which of course it wasn't. The United States is significantly safer today then it was even 20 years ago. That's easily verifiable through the FBI statistics.",
                                    "author": "ZonaCouple",
                                    "id": "eqxr1c6",
                                    "parent_id": "t1_eqxjuqn",
                                    "score": -1,
                                    "created_utc": 1560372891.0,
                                    "replies": [
                                        {
                                            "body": "Oh gosh, could a correlation possibly exist between these historically low crime rates and our current medias' emphases on this 'can't be too safe' rhetoric?? Hm...",
                                            "author": "cldavisch",
                                            "id": "er0hw2h",
                                            "parent_id": "t1_eqxr1c6",
                                            "score": 3,
                                            "created_utc": 1560417181.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "There are only two crimes for which accurate statistics are maintained   \n\nmurder because there is almost always a body  \n\nand\n\nBank Robbery because it must be reported to the feds and is almost always on tape. \n\nBoth dipped after citizens initiated 3 strike laws but have risen significantly  over the past decade.  \n\nCalifornia's catch and release programs have also spawned a vast underreporting of serious but not fatal crimes.  Twenty years ago it was far easier to get crime reports filed. \n\n\nWhile the left is obsessed with gun control they conveniently ignore the fact that the ANNUAL losses from opiate abuse (including synthetics) exceeds our total losses during the 10 year Vietnam war",
                                            "author": "pinotandsugar",
                                            "id": "er223gi",
                                            "parent_id": "t1_eqxr1c6",
                                            "score": 0,
                                            "created_utc": 1560439316.0,
                                            "replies": [
                                                {
                                                    "body": ">Both dipped after citizens initiated 3 strike laws but have risen significantly over the past decade. \n\nAny source for murders going up in the last 10 years? Bank robberies don't really apply to sugar babies. Also not all states have 3 strike laws. \n\n>California's catch and release programs have also spawned a vast underreporting of serious but not fatal crimes. Twenty years ago it was far easier to get crime reports filed. \n\nAgain any source? I just heard a big thing on NPR about how crimes are reported much faster and better then ever before. Because of cell phone use since the 90s going up. Not to mention by almost every statistic all crimes but property and rape (they changed the way it was defined) have been going down for years. Plus every cop that worked in the 80s and 90s will tell you it's way better then back then. With a few cities excluded for local reasons. \n\n>While the left is obsessed with gun control they conveniently ignore the fact that the ANNUAL losses from opiate abuse (including synthetics) exceeds our total losses during the 10 year Vietnam war\n\nAh never mind your one of those.",
                                                    "author": "ZonaCouple",
                                                    "id": "er3hd1j",
                                                    "parent_id": "t1_er223gi",
                                                    "score": 1,
                                                    "created_utc": 1560463271.0,
                                                    "replies": [
                                                        {
                                                            "body": "Crimes may be \"reported to the police \"  but they do not make the \"reported crime\" stats until the police fill out and file a crime report.  For departments like LAPD this is a major effort unless there is a dead body or somebody headed for the hospital.",
                                                            "author": "pinotandsugar",
                                                            "id": "er3n7wd",
                                                            "parent_id": "t1_er3hd1j",
                                                            "score": 0,
                                                            "created_utc": 1560467403.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Okay.",
                                                                    "author": "ZonaCouple",
                                                                    "id": "er3nfp8",
                                                                    "parent_id": "t1_er3n7wd",
                                                                    "score": 1,
                                                                    "created_utc": 1560467578.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Just because you haven’t doesn’t mean most others haven’t either. Some of these “sugar daddies” are creepy old douche canoes who literally HAVE to buy women’s attention. Clearly you are very sheltered and that’s great for you but please, value your safety more and don’t be so naive. Especially when dealing with men who aren’t used to the word no",
            "author": "sugarbabyhopeful",
            "id": "eqxlxl8",
            "parent_id": "t1_eqxiumv",
            "score": 15,
            "created_utc": 1560371164.0,
            "replies": [
                {
                    "body": "“It doesn’t happen to me therefore it doesn’t happen” imagine living in the city that's the capital of catcalling and strange men harassing you in this country yet being told that this barely ever happens when I’ve experienced it and so have all of my female friends at one point, and despite not knowing what part of the country you live in unfortunately I can bet on you experiencing the same. the link I posted would also beg to differ about violence strangers lmao. Girl you said nothing but the truth in response.",
                    "author": "RussianAsshole",
                    "id": "eqxot6j",
                    "parent_id": "t1_eqxlxl8",
                    "score": 12,
                    "created_utc": 1560372111.0,
                    "replies": [
                        {
                            "body": "Isn't NYC like of the safest cities on the planet by crime rates? I mean you should have gone with Chicago or Detroit or something. Being catcalled and harassed is no where near the same thing as abuse. Every women gets catcalled and told disgusting things or sent unsolicited dick pics. Unfortunately that's just life, buys it's far from abuse or murder or kidnapping.",
                            "author": "ZonaCouple",
                            "id": "eqxqmvq",
                            "parent_id": "t1_eqxot6j",
                            "score": 0,
                            "created_utc": 1560372749.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "And lots of those daddies have been robbed and beat up by the girls real boyfriends, It goes both ways trust me. walking around in fear thinking things are going to happen to you just makes you a victim before it happens. \n\nI can promise you I have seen things and lived places you have only heard about. I am the furthest thing from sheltered. It's more likely that your sheltered, privileged upbringing has made you scared of your own shadow.",
                    "author": "ZonaCouple",
                    "id": "eqxq7eh",
                    "parent_id": "t1_eqxlxl8",
                    "score": 0,
                    "created_utc": 1560372601.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "eqxxwcf",
                            "parent_id": "t1_eqxq7eh",
                            "score": 0,
                            "created_utc": 1560375182.0,
                            "replies": [
                                {
                                    "body": "Well your the hopeful and I married my SD so apparently it does.",
                                    "author": "ZonaCouple",
                                    "id": "eqxyrxk",
                                    "parent_id": "t1_eqxxwcf",
                                    "score": 3,
                                    "created_utc": 1560375484.0,
                                    "replies": [
                                        {
                                            "body": "I am a hopeful. I don’t need to marry one 🤷🏻‍♀️",
                                            "author": "sugarbabyhopeful",
                                            "id": "eqxz3oo",
                                            "parent_id": "t1_eqxyrxk",
                                            "score": 3,
                                            "created_utc": 1560375590.0,
                                            "replies": [
                                                {
                                                    "body": "I didn't need to marry him just wanted too. But keep trying you might get lucky.",
                                                    "author": "ZonaCouple",
                                                    "id": "eqy0fs3",
                                                    "parent_id": "t1_eqxz3oo",
                                                    "score": 3,
                                                    "created_utc": 1560376047.0,
                                                    "replies": [
                                                        {
                                                            "body": "No thank you. I don’t buy human beings from Walmart... I respected you and your decisions until that ☹️",
                                                            "author": "sugarbabyhopeful",
                                                            "id": "eqy18zx",
                                                            "parent_id": "t1_eqy0fs3",
                                                            "score": 1,
                                                            "created_utc": 1560376313.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Mmm, so much fun though.",
                                                                    "author": "ZonaCouple",
                                                                    "id": "eqy2w49",
                                                                    "parent_id": "t1_eqy18zx",
                                                                    "score": 1,
                                                                    "created_utc": 1560376880.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "what was this whole thread. lmao.",
                                                                            "author": "curlygoddess93",
                                                                            "id": "er05ojy",
                                                                            "parent_id": "t1_eqy2w49",
                                                                            "score": 1,
                                                                            "created_utc": 1560411200.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "This is a bit like saying \"I have never had an issue not wearing a seatbelt in a car.\" \n\nIt seems to work fine, until you're dead and can no longer post on message boards about how your risky approach works just fine.",
            "author": "antonivs",
            "id": "eqy1srt",
            "parent_id": "t1_eqxiumv",
            "score": 3,
            "created_utc": 1560376504.0,
            "replies": [
                {
                    "body": "No it's nothing like that. It's a bit like saying I have a better chance of winning the lotto then getting struck by lightning so I am not going to be afraid to go outside in a thunderstorm.",
                    "author": "ZonaCouple",
                    "id": "eqy35hm",
                    "parent_id": "t1_eqy1srt",
                    "score": 2,
                    "created_utc": 1560376969.0,
                    "replies": [
                        {
                            "body": "On average there are more than 50 deaths from lightning per year in the US.\n\nIt's likely that 100% of the people who die from lightning strikes are those who weren't careful enough.\n\nSome simple precautions can reduce your chances of dying this way significantly. The same goes for intimate meetings with strangers.",
                            "author": "antonivs",
                            "id": "eqy6udi",
                            "parent_id": "t1_eqy35hm",
                            "score": 1,
                            "created_utc": 1560378355.0,
                            "replies": [
                                {
                                    "body": "I never said don't take precautions but alot of these girls go way overboard with them for both platonic m&g and sexy fun time. Acting as if a handful of girls a day gets taken off the streets randomly. It just doesn't happen that often. \n\nI am not going to be scared to go out in a thunderstorm, but I am not going to play golf through one. There is some common sense involved.",
                                    "author": "ZonaCouple",
                                    "id": "eqyavht",
                                    "parent_id": "t1_eqy6udi",
                                    "score": 3,
                                    "created_utc": 1560380276.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "It has to be.  How does someone have enough anger and venom in them to try to get over on some 22 year old girl.  I won’t pretend all of my SB’s are perfect angels but they were just young ladies trying to get by in a world of fractured families, crushing student loan debt and guys their age that bring little to the table beyond video game and porn addiction.   There is no reason to get over on them because a dude couldn’t get laid 25 years ago when he was 19.  It’s not her fault.",
            "author": "LotBuilder",
            "id": "eqy4ahh",
            "parent_id": "t1_eqxvrpu",
            "score": 6,
            "created_utc": 1560377368.0,
            "replies": []
        },
        {
            "body": "nope. I was just doing some googling for an image and found it!",
            "author": null,
            "id": "er3o882",
            "parent_id": "t1_er3f2fl",
            "score": 1,
            "created_utc": 1560468209.0,
            "replies": [
                {
                    "body": "Aw dang it looked super cool",
                    "author": "avocadosonpizza",
                    "id": "er3pshj",
                    "parent_id": "t1_er3o882",
                    "score": 1,
                    "created_utc": 1560469424.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Of course violence still exists and always will. But it's rare for that to happen between strangers and I am sure that vast majority is domestic abuse. You don't think there was a hell of alot more unreported abuse and violence against women in the 60s and 70s then today? You think the black girl who was raped in the 60s got any attention or even a police report filed in Alabama back then? Come on.",
            "author": "ZonaCouple",
            "id": "eqxj7qs",
            "parent_id": "t1_eqxgfx8",
            "score": -3,
            "created_utc": 1560370109.0,
            "replies": [
                {
                    "body": "Um what lmao. The abuses of the 60s and 70s matter just as the ones in the present day do. My point is that you’ve said we’re much safer now and I disproved that, betraying your original point. Sounds a lot like “you should be okay with the abuses women suffer today, you should be grateful you aren’t in the 60s when you would’ve been treated even worse despite the present day abuses still being abhorrent!”. Seems like you’re being obtuse on purpose and purposely missing the point so hey, thanks for proving me right.",
                    "author": "RussianAsshole",
                    "id": "eqxjuqn",
                    "parent_id": "t1_eqxj7qs",
                    "score": 6,
                    "created_utc": 1560370436.0,
                    "replies": [
                        {
                            "body": "No you haven't anyway you cut the cake the crime rates are lower now then then they were. Saying tons of crime goes unreported today only works if you assume all crime was reported in the 60s and 70s which of course it wasn't. The United States is significantly safer today then it was even 20 years ago. That's easily verifiable through the FBI statistics.",
                            "author": "ZonaCouple",
                            "id": "eqxr1c6",
                            "parent_id": "t1_eqxjuqn",
                            "score": -1,
                            "created_utc": 1560372891.0,
                            "replies": [
                                {
                                    "body": "Oh gosh, could a correlation possibly exist between these historically low crime rates and our current medias' emphases on this 'can't be too safe' rhetoric?? Hm...",
                                    "author": "cldavisch",
                                    "id": "er0hw2h",
                                    "parent_id": "t1_eqxr1c6",
                                    "score": 3,
                                    "created_utc": 1560417181.0,
                                    "replies": []
                                },
                                {
                                    "body": "There are only two crimes for which accurate statistics are maintained   \n\nmurder because there is almost always a body  \n\nand\n\nBank Robbery because it must be reported to the feds and is almost always on tape. \n\nBoth dipped after citizens initiated 3 strike laws but have risen significantly  over the past decade.  \n\nCalifornia's catch and release programs have also spawned a vast underreporting of serious but not fatal crimes.  Twenty years ago it was far easier to get crime reports filed. \n\n\nWhile the left is obsessed with gun control they conveniently ignore the fact that the ANNUAL losses from opiate abuse (including synthetics) exceeds our total losses during the 10 year Vietnam war",
                                    "author": "pinotandsugar",
                                    "id": "er223gi",
                                    "parent_id": "t1_eqxr1c6",
                                    "score": 0,
                                    "created_utc": 1560439316.0,
                                    "replies": [
                                        {
                                            "body": ">Both dipped after citizens initiated 3 strike laws but have risen significantly over the past decade. \n\nAny source for murders going up in the last 10 years? Bank robberies don't really apply to sugar babies. Also not all states have 3 strike laws. \n\n>California's catch and release programs have also spawned a vast underreporting of serious but not fatal crimes. Twenty years ago it was far easier to get crime reports filed. \n\nAgain any source? I just heard a big thing on NPR about how crimes are reported much faster and better then ever before. Because of cell phone use since the 90s going up. Not to mention by almost every statistic all crimes but property and rape (they changed the way it was defined) have been going down for years. Plus every cop that worked in the 80s and 90s will tell you it's way better then back then. With a few cities excluded for local reasons. \n\n>While the left is obsessed with gun control they conveniently ignore the fact that the ANNUAL losses from opiate abuse (including synthetics) exceeds our total losses during the 10 year Vietnam war\n\nAh never mind your one of those.",
                                            "author": "ZonaCouple",
                                            "id": "er3hd1j",
                                            "parent_id": "t1_er223gi",
                                            "score": 1,
                                            "created_utc": 1560463271.0,
                                            "replies": [
                                                {
                                                    "body": "Crimes may be \"reported to the police \"  but they do not make the \"reported crime\" stats until the police fill out and file a crime report.  For departments like LAPD this is a major effort unless there is a dead body or somebody headed for the hospital.",
                                                    "author": "pinotandsugar",
                                                    "id": "er3n7wd",
                                                    "parent_id": "t1_er3hd1j",
                                                    "score": 0,
                                                    "created_utc": 1560467403.0,
                                                    "replies": [
                                                        {
                                                            "body": "Okay.",
                                                            "author": "ZonaCouple",
                                                            "id": "er3nfp8",
                                                            "parent_id": "t1_er3n7wd",
                                                            "score": 1,
                                                            "created_utc": 1560467578.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "“It doesn’t happen to me therefore it doesn’t happen” imagine living in the city that's the capital of catcalling and strange men harassing you in this country yet being told that this barely ever happens when I’ve experienced it and so have all of my female friends at one point, and despite not knowing what part of the country you live in unfortunately I can bet on you experiencing the same. the link I posted would also beg to differ about violence strangers lmao. Girl you said nothing but the truth in response.",
            "author": "RussianAsshole",
            "id": "eqxot6j",
            "parent_id": "t1_eqxlxl8",
            "score": 12,
            "created_utc": 1560372111.0,
            "replies": [
                {
                    "body": "Isn't NYC like of the safest cities on the planet by crime rates? I mean you should have gone with Chicago or Detroit or something. Being catcalled and harassed is no where near the same thing as abuse. Every women gets catcalled and told disgusting things or sent unsolicited dick pics. Unfortunately that's just life, buys it's far from abuse or murder or kidnapping.",
                    "author": "ZonaCouple",
                    "id": "eqxqmvq",
                    "parent_id": "t1_eqxot6j",
                    "score": 0,
                    "created_utc": 1560372749.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "And lots of those daddies have been robbed and beat up by the girls real boyfriends, It goes both ways trust me. walking around in fear thinking things are going to happen to you just makes you a victim before it happens. \n\nI can promise you I have seen things and lived places you have only heard about. I am the furthest thing from sheltered. It's more likely that your sheltered, privileged upbringing has made you scared of your own shadow.",
            "author": "ZonaCouple",
            "id": "eqxq7eh",
            "parent_id": "t1_eqxlxl8",
            "score": 0,
            "created_utc": 1560372601.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "eqxxwcf",
                    "parent_id": "t1_eqxq7eh",
                    "score": 0,
                    "created_utc": 1560375182.0,
                    "replies": [
                        {
                            "body": "Well your the hopeful and I married my SD so apparently it does.",
                            "author": "ZonaCouple",
                            "id": "eqxyrxk",
                            "parent_id": "t1_eqxxwcf",
                            "score": 3,
                            "created_utc": 1560375484.0,
                            "replies": [
                                {
                                    "body": "I am a hopeful. I don’t need to marry one 🤷🏻‍♀️",
                                    "author": "sugarbabyhopeful",
                                    "id": "eqxz3oo",
                                    "parent_id": "t1_eqxyrxk",
                                    "score": 3,
                                    "created_utc": 1560375590.0,
                                    "replies": [
                                        {
                                            "body": "I didn't need to marry him just wanted too. But keep trying you might get lucky.",
                                            "author": "ZonaCouple",
                                            "id": "eqy0fs3",
                                            "parent_id": "t1_eqxz3oo",
                                            "score": 3,
                                            "created_utc": 1560376047.0,
                                            "replies": [
                                                {
                                                    "body": "No thank you. I don’t buy human beings from Walmart... I respected you and your decisions until that ☹️",
                                                    "author": "sugarbabyhopeful",
                                                    "id": "eqy18zx",
                                                    "parent_id": "t1_eqy0fs3",
                                                    "score": 1,
                                                    "created_utc": 1560376313.0,
                                                    "replies": [
                                                        {
                                                            "body": "Mmm, so much fun though.",
                                                            "author": "ZonaCouple",
                                                            "id": "eqy2w49",
                                                            "parent_id": "t1_eqy18zx",
                                                            "score": 1,
                                                            "created_utc": 1560376880.0,
                                                            "replies": [
                                                                {
                                                                    "body": "what was this whole thread. lmao.",
                                                                    "author": "curlygoddess93",
                                                                    "id": "er05ojy",
                                                                    "parent_id": "t1_eqy2w49",
                                                                    "score": 1,
                                                                    "created_utc": 1560411200.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "No it's nothing like that. It's a bit like saying I have a better chance of winning the lotto then getting struck by lightning so I am not going to be afraid to go outside in a thunderstorm.",
            "author": "ZonaCouple",
            "id": "eqy35hm",
            "parent_id": "t1_eqy1srt",
            "score": 2,
            "created_utc": 1560376969.0,
            "replies": [
                {
                    "body": "On average there are more than 50 deaths from lightning per year in the US.\n\nIt's likely that 100% of the people who die from lightning strikes are those who weren't careful enough.\n\nSome simple precautions can reduce your chances of dying this way significantly. The same goes for intimate meetings with strangers.",
                    "author": "antonivs",
                    "id": "eqy6udi",
                    "parent_id": "t1_eqy35hm",
                    "score": 1,
                    "created_utc": 1560378355.0,
                    "replies": [
                        {
                            "body": "I never said don't take precautions but alot of these girls go way overboard with them for both platonic m&g and sexy fun time. Acting as if a handful of girls a day gets taken off the streets randomly. It just doesn't happen that often. \n\nI am not going to be scared to go out in a thunderstorm, but I am not going to play golf through one. There is some common sense involved.",
                            "author": "ZonaCouple",
                            "id": "eqyavht",
                            "parent_id": "t1_eqy6udi",
                            "score": 3,
                            "created_utc": 1560380276.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Aw dang it looked super cool",
            "author": "avocadosonpizza",
            "id": "er3pshj",
            "parent_id": "t1_er3o882",
            "score": 1,
            "created_utc": 1560469424.0,
            "replies": []
        },
        {
            "body": "Um what lmao. The abuses of the 60s and 70s matter just as the ones in the present day do. My point is that you’ve said we’re much safer now and I disproved that, betraying your original point. Sounds a lot like “you should be okay with the abuses women suffer today, you should be grateful you aren’t in the 60s when you would’ve been treated even worse despite the present day abuses still being abhorrent!”. Seems like you’re being obtuse on purpose and purposely missing the point so hey, thanks for proving me right.",
            "author": "RussianAsshole",
            "id": "eqxjuqn",
            "parent_id": "t1_eqxj7qs",
            "score": 6,
            "created_utc": 1560370436.0,
            "replies": [
                {
                    "body": "No you haven't anyway you cut the cake the crime rates are lower now then then they were. Saying tons of crime goes unreported today only works if you assume all crime was reported in the 60s and 70s which of course it wasn't. The United States is significantly safer today then it was even 20 years ago. That's easily verifiable through the FBI statistics.",
                    "author": "ZonaCouple",
                    "id": "eqxr1c6",
                    "parent_id": "t1_eqxjuqn",
                    "score": -1,
                    "created_utc": 1560372891.0,
                    "replies": [
                        {
                            "body": "Oh gosh, could a correlation possibly exist between these historically low crime rates and our current medias' emphases on this 'can't be too safe' rhetoric?? Hm...",
                            "author": "cldavisch",
                            "id": "er0hw2h",
                            "parent_id": "t1_eqxr1c6",
                            "score": 3,
                            "created_utc": 1560417181.0,
                            "replies": []
                        },
                        {
                            "body": "There are only two crimes for which accurate statistics are maintained   \n\nmurder because there is almost always a body  \n\nand\n\nBank Robbery because it must be reported to the feds and is almost always on tape. \n\nBoth dipped after citizens initiated 3 strike laws but have risen significantly  over the past decade.  \n\nCalifornia's catch and release programs have also spawned a vast underreporting of serious but not fatal crimes.  Twenty years ago it was far easier to get crime reports filed. \n\n\nWhile the left is obsessed with gun control they conveniently ignore the fact that the ANNUAL losses from opiate abuse (including synthetics) exceeds our total losses during the 10 year Vietnam war",
                            "author": "pinotandsugar",
                            "id": "er223gi",
                            "parent_id": "t1_eqxr1c6",
                            "score": 0,
                            "created_utc": 1560439316.0,
                            "replies": [
                                {
                                    "body": ">Both dipped after citizens initiated 3 strike laws but have risen significantly over the past decade. \n\nAny source for murders going up in the last 10 years? Bank robberies don't really apply to sugar babies. Also not all states have 3 strike laws. \n\n>California's catch and release programs have also spawned a vast underreporting of serious but not fatal crimes. Twenty years ago it was far easier to get crime reports filed. \n\nAgain any source? I just heard a big thing on NPR about how crimes are reported much faster and better then ever before. Because of cell phone use since the 90s going up. Not to mention by almost every statistic all crimes but property and rape (they changed the way it was defined) have been going down for years. Plus every cop that worked in the 80s and 90s will tell you it's way better then back then. With a few cities excluded for local reasons. \n\n>While the left is obsessed with gun control they conveniently ignore the fact that the ANNUAL losses from opiate abuse (including synthetics) exceeds our total losses during the 10 year Vietnam war\n\nAh never mind your one of those.",
                                    "author": "ZonaCouple",
                                    "id": "er3hd1j",
                                    "parent_id": "t1_er223gi",
                                    "score": 1,
                                    "created_utc": 1560463271.0,
                                    "replies": [
                                        {
                                            "body": "Crimes may be \"reported to the police \"  but they do not make the \"reported crime\" stats until the police fill out and file a crime report.  For departments like LAPD this is a major effort unless there is a dead body or somebody headed for the hospital.",
                                            "author": "pinotandsugar",
                                            "id": "er3n7wd",
                                            "parent_id": "t1_er3hd1j",
                                            "score": 0,
                                            "created_utc": 1560467403.0,
                                            "replies": [
                                                {
                                                    "body": "Okay.",
                                                    "author": "ZonaCouple",
                                                    "id": "er3nfp8",
                                                    "parent_id": "t1_er3n7wd",
                                                    "score": 1,
                                                    "created_utc": 1560467578.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Isn't NYC like of the safest cities on the planet by crime rates? I mean you should have gone with Chicago or Detroit or something. Being catcalled and harassed is no where near the same thing as abuse. Every women gets catcalled and told disgusting things or sent unsolicited dick pics. Unfortunately that's just life, buys it's far from abuse or murder or kidnapping.",
            "author": "ZonaCouple",
            "id": "eqxqmvq",
            "parent_id": "t1_eqxot6j",
            "score": 0,
            "created_utc": 1560372749.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "eqxxwcf",
            "parent_id": "t1_eqxq7eh",
            "score": 0,
            "created_utc": 1560375182.0,
            "replies": [
                {
                    "body": "Well your the hopeful and I married my SD so apparently it does.",
                    "author": "ZonaCouple",
                    "id": "eqxyrxk",
                    "parent_id": "t1_eqxxwcf",
                    "score": 3,
                    "created_utc": 1560375484.0,
                    "replies": [
                        {
                            "body": "I am a hopeful. I don’t need to marry one 🤷🏻‍♀️",
                            "author": "sugarbabyhopeful",
                            "id": "eqxz3oo",
                            "parent_id": "t1_eqxyrxk",
                            "score": 3,
                            "created_utc": 1560375590.0,
                            "replies": [
                                {
                                    "body": "I didn't need to marry him just wanted too. But keep trying you might get lucky.",
                                    "author": "ZonaCouple",
                                    "id": "eqy0fs3",
                                    "parent_id": "t1_eqxz3oo",
                                    "score": 3,
                                    "created_utc": 1560376047.0,
                                    "replies": [
                                        {
                                            "body": "No thank you. I don’t buy human beings from Walmart... I respected you and your decisions until that ☹️",
                                            "author": "sugarbabyhopeful",
                                            "id": "eqy18zx",
                                            "parent_id": "t1_eqy0fs3",
                                            "score": 1,
                                            "created_utc": 1560376313.0,
                                            "replies": [
                                                {
                                                    "body": "Mmm, so much fun though.",
                                                    "author": "ZonaCouple",
                                                    "id": "eqy2w49",
                                                    "parent_id": "t1_eqy18zx",
                                                    "score": 1,
                                                    "created_utc": 1560376880.0,
                                                    "replies": [
                                                        {
                                                            "body": "what was this whole thread. lmao.",
                                                            "author": "curlygoddess93",
                                                            "id": "er05ojy",
                                                            "parent_id": "t1_eqy2w49",
                                                            "score": 1,
                                                            "created_utc": 1560411200.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "On average there are more than 50 deaths from lightning per year in the US.\n\nIt's likely that 100% of the people who die from lightning strikes are those who weren't careful enough.\n\nSome simple precautions can reduce your chances of dying this way significantly. The same goes for intimate meetings with strangers.",
            "author": "antonivs",
            "id": "eqy6udi",
            "parent_id": "t1_eqy35hm",
            "score": 1,
            "created_utc": 1560378355.0,
            "replies": [
                {
                    "body": "I never said don't take precautions but alot of these girls go way overboard with them for both platonic m&g and sexy fun time. Acting as if a handful of girls a day gets taken off the streets randomly. It just doesn't happen that often. \n\nI am not going to be scared to go out in a thunderstorm, but I am not going to play golf through one. There is some common sense involved.",
                    "author": "ZonaCouple",
                    "id": "eqyavht",
                    "parent_id": "t1_eqy6udi",
                    "score": 3,
                    "created_utc": 1560380276.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "No you haven't anyway you cut the cake the crime rates are lower now then then they were. Saying tons of crime goes unreported today only works if you assume all crime was reported in the 60s and 70s which of course it wasn't. The United States is significantly safer today then it was even 20 years ago. That's easily verifiable through the FBI statistics.",
            "author": "ZonaCouple",
            "id": "eqxr1c6",
            "parent_id": "t1_eqxjuqn",
            "score": -1,
            "created_utc": 1560372891.0,
            "replies": [
                {
                    "body": "Oh gosh, could a correlation possibly exist between these historically low crime rates and our current medias' emphases on this 'can't be too safe' rhetoric?? Hm...",
                    "author": "cldavisch",
                    "id": "er0hw2h",
                    "parent_id": "t1_eqxr1c6",
                    "score": 3,
                    "created_utc": 1560417181.0,
                    "replies": []
                },
                {
                    "body": "There are only two crimes for which accurate statistics are maintained   \n\nmurder because there is almost always a body  \n\nand\n\nBank Robbery because it must be reported to the feds and is almost always on tape. \n\nBoth dipped after citizens initiated 3 strike laws but have risen significantly  over the past decade.  \n\nCalifornia's catch and release programs have also spawned a vast underreporting of serious but not fatal crimes.  Twenty years ago it was far easier to get crime reports filed. \n\n\nWhile the left is obsessed with gun control they conveniently ignore the fact that the ANNUAL losses from opiate abuse (including synthetics) exceeds our total losses during the 10 year Vietnam war",
                    "author": "pinotandsugar",
                    "id": "er223gi",
                    "parent_id": "t1_eqxr1c6",
                    "score": 0,
                    "created_utc": 1560439316.0,
                    "replies": [
                        {
                            "body": ">Both dipped after citizens initiated 3 strike laws but have risen significantly over the past decade. \n\nAny source for murders going up in the last 10 years? Bank robberies don't really apply to sugar babies. Also not all states have 3 strike laws. \n\n>California's catch and release programs have also spawned a vast underreporting of serious but not fatal crimes. Twenty years ago it was far easier to get crime reports filed. \n\nAgain any source? I just heard a big thing on NPR about how crimes are reported much faster and better then ever before. Because of cell phone use since the 90s going up. Not to mention by almost every statistic all crimes but property and rape (they changed the way it was defined) have been going down for years. Plus every cop that worked in the 80s and 90s will tell you it's way better then back then. With a few cities excluded for local reasons. \n\n>While the left is obsessed with gun control they conveniently ignore the fact that the ANNUAL losses from opiate abuse (including synthetics) exceeds our total losses during the 10 year Vietnam war\n\nAh never mind your one of those.",
                            "author": "ZonaCouple",
                            "id": "er3hd1j",
                            "parent_id": "t1_er223gi",
                            "score": 1,
                            "created_utc": 1560463271.0,
                            "replies": [
                                {
                                    "body": "Crimes may be \"reported to the police \"  but they do not make the \"reported crime\" stats until the police fill out and file a crime report.  For departments like LAPD this is a major effort unless there is a dead body or somebody headed for the hospital.",
                                    "author": "pinotandsugar",
                                    "id": "er3n7wd",
                                    "parent_id": "t1_er3hd1j",
                                    "score": 0,
                                    "created_utc": 1560467403.0,
                                    "replies": [
                                        {
                                            "body": "Okay.",
                                            "author": "ZonaCouple",
                                            "id": "er3nfp8",
                                            "parent_id": "t1_er3n7wd",
                                            "score": 1,
                                            "created_utc": 1560467578.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Well your the hopeful and I married my SD so apparently it does.",
            "author": "ZonaCouple",
            "id": "eqxyrxk",
            "parent_id": "t1_eqxxwcf",
            "score": 3,
            "created_utc": 1560375484.0,
            "replies": [
                {
                    "body": "I am a hopeful. I don’t need to marry one 🤷🏻‍♀️",
                    "author": "sugarbabyhopeful",
                    "id": "eqxz3oo",
                    "parent_id": "t1_eqxyrxk",
                    "score": 3,
                    "created_utc": 1560375590.0,
                    "replies": [
                        {
                            "body": "I didn't need to marry him just wanted too. But keep trying you might get lucky.",
                            "author": "ZonaCouple",
                            "id": "eqy0fs3",
                            "parent_id": "t1_eqxz3oo",
                            "score": 3,
                            "created_utc": 1560376047.0,
                            "replies": [
                                {
                                    "body": "No thank you. I don’t buy human beings from Walmart... I respected you and your decisions until that ☹️",
                                    "author": "sugarbabyhopeful",
                                    "id": "eqy18zx",
                                    "parent_id": "t1_eqy0fs3",
                                    "score": 1,
                                    "created_utc": 1560376313.0,
                                    "replies": [
                                        {
                                            "body": "Mmm, so much fun though.",
                                            "author": "ZonaCouple",
                                            "id": "eqy2w49",
                                            "parent_id": "t1_eqy18zx",
                                            "score": 1,
                                            "created_utc": 1560376880.0,
                                            "replies": [
                                                {
                                                    "body": "what was this whole thread. lmao.",
                                                    "author": "curlygoddess93",
                                                    "id": "er05ojy",
                                                    "parent_id": "t1_eqy2w49",
                                                    "score": 1,
                                                    "created_utc": 1560411200.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I never said don't take precautions but alot of these girls go way overboard with them for both platonic m&g and sexy fun time. Acting as if a handful of girls a day gets taken off the streets randomly. It just doesn't happen that often. \n\nI am not going to be scared to go out in a thunderstorm, but I am not going to play golf through one. There is some common sense involved.",
            "author": "ZonaCouple",
            "id": "eqyavht",
            "parent_id": "t1_eqy6udi",
            "score": 3,
            "created_utc": 1560380276.0,
            "replies": []
        },
        {
            "body": "Oh gosh, could a correlation possibly exist between these historically low crime rates and our current medias' emphases on this 'can't be too safe' rhetoric?? Hm...",
            "author": "cldavisch",
            "id": "er0hw2h",
            "parent_id": "t1_eqxr1c6",
            "score": 3,
            "created_utc": 1560417181.0,
            "replies": []
        },
        {
            "body": "There are only two crimes for which accurate statistics are maintained   \n\nmurder because there is almost always a body  \n\nand\n\nBank Robbery because it must be reported to the feds and is almost always on tape. \n\nBoth dipped after citizens initiated 3 strike laws but have risen significantly  over the past decade.  \n\nCalifornia's catch and release programs have also spawned a vast underreporting of serious but not fatal crimes.  Twenty years ago it was far easier to get crime reports filed. \n\n\nWhile the left is obsessed with gun control they conveniently ignore the fact that the ANNUAL losses from opiate abuse (including synthetics) exceeds our total losses during the 10 year Vietnam war",
            "author": "pinotandsugar",
            "id": "er223gi",
            "parent_id": "t1_eqxr1c6",
            "score": 0,
            "created_utc": 1560439316.0,
            "replies": [
                {
                    "body": ">Both dipped after citizens initiated 3 strike laws but have risen significantly over the past decade. \n\nAny source for murders going up in the last 10 years? Bank robberies don't really apply to sugar babies. Also not all states have 3 strike laws. \n\n>California's catch and release programs have also spawned a vast underreporting of serious but not fatal crimes. Twenty years ago it was far easier to get crime reports filed. \n\nAgain any source? I just heard a big thing on NPR about how crimes are reported much faster and better then ever before. Because of cell phone use since the 90s going up. Not to mention by almost every statistic all crimes but property and rape (they changed the way it was defined) have been going down for years. Plus every cop that worked in the 80s and 90s will tell you it's way better then back then. With a few cities excluded for local reasons. \n\n>While the left is obsessed with gun control they conveniently ignore the fact that the ANNUAL losses from opiate abuse (including synthetics) exceeds our total losses during the 10 year Vietnam war\n\nAh never mind your one of those.",
                    "author": "ZonaCouple",
                    "id": "er3hd1j",
                    "parent_id": "t1_er223gi",
                    "score": 1,
                    "created_utc": 1560463271.0,
                    "replies": [
                        {
                            "body": "Crimes may be \"reported to the police \"  but they do not make the \"reported crime\" stats until the police fill out and file a crime report.  For departments like LAPD this is a major effort unless there is a dead body or somebody headed for the hospital.",
                            "author": "pinotandsugar",
                            "id": "er3n7wd",
                            "parent_id": "t1_er3hd1j",
                            "score": 0,
                            "created_utc": 1560467403.0,
                            "replies": [
                                {
                                    "body": "Okay.",
                                    "author": "ZonaCouple",
                                    "id": "er3nfp8",
                                    "parent_id": "t1_er3n7wd",
                                    "score": 1,
                                    "created_utc": 1560467578.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I am a hopeful. I don’t need to marry one 🤷🏻‍♀️",
            "author": "sugarbabyhopeful",
            "id": "eqxz3oo",
            "parent_id": "t1_eqxyrxk",
            "score": 3,
            "created_utc": 1560375590.0,
            "replies": [
                {
                    "body": "I didn't need to marry him just wanted too. But keep trying you might get lucky.",
                    "author": "ZonaCouple",
                    "id": "eqy0fs3",
                    "parent_id": "t1_eqxz3oo",
                    "score": 3,
                    "created_utc": 1560376047.0,
                    "replies": [
                        {
                            "body": "No thank you. I don’t buy human beings from Walmart... I respected you and your decisions until that ☹️",
                            "author": "sugarbabyhopeful",
                            "id": "eqy18zx",
                            "parent_id": "t1_eqy0fs3",
                            "score": 1,
                            "created_utc": 1560376313.0,
                            "replies": [
                                {
                                    "body": "Mmm, so much fun though.",
                                    "author": "ZonaCouple",
                                    "id": "eqy2w49",
                                    "parent_id": "t1_eqy18zx",
                                    "score": 1,
                                    "created_utc": 1560376880.0,
                                    "replies": [
                                        {
                                            "body": "what was this whole thread. lmao.",
                                            "author": "curlygoddess93",
                                            "id": "er05ojy",
                                            "parent_id": "t1_eqy2w49",
                                            "score": 1,
                                            "created_utc": 1560411200.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": ">Both dipped after citizens initiated 3 strike laws but have risen significantly over the past decade. \n\nAny source for murders going up in the last 10 years? Bank robberies don't really apply to sugar babies. Also not all states have 3 strike laws. \n\n>California's catch and release programs have also spawned a vast underreporting of serious but not fatal crimes. Twenty years ago it was far easier to get crime reports filed. \n\nAgain any source? I just heard a big thing on NPR about how crimes are reported much faster and better then ever before. Because of cell phone use since the 90s going up. Not to mention by almost every statistic all crimes but property and rape (they changed the way it was defined) have been going down for years. Plus every cop that worked in the 80s and 90s will tell you it's way better then back then. With a few cities excluded for local reasons. \n\n>While the left is obsessed with gun control they conveniently ignore the fact that the ANNUAL losses from opiate abuse (including synthetics) exceeds our total losses during the 10 year Vietnam war\n\nAh never mind your one of those.",
            "author": "ZonaCouple",
            "id": "er3hd1j",
            "parent_id": "t1_er223gi",
            "score": 1,
            "created_utc": 1560463271.0,
            "replies": [
                {
                    "body": "Crimes may be \"reported to the police \"  but they do not make the \"reported crime\" stats until the police fill out and file a crime report.  For departments like LAPD this is a major effort unless there is a dead body or somebody headed for the hospital.",
                    "author": "pinotandsugar",
                    "id": "er3n7wd",
                    "parent_id": "t1_er3hd1j",
                    "score": 0,
                    "created_utc": 1560467403.0,
                    "replies": [
                        {
                            "body": "Okay.",
                            "author": "ZonaCouple",
                            "id": "er3nfp8",
                            "parent_id": "t1_er3n7wd",
                            "score": 1,
                            "created_utc": 1560467578.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I didn't need to marry him just wanted too. But keep trying you might get lucky.",
            "author": "ZonaCouple",
            "id": "eqy0fs3",
            "parent_id": "t1_eqxz3oo",
            "score": 3,
            "created_utc": 1560376047.0,
            "replies": [
                {
                    "body": "No thank you. I don’t buy human beings from Walmart... I respected you and your decisions until that ☹️",
                    "author": "sugarbabyhopeful",
                    "id": "eqy18zx",
                    "parent_id": "t1_eqy0fs3",
                    "score": 1,
                    "created_utc": 1560376313.0,
                    "replies": [
                        {
                            "body": "Mmm, so much fun though.",
                            "author": "ZonaCouple",
                            "id": "eqy2w49",
                            "parent_id": "t1_eqy18zx",
                            "score": 1,
                            "created_utc": 1560376880.0,
                            "replies": [
                                {
                                    "body": "what was this whole thread. lmao.",
                                    "author": "curlygoddess93",
                                    "id": "er05ojy",
                                    "parent_id": "t1_eqy2w49",
                                    "score": 1,
                                    "created_utc": 1560411200.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Crimes may be \"reported to the police \"  but they do not make the \"reported crime\" stats until the police fill out and file a crime report.  For departments like LAPD this is a major effort unless there is a dead body or somebody headed for the hospital.",
            "author": "pinotandsugar",
            "id": "er3n7wd",
            "parent_id": "t1_er3hd1j",
            "score": 0,
            "created_utc": 1560467403.0,
            "replies": [
                {
                    "body": "Okay.",
                    "author": "ZonaCouple",
                    "id": "er3nfp8",
                    "parent_id": "t1_er3n7wd",
                    "score": 1,
                    "created_utc": 1560467578.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "No thank you. I don’t buy human beings from Walmart... I respected you and your decisions until that ☹️",
            "author": "sugarbabyhopeful",
            "id": "eqy18zx",
            "parent_id": "t1_eqy0fs3",
            "score": 1,
            "created_utc": 1560376313.0,
            "replies": [
                {
                    "body": "Mmm, so much fun though.",
                    "author": "ZonaCouple",
                    "id": "eqy2w49",
                    "parent_id": "t1_eqy18zx",
                    "score": 1,
                    "created_utc": 1560376880.0,
                    "replies": [
                        {
                            "body": "what was this whole thread. lmao.",
                            "author": "curlygoddess93",
                            "id": "er05ojy",
                            "parent_id": "t1_eqy2w49",
                            "score": 1,
                            "created_utc": 1560411200.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Okay.",
            "author": "ZonaCouple",
            "id": "er3nfp8",
            "parent_id": "t1_er3n7wd",
            "score": 1,
            "created_utc": 1560467578.0,
            "replies": []
        },
        {
            "body": "Mmm, so much fun though.",
            "author": "ZonaCouple",
            "id": "eqy2w49",
            "parent_id": "t1_eqy18zx",
            "score": 1,
            "created_utc": 1560376880.0,
            "replies": [
                {
                    "body": "what was this whole thread. lmao.",
                    "author": "curlygoddess93",
                    "id": "er05ojy",
                    "parent_id": "t1_eqy2w49",
                    "score": 1,
                    "created_utc": 1560411200.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "what was this whole thread. lmao.",
            "author": "curlygoddess93",
            "id": "er05ojy",
            "parent_id": "t1_eqy2w49",
            "score": 1,
            "created_utc": 1560411200.0,
            "replies": []
        }
    ]
}