{
    "title": "I’m 14 years old and I’m losing more hair than my dad. I’ve gone to the doctor 2 times because of this and I’ve received no help. I’m starting to feel like It’s worthless and my hairs gonna look like this forever. I don’t know how anyone could help me but it’s always worth a shot.",
    "post_id": "jjvzw1",
    "post_url": "https://www.reddit.com/r/malehairadvice/comments/jjvzw1/im_14_years_old_and_im_losing_more_hair_than_my/",
    "author": "fuckedup14yearold",
    "body": "",
    "url": "https://i.redd.it/6g5ri2vwdwv51.jpg",
    "score": 732,
    "upvote_ratio": 1.0,
    "created_utc": 1603917912.0,
    "num_comments": 79,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "14? Dermatologist for hairloss asap, at your age it could be a vitamin defiency or your hormones, so going to a endocrinologist could be the key, the bloodtest they ask for is more specific than regular doctors, its the common bloodtest + hormone levels. Do not despair, there are treatments for alopecia.  \nBut also, you are very young, you can shave now, its a shock at first but everyone (including you) gets used to it. You can buzzcut while you do the treatment.",
            "author": "DarkGhost999",
            "id": "gafxqyd",
            "parent_id": "t3_jjvzw1",
            "score": 207,
            "created_utc": 1603931674.0,
            "replies": [
                {
                    "body": "I'm sorry, and I don't want to scare you, but I think you need to go to a endocrinologist because this doesnt seem like the common balding of hereditary alopecia, this looks more like the symptom of something else. And please don't start with finasteride at your age, it \"blocks\" the hormone that causes balding very effectively, but at your age you NEED that hormone.",
                    "author": "DarkGhost999",
                    "id": "gafzfen",
                    "parent_id": "t1_gafxqyd",
                    "score": 70,
                    "created_utc": 1603932584.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gafh3g7",
            "parent_id": "t3_jjvzw1",
            "score": 510,
            "created_utc": 1603923692.0,
            "replies": [
                {
                    "body": "Yeah, I'd agree with you 100%. I don't think I've ever seen any type of regular male pattern baldness balding where the hairline doesn't go and the rest of the hair just thins as it is, and from what I can see his hairline looks pretty good. Just a question, u/fuckedup14yearold, have you ever had a blood test taken? What'd the doctors do when you went to see them about it?",
                    "author": "AyeAye_Kane",
                    "id": "gagay6p",
                    "parent_id": "t1_gafh3g7",
                    "score": 108,
                    "created_utc": 1603939040.0,
                    "replies": [
                        {
                            "body": "Yeah this is known as female pattern baldness, where the crown goes and the hairline is preserved. Very unusual for a man, much less a boy.",
                            "author": "bigmac4812",
                            "id": "gagq0yv",
                            "parent_id": "t1_gagay6p",
                            "score": 40,
                            "created_utc": 1603949779.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Get a blood test taken to see what vitamins you’re lacking. Certain vitamins and supplements can help fill in your hair. I agree with 7strap, this doesn’t really look like MPB much less if your dad’s or mom’s isn’t as bad. Get a blood test asap to see your deficiencies.",
            "author": "OmarS1018",
            "id": "gafps57",
            "parent_id": "t3_jjvzw1",
            "score": 248,
            "created_utc": 1603927288.0,
            "replies": []
        },
        {
            "body": "Why is everyone saying he should just buzz it all of? He's 14 and already this advanced in balding. Because of how long the hair growth cycle it would take years to notice that your balding, he could have started balding at the age of 9. There could be a medical issue here. I suggest going to a doctor that specializes in hair loss. Most doctors don't give a shit about hair loss because it's seen as a cosmetic issue.",
            "author": "knowledgeisnotpower",
            "id": "gafsxf4",
            "parent_id": "t3_jjvzw1",
            "score": 245,
            "created_utc": 1603929037.0,
            "replies": [
                {
                    "body": "This comment right here, some saying he should buzz it all off seem to completely ignore the fact that OP is 14. Maybe he could buzz it to limit the damage of how it looks aesthetically, but I would definitely go see a specialist because I’m no docotor, but that doesn’t seem normal",
                    "author": "templario765",
                    "id": "gag08ew",
                    "parent_id": "t1_gafsxf4",
                    "score": 78,
                    "created_utc": 1603933024.0,
                    "replies": [
                        {
                            "body": "This is a hair advice sub. They’re just advising him it’d look better buzzed if he’s already losing it. But yes he definitely should see a doctor",
                            "author": "Dmaj6",
                            "id": "gag4mff",
                            "parent_id": "t1_gag08ew",
                            "score": 24,
                            "created_utc": 1603935467.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Yeah, this seems kinda concerning",
                    "author": "TheRighteousHimbo",
                    "id": "gafy7ge",
                    "parent_id": "t1_gafsxf4",
                    "score": 16,
                    "created_utc": 1603931924.0,
                    "replies": []
                },
                {
                    "body": "Finally a decent comment",
                    "author": "Today_Either",
                    "id": "gag17rv",
                    "parent_id": "t1_gafsxf4",
                    "score": 2,
                    "created_utc": 1603933565.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "You need a specialist. Your other post said this began at age 12, there’s almost no chance this is MPB. See a dermatologist and/or get blood work done to see if you have a vitamin deficiency.\nIt’s easy for other people to sit back and say to shave your head but my best friend lost every hair on his body from alopecia and it’s no joke. You’ll get through this man, just keep your head up.",
            "author": "HorkingWalrus",
            "id": "gafzyun",
            "parent_id": "t3_jjvzw1",
            "score": 37,
            "created_utc": 1603932876.0,
            "replies": []
        },
        {
            "body": "Jesus christ man, i am so sorry for this. Unlucky. I can't belive what you are going through right now, i am truly sorry, at your age.. jesus",
            "author": null,
            "id": "gafbu1g",
            "parent_id": "t3_jjvzw1",
            "score": 104,
            "created_utc": 1603921115.0,
            "replies": [
                {
                    "body": "Yes 14. Thats very very very young. Am very shocked. Feel awful on him",
                    "author": "18sheil",
                    "id": "gafi6xa",
                    "parent_id": "t1_gafbu1g",
                    "score": 59,
                    "created_utc": 1603924251.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "This isnt baldness, this is a medical condition/concern. Go to a doctor and get your hormones tested. Way too young",
            "author": "hamletgod",
            "id": "gag450v",
            "parent_id": "t3_jjvzw1",
            "score": 24,
            "created_utc": 1603935202.0,
            "replies": [
                {
                    "body": "Yeah no way it’s early MPB",
                    "author": "jyok33",
                    "id": "gagwsh2",
                    "parent_id": "t1_gag450v",
                    "score": 2,
                    "created_utc": 1603956702.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Please do not take finasteride or minoxidil you are way too young. This has to be some sort of deficiency or (hopefully not) thyroid issue. Please get a blood test!",
            "author": "KennCS",
            "id": "gagxtsq",
            "parent_id": "t3_jjvzw1",
            "score": 10,
            "created_utc": 1603957878.0,
            "replies": []
        },
        {
            "body": "Do NOT buzz it off. It's a hormone or vitamin deficiency. It's a serious health problem that my friend also had, his hair grew back normal after he was treated. So don't worry!",
            "author": "satisfyingbagels",
            "id": "gai2on7",
            "parent_id": "t3_jjvzw1",
            "score": 7,
            "created_utc": 1603987201.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gafao9l",
            "parent_id": "t3_jjvzw1",
            "score": 87,
            "created_utc": 1603920562.0,
            "replies": [
                {
                    "body": "Terrible advice, there’s a picture of you on your profile and your hair looks nothing like OPs. He clearly has some kind of condition, plus there’s a big difference between 14 and 17",
                    "author": "KrazyKoolKookaburra",
                    "id": "gahkvx0",
                    "parent_id": "t1_gafao9l",
                    "score": 5,
                    "created_utc": 1603978331.0,
                    "replies": []
                },
                {
                    "body": "Bro he’s 14 he’s not even done puberty. He should not be losing his hair like this, this isn’t male pattern baldness",
                    "author": "talkingspacecoyote",
                    "id": "gaimvgq",
                    "parent_id": "t1_gafao9l",
                    "score": 1,
                    "created_utc": 1603995876.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "What kinda fucking doctor looks at that and goes “ ehhh looks fine to me “",
            "author": "Oregongrown96",
            "id": "gagpdly",
            "parent_id": "t3_jjvzw1",
            "score": 10,
            "created_utc": 1603949203.0,
            "replies": []
        },
        {
            "body": "Go to a doctor that knows what they are doing. There is no reason to be going through male pattern baldness at 14 years old.",
            "author": "JMax235",
            "id": "gafx1ci",
            "parent_id": "t3_jjvzw1",
            "score": 7,
            "created_utc": 1603931279.0,
            "replies": []
        },
        {
            "body": "go to another doctor this is serious",
            "author": "Bonemonkey80",
            "id": "gai3vji",
            "parent_id": "t3_jjvzw1",
            "score": 3,
            "created_utc": 1603987767.0,
            "replies": []
        },
        {
            "body": "Dang man I know it sucks dude, but honestly, I would just buzz it all off to a #1.  It may take a bit to get used to it... but it will look a lot better..  and you can stop stressing about it!",
            "author": "Longislandtea12",
            "id": "gaf7xh4",
            "parent_id": "t3_jjvzw1",
            "score": 13,
            "created_utc": 1603919266.0,
            "replies": [
                {
                    "body": "I would recommend this but also to not just “not stress” being as abnormal as this amount and pattern of loss is it really seems like something to get a blood panel for and consult doctors to confirm it’s not a sign of something worse than even a vitamin deficiency. Regardless of the cause remember you can buzz it and own the look even if it takes time to feel yourself again. Best wishes OP",
                    "author": "That_Tuba_Who",
                    "id": "gagx0ri",
                    "parent_id": "t1_gaf7xh4",
                    "score": 1,
                    "created_utc": 1603956965.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "r/hairloss will help you a lot more this sub is mainly for haircuts and hairstyles.",
            "author": "Kamumill",
            "id": "gafdbl0",
            "parent_id": "t3_jjvzw1",
            "score": 8,
            "created_utc": 1603921831.0,
            "replies": []
        },
        {
            "body": "So sorry I know it can be a real hit to someone’s confidence but honestly I’m one year older than you but everywhere I see in my school and people my age is like really short hairstyles are in trend so you should maybe consider it as it can also bring you back some confidence if you feel insecure. Hope this helps a little :)",
            "author": "help_help_help_help_",
            "id": "gag2dq4",
            "parent_id": "t3_jjvzw1",
            "score": 2,
            "created_utc": 1603934220.0,
            "replies": []
        },
        {
            "body": "My mom has been a hair stylist for over 30 years and always talks about how hair is a big window into what’s happening in the body. This isn’t normal balding and is most certainly a symptom of something else. Push for your doctor to do a blood test, it’s likely a deficiency, as others have said. Good luck!",
            "author": "sjmbr",
            "id": "gagnv2m",
            "parent_id": "t3_jjvzw1",
            "score": 2,
            "created_utc": 1603947904.0,
            "replies": []
        },
        {
            "body": "You do need to get that checked out more, because it's really atypical and could be a sign of a worse condition. the fact that your hairline is still good, while your hair is getting equally thin all over your head is not similar to any natural kind of hair loss",
            "author": "Petrica55",
            "id": "gahl6at",
            "parent_id": "t3_jjvzw1",
            "score": 2,
            "created_utc": 1603978492.0,
            "replies": []
        },
        {
            "body": "Speaking as a dude who got early MPB (currently a NW2 at age 22) even I didn't start receding until I was 16/17, and definitely not like you with your thinning. This is almost certainly a deficiency of some sort.",
            "author": "FPLGOD98",
            "id": "gain09a",
            "parent_id": "t3_jjvzw1",
            "score": 2,
            "created_utc": 1603995930.0,
            "replies": []
        },
        {
            "body": "this kind of uniform thinning is not male pattern baldness, you definitely need to see another medical professional because this is not the normal pattern of hair loss at any age.",
            "author": "WhatDoIDoWithHair",
            "id": "gamgavv",
            "parent_id": "t3_jjvzw1",
            "score": 2,
            "created_utc": 1604081346.0,
            "replies": []
        },
        {
            "body": "Damn man, I’m really sorry. I’m no expert but my general understanding is when it’s gone it’s gone. Since you’re probably just starting highschool my advice is to just shave it and embrace it. Like any major change it will look weird at first but I’m confident you’ll be able to rock it.",
            "author": "FLOPPY_DONKEY_DICK",
            "id": "gafgnjy",
            "parent_id": "t3_jjvzw1",
            "score": 3,
            "created_utc": 1603923467.0,
            "replies": []
        },
        {
            "body": "Wow I feel really bad that you are experiencing this at a young age. if no medication seems to work, just buzz it off",
            "author": "pointless-existence1",
            "id": "gafzimt",
            "parent_id": "t3_jjvzw1",
            "score": 2,
            "created_utc": 1603932632.0,
            "replies": []
        },
        {
            "body": "Minoxidil. Start as of yesterday. Or a year ago.",
            "author": "RadamanthysWyvern",
            "id": "gafoy36",
            "parent_id": "t3_jjvzw1",
            "score": 2,
            "created_utc": 1603926816.0,
            "replies": [
                {
                    "body": "Minixodil",
                    "author": "drago_must_break_you",
                    "id": "gafzwgw",
                    "parent_id": "t1_gafoy36",
                    "score": 0,
                    "created_utc": 1603932841.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Honestly buzz it to a #1 im 13 i did the same my hair was like this",
            "author": "harish_wormley",
            "id": "gafis4v",
            "parent_id": "t3_jjvzw1",
            "score": 1,
            "created_utc": 1603924556.0,
            "replies": [
                {
                    "body": "If your hair is like this at 13 then you should see a doctor too, it's most likely some type of vitamin deficiency, especially if it's just your overall hair thinning with no hairline recession like how you'd see in normal male pattern baldness",
                    "author": "AyeAye_Kane",
                    "id": "gagb8jy",
                    "parent_id": "t1_gafis4v",
                    "score": 8,
                    "created_utc": 1603939212.0,
                    "replies": [
                        {
                            "body": "i did see a doctor",
                            "author": "harish_wormley",
                            "id": "gagx4sh",
                            "parent_id": "t1_gagb8jy",
                            "score": 1,
                            "created_utc": 1603957090.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "You should check /r/tressless. Consensus there is to at least start on Minoxidil, Nizoral, and Finasteride. You may want to see a dermatologist specializing in hair loss, but they'll have more tips there.",
            "author": "brian21",
            "id": "gafqx1t",
            "parent_id": "t3_jjvzw1",
            "score": 0,
            "created_utc": 1603927924.0,
            "replies": [
                {
                    "body": "Under 21s should not touch Finasteride.",
                    "author": null,
                    "id": "gag1qnm",
                    "parent_id": "t1_gafqx1t",
                    "score": 13,
                    "created_utc": 1603933861.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "What does your mother's fathers hair look like and your dads? In detail?",
            "author": "18sheil",
            "id": "gafidx0",
            "parent_id": "t3_jjvzw1",
            "score": 1,
            "created_utc": 1603924352.0,
            "replies": [
                {
                    "body": "I can only describe my dads hair because I never met my moms dad. My dad has more hair than me although his hair is also kinda thin if he really allows his hair to grow out you can kinda see his skull",
                    "author": "fuckedup14yearold",
                    "id": "gafj4dv",
                    "parent_id": "t1_gafidx0",
                    "score": 7,
                    "created_utc": 1603924733.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "did you go to a regular doctor or a dermatologist?",
            "author": "someonesaid334",
            "id": "gaftxxm",
            "parent_id": "t3_jjvzw1",
            "score": 1,
            "created_utc": 1603929590.0,
            "replies": []
        },
        {
            "body": "i’m sorry man that shit is really unfair. until you can figure something out, i’d just recommend buzzing it. it sucks but you’ll get used to it and so will everyone else.",
            "author": null,
            "id": "gag0uj3",
            "parent_id": "t3_jjvzw1",
            "score": 1,
            "created_utc": 1603933361.0,
            "replies": []
        },
        {
            "body": "I don't know if you know this already but I'm gonna say this anyway you're sick you need to get to a doctor or a specialist you are clearly not fine get to a proper doctor get some tests done get help this may be amendable",
            "author": null,
            "id": "gagbsre",
            "parent_id": "t3_jjvzw1",
            "score": 1,
            "created_utc": 1603939544.0,
            "replies": []
        },
        {
            "body": "Seconding everyone’s advice to go see a specialist. Gotta figure out what’s causing this.\n\nJust want to add, that if it’s stress or deficiency related, there’s a very very good chance you can reverse it. If you you take care of this soon you can get back to a full head of hair. \n\nWorst case scenario, your hair does not define you. Just take a look around some time and notice everyone rocking the bald or buzzed look. It’s fashionable and never will go out of style",
            "author": "Hmm_would_bang",
            "id": "gagjx68",
            "parent_id": "t3_jjvzw1",
            "score": 1,
            "created_utc": 1603944872.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gafbhn8",
            "parent_id": "t3_jjvzw1",
            "score": 0,
            "created_utc": 1603920954.0,
            "replies": [
                {
                    "body": "Please don't take Finastride. It blocks the production of a very powerful hormone which your body needs badly. Please clip your have grade one say and go from there.",
                    "author": "18sheil",
                    "id": "gafi343",
                    "parent_id": "t1_gafbhn8",
                    "score": 11,
                    "created_utc": 1603924198.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Go to a dermatologist and see if you can get started on finasteride + minoxidil\n\nEdit: 😶",
            "author": "MrV11",
            "id": "gafz31s",
            "parent_id": "t3_jjvzw1",
            "score": 0,
            "created_utc": 1603932396.0,
            "replies": [
                {
                    "body": "That's shit advice, it obviously isn't androgenetic Alopecia, especially at his age",
                    "author": "Pianomaster99",
                    "id": "gaktmhp",
                    "parent_id": "t1_gafz31s",
                    "score": 1,
                    "created_utc": 1604040655.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "have you tried minoxidil or finasteride? worked for me when I was 16",
            "author": "SkellingtonsDontReal",
            "id": "gagpp9n",
            "parent_id": "t3_jjvzw1",
            "score": -1,
            "created_utc": 1603949491.0,
            "replies": []
        },
        {
            "body": "Your hair won’t look like that forever, it’ll all be gone soon. Bummer.",
            "author": "Ansonm64",
            "id": "gagmurt",
            "parent_id": "t3_jjvzw1",
            "score": 0,
            "created_utc": 1603947074.0,
            "replies": []
        },
        {
            "body": "What’s your diet",
            "author": "LeDinosaur",
            "id": "gagppt1",
            "parent_id": "t3_jjvzw1",
            "score": 0,
            "created_utc": 1603949504.0,
            "replies": []
        },
        {
            "body": "I remember a high school friend of mine going bald at 14. By 16, he had a severe receding hairline. By 18, he was bald. His dad was too, his older brother wasn’t and still isn’t. Sometimes it’s just the luck of the draw. Embrace it. It’s just who you are. That’s gonna be your look. It’s not a bad thing.",
            "author": "TooBusyToBeLazy",
            "id": "gaiqbrr",
            "parent_id": "t3_jjvzw1",
            "score": 0,
            "created_utc": 1603997277.0,
            "replies": []
        },
        {
            "body": "Shave it, you’ll look badass man.",
            "author": null,
            "id": "gafznxc",
            "parent_id": "t3_jjvzw1",
            "score": -1,
            "created_utc": 1603932711.0,
            "replies": []
        },
        {
            "body": "Shave it all",
            "author": "GrayWasTaken",
            "id": "gag184e",
            "parent_id": "t3_jjvzw1",
            "score": -3,
            "created_utc": 1603933570.0,
            "replies": []
        },
        {
            "body": "Generic rogaine foam and a finasteride scrip.",
            "author": "squayzy",
            "id": "gagnp7z",
            "parent_id": "t3_jjvzw1",
            "score": -1,
            "created_utc": 1603947766.0,
            "replies": []
        },
        {
            "body": "Here's some [information worth exploring](https://www.hopkinsallchildrens.org/patients-families/health-library/healthdocnew/hair-loss). I'm sure googling would produce more.",
            "author": "majeric",
            "id": "gagt5aw",
            "parent_id": "t3_jjvzw1",
            "score": -2,
            "created_utc": 1603952750.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gafotgj",
            "parent_id": "t3_jjvzw1",
            "score": -15,
            "created_utc": 1603926743.0,
            "replies": [
                {
                    "body": "Neither do you",
                    "author": "platypus_69",
                    "id": "gafxur7",
                    "parent_id": "t1_gafotgj",
                    "score": 5,
                    "created_utc": 1603931733.0,
                    "replies": []
                },
                {
                    "body": "Hell nah that shit's fucked",
                    "author": "HeyThereMrBrooks",
                    "id": "gag041w",
                    "parent_id": "t1_gafotgj",
                    "score": 3,
                    "created_utc": 1603932956.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Buzz cut time bro 💪 if your dad has some good beard jeans them maybe you can look like Rick Ross 🤣🙏",
            "author": "edaviestuggy",
            "id": "gafwkbl",
            "parent_id": "t3_jjvzw1",
            "score": -5,
            "created_utc": 1603931022.0,
            "replies": []
        },
        {
            "body": "Take homeopathic hair treatment bro.its the best and permanent treatment",
            "author": "satyamas",
            "id": "gagqf7j",
            "parent_id": "t3_jjvzw1",
            "score": -6,
            "created_utc": 1603950140.0,
            "replies": [
                {
                    "body": ">homeopathic\n\n Homeopathic doctors (who also are called “homeopaths”) weaken these ingredients by adding water or alcohol. Then they shake the mixture as part of a process called “potentization.” They believe this step transfers the healing essence. Homeopaths also believe that the lower the dose, the more powerful the medicine. In fact, many of these remedies no longer contain any molecules of the original substance. They come in a variety of forms, like sugar pellets, liquid drops, creams, gels, and tablets. \n\n&#x200B;\n\nIf any of the above sounds like something a reasonable person would do - rethink what you think a reasonable person is.",
                    "author": "Goatsgotohell666",
                    "id": "gagyrsm",
                    "parent_id": "t1_gagqf7j",
                    "score": 0,
                    "created_utc": 1603958968.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "You should go to your doctor, this could be a medical issue unrelated to male pattern baldness.",
            "author": "Zecele_",
            "id": "gafgowp",
            "parent_id": "t3_jjvzw1",
            "score": 1,
            "created_utc": 1603923486.0,
            "replies": []
        },
        {
            "body": "You can get a scalp biopsy at the dermatologist and that could help get some answers. When I was thinning I had it done and they confirmed for me it was just standard male pattern baldness",
            "author": "vanburenboys",
            "id": "gafyf0g",
            "parent_id": "t3_jjvzw1",
            "score": 1,
            "created_utc": 1603932037.0,
            "replies": []
        },
        {
            "body": "It is okay for you to worry about hair so my first advice is to go see a doctor.\n\nAlthough, you can go bald and still pull off some good look like Binging with Babish, Walter White, or Jason Statham.",
            "author": null,
            "id": "gagrvjf",
            "parent_id": "t3_jjvzw1",
            "score": 1,
            "created_utc": 1603951511.0,
            "replies": []
        },
        {
            "body": "Maybe see an endocrinologist if the dermatologist doesn't get anywhere",
            "author": "CheeseDrip",
            "id": "gagxpai",
            "parent_id": "t3_jjvzw1",
            "score": 1,
            "created_utc": 1603957735.0,
            "replies": []
        },
        {
            "body": "You need to go to a better doctor or a specialist. Dermatologist. This is no normal baldness. You need to focus on that asap. Take your phone an just call some well reviewed doctors in your area. Make an appointment. You don't have to rely on your parents for this. It's your health.",
            "author": "Justify_87",
            "id": "gah6kkt",
            "parent_id": "t3_jjvzw1",
            "score": 1,
            "created_utc": 1603967693.0,
            "replies": []
        },
        {
            "body": "Shave your head and you will feel like a boss. Join the club r/bald",
            "author": "originalsquad",
            "id": "gah7ybp",
            "parent_id": "t3_jjvzw1",
            "score": 1,
            "created_utc": 1603969018.0,
            "replies": []
        },
        {
            "body": "Start Dr. Pen 2.5mm micro needling with Minox to hopefully grow some back",
            "author": "Locksmith54",
            "id": "gahdxng",
            "parent_id": "t3_jjvzw1",
            "score": 1,
            "created_utc": 1603973922.0,
            "replies": []
        },
        {
            "body": "Could be Alopecia",
            "author": "Decallion",
            "id": "gahhdvc",
            "parent_id": "t3_jjvzw1",
            "score": 1,
            "created_utc": 1603976253.0,
            "replies": []
        },
        {
            "body": "There is no doc here bro,this is kinda messed up. Better visit the best of your city or area doctor or maybe consider hair transplant by consulting with doc",
            "author": "Prabh-banger",
            "id": "gahr9wh",
            "parent_id": "t3_jjvzw1",
            "score": 1,
            "created_utc": 1603981691.0,
            "replies": []
        },
        {
            "body": "Short buzz is the only thing for it.",
            "author": null,
            "id": "gaiaazt",
            "parent_id": "t3_jjvzw1",
            "score": 1,
            "created_utc": 1603990741.0,
            "replies": []
        },
        {
            "body": "I've heard of people who follow the carnivore diet having fixed this issue.",
            "author": "gunsrock222",
            "id": "gaibwdi",
            "parent_id": "t3_jjvzw1",
            "score": 1,
            "created_utc": 1603991479.0,
            "replies": []
        },
        {
            "body": "Make sure your parents are understanding of this and if they aren’t reach out to someone who is bro. What everyone is saying sounds pretty accurate and you should hurry and take action to figure it all out.",
            "author": "isaidnick",
            "id": "gailkxu",
            "parent_id": "t3_jjvzw1",
            "score": 1,
            "created_utc": 1603995353.0,
            "replies": []
        },
        {
            "body": "You need to see a dermatologist but I started losing hair at 15 or 16. But I started losing hair on  top of my hair not the front. The dermatologist might recommend you to try a product like Rogaine.",
            "author": "WorriedPanda_45",
            "id": "gajahb8",
            "parent_id": "t3_jjvzw1",
            "score": 1,
            "created_utc": 1604006547.0,
            "replies": []
        },
        {
            "body": "Alopecia?",
            "author": "moliknz",
            "id": "gal55s8",
            "parent_id": "t3_jjvzw1",
            "score": 1,
            "created_utc": 1604053521.0,
            "replies": []
        },
        {
            "body": "Do you vape?",
            "author": "The_DiGital-Hero",
            "id": "gaqootf",
            "parent_id": "t3_jjvzw1",
            "score": 1,
            "created_utc": 1604184714.0,
            "replies": []
        },
        {
            "body": "I'm sorry, and I don't want to scare you, but I think you need to go to a endocrinologist because this doesnt seem like the common balding of hereditary alopecia, this looks more like the symptom of something else. And please don't start with finasteride at your age, it \"blocks\" the hormone that causes balding very effectively, but at your age you NEED that hormone.",
            "author": "DarkGhost999",
            "id": "gafzfen",
            "parent_id": "t1_gafxqyd",
            "score": 70,
            "created_utc": 1603932584.0,
            "replies": []
        },
        {
            "body": "Yeah, I'd agree with you 100%. I don't think I've ever seen any type of regular male pattern baldness balding where the hairline doesn't go and the rest of the hair just thins as it is, and from what I can see his hairline looks pretty good. Just a question, u/fuckedup14yearold, have you ever had a blood test taken? What'd the doctors do when you went to see them about it?",
            "author": "AyeAye_Kane",
            "id": "gagay6p",
            "parent_id": "t1_gafh3g7",
            "score": 108,
            "created_utc": 1603939040.0,
            "replies": [
                {
                    "body": "Yeah this is known as female pattern baldness, where the crown goes and the hairline is preserved. Very unusual for a man, much less a boy.",
                    "author": "bigmac4812",
                    "id": "gagq0yv",
                    "parent_id": "t1_gagay6p",
                    "score": 40,
                    "created_utc": 1603949779.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "This comment right here, some saying he should buzz it all off seem to completely ignore the fact that OP is 14. Maybe he could buzz it to limit the damage of how it looks aesthetically, but I would definitely go see a specialist because I’m no docotor, but that doesn’t seem normal",
            "author": "templario765",
            "id": "gag08ew",
            "parent_id": "t1_gafsxf4",
            "score": 78,
            "created_utc": 1603933024.0,
            "replies": [
                {
                    "body": "This is a hair advice sub. They’re just advising him it’d look better buzzed if he’s already losing it. But yes he definitely should see a doctor",
                    "author": "Dmaj6",
                    "id": "gag4mff",
                    "parent_id": "t1_gag08ew",
                    "score": 24,
                    "created_utc": 1603935467.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yeah, this seems kinda concerning",
            "author": "TheRighteousHimbo",
            "id": "gafy7ge",
            "parent_id": "t1_gafsxf4",
            "score": 16,
            "created_utc": 1603931924.0,
            "replies": []
        },
        {
            "body": "Finally a decent comment",
            "author": "Today_Either",
            "id": "gag17rv",
            "parent_id": "t1_gafsxf4",
            "score": 2,
            "created_utc": 1603933565.0,
            "replies": []
        },
        {
            "body": "Yes 14. Thats very very very young. Am very shocked. Feel awful on him",
            "author": "18sheil",
            "id": "gafi6xa",
            "parent_id": "t1_gafbu1g",
            "score": 59,
            "created_utc": 1603924251.0,
            "replies": []
        },
        {
            "body": "Yeah no way it’s early MPB",
            "author": "jyok33",
            "id": "gagwsh2",
            "parent_id": "t1_gag450v",
            "score": 2,
            "created_utc": 1603956702.0,
            "replies": []
        },
        {
            "body": "Terrible advice, there’s a picture of you on your profile and your hair looks nothing like OPs. He clearly has some kind of condition, plus there’s a big difference between 14 and 17",
            "author": "KrazyKoolKookaburra",
            "id": "gahkvx0",
            "parent_id": "t1_gafao9l",
            "score": 5,
            "created_utc": 1603978331.0,
            "replies": []
        },
        {
            "body": "Bro he’s 14 he’s not even done puberty. He should not be losing his hair like this, this isn’t male pattern baldness",
            "author": "talkingspacecoyote",
            "id": "gaimvgq",
            "parent_id": "t1_gafao9l",
            "score": 1,
            "created_utc": 1603995876.0,
            "replies": []
        },
        {
            "body": "I would recommend this but also to not just “not stress” being as abnormal as this amount and pattern of loss is it really seems like something to get a blood panel for and consult doctors to confirm it’s not a sign of something worse than even a vitamin deficiency. Regardless of the cause remember you can buzz it and own the look even if it takes time to feel yourself again. Best wishes OP",
            "author": "That_Tuba_Who",
            "id": "gagx0ri",
            "parent_id": "t1_gaf7xh4",
            "score": 1,
            "created_utc": 1603956965.0,
            "replies": []
        },
        {
            "body": "Minixodil",
            "author": "drago_must_break_you",
            "id": "gafzwgw",
            "parent_id": "t1_gafoy36",
            "score": 0,
            "created_utc": 1603932841.0,
            "replies": []
        },
        {
            "body": "If your hair is like this at 13 then you should see a doctor too, it's most likely some type of vitamin deficiency, especially if it's just your overall hair thinning with no hairline recession like how you'd see in normal male pattern baldness",
            "author": "AyeAye_Kane",
            "id": "gagb8jy",
            "parent_id": "t1_gafis4v",
            "score": 8,
            "created_utc": 1603939212.0,
            "replies": [
                {
                    "body": "i did see a doctor",
                    "author": "harish_wormley",
                    "id": "gagx4sh",
                    "parent_id": "t1_gagb8jy",
                    "score": 1,
                    "created_utc": 1603957090.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Under 21s should not touch Finasteride.",
            "author": null,
            "id": "gag1qnm",
            "parent_id": "t1_gafqx1t",
            "score": 13,
            "created_utc": 1603933861.0,
            "replies": []
        },
        {
            "body": "I can only describe my dads hair because I never met my moms dad. My dad has more hair than me although his hair is also kinda thin if he really allows his hair to grow out you can kinda see his skull",
            "author": "fuckedup14yearold",
            "id": "gafj4dv",
            "parent_id": "t1_gafidx0",
            "score": 7,
            "created_utc": 1603924733.0,
            "replies": []
        },
        {
            "body": "Please don't take Finastride. It blocks the production of a very powerful hormone which your body needs badly. Please clip your have grade one say and go from there.",
            "author": "18sheil",
            "id": "gafi343",
            "parent_id": "t1_gafbhn8",
            "score": 11,
            "created_utc": 1603924198.0,
            "replies": []
        },
        {
            "body": "That's shit advice, it obviously isn't androgenetic Alopecia, especially at his age",
            "author": "Pianomaster99",
            "id": "gaktmhp",
            "parent_id": "t1_gafz31s",
            "score": 1,
            "created_utc": 1604040655.0,
            "replies": []
        },
        {
            "body": "Neither do you",
            "author": "platypus_69",
            "id": "gafxur7",
            "parent_id": "t1_gafotgj",
            "score": 5,
            "created_utc": 1603931733.0,
            "replies": []
        },
        {
            "body": "Hell nah that shit's fucked",
            "author": "HeyThereMrBrooks",
            "id": "gag041w",
            "parent_id": "t1_gafotgj",
            "score": 3,
            "created_utc": 1603932956.0,
            "replies": []
        },
        {
            "body": ">homeopathic\n\n Homeopathic doctors (who also are called “homeopaths”) weaken these ingredients by adding water or alcohol. Then they shake the mixture as part of a process called “potentization.” They believe this step transfers the healing essence. Homeopaths also believe that the lower the dose, the more powerful the medicine. In fact, many of these remedies no longer contain any molecules of the original substance. They come in a variety of forms, like sugar pellets, liquid drops, creams, gels, and tablets. \n\n&#x200B;\n\nIf any of the above sounds like something a reasonable person would do - rethink what you think a reasonable person is.",
            "author": "Goatsgotohell666",
            "id": "gagyrsm",
            "parent_id": "t1_gagqf7j",
            "score": 0,
            "created_utc": 1603958968.0,
            "replies": []
        },
        {
            "body": "Yeah this is known as female pattern baldness, where the crown goes and the hairline is preserved. Very unusual for a man, much less a boy.",
            "author": "bigmac4812",
            "id": "gagq0yv",
            "parent_id": "t1_gagay6p",
            "score": 40,
            "created_utc": 1603949779.0,
            "replies": []
        },
        {
            "body": "This is a hair advice sub. They’re just advising him it’d look better buzzed if he’s already losing it. But yes he definitely should see a doctor",
            "author": "Dmaj6",
            "id": "gag4mff",
            "parent_id": "t1_gag08ew",
            "score": 24,
            "created_utc": 1603935467.0,
            "replies": []
        },
        {
            "body": "i did see a doctor",
            "author": "harish_wormley",
            "id": "gagx4sh",
            "parent_id": "t1_gagb8jy",
            "score": 1,
            "created_utc": 1603957090.0,
            "replies": []
        }
    ]
}