{
    "title": "How can you not love JSJ (RM ep. 5) ?",
    "post_id": "sv9el6",
    "post_url": "https://www.reddit.com/r/runningman/comments/sv9el6/how_can_you_not_love_jsj_rm_ep_5/",
    "author": "changezkhan69",
    "body": "",
    "url": "https://v.redd.it/2zik10rkvii81",
    "score": 283,
    "upvote_ratio": 0.99,
    "created_utc": 1645160211.0,
    "num_comments": 31,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "HAHAHAH the deer eating a rabbit really got me 🤣",
            "author": "iwantaspudgun",
            "id": "hxeuxas",
            "parent_id": "t3_sv9el6",
            "score": 50,
            "created_utc": 1645162693.0,
            "replies": [
                {
                    "body": "Yeah, same here. He really nailed it.",
                    "author": "changezkhan69",
                    "id": "hxevfe5",
                    "parent_id": "t1_hxeuxas",
                    "score": 7,
                    "created_utc": 1645162998.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "The early days when YJS and JSJ were sort of the leaders until KJK take over JSJ",
            "author": "anthayashi",
            "id": "hxezxc9",
            "parent_id": "t3_sv9el6",
            "score": 42,
            "created_utc": 1645165868.0,
            "replies": []
        },
        {
            "body": "The cast members ( or sometime the guests) always say the things that seok Jin said on the show (but got edited out) are so funny.",
            "author": "yanggor1983",
            "id": "hxfi3k1",
            "parent_id": "t3_sv9el6",
            "score": 33,
            "created_utc": 1645179950.0,
            "replies": [
                {
                    "body": "That always made me sad hearing that- plus kwang soo’s stories too getting cut out. Especially since kwang was so funny framing in the earlier episodes. Im so curious.",
                    "author": "Cat4Why7",
                    "id": "hxfj2gn",
                    "parent_id": "t1_hxfi3k1",
                    "score": 22,
                    "created_utc": 1645180729.0,
                    "replies": [
                        {
                            "body": "I really miss the fake rumors he would make about people each episode.",
                            "author": "anttoekneeoh",
                            "id": "hy02pm1",
                            "parent_id": "t1_hxfj2gn",
                            "score": 3,
                            "created_utc": 1645557981.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "the issue is jsj's bits tend to need context and tend to be longer and without prior knowledge or time it gets hard to keep them in. so it makes it obvious his bits will be cut to fit the program",
                    "author": "Cedosg",
                    "id": "hxftas4",
                    "parent_id": "t1_hxfi3k1",
                    "score": 11,
                    "created_utc": 1645187910.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "JSJ talking about his family is always funny.",
            "author": "YoshidaKyo",
            "id": "hxesqkr",
            "parent_id": "t3_sv9el6",
            "score": 48,
            "created_utc": 1645161414.0,
            "replies": [
                {
                    "body": "I laughed like crazy when he explained before marriage and after marriage version of his wife.",
                    "author": "changezkhan69",
                    "id": "hxetbp4",
                    "parent_id": "t1_hxesqkr",
                    "score": 20,
                    "created_utc": 1645161752.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "He won me over with the “I swear…” moment. Happy he’s having a bit of a renaissance this past 12 months. Big nose fighting!",
            "author": "buddhabear07",
            "id": "hxib04x",
            "parent_id": "t3_sv9el6",
            "score": 6,
            "created_utc": 1645224755.0,
            "replies": []
        },
        {
            "body": "It's funny because most husbands can relate to this.\n\nWhen JSJ story-telling his marriage life, you just can't help but listen. LOL.",
            "author": "Ideapad02",
            "id": "hxtij17",
            "parent_id": "t3_sv9el6",
            "score": 4,
            "created_utc": 1645441319.0,
            "replies": []
        },
        {
            "body": "You might also like this similar discussion when JSJ guested on KJK's other show: https://www.youtube.com/watch?v=3xQWBLbuxlI.",
            "author": "bQ12o8k6WVpu",
            "id": "hxexlf9",
            "parent_id": "t3_sv9el6",
            "score": 8,
            "created_utc": 1645164334.0,
            "replies": [
                {
                    "body": "Oh, thanks for this. Also if possible post this as a new post, others would also love it, definitely.",
                    "author": "changezkhan69",
                    "id": "hxexp20",
                    "parent_id": "t1_hxexlf9",
                    "score": 4,
                    "created_utc": 1645164397.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "This is why the fortune tellers always told JSJ to be nicr to his wife everytime. Bcs his marriage life talking is always entertaining no matter jow many times it retelled lol. But honestly JSJ marriage life is one of the best and ideal for me lol..",
            "author": "shimafeiyan",
            "id": "hykc98n",
            "parent_id": "t3_sv9el6",
            "score": 3,
            "created_utc": 1645911747.0,
            "replies": []
        },
        {
            "body": "JSJ carried the show in the early days",
            "author": "empressmatilda_",
            "id": "hxhnyuk",
            "parent_id": "t3_sv9el6",
            "score": 5,
            "created_utc": 1645215492.0,
            "replies": []
        },
        {
            "body": "I'm I the only old dude here who was watching the show as it was coming out back then? Yeah he had his moments but for a huge amount of time, JSJ just wasn't fun to watch.  \n  \nHe's obviously done quite the pivot in recent years, daesang nominee like wow, but if you rewatch between the beginning and about when Gary left, he was pretty unfunny and unlikeable, viewer wise at least.",
            "author": "SpoonAtAGunFight",
            "id": "hxflfhk",
            "parent_id": "t3_sv9el6",
            "score": 5,
            "created_utc": 1645182603.0,
            "replies": [
                {
                    "body": "Yeah, agree. Even he also mentioned this in the episode after LKS left that he was like this. He didn't like when HH used to joke arround. He was being authoritative. I think I might point out the system (senior-junior) in which he grew and adopted.\n\nBut he learnt his lesson. Now, even when YSC teases him, he handles the situation very well in a comedic manner. I simply loves and respect him considering his age and the attempt he makes to fit into within the casts (including guests).",
                    "author": "changezkhan69",
                    "id": "hxfpmhl",
                    "parent_id": "t1_hxflfhk",
                    "score": 22,
                    "created_utc": 1645185610.0,
                    "replies": [
                        {
                            "body": "Also it was hard for him to transition from a single host (golden bell and all his past shows) to cohosting with 7 other people. I’m glad he got used to it and doing even better now",
                            "author": "DumploAO",
                            "id": "hxg0uh7",
                            "parent_id": "t1_hxfpmhl",
                            "score": 13,
                            "created_utc": 1645191921.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "he was absolutely hilarious right from the beginning - \nhad a 'meaner' no nonsense character petty character which was so funny, picking on and fighting with the girls.\n\nThen he was part of Easy Brothers\n\nAlso as the weakest one.\n\nHes always had great characters and I never once found him unfunny or unlikeable which is quite a strong word.",
                    "author": "Denethorsmukbang",
                    "id": "hxgguy5",
                    "parent_id": "t1_hxflfhk",
                    "score": 23,
                    "created_utc": 1645198850.0,
                    "replies": [
                        {
                            "body": "Right, which is why he was perennially at the bottom of polls for favorite members, guests didn't want to pair with him. Like ever.   \n\nLooking at him now, then going back to rewatch isn't the same as watching him live every Sunday for 12 years. He was never the person to make everybody laugh. It was other people doing things to him that made him funny. This is why him having this breakout year is such a great story. You can't gaslight newer/unknowing fans that he's always been this beacon of comedy that shined bright every weekend. No, he was probably only ever funnier than Jihyo (w/o Gary).  \n\nAlso being one of the Easy Brothers doesn't mean he's hilarious. The entire concept of the EB's was that they were so bad that they had them come together to TRY and win something. Kinda fizzled out when Kwangsoo became such a physical and game threat but just because he was part of the Easy Brothers, didn't mean it was because he was such a dynamically hilarious member.  \n\nDon't try to upend his renaissance arc. It's a much more satisfying story than lying about whether or not he was hilarious.",
                            "author": "SpoonAtAGunFight",
                            "id": "hxgjdmt",
                            "parent_id": "t1_hxgguy5",
                            "score": 3,
                            "created_utc": 1645199840.0,
                            "replies": [
                                {
                                    "body": "Its funny when we're talking about unlikeability, when your comments make you so honestly, really patronising.\n\nIve given my opinion, and youre talking about me lying and 'gaslighting'. \n\nJust a very weird tone to your comments of misplaced superiority, especially when you're the one downplaying his role to an extreme amount.",
                                    "author": "Denethorsmukbang",
                                    "id": "hxhol6a",
                                    "parent_id": "t1_hxgjdmt",
                                    "score": 10,
                                    "created_utc": 1645215737.0,
                                    "replies": [
                                        {
                                            "body": ">Its funny when we're talking about unlikeability, when your comments make you so honestly, really patronising\n\nThe topic is not about my unlikability.  I can't do anything about your interpretation of my critique. You can feel however you want about it but I laid out the scope and details and if you are free to feel any type of way about it, that's up to you. Anything patronizing is based on how you've interpreted it. I can't feel your feelings for you.     \n\n>Ive given my opinion, and youre talking about me lying and 'gaslighting'  \n\nYour description of JSJ as he was from the start is a lie. If this is where you felt \"patronized\", then I don't know what to tell you. In a medium such as art, subjectivity is king, so **OBVIOUSLY**, your opinion is your opinion. However, on a mainstream popular television program, you can identify things that enhance the experience and performance of the cast. You can **objectively** identify that JSJ was consistently at the bottom of fan polls and was the least prominent member in terms of screen time, except maybe Jihyo post-Gary. He was reliably the least popular member by far among fans and guests alike. I do not know why you quoted gaslighting as if I either made it up or misidentified it. He was not ***always*** hilarious and to say that now when this sub's main circlejerk is how great JSJ is, is misleading and might lead newer fans in this sub to actually think he was this comedic genius from the word go. Which he was not. I'll get to why that's problematic in a second.     \n\n>Just a very weird tone to your comments of misplaced superiority, especially when you're the one downplaying his role to an extreme amount.\n\nI can't do anything about your interpretation of tone. I was pointing out that he was not always, as some seem to believe, hilarious. It isn't downplaying anything, I have pointed out several reasons why he was unfunny and unlikeable. I pointed out identifiable reasons for why I said what I said.    \n\n>really patronising  \n>  \n>misplaced superiority\n\nDoes putting genuine thought into a discussion warrant this? Does adding depth and breadth into critiques of something, that someone is passionate about, paint this image?   \n\nHere's why trying to rewrite JSJ's past is problematic.  \n\nI actually gave props to JSJ in my original reply to you. It's hard to come back from such a bad image as he previously had. He made immaculate strides in the past couple of years, especially last year, to really show people, including people like myself who grew up watching him 'Race Start' *every* episode, really what he was capable of. What he's done is almost unheard of. He's almost like the EXID or Brave Girls of variety.  \n\nMy original comment's intent was not \"JSJ is bad\". I have been a passionate fan since Running Man began. I know what people's vibes were from JSJ because I was there, in all the biggest threads, reading and absorbing what was being said at the time. His unfunny-ness and unlikable beginning make him such a great character **NOW**.  \n\nYou mentioned Easy Brothers. As I mentioned, it was originally created because LKS and JSJ literally could not get a win. JSJ was the weaker Easy Brother to boot. ***This*** is why his character revival is so perfect and why it's so important to understand where he's come from and what he overcame.  \n\nHe was literally the weakest member, on the weakest pairing, on the most popular variety show. He now has a Daesang nomination, which to a good portion of people think he should have won.  \n\nDo you know how crazy that is? If you told anybody 11 years ago that JSJ was going to be nominated for the Daesang, everybody would have thought you were crazy. Now? Now I think most people, myself included, think he's got a good shot almost every year from now on. He *barely* missed out on his Daesang, that man is going to go hard asf this year and we all benefit from not only having the pleasure of being entertained by him but also to watch him complete his arc fully.  \n\nIt truly is television history in the making and I am so happy I was able to witness it.",
                                            "author": "SpoonAtAGunFight",
                                            "id": "hxiv8wx",
                                            "parent_id": "t1_hxhol6a",
                                            "score": -3,
                                            "created_utc": 1645233911.0,
                                            "replies": [
                                                {
                                                    "body": "What values are added to the enjoyment of Running Man by saying that \"JSJ just wasn't fun to watch\"?  It could be a funny history tidbit, but really, it is a \"back in my day\" moment.  From what I have gathered, fans of today do enjoy JSJ's early days on Running Man.  Public's opinions change all the time.",
                                                    "author": null,
                                                    "id": "hxn325d",
                                                    "parent_id": "t1_hxiv8wx",
                                                    "score": 3,
                                                    "created_utc": 1645314833.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "I agree with you! I remember tweeting about how he’s my least fav runningman member, not because he seems weak or always loses, but I wasn’t a fan of his humor back then. It’s so different than the current JSJ. Right now I like him so much, I was so sad that he didn’t win a daesang.",
                    "author": "Seriously_93",
                    "id": "hy7qqww",
                    "parent_id": "t1_hxflfhk",
                    "score": 3,
                    "created_utc": 1645689139.0,
                    "replies": []
                },
                {
                    "body": "I’m still not a really big fan of JSJ. But it’s probably me who don’t fit to his humor.",
                    "author": "spyon80",
                    "id": "hxfq6hr",
                    "parent_id": "t1_hxflfhk",
                    "score": 2,
                    "created_utc": 1645185978.0,
                    "replies": [
                        {
                            "body": "I'm not the biggest fan however it is pretty clear he's evolved as an entertainer in the past year. 6+ years of meh will be pretty hard taste to cleanse for some people but I really think he's coming around on something great.",
                            "author": "SpoonAtAGunFight",
                            "id": "hxg7681",
                            "parent_id": "t1_hxfq6hr",
                            "score": 1,
                            "created_utc": 1645194838.0,
                            "replies": [
                                {
                                    "body": "I can understand. \n\nI already love Yoo JaeSuk and Haha from the beginning and now with Jeon SoMin and Yang Sechan, I don’t enough love to give",
                                    "author": "spyon80",
                                    "id": "hxg8e16",
                                    "parent_id": "t1_hxg7681",
                                    "score": 1,
                                    "created_utc": 1645195365.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "I agree. I only started to find him funny since around 2 years ago. Before that he was not that funny IMO. Especially when he was trying so hard to get screen time.",
                    "author": "SorryBanyakTanya",
                    "id": "hxi11bn",
                    "parent_id": "t1_hxflfhk",
                    "score": 1,
                    "created_utc": 1645220699.0,
                    "replies": []
                },
                {
                    "body": "I have no qualm with JSJ's early days, I think it is hilarious that some cast members and guests thought he was a strong competitor.  You can sense the shift in sentiment and it's funny to watch.",
                    "author": null,
                    "id": "hxmxsw8",
                    "parent_id": "t1_hxflfhk",
                    "score": 1,
                    "created_utc": 1645312373.0,
                    "replies": []
                },
                {
                    "body": "I agree to some point but I wouldn’t say unlikeable. In RM’s early days the show was physically enduring and he was just a weak character when it came to games. But everyone has strong & weak points. He really shines as an entertainer and he’s really in a better place now. He really remain true to his character and one thing I love was how consistent he was.",
                    "author": "merepoops",
                    "id": "hxrmrie",
                    "parent_id": "t1_hxflfhk",
                    "score": 1,
                    "created_utc": 1645400888.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "HaHa was laughing hard at this moment. But, now, having been married, he totally can relate. LOL.",
            "author": "Pyeonsae",
            "id": "hxq6s4r",
            "parent_id": "t3_sv9el6",
            "score": 1,
            "created_utc": 1645378912.0,
            "replies": []
        },
        {
            "body": "Yeah, same here. He really nailed it.",
            "author": "changezkhan69",
            "id": "hxevfe5",
            "parent_id": "t1_hxeuxas",
            "score": 7,
            "created_utc": 1645162998.0,
            "replies": []
        },
        {
            "body": "That always made me sad hearing that- plus kwang soo’s stories too getting cut out. Especially since kwang was so funny framing in the earlier episodes. Im so curious.",
            "author": "Cat4Why7",
            "id": "hxfj2gn",
            "parent_id": "t1_hxfi3k1",
            "score": 22,
            "created_utc": 1645180729.0,
            "replies": [
                {
                    "body": "I really miss the fake rumors he would make about people each episode.",
                    "author": "anttoekneeoh",
                    "id": "hy02pm1",
                    "parent_id": "t1_hxfj2gn",
                    "score": 3,
                    "created_utc": 1645557981.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "the issue is jsj's bits tend to need context and tend to be longer and without prior knowledge or time it gets hard to keep them in. so it makes it obvious his bits will be cut to fit the program",
            "author": "Cedosg",
            "id": "hxftas4",
            "parent_id": "t1_hxfi3k1",
            "score": 11,
            "created_utc": 1645187910.0,
            "replies": []
        },
        {
            "body": "I laughed like crazy when he explained before marriage and after marriage version of his wife.",
            "author": "changezkhan69",
            "id": "hxetbp4",
            "parent_id": "t1_hxesqkr",
            "score": 20,
            "created_utc": 1645161752.0,
            "replies": []
        },
        {
            "body": "Oh, thanks for this. Also if possible post this as a new post, others would also love it, definitely.",
            "author": "changezkhan69",
            "id": "hxexp20",
            "parent_id": "t1_hxexlf9",
            "score": 4,
            "created_utc": 1645164397.0,
            "replies": []
        },
        {
            "body": "Yeah, agree. Even he also mentioned this in the episode after LKS left that he was like this. He didn't like when HH used to joke arround. He was being authoritative. I think I might point out the system (senior-junior) in which he grew and adopted.\n\nBut he learnt his lesson. Now, even when YSC teases him, he handles the situation very well in a comedic manner. I simply loves and respect him considering his age and the attempt he makes to fit into within the casts (including guests).",
            "author": "changezkhan69",
            "id": "hxfpmhl",
            "parent_id": "t1_hxflfhk",
            "score": 22,
            "created_utc": 1645185610.0,
            "replies": [
                {
                    "body": "Also it was hard for him to transition from a single host (golden bell and all his past shows) to cohosting with 7 other people. I’m glad he got used to it and doing even better now",
                    "author": "DumploAO",
                    "id": "hxg0uh7",
                    "parent_id": "t1_hxfpmhl",
                    "score": 13,
                    "created_utc": 1645191921.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "he was absolutely hilarious right from the beginning - \nhad a 'meaner' no nonsense character petty character which was so funny, picking on and fighting with the girls.\n\nThen he was part of Easy Brothers\n\nAlso as the weakest one.\n\nHes always had great characters and I never once found him unfunny or unlikeable which is quite a strong word.",
            "author": "Denethorsmukbang",
            "id": "hxgguy5",
            "parent_id": "t1_hxflfhk",
            "score": 23,
            "created_utc": 1645198850.0,
            "replies": [
                {
                    "body": "Right, which is why he was perennially at the bottom of polls for favorite members, guests didn't want to pair with him. Like ever.   \n\nLooking at him now, then going back to rewatch isn't the same as watching him live every Sunday for 12 years. He was never the person to make everybody laugh. It was other people doing things to him that made him funny. This is why him having this breakout year is such a great story. You can't gaslight newer/unknowing fans that he's always been this beacon of comedy that shined bright every weekend. No, he was probably only ever funnier than Jihyo (w/o Gary).  \n\nAlso being one of the Easy Brothers doesn't mean he's hilarious. The entire concept of the EB's was that they were so bad that they had them come together to TRY and win something. Kinda fizzled out when Kwangsoo became such a physical and game threat but just because he was part of the Easy Brothers, didn't mean it was because he was such a dynamically hilarious member.  \n\nDon't try to upend his renaissance arc. It's a much more satisfying story than lying about whether or not he was hilarious.",
                    "author": "SpoonAtAGunFight",
                    "id": "hxgjdmt",
                    "parent_id": "t1_hxgguy5",
                    "score": 3,
                    "created_utc": 1645199840.0,
                    "replies": [
                        {
                            "body": "Its funny when we're talking about unlikeability, when your comments make you so honestly, really patronising.\n\nIve given my opinion, and youre talking about me lying and 'gaslighting'. \n\nJust a very weird tone to your comments of misplaced superiority, especially when you're the one downplaying his role to an extreme amount.",
                            "author": "Denethorsmukbang",
                            "id": "hxhol6a",
                            "parent_id": "t1_hxgjdmt",
                            "score": 10,
                            "created_utc": 1645215737.0,
                            "replies": [
                                {
                                    "body": ">Its funny when we're talking about unlikeability, when your comments make you so honestly, really patronising\n\nThe topic is not about my unlikability.  I can't do anything about your interpretation of my critique. You can feel however you want about it but I laid out the scope and details and if you are free to feel any type of way about it, that's up to you. Anything patronizing is based on how you've interpreted it. I can't feel your feelings for you.     \n\n>Ive given my opinion, and youre talking about me lying and 'gaslighting'  \n\nYour description of JSJ as he was from the start is a lie. If this is where you felt \"patronized\", then I don't know what to tell you. In a medium such as art, subjectivity is king, so **OBVIOUSLY**, your opinion is your opinion. However, on a mainstream popular television program, you can identify things that enhance the experience and performance of the cast. You can **objectively** identify that JSJ was consistently at the bottom of fan polls and was the least prominent member in terms of screen time, except maybe Jihyo post-Gary. He was reliably the least popular member by far among fans and guests alike. I do not know why you quoted gaslighting as if I either made it up or misidentified it. He was not ***always*** hilarious and to say that now when this sub's main circlejerk is how great JSJ is, is misleading and might lead newer fans in this sub to actually think he was this comedic genius from the word go. Which he was not. I'll get to why that's problematic in a second.     \n\n>Just a very weird tone to your comments of misplaced superiority, especially when you're the one downplaying his role to an extreme amount.\n\nI can't do anything about your interpretation of tone. I was pointing out that he was not always, as some seem to believe, hilarious. It isn't downplaying anything, I have pointed out several reasons why he was unfunny and unlikeable. I pointed out identifiable reasons for why I said what I said.    \n\n>really patronising  \n>  \n>misplaced superiority\n\nDoes putting genuine thought into a discussion warrant this? Does adding depth and breadth into critiques of something, that someone is passionate about, paint this image?   \n\nHere's why trying to rewrite JSJ's past is problematic.  \n\nI actually gave props to JSJ in my original reply to you. It's hard to come back from such a bad image as he previously had. He made immaculate strides in the past couple of years, especially last year, to really show people, including people like myself who grew up watching him 'Race Start' *every* episode, really what he was capable of. What he's done is almost unheard of. He's almost like the EXID or Brave Girls of variety.  \n\nMy original comment's intent was not \"JSJ is bad\". I have been a passionate fan since Running Man began. I know what people's vibes were from JSJ because I was there, in all the biggest threads, reading and absorbing what was being said at the time. His unfunny-ness and unlikable beginning make him such a great character **NOW**.  \n\nYou mentioned Easy Brothers. As I mentioned, it was originally created because LKS and JSJ literally could not get a win. JSJ was the weaker Easy Brother to boot. ***This*** is why his character revival is so perfect and why it's so important to understand where he's come from and what he overcame.  \n\nHe was literally the weakest member, on the weakest pairing, on the most popular variety show. He now has a Daesang nomination, which to a good portion of people think he should have won.  \n\nDo you know how crazy that is? If you told anybody 11 years ago that JSJ was going to be nominated for the Daesang, everybody would have thought you were crazy. Now? Now I think most people, myself included, think he's got a good shot almost every year from now on. He *barely* missed out on his Daesang, that man is going to go hard asf this year and we all benefit from not only having the pleasure of being entertained by him but also to watch him complete his arc fully.  \n\nIt truly is television history in the making and I am so happy I was able to witness it.",
                                    "author": "SpoonAtAGunFight",
                                    "id": "hxiv8wx",
                                    "parent_id": "t1_hxhol6a",
                                    "score": -3,
                                    "created_utc": 1645233911.0,
                                    "replies": [
                                        {
                                            "body": "What values are added to the enjoyment of Running Man by saying that \"JSJ just wasn't fun to watch\"?  It could be a funny history tidbit, but really, it is a \"back in my day\" moment.  From what I have gathered, fans of today do enjoy JSJ's early days on Running Man.  Public's opinions change all the time.",
                                            "author": null,
                                            "id": "hxn325d",
                                            "parent_id": "t1_hxiv8wx",
                                            "score": 3,
                                            "created_utc": 1645314833.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I agree with you! I remember tweeting about how he’s my least fav runningman member, not because he seems weak or always loses, but I wasn’t a fan of his humor back then. It’s so different than the current JSJ. Right now I like him so much, I was so sad that he didn’t win a daesang.",
            "author": "Seriously_93",
            "id": "hy7qqww",
            "parent_id": "t1_hxflfhk",
            "score": 3,
            "created_utc": 1645689139.0,
            "replies": []
        },
        {
            "body": "I’m still not a really big fan of JSJ. But it’s probably me who don’t fit to his humor.",
            "author": "spyon80",
            "id": "hxfq6hr",
            "parent_id": "t1_hxflfhk",
            "score": 2,
            "created_utc": 1645185978.0,
            "replies": [
                {
                    "body": "I'm not the biggest fan however it is pretty clear he's evolved as an entertainer in the past year. 6+ years of meh will be pretty hard taste to cleanse for some people but I really think he's coming around on something great.",
                    "author": "SpoonAtAGunFight",
                    "id": "hxg7681",
                    "parent_id": "t1_hxfq6hr",
                    "score": 1,
                    "created_utc": 1645194838.0,
                    "replies": [
                        {
                            "body": "I can understand. \n\nI already love Yoo JaeSuk and Haha from the beginning and now with Jeon SoMin and Yang Sechan, I don’t enough love to give",
                            "author": "spyon80",
                            "id": "hxg8e16",
                            "parent_id": "t1_hxg7681",
                            "score": 1,
                            "created_utc": 1645195365.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I agree. I only started to find him funny since around 2 years ago. Before that he was not that funny IMO. Especially when he was trying so hard to get screen time.",
            "author": "SorryBanyakTanya",
            "id": "hxi11bn",
            "parent_id": "t1_hxflfhk",
            "score": 1,
            "created_utc": 1645220699.0,
            "replies": []
        },
        {
            "body": "I have no qualm with JSJ's early days, I think it is hilarious that some cast members and guests thought he was a strong competitor.  You can sense the shift in sentiment and it's funny to watch.",
            "author": null,
            "id": "hxmxsw8",
            "parent_id": "t1_hxflfhk",
            "score": 1,
            "created_utc": 1645312373.0,
            "replies": []
        },
        {
            "body": "I agree to some point but I wouldn’t say unlikeable. In RM’s early days the show was physically enduring and he was just a weak character when it came to games. But everyone has strong & weak points. He really shines as an entertainer and he’s really in a better place now. He really remain true to his character and one thing I love was how consistent he was.",
            "author": "merepoops",
            "id": "hxrmrie",
            "parent_id": "t1_hxflfhk",
            "score": 1,
            "created_utc": 1645400888.0,
            "replies": []
        },
        {
            "body": "I really miss the fake rumors he would make about people each episode.",
            "author": "anttoekneeoh",
            "id": "hy02pm1",
            "parent_id": "t1_hxfj2gn",
            "score": 3,
            "created_utc": 1645557981.0,
            "replies": []
        },
        {
            "body": "Also it was hard for him to transition from a single host (golden bell and all his past shows) to cohosting with 7 other people. I’m glad he got used to it and doing even better now",
            "author": "DumploAO",
            "id": "hxg0uh7",
            "parent_id": "t1_hxfpmhl",
            "score": 13,
            "created_utc": 1645191921.0,
            "replies": []
        },
        {
            "body": "Right, which is why he was perennially at the bottom of polls for favorite members, guests didn't want to pair with him. Like ever.   \n\nLooking at him now, then going back to rewatch isn't the same as watching him live every Sunday for 12 years. He was never the person to make everybody laugh. It was other people doing things to him that made him funny. This is why him having this breakout year is such a great story. You can't gaslight newer/unknowing fans that he's always been this beacon of comedy that shined bright every weekend. No, he was probably only ever funnier than Jihyo (w/o Gary).  \n\nAlso being one of the Easy Brothers doesn't mean he's hilarious. The entire concept of the EB's was that they were so bad that they had them come together to TRY and win something. Kinda fizzled out when Kwangsoo became such a physical and game threat but just because he was part of the Easy Brothers, didn't mean it was because he was such a dynamically hilarious member.  \n\nDon't try to upend his renaissance arc. It's a much more satisfying story than lying about whether or not he was hilarious.",
            "author": "SpoonAtAGunFight",
            "id": "hxgjdmt",
            "parent_id": "t1_hxgguy5",
            "score": 3,
            "created_utc": 1645199840.0,
            "replies": [
                {
                    "body": "Its funny when we're talking about unlikeability, when your comments make you so honestly, really patronising.\n\nIve given my opinion, and youre talking about me lying and 'gaslighting'. \n\nJust a very weird tone to your comments of misplaced superiority, especially when you're the one downplaying his role to an extreme amount.",
                    "author": "Denethorsmukbang",
                    "id": "hxhol6a",
                    "parent_id": "t1_hxgjdmt",
                    "score": 10,
                    "created_utc": 1645215737.0,
                    "replies": [
                        {
                            "body": ">Its funny when we're talking about unlikeability, when your comments make you so honestly, really patronising\n\nThe topic is not about my unlikability.  I can't do anything about your interpretation of my critique. You can feel however you want about it but I laid out the scope and details and if you are free to feel any type of way about it, that's up to you. Anything patronizing is based on how you've interpreted it. I can't feel your feelings for you.     \n\n>Ive given my opinion, and youre talking about me lying and 'gaslighting'  \n\nYour description of JSJ as he was from the start is a lie. If this is where you felt \"patronized\", then I don't know what to tell you. In a medium such as art, subjectivity is king, so **OBVIOUSLY**, your opinion is your opinion. However, on a mainstream popular television program, you can identify things that enhance the experience and performance of the cast. You can **objectively** identify that JSJ was consistently at the bottom of fan polls and was the least prominent member in terms of screen time, except maybe Jihyo post-Gary. He was reliably the least popular member by far among fans and guests alike. I do not know why you quoted gaslighting as if I either made it up or misidentified it. He was not ***always*** hilarious and to say that now when this sub's main circlejerk is how great JSJ is, is misleading and might lead newer fans in this sub to actually think he was this comedic genius from the word go. Which he was not. I'll get to why that's problematic in a second.     \n\n>Just a very weird tone to your comments of misplaced superiority, especially when you're the one downplaying his role to an extreme amount.\n\nI can't do anything about your interpretation of tone. I was pointing out that he was not always, as some seem to believe, hilarious. It isn't downplaying anything, I have pointed out several reasons why he was unfunny and unlikeable. I pointed out identifiable reasons for why I said what I said.    \n\n>really patronising  \n>  \n>misplaced superiority\n\nDoes putting genuine thought into a discussion warrant this? Does adding depth and breadth into critiques of something, that someone is passionate about, paint this image?   \n\nHere's why trying to rewrite JSJ's past is problematic.  \n\nI actually gave props to JSJ in my original reply to you. It's hard to come back from such a bad image as he previously had. He made immaculate strides in the past couple of years, especially last year, to really show people, including people like myself who grew up watching him 'Race Start' *every* episode, really what he was capable of. What he's done is almost unheard of. He's almost like the EXID or Brave Girls of variety.  \n\nMy original comment's intent was not \"JSJ is bad\". I have been a passionate fan since Running Man began. I know what people's vibes were from JSJ because I was there, in all the biggest threads, reading and absorbing what was being said at the time. His unfunny-ness and unlikable beginning make him such a great character **NOW**.  \n\nYou mentioned Easy Brothers. As I mentioned, it was originally created because LKS and JSJ literally could not get a win. JSJ was the weaker Easy Brother to boot. ***This*** is why his character revival is so perfect and why it's so important to understand where he's come from and what he overcame.  \n\nHe was literally the weakest member, on the weakest pairing, on the most popular variety show. He now has a Daesang nomination, which to a good portion of people think he should have won.  \n\nDo you know how crazy that is? If you told anybody 11 years ago that JSJ was going to be nominated for the Daesang, everybody would have thought you were crazy. Now? Now I think most people, myself included, think he's got a good shot almost every year from now on. He *barely* missed out on his Daesang, that man is going to go hard asf this year and we all benefit from not only having the pleasure of being entertained by him but also to watch him complete his arc fully.  \n\nIt truly is television history in the making and I am so happy I was able to witness it.",
                            "author": "SpoonAtAGunFight",
                            "id": "hxiv8wx",
                            "parent_id": "t1_hxhol6a",
                            "score": -3,
                            "created_utc": 1645233911.0,
                            "replies": [
                                {
                                    "body": "What values are added to the enjoyment of Running Man by saying that \"JSJ just wasn't fun to watch\"?  It could be a funny history tidbit, but really, it is a \"back in my day\" moment.  From what I have gathered, fans of today do enjoy JSJ's early days on Running Man.  Public's opinions change all the time.",
                                    "author": null,
                                    "id": "hxn325d",
                                    "parent_id": "t1_hxiv8wx",
                                    "score": 3,
                                    "created_utc": 1645314833.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I'm not the biggest fan however it is pretty clear he's evolved as an entertainer in the past year. 6+ years of meh will be pretty hard taste to cleanse for some people but I really think he's coming around on something great.",
            "author": "SpoonAtAGunFight",
            "id": "hxg7681",
            "parent_id": "t1_hxfq6hr",
            "score": 1,
            "created_utc": 1645194838.0,
            "replies": [
                {
                    "body": "I can understand. \n\nI already love Yoo JaeSuk and Haha from the beginning and now with Jeon SoMin and Yang Sechan, I don’t enough love to give",
                    "author": "spyon80",
                    "id": "hxg8e16",
                    "parent_id": "t1_hxg7681",
                    "score": 1,
                    "created_utc": 1645195365.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Its funny when we're talking about unlikeability, when your comments make you so honestly, really patronising.\n\nIve given my opinion, and youre talking about me lying and 'gaslighting'. \n\nJust a very weird tone to your comments of misplaced superiority, especially when you're the one downplaying his role to an extreme amount.",
            "author": "Denethorsmukbang",
            "id": "hxhol6a",
            "parent_id": "t1_hxgjdmt",
            "score": 10,
            "created_utc": 1645215737.0,
            "replies": [
                {
                    "body": ">Its funny when we're talking about unlikeability, when your comments make you so honestly, really patronising\n\nThe topic is not about my unlikability.  I can't do anything about your interpretation of my critique. You can feel however you want about it but I laid out the scope and details and if you are free to feel any type of way about it, that's up to you. Anything patronizing is based on how you've interpreted it. I can't feel your feelings for you.     \n\n>Ive given my opinion, and youre talking about me lying and 'gaslighting'  \n\nYour description of JSJ as he was from the start is a lie. If this is where you felt \"patronized\", then I don't know what to tell you. In a medium such as art, subjectivity is king, so **OBVIOUSLY**, your opinion is your opinion. However, on a mainstream popular television program, you can identify things that enhance the experience and performance of the cast. You can **objectively** identify that JSJ was consistently at the bottom of fan polls and was the least prominent member in terms of screen time, except maybe Jihyo post-Gary. He was reliably the least popular member by far among fans and guests alike. I do not know why you quoted gaslighting as if I either made it up or misidentified it. He was not ***always*** hilarious and to say that now when this sub's main circlejerk is how great JSJ is, is misleading and might lead newer fans in this sub to actually think he was this comedic genius from the word go. Which he was not. I'll get to why that's problematic in a second.     \n\n>Just a very weird tone to your comments of misplaced superiority, especially when you're the one downplaying his role to an extreme amount.\n\nI can't do anything about your interpretation of tone. I was pointing out that he was not always, as some seem to believe, hilarious. It isn't downplaying anything, I have pointed out several reasons why he was unfunny and unlikeable. I pointed out identifiable reasons for why I said what I said.    \n\n>really patronising  \n>  \n>misplaced superiority\n\nDoes putting genuine thought into a discussion warrant this? Does adding depth and breadth into critiques of something, that someone is passionate about, paint this image?   \n\nHere's why trying to rewrite JSJ's past is problematic.  \n\nI actually gave props to JSJ in my original reply to you. It's hard to come back from such a bad image as he previously had. He made immaculate strides in the past couple of years, especially last year, to really show people, including people like myself who grew up watching him 'Race Start' *every* episode, really what he was capable of. What he's done is almost unheard of. He's almost like the EXID or Brave Girls of variety.  \n\nMy original comment's intent was not \"JSJ is bad\". I have been a passionate fan since Running Man began. I know what people's vibes were from JSJ because I was there, in all the biggest threads, reading and absorbing what was being said at the time. His unfunny-ness and unlikable beginning make him such a great character **NOW**.  \n\nYou mentioned Easy Brothers. As I mentioned, it was originally created because LKS and JSJ literally could not get a win. JSJ was the weaker Easy Brother to boot. ***This*** is why his character revival is so perfect and why it's so important to understand where he's come from and what he overcame.  \n\nHe was literally the weakest member, on the weakest pairing, on the most popular variety show. He now has a Daesang nomination, which to a good portion of people think he should have won.  \n\nDo you know how crazy that is? If you told anybody 11 years ago that JSJ was going to be nominated for the Daesang, everybody would have thought you were crazy. Now? Now I think most people, myself included, think he's got a good shot almost every year from now on. He *barely* missed out on his Daesang, that man is going to go hard asf this year and we all benefit from not only having the pleasure of being entertained by him but also to watch him complete his arc fully.  \n\nIt truly is television history in the making and I am so happy I was able to witness it.",
                    "author": "SpoonAtAGunFight",
                    "id": "hxiv8wx",
                    "parent_id": "t1_hxhol6a",
                    "score": -3,
                    "created_utc": 1645233911.0,
                    "replies": [
                        {
                            "body": "What values are added to the enjoyment of Running Man by saying that \"JSJ just wasn't fun to watch\"?  It could be a funny history tidbit, but really, it is a \"back in my day\" moment.  From what I have gathered, fans of today do enjoy JSJ's early days on Running Man.  Public's opinions change all the time.",
                            "author": null,
                            "id": "hxn325d",
                            "parent_id": "t1_hxiv8wx",
                            "score": 3,
                            "created_utc": 1645314833.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I can understand. \n\nI already love Yoo JaeSuk and Haha from the beginning and now with Jeon SoMin and Yang Sechan, I don’t enough love to give",
            "author": "spyon80",
            "id": "hxg8e16",
            "parent_id": "t1_hxg7681",
            "score": 1,
            "created_utc": 1645195365.0,
            "replies": []
        },
        {
            "body": ">Its funny when we're talking about unlikeability, when your comments make you so honestly, really patronising\n\nThe topic is not about my unlikability.  I can't do anything about your interpretation of my critique. You can feel however you want about it but I laid out the scope and details and if you are free to feel any type of way about it, that's up to you. Anything patronizing is based on how you've interpreted it. I can't feel your feelings for you.     \n\n>Ive given my opinion, and youre talking about me lying and 'gaslighting'  \n\nYour description of JSJ as he was from the start is a lie. If this is where you felt \"patronized\", then I don't know what to tell you. In a medium such as art, subjectivity is king, so **OBVIOUSLY**, your opinion is your opinion. However, on a mainstream popular television program, you can identify things that enhance the experience and performance of the cast. You can **objectively** identify that JSJ was consistently at the bottom of fan polls and was the least prominent member in terms of screen time, except maybe Jihyo post-Gary. He was reliably the least popular member by far among fans and guests alike. I do not know why you quoted gaslighting as if I either made it up or misidentified it. He was not ***always*** hilarious and to say that now when this sub's main circlejerk is how great JSJ is, is misleading and might lead newer fans in this sub to actually think he was this comedic genius from the word go. Which he was not. I'll get to why that's problematic in a second.     \n\n>Just a very weird tone to your comments of misplaced superiority, especially when you're the one downplaying his role to an extreme amount.\n\nI can't do anything about your interpretation of tone. I was pointing out that he was not always, as some seem to believe, hilarious. It isn't downplaying anything, I have pointed out several reasons why he was unfunny and unlikeable. I pointed out identifiable reasons for why I said what I said.    \n\n>really patronising  \n>  \n>misplaced superiority\n\nDoes putting genuine thought into a discussion warrant this? Does adding depth and breadth into critiques of something, that someone is passionate about, paint this image?   \n\nHere's why trying to rewrite JSJ's past is problematic.  \n\nI actually gave props to JSJ in my original reply to you. It's hard to come back from such a bad image as he previously had. He made immaculate strides in the past couple of years, especially last year, to really show people, including people like myself who grew up watching him 'Race Start' *every* episode, really what he was capable of. What he's done is almost unheard of. He's almost like the EXID or Brave Girls of variety.  \n\nMy original comment's intent was not \"JSJ is bad\". I have been a passionate fan since Running Man began. I know what people's vibes were from JSJ because I was there, in all the biggest threads, reading and absorbing what was being said at the time. His unfunny-ness and unlikable beginning make him such a great character **NOW**.  \n\nYou mentioned Easy Brothers. As I mentioned, it was originally created because LKS and JSJ literally could not get a win. JSJ was the weaker Easy Brother to boot. ***This*** is why his character revival is so perfect and why it's so important to understand where he's come from and what he overcame.  \n\nHe was literally the weakest member, on the weakest pairing, on the most popular variety show. He now has a Daesang nomination, which to a good portion of people think he should have won.  \n\nDo you know how crazy that is? If you told anybody 11 years ago that JSJ was going to be nominated for the Daesang, everybody would have thought you were crazy. Now? Now I think most people, myself included, think he's got a good shot almost every year from now on. He *barely* missed out on his Daesang, that man is going to go hard asf this year and we all benefit from not only having the pleasure of being entertained by him but also to watch him complete his arc fully.  \n\nIt truly is television history in the making and I am so happy I was able to witness it.",
            "author": "SpoonAtAGunFight",
            "id": "hxiv8wx",
            "parent_id": "t1_hxhol6a",
            "score": -3,
            "created_utc": 1645233911.0,
            "replies": [
                {
                    "body": "What values are added to the enjoyment of Running Man by saying that \"JSJ just wasn't fun to watch\"?  It could be a funny history tidbit, but really, it is a \"back in my day\" moment.  From what I have gathered, fans of today do enjoy JSJ's early days on Running Man.  Public's opinions change all the time.",
                    "author": null,
                    "id": "hxn325d",
                    "parent_id": "t1_hxiv8wx",
                    "score": 3,
                    "created_utc": 1645314833.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "What values are added to the enjoyment of Running Man by saying that \"JSJ just wasn't fun to watch\"?  It could be a funny history tidbit, but really, it is a \"back in my day\" moment.  From what I have gathered, fans of today do enjoy JSJ's early days on Running Man.  Public's opinions change all the time.",
            "author": null,
            "id": "hxn325d",
            "parent_id": "t1_hxiv8wx",
            "score": 3,
            "created_utc": 1645314833.0,
            "replies": []
        }
    ]
}