{
    "title": "Please use \"honest\" pictures everyone",
    "post_id": "bm4tl4",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/bm4tl4/please_use_honest_pictures_everyone/",
    "author": "anonymou555andWich",
    "body": "Had a m&g the other day and she did not look like her picture.  The picture she sent me looked just a little filtered, didn't seem that drastic until I met her in person.  Probably a pic from her late teens or early twenties in hindsight. She looked at least few years older and she had smoker teeth.\n\nI send the most casual pic I have of myself. No filters, no touch ups, and no special angles. it's just me standing in front a gallery. Very casual. I'm not even in a suit.\n\nPlease ladies and gents, use photos that are honest and recent. Some filtering is expected but if anyone shows up looking different then it's deal breaker.",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/bm4tl4/please_use_honest_pictures_everyone/",
    "score": 100,
    "upvote_ratio": 0.96,
    "created_utc": 1557319468.0,
    "num_comments": 45,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "I do not understand this strategy at all. It is a losing deal for both parties. Why would you want to over inflate expectations just to drastically undercut them? If you send photos of you looking like a 10 and you are less than that, even if you are a super attractive 6 or 7, you have just made yourself LESS desirable by setting expectations way too high.  \n\n\nI prefer to send pictures of me that are cute but nothing amazing. That way when I show up, the comment is ALWAYS \"Wow! I knew you were attractive but you look AMAZING in person\".  \n\n\nLadies, under promise and over deliver and you can never go wrong.",
            "author": "msully01",
            "id": "emtpmtr",
            "parent_id": "t3_bm4tl4",
            "score": 65,
            "created_utc": 1557319873.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "emtptc3",
                    "parent_id": "t1_emtpmtr",
                    "score": 16,
                    "created_utc": 1557320025.0,
                    "replies": [
                        {
                            "body": "Oh, indeed. I understand their motivation entirely. It is a \"fake it till you make it\" mentality. Unfortunately, they do not think much deeper than that on the true ramifications and how they are doing themselves more harm than good.",
                            "author": "msully01",
                            "id": "emtqoqn",
                            "parent_id": "t1_emtptc3",
                            "score": 9,
                            "created_utc": 1557320708.0,
                            "replies": [
                                {
                                    "body": "They think that they are going to win you over with their awesome personalities. It's happened to me many times.",
                                    "author": "Esteban_1812",
                                    "id": "emtwdbo",
                                    "parent_id": "t1_emtqoqn",
                                    "score": 4,
                                    "created_utc": 1557324363.0,
                                    "replies": [
                                        {
                                            "body": "This is a fatal flaw of both genders: applying the drivers of attraction of one sex to another without realizing they are completely different in material ways. Intellect and personality have turned many an average SD into a total hottie, but it takes longer than one M&G for the reverse to occur.",
                                            "author": "msully01",
                                            "id": "emty986",
                                            "parent_id": "t1_emtwdbo",
                                            "score": 6,
                                            "created_utc": 1557325438.0,
                                            "replies": [
                                                {
                                                    "body": "Yeah. I mean my needs for SBs are very specific. That's part of the whole point of it for me.  I will accept less than ideal body type for a very pretty face or TRULY exceptional intellect (she is obviously much smarter than me)\n\nThe best part is when a SB shows up obviously heavier or less attractive than her deceptive photos and the she realizes within a  few minutes that she has bitten off more than she can chew... and that she has no chance whatsoever.  The nervous behavior and desire to punch out is palpable.  I am polite and friendly but she can see that she is obviously out of place.\n\nI think part of it is definitely cognitive dissonance; despite knowing that they are not the person they envision themselves to be, having the attention of an SD affirms their more attractive imaginary identity. \nThere is definitely some of that going on.  I buy them a drink! They need it.",
                                                    "author": "Esteban_1812",
                                                    "id": "emvx141",
                                                    "parent_id": "t1_emty986",
                                                    "score": 1,
                                                    "created_utc": 1557368070.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "To be fair, not everyone who has misleading photos does so to deceive necessarily. I personally think I look very different on profile than straight on, so I would overcompensate with a mix of angles, but not everyone thinks of that.",
                    "author": "vshzzd",
                    "id": "emtr7ul",
                    "parent_id": "t1_emtpmtr",
                    "score": 10,
                    "created_utc": 1557321091.0,
                    "replies": [
                        {
                            "body": "Absolutely and that is a very good point. I happen to have one of those faces that \"loves\" the camera for whatever reason, and I *know* that the reality is slightly different. This is why I also search for photos that are not as flattering or show me in different lights/outfits/settings.",
                            "author": "msully01",
                            "id": "emtrqx2",
                            "parent_id": "t1_emtr7ul",
                            "score": 3,
                            "created_utc": 1557321451.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I much prefer hearing, “Wow, your pictures don’t do you justice.”",
            "author": "oh_sugah",
            "id": "emtw21w",
            "parent_id": "t3_bm4tl4",
            "score": 30,
            "created_utc": 1557324187.0,
            "replies": [
                {
                    "body": "This!!!",
                    "author": null,
                    "id": "emtxduo",
                    "parent_id": "t1_emtw21w",
                    "score": 6,
                    "created_utc": 1557324950.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yes, please! I went on a M&G a few months ago and in pictures this man had brown hair. In person? 100% white. I would guess the pictures were around 10 years old. \n\nNeither his age or his appearance were deal breakers, but the difference between pictures and reality did NOT make a good first impression.",
            "author": null,
            "id": "emtq94x",
            "parent_id": "t3_bm4tl4",
            "score": 14,
            "created_utc": 1557320365.0,
            "replies": []
        },
        {
            "body": "It seems to be the nature of the beast with photos in the bowl.  I'm sure it applies to both sides of the pillow. Men and women using old pics to present themselves in a better, more attractive light.  I always take the pics with a grain of salt.  Hell, a whole shaker of salt.  Pics may attract my attention but the meet and greet vibe will be the real deciding factor.  It's impossible to get a feel for personality and intellect from pixels. \n\nUse reasonably current pics.  That indicates a reasonable truthful person.  Those are the ones I'd rather play with in the bowl.",
            "author": null,
            "id": "emtpy7a",
            "parent_id": "t3_bm4tl4",
            "score": 9,
            "created_utc": 1557320131.0,
            "replies": []
        },
        {
            "body": "Once was catfished by a woman 40 lbs. heavier than the pictures (and barely recognizable)...  \nMet her, hung out, did not like her (the issue was not the pictures or her appearance).\n\nShe was back on the site a few months later -- and I was fooled again by the photos! 😂",
            "author": "marker3000",
            "id": "emua394",
            "parent_id": "t3_bm4tl4",
            "score": 10,
            "created_utc": 1557331689.0,
            "replies": [
                {
                    "body": "LOL those must be some good pics!",
                    "author": "aajniojnoihnoi",
                    "id": "emw083k",
                    "parent_id": "t1_emua394",
                    "score": 2,
                    "created_utc": 1557370263.0,
                    "replies": []
                },
                {
                    "body": "😂😂 How??  I started keeping a spreadsheet of usernames and profile snippets so when I restart my search with a new account then I know who’s a scammer, who I’ve talked to already, etc.",
                    "author": null,
                    "id": "emwajsa",
                    "parent_id": "t1_emua394",
                    "score": 2,
                    "created_utc": 1557380883.0,
                    "replies": [
                        {
                            "body": "> who I’ve talked to already\n\nfor this reason, I leave conversations in an archive. While you don't catch a new user name, you might catch one with new pictures but an old contact that caught your eye in the past.",
                            "author": "TooOldForSD",
                            "id": "emwgip4",
                            "parent_id": "t1_emwajsa",
                            "score": 2,
                            "created_utc": 1557388364.0,
                            "replies": []
                        },
                        {
                            "body": "Because she had a new set of photos from when we was younger and MUCH MUCH thinner. And so I was attracted again. And it was a new profile, but nicely written. And I did a LOT of facepalming when I realized what I had done.",
                            "author": "marker3000",
                            "id": "en0xm42",
                            "parent_id": "t1_emwajsa",
                            "score": 1,
                            "created_utc": 1557501534.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I mean to be fair I'm at least semi good at makeup. I work 2 jobs so I always look exhausted but I have a cute face and look a lot younger than I actually am but I still get tiny break outs if I recently tried a product that I'm sensitive too. So my pictures usually arent super filtered but I admit I dont look perfect without makeup. I still wouldn't over sell myself and once I get to know a potential SD I do send morning selfies with no makeup to test the waters with them. Normally no one minds but I have gotten the occasional \"you look exhausted\" type messages. But yeah if you're presenting as an Instagram model when you actually look like an Amish mother of 10 then no that's not okay at all and you should reconsider your priorities. You wouldn't want an SD sending you pics looking like Hasselhoff when he actually looks more like Al Gore lmao",
            "author": "Mopsydoll",
            "id": "emuwpez",
            "parent_id": "t3_bm4tl4",
            "score": 8,
            "created_utc": 1557344711.0,
            "replies": []
        },
        {
            "body": "I absolutely agree with this.  \n\nI think the advantage of online dating is that you can be honest about yourself and what your looking for.  You can advertise yourself to 1000's with  the hope to find one person that genuinely likes you for yourself.  \n\nAdvertising with misleading information (photos, age, income, interests, etc.), just increases the chances of attracting many people that will never be a good match. It only wastes your time and theirs.\n\nIt's okay to use your \"best\" photo with angles, filters, etc in your main profile pic to draw attention, but you must have an \"honest\" photo as well so that no one will feel misled.",
            "author": "willfromvb",
            "id": "emty4a1",
            "parent_id": "t3_bm4tl4",
            "score": 7,
            "created_utc": 1557325366.0,
            "replies": []
        },
        {
            "body": "I have on my profile \"will not respond to messages if all your pictures have filters\". I've been catfished 2 times already because of Snapchat filters.",
            "author": "IIDXholic",
            "id": "emu9qab",
            "parent_id": "t3_bm4tl4",
            "score": 5,
            "created_utc": 1557331484.0,
            "replies": []
        },
        {
            "body": "I also met up with a SD and their picture was of them much younger and better looking, so when I met them I couldn't find them at first until they found me lol\n\nI've been told I look the same as my photos, and I find it funny when people show up and look nothing like their pictures... It's funny, but also a huge waste of time.",
            "author": "Brittanythestrange",
            "id": "emuode5",
            "parent_id": "t3_bm4tl4",
            "score": 5,
            "created_utc": 1557339648.0,
            "replies": []
        },
        {
            "body": "Some of these girls are great at taking flattering angles it seems. I've been burned 3-4 times myself.",
            "author": "mraspencer",
            "id": "emtpa7h",
            "parent_id": "t3_bm4tl4",
            "score": 8,
            "created_utc": 1557319573.0,
            "replies": []
        },
        {
            "body": "Next time be sure to do an actual video chat where you can both see each other before meeting up.",
            "author": "Luggage4Fun",
            "id": "emujgmw",
            "parent_id": "t3_bm4tl4",
            "score": 4,
            "created_utc": 1557336762.0,
            "replies": []
        },
        {
            "body": "If they only have Snapchat filtered pics I don’t even waste my time. Don’t care how good they look...",
            "author": "Mistawade504",
            "id": "emujl0t",
            "parent_id": "t3_bm4tl4",
            "score": 4,
            "created_utc": 1557336828.0,
            "replies": []
        },
        {
            "body": "I always exchange today pics before scheduling",
            "author": "CheckPlease-",
            "id": "emumrlg",
            "parent_id": "t3_bm4tl4",
            "score": 4,
            "created_utc": 1557338636.0,
            "replies": []
        },
        {
            "body": "**Rule #2:** Always video ASAP. Forget meeting, I don't even exchange more than a 2-3 messages until we have FaceTimed. Furthermore, if you put that in your profile (you want to video immediately) you will notice that you will not be Catfished as often.",
            "author": "itsokmydadisrich",
            "id": "emu1wly",
            "parent_id": "t3_bm4tl4",
            "score": 15,
            "created_utc": 1557327365.0,
            "replies": [
                {
                    "body": "I think this is a solid rule. Admittedly, I resist it until I meet you in person simply because I am paranoid about someone recording it or taking screenshots of me. I need professional discretion and I am always worried about some unsavory doxxing me. But that's my own personal quirk...",
                    "author": "msully01",
                    "id": "emuc32w",
                    "parent_id": "t1_emu1wly",
                    "score": 8,
                    "created_utc": 1557332792.0,
                    "replies": []
                },
                {
                    "body": "I would never facetime a pot before meeting. To me that is an indication of a TW or a guy who wants to turn things sexual before allowance.",
                    "author": "Gucci_Cocaine",
                    "id": "emuiga4",
                    "parent_id": "t1_emu1wly",
                    "score": 12,
                    "created_utc": 1557336211.0,
                    "replies": [
                        {
                            "body": "I have never had an issue with anyone thinking it was inappropriate to FaceTime. Usually if they are fake, then at that point they just disappear and I never hear from them again. Which is great for me, as I didn't waste more than a few minutes of my time.\n\nRegarding \"turning things sexual\" I am not sure what you mean. It's a video call, its not like anyone can jump through the screen and begin \"Operation McGrope\". If you feel uncomfortable at any time, simply click the red icon and hang up. Done. You just saved yourself a trip and a catastrophe. \n\nIf someone is unwilling to video, you are very likely being catfished. Continue making excuses for them at your own peril.",
                            "author": "itsokmydadisrich",
                            "id": "emurka6",
                            "parent_id": "t1_emuiga4",
                            "score": 3,
                            "created_utc": 1557341645.0,
                            "replies": [
                                {
                                    "body": "I mean good for you I guess I still wouldn't facetime a SD in advance of meeting them. When I am on SA I get upwards of 10 messages a day and lots of them are trying to find creative ways to waste my time. The guys that try facetime corrolate heavily with guys I feel are trying to get free sex chat. And while yeah I can just hang up on someone if they're wanking I'd rather not see it in the first place. \n\nBut then again I look like my photos so for me it's not really an issue anyway.",
                                    "author": "Gucci_Cocaine",
                                    "id": "emuspm5",
                                    "parent_id": "t1_emurka6",
                                    "score": 9,
                                    "created_utc": 1557342351.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "How is FaceTime an indicator of time wasting or wanting things to turn sexual before allowance?  By your statement alone you sound like a waste of time. I bet you ask for money from guys before even meeting with them.",
                            "author": "Mistawade504",
                            "id": "emujuyu",
                            "parent_id": "t1_emuiga4",
                            "score": -1,
                            "created_utc": 1557336976.0,
                            "replies": [
                                {
                                    "body": "I certainly do not. Because in my experience guys who ask me to facetime have been TW. When I talk to a pot I text them for a day max and then arrange a date I don't have time to be talking to someone for weeks when I don't even know if it will develop. If you're a real sd one drink or lunch is not gonna cut into your pockets where it will be an issue. Also I don't see a need to resort to ad hominom attacks I said nothing towards you.",
                                    "author": "Gucci_Cocaine",
                                    "id": "emukfjj",
                                    "parent_id": "t1_emujuyu",
                                    "score": 5,
                                    "created_utc": 1557337268.0,
                                    "replies": [
                                        {
                                            "body": "I simply shared a counterpoint to you from a SB perspective which is the whole point of this forum.",
                                            "author": "Gucci_Cocaine",
                                            "id": "emukl45",
                                            "parent_id": "t1_emukfjj",
                                            "score": 4,
                                            "created_utc": 1557337348.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "It’s awful. I had a POT I probably would’ve pursued but her insistence on filtered pics ruined it. She’s cute just as she is, But she’s not the pictures she sends. So when she walks in the room what would be a feeling of excitement is a feeling of let down. I tried to tell her. Her response, another filtered picture.",
            "author": "midwesternguru",
            "id": "emu0xjq",
            "parent_id": "t3_bm4tl4",
            "score": 3,
            "created_utc": 1557326859.0,
            "replies": [
                {
                    "body": "18-25yr SBs LOVE Snapchat filters... so annoying\nThey get offended when you ask for a plain unfiltered pic 🙄",
                    "author": "unlovablemonster2",
                    "id": "emua5em",
                    "parent_id": "t1_emu0xjq",
                    "score": 6,
                    "created_utc": 1557331722.0,
                    "replies": [
                        {
                            "body": "As a 25yr old SB who doesn't even really know how to use snap chat I take offence to this! /s\n\nBut in all reality, I actually don't.. So all of my pictures are natural, I don't wear a lot of make up, extensions or fake nails and I know that it's not what everyone is looking for but I'd rather be honest and up front with natural photos then put whatever filters or what not over my face, it makes no sense to me. But most of social media doesn't lol.",
                            "author": "AlwaysHigh27",
                            "id": "emufsys",
                            "parent_id": "t1_emua5em",
                            "score": 3,
                            "created_utc": 1557334799.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I find myself too forthcoming.  When guys ask for pics once we've moved to private I send them full body photos (nude or otherwise)  from the last 2 or so weeks.. because I don't want to be that person...\n\nI finally had a guy who said thanks,  but I just wanted your face..\"🤣🤣🤣🤣",
            "author": "Moon_lili",
            "id": "emxbkfd",
            "parent_id": "t3_bm4tl4",
            "score": 3,
            "created_utc": 1557413931.0,
            "replies": []
        },
        {
            "body": "I have actually had a few where I think the person didn’t know or had convinced themselves that the picture was still accurate even though it was a few years old.  Some girls change a whole lot between 20 and 24 if they party hard.",
            "author": "LotBuilder",
            "id": "emtwglx",
            "parent_id": "t3_bm4tl4",
            "score": 3,
            "created_utc": 1557324414.0,
            "replies": []
        },
        {
            "body": "I always use and recommend the real deal. Trust i.have no lack of interest and believe it or not the adoring gentleman who chooses you wants a real live person.",
            "author": "Princess159",
            "id": "emugz96",
            "parent_id": "t3_bm4tl4",
            "score": 2,
            "created_utc": 1557335435.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "emvafxs",
            "parent_id": "t3_bm4tl4",
            "score": 2,
            "created_utc": 1557352208.0,
            "replies": [
                {
                    "body": "Hey,\n\nI was recognized by an old schoolmate lately - have seen her the last time when we were 13/14 years old - and she mentioned that I didn't change at all ... so what are a measly 8 years in comparison?\n\n&#x200B;\n\n... ok, this keeps me wondering if I either still look like a teenager, or I already looked like an old man while in school ...\n\n&#x200B;\n\nHowever, I personally prefer unfiltered, up-to-date and with as little make-up as possible photos - I am more the natural, girl next door guy.",
                    "author": "TA_SD_EU",
                    "id": "emvp6wg",
                    "parent_id": "t1_emvafxs",
                    "score": 0,
                    "created_utc": 1557362504.0,
                    "replies": [
                        {
                            "body": "Some people age well. \n\nI've lost weight and most of my old \"pals\" won't recognize me.",
                            "author": "anonymou555andWich",
                            "id": "emw16y5",
                            "parent_id": "t1_emvp6wg",
                            "score": 1,
                            "created_utc": 1557370985.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I’ve had a few awkward coffees with SBs that do not look like their photo, but my most memorable one who looked nothing like her photo turned out to be a stunner, instantly attracted to her but she had to introduce herself as she wasn’t what I expected.",
            "author": "Jamesthesage",
            "id": "emw7wv7",
            "parent_id": "t3_bm4tl4",
            "score": 2,
            "created_utc": 1557376491.0,
            "replies": []
        },
        {
            "body": "The first part of this [song](https://m.youtube.com/watch?v=F9M50mB_R8U)",
            "author": null,
            "id": "emwb12s",
            "parent_id": "t3_bm4tl4",
            "score": 2,
            "created_utc": 1557381449.0,
            "replies": []
        },
        {
            "body": "I had a guy try to catfish me using a female's  picture.   Then started this run around about needing \"errands\" run.  Just for shits and giggles I entertained him with \"what kind of errands?\"  Lol.... was some gift card scheme I'm pretty sure.   He said \"I  just need someone loyal\" (and dumb).  Not today Satan. 😑😑😆😆",
            "author": "mandm418",
            "id": "emyt9h2",
            "parent_id": "t3_bm4tl4",
            "score": 2,
            "created_utc": 1557443525.0,
            "replies": []
        },
        {
            "body": "This is why I post pictures with no make up on my profile.",
            "author": "Hislovelysub83",
            "id": "emuvbzt",
            "parent_id": "t3_bm4tl4",
            "score": 3,
            "created_utc": 1557343924.0,
            "replies": []
        },
        {
            "body": "I’ve accidentally been a SB before, it was awesome since one of my big “love language” categories is gifts. Not in a way where I’m needing my man to pay my rent and take care of me, I pay all my bills on my own. But there is nothing like a man who can take care of himself, too, and buy me something nice every now and then. Even if it’s a great dinner we get to share together. I feel like most women attempting to be a SB while using fake photos are ONLY in it for the money. Definitely advice steering clear of those ones... so maybe it was a good thing after all that she used old photos, eh? Still good advice, but a catfish will always be a catfish.",
            "author": null,
            "id": "emuqwyl",
            "parent_id": "t3_bm4tl4",
            "score": 1,
            "created_utc": 1557341248.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "emtptc3",
            "parent_id": "t1_emtpmtr",
            "score": 16,
            "created_utc": 1557320025.0,
            "replies": [
                {
                    "body": "Oh, indeed. I understand their motivation entirely. It is a \"fake it till you make it\" mentality. Unfortunately, they do not think much deeper than that on the true ramifications and how they are doing themselves more harm than good.",
                    "author": "msully01",
                    "id": "emtqoqn",
                    "parent_id": "t1_emtptc3",
                    "score": 9,
                    "created_utc": 1557320708.0,
                    "replies": [
                        {
                            "body": "They think that they are going to win you over with their awesome personalities. It's happened to me many times.",
                            "author": "Esteban_1812",
                            "id": "emtwdbo",
                            "parent_id": "t1_emtqoqn",
                            "score": 4,
                            "created_utc": 1557324363.0,
                            "replies": [
                                {
                                    "body": "This is a fatal flaw of both genders: applying the drivers of attraction of one sex to another without realizing they are completely different in material ways. Intellect and personality have turned many an average SD into a total hottie, but it takes longer than one M&G for the reverse to occur.",
                                    "author": "msully01",
                                    "id": "emty986",
                                    "parent_id": "t1_emtwdbo",
                                    "score": 6,
                                    "created_utc": 1557325438.0,
                                    "replies": [
                                        {
                                            "body": "Yeah. I mean my needs for SBs are very specific. That's part of the whole point of it for me.  I will accept less than ideal body type for a very pretty face or TRULY exceptional intellect (she is obviously much smarter than me)\n\nThe best part is when a SB shows up obviously heavier or less attractive than her deceptive photos and the she realizes within a  few minutes that she has bitten off more than she can chew... and that she has no chance whatsoever.  The nervous behavior and desire to punch out is palpable.  I am polite and friendly but she can see that she is obviously out of place.\n\nI think part of it is definitely cognitive dissonance; despite knowing that they are not the person they envision themselves to be, having the attention of an SD affirms their more attractive imaginary identity. \nThere is definitely some of that going on.  I buy them a drink! They need it.",
                                            "author": "Esteban_1812",
                                            "id": "emvx141",
                                            "parent_id": "t1_emty986",
                                            "score": 1,
                                            "created_utc": 1557368070.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "To be fair, not everyone who has misleading photos does so to deceive necessarily. I personally think I look very different on profile than straight on, so I would overcompensate with a mix of angles, but not everyone thinks of that.",
            "author": "vshzzd",
            "id": "emtr7ul",
            "parent_id": "t1_emtpmtr",
            "score": 10,
            "created_utc": 1557321091.0,
            "replies": [
                {
                    "body": "Absolutely and that is a very good point. I happen to have one of those faces that \"loves\" the camera for whatever reason, and I *know* that the reality is slightly different. This is why I also search for photos that are not as flattering or show me in different lights/outfits/settings.",
                    "author": "msully01",
                    "id": "emtrqx2",
                    "parent_id": "t1_emtr7ul",
                    "score": 3,
                    "created_utc": 1557321451.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "This!!!",
            "author": null,
            "id": "emtxduo",
            "parent_id": "t1_emtw21w",
            "score": 6,
            "created_utc": 1557324950.0,
            "replies": []
        },
        {
            "body": "LOL those must be some good pics!",
            "author": "aajniojnoihnoi",
            "id": "emw083k",
            "parent_id": "t1_emua394",
            "score": 2,
            "created_utc": 1557370263.0,
            "replies": []
        },
        {
            "body": "😂😂 How??  I started keeping a spreadsheet of usernames and profile snippets so when I restart my search with a new account then I know who’s a scammer, who I’ve talked to already, etc.",
            "author": null,
            "id": "emwajsa",
            "parent_id": "t1_emua394",
            "score": 2,
            "created_utc": 1557380883.0,
            "replies": [
                {
                    "body": "> who I’ve talked to already\n\nfor this reason, I leave conversations in an archive. While you don't catch a new user name, you might catch one with new pictures but an old contact that caught your eye in the past.",
                    "author": "TooOldForSD",
                    "id": "emwgip4",
                    "parent_id": "t1_emwajsa",
                    "score": 2,
                    "created_utc": 1557388364.0,
                    "replies": []
                },
                {
                    "body": "Because she had a new set of photos from when we was younger and MUCH MUCH thinner. And so I was attracted again. And it was a new profile, but nicely written. And I did a LOT of facepalming when I realized what I had done.",
                    "author": "marker3000",
                    "id": "en0xm42",
                    "parent_id": "t1_emwajsa",
                    "score": 1,
                    "created_utc": 1557501534.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I think this is a solid rule. Admittedly, I resist it until I meet you in person simply because I am paranoid about someone recording it or taking screenshots of me. I need professional discretion and I am always worried about some unsavory doxxing me. But that's my own personal quirk...",
            "author": "msully01",
            "id": "emuc32w",
            "parent_id": "t1_emu1wly",
            "score": 8,
            "created_utc": 1557332792.0,
            "replies": []
        },
        {
            "body": "I would never facetime a pot before meeting. To me that is an indication of a TW or a guy who wants to turn things sexual before allowance.",
            "author": "Gucci_Cocaine",
            "id": "emuiga4",
            "parent_id": "t1_emu1wly",
            "score": 12,
            "created_utc": 1557336211.0,
            "replies": [
                {
                    "body": "I have never had an issue with anyone thinking it was inappropriate to FaceTime. Usually if they are fake, then at that point they just disappear and I never hear from them again. Which is great for me, as I didn't waste more than a few minutes of my time.\n\nRegarding \"turning things sexual\" I am not sure what you mean. It's a video call, its not like anyone can jump through the screen and begin \"Operation McGrope\". If you feel uncomfortable at any time, simply click the red icon and hang up. Done. You just saved yourself a trip and a catastrophe. \n\nIf someone is unwilling to video, you are very likely being catfished. Continue making excuses for them at your own peril.",
                    "author": "itsokmydadisrich",
                    "id": "emurka6",
                    "parent_id": "t1_emuiga4",
                    "score": 3,
                    "created_utc": 1557341645.0,
                    "replies": [
                        {
                            "body": "I mean good for you I guess I still wouldn't facetime a SD in advance of meeting them. When I am on SA I get upwards of 10 messages a day and lots of them are trying to find creative ways to waste my time. The guys that try facetime corrolate heavily with guys I feel are trying to get free sex chat. And while yeah I can just hang up on someone if they're wanking I'd rather not see it in the first place. \n\nBut then again I look like my photos so for me it's not really an issue anyway.",
                            "author": "Gucci_Cocaine",
                            "id": "emuspm5",
                            "parent_id": "t1_emurka6",
                            "score": 9,
                            "created_utc": 1557342351.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "How is FaceTime an indicator of time wasting or wanting things to turn sexual before allowance?  By your statement alone you sound like a waste of time. I bet you ask for money from guys before even meeting with them.",
                    "author": "Mistawade504",
                    "id": "emujuyu",
                    "parent_id": "t1_emuiga4",
                    "score": -1,
                    "created_utc": 1557336976.0,
                    "replies": [
                        {
                            "body": "I certainly do not. Because in my experience guys who ask me to facetime have been TW. When I talk to a pot I text them for a day max and then arrange a date I don't have time to be talking to someone for weeks when I don't even know if it will develop. If you're a real sd one drink or lunch is not gonna cut into your pockets where it will be an issue. Also I don't see a need to resort to ad hominom attacks I said nothing towards you.",
                            "author": "Gucci_Cocaine",
                            "id": "emukfjj",
                            "parent_id": "t1_emujuyu",
                            "score": 5,
                            "created_utc": 1557337268.0,
                            "replies": [
                                {
                                    "body": "I simply shared a counterpoint to you from a SB perspective which is the whole point of this forum.",
                                    "author": "Gucci_Cocaine",
                                    "id": "emukl45",
                                    "parent_id": "t1_emukfjj",
                                    "score": 4,
                                    "created_utc": 1557337348.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "18-25yr SBs LOVE Snapchat filters... so annoying\nThey get offended when you ask for a plain unfiltered pic 🙄",
            "author": "unlovablemonster2",
            "id": "emua5em",
            "parent_id": "t1_emu0xjq",
            "score": 6,
            "created_utc": 1557331722.0,
            "replies": [
                {
                    "body": "As a 25yr old SB who doesn't even really know how to use snap chat I take offence to this! /s\n\nBut in all reality, I actually don't.. So all of my pictures are natural, I don't wear a lot of make up, extensions or fake nails and I know that it's not what everyone is looking for but I'd rather be honest and up front with natural photos then put whatever filters or what not over my face, it makes no sense to me. But most of social media doesn't lol.",
                    "author": "AlwaysHigh27",
                    "id": "emufsys",
                    "parent_id": "t1_emua5em",
                    "score": 3,
                    "created_utc": 1557334799.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Hey,\n\nI was recognized by an old schoolmate lately - have seen her the last time when we were 13/14 years old - and she mentioned that I didn't change at all ... so what are a measly 8 years in comparison?\n\n&#x200B;\n\n... ok, this keeps me wondering if I either still look like a teenager, or I already looked like an old man while in school ...\n\n&#x200B;\n\nHowever, I personally prefer unfiltered, up-to-date and with as little make-up as possible photos - I am more the natural, girl next door guy.",
            "author": "TA_SD_EU",
            "id": "emvp6wg",
            "parent_id": "t1_emvafxs",
            "score": 0,
            "created_utc": 1557362504.0,
            "replies": [
                {
                    "body": "Some people age well. \n\nI've lost weight and most of my old \"pals\" won't recognize me.",
                    "author": "anonymou555andWich",
                    "id": "emw16y5",
                    "parent_id": "t1_emvp6wg",
                    "score": 1,
                    "created_utc": 1557370985.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Oh, indeed. I understand their motivation entirely. It is a \"fake it till you make it\" mentality. Unfortunately, they do not think much deeper than that on the true ramifications and how they are doing themselves more harm than good.",
            "author": "msully01",
            "id": "emtqoqn",
            "parent_id": "t1_emtptc3",
            "score": 9,
            "created_utc": 1557320708.0,
            "replies": [
                {
                    "body": "They think that they are going to win you over with their awesome personalities. It's happened to me many times.",
                    "author": "Esteban_1812",
                    "id": "emtwdbo",
                    "parent_id": "t1_emtqoqn",
                    "score": 4,
                    "created_utc": 1557324363.0,
                    "replies": [
                        {
                            "body": "This is a fatal flaw of both genders: applying the drivers of attraction of one sex to another without realizing they are completely different in material ways. Intellect and personality have turned many an average SD into a total hottie, but it takes longer than one M&G for the reverse to occur.",
                            "author": "msully01",
                            "id": "emty986",
                            "parent_id": "t1_emtwdbo",
                            "score": 6,
                            "created_utc": 1557325438.0,
                            "replies": [
                                {
                                    "body": "Yeah. I mean my needs for SBs are very specific. That's part of the whole point of it for me.  I will accept less than ideal body type for a very pretty face or TRULY exceptional intellect (she is obviously much smarter than me)\n\nThe best part is when a SB shows up obviously heavier or less attractive than her deceptive photos and the she realizes within a  few minutes that she has bitten off more than she can chew... and that she has no chance whatsoever.  The nervous behavior and desire to punch out is palpable.  I am polite and friendly but she can see that she is obviously out of place.\n\nI think part of it is definitely cognitive dissonance; despite knowing that they are not the person they envision themselves to be, having the attention of an SD affirms their more attractive imaginary identity. \nThere is definitely some of that going on.  I buy them a drink! They need it.",
                                    "author": "Esteban_1812",
                                    "id": "emvx141",
                                    "parent_id": "t1_emty986",
                                    "score": 1,
                                    "created_utc": 1557368070.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Absolutely and that is a very good point. I happen to have one of those faces that \"loves\" the camera for whatever reason, and I *know* that the reality is slightly different. This is why I also search for photos that are not as flattering or show me in different lights/outfits/settings.",
            "author": "msully01",
            "id": "emtrqx2",
            "parent_id": "t1_emtr7ul",
            "score": 3,
            "created_utc": 1557321451.0,
            "replies": []
        },
        {
            "body": "> who I’ve talked to already\n\nfor this reason, I leave conversations in an archive. While you don't catch a new user name, you might catch one with new pictures but an old contact that caught your eye in the past.",
            "author": "TooOldForSD",
            "id": "emwgip4",
            "parent_id": "t1_emwajsa",
            "score": 2,
            "created_utc": 1557388364.0,
            "replies": []
        },
        {
            "body": "Because she had a new set of photos from when we was younger and MUCH MUCH thinner. And so I was attracted again. And it was a new profile, but nicely written. And I did a LOT of facepalming when I realized what I had done.",
            "author": "marker3000",
            "id": "en0xm42",
            "parent_id": "t1_emwajsa",
            "score": 1,
            "created_utc": 1557501534.0,
            "replies": []
        },
        {
            "body": "I have never had an issue with anyone thinking it was inappropriate to FaceTime. Usually if they are fake, then at that point they just disappear and I never hear from them again. Which is great for me, as I didn't waste more than a few minutes of my time.\n\nRegarding \"turning things sexual\" I am not sure what you mean. It's a video call, its not like anyone can jump through the screen and begin \"Operation McGrope\". If you feel uncomfortable at any time, simply click the red icon and hang up. Done. You just saved yourself a trip and a catastrophe. \n\nIf someone is unwilling to video, you are very likely being catfished. Continue making excuses for them at your own peril.",
            "author": "itsokmydadisrich",
            "id": "emurka6",
            "parent_id": "t1_emuiga4",
            "score": 3,
            "created_utc": 1557341645.0,
            "replies": [
                {
                    "body": "I mean good for you I guess I still wouldn't facetime a SD in advance of meeting them. When I am on SA I get upwards of 10 messages a day and lots of them are trying to find creative ways to waste my time. The guys that try facetime corrolate heavily with guys I feel are trying to get free sex chat. And while yeah I can just hang up on someone if they're wanking I'd rather not see it in the first place. \n\nBut then again I look like my photos so for me it's not really an issue anyway.",
                    "author": "Gucci_Cocaine",
                    "id": "emuspm5",
                    "parent_id": "t1_emurka6",
                    "score": 9,
                    "created_utc": 1557342351.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "How is FaceTime an indicator of time wasting or wanting things to turn sexual before allowance?  By your statement alone you sound like a waste of time. I bet you ask for money from guys before even meeting with them.",
            "author": "Mistawade504",
            "id": "emujuyu",
            "parent_id": "t1_emuiga4",
            "score": -1,
            "created_utc": 1557336976.0,
            "replies": [
                {
                    "body": "I certainly do not. Because in my experience guys who ask me to facetime have been TW. When I talk to a pot I text them for a day max and then arrange a date I don't have time to be talking to someone for weeks when I don't even know if it will develop. If you're a real sd one drink or lunch is not gonna cut into your pockets where it will be an issue. Also I don't see a need to resort to ad hominom attacks I said nothing towards you.",
                    "author": "Gucci_Cocaine",
                    "id": "emukfjj",
                    "parent_id": "t1_emujuyu",
                    "score": 5,
                    "created_utc": 1557337268.0,
                    "replies": [
                        {
                            "body": "I simply shared a counterpoint to you from a SB perspective which is the whole point of this forum.",
                            "author": "Gucci_Cocaine",
                            "id": "emukl45",
                            "parent_id": "t1_emukfjj",
                            "score": 4,
                            "created_utc": 1557337348.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "As a 25yr old SB who doesn't even really know how to use snap chat I take offence to this! /s\n\nBut in all reality, I actually don't.. So all of my pictures are natural, I don't wear a lot of make up, extensions or fake nails and I know that it's not what everyone is looking for but I'd rather be honest and up front with natural photos then put whatever filters or what not over my face, it makes no sense to me. But most of social media doesn't lol.",
            "author": "AlwaysHigh27",
            "id": "emufsys",
            "parent_id": "t1_emua5em",
            "score": 3,
            "created_utc": 1557334799.0,
            "replies": []
        },
        {
            "body": "Some people age well. \n\nI've lost weight and most of my old \"pals\" won't recognize me.",
            "author": "anonymou555andWich",
            "id": "emw16y5",
            "parent_id": "t1_emvp6wg",
            "score": 1,
            "created_utc": 1557370985.0,
            "replies": []
        },
        {
            "body": "They think that they are going to win you over with their awesome personalities. It's happened to me many times.",
            "author": "Esteban_1812",
            "id": "emtwdbo",
            "parent_id": "t1_emtqoqn",
            "score": 4,
            "created_utc": 1557324363.0,
            "replies": [
                {
                    "body": "This is a fatal flaw of both genders: applying the drivers of attraction of one sex to another without realizing they are completely different in material ways. Intellect and personality have turned many an average SD into a total hottie, but it takes longer than one M&G for the reverse to occur.",
                    "author": "msully01",
                    "id": "emty986",
                    "parent_id": "t1_emtwdbo",
                    "score": 6,
                    "created_utc": 1557325438.0,
                    "replies": [
                        {
                            "body": "Yeah. I mean my needs for SBs are very specific. That's part of the whole point of it for me.  I will accept less than ideal body type for a very pretty face or TRULY exceptional intellect (she is obviously much smarter than me)\n\nThe best part is when a SB shows up obviously heavier or less attractive than her deceptive photos and the she realizes within a  few minutes that she has bitten off more than she can chew... and that she has no chance whatsoever.  The nervous behavior and desire to punch out is palpable.  I am polite and friendly but she can see that she is obviously out of place.\n\nI think part of it is definitely cognitive dissonance; despite knowing that they are not the person they envision themselves to be, having the attention of an SD affirms their more attractive imaginary identity. \nThere is definitely some of that going on.  I buy them a drink! They need it.",
                            "author": "Esteban_1812",
                            "id": "emvx141",
                            "parent_id": "t1_emty986",
                            "score": 1,
                            "created_utc": 1557368070.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I mean good for you I guess I still wouldn't facetime a SD in advance of meeting them. When I am on SA I get upwards of 10 messages a day and lots of them are trying to find creative ways to waste my time. The guys that try facetime corrolate heavily with guys I feel are trying to get free sex chat. And while yeah I can just hang up on someone if they're wanking I'd rather not see it in the first place. \n\nBut then again I look like my photos so for me it's not really an issue anyway.",
            "author": "Gucci_Cocaine",
            "id": "emuspm5",
            "parent_id": "t1_emurka6",
            "score": 9,
            "created_utc": 1557342351.0,
            "replies": []
        },
        {
            "body": "I certainly do not. Because in my experience guys who ask me to facetime have been TW. When I talk to a pot I text them for a day max and then arrange a date I don't have time to be talking to someone for weeks when I don't even know if it will develop. If you're a real sd one drink or lunch is not gonna cut into your pockets where it will be an issue. Also I don't see a need to resort to ad hominom attacks I said nothing towards you.",
            "author": "Gucci_Cocaine",
            "id": "emukfjj",
            "parent_id": "t1_emujuyu",
            "score": 5,
            "created_utc": 1557337268.0,
            "replies": [
                {
                    "body": "I simply shared a counterpoint to you from a SB perspective which is the whole point of this forum.",
                    "author": "Gucci_Cocaine",
                    "id": "emukl45",
                    "parent_id": "t1_emukfjj",
                    "score": 4,
                    "created_utc": 1557337348.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "This is a fatal flaw of both genders: applying the drivers of attraction of one sex to another without realizing they are completely different in material ways. Intellect and personality have turned many an average SD into a total hottie, but it takes longer than one M&G for the reverse to occur.",
            "author": "msully01",
            "id": "emty986",
            "parent_id": "t1_emtwdbo",
            "score": 6,
            "created_utc": 1557325438.0,
            "replies": [
                {
                    "body": "Yeah. I mean my needs for SBs are very specific. That's part of the whole point of it for me.  I will accept less than ideal body type for a very pretty face or TRULY exceptional intellect (she is obviously much smarter than me)\n\nThe best part is when a SB shows up obviously heavier or less attractive than her deceptive photos and the she realizes within a  few minutes that she has bitten off more than she can chew... and that she has no chance whatsoever.  The nervous behavior and desire to punch out is palpable.  I am polite and friendly but she can see that she is obviously out of place.\n\nI think part of it is definitely cognitive dissonance; despite knowing that they are not the person they envision themselves to be, having the attention of an SD affirms their more attractive imaginary identity. \nThere is definitely some of that going on.  I buy them a drink! They need it.",
                    "author": "Esteban_1812",
                    "id": "emvx141",
                    "parent_id": "t1_emty986",
                    "score": 1,
                    "created_utc": 1557368070.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I simply shared a counterpoint to you from a SB perspective which is the whole point of this forum.",
            "author": "Gucci_Cocaine",
            "id": "emukl45",
            "parent_id": "t1_emukfjj",
            "score": 4,
            "created_utc": 1557337348.0,
            "replies": []
        },
        {
            "body": "Yeah. I mean my needs for SBs are very specific. That's part of the whole point of it for me.  I will accept less than ideal body type for a very pretty face or TRULY exceptional intellect (she is obviously much smarter than me)\n\nThe best part is when a SB shows up obviously heavier or less attractive than her deceptive photos and the she realizes within a  few minutes that she has bitten off more than she can chew... and that she has no chance whatsoever.  The nervous behavior and desire to punch out is palpable.  I am polite and friendly but she can see that she is obviously out of place.\n\nI think part of it is definitely cognitive dissonance; despite knowing that they are not the person they envision themselves to be, having the attention of an SD affirms their more attractive imaginary identity. \nThere is definitely some of that going on.  I buy them a drink! They need it.",
            "author": "Esteban_1812",
            "id": "emvx141",
            "parent_id": "t1_emty986",
            "score": 1,
            "created_utc": 1557368070.0,
            "replies": []
        }
    ]
}