{
    "title": "SD is a little strange and awful at sex",
    "post_id": "pwaq5p",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/pwaq5p/sd_is_a_little_strange_and_awful_at_sex/",
    "author": "Throwawayevilperson",
    "body": "(I’m using my throwaway because this is embarrassing)\n\nTLDR: SD is awful at sex/possibly suffering from erectile dysfunction and is odd in general. He gives a generous ppm though. How do I help him/should I just leave?\n\nI (19f) have a new SD (53ish m), I find him strange and sometimes annoying but feel guilty as he gives me a generous ppm and has no problem compensating me for platonic lunches. \n\nDuring the dinner before our first intimate date last week, he held my hand all through my starter. He also commented on my dress and sort of grabbed my side/waist numerous times when I was sitting down (I asked him to stop “grabbing me” to which he replied “haha, this isn’t grabbing you! Grabbing would be like…”). He said I’m like a “princess” and has previously called me “feisty”. \n\nHe usually sends constant text messages throughout the day and our first intimate date was just…odd. He’s bad at kissing, spanked me lightly for ages (which is fine), and then tried to ‘eat me out’. He spent ages licking and blowing (??) on the top and bottom of my vag, completely missing the important part and at one point was just shallowly fingering me whilst moaning. I was tipsy and had to stop myself from laughing audibly. I couldn’t believe it or even get wet as it felt almost clinical. \n\nWhen he finally stopped, he got up and I went to feel his privates and he was soft and tiny. He took of his underwear and it was minuscule! He told me “it’s okay!” and asked me to suck his balls, which I declined. I played with them and while he did get hard and grow a little, it’s was still very small. In comparison, his balls were massive and seemed to be one (idk if that’s normal). Every time he tried to move or enter me, he would lose his erection and blamed it on ‘having difficulty finding my hole’.\n\nI ended up just giving him a handjob and he came almost silently in the condom. It was strange and I believe that he is suffering from erectile dysfunction. He blames ‘issues at work which are bothering him’. I have suggested viagra and he pretended to not know what it was. \n\nLater, he sent me a text saying “You are very lovely - I enjoyed our time together - and thanks for being patient. I was a bit distracted and them embarrassed. Hope you didn’t mind?” \n\nI’m unsure of what to do, the ppm is generous and he seems sweet but is totally oblivious of how awful the intimacy is. How do I help him? Should I leave?",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/pwaq5p/sd_is_a_little_strange_and_awful_at_sex/",
    "score": 99,
    "upvote_ratio": 0.92,
    "created_utc": 1632721204.0,
    "num_comments": 83,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "Truly a painful read",
            "author": "sweet_ging",
            "id": "heg2ryx",
            "parent_id": "t3_pwaq5p",
            "score": 51,
            "created_utc": 1632726194.0,
            "replies": []
        },
        {
            "body": "I sympathize your awkward sexual encounter with this SD; I imagine that with your age difference you would expect better performance on his end. \n\nIf you are  happy with his ppm amount (and the hand holding & grabbing at dinner was not a deal breaker), and it is solely the sex that is a potential deal breaker, then I propose to you teach him in a way that makes him feel desired.\n\nI will never forget the first time I had \"good\" sex. It was after my divorce and I finally met someone that knew what they liked, how to tell/show me what they liked and most importantly she made me feel desired is what made it great. \n\nShe desired me, and back then it was for my looks over my $, but she made the effort to guide & teach me how to please her. So if you desire something about this guy ($) then I propose that you try to guide him too.  \n\n\nP.S.  \nI would have suggested you next this guy if just based on the non-sex scenarios you mentioned (hand holding and ass grabbing).",
            "author": "WI_Gent",
            "id": "heg81cx",
            "parent_id": "t3_pwaq5p",
            "score": 41,
            "created_utc": 1632731443.0,
            "replies": []
        },
        {
            "body": "Oh my god that description was vivid. You had to stop yourself from laughing? 😂😂😂😂😂😂😂 you made my day",
            "author": "UnearthlyDinosaur",
            "id": "hefx7jv",
            "parent_id": "t3_pwaq5p",
            "score": 112,
            "created_utc": 1632722003.0,
            "replies": [
                {
                    "body": "Hahahah",
                    "author": "BaileyBell2021",
                    "id": "heg1ye1",
                    "parent_id": "t1_hefx7jv",
                    "score": 4,
                    "created_utc": 1632725522.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "This was so cringe. I would end it there are better out there it might just take a little longer to find. But he won’t get better and you won’t ever be ok w this. I’d end it now and save you the anguish",
            "author": "thereadinessisall",
            "id": "hefz3g7",
            "parent_id": "t3_pwaq5p",
            "score": 49,
            "created_utc": 1632723361.0,
            "replies": [
                {
                    "body": "I think I will, I feel that’s it’s also kinda mean to him to in a way.",
                    "author": "Throwawayevilperson",
                    "id": "heg0c7h",
                    "parent_id": "t1_hefz3g7",
                    "score": 12,
                    "created_utc": 1632724291.0,
                    "replies": [
                        {
                            "body": "It’s better to end early rather than be uncomfortable.",
                            "author": "highjinx411",
                            "id": "hei0w2c",
                            "parent_id": "t1_heg0c7h",
                            "score": 11,
                            "created_utc": 1632767396.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "This post reminds me that I am not the worst SD ever to walk this earth.\n\n😅😅",
            "author": "eurosd",
            "id": "hegg02d",
            "parent_id": "t3_pwaq5p",
            "score": 29,
            "created_utc": 1632739232.0,
            "replies": []
        },
        {
            "body": "NOW ... you know why he has to pay for an SR. 😳",
            "author": "letsjusthavefunnow",
            "id": "hegic4g",
            "parent_id": "t3_pwaq5p",
            "score": 30,
            "created_utc": 1632741040.0,
            "replies": [
                {
                    "body": "Not simply pay, but also generously.",
                    "author": "MyIncognitoMe",
                    "id": "hegr6e5",
                    "parent_id": "t1_hegic4g",
                    "score": 20,
                    "created_utc": 1632746555.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Lol! You should write books, that description had me laughing and cringing for you. I’ve had my share of sd’s that had no idea what to do with a woman in the bedroom, thankfully those are the minority. It is important that we’re satisfied, bring a vibrator along or do something to SHOW him how you like it. You have to take some initiative here. He probably was really nervous too so I think giving yourselves some time to get more comfortable and acquainted with one another could be beneficial. You said he gives you a generous ppm and even pays for platonic dates so he does sound like a quality sd, even if he isn’t a quality lover. Keep seeing him IMO and meet some other sd’s. If you find someone you click with better then you can just end the arrangement.",
            "author": null,
            "id": "heh2tfu",
            "parent_id": "t3_pwaq5p",
            "score": 13,
            "created_utc": 1632752300.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "hehfao3",
                    "parent_id": "t1_heh2tfu",
                    "score": 5,
                    "created_utc": 1632757632.0,
                    "replies": [
                        {
                            "body": "Just look at it as like a pet project lol. You’ll lose nothing and you can probably help this guy even if you don’t stick around for the long term. Always leave people better. 💜",
                            "author": null,
                            "id": "hehld5t",
                            "parent_id": "t1_hehfao3",
                            "score": 6,
                            "created_utc": 1632760232.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yes. This is par for the course with many older guys, although not all by any means. I prefer it to the more aggressive type in many ways, although they turn me on a lot more.\n\nBringing a weak vibrator along can help a bit with the awkward foreplay, but otherwise see if you can appreciate how much courage it takes for a man to be that vulnerable in front of a beautiful woman. Also, there may be medical or other reasons why viagra won’t work for him. \n\nBottom line is that it’s ok if you don’t want to have weird gross half-sex. I was married for many years so I’m already used to it, but I did pass on an SD who was like that and required exclusivity. No thanks.",
            "author": "Katecambriare",
            "id": "hegia32",
            "parent_id": "t3_pwaq5p",
            "score": 22,
            "created_utc": 1632740998.0,
            "replies": []
        },
        {
            "body": "Lolllll I had a similar experience with a partner. Toys help! I've also had that moment where he was on top putting in work sweating to death and I had to stop myself from laughing because I didn't feel anything 😭 maybe try telling him what/it wasn't enjoyable for you and see if he can make adjustments so that it's not a completely miserable experience for you. I'm bi so I figure if I can have sex with a girl I can probably have sex with a guy with a micro penis 😂 God bless you though sis. After two terrible sexual counters I stopped being nice and just told him how to adjust what he's doing. A lot of these men are too damn old to suck at pleasing a women 😂",
            "author": null,
            "id": "heg8839",
            "parent_id": "t3_pwaq5p",
            "score": 18,
            "created_utc": 1632731673.0,
            "replies": [
                {
                    "body": "Well said",
                    "author": "luckyladyjade",
                    "id": "hehr6we",
                    "parent_id": "t1_heg8839",
                    "score": 1,
                    "created_utc": 1632763030.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Ask yourself how you would feel about having sex with him when you look back at this situation in 10 years from now.\n\nAfter that, ask yourself if it's worth the money.\n\nOf course, when dating a SD you're probably able to ignore some details that would be a slight turn off when vanilla dating a guy (age, looks) but never ever completely push your boundaries because it might damage you over time.\n\nThere's a reason sex workers develop this 'on/off switch' in their head. It's to protect themselves and to be able to do things they don't really enjoy.\nThat's not healthy in the long run.",
            "author": "Neko333Kitsune",
            "id": "hegbwb9",
            "parent_id": "t3_pwaq5p",
            "score": 19,
            "created_utc": 1632735577.0,
            "replies": []
        },
        {
            "body": "\"There, but for the grace of God, go I\".\n\nI am in my late 40's, and already have signs of ED.  I can't feel anything through a condom, and can't maintain an erection.  I can't come from a BJ (or at least I haven't met anyone talented enough).\n\nSome of the things you mention are outside of his control.  Ability to maintain an erection.  Size of his penis.  Etc.  If I find myself in a similar spot, I would be very grateful to someone who was gentle and helped me with those issues instead of judging me for them.\n\nAs for the bad oral sex....  Tell him what works for you!  If he is doing it bad, and you didn't tell him what you want, then that is really on you.  Sure he should have been better... but men are not mind readers either.  And definitely bring a toy that he can use on you next time.",
            "author": "robhudsondfw",
            "id": "hehd5yx",
            "parent_id": "t3_pwaq5p",
            "score": 13,
            "created_utc": 1632756742.0,
            "replies": [
                {
                    "body": "Yes! This exactly. OP you can tell him in a \"strengths based\" way. Make it fun and sexy. People often forget that basic dirty talk is pretty much just instructions with a lot of gasping and moaning. \"Do it like that! I want your tongue on my clit. Yes! Lower, nearly there. Up, please oh just up a little! Yes. Lick it like \\[appropriate metaphor\\]. Kiss it with your lips. Suck on it. Eep! Not so hard there, Tiger. Ohhhh yeah like that.\"\n\nu/robhudsondfw I hope that you've seen a doctor about the ED. ;) The symptoms you're mentioning make me think that there might be a blood pressure/blood sugar problem. Early onset ED (40 is very young) with numbness in the penis can commonly come from heart disease or diabetes/pre-diabetes.",
                    "author": "NerdMagpie",
                    "id": "heilx8z",
                    "parent_id": "t1_hehd5yx",
                    "score": 7,
                    "created_utc": 1632776907.0,
                    "replies": [
                        {
                            "body": "It is very possible that it is related to blood sugar.  I do have blood sugar issues.  Eep!  \n\nI would just love to be able to enjoy sex with a condom.  I would have so much more sex!",
                            "author": "robhudsondfw",
                            "id": "heimb0m",
                            "parent_id": "t1_heilx8z",
                            "score": 3,
                            "created_utc": 1632777083.0,
                            "replies": []
                        },
                        {
                            "body": "💯 \nWhat a wonderful outlook you have!  I love getting feedback from a woman, and they love how well I follow it!\n\nHuman beings do not come from cookie cutters. What one person loves another will find, “Meh.”",
                            "author": "Chill_SD1974",
                            "id": "hemex91",
                            "parent_id": "t1_heilx8z",
                            "score": 2,
                            "created_utc": 1632851820.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "100%",
                    "author": "tim0690",
                    "id": "hehvtz3",
                    "parent_id": "t1_hehd5yx",
                    "score": 3,
                    "created_utc": 1632765091.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "All I can think of is...teach him!  Teach him what you like. Teach him how to please you.  It will boost his confidence, which he will be thankful for.  And, he may become abetter lover, and a greater SD as well.  There's no changing what he is packing, but that doesn't mean you can't make him feel like he is the best in the world.  \n\nJust be tactful about it all.  I'm an upfront and open type of guy, so I'd want to be told directly.  This SD is probably different. When he goes down on you, ask him to do specific things you like.  \n\nBut it was probably just nerves, as it was first intimate date.  As long as everything is great with him otherwise, the sex can be learned (well, except size).",
            "author": "MrRhoarke",
            "id": "heh8f9d",
            "parent_id": "t3_pwaq5p",
            "score": 13,
            "created_utc": 1632754733.0,
            "replies": []
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "hehbm4o",
            "parent_id": "t3_pwaq5p",
            "score": 6,
            "created_utc": 1632756086.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "hehc2p3",
                    "parent_id": "t1_hehbm4o",
                    "score": 4,
                    "created_utc": 1632756280.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Did the thought “easy money” cross your mind? 😂",
            "author": null,
            "id": "hefwco8",
            "parent_id": "t3_pwaq5p",
            "score": 17,
            "created_utc": 1632721373.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "hefycx6",
                    "parent_id": "t1_hefwco8",
                    "score": 67,
                    "created_utc": 1632722825.0,
                    "replies": [
                        {
                            "body": "This made me giggle",
                            "author": "Throwawayevilperson",
                            "id": "heg0jz6",
                            "parent_id": "t1_hefycx6",
                            "score": 18,
                            "created_utc": 1632724448.0,
                            "replies": []
                        },
                        {
                            "body": "Uniball. Omg that gave me a good chuckle.",
                            "author": "rachella32",
                            "id": "hegq2tz",
                            "parent_id": "t1_hefycx6",
                            "score": 5,
                            "created_utc": 1632745938.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Is never “easy money” - fast money, maybe. But not “easy”",
                    "author": "thereadinessisall",
                    "id": "hefyzeq",
                    "parent_id": "t1_hefwco8",
                    "score": 33,
                    "created_utc": 1632723280.0,
                    "replies": []
                },
                {
                    "body": "Honestly it’s not very easy. I feel bad but I’m also not very good at faking it. I’ve always felt at least some modicum of attraction to my previous SDs (2) 😭",
                    "author": "Throwawayevilperson",
                    "id": "hefwhwj",
                    "parent_id": "t1_hefwco8",
                    "score": 17,
                    "created_utc": 1632721479.0,
                    "replies": [
                        {
                            "body": "Tell him sugaring is not for you and move on from him. Not worth the mental anguish.",
                            "author": null,
                            "id": "hefx6yj",
                            "parent_id": "t1_hefwhwj",
                            "score": 15,
                            "created_utc": 1632721991.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I'd leave, you're just going to get more miserable and frustrated and start to hate the situation even more and start feeling really bad for forcing yourself through it. Sometimes things just need some time and getting used to for the intimacy to become good, other times there is no chance of it ever being good with someone, your situation seems like the latter. Best to find someone who can provide very good or at least passable sex and who doesn't come off as a needy creeper.",
            "author": "dapperswaggered",
            "id": "hehialb",
            "parent_id": "t3_pwaq5p",
            "score": 4,
            "created_utc": 1632758887.0,
            "replies": []
        },
        {
            "body": "Yeah you sound pretty miserable with the situation. You should leave. Find a dude who will satisfy you. Don't feel bad about it. This will let him find someone who actually enjoys being with him.",
            "author": "fatsocalsd",
            "id": "heie0vu",
            "parent_id": "t3_pwaq5p",
            "score": 4,
            "created_utc": 1632773359.0,
            "replies": []
        },
        {
            "body": "I’m a SD, 41 yo. \n\nYou can’t go back to platonic. That’s probably worse than just ghosting. If an older successful man really needs to talk to woman half his age, either she’s in the top 1% of interesting or something ain’t right with him.  It’s not a knock on you or women in general, but most daddies probably have 30-40 years worth of friends keep in touch with, not to mention maybe spouses and offspring. \n\nI would caution against trying to improve his sex unless you’re in it for the long haul. Imagine going though life as a guy with a small penis. You always disappoint women and never get to please them. You have no confidence so it’s hard to perform. Now along comes a woman who teaches you how to please her. You’re probably gonna latch on to her for dear life. You’ll effectively be the girl he lost his virginity to. It will be the best sex he’s ever had and you will be forever special to him. \n\nImagine how attached he’s likely to become, like a teenager with his first girlfriend.  I doubt you want to be that important to him. I’d worry about ending up with a stalker or worse.  \n\nIf you’re gonna keep things status quo, put up a mental barrier and keep giving him hand jobs for cash, it probably won’t last much longer anyways. Men get bored of sex in the absence of connection. \n\nSo yeah, probably just end it. Saves you lots of drama and you’re probably not missing out on too much money anyways.",
            "author": "Pronicator",
            "id": "heh7vp2",
            "parent_id": "t3_pwaq5p",
            "score": 9,
            "created_utc": 1632754503.0,
            "replies": [
                {
                    "body": "Thanks for the perspective. I wouldn’t consider going back to platonic, it isn’t viable nor fair and as you’ve said, I don’t think he needs a friend-for-hire.",
                    "author": "Throwawayevilperson",
                    "id": "hehf4l1",
                    "parent_id": "t1_heh7vp2",
                    "score": 5,
                    "created_utc": 1632757561.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "And stories like this is why plenty of women on SA prefer younger, more attractive men for Splenda/average allowances.",
            "author": "new_sd_acct",
            "id": "hefy3v3",
            "parent_id": "t3_pwaq5p",
            "score": 16,
            "created_utc": 1632722649.0,
            "replies": [
                {
                    "body": "If he doesn't know what a clit is or where it's located at 50, can you imagine how clueless he was in his 30s?\n\nOP sounds like he might benefit from some videos on how to go down on a woman. He needs some guidance, so maybe you should decide whether you want to take that on. Understandable if, at 19, you'd rather have a lover who knows what he's doing.",
                    "author": "ChapterRelative",
                    "id": "heg03kl",
                    "parent_id": "t1_hefy3v3",
                    "score": 13,
                    "created_utc": 1632724112.0,
                    "replies": [
                        {
                            "body": "It honestly seemed like he already had his ‘technique’. Maybe I’ll try to show him but idk how to without seeming rude. I think I’ll end it",
                            "author": "Throwawayevilperson",
                            "id": "heg0rai",
                            "parent_id": "t1_heg03kl",
                            "score": 10,
                            "created_utc": 1632724598.0,
                            "replies": [
                                {
                                    "body": "It’s not rude.\n\n“This is what I enjoy”\n\nI had a girl that wanted more clit play during oral. After a few months she just said “move up more” and I comprehended easily.",
                                    "author": "farlack",
                                    "id": "hehhqf7",
                                    "parent_id": "t1_heg0rai",
                                    "score": 3,
                                    "created_utc": 1632758654.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "My previous SDS were around the same age and were good at sex, I think he just isn’t good at it maybe? Idk",
                    "author": "Throwawayevilperson",
                    "id": "hefyf4c",
                    "parent_id": "t1_hefy3v3",
                    "score": 12,
                    "created_utc": 1632722869.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "heg0pv2",
                            "parent_id": "t1_hefyf4c",
                            "score": -7,
                            "created_utc": 1632724568.0,
                            "replies": [
                                {
                                    "body": "We discussed our likes before we were intimate & I communicated throughout the ‘sex’. I showed him where my clit was, he just didn’t get it. The only things I declined were the public groping & sucking his balls. I’m sorry but I wasn’t comfortable putting them in my mouth 😭",
                                    "author": "Throwawayevilperson",
                                    "id": "heg17a6",
                                    "parent_id": "t1_heg0pv2",
                                    "score": 17,
                                    "created_utc": 1632724931.0,
                                    "replies": [
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "hegdmmf",
                                            "parent_id": "t1_heg17a6",
                                            "score": 9,
                                            "created_utc": 1632737236.0,
                                            "replies": [
                                                {
                                                    "body": "😭😭😭😭",
                                                    "author": "Throwawayevilperson",
                                                    "id": "hegfbsa",
                                                    "parent_id": "t1_hegdmmf",
                                                    "score": 7,
                                                    "created_utc": 1632738691.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "Being weirdly groped and then dismissed when told to stop and asked to suck this man's balls...? NO! Even if those things were a \"let down\" he had more than enough reason to still be happy and turned on-- the simple fact that he's in bed with a hot 19 year old woman who is way out of his league is a damn good reason to be happy. (Not saying that alone is the end all be all.) But yeah, let's blame OP for his shitty performance and behavior! 🤣🙄😒\n\nCan't kiss.\nDoesn't know how to eat pussy or where the clit resides.\nCan't get and stay hard.\nCan't find her \"hole\"????????\n\nHe needs more than communication.\nHe sounds like he needs a damn miracle.\n\nNow, I don't disagree that communication is an essential part of good sex. I've been having sex long enough that I know this is very true. \n\nHowever, for OP.... No. Just NO. Ain't no way at 19, was I gonna willingly teach some old man all of that. He's giving her nothing to work with other than \"eager to please.\" It's one thing for someone to have a technique and I tell him things to tweak what he's doing to please me, specifically, better-- ie: stop sucking my clit so hard. Easy fix. But for this man to not even know where the clit is on top of everything else? That's too clueless for me to try to help.\n\nAnd even then, the way he so easily dismissed her telling him to stop groping her, he likely wouldn't even listen to her trying to teach his creepy self how to please her and perform better.",
                                    "author": "glittered437737",
                                    "id": "heg739s",
                                    "parent_id": "t1_heg0pv2",
                                    "score": 24,
                                    "created_utc": 1632730318.0,
                                    "replies": [
                                        {
                                            "body": "THANK YOU!",
                                            "author": "Throwawayevilperson",
                                            "id": "hegaed7",
                                            "parent_id": "t1_heg739s",
                                            "score": 11,
                                            "created_utc": 1632734056.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "Lol, for real?\nJust because she didn't want to suck his balls (but played with them instead) she 'declined a number of things'?\nAnd how do you know she didn't communicate. Were you there with them in the room?\n\nNah. Let's not blame her for the fact that he still doesn't know how to eat pussy after probably 30+ years of experience.",
                                    "author": "Neko333Kitsune",
                                    "id": "hegb3k4",
                                    "parent_id": "t1_heg0pv2",
                                    "score": 10,
                                    "created_utc": 1632734769.0,
                                    "replies": []
                                },
                                {
                                    "body": "yeah, but a 19 year old shouldn't have to educate a 53 year old on basic female anatomy or have to keep him from groping her uncomfortably at lunch.\n\nyes, this guy could mayyyyyyyyybe be educated into being a less bad lover, but does OP really want to take that project on?\n\nIMHO there are plenty of fish in the sea for her and this guy doesn't meet one of her requirements: basic non-sucking in bed. Many SDs have ended things with many SBs for less. Turnabout is fair play.\n\nThe one thing I will say is that I always try not to judge a partner just on the first time we are together - sometimes nerves etc get in the way - so it may be that if she bosses him around and tells him just what to do the second time could be better. But OP, it is also fine for you to end this now.",
                                    "author": null,
                                    "id": "heghjmu",
                                    "parent_id": "t1_heg0pv2",
                                    "score": 7,
                                    "created_utc": 1632740442.0,
                                    "replies": []
                                },
                                {
                                    "body": "Sounds like you’re trying to blame her for his dick not working, it wasn’t her it was him. He obviously had an issue physically that he needs to go take care of. This wasn’t her fault at all and she didn’t make his dick limp!",
                                    "author": "Fun4you72",
                                    "id": "hegbyct",
                                    "parent_id": "t1_heg0pv2",
                                    "score": 14,
                                    "created_utc": 1632735633.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Thats assuming younger guys have better d game.  I'd hazard a guess and say when it comes to giving oral they would be largely left in the dust tbh",
                    "author": "wb19081908",
                    "id": "heg6357",
                    "parent_id": "t1_hefy3v3",
                    "score": 1,
                    "created_utc": 1632729221.0,
                    "replies": []
                },
                {
                    "body": "100% but i have a feeling you’ll get downvoted lol.",
                    "author": null,
                    "id": "hegya6x",
                    "parent_id": "t1_hefy3v3",
                    "score": -1,
                    "created_utc": 1632750212.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Ooof I feel for you. This is so cringy. If I were in your position I would no doubt end it immediately. Even if the PPM is generous, can you really imagine doing that 5-10 more times? Let alone one more time? Sure you can have a conversation with him about it but it sounds pointless to me. Uses terms like “find your hole” and acting like he doesn’t know what viagra is, he seems immature. I find that to be extremely annoying and a turn off. That’s just my opinion.",
            "author": "lilgarage",
            "id": "hefyjn6",
            "parent_id": "t3_pwaq5p",
            "score": 12,
            "created_utc": 1632722959.0,
            "replies": [
                {
                    "body": "You’re right, sex should be enjoyable and I’ll probably end up dreading it",
                    "author": "Throwawayevilperson",
                    "id": "heg0i90",
                    "parent_id": "t1_hefyjn6",
                    "score": 4,
                    "created_utc": 1632724413.0,
                    "replies": [
                        {
                            "body": "I'm pretty sympathetic for him...but saying you dont know what viagra is...is just a bold-faced lie. And grabbing you after you say not to is very not cool. If it weren't for those two things I'd say try to teach him (I find it very rewarding to help someone find their confidence) but, no, not this time. No shame in a smaller penis though, our bodies are the way they are. I've had many a time I can't feel anything - do what feels good to them for a short while and then switch it up!",
                            "author": "music4galz",
                            "id": "hehd5t9",
                            "parent_id": "t1_heg0i90",
                            "score": 3,
                            "created_utc": 1632756740.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I’ve never cared about my SD sexual performance. If it bothers you to that extent, politely tell him y’all aren’t compatible.",
            "author": "CloudyRita",
            "id": "hefxqe4",
            "parent_id": "t3_pwaq5p",
            "score": 9,
            "created_utc": 1632722382.0,
            "replies": [
                {
                    "body": "I’m used to better sex from older men. So I think I’ll take your advice and end it",
                    "author": "Throwawayevilperson",
                    "id": "heg0flx",
                    "parent_id": "t1_hefxqe4",
                    "score": 6,
                    "created_utc": 1632724360.0,
                    "replies": []
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "hefyex7",
                    "parent_id": "t1_hefxqe4",
                    "score": 3,
                    "created_utc": 1632722865.0,
                    "replies": [
                        {
                            "body": "I don’t put much emphasis on the act itself. I haven’t been a SB in a long time but my first SD had a birth defect. He was born with a micro penis. He couldn’t physically perform. It kinda opened me up to understanding that sex isn’t really the reason for sugaring.",
                            "author": "CloudyRita",
                            "id": "hegbvp6",
                            "parent_id": "t1_hefyex7",
                            "score": 13,
                            "created_utc": 1632735559.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I honestly really appreciate this post. Had some experiences with a SD recently that I found extremely unattractive. We didn't even have penatrative sex but just touching him was so awkward and unpleasant. When you said it felt clinical... I felt that. I was waiting for it to be over. I usually love sex and want it all the time, I never thought I would be wincing and just hoping it would be done, especially him giving me oral sex. If anything it makes me appreciate good sex even more.",
            "author": "Mysterious_Fox_8616",
            "id": "hei8cgi",
            "parent_id": "t3_pwaq5p",
            "score": 3,
            "created_utc": 1632770789.0,
            "replies": []
        },
        {
            "body": "More men (and at younger ages) suffer from ED than you might think, not just 80-year-old gramps. It's not something men enjoy bringing up or discussing. Sometimes it's physical/hormonal, but sometimes mental/stress related. \n\nDid he stop grabbing you when you asked? If he did, then I'd suggest you see if maybe you can encourage him to improve. I mean, be blunt, and see if he responds. Or have him hire a sex therapist. Or both.\n\nIf he did not stop grabbing you after you asked, then I would dump him. That's basic boundary 101 that he should be capable of following.",
            "author": "emptyoverflow",
            "id": "heigckz",
            "parent_id": "t3_pwaq5p",
            "score": 3,
            "created_utc": 1632774408.0,
            "replies": [
                {
                    "body": "He did stop grabbing me when I asked",
                    "author": "Throwawayevilperson",
                    "id": "hekdjhm",
                    "parent_id": "t1_heigckz",
                    "score": 1,
                    "created_utc": 1632809728.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "So a lot of the time, guys get nervous the first time having sex and they can't keep it up. It's not personal, it's just that sometimes guys underestimate the amount of connection they need to have sex. If everything else is okay, he might be better at sex next time. Show him how you masturbate, teach him the \"come hither\" g-spot trick, and the one where you rub really fast back and forth over your clit.\n\nIf the spanking was too light, I guarantee he would love it if you asked for it harder. The way I teach people to spank me is like this. I tell them I like feeling pain a 7/10, and then when they spank me I tell them how hard it hurt, 1-10. And then they can learn what I like and how I like it.\n\nIf you can figure out which part of the fantasy he's getting off from (whether it's enjoying your physical appearance, your personality, the cheating fantasy, or simply wanting to please a beautiful woman) you can play up that part of the sex with dirty talk and encouragement. It's something to think about that's more fun than shallow fingers.",
            "author": "khaoticneutralzone",
            "id": "heiijs5",
            "parent_id": "t3_pwaq5p",
            "score": 3,
            "created_utc": 1632775392.0,
            "replies": []
        },
        {
            "body": "He could have been incredibly nervous too",
            "author": "GeneAsBob",
            "id": "hegp54o",
            "parent_id": "t3_pwaq5p",
            "score": 5,
            "created_utc": 1632745388.0,
            "replies": []
        },
        {
            "body": "At least you're getting paid well. But, yeah I don't think it would hurt to look into what else is out there while you're with him. I'd wait till you locked down something better before getting rid of him.😳",
            "author": "silverfeline",
            "id": "hegrc01",
            "parent_id": "t3_pwaq5p",
            "score": 3,
            "created_utc": 1632746641.0,
            "replies": []
        },
        {
            "body": "Well that's probably a big reason he wants to have a sb is that his job stresses him out and he can't get it up.\nWould probably be more enjoyable for him to be dommed imo.",
            "author": "Brittanythestrange",
            "id": "hehr5qn",
            "parent_id": "t3_pwaq5p",
            "score": 2,
            "created_utc": 1632763016.0,
            "replies": []
        },
        {
            "body": "Well he said he felt embarrassed, so he's not oblivious to his shortcomings. Up to you whether to tolerate him, but it's possible he'd do better if you gave him some guidance on what makes you feel good. If you're silently laughing at him or rolling your eyes, he will sense it eventually, and the relationship will be doomed. You could help him do better and put him at ease. It's understandable if you consider that too much effort, but it's worth considering if he has other qualities that you like (e.g., high PPM). Things **might** just get better on their own as he gets more comfortable, but I wouldn't count on that.",
            "author": "Finzi",
            "id": "heht7em",
            "parent_id": "t3_pwaq5p",
            "score": 2,
            "created_utc": 1632763904.0,
            "replies": []
        },
        {
            "body": "Sounds like he lacks confidence.  The issue isn't the small cock, but the overtexting, awkward comments, and apologies.  If you can't communicate confidently you won't be confident in bed, and sounds like he's got work to do.",
            "author": "SugarD9",
            "id": "hehvvy1",
            "parent_id": "t3_pwaq5p",
            "score": 2,
            "created_utc": 1632765115.0,
            "replies": []
        },
        {
            "body": "The money seems good and he doesn't seem like a threat. Why don't you try a session where you guide him on how to please you and if things don't improve then give him the boot?",
            "author": "dad_bod_cargo_shorts",
            "id": "heie90o",
            "parent_id": "t3_pwaq5p",
            "score": 2,
            "created_utc": 1632773460.0,
            "replies": []
        },
        {
            "body": "This is so cringe. Leave him. It’s not worth feeling gross about in the long run. A SR is only fun if you’re enjoying it as well. My last date went so bad he couldn’t even get hard. I blocked him. Don’t feel bad.",
            "author": "seductiveartist",
            "id": "hei5wto",
            "parent_id": "t3_pwaq5p",
            "score": 2,
            "created_utc": 1632769670.0,
            "replies": []
        },
        {
            "body": "OOF! Makes a girl want to give up sugaring.",
            "author": "GSSD",
            "id": "hegu4wt",
            "parent_id": "t3_pwaq5p",
            "score": 2,
            "created_utc": 1632748144.0,
            "replies": []
        },
        {
            "body": "I don’t have ED issues but a hand job in a condom might give me some. 😂😂😂. The whole thing sounds terrible from all sides.  Most older guys are going to need a decent BJ to get things started.  Not excusing his poor performance but it sounds like this goes both ways.  This won’t last long",
            "author": "LotBuilder",
            "id": "hei9ca0",
            "parent_id": "t3_pwaq5p",
            "score": 1,
            "created_utc": 1632771246.0,
            "replies": [
                {
                    "body": "Good for you!",
                    "author": "Throwawayevilperson",
                    "id": "heiajt0",
                    "parent_id": "t1_hei9ca0",
                    "score": 2,
                    "created_utc": 1632771796.0,
                    "replies": [
                        {
                            "body": "My advice is to find a SD you like and respect.  It’s much more fun and financially rewarding that way.",
                            "author": "LotBuilder",
                            "id": "heib7vj",
                            "parent_id": "t1_heiajt0",
                            "score": 2,
                            "created_utc": 1632772096.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "forget feeling, let the money flow.. you probably end up getting money for less efforts",
            "author": "Montypython2010",
            "id": "hehl8hj",
            "parent_id": "t3_pwaq5p",
            "score": 1,
            "created_utc": 1632760171.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "hegbjqq",
            "parent_id": "t3_pwaq5p",
            "score": 0,
            "created_utc": 1632735224.0,
            "replies": [
                {
                    "body": "I feel like he wouldn’t go for just platonic, honestly not many guys would. And I don’t think it’d be fair tbh. I wish he would’ve told me about the erectile dysfunction because I would have been more sensual (like touching and kissing) if I had known that there would be no penetrative sex",
                    "author": "Throwawayevilperson",
                    "id": "hegfak0",
                    "parent_id": "t1_hegbjqq",
                    "score": 8,
                    "created_utc": 1632738662.0,
                    "replies": [
                        {
                            "body": "No guy will tell you he has ED, they just won’t. Been there done that. Just find another SD. This guy sounds creepy to me. You are too young to be dealing with this kind of issue. Go and enjoy your life!",
                            "author": "Fun4you72",
                            "id": "hekbbw4",
                            "parent_id": "t1_hegfak0",
                            "score": 2,
                            "created_utc": 1632808125.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "lol no",
                    "author": "GeneAsBob",
                    "id": "hegp6dv",
                    "parent_id": "t1_hegbjqq",
                    "score": 0,
                    "created_utc": 1632745409.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "A hand job with a condom on ???  Haha ,   You seriously did that ??",
            "author": "shamloo77",
            "id": "heng256",
            "parent_id": "t3_pwaq5p",
            "score": 0,
            "created_utc": 1632867718.0,
            "replies": []
        },
        {
            "body": "Heartless group here. Total lack of compassion. The man has ED and everyone's reaction is to laugh and look down on the guy. You're all making a spectacle of an older man with a medical condition. \n\nIf the sex is such an issue for you, then encourage him to get treatment. If it's a deal-breaker, then stop the arrangement. You're young and are making light of the situation, which just reflects badly on you.",
            "author": null,
            "id": "hejbu3j",
            "parent_id": "t3_pwaq5p",
            "score": -1,
            "created_utc": 1632789288.0,
            "replies": [
                {
                    "body": "Regardless of how young she is, this is an embarrassing situation. I had this happen to me twice with two men and both were diabetic. The first one actually was super aggressive and I didn’t want to have sex with him, not because of his limp dick but because of his actions. Then afterwards he tried to blame me for his dick issue so yeh just no. You say she’s lacking compassion but when you are put in a situation like this it’s completely uncomfortable. Come on, men know when they have this issue and need to man up and go get viagra.\n\nNow for the second guy he was diabetic also, he was 43 yrs old and the other guy was 44. With this guy he was not at all rude and didn’t make me feel uncomfortable but he didn’t want to face the fact that his dick didn’t work. I met him on a SD site and he didn’t even offer to take me out or anything that a sugar daddy stands for. I told him that he may need to get viagra in a nice way without trying to hurt his feelings and he simply said he didn’t want to go to the Drs.\n\nMy question is why In the world would you wipe out a limp dick knowing it doesn’t work and basically embarrass yourself and disappoint the other person. Seems like a lack of compassion there and pretty selfish.\n\nNeedless to say I’m going younger and currently talking to a 30 yr old, no one has time for messy dick issues especially when men want to act like it isn’t an issue!! I call it phantom dick!!!",
                    "author": "Fun4you72",
                    "id": "hek6bbi",
                    "parent_id": "t1_hejbu3j",
                    "score": 2,
                    "created_utc": 1632804683.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Are you in Houston? Because if so, I think I know exactly who you’re talking about 👀😅",
            "author": "TX_SB",
            "id": "hei8cps",
            "parent_id": "t3_pwaq5p",
            "score": -1,
            "created_utc": 1632770792.0,
            "replies": [
                {
                    "body": "I’m in the UK. Somehow, I don’t think these types of guys are uncommon",
                    "author": "Throwawayevilperson",
                    "id": "heia632",
                    "parent_id": "t1_hei8cps",
                    "score": 3,
                    "created_utc": 1632771623.0,
                    "replies": [
                        {
                            "body": "You literally described a SD situation I had verbatim (physical and all). He lived in Houston. I was like wait a second . Yes sadly there’s many more men out there like this 😂😅",
                            "author": "TX_SB",
                            "id": "heigh6o",
                            "parent_id": "t1_heia632",
                            "score": 2,
                            "created_utc": 1632774465.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Me as a past SD have had the opposite problem.  So as crazy as it sounds it goes both ways. Lol",
            "author": "tim0690",
            "id": "hehvz6l",
            "parent_id": "t3_pwaq5p",
            "score": 1,
            "created_utc": 1632765156.0,
            "replies": []
        },
        {
            "body": "That is a hard one (sorry, unintentional pun) and I feel for you. I guess the question to ask (and I say this from an SD perspective, not an SB) is what is the motivation for you sugaring, better sex, or the $? I'm not saying it cannot be both. Sex at the level you are speaking of is not enjoyable, I completely get that. As a sensual dominant, it is a point of pride with me that any SB with me enjoys the experience far more than it is possible for me to, being a male and obviously with limited orgasm potential. Were I to give one such an experience, I would want to hide under a rock. I can say a few things based on your description, however. If indeed his does only have one testicle, and there is not obvious scarring(like in war or an accident), it is very possible he suffered from testicular cancer at some point in his life. I think you analysis that he might have ED is very correct. Some suggested corrective methods for it are the gainswave treatment, ED medications, or also testosterone supplementation(losing a testicle can effect testosterone), perhaps he might take advice from you on one of those. I suggest you tell him this, \"I am still willing to see you, but I want to give you instruction on what pleases a woman, and I want you to follow it. If you do, every woman you ever have in your life will thank me.\" If he responds in the negative, then you must accept that things are never going to change, and I'm sure there are more pleasing Daddies out there you could be with.",
            "author": "SDInLeather",
            "id": "heirjgj",
            "parent_id": "t3_pwaq5p",
            "score": 1,
            "created_utc": 1632779566.0,
            "replies": []
        },
        {
            "body": "Cringe cringe cringe. Run.",
            "author": "Suspicious_Load6908",
            "id": "hejerhe",
            "parent_id": "t3_pwaq5p",
            "score": 1,
            "created_utc": 1632790634.0,
            "replies": []
        },
        {
            "body": "sometimes the dollar signs get in the way and we females can forget to recognize and respect our own boundaries.. I’m sure sexual chemistry was one of your requirements in the relationship so it’s your right to have that. Do what feels right for your needs too!",
            "author": null,
            "id": "hejidii",
            "parent_id": "t3_pwaq5p",
            "score": 1,
            "created_utc": 1632792282.0,
            "replies": []
        },
        {
            "body": "Hahahah",
            "author": "BaileyBell2021",
            "id": "heg1ye1",
            "parent_id": "t1_hefx7jv",
            "score": 4,
            "created_utc": 1632725522.0,
            "replies": []
        },
        {
            "body": "I think I will, I feel that’s it’s also kinda mean to him to in a way.",
            "author": "Throwawayevilperson",
            "id": "heg0c7h",
            "parent_id": "t1_hefz3g7",
            "score": 12,
            "created_utc": 1632724291.0,
            "replies": [
                {
                    "body": "It’s better to end early rather than be uncomfortable.",
                    "author": "highjinx411",
                    "id": "hei0w2c",
                    "parent_id": "t1_heg0c7h",
                    "score": 11,
                    "created_utc": 1632767396.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Not simply pay, but also generously.",
            "author": "MyIncognitoMe",
            "id": "hegr6e5",
            "parent_id": "t1_hegic4g",
            "score": 20,
            "created_utc": 1632746555.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "hehfao3",
            "parent_id": "t1_heh2tfu",
            "score": 5,
            "created_utc": 1632757632.0,
            "replies": [
                {
                    "body": "Just look at it as like a pet project lol. You’ll lose nothing and you can probably help this guy even if you don’t stick around for the long term. Always leave people better. 💜",
                    "author": null,
                    "id": "hehld5t",
                    "parent_id": "t1_hehfao3",
                    "score": 6,
                    "created_utc": 1632760232.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Well said",
            "author": "luckyladyjade",
            "id": "hehr6we",
            "parent_id": "t1_heg8839",
            "score": 1,
            "created_utc": 1632763030.0,
            "replies": []
        },
        {
            "body": "Yes! This exactly. OP you can tell him in a \"strengths based\" way. Make it fun and sexy. People often forget that basic dirty talk is pretty much just instructions with a lot of gasping and moaning. \"Do it like that! I want your tongue on my clit. Yes! Lower, nearly there. Up, please oh just up a little! Yes. Lick it like \\[appropriate metaphor\\]. Kiss it with your lips. Suck on it. Eep! Not so hard there, Tiger. Ohhhh yeah like that.\"\n\nu/robhudsondfw I hope that you've seen a doctor about the ED. ;) The symptoms you're mentioning make me think that there might be a blood pressure/blood sugar problem. Early onset ED (40 is very young) with numbness in the penis can commonly come from heart disease or diabetes/pre-diabetes.",
            "author": "NerdMagpie",
            "id": "heilx8z",
            "parent_id": "t1_hehd5yx",
            "score": 7,
            "created_utc": 1632776907.0,
            "replies": [
                {
                    "body": "It is very possible that it is related to blood sugar.  I do have blood sugar issues.  Eep!  \n\nI would just love to be able to enjoy sex with a condom.  I would have so much more sex!",
                    "author": "robhudsondfw",
                    "id": "heimb0m",
                    "parent_id": "t1_heilx8z",
                    "score": 3,
                    "created_utc": 1632777083.0,
                    "replies": []
                },
                {
                    "body": "💯 \nWhat a wonderful outlook you have!  I love getting feedback from a woman, and they love how well I follow it!\n\nHuman beings do not come from cookie cutters. What one person loves another will find, “Meh.”",
                    "author": "Chill_SD1974",
                    "id": "hemex91",
                    "parent_id": "t1_heilx8z",
                    "score": 2,
                    "created_utc": 1632851820.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "100%",
            "author": "tim0690",
            "id": "hehvtz3",
            "parent_id": "t1_hehd5yx",
            "score": 3,
            "created_utc": 1632765091.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "hehc2p3",
            "parent_id": "t1_hehbm4o",
            "score": 4,
            "created_utc": 1632756280.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "hefycx6",
            "parent_id": "t1_hefwco8",
            "score": 67,
            "created_utc": 1632722825.0,
            "replies": [
                {
                    "body": "This made me giggle",
                    "author": "Throwawayevilperson",
                    "id": "heg0jz6",
                    "parent_id": "t1_hefycx6",
                    "score": 18,
                    "created_utc": 1632724448.0,
                    "replies": []
                },
                {
                    "body": "Uniball. Omg that gave me a good chuckle.",
                    "author": "rachella32",
                    "id": "hegq2tz",
                    "parent_id": "t1_hefycx6",
                    "score": 5,
                    "created_utc": 1632745938.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Is never “easy money” - fast money, maybe. But not “easy”",
            "author": "thereadinessisall",
            "id": "hefyzeq",
            "parent_id": "t1_hefwco8",
            "score": 33,
            "created_utc": 1632723280.0,
            "replies": []
        },
        {
            "body": "Honestly it’s not very easy. I feel bad but I’m also not very good at faking it. I’ve always felt at least some modicum of attraction to my previous SDs (2) 😭",
            "author": "Throwawayevilperson",
            "id": "hefwhwj",
            "parent_id": "t1_hefwco8",
            "score": 17,
            "created_utc": 1632721479.0,
            "replies": [
                {
                    "body": "Tell him sugaring is not for you and move on from him. Not worth the mental anguish.",
                    "author": null,
                    "id": "hefx6yj",
                    "parent_id": "t1_hefwhwj",
                    "score": 15,
                    "created_utc": 1632721991.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Thanks for the perspective. I wouldn’t consider going back to platonic, it isn’t viable nor fair and as you’ve said, I don’t think he needs a friend-for-hire.",
            "author": "Throwawayevilperson",
            "id": "hehf4l1",
            "parent_id": "t1_heh7vp2",
            "score": 5,
            "created_utc": 1632757561.0,
            "replies": []
        },
        {
            "body": "If he doesn't know what a clit is or where it's located at 50, can you imagine how clueless he was in his 30s?\n\nOP sounds like he might benefit from some videos on how to go down on a woman. He needs some guidance, so maybe you should decide whether you want to take that on. Understandable if, at 19, you'd rather have a lover who knows what he's doing.",
            "author": "ChapterRelative",
            "id": "heg03kl",
            "parent_id": "t1_hefy3v3",
            "score": 13,
            "created_utc": 1632724112.0,
            "replies": [
                {
                    "body": "It honestly seemed like he already had his ‘technique’. Maybe I’ll try to show him but idk how to without seeming rude. I think I’ll end it",
                    "author": "Throwawayevilperson",
                    "id": "heg0rai",
                    "parent_id": "t1_heg03kl",
                    "score": 10,
                    "created_utc": 1632724598.0,
                    "replies": [
                        {
                            "body": "It’s not rude.\n\n“This is what I enjoy”\n\nI had a girl that wanted more clit play during oral. After a few months she just said “move up more” and I comprehended easily.",
                            "author": "farlack",
                            "id": "hehhqf7",
                            "parent_id": "t1_heg0rai",
                            "score": 3,
                            "created_utc": 1632758654.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "My previous SDS were around the same age and were good at sex, I think he just isn’t good at it maybe? Idk",
            "author": "Throwawayevilperson",
            "id": "hefyf4c",
            "parent_id": "t1_hefy3v3",
            "score": 12,
            "created_utc": 1632722869.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "heg0pv2",
                    "parent_id": "t1_hefyf4c",
                    "score": -7,
                    "created_utc": 1632724568.0,
                    "replies": [
                        {
                            "body": "We discussed our likes before we were intimate & I communicated throughout the ‘sex’. I showed him where my clit was, he just didn’t get it. The only things I declined were the public groping & sucking his balls. I’m sorry but I wasn’t comfortable putting them in my mouth 😭",
                            "author": "Throwawayevilperson",
                            "id": "heg17a6",
                            "parent_id": "t1_heg0pv2",
                            "score": 17,
                            "created_utc": 1632724931.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "hegdmmf",
                                    "parent_id": "t1_heg17a6",
                                    "score": 9,
                                    "created_utc": 1632737236.0,
                                    "replies": [
                                        {
                                            "body": "😭😭😭😭",
                                            "author": "Throwawayevilperson",
                                            "id": "hegfbsa",
                                            "parent_id": "t1_hegdmmf",
                                            "score": 7,
                                            "created_utc": 1632738691.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Being weirdly groped and then dismissed when told to stop and asked to suck this man's balls...? NO! Even if those things were a \"let down\" he had more than enough reason to still be happy and turned on-- the simple fact that he's in bed with a hot 19 year old woman who is way out of his league is a damn good reason to be happy. (Not saying that alone is the end all be all.) But yeah, let's blame OP for his shitty performance and behavior! 🤣🙄😒\n\nCan't kiss.\nDoesn't know how to eat pussy or where the clit resides.\nCan't get and stay hard.\nCan't find her \"hole\"????????\n\nHe needs more than communication.\nHe sounds like he needs a damn miracle.\n\nNow, I don't disagree that communication is an essential part of good sex. I've been having sex long enough that I know this is very true. \n\nHowever, for OP.... No. Just NO. Ain't no way at 19, was I gonna willingly teach some old man all of that. He's giving her nothing to work with other than \"eager to please.\" It's one thing for someone to have a technique and I tell him things to tweak what he's doing to please me, specifically, better-- ie: stop sucking my clit so hard. Easy fix. But for this man to not even know where the clit is on top of everything else? That's too clueless for me to try to help.\n\nAnd even then, the way he so easily dismissed her telling him to stop groping her, he likely wouldn't even listen to her trying to teach his creepy self how to please her and perform better.",
                            "author": "glittered437737",
                            "id": "heg739s",
                            "parent_id": "t1_heg0pv2",
                            "score": 24,
                            "created_utc": 1632730318.0,
                            "replies": [
                                {
                                    "body": "THANK YOU!",
                                    "author": "Throwawayevilperson",
                                    "id": "hegaed7",
                                    "parent_id": "t1_heg739s",
                                    "score": 11,
                                    "created_utc": 1632734056.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Lol, for real?\nJust because she didn't want to suck his balls (but played with them instead) she 'declined a number of things'?\nAnd how do you know she didn't communicate. Were you there with them in the room?\n\nNah. Let's not blame her for the fact that he still doesn't know how to eat pussy after probably 30+ years of experience.",
                            "author": "Neko333Kitsune",
                            "id": "hegb3k4",
                            "parent_id": "t1_heg0pv2",
                            "score": 10,
                            "created_utc": 1632734769.0,
                            "replies": []
                        },
                        {
                            "body": "yeah, but a 19 year old shouldn't have to educate a 53 year old on basic female anatomy or have to keep him from groping her uncomfortably at lunch.\n\nyes, this guy could mayyyyyyyyybe be educated into being a less bad lover, but does OP really want to take that project on?\n\nIMHO there are plenty of fish in the sea for her and this guy doesn't meet one of her requirements: basic non-sucking in bed. Many SDs have ended things with many SBs for less. Turnabout is fair play.\n\nThe one thing I will say is that I always try not to judge a partner just on the first time we are together - sometimes nerves etc get in the way - so it may be that if she bosses him around and tells him just what to do the second time could be better. But OP, it is also fine for you to end this now.",
                            "author": null,
                            "id": "heghjmu",
                            "parent_id": "t1_heg0pv2",
                            "score": 7,
                            "created_utc": 1632740442.0,
                            "replies": []
                        },
                        {
                            "body": "Sounds like you’re trying to blame her for his dick not working, it wasn’t her it was him. He obviously had an issue physically that he needs to go take care of. This wasn’t her fault at all and she didn’t make his dick limp!",
                            "author": "Fun4you72",
                            "id": "hegbyct",
                            "parent_id": "t1_heg0pv2",
                            "score": 14,
                            "created_utc": 1632735633.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Thats assuming younger guys have better d game.  I'd hazard a guess and say when it comes to giving oral they would be largely left in the dust tbh",
            "author": "wb19081908",
            "id": "heg6357",
            "parent_id": "t1_hefy3v3",
            "score": 1,
            "created_utc": 1632729221.0,
            "replies": []
        },
        {
            "body": "100% but i have a feeling you’ll get downvoted lol.",
            "author": null,
            "id": "hegya6x",
            "parent_id": "t1_hefy3v3",
            "score": -1,
            "created_utc": 1632750212.0,
            "replies": []
        },
        {
            "body": "You’re right, sex should be enjoyable and I’ll probably end up dreading it",
            "author": "Throwawayevilperson",
            "id": "heg0i90",
            "parent_id": "t1_hefyjn6",
            "score": 4,
            "created_utc": 1632724413.0,
            "replies": [
                {
                    "body": "I'm pretty sympathetic for him...but saying you dont know what viagra is...is just a bold-faced lie. And grabbing you after you say not to is very not cool. If it weren't for those two things I'd say try to teach him (I find it very rewarding to help someone find their confidence) but, no, not this time. No shame in a smaller penis though, our bodies are the way they are. I've had many a time I can't feel anything - do what feels good to them for a short while and then switch it up!",
                    "author": "music4galz",
                    "id": "hehd5t9",
                    "parent_id": "t1_heg0i90",
                    "score": 3,
                    "created_utc": 1632756740.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I’m used to better sex from older men. So I think I’ll take your advice and end it",
            "author": "Throwawayevilperson",
            "id": "heg0flx",
            "parent_id": "t1_hefxqe4",
            "score": 6,
            "created_utc": 1632724360.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "hefyex7",
            "parent_id": "t1_hefxqe4",
            "score": 3,
            "created_utc": 1632722865.0,
            "replies": [
                {
                    "body": "I don’t put much emphasis on the act itself. I haven’t been a SB in a long time but my first SD had a birth defect. He was born with a micro penis. He couldn’t physically perform. It kinda opened me up to understanding that sex isn’t really the reason for sugaring.",
                    "author": "CloudyRita",
                    "id": "hegbvp6",
                    "parent_id": "t1_hefyex7",
                    "score": 13,
                    "created_utc": 1632735559.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "He did stop grabbing me when I asked",
            "author": "Throwawayevilperson",
            "id": "hekdjhm",
            "parent_id": "t1_heigckz",
            "score": 1,
            "created_utc": 1632809728.0,
            "replies": []
        },
        {
            "body": "Good for you!",
            "author": "Throwawayevilperson",
            "id": "heiajt0",
            "parent_id": "t1_hei9ca0",
            "score": 2,
            "created_utc": 1632771796.0,
            "replies": [
                {
                    "body": "My advice is to find a SD you like and respect.  It’s much more fun and financially rewarding that way.",
                    "author": "LotBuilder",
                    "id": "heib7vj",
                    "parent_id": "t1_heiajt0",
                    "score": 2,
                    "created_utc": 1632772096.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I feel like he wouldn’t go for just platonic, honestly not many guys would. And I don’t think it’d be fair tbh. I wish he would’ve told me about the erectile dysfunction because I would have been more sensual (like touching and kissing) if I had known that there would be no penetrative sex",
            "author": "Throwawayevilperson",
            "id": "hegfak0",
            "parent_id": "t1_hegbjqq",
            "score": 8,
            "created_utc": 1632738662.0,
            "replies": [
                {
                    "body": "No guy will tell you he has ED, they just won’t. Been there done that. Just find another SD. This guy sounds creepy to me. You are too young to be dealing with this kind of issue. Go and enjoy your life!",
                    "author": "Fun4you72",
                    "id": "hekbbw4",
                    "parent_id": "t1_hegfak0",
                    "score": 2,
                    "created_utc": 1632808125.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "lol no",
            "author": "GeneAsBob",
            "id": "hegp6dv",
            "parent_id": "t1_hegbjqq",
            "score": 0,
            "created_utc": 1632745409.0,
            "replies": []
        },
        {
            "body": "Regardless of how young she is, this is an embarrassing situation. I had this happen to me twice with two men and both were diabetic. The first one actually was super aggressive and I didn’t want to have sex with him, not because of his limp dick but because of his actions. Then afterwards he tried to blame me for his dick issue so yeh just no. You say she’s lacking compassion but when you are put in a situation like this it’s completely uncomfortable. Come on, men know when they have this issue and need to man up and go get viagra.\n\nNow for the second guy he was diabetic also, he was 43 yrs old and the other guy was 44. With this guy he was not at all rude and didn’t make me feel uncomfortable but he didn’t want to face the fact that his dick didn’t work. I met him on a SD site and he didn’t even offer to take me out or anything that a sugar daddy stands for. I told him that he may need to get viagra in a nice way without trying to hurt his feelings and he simply said he didn’t want to go to the Drs.\n\nMy question is why In the world would you wipe out a limp dick knowing it doesn’t work and basically embarrass yourself and disappoint the other person. Seems like a lack of compassion there and pretty selfish.\n\nNeedless to say I’m going younger and currently talking to a 30 yr old, no one has time for messy dick issues especially when men want to act like it isn’t an issue!! I call it phantom dick!!!",
            "author": "Fun4you72",
            "id": "hek6bbi",
            "parent_id": "t1_hejbu3j",
            "score": 2,
            "created_utc": 1632804683.0,
            "replies": []
        },
        {
            "body": "I’m in the UK. Somehow, I don’t think these types of guys are uncommon",
            "author": "Throwawayevilperson",
            "id": "heia632",
            "parent_id": "t1_hei8cps",
            "score": 3,
            "created_utc": 1632771623.0,
            "replies": [
                {
                    "body": "You literally described a SD situation I had verbatim (physical and all). He lived in Houston. I was like wait a second . Yes sadly there’s many more men out there like this 😂😅",
                    "author": "TX_SB",
                    "id": "heigh6o",
                    "parent_id": "t1_heia632",
                    "score": 2,
                    "created_utc": 1632774465.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "It’s better to end early rather than be uncomfortable.",
            "author": "highjinx411",
            "id": "hei0w2c",
            "parent_id": "t1_heg0c7h",
            "score": 11,
            "created_utc": 1632767396.0,
            "replies": []
        },
        {
            "body": "Just look at it as like a pet project lol. You’ll lose nothing and you can probably help this guy even if you don’t stick around for the long term. Always leave people better. 💜",
            "author": null,
            "id": "hehld5t",
            "parent_id": "t1_hehfao3",
            "score": 6,
            "created_utc": 1632760232.0,
            "replies": []
        },
        {
            "body": "It is very possible that it is related to blood sugar.  I do have blood sugar issues.  Eep!  \n\nI would just love to be able to enjoy sex with a condom.  I would have so much more sex!",
            "author": "robhudsondfw",
            "id": "heimb0m",
            "parent_id": "t1_heilx8z",
            "score": 3,
            "created_utc": 1632777083.0,
            "replies": []
        },
        {
            "body": "💯 \nWhat a wonderful outlook you have!  I love getting feedback from a woman, and they love how well I follow it!\n\nHuman beings do not come from cookie cutters. What one person loves another will find, “Meh.”",
            "author": "Chill_SD1974",
            "id": "hemex91",
            "parent_id": "t1_heilx8z",
            "score": 2,
            "created_utc": 1632851820.0,
            "replies": []
        },
        {
            "body": "This made me giggle",
            "author": "Throwawayevilperson",
            "id": "heg0jz6",
            "parent_id": "t1_hefycx6",
            "score": 18,
            "created_utc": 1632724448.0,
            "replies": []
        },
        {
            "body": "Uniball. Omg that gave me a good chuckle.",
            "author": "rachella32",
            "id": "hegq2tz",
            "parent_id": "t1_hefycx6",
            "score": 5,
            "created_utc": 1632745938.0,
            "replies": []
        },
        {
            "body": "Tell him sugaring is not for you and move on from him. Not worth the mental anguish.",
            "author": null,
            "id": "hefx6yj",
            "parent_id": "t1_hefwhwj",
            "score": 15,
            "created_utc": 1632721991.0,
            "replies": []
        },
        {
            "body": "It honestly seemed like he already had his ‘technique’. Maybe I’ll try to show him but idk how to without seeming rude. I think I’ll end it",
            "author": "Throwawayevilperson",
            "id": "heg0rai",
            "parent_id": "t1_heg03kl",
            "score": 10,
            "created_utc": 1632724598.0,
            "replies": [
                {
                    "body": "It’s not rude.\n\n“This is what I enjoy”\n\nI had a girl that wanted more clit play during oral. After a few months she just said “move up more” and I comprehended easily.",
                    "author": "farlack",
                    "id": "hehhqf7",
                    "parent_id": "t1_heg0rai",
                    "score": 3,
                    "created_utc": 1632758654.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "heg0pv2",
            "parent_id": "t1_hefyf4c",
            "score": -7,
            "created_utc": 1632724568.0,
            "replies": [
                {
                    "body": "We discussed our likes before we were intimate & I communicated throughout the ‘sex’. I showed him where my clit was, he just didn’t get it. The only things I declined were the public groping & sucking his balls. I’m sorry but I wasn’t comfortable putting them in my mouth 😭",
                    "author": "Throwawayevilperson",
                    "id": "heg17a6",
                    "parent_id": "t1_heg0pv2",
                    "score": 17,
                    "created_utc": 1632724931.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "hegdmmf",
                            "parent_id": "t1_heg17a6",
                            "score": 9,
                            "created_utc": 1632737236.0,
                            "replies": [
                                {
                                    "body": "😭😭😭😭",
                                    "author": "Throwawayevilperson",
                                    "id": "hegfbsa",
                                    "parent_id": "t1_hegdmmf",
                                    "score": 7,
                                    "created_utc": 1632738691.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Being weirdly groped and then dismissed when told to stop and asked to suck this man's balls...? NO! Even if those things were a \"let down\" he had more than enough reason to still be happy and turned on-- the simple fact that he's in bed with a hot 19 year old woman who is way out of his league is a damn good reason to be happy. (Not saying that alone is the end all be all.) But yeah, let's blame OP for his shitty performance and behavior! 🤣🙄😒\n\nCan't kiss.\nDoesn't know how to eat pussy or where the clit resides.\nCan't get and stay hard.\nCan't find her \"hole\"????????\n\nHe needs more than communication.\nHe sounds like he needs a damn miracle.\n\nNow, I don't disagree that communication is an essential part of good sex. I've been having sex long enough that I know this is very true. \n\nHowever, for OP.... No. Just NO. Ain't no way at 19, was I gonna willingly teach some old man all of that. He's giving her nothing to work with other than \"eager to please.\" It's one thing for someone to have a technique and I tell him things to tweak what he's doing to please me, specifically, better-- ie: stop sucking my clit so hard. Easy fix. But for this man to not even know where the clit is on top of everything else? That's too clueless for me to try to help.\n\nAnd even then, the way he so easily dismissed her telling him to stop groping her, he likely wouldn't even listen to her trying to teach his creepy self how to please her and perform better.",
                    "author": "glittered437737",
                    "id": "heg739s",
                    "parent_id": "t1_heg0pv2",
                    "score": 24,
                    "created_utc": 1632730318.0,
                    "replies": [
                        {
                            "body": "THANK YOU!",
                            "author": "Throwawayevilperson",
                            "id": "hegaed7",
                            "parent_id": "t1_heg739s",
                            "score": 11,
                            "created_utc": 1632734056.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Lol, for real?\nJust because she didn't want to suck his balls (but played with them instead) she 'declined a number of things'?\nAnd how do you know she didn't communicate. Were you there with them in the room?\n\nNah. Let's not blame her for the fact that he still doesn't know how to eat pussy after probably 30+ years of experience.",
                    "author": "Neko333Kitsune",
                    "id": "hegb3k4",
                    "parent_id": "t1_heg0pv2",
                    "score": 10,
                    "created_utc": 1632734769.0,
                    "replies": []
                },
                {
                    "body": "yeah, but a 19 year old shouldn't have to educate a 53 year old on basic female anatomy or have to keep him from groping her uncomfortably at lunch.\n\nyes, this guy could mayyyyyyyyybe be educated into being a less bad lover, but does OP really want to take that project on?\n\nIMHO there are plenty of fish in the sea for her and this guy doesn't meet one of her requirements: basic non-sucking in bed. Many SDs have ended things with many SBs for less. Turnabout is fair play.\n\nThe one thing I will say is that I always try not to judge a partner just on the first time we are together - sometimes nerves etc get in the way - so it may be that if she bosses him around and tells him just what to do the second time could be better. But OP, it is also fine for you to end this now.",
                    "author": null,
                    "id": "heghjmu",
                    "parent_id": "t1_heg0pv2",
                    "score": 7,
                    "created_utc": 1632740442.0,
                    "replies": []
                },
                {
                    "body": "Sounds like you’re trying to blame her for his dick not working, it wasn’t her it was him. He obviously had an issue physically that he needs to go take care of. This wasn’t her fault at all and she didn’t make his dick limp!",
                    "author": "Fun4you72",
                    "id": "hegbyct",
                    "parent_id": "t1_heg0pv2",
                    "score": 14,
                    "created_utc": 1632735633.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I'm pretty sympathetic for him...but saying you dont know what viagra is...is just a bold-faced lie. And grabbing you after you say not to is very not cool. If it weren't for those two things I'd say try to teach him (I find it very rewarding to help someone find their confidence) but, no, not this time. No shame in a smaller penis though, our bodies are the way they are. I've had many a time I can't feel anything - do what feels good to them for a short while and then switch it up!",
            "author": "music4galz",
            "id": "hehd5t9",
            "parent_id": "t1_heg0i90",
            "score": 3,
            "created_utc": 1632756740.0,
            "replies": []
        },
        {
            "body": "I don’t put much emphasis on the act itself. I haven’t been a SB in a long time but my first SD had a birth defect. He was born with a micro penis. He couldn’t physically perform. It kinda opened me up to understanding that sex isn’t really the reason for sugaring.",
            "author": "CloudyRita",
            "id": "hegbvp6",
            "parent_id": "t1_hefyex7",
            "score": 13,
            "created_utc": 1632735559.0,
            "replies": []
        },
        {
            "body": "My advice is to find a SD you like and respect.  It’s much more fun and financially rewarding that way.",
            "author": "LotBuilder",
            "id": "heib7vj",
            "parent_id": "t1_heiajt0",
            "score": 2,
            "created_utc": 1632772096.0,
            "replies": []
        },
        {
            "body": "No guy will tell you he has ED, they just won’t. Been there done that. Just find another SD. This guy sounds creepy to me. You are too young to be dealing with this kind of issue. Go and enjoy your life!",
            "author": "Fun4you72",
            "id": "hekbbw4",
            "parent_id": "t1_hegfak0",
            "score": 2,
            "created_utc": 1632808125.0,
            "replies": []
        },
        {
            "body": "You literally described a SD situation I had verbatim (physical and all). He lived in Houston. I was like wait a second . Yes sadly there’s many more men out there like this 😂😅",
            "author": "TX_SB",
            "id": "heigh6o",
            "parent_id": "t1_heia632",
            "score": 2,
            "created_utc": 1632774465.0,
            "replies": []
        },
        {
            "body": "It’s not rude.\n\n“This is what I enjoy”\n\nI had a girl that wanted more clit play during oral. After a few months she just said “move up more” and I comprehended easily.",
            "author": "farlack",
            "id": "hehhqf7",
            "parent_id": "t1_heg0rai",
            "score": 3,
            "created_utc": 1632758654.0,
            "replies": []
        },
        {
            "body": "We discussed our likes before we were intimate & I communicated throughout the ‘sex’. I showed him where my clit was, he just didn’t get it. The only things I declined were the public groping & sucking his balls. I’m sorry but I wasn’t comfortable putting them in my mouth 😭",
            "author": "Throwawayevilperson",
            "id": "heg17a6",
            "parent_id": "t1_heg0pv2",
            "score": 17,
            "created_utc": 1632724931.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "hegdmmf",
                    "parent_id": "t1_heg17a6",
                    "score": 9,
                    "created_utc": 1632737236.0,
                    "replies": [
                        {
                            "body": "😭😭😭😭",
                            "author": "Throwawayevilperson",
                            "id": "hegfbsa",
                            "parent_id": "t1_hegdmmf",
                            "score": 7,
                            "created_utc": 1632738691.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Being weirdly groped and then dismissed when told to stop and asked to suck this man's balls...? NO! Even if those things were a \"let down\" he had more than enough reason to still be happy and turned on-- the simple fact that he's in bed with a hot 19 year old woman who is way out of his league is a damn good reason to be happy. (Not saying that alone is the end all be all.) But yeah, let's blame OP for his shitty performance and behavior! 🤣🙄😒\n\nCan't kiss.\nDoesn't know how to eat pussy or where the clit resides.\nCan't get and stay hard.\nCan't find her \"hole\"????????\n\nHe needs more than communication.\nHe sounds like he needs a damn miracle.\n\nNow, I don't disagree that communication is an essential part of good sex. I've been having sex long enough that I know this is very true. \n\nHowever, for OP.... No. Just NO. Ain't no way at 19, was I gonna willingly teach some old man all of that. He's giving her nothing to work with other than \"eager to please.\" It's one thing for someone to have a technique and I tell him things to tweak what he's doing to please me, specifically, better-- ie: stop sucking my clit so hard. Easy fix. But for this man to not even know where the clit is on top of everything else? That's too clueless for me to try to help.\n\nAnd even then, the way he so easily dismissed her telling him to stop groping her, he likely wouldn't even listen to her trying to teach his creepy self how to please her and perform better.",
            "author": "glittered437737",
            "id": "heg739s",
            "parent_id": "t1_heg0pv2",
            "score": 24,
            "created_utc": 1632730318.0,
            "replies": [
                {
                    "body": "THANK YOU!",
                    "author": "Throwawayevilperson",
                    "id": "hegaed7",
                    "parent_id": "t1_heg739s",
                    "score": 11,
                    "created_utc": 1632734056.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Lol, for real?\nJust because she didn't want to suck his balls (but played with them instead) she 'declined a number of things'?\nAnd how do you know she didn't communicate. Were you there with them in the room?\n\nNah. Let's not blame her for the fact that he still doesn't know how to eat pussy after probably 30+ years of experience.",
            "author": "Neko333Kitsune",
            "id": "hegb3k4",
            "parent_id": "t1_heg0pv2",
            "score": 10,
            "created_utc": 1632734769.0,
            "replies": []
        },
        {
            "body": "yeah, but a 19 year old shouldn't have to educate a 53 year old on basic female anatomy or have to keep him from groping her uncomfortably at lunch.\n\nyes, this guy could mayyyyyyyyybe be educated into being a less bad lover, but does OP really want to take that project on?\n\nIMHO there are plenty of fish in the sea for her and this guy doesn't meet one of her requirements: basic non-sucking in bed. Many SDs have ended things with many SBs for less. Turnabout is fair play.\n\nThe one thing I will say is that I always try not to judge a partner just on the first time we are together - sometimes nerves etc get in the way - so it may be that if she bosses him around and tells him just what to do the second time could be better. But OP, it is also fine for you to end this now.",
            "author": null,
            "id": "heghjmu",
            "parent_id": "t1_heg0pv2",
            "score": 7,
            "created_utc": 1632740442.0,
            "replies": []
        },
        {
            "body": "Sounds like you’re trying to blame her for his dick not working, it wasn’t her it was him. He obviously had an issue physically that he needs to go take care of. This wasn’t her fault at all and she didn’t make his dick limp!",
            "author": "Fun4you72",
            "id": "hegbyct",
            "parent_id": "t1_heg0pv2",
            "score": 14,
            "created_utc": 1632735633.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "hegdmmf",
            "parent_id": "t1_heg17a6",
            "score": 9,
            "created_utc": 1632737236.0,
            "replies": [
                {
                    "body": "😭😭😭😭",
                    "author": "Throwawayevilperson",
                    "id": "hegfbsa",
                    "parent_id": "t1_hegdmmf",
                    "score": 7,
                    "created_utc": 1632738691.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "THANK YOU!",
            "author": "Throwawayevilperson",
            "id": "hegaed7",
            "parent_id": "t1_heg739s",
            "score": 11,
            "created_utc": 1632734056.0,
            "replies": []
        },
        {
            "body": "😭😭😭😭",
            "author": "Throwawayevilperson",
            "id": "hegfbsa",
            "parent_id": "t1_hegdmmf",
            "score": 7,
            "created_utc": 1632738691.0,
            "replies": []
        }
    ]
}