{
    "title": "SB turned wife",
    "post_id": "wk7kkl",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/wk7kkl/sb_turned_wife/",
    "author": "Snoo_72748",
    "body": "I’ve been a lurker for awhile now and I have seen some of the same posts so I thought I would share. I was a SB in 2019 for a couple of months before I met my last SD /future husband. I had been on seeking for a little while but honestly more salt daddies than sugar. I was given some advice to move to tinder so I thought hey couldn’t hurt. Now this is where it begins to start to sound fake even to me. \nI met him on the first day on the site, set up a meeting a week later because he wasn’t from my state. We texted non stop, he sent me an incentive to make sure I showed up later on I found out. Never asked for anything. \n\nFast forward a week later we have our first M&G at Manny’s steakhouse in Minneapolis. If your familiar with the area it is literally the most expensive restaurant in town. It was honestly magical. We talked non stop no awkwardness. Then comes dessert. We are both football fans and the Seahawks just happen to be playing the Vikings. He used that as an excuse to get me to come up after to watch the game. I broke so many of my rules that night because he just felt safe. I stayed the night at the hotel with him.\nNext morning I had to rush to make it to my clinical a at a nearby hospital. He walks me down to the lobby at like 5am does the walk of shame with me. Thought I’ll never see him again. Too good to be true right? \nI get a morning text a little while later and asked if he could bring by the wine/ gift he picked up from Nordstrom before he left for his flight? Here I go again breaking rules of mine and letting him come to my clinical location. We sat and had an amazing lunch. Thought this is it. \n\n Fast forward to 3 years later. During the pandemic we traveled the country together for his work, literally spent all of the pandemic together, countless amazing trips, shopping trips ( I have a thing for LV and red bottoms) now we have a son (his first son), getting married in October on the day this journey started in the Maldives ( we waited because I was pregnant and no wants to get married fat and pregnant lol) building a multi millionaire dollar home on the west coast in a beautiful diverse progressive city. \n\n I wanted to share to tell all my fellow SB’s you can literally have it all. Just takes the one. Oh and did I forget to mention I’m black in my 20’s and he’s a white man in his 50’s. I see on here all the time women being told a certain man isn’t interested in them. That’s so not true. Just go for it. We can both say we’ve never been happier. He is my best friend in the world.",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/wk7kkl/sb_turned_wife/",
    "score": 266,
    "upvote_ratio": 0.95,
    "created_utc": 1660062085.0,
    "num_comments": 71,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "This is an amazing story!  I fell hard for one of my SB’s and actually wanted to marry her.  This demonstrates that it is possible.  Congrats on this fantastic journey and wishing you continued blessings.",
            "author": "PracticePositive69",
            "id": "ijlnx6o",
            "parent_id": "t3_wk7kkl",
            "score": 48,
            "created_utc": 1660064037.0,
            "replies": [
                {
                    "body": "Thank you!! It was unbelievable for both of us. Then it was the telling friends/family (I lost my best friend form childhood over it). I took a big leap. Moved across the country after finishing my degree I worked so hard for. I’m now a SAHM but I’ve never been happier. Currently waiting to go pick him up from the airport. I still get giddy when he comes back from work trips 🥰 I tell everyone go for love when it come unexpected you never know where it will lead you.",
                    "author": "Snoo_72748",
                    "id": "ijlq5zp",
                    "parent_id": "t1_ijlnx6o",
                    "score": 21,
                    "created_utc": 1660064865.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "This is refreshing to hear!  Especially with all the bullshit I’ve read lately that SBs should settle because SD are penny pinching.  Never!  Always reach for the stars!  This is your moment to shine but I’m also in a unique situation that is unbelievable to many.  Not quite as fabulous as your life, though!  Happy for you!!!",
            "author": "morphine-me",
            "id": "ijmpql2",
            "parent_id": "t3_wk7kkl",
            "score": 22,
            "created_utc": 1660078268.0,
            "replies": [
                {
                    "body": "I definitely ran into those penny pinchers or try to change the relationship vanilla without any actually relationship changing behavior if that makes sense.\nShoot for the stars in everything you do because you never know!",
                    "author": "Snoo_72748",
                    "id": "ijmru72",
                    "parent_id": "t1_ijmpql2",
                    "score": 4,
                    "created_utc": 1660079071.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "ijnehjo",
            "parent_id": "t3_wk7kkl",
            "score": 9,
            "created_utc": 1660088422.0,
            "replies": [
                {
                    "body": "I’m sorry that’s really messed up! Hold on please tell me you got the other half? \n\nMy fiancé has me in his will as the executor etc. and as the beneficiary for his life insurance. He did all these things on his own and now if any changes are made we have to agree. He did this because he understood that moving away from my life, quitting my career that I went to college for 4 years and did a clinical internship for a year meant he had to make sure our future is secure.",
                    "author": "Snoo_72748",
                    "id": "ijnhyzs",
                    "parent_id": "t1_ijnehjo",
                    "score": 9,
                    "created_utc": 1660089956.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "ijlzlvj",
            "parent_id": "t3_wk7kkl",
            "score": 6,
            "created_utc": 1660068361.0,
            "replies": [
                {
                    "body": "Thank you so much! He’s promised me 30 years so let’s see 😊",
                    "author": "Snoo_72748",
                    "id": "ijm91b8",
                    "parent_id": "t1_ijlzlvj",
                    "score": 4,
                    "created_utc": 1660071880.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "> Fast forward to 3 years later.\n\nVery curious to know what your arrangement was like when you first started. Since you meet on Tinder, was there no allowance/ppm? Was he more like an 'experience' daddy?\n\nCongrats by the way, happy for you!",
            "author": "whatever-tata",
            "id": "ijmb362",
            "parent_id": "t3_wk7kkl",
            "score": 7,
            "created_utc": 1660072670.0,
            "replies": [
                {
                    "body": "What’s an “experience daddy”? Honestly our first message I told him what I was expecting allowance wise which he agreed and then we worked out M&G details. After that it was just like daily texting getting to get to know each other. Then it turned into a relationship for him at first and then I decided to end all my other sugar relationships to give him a real chance. I genuinely liked him and it just went from there",
                    "author": "Snoo_72748",
                    "id": "ijmccfq",
                    "parent_id": "t1_ijmb362",
                    "score": 3,
                    "created_utc": 1660073143.0,
                    "replies": []
                },
                {
                    "body": "I should also add I put something in my profile so men knew it just wasn’t vanilla dating I was looking for",
                    "author": "Snoo_72748",
                    "id": "ijmcjsg",
                    "parent_id": "t1_ijmb362",
                    "score": 2,
                    "created_utc": 1660073221.0,
                    "replies": [
                        {
                            "body": "What did you put in your profile? Please lmk",
                            "author": "ovurwurld",
                            "id": "imy4yri",
                            "parent_id": "t1_ijmcjsg",
                            "score": 3,
                            "created_utc": 1662224911.0,
                            "replies": [
                                {
                                    "body": "All I put was like sugar, candy symbols in my profile. It seemed like most knew what I was looking for. Also, changed my age requirements (40+). I genuinely do not care for boys my age, it’s like letting a toddler with sticky fingers touch you.",
                                    "author": "Snoo_72748",
                                    "id": "in1zxgo",
                                    "parent_id": "t1_imy4yri",
                                    "score": 4,
                                    "created_utc": 1662300214.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Great!!!  I love this!\n\nIm currently splitting with SB largely because I have to find vanilla to settle down (plus feelings on her end I suspect are cooling. And what I offer is low for her incredible earning potential and need and makes me feel guilty).\n\nAnyway, right now trying to decide whether vanilla or sugar is better for a marriage-minded guy.  This makes me hopeful",
            "author": "JDMultralight",
            "id": "ijm47uo",
            "parent_id": "t3_wk7kkl",
            "score": 3,
            "created_utc": 1660070065.0,
            "replies": [
                {
                    "body": "I appreciate it!! I shared this with the hopes of showing SB’s and SD’s we can be more to each other if it works for both parties. \nSome advice if you don’t mind, don’t be marriage minded until you find the person that makes you WANT to be married. If that’s makes sense",
                    "author": "Snoo_72748",
                    "id": "ijm9ada",
                    "parent_id": "t1_ijm47uo",
                    "score": 8,
                    "created_utc": 1660071976.0,
                    "replies": [
                        {
                            "body": "Yes it does.  Im imagining just treating it like vanilla.\n\nThis is tangential but my dad moments ago said something semi related when I was talking to him about it:\n\n“Just get one pregnant right away”\n\nDude wants grandkids",
                            "author": "JDMultralight",
                            "id": "ijmnjkt",
                            "parent_id": "t1_ijm9ada",
                            "score": 3,
                            "created_utc": 1660077420.0,
                            "replies": [
                                {
                                    "body": "That’s pretty funny, I think your dad is on to  something!",
                                    "author": "Snoo_72748",
                                    "id": "ijmr2qj",
                                    "parent_id": "t1_ijmnjkt",
                                    "score": 1,
                                    "created_utc": 1660078779.0,
                                    "replies": [
                                        {
                                            "body": "Brah I really look at all the strong people I know who had kids young with partners they werent imagining the would stay with and honestly there doesnt seem to be a correlation between that and doing poorly in life",
                                            "author": "JDMultralight",
                                            "id": "ijmtxj5",
                                            "parent_id": "t1_ijmr2qj",
                                            "score": 2,
                                            "created_utc": 1660079893.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yasss girl! I’m happy for you and it’s great to hear you living your best life! You deserve !!! 💕",
            "author": "pillowduchess",
            "id": "ijll7bg",
            "parent_id": "t3_wk7kkl",
            "score": 9,
            "created_utc": 1660063032.0,
            "replies": [
                {
                    "body": "Thank you! It’s insane sometimes. Definitely wasn’t looking for anything serious but here we are 😊",
                    "author": "Snoo_72748",
                    "id": "ijlmeq5",
                    "parent_id": "t1_ijll7bg",
                    "score": 8,
                    "created_utc": 1660063477.0,
                    "replies": [
                        {
                            "body": "It was meant to be! Wish you and your new family !! All the best !",
                            "author": "pillowduchess",
                            "id": "ijlnjol",
                            "parent_id": "t1_ijlmeq5",
                            "score": 2,
                            "created_utc": 1660063900.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "ijpwi55",
                    "parent_id": "t1_ijll7bg",
                    "score": -1,
                    "created_utc": 1660139952.0,
                    "replies": [
                        {
                            "body": "As a black woman, we often are the least desired by typical beauty standards, so to see this beautiful black woman get her fairy tale ending that is usually not the norm for most women of color .. yes this queen “deserves” … and why is it wrong for a woman to know their worth? \n\nSeems sus for you think of that as a bad thing. \n\nLastly, if it ain’t got nothing to do with you, you know minding your business is completely and utterly free !",
                            "author": "pillowduchess",
                            "id": "ijpzl5z",
                            "parent_id": "t1_ijpwi55",
                            "score": 4,
                            "created_utc": 1660141222.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Noice!",
            "author": "SDinAsia",
            "id": "ijlva6h",
            "parent_id": "t3_wk7kkl",
            "score": 3,
            "created_utc": 1660066755.0,
            "replies": []
        },
        {
            "body": "Congratulations! Happy it worked out so nicely for both of you.",
            "author": null,
            "id": "ijm7c42",
            "parent_id": "t3_wk7kkl",
            "score": 3,
            "created_utc": 1660071231.0,
            "replies": [
                {
                    "body": "Thanks! It’s pretty nuts sometimes.",
                    "author": "Snoo_72748",
                    "id": "ijmrgb0",
                    "parent_id": "t1_ijm7c42",
                    "score": 3,
                    "created_utc": 1660078923.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Also — how do you use tinder to find SB/SD…? \n(Like, what do you write to imply what you’re ISO?)\n\nI just don’t like the idea of having men/friends I see at the gym and in my city knowing my private life like that. But I can’t imagine hoping on Tinder and writing “SB ISO SD” or anything too forward. \n\nAnd I guess I’d be nervous about people I know I’m the hospital I work in seeing it too. Is keeping it a private thing even possible? \n\nLastly — I got banned for tinder randomly years ago because someone reported me as “fake profile”. 🙄\nSo I’d be stuck using the other apps for this task.",
            "author": "Koroleva7z",
            "id": "ijnhmci",
            "parent_id": "t3_wk7kkl",
            "score": 3,
            "created_utc": 1660089802.0,
            "replies": [
                {
                    "body": "I can’t remember what I exactly said but I put an innuendo with candy along with it. You’d be surprised how many men were cool with it or SD’s. Honestly I didn’t care about anyone I knew because of the parameters I set for age plus if you understood your in the same world as I. Most of the time they aren’t exactly broadcasting it.",
                    "author": "Snoo_72748",
                    "id": "ijnjak7",
                    "parent_id": "t1_ijnhmci",
                    "score": 5,
                    "created_utc": 1660090543.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Super happy for you : so the dream really exists for some SBs 😊",
            "author": "GuyFromParis",
            "id": "ijmg4g5",
            "parent_id": "t3_wk7kkl",
            "score": 2,
            "created_utc": 1660074565.0,
            "replies": [
                {
                    "body": "Thanks but it does feel like a dream sometimes. My friends love comparing it to pretty woman 😅",
                    "author": "Snoo_72748",
                    "id": "ijmrjaf",
                    "parent_id": "t1_ijmg4g5",
                    "score": 3,
                    "created_utc": 1660078955.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Awww, my hero!! So happy for you guys!\n\nHow did you both respond to news of pregnancy?",
            "author": "FructoseLady",
            "id": "ijmiegd",
            "parent_id": "t3_wk7kkl",
            "score": 2,
            "created_utc": 1660075427.0,
            "replies": [
                {
                    "body": "Actually it was planned so we were very happy! I was pregnant almost a year later.",
                    "author": "Snoo_72748",
                    "id": "ijmkbil",
                    "parent_id": "t1_ijmiegd",
                    "score": 5,
                    "created_utc": 1660076171.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Right on!",
            "author": "GordonGuapo",
            "id": "ijmqlat",
            "parent_id": "t3_wk7kkl",
            "score": 2,
            "created_utc": 1660078593.0,
            "replies": []
        },
        {
            "body": "I’m kind of hoping you chose Portland as your forever home.  I think you would love it here.",
            "author": "minkncookies",
            "id": "ijmywkx",
            "parent_id": "t3_wk7kkl",
            "score": 2,
            "created_utc": 1660081875.0,
            "replies": [
                {
                    "body": "Portland is pretty nice! Not quite but I’m pretty sure you could guess lol",
                    "author": "Snoo_72748",
                    "id": "ijn6mnp",
                    "parent_id": "t1_ijmywkx",
                    "score": 1,
                    "created_utc": 1660085042.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "This was a great read\n\nCongrats",
            "author": "wb19081908",
            "id": "ijn0es1",
            "parent_id": "t3_wk7kkl",
            "score": 2,
            "created_utc": 1660082483.0,
            "replies": [
                {
                    "body": "Thank you! 😊",
                    "author": "Snoo_72748",
                    "id": "ijn6q3o",
                    "parent_id": "t1_ijn0es1",
                    "score": 2,
                    "created_utc": 1660085083.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Thanks for sharing your story!",
            "author": "BaddB1tch",
            "id": "ijn7as5",
            "parent_id": "t3_wk7kkl",
            "score": 2,
            "created_utc": 1660085325.0,
            "replies": []
        },
        {
            "body": "I love your story. ❤️\nMy experiences on the other hand… I just don’t think I have what it takes to be a SB anymore. Lol",
            "author": "Koroleva7z",
            "id": "ijngw8y",
            "parent_id": "t3_wk7kkl",
            "score": 2,
            "created_utc": 1660089481.0,
            "replies": []
        },
        {
            "body": "A love story!!! Love it",
            "author": "SunRaePrincess",
            "id": "ijnm12d",
            "parent_id": "t3_wk7kkl",
            "score": 2,
            "created_utc": 1660091761.0,
            "replies": [
                {
                    "body": "Thanks girl! It’s an amazing love story but by no means is it perfect.",
                    "author": "Snoo_72748",
                    "id": "ijnzm0x",
                    "parent_id": "t1_ijnm12d",
                    "score": 2,
                    "created_utc": 1660097846.0,
                    "replies": [
                        {
                            "body": "Trust and believe I know that! lol love is hard sometimes",
                            "author": "SunRaePrincess",
                            "id": "ijnzt4c",
                            "parent_id": "t1_ijnzm0x",
                            "score": 2,
                            "created_utc": 1660097937.0,
                            "replies": [
                                {
                                    "body": "It is! I feel though like it’s so worth it once you find that person you can just be your natural self with.",
                                    "author": "Snoo_72748",
                                    "id": "ijo0882",
                                    "parent_id": "t1_ijnzt4c",
                                    "score": 2,
                                    "created_utc": 1660098127.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Congratulations! I’m glad you found someone and that you mentioned your ethnicity. I’d love to ask you some more questions privately if you don’t mind ☺️",
            "author": "qt4u2nv",
            "id": "ijo2zte",
            "parent_id": "t3_wk7kkl",
            "score": 2,
            "created_utc": 1660099421.0,
            "replies": [
                {
                    "body": "Thank you! Yeah it’s okay if you private message me.",
                    "author": "Snoo_72748",
                    "id": "ijo5c28",
                    "parent_id": "t1_ijo2zte",
                    "score": 1,
                    "created_utc": 1660100524.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I absolutely love your story. I’m a hopeless romantic and it’s hard being an older SB. Keep thriving and living in love! Congrats to you and your little family!",
            "author": "Misee1oak",
            "id": "ijo3ula",
            "parent_id": "t3_wk7kkl",
            "score": 2,
            "created_utc": 1660099819.0,
            "replies": [
                {
                    "body": "Thank you for the kindness! It is pretty crazy when I think about. I think that’s what made me share because it’s like you never know 😊",
                    "author": "Snoo_72748",
                    "id": "ijo5l6x",
                    "parent_id": "t1_ijo3ula",
                    "score": 2,
                    "created_utc": 1660100645.0,
                    "replies": [
                        {
                            "body": "My gf is always telling me you never know who you’ll meet in your everyday life! Lol now I’m like 👀 how am I attracting all these people rn lmfaoooo",
                            "author": "Misee1oak",
                            "id": "ijo7p7w",
                            "parent_id": "t1_ijo5l6x",
                            "score": 2,
                            "created_utc": 1660101666.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I still have yet to meet a real SD, seeking has too many catfish and thirsty not true SD and I don’t know how to use Tinder to find an SD. \n\nNeed some help and guidance still, just want to be safe and have it all like you",
            "author": "limitlessjan",
            "id": "ijodr91",
            "parent_id": "t3_wk7kkl",
            "score": 2,
            "created_utc": 1660104811.0,
            "replies": [
                {
                    "body": "I wish I could give some advice  but it seems in the bowl things have changed drastically",
                    "author": "Snoo_72748",
                    "id": "ijpxfhb",
                    "parent_id": "t1_ijodr91",
                    "score": 1,
                    "created_utc": 1660140335.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Wow definitely 1 in a million 😇 Congrats and have a long happy marriage",
            "author": null,
            "id": "ijola7n",
            "parent_id": "t3_wk7kkl",
            "score": 2,
            "created_utc": 1660109234.0,
            "replies": [
                {
                    "body": "Thank you!! That is my hope as well ☺️",
                    "author": "Snoo_72748",
                    "id": "ijptu1f",
                    "parent_id": "t1_ijola7n",
                    "score": 1,
                    "created_utc": 1660138824.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Unfortunately no one knows where you're going to find your so&so, eventhough everybody claims to be experts, \" it has to be on tinder, bars, through friends, job, hobby,library \" 😂😂😂😂. \n\nIn reality you could find her anywhere, good luck 👍",
            "author": "vdzz000",
            "id": "ijq1h3e",
            "parent_id": "t3_wk7kkl",
            "score": 2,
            "created_utc": 1660141990.0,
            "replies": []
        },
        {
            "body": "The other way of looking at this is you have very slim pickings! 80 - 90% of dudes are married. That leaves 10%. 90% of them will be at a huge age gap. That leaves 1% eligible. Those may or may not want marriage or may not be attractive enough or compatible. It’s like the lottery.",
            "author": null,
            "id": "ijlmwxn",
            "parent_id": "t3_wk7kkl",
            "score": 5,
            "created_utc": 1660063666.0,
            "replies": [
                {
                    "body": "You sure it’s 80-90% because polls on this sub werent nearly that high and it doesnt seem like most of my SBs were with married guys?",
                    "author": "JDMultralight",
                    "id": "ijm4p6u",
                    "parent_id": "t1_ijlmwxn",
                    "score": 3,
                    "created_utc": 1660070247.0,
                    "replies": [
                        {
                            "body": "It seems there is some propaganda from married men: \"single men are rare\"\nLast polls say the contrary: the majority of SDs are singles",
                            "author": "GuyFromParis",
                            "id": "ijmfypl",
                            "parent_id": "t1_ijm4p6u",
                            "score": 2,
                            "created_utc": 1660074507.0,
                            "replies": [
                                {
                                    "body": "Yes I think people with the harsher views like guy I responded to tend to paint a more pessimistic picture of how the world works in terms of how people treat eachother - marital infidelity fitting in nicely there.\n\nAnd yes if you yourself are married it alleviates some responsibility to imagine that everybody is also.",
                                    "author": "JDMultralight",
                                    "id": "ijmgpwh",
                                    "parent_id": "t1_ijmfypl",
                                    "score": 5,
                                    "created_utc": 1660074788.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "I was thinking the same thing. I had like 5 SD’s and only 2 of them were married. The others were just looking for just a simple connection without a lot of outside effort like vanilla dating",
                            "author": "Snoo_72748",
                            "id": "ijm8y0q",
                            "parent_id": "t1_ijm4p6u",
                            "score": 1,
                            "created_utc": 1660071845.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "ijlnlhf",
                    "parent_id": "t1_ijlmwxn",
                    "score": 5,
                    "created_utc": 1660063918.0,
                    "replies": [
                        {
                            "body": "Thank you! It’s definitely something where I think things have to align perfectly. I was lucky enough that we wasn’t jaded by his divorce 5 years before me and he was open to having more children.",
                            "author": "Snoo_72748",
                            "id": "ijlqfye",
                            "parent_id": "t1_ijlnlhf",
                            "score": 5,
                            "created_utc": 1660064967.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "ijlnnyv",
                    "parent_id": "t1_ijlmwxn",
                    "score": 1,
                    "created_utc": 1660063944.0,
                    "replies": [
                        {
                            "body": "My point is to find a SD who can be husband material is a very slim chance given the demographics on both sides of the bowl.",
                            "author": null,
                            "id": "ijlqx7k",
                            "parent_id": "t1_ijlnnyv",
                            "score": 3,
                            "created_utc": 1660065145.0,
                            "replies": [
                                {
                                    "body": "Yes it really is but I just wanted to say it can happen when it’s right",
                                    "author": "Snoo_72748",
                                    "id": "ijlrjmr",
                                    "parent_id": "t1_ijlqx7k",
                                    "score": 1,
                                    "created_utc": 1660065376.0,
                                    "replies": [
                                        {
                                            "body": "It can happen but the odds are too slim for most gals to even think it will.",
                                            "author": null,
                                            "id": "ijlsmkz",
                                            "parent_id": "t1_ijlrjmr",
                                            "score": 1,
                                            "created_utc": 1660065774.0,
                                            "replies": [
                                                {
                                                    "body": "May the odds be ever in your favor!",
                                                    "author": "Snoo_72748",
                                                    "id": "ijlukus",
                                                    "parent_id": "t1_ijlsmkz",
                                                    "score": 3,
                                                    "created_utc": 1660066492.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yass girl! I'm glad to hear you're breaking those stereotypes (you know which one 😉). Go live the life you deserve!",
            "author": "paypahcut",
            "id": "ijlqvvy",
            "parent_id": "t3_wk7kkl",
            "score": 3,
            "created_utc": 1660065131.0,
            "replies": [
                {
                    "body": "Thank you!! Breaking stereotypes is fun but it’s hard because the world let’s you know your different like damn your not what I thought you were going to be.",
                    "author": "Snoo_72748",
                    "id": "ijlrx8o",
                    "parent_id": "t1_ijlqvvy",
                    "score": 6,
                    "created_utc": 1660065515.0,
                    "replies": [
                        {
                            "body": "Yes I totally get you. I wouldn't elaborate further here because this is a happy post and we don't want any negativity here but glad you found your person who loved you for you! To hell with what others have to say. They can take what they like and leave the rest of us to the men who are more deserving of us!",
                            "author": "paypahcut",
                            "id": "ijlsi7n",
                            "parent_id": "t1_ijlrx8o",
                            "score": 5,
                            "created_utc": 1660065729.0,
                            "replies": [
                                {
                                    "body": "Absolutely loving your positivity. I’m happy I shared! This is just meant to be uplifting for all of the SB’s and especially women of color. We are told your not enough and you can’t do this. I’ve encountered it in the high upscale restaurants and hotels but guess what? My 3 carat ring let’s them know. I want to continue to push the boundaries. It is 2022 after all",
                                    "author": "Snoo_72748",
                                    "id": "ijlttgn",
                                    "parent_id": "t1_ijlsi7n",
                                    "score": 9,
                                    "created_utc": 1660066210.0,
                                    "replies": [
                                        {
                                            "body": "Ohh yasss flash that ring!!",
                                            "author": "FructoseLady",
                                            "id": "ijmipk3",
                                            "parent_id": "t1_ijlttgn",
                                            "score": 2,
                                            "created_utc": 1660075545.0,
                                            "replies": [
                                                {
                                                    "body": "Thank you girl! I gotta admit it’s a pretty nice diamond ring.",
                                                    "author": "Snoo_72748",
                                                    "id": "ijmlcb3",
                                                    "parent_id": "t1_ijmipk3",
                                                    "score": 2,
                                                    "created_utc": 1660076566.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Wow congratulations. I would never marry a SB but we get one of these stories once every 3 months maybe. Still sceptical but I guess it's possible if both want it. Age gap matters, it's often a low 20F with early 50M that we hear these stories about.",
            "author": "sugardad123",
            "id": "ijpnpug",
            "parent_id": "t3_wk7kkl",
            "score": 1,
            "created_utc": 1660136032.0,
            "replies": [
                {
                    "body": "Yeah I never planned it or even had the thought cross my mind until I met him. It’s definitely not for everyone but if it works hey why not give it a chance.",
                    "author": "Snoo_72748",
                    "id": "ijpurtb",
                    "parent_id": "t1_ijpnpug",
                    "score": 2,
                    "created_utc": 1660139224.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "this is fkn sick. good luck to both of you",
            "author": "Kind_Imagination5199",
            "id": "jij7lhh",
            "parent_id": "t3_wk7kkl",
            "score": 1,
            "created_utc": 1683008963.0,
            "replies": [
                {
                    "body": "Because two adults from different races enjoy each others presence? Yeah really fucking sick. I’ll enjoy it while many people (men) in this group are stuck in dead bedrooms but that’s the correct thing to do because they are similar ages 😂",
                    "author": "Snoo_72748",
                    "id": "jikxvac",
                    "parent_id": "t1_jij7lhh",
                    "score": 1,
                    "created_utc": 1683045228.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Thank you!! It was unbelievable for both of us. Then it was the telling friends/family (I lost my best friend form childhood over it). I took a big leap. Moved across the country after finishing my degree I worked so hard for. I’m now a SAHM but I’ve never been happier. Currently waiting to go pick him up from the airport. I still get giddy when he comes back from work trips 🥰 I tell everyone go for love when it come unexpected you never know where it will lead you.",
            "author": "Snoo_72748",
            "id": "ijlq5zp",
            "parent_id": "t1_ijlnx6o",
            "score": 21,
            "created_utc": 1660064865.0,
            "replies": []
        },
        {
            "body": "I definitely ran into those penny pinchers or try to change the relationship vanilla without any actually relationship changing behavior if that makes sense.\nShoot for the stars in everything you do because you never know!",
            "author": "Snoo_72748",
            "id": "ijmru72",
            "parent_id": "t1_ijmpql2",
            "score": 4,
            "created_utc": 1660079071.0,
            "replies": []
        },
        {
            "body": "I’m sorry that’s really messed up! Hold on please tell me you got the other half? \n\nMy fiancé has me in his will as the executor etc. and as the beneficiary for his life insurance. He did all these things on his own and now if any changes are made we have to agree. He did this because he understood that moving away from my life, quitting my career that I went to college for 4 years and did a clinical internship for a year meant he had to make sure our future is secure.",
            "author": "Snoo_72748",
            "id": "ijnhyzs",
            "parent_id": "t1_ijnehjo",
            "score": 9,
            "created_utc": 1660089956.0,
            "replies": []
        },
        {
            "body": "Thank you so much! He’s promised me 30 years so let’s see 😊",
            "author": "Snoo_72748",
            "id": "ijm91b8",
            "parent_id": "t1_ijlzlvj",
            "score": 4,
            "created_utc": 1660071880.0,
            "replies": []
        },
        {
            "body": "What’s an “experience daddy”? Honestly our first message I told him what I was expecting allowance wise which he agreed and then we worked out M&G details. After that it was just like daily texting getting to get to know each other. Then it turned into a relationship for him at first and then I decided to end all my other sugar relationships to give him a real chance. I genuinely liked him and it just went from there",
            "author": "Snoo_72748",
            "id": "ijmccfq",
            "parent_id": "t1_ijmb362",
            "score": 3,
            "created_utc": 1660073143.0,
            "replies": []
        },
        {
            "body": "I should also add I put something in my profile so men knew it just wasn’t vanilla dating I was looking for",
            "author": "Snoo_72748",
            "id": "ijmcjsg",
            "parent_id": "t1_ijmb362",
            "score": 2,
            "created_utc": 1660073221.0,
            "replies": [
                {
                    "body": "What did you put in your profile? Please lmk",
                    "author": "ovurwurld",
                    "id": "imy4yri",
                    "parent_id": "t1_ijmcjsg",
                    "score": 3,
                    "created_utc": 1662224911.0,
                    "replies": [
                        {
                            "body": "All I put was like sugar, candy symbols in my profile. It seemed like most knew what I was looking for. Also, changed my age requirements (40+). I genuinely do not care for boys my age, it’s like letting a toddler with sticky fingers touch you.",
                            "author": "Snoo_72748",
                            "id": "in1zxgo",
                            "parent_id": "t1_imy4yri",
                            "score": 4,
                            "created_utc": 1662300214.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I appreciate it!! I shared this with the hopes of showing SB’s and SD’s we can be more to each other if it works for both parties. \nSome advice if you don’t mind, don’t be marriage minded until you find the person that makes you WANT to be married. If that’s makes sense",
            "author": "Snoo_72748",
            "id": "ijm9ada",
            "parent_id": "t1_ijm47uo",
            "score": 8,
            "created_utc": 1660071976.0,
            "replies": [
                {
                    "body": "Yes it does.  Im imagining just treating it like vanilla.\n\nThis is tangential but my dad moments ago said something semi related when I was talking to him about it:\n\n“Just get one pregnant right away”\n\nDude wants grandkids",
                    "author": "JDMultralight",
                    "id": "ijmnjkt",
                    "parent_id": "t1_ijm9ada",
                    "score": 3,
                    "created_utc": 1660077420.0,
                    "replies": [
                        {
                            "body": "That’s pretty funny, I think your dad is on to  something!",
                            "author": "Snoo_72748",
                            "id": "ijmr2qj",
                            "parent_id": "t1_ijmnjkt",
                            "score": 1,
                            "created_utc": 1660078779.0,
                            "replies": [
                                {
                                    "body": "Brah I really look at all the strong people I know who had kids young with partners they werent imagining the would stay with and honestly there doesnt seem to be a correlation between that and doing poorly in life",
                                    "author": "JDMultralight",
                                    "id": "ijmtxj5",
                                    "parent_id": "t1_ijmr2qj",
                                    "score": 2,
                                    "created_utc": 1660079893.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Thank you! It’s insane sometimes. Definitely wasn’t looking for anything serious but here we are 😊",
            "author": "Snoo_72748",
            "id": "ijlmeq5",
            "parent_id": "t1_ijll7bg",
            "score": 8,
            "created_utc": 1660063477.0,
            "replies": [
                {
                    "body": "It was meant to be! Wish you and your new family !! All the best !",
                    "author": "pillowduchess",
                    "id": "ijlnjol",
                    "parent_id": "t1_ijlmeq5",
                    "score": 2,
                    "created_utc": 1660063900.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "ijpwi55",
            "parent_id": "t1_ijll7bg",
            "score": -1,
            "created_utc": 1660139952.0,
            "replies": [
                {
                    "body": "As a black woman, we often are the least desired by typical beauty standards, so to see this beautiful black woman get her fairy tale ending that is usually not the norm for most women of color .. yes this queen “deserves” … and why is it wrong for a woman to know their worth? \n\nSeems sus for you think of that as a bad thing. \n\nLastly, if it ain’t got nothing to do with you, you know minding your business is completely and utterly free !",
                    "author": "pillowduchess",
                    "id": "ijpzl5z",
                    "parent_id": "t1_ijpwi55",
                    "score": 4,
                    "created_utc": 1660141222.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Thanks! It’s pretty nuts sometimes.",
            "author": "Snoo_72748",
            "id": "ijmrgb0",
            "parent_id": "t1_ijm7c42",
            "score": 3,
            "created_utc": 1660078923.0,
            "replies": []
        },
        {
            "body": "I can’t remember what I exactly said but I put an innuendo with candy along with it. You’d be surprised how many men were cool with it or SD’s. Honestly I didn’t care about anyone I knew because of the parameters I set for age plus if you understood your in the same world as I. Most of the time they aren’t exactly broadcasting it.",
            "author": "Snoo_72748",
            "id": "ijnjak7",
            "parent_id": "t1_ijnhmci",
            "score": 5,
            "created_utc": 1660090543.0,
            "replies": []
        },
        {
            "body": "Thanks but it does feel like a dream sometimes. My friends love comparing it to pretty woman 😅",
            "author": "Snoo_72748",
            "id": "ijmrjaf",
            "parent_id": "t1_ijmg4g5",
            "score": 3,
            "created_utc": 1660078955.0,
            "replies": []
        },
        {
            "body": "Actually it was planned so we were very happy! I was pregnant almost a year later.",
            "author": "Snoo_72748",
            "id": "ijmkbil",
            "parent_id": "t1_ijmiegd",
            "score": 5,
            "created_utc": 1660076171.0,
            "replies": []
        },
        {
            "body": "Portland is pretty nice! Not quite but I’m pretty sure you could guess lol",
            "author": "Snoo_72748",
            "id": "ijn6mnp",
            "parent_id": "t1_ijmywkx",
            "score": 1,
            "created_utc": 1660085042.0,
            "replies": []
        },
        {
            "body": "Thank you! 😊",
            "author": "Snoo_72748",
            "id": "ijn6q3o",
            "parent_id": "t1_ijn0es1",
            "score": 2,
            "created_utc": 1660085083.0,
            "replies": []
        },
        {
            "body": "Thanks girl! It’s an amazing love story but by no means is it perfect.",
            "author": "Snoo_72748",
            "id": "ijnzm0x",
            "parent_id": "t1_ijnm12d",
            "score": 2,
            "created_utc": 1660097846.0,
            "replies": [
                {
                    "body": "Trust and believe I know that! lol love is hard sometimes",
                    "author": "SunRaePrincess",
                    "id": "ijnzt4c",
                    "parent_id": "t1_ijnzm0x",
                    "score": 2,
                    "created_utc": 1660097937.0,
                    "replies": [
                        {
                            "body": "It is! I feel though like it’s so worth it once you find that person you can just be your natural self with.",
                            "author": "Snoo_72748",
                            "id": "ijo0882",
                            "parent_id": "t1_ijnzt4c",
                            "score": 2,
                            "created_utc": 1660098127.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Thank you! Yeah it’s okay if you private message me.",
            "author": "Snoo_72748",
            "id": "ijo5c28",
            "parent_id": "t1_ijo2zte",
            "score": 1,
            "created_utc": 1660100524.0,
            "replies": []
        },
        {
            "body": "Thank you for the kindness! It is pretty crazy when I think about. I think that’s what made me share because it’s like you never know 😊",
            "author": "Snoo_72748",
            "id": "ijo5l6x",
            "parent_id": "t1_ijo3ula",
            "score": 2,
            "created_utc": 1660100645.0,
            "replies": [
                {
                    "body": "My gf is always telling me you never know who you’ll meet in your everyday life! Lol now I’m like 👀 how am I attracting all these people rn lmfaoooo",
                    "author": "Misee1oak",
                    "id": "ijo7p7w",
                    "parent_id": "t1_ijo5l6x",
                    "score": 2,
                    "created_utc": 1660101666.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I wish I could give some advice  but it seems in the bowl things have changed drastically",
            "author": "Snoo_72748",
            "id": "ijpxfhb",
            "parent_id": "t1_ijodr91",
            "score": 1,
            "created_utc": 1660140335.0,
            "replies": []
        },
        {
            "body": "Thank you!! That is my hope as well ☺️",
            "author": "Snoo_72748",
            "id": "ijptu1f",
            "parent_id": "t1_ijola7n",
            "score": 1,
            "created_utc": 1660138824.0,
            "replies": []
        },
        {
            "body": "You sure it’s 80-90% because polls on this sub werent nearly that high and it doesnt seem like most of my SBs were with married guys?",
            "author": "JDMultralight",
            "id": "ijm4p6u",
            "parent_id": "t1_ijlmwxn",
            "score": 3,
            "created_utc": 1660070247.0,
            "replies": [
                {
                    "body": "It seems there is some propaganda from married men: \"single men are rare\"\nLast polls say the contrary: the majority of SDs are singles",
                    "author": "GuyFromParis",
                    "id": "ijmfypl",
                    "parent_id": "t1_ijm4p6u",
                    "score": 2,
                    "created_utc": 1660074507.0,
                    "replies": [
                        {
                            "body": "Yes I think people with the harsher views like guy I responded to tend to paint a more pessimistic picture of how the world works in terms of how people treat eachother - marital infidelity fitting in nicely there.\n\nAnd yes if you yourself are married it alleviates some responsibility to imagine that everybody is also.",
                            "author": "JDMultralight",
                            "id": "ijmgpwh",
                            "parent_id": "t1_ijmfypl",
                            "score": 5,
                            "created_utc": 1660074788.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "I was thinking the same thing. I had like 5 SD’s and only 2 of them were married. The others were just looking for just a simple connection without a lot of outside effort like vanilla dating",
                    "author": "Snoo_72748",
                    "id": "ijm8y0q",
                    "parent_id": "t1_ijm4p6u",
                    "score": 1,
                    "created_utc": 1660071845.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "ijlnlhf",
            "parent_id": "t1_ijlmwxn",
            "score": 5,
            "created_utc": 1660063918.0,
            "replies": [
                {
                    "body": "Thank you! It’s definitely something where I think things have to align perfectly. I was lucky enough that we wasn’t jaded by his divorce 5 years before me and he was open to having more children.",
                    "author": "Snoo_72748",
                    "id": "ijlqfye",
                    "parent_id": "t1_ijlnlhf",
                    "score": 5,
                    "created_utc": 1660064967.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "ijlnnyv",
            "parent_id": "t1_ijlmwxn",
            "score": 1,
            "created_utc": 1660063944.0,
            "replies": [
                {
                    "body": "My point is to find a SD who can be husband material is a very slim chance given the demographics on both sides of the bowl.",
                    "author": null,
                    "id": "ijlqx7k",
                    "parent_id": "t1_ijlnnyv",
                    "score": 3,
                    "created_utc": 1660065145.0,
                    "replies": [
                        {
                            "body": "Yes it really is but I just wanted to say it can happen when it’s right",
                            "author": "Snoo_72748",
                            "id": "ijlrjmr",
                            "parent_id": "t1_ijlqx7k",
                            "score": 1,
                            "created_utc": 1660065376.0,
                            "replies": [
                                {
                                    "body": "It can happen but the odds are too slim for most gals to even think it will.",
                                    "author": null,
                                    "id": "ijlsmkz",
                                    "parent_id": "t1_ijlrjmr",
                                    "score": 1,
                                    "created_utc": 1660065774.0,
                                    "replies": [
                                        {
                                            "body": "May the odds be ever in your favor!",
                                            "author": "Snoo_72748",
                                            "id": "ijlukus",
                                            "parent_id": "t1_ijlsmkz",
                                            "score": 3,
                                            "created_utc": 1660066492.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Thank you!! Breaking stereotypes is fun but it’s hard because the world let’s you know your different like damn your not what I thought you were going to be.",
            "author": "Snoo_72748",
            "id": "ijlrx8o",
            "parent_id": "t1_ijlqvvy",
            "score": 6,
            "created_utc": 1660065515.0,
            "replies": [
                {
                    "body": "Yes I totally get you. I wouldn't elaborate further here because this is a happy post and we don't want any negativity here but glad you found your person who loved you for you! To hell with what others have to say. They can take what they like and leave the rest of us to the men who are more deserving of us!",
                    "author": "paypahcut",
                    "id": "ijlsi7n",
                    "parent_id": "t1_ijlrx8o",
                    "score": 5,
                    "created_utc": 1660065729.0,
                    "replies": [
                        {
                            "body": "Absolutely loving your positivity. I’m happy I shared! This is just meant to be uplifting for all of the SB’s and especially women of color. We are told your not enough and you can’t do this. I’ve encountered it in the high upscale restaurants and hotels but guess what? My 3 carat ring let’s them know. I want to continue to push the boundaries. It is 2022 after all",
                            "author": "Snoo_72748",
                            "id": "ijlttgn",
                            "parent_id": "t1_ijlsi7n",
                            "score": 9,
                            "created_utc": 1660066210.0,
                            "replies": [
                                {
                                    "body": "Ohh yasss flash that ring!!",
                                    "author": "FructoseLady",
                                    "id": "ijmipk3",
                                    "parent_id": "t1_ijlttgn",
                                    "score": 2,
                                    "created_utc": 1660075545.0,
                                    "replies": [
                                        {
                                            "body": "Thank you girl! I gotta admit it’s a pretty nice diamond ring.",
                                            "author": "Snoo_72748",
                                            "id": "ijmlcb3",
                                            "parent_id": "t1_ijmipk3",
                                            "score": 2,
                                            "created_utc": 1660076566.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yeah I never planned it or even had the thought cross my mind until I met him. It’s definitely not for everyone but if it works hey why not give it a chance.",
            "author": "Snoo_72748",
            "id": "ijpurtb",
            "parent_id": "t1_ijpnpug",
            "score": 2,
            "created_utc": 1660139224.0,
            "replies": []
        },
        {
            "body": "Because two adults from different races enjoy each others presence? Yeah really fucking sick. I’ll enjoy it while many people (men) in this group are stuck in dead bedrooms but that’s the correct thing to do because they are similar ages 😂",
            "author": "Snoo_72748",
            "id": "jikxvac",
            "parent_id": "t1_jij7lhh",
            "score": 1,
            "created_utc": 1683045228.0,
            "replies": []
        },
        {
            "body": "What did you put in your profile? Please lmk",
            "author": "ovurwurld",
            "id": "imy4yri",
            "parent_id": "t1_ijmcjsg",
            "score": 3,
            "created_utc": 1662224911.0,
            "replies": [
                {
                    "body": "All I put was like sugar, candy symbols in my profile. It seemed like most knew what I was looking for. Also, changed my age requirements (40+). I genuinely do not care for boys my age, it’s like letting a toddler with sticky fingers touch you.",
                    "author": "Snoo_72748",
                    "id": "in1zxgo",
                    "parent_id": "t1_imy4yri",
                    "score": 4,
                    "created_utc": 1662300214.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yes it does.  Im imagining just treating it like vanilla.\n\nThis is tangential but my dad moments ago said something semi related when I was talking to him about it:\n\n“Just get one pregnant right away”\n\nDude wants grandkids",
            "author": "JDMultralight",
            "id": "ijmnjkt",
            "parent_id": "t1_ijm9ada",
            "score": 3,
            "created_utc": 1660077420.0,
            "replies": [
                {
                    "body": "That’s pretty funny, I think your dad is on to  something!",
                    "author": "Snoo_72748",
                    "id": "ijmr2qj",
                    "parent_id": "t1_ijmnjkt",
                    "score": 1,
                    "created_utc": 1660078779.0,
                    "replies": [
                        {
                            "body": "Brah I really look at all the strong people I know who had kids young with partners they werent imagining the would stay with and honestly there doesnt seem to be a correlation between that and doing poorly in life",
                            "author": "JDMultralight",
                            "id": "ijmtxj5",
                            "parent_id": "t1_ijmr2qj",
                            "score": 2,
                            "created_utc": 1660079893.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "It was meant to be! Wish you and your new family !! All the best !",
            "author": "pillowduchess",
            "id": "ijlnjol",
            "parent_id": "t1_ijlmeq5",
            "score": 2,
            "created_utc": 1660063900.0,
            "replies": []
        },
        {
            "body": "As a black woman, we often are the least desired by typical beauty standards, so to see this beautiful black woman get her fairy tale ending that is usually not the norm for most women of color .. yes this queen “deserves” … and why is it wrong for a woman to know their worth? \n\nSeems sus for you think of that as a bad thing. \n\nLastly, if it ain’t got nothing to do with you, you know minding your business is completely and utterly free !",
            "author": "pillowduchess",
            "id": "ijpzl5z",
            "parent_id": "t1_ijpwi55",
            "score": 4,
            "created_utc": 1660141222.0,
            "replies": []
        },
        {
            "body": "Trust and believe I know that! lol love is hard sometimes",
            "author": "SunRaePrincess",
            "id": "ijnzt4c",
            "parent_id": "t1_ijnzm0x",
            "score": 2,
            "created_utc": 1660097937.0,
            "replies": [
                {
                    "body": "It is! I feel though like it’s so worth it once you find that person you can just be your natural self with.",
                    "author": "Snoo_72748",
                    "id": "ijo0882",
                    "parent_id": "t1_ijnzt4c",
                    "score": 2,
                    "created_utc": 1660098127.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "My gf is always telling me you never know who you’ll meet in your everyday life! Lol now I’m like 👀 how am I attracting all these people rn lmfaoooo",
            "author": "Misee1oak",
            "id": "ijo7p7w",
            "parent_id": "t1_ijo5l6x",
            "score": 2,
            "created_utc": 1660101666.0,
            "replies": []
        },
        {
            "body": "It seems there is some propaganda from married men: \"single men are rare\"\nLast polls say the contrary: the majority of SDs are singles",
            "author": "GuyFromParis",
            "id": "ijmfypl",
            "parent_id": "t1_ijm4p6u",
            "score": 2,
            "created_utc": 1660074507.0,
            "replies": [
                {
                    "body": "Yes I think people with the harsher views like guy I responded to tend to paint a more pessimistic picture of how the world works in terms of how people treat eachother - marital infidelity fitting in nicely there.\n\nAnd yes if you yourself are married it alleviates some responsibility to imagine that everybody is also.",
                    "author": "JDMultralight",
                    "id": "ijmgpwh",
                    "parent_id": "t1_ijmfypl",
                    "score": 5,
                    "created_utc": 1660074788.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I was thinking the same thing. I had like 5 SD’s and only 2 of them were married. The others were just looking for just a simple connection without a lot of outside effort like vanilla dating",
            "author": "Snoo_72748",
            "id": "ijm8y0q",
            "parent_id": "t1_ijm4p6u",
            "score": 1,
            "created_utc": 1660071845.0,
            "replies": []
        },
        {
            "body": "Thank you! It’s definitely something where I think things have to align perfectly. I was lucky enough that we wasn’t jaded by his divorce 5 years before me and he was open to having more children.",
            "author": "Snoo_72748",
            "id": "ijlqfye",
            "parent_id": "t1_ijlnlhf",
            "score": 5,
            "created_utc": 1660064967.0,
            "replies": []
        },
        {
            "body": "My point is to find a SD who can be husband material is a very slim chance given the demographics on both sides of the bowl.",
            "author": null,
            "id": "ijlqx7k",
            "parent_id": "t1_ijlnnyv",
            "score": 3,
            "created_utc": 1660065145.0,
            "replies": [
                {
                    "body": "Yes it really is but I just wanted to say it can happen when it’s right",
                    "author": "Snoo_72748",
                    "id": "ijlrjmr",
                    "parent_id": "t1_ijlqx7k",
                    "score": 1,
                    "created_utc": 1660065376.0,
                    "replies": [
                        {
                            "body": "It can happen but the odds are too slim for most gals to even think it will.",
                            "author": null,
                            "id": "ijlsmkz",
                            "parent_id": "t1_ijlrjmr",
                            "score": 1,
                            "created_utc": 1660065774.0,
                            "replies": [
                                {
                                    "body": "May the odds be ever in your favor!",
                                    "author": "Snoo_72748",
                                    "id": "ijlukus",
                                    "parent_id": "t1_ijlsmkz",
                                    "score": 3,
                                    "created_utc": 1660066492.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yes I totally get you. I wouldn't elaborate further here because this is a happy post and we don't want any negativity here but glad you found your person who loved you for you! To hell with what others have to say. They can take what they like and leave the rest of us to the men who are more deserving of us!",
            "author": "paypahcut",
            "id": "ijlsi7n",
            "parent_id": "t1_ijlrx8o",
            "score": 5,
            "created_utc": 1660065729.0,
            "replies": [
                {
                    "body": "Absolutely loving your positivity. I’m happy I shared! This is just meant to be uplifting for all of the SB’s and especially women of color. We are told your not enough and you can’t do this. I’ve encountered it in the high upscale restaurants and hotels but guess what? My 3 carat ring let’s them know. I want to continue to push the boundaries. It is 2022 after all",
                    "author": "Snoo_72748",
                    "id": "ijlttgn",
                    "parent_id": "t1_ijlsi7n",
                    "score": 9,
                    "created_utc": 1660066210.0,
                    "replies": [
                        {
                            "body": "Ohh yasss flash that ring!!",
                            "author": "FructoseLady",
                            "id": "ijmipk3",
                            "parent_id": "t1_ijlttgn",
                            "score": 2,
                            "created_utc": 1660075545.0,
                            "replies": [
                                {
                                    "body": "Thank you girl! I gotta admit it’s a pretty nice diamond ring.",
                                    "author": "Snoo_72748",
                                    "id": "ijmlcb3",
                                    "parent_id": "t1_ijmipk3",
                                    "score": 2,
                                    "created_utc": 1660076566.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "All I put was like sugar, candy symbols in my profile. It seemed like most knew what I was looking for. Also, changed my age requirements (40+). I genuinely do not care for boys my age, it’s like letting a toddler with sticky fingers touch you.",
            "author": "Snoo_72748",
            "id": "in1zxgo",
            "parent_id": "t1_imy4yri",
            "score": 4,
            "created_utc": 1662300214.0,
            "replies": []
        },
        {
            "body": "That’s pretty funny, I think your dad is on to  something!",
            "author": "Snoo_72748",
            "id": "ijmr2qj",
            "parent_id": "t1_ijmnjkt",
            "score": 1,
            "created_utc": 1660078779.0,
            "replies": [
                {
                    "body": "Brah I really look at all the strong people I know who had kids young with partners they werent imagining the would stay with and honestly there doesnt seem to be a correlation between that and doing poorly in life",
                    "author": "JDMultralight",
                    "id": "ijmtxj5",
                    "parent_id": "t1_ijmr2qj",
                    "score": 2,
                    "created_utc": 1660079893.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "It is! I feel though like it’s so worth it once you find that person you can just be your natural self with.",
            "author": "Snoo_72748",
            "id": "ijo0882",
            "parent_id": "t1_ijnzt4c",
            "score": 2,
            "created_utc": 1660098127.0,
            "replies": []
        },
        {
            "body": "Yes I think people with the harsher views like guy I responded to tend to paint a more pessimistic picture of how the world works in terms of how people treat eachother - marital infidelity fitting in nicely there.\n\nAnd yes if you yourself are married it alleviates some responsibility to imagine that everybody is also.",
            "author": "JDMultralight",
            "id": "ijmgpwh",
            "parent_id": "t1_ijmfypl",
            "score": 5,
            "created_utc": 1660074788.0,
            "replies": []
        },
        {
            "body": "Yes it really is but I just wanted to say it can happen when it’s right",
            "author": "Snoo_72748",
            "id": "ijlrjmr",
            "parent_id": "t1_ijlqx7k",
            "score": 1,
            "created_utc": 1660065376.0,
            "replies": [
                {
                    "body": "It can happen but the odds are too slim for most gals to even think it will.",
                    "author": null,
                    "id": "ijlsmkz",
                    "parent_id": "t1_ijlrjmr",
                    "score": 1,
                    "created_utc": 1660065774.0,
                    "replies": [
                        {
                            "body": "May the odds be ever in your favor!",
                            "author": "Snoo_72748",
                            "id": "ijlukus",
                            "parent_id": "t1_ijlsmkz",
                            "score": 3,
                            "created_utc": 1660066492.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Absolutely loving your positivity. I’m happy I shared! This is just meant to be uplifting for all of the SB’s and especially women of color. We are told your not enough and you can’t do this. I’ve encountered it in the high upscale restaurants and hotels but guess what? My 3 carat ring let’s them know. I want to continue to push the boundaries. It is 2022 after all",
            "author": "Snoo_72748",
            "id": "ijlttgn",
            "parent_id": "t1_ijlsi7n",
            "score": 9,
            "created_utc": 1660066210.0,
            "replies": [
                {
                    "body": "Ohh yasss flash that ring!!",
                    "author": "FructoseLady",
                    "id": "ijmipk3",
                    "parent_id": "t1_ijlttgn",
                    "score": 2,
                    "created_utc": 1660075545.0,
                    "replies": [
                        {
                            "body": "Thank you girl! I gotta admit it’s a pretty nice diamond ring.",
                            "author": "Snoo_72748",
                            "id": "ijmlcb3",
                            "parent_id": "t1_ijmipk3",
                            "score": 2,
                            "created_utc": 1660076566.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Brah I really look at all the strong people I know who had kids young with partners they werent imagining the would stay with and honestly there doesnt seem to be a correlation between that and doing poorly in life",
            "author": "JDMultralight",
            "id": "ijmtxj5",
            "parent_id": "t1_ijmr2qj",
            "score": 2,
            "created_utc": 1660079893.0,
            "replies": []
        },
        {
            "body": "It can happen but the odds are too slim for most gals to even think it will.",
            "author": null,
            "id": "ijlsmkz",
            "parent_id": "t1_ijlrjmr",
            "score": 1,
            "created_utc": 1660065774.0,
            "replies": [
                {
                    "body": "May the odds be ever in your favor!",
                    "author": "Snoo_72748",
                    "id": "ijlukus",
                    "parent_id": "t1_ijlsmkz",
                    "score": 3,
                    "created_utc": 1660066492.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Ohh yasss flash that ring!!",
            "author": "FructoseLady",
            "id": "ijmipk3",
            "parent_id": "t1_ijlttgn",
            "score": 2,
            "created_utc": 1660075545.0,
            "replies": [
                {
                    "body": "Thank you girl! I gotta admit it’s a pretty nice diamond ring.",
                    "author": "Snoo_72748",
                    "id": "ijmlcb3",
                    "parent_id": "t1_ijmipk3",
                    "score": 2,
                    "created_utc": 1660076566.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "May the odds be ever in your favor!",
            "author": "Snoo_72748",
            "id": "ijlukus",
            "parent_id": "t1_ijlsmkz",
            "score": 3,
            "created_utc": 1660066492.0,
            "replies": []
        },
        {
            "body": "Thank you girl! I gotta admit it’s a pretty nice diamond ring.",
            "author": "Snoo_72748",
            "id": "ijmlcb3",
            "parent_id": "t1_ijmipk3",
            "score": 2,
            "created_utc": 1660076566.0,
            "replies": []
        }
    ]
}