{
    "title": "Expectations for SB’s.",
    "post_id": "t5ycmt",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/t5ycmt/expectations_for_sbs/",
    "author": "bubblerush",
    "body": "Ladies, I say this in a very nonjudgmental way, raise your standards. Have higher expectations for these men. Not every man is meant to be a SD, not every man has the means to but unfortunately they still try, and those are the majority of the men you’ll meet in sugar dating. It’s doing everyone a disservice, not only do you deserve better but it lowers the amount of effort they feel that they need to put in overall. If there’s a girl that’s going to accept the bare minimum, why would they do any better? This is all my personal opinion of course but these are the things he should be providing at a minimum.. \n\n\n1. He should cover your rent (at the very least).\n\n2. He should be buying you gifts, big or small, at least once a month. Bags, flowers, jewelry, vacations, or sending you to the nail salon. It doesn’t always need to be pricey but it should be something. \n\n3. He should still cover your expenses if an emergency comes up and you can’t see him for a week or two (obviously depending on how long you’ve been seeing each other).\n\n4. He needs to respect your boundaries. If it’s not something you want to do, he shouldn’t push you. \n\n5. He should never bring you to a cheap hotel or expect you to welcome him into your apartment if you’re not comfortable with it. \n\nThis is a sugar relationship, not a vanilla relationship. As SB’s we put in a lot of effort to look good, be cheerful, make these men happy, and let’s be honest it’s a lot more work than a vanilla relationship and it’s usually with someone that we wouldn’t date normally. Don’t forget that this is “mutually beneficial,” these men are gaining a lot from these relationships and you should be gaining something from them too.",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/t5ycmt/expectations_for_sbs/",
    "score": 307,
    "upvote_ratio": 0.83,
    "created_utc": 1646332528.0,
    "num_comments": 186,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "This makes sense, I was perplexed when I was getting messages from guys being on the lower end of things. I didn’t understand it",
            "author": null,
            "id": "hz8oj0g",
            "parent_id": "t3_t5ycmt",
            "score": 34,
            "created_utc": 1646346042.0,
            "replies": []
        },
        {
            "body": "Gatekeeping posts always amuse me. \n\nLike you OP I'm in favor of a smaller bowl - I wish it was  limited to the wealthier guys and very attractive girls. However, seeking lowered the barriers to entry such that any girl that can set up a profile thinks she has what it takes to be an SB, and any guy that can afford the one-ten monthly fee thinks he has what it takes to be an SD. \n\nAs such, if two people find each other on SA and agree to an arrangement that makes them both happy, even if it doesn't look like an arrangement I would be party too, who am I to judge?",
            "author": "randomSD45",
            "id": "hz81ago",
            "parent_id": "t3_t5ycmt",
            "score": 114,
            "created_utc": 1646336521.0,
            "replies": [
                {
                    "body": "Man this was the same SB telling girls that if they go to budget hotels that they are whores by definition. \n\n I took offense to this because my SB’s agenda is to assure that my whole budget for her goes to her ppm - I dont take kindly to some superior moron unfavorably defining the most beloved woman in my life.  She’s my heart.",
                    "author": "JDMultralight",
                    "id": "hz90exk",
                    "parent_id": "t1_hz81ago",
                    "score": 34,
                    "created_utc": 1646351129.0,
                    "replies": [
                        {
                            "body": "How did u guys meet?",
                            "author": "beswelly",
                            "id": "hz9pdb5",
                            "parent_id": "t1_hz90exk",
                            "score": 1,
                            "created_utc": 1646362913.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "What I find most funny about posts like these is the people that make these posts would almost assuredly be left out of the smaller, more exclusive bowl that their suggestions would create. I wonder if their opinion would change then?",
                    "author": "storm170",
                    "id": "hz83862",
                    "parent_id": "t1_hz81ago",
                    "score": 30,
                    "created_utc": 1646337281.0,
                    "replies": [
                        {
                            "body": "I hear you man. In an ideal world the bowl would just be me and Selena Gomez. And then where would OP be? Pretty sure she didn't take THAT into consideration.\n\nUnless OP IS Selena Gomez. In which case bring it on.",
                            "author": "ChapterRelative",
                            "id": "hz8phjr",
                            "parent_id": "t1_hz83862",
                            "score": 15,
                            "created_utc": 1646346442.0,
                            "replies": [
                                {
                                    "body": "Selena Gomez would be my SM, that lady earns.",
                                    "author": "storm170",
                                    "id": "hz8qz5b",
                                    "parent_id": "t1_hz8phjr",
                                    "score": 14,
                                    "created_utc": 1646347072.0,
                                    "replies": [
                                        {
                                            "body": "She'd be your SB if you were any kind of SD.",
                                            "author": "ChapterRelative",
                                            "id": "hz97myd",
                                            "parent_id": "t1_hz8qz5b",
                                            "score": 0,
                                            "created_utc": 1646354314.0,
                                            "replies": [
                                                {
                                                    "body": "She out earns this entire forum, what are we offering her that she doesn't already have for herself?",
                                                    "author": "storm170",
                                                    "id": "hz9b120",
                                                    "parent_id": "t1_hz97myd",
                                                    "score": 25,
                                                    "created_utc": 1646355935.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Omg that’s fucking hilarious 😆",
                            "author": "wb19081908",
                            "id": "hz8jgzb",
                            "parent_id": "t1_hz83862",
                            "score": -1,
                            "created_utc": 1646343879.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "100 up votes.",
                    "author": "southernslick",
                    "id": "hz8o2qc",
                    "parent_id": "t1_hz81ago",
                    "score": 3,
                    "created_utc": 1646345855.0,
                    "replies": []
                },
                {
                    "body": "What’s SA? And why do I keep getting scammed and can’t find anyone serious besides like “knock off SD” had a good one and he was killed. Just got over him and trying to do it again.",
                    "author": "beswelly",
                    "id": "hz9pb5i",
                    "parent_id": "t1_hz81ago",
                    "score": 0,
                    "created_utc": 1646362883.0,
                    "replies": []
                },
                {
                    "body": "Exactly",
                    "author": "nwa747",
                    "id": "hz89ldd",
                    "parent_id": "t1_hz81ago",
                    "score": -1,
                    "created_utc": 1646339789.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "> He should cover your rent (at the very least)\n\nI wouldn't suggest any SB rely on a sugar relationship for her rent, since the relationship could go sideways at any point and end.",
            "author": "Y_4Z44",
            "id": "hz7s3v3",
            "parent_id": "t3_t5ycmt",
            "score": 38,
            "created_utc": 1646332937.0,
            "replies": [
                {
                    "body": "Completely agree, but if it’s an actual sugar relationship a SD should want to genuinely support his SB.",
                    "author": "bubblerush",
                    "id": "hz7sgc2",
                    "parent_id": "t1_hz7s3v3",
                    "score": 8,
                    "created_utc": 1646333071.0,
                    "replies": [
                        {
                            "body": "Why are \"covering rent\" and \"genuinely support\" synonymous to you?",
                            "author": null,
                            "id": "hz7uhog",
                            "parent_id": "t1_hz7sgc2",
                            "score": 23,
                            "created_utc": 1646333853.0,
                            "replies": [
                                {
                                    "body": "I could be wrong but I think she’s just trying to showcase a dollar value, not the actual of paying the rent per se",
                                    "author": "Cdnsugarr",
                                    "id": "hz8ci4w",
                                    "parent_id": "t1_hz7uhog",
                                    "score": 23,
                                    "created_utc": 1646340927.0,
                                    "replies": []
                                },
                                {
                                    "body": "Yes this is weird outlook.\n\n“He should provide a level of support that makes you feel, comfortable, appreciated and wanted.”\n\nNot “cover my rent”.",
                                    "author": null,
                                    "id": "hz870ya",
                                    "parent_id": "t1_hz7uhog",
                                    "score": 8,
                                    "created_utc": 1646338775.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I think the author misses the mark on the issue of expectations with the exception respecting boundaries.  \n\nEach person brings tangible and intangible benefits to the relationship. The essence of a successful relationship is where both parties are feel that the relationship is beneficial in its totality. The value placed on the allowance by the SB is what balances what each brings. \n\nYes, if the SD is an \"arm candy addict\" in order to impress others it can be a lot of work.  But I think that is the exception to the rule.",
            "author": "pinotandsugar",
            "id": "hz9lv1b",
            "parent_id": "t3_t5ycmt",
            "score": 7,
            "created_utc": 1646361030.0,
            "replies": []
        },
        {
            "body": "I totally get your point. But the issue is in reality, most SBs won't be able to attain an SD like this unless they are extremely attractive. So for an \"average\" SB, would you recommend they compromise on some of these things, keep trying until they do find an SD like this, or just leave the bowl entirely?",
            "author": "jasonbogd62",
            "id": "hz7tmh0",
            "parent_id": "t3_t5ycmt",
            "score": 40,
            "created_utc": 1646333518.0,
            "replies": [
                {
                    "body": "I completely agree to this. \n\nLevel of attractiveness, the ability to hold conversations, intelligence, availability in terms of hours etc play a big role. Trying to apply minimum standards may lead to not finding SD.",
                    "author": "iamdesi60",
                    "id": "hz84f95",
                    "parent_id": "t1_hz7tmh0",
                    "score": 22,
                    "created_utc": 1646337754.0,
                    "replies": [
                        {
                            "body": "Yeah I second this. I can only speak from my personal experience but I was younger, prettier, and thinner when I first jumped into the bowl but I didn't make nearly as much or find the serious whales. I think that was because I didn't know how to navigate the bowl. I made a lot more (money, gifts, luxury vacations, etc...) when I figured out how to find the sugar and fend off the salt even though I had gained about 15lbs (wasn't fat or anything but not as thin as I had been) and I was in my late 20s at that point. Even now I've jumped back in the bowl and made quite a bit and have a few very promising potential SDs. So what I'm saying is that you don't have to be the most attractive, or the smartest to get the best daddies BUT you do need to know how to navigate the bowl. Figuring out how to make it work for you and also being decently attractive and intelligent, will go a long way in finding what you're looking for in sugar dating.",
                            "author": "sbxox10",
                            "id": "hz91qol",
                            "parent_id": "t1_hz84f95",
                            "score": 17,
                            "created_utc": 1646351699.0,
                            "replies": []
                        },
                        {
                            "body": "Agreed! \n\nAll SDs are not same and all SBs are not same. Also various locations have various availability of SDs and SBs. Trying to put some minimum expectations in SBs minds is not going to work!",
                            "author": "married_n_bored",
                            "id": "hz85q5a",
                            "parent_id": "t1_hz84f95",
                            "score": 6,
                            "created_utc": 1646338265.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "There’s statistically more attractive women in the world than wealthy men so like…….",
                    "author": "sienfiekdsa",
                    "id": "hz9ric5",
                    "parent_id": "t1_hz7tmh0",
                    "score": 8,
                    "created_utc": 1646363939.0,
                    "replies": [
                        {
                            "body": "That's the point.",
                            "author": null,
                            "id": "hz9vnnm",
                            "parent_id": "t1_hz9ric5",
                            "score": 3,
                            "created_utc": 1646365953.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Most women are not fit to be a SB. I think it would be best if they leave the bowl entirely, though I think the OP would suggest that they should stay in and demand the same things that actual SBs deserve.\n\nI don't sense a lot of mutually beneficial thinking coming from this post/poster.",
                    "author": "storm170",
                    "id": "hz81tj0",
                    "parent_id": "t1_hz7tmh0",
                    "score": 18,
                    "created_utc": 1646336729.0,
                    "replies": [
                        {
                            "body": "I agree with you. I feel like a lot of times they create more problems than solve.",
                            "author": "SatansBirthdayCake",
                            "id": "hz9ezxp",
                            "parent_id": "t1_hz81tj0",
                            "score": 4,
                            "created_utc": 1646357781.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "If only there were more guys like this. Unfortunately, these are rare daddys!",
            "author": "PillowPrincessB",
            "id": "hz8nc61",
            "parent_id": "t3_t5ycmt",
            "score": 26,
            "created_utc": 1646345544.0,
            "replies": [
                {
                    "body": "that’s because only so many men have that type of money and they already have the top 1% of women as SB\n\nThat’s the problem with modern society every women thinks she deserves a 6’ handsome guy that makes over 6 figures, and most don’t have what it takes to get that",
                    "author": "NickPfromYuma",
                    "id": "hz8rvp1",
                    "parent_id": "t1_hz8nc61",
                    "score": 21,
                    "created_utc": 1646347455.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "hz87kh7",
            "parent_id": "t3_t5ycmt",
            "score": 23,
            "created_utc": 1646338986.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "hz9q50j",
                    "parent_id": "t1_hz87kh7",
                    "score": -1,
                    "created_utc": 1646363278.0,
                    "replies": [
                        {
                            "body": "that's what they're telling you",
                            "author": null,
                            "id": "hz9v882",
                            "parent_id": "t1_hz9q50j",
                            "score": 6,
                            "created_utc": 1646365743.0,
                            "replies": []
                        },
                        {
                            "body": "And I know a bunch of dudes who have sex with beautiful women FOR FREE!  Incredible, isn’t it?",
                            "author": "57hz",
                            "id": "hz9vi0q",
                            "parent_id": "t1_hz9q50j",
                            "score": 6,
                            "created_utc": 1646365875.0,
                            "replies": []
                        },
                        {
                            "body": "What?",
                            "author": "Chill_SD1974",
                            "id": "hz9waw6",
                            "parent_id": "t1_hz9q50j",
                            "score": 2,
                            "created_utc": 1646366272.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Damn, I guess I’m doing it wrong haha.\n\n“Mature” SB here (28) and that’s not what I’m here for at all. Yes, support is an important part of a sugar relationship, but mine have more so been based on mutual attraction and chemistry than “what can I financially offer you.”\n\nI think the beauty of a SR for me is also that it’s not a full-time, vanilla relationship with all the hang ups, drama, and stress. Maybe I’m sounding like a SD, but I *like* the NSA, low key elements of SR. I like the mutual agreement to be mature, direct, and not play any games. \n\nCaptivate me intellectually, help me build my investment/saving portfolio, click intimately. That’s more or less what I’m about, not being “spoiled” per se.\n\nI also realize I’m in the unique position of being financially secure. I can pay my own damn rent, buy myself the material things I want, etc. I’m looking for a low key partner who I vibe with and offers some capacity of support.",
            "author": null,
            "id": "hz832h4",
            "parent_id": "t3_t5ycmt",
            "score": 41,
            "created_utc": 1646337217.0,
            "replies": [
                {
                    "body": "I’m in this same boat of being “mature” (26) and being able to pay my own rent and I’m financially secure. At this point, the money is to get ahead, not stay afloat. \n\nI also look for more of an emotional and intellectual connection with no BS. If vanilla dating were like SR dating in that there isn’t the drama, the games, etc, I’d probably be married by now. Alas. \n\nI can compromise a bit on my financial ask if it means I’m getting a quality person. A lot of SBs don’t realize that the real good gains (like any investment) are in the long game. I don’t need or even want to be spoiled (though it is a wonderful bonus); I want to be treated like a lady and enjoy his time and enjoy his intellect. \n\nThe money doesn’t make a man any more attractive to me, it just gets him in the door. Even if he meets my financial ask, if he’s rude the wait staff, chews with his mouth open, or talks down to me, I’m out.",
                    "author": "SatansBirthdayCake",
                    "id": "hz8vceg",
                    "parent_id": "t1_hz832h4",
                    "score": 20,
                    "created_utc": 1646348921.0,
                    "replies": []
                },
                {
                    "body": "If you want to learn how too yolo investments like a WSB retard… im here for you lol.",
                    "author": "JamesGarrison",
                    "id": "hz86698",
                    "parent_id": "t1_hz832h4",
                    "score": 0,
                    "created_utc": 1646338439.0,
                    "replies": [
                        {
                            "body": "What? I’m thinking your smart ass comment backfired with too many typos…",
                            "author": "Kevinburnz",
                            "id": "hz8bexm",
                            "parent_id": "t1_hz86698",
                            "score": 8,
                            "created_utc": 1646340501.0,
                            "replies": [
                                {
                                    "body": "I was an active participant in wallstreetbets. A subreddit. Typos and calling yourself retarded is kinda the thing there. She mentioned wanting portfolio advice. That’s actually one thing I’m great at and also terrible at. Like losing a quarter million a week ago in a stupid options bet.",
                                    "author": "JamesGarrison",
                                    "id": "hz8cpbr",
                                    "parent_id": "t1_hz8bexm",
                                    "score": 4,
                                    "created_utc": 1646341007.0,
                                    "replies": [
                                        {
                                            "body": "Gotcha lol. I feel you. I’m great at picking good investments. They are the ones I don’t go into…",
                                            "author": "Kevinburnz",
                                            "id": "hz8cyhe",
                                            "parent_id": "t1_hz8cpbr",
                                            "score": 7,
                                            "created_utc": 1646341107.0,
                                            "replies": [
                                                {
                                                    "body": "Because If YOU go into… the opposite happens. A felllow retard. Hello friend.",
                                                    "author": "JamesGarrison",
                                                    "id": "hz8d8rz",
                                                    "parent_id": "t1_hz8cyhe",
                                                    "score": 0,
                                                    "created_utc": 1646341217.0,
                                                    "replies": [
                                                        {
                                                            "body": "Greetings. See you at the crypto rally 😜",
                                                            "author": "Kevinburnz",
                                                            "id": "hz8dnlk",
                                                            "parent_id": "t1_hz8d8rz",
                                                            "score": 3,
                                                            "created_utc": 1646341380.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Winter is coming…",
                                                                    "author": "JamesGarrison",
                                                                    "id": "hz8dt2w",
                                                                    "parent_id": "t1_hz8dnlk",
                                                                    "score": 1,
                                                                    "created_utc": 1646341445.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "If you’re out, I’m in bro 😂😂\n\nI agree with you tho, winter is coming. Good year for accumulating..",
                                                                            "author": "Intelli_gent_0601",
                                                                            "id": "hz8euax",
                                                                            "parent_id": "t1_hz8dt2w",
                                                                            "score": 2,
                                                                            "created_utc": 1646341872.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "This",
                    "author": "Kevinburnz",
                    "id": "hz864u9",
                    "parent_id": "t1_hz832h4",
                    "score": -1,
                    "created_utc": 1646338423.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "hz85ai2",
            "parent_id": "t3_t5ycmt",
            "score": 20,
            "created_utc": 1646338095.0,
            "replies": [
                {
                    "body": "This is the bare minimum for a vanilla relationship or just general human decency. I think that the standards for a SR should be all those things and them some.",
                    "author": "zara_io",
                    "id": "hz8fzhu",
                    "parent_id": "t1_hz85ai2",
                    "score": 27,
                    "created_utc": 1646342337.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "hz8hxgj",
                            "parent_id": "t1_hz8fzhu",
                            "score": 0,
                            "created_utc": 1646343221.0,
                            "replies": [
                                {
                                    "body": "That doesn’t change the valid point that was made about how the standards should be. What women and SBs decide to accept is another matter.  Obviously everything said comes with nuance and other factors to consider, but I personally don’t accept any SR that doesn’t ascribe to those standards. I will say I also don’t sugar out of desperation, which will change what SBs will accept. But even if I was desperate, I personally would not use sugaring as the means to rectify it because it’s too easy to get exploited.",
                                    "author": "zara_io",
                                    "id": "hz8odvi",
                                    "parent_id": "t1_hz8hxgj",
                                    "score": 5,
                                    "created_utc": 1646345983.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "What is a vanilla relationship?",
                            "author": "beswelly",
                            "id": "hz9qask",
                            "parent_id": "t1_hz8fzhu",
                            "score": -1,
                            "created_utc": 1646363357.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Yeah. Guys like this don't tip and abuse women. He didn't mention a single thing about her emotional needs.",
                    "author": "notnoteworthyatall",
                    "id": "hz9c0pn",
                    "parent_id": "t1_hz85ai2",
                    "score": 2,
                    "created_utc": 1646356395.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "The majority of this post was about sticking to your boundaries as a SB and making sure that you’re with someone who cares about you. The fact that so many “SD’s” are upset by this is really concerning to me.",
            "author": "bubblerush",
            "id": "hz7wajd",
            "parent_id": "t3_t5ycmt",
            "score": 19,
            "created_utc": 1646334556.0,
            "replies": [
                {
                    "body": "The responses are very telling. I’m a tiny bit surprised also, lol.",
                    "author": null,
                    "id": "hz8sr0w",
                    "parent_id": "t1_hz7wajd",
                    "score": 10,
                    "created_utc": 1646347822.0,
                    "replies": []
                },
                {
                    "body": "You could have made the post to reflect that priority but you didn't. Your first two points said the SD should always pay rent and send you to the nail salon and on vacations.\n\nYou should have boundaries and stick to them, but that's not where you decided to focus your attention. Nobody is disagreeing that having boundaries is a bad thing. Nobody is going to say that a man should be allowed to disrespect your boundaries.",
                    "author": "bigdickginger",
                    "id": "hz7xr72",
                    "parent_id": "t1_hz7wajd",
                    "score": 16,
                    "created_utc": 1646335129.0,
                    "replies": [
                        {
                            "body": "If a SD isn’t treating you every once in awhile and caring for your needs what’s the point? Why don’t SB’s find young attractive men to spend time with, and if SD’s don’t want to support their partners why don’t they jump on Eharmony or Ashleymadison and find someone their own age who won’t have these expectations? You want a young attractive woman, why should she want you?",
                            "author": "bubblerush",
                            "id": "hz7yg4o",
                            "parent_id": "t1_hz7xr72",
                            "score": 12,
                            "created_utc": 1646335398.0,
                            "replies": [
                                {
                                    "body": "Even now you're not making an argument about safety or boundaries.\n\nI'm not even sure what you are arguing here. It's not your place to dictate why other women want to have sugar relationships.",
                                    "author": "bigdickginger",
                                    "id": "hz80j0v",
                                    "parent_id": "t1_hz7yg4o",
                                    "score": 13,
                                    "created_utc": 1646336219.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "I haven't seen anyone \"upset\".  You're equating challenges to your idea as emotional distress.\n\nYou're receiving challenges because your idea would destroy the market and hurt everyone in the process.",
                    "author": null,
                    "id": "hz8031f",
                    "parent_id": "t1_hz7wajd",
                    "score": 4,
                    "created_utc": 1646336042.0,
                    "replies": []
                },
                {
                    "body": "People here are not upset at all. You hang around in echo chambers so much that any neutrally thought out argument is upsetting *you*.",
                    "author": "YlangScent",
                    "id": "hz9810l",
                    "parent_id": "t1_hz7wajd",
                    "score": 4,
                    "created_utc": 1646354492.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "The girls that can make those demands and get them… are already getting them.  \n\nNow if what they Marketplace is willing to give you is not acceptable to you… stick with a day job.",
            "author": "LotBuilder",
            "id": "hz844fg",
            "parent_id": "t3_t5ycmt",
            "score": 18,
            "created_utc": 1646337636.0,
            "replies": []
        },
        {
            "body": "Let's hypothetically say that all SBs all of a sudden made your bullet points their own line-in-the-sand standard.\n\nFirst, most SBs on seeking don't even find an SD, so they get nothing.  With your standards, even fewer would find one (practically none, as the SBs getting your treatment are top 1% - 5%).\n\nYour standards would NOT make SDs become wealthier, so the number of eligible SDs would shrink by a lot (it's already a very small number).\n\nYou're delusional if you think SBs control the market and get to set the standard.   Sorry but power is where the money is, in this equation.  \n\nSBs will continue to accept offers below yours because humans vary on personal needs and desires.  \n\nPop your solipsistic bubble and realize that the bowl is an amorphous spectrum of value exchange. \n\nIf you really want to help other SBs, help them be safe and not get scammed, that is where they are being hurt the most.  \n\nIf they are happy with their sugar, it doesn't matter what or how much it is.",
            "author": null,
            "id": "hz7zf7j",
            "parent_id": "t3_t5ycmt",
            "score": 23,
            "created_utc": 1646335783.0,
            "replies": [
                {
                    "body": "This is actually reading a lot like that popular tinder post a week or so ago. Talking about outlandish expectations. When In fact most people are average.",
                    "author": "JamesGarrison",
                    "id": "hz86km5",
                    "parent_id": "t1_hz7zf7j",
                    "score": 12,
                    "created_utc": 1646338597.0,
                    "replies": [
                        {
                            "body": "90% of the population is undatable!",
                            "author": "Kevinburnz",
                            "id": "hz8bru9",
                            "parent_id": "t1_hz86km5",
                            "score": 1,
                            "created_utc": 1646340642.0,
                            "replies": [
                                {
                                    "body": "Thanks Jerry.",
                                    "author": "BinghamtonSD",
                                    "id": "hz8pfoy",
                                    "parent_id": "t1_hz8bru9",
                                    "score": 1,
                                    "created_utc": 1646346419.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "tinder on reddit or some sort of official tinder blog?",
                            "author": "newtexansd",
                            "id": "hz8s3nw",
                            "parent_id": "t1_hz86km5",
                            "score": 1,
                            "created_utc": 1646347546.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "I bring this up occasionally when posts like this are made, the OP is (probably unknown to her) suggesting an artificial price floor and has no idea that her suggestion ends up hurting far more SBs than the SDs she is targeting.\n\nIt's simple economics, and whether you want it to or not economics impacts anything that deals with money. Sugaring included.",
                    "author": "storm170",
                    "id": "hz82ext",
                    "parent_id": "t1_hz7zf7j",
                    "score": 20,
                    "created_utc": 1646336962.0,
                    "replies": [
                        {
                            "body": "It’s almost like the minimum wage conversation…",
                            "author": null,
                            "id": "hz87c0t",
                            "parent_id": "t1_hz82ext",
                            "score": 5,
                            "created_utc": 1646338893.0,
                            "replies": [
                                {
                                    "body": "Indeed, at least minimum wage can be subsidized by local and federal government. I doubt high end SBs are going to break off a piece of their allowances to take care of all the SBs forced out of the market due to the gatekeeping the OP is asking for.",
                                    "author": "storm170",
                                    "id": "hz87m0z",
                                    "parent_id": "t1_hz87c0t",
                                    "score": 10,
                                    "created_utc": 1646339003.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "It could ultimately result in seeking going out of business and relegating sugar to just freestyling.",
                            "author": null,
                            "id": "hz88l1o",
                            "parent_id": "t1_hz82ext",
                            "score": 2,
                            "created_utc": 1646339387.0,
                            "replies": [
                                {
                                    "body": "Which would reduce the number of successful SBs to a fraction of their current numbers, increasing the number of SBs negatively impacted by her suggestions.\n\nApparently, she just hates other SBs and wants to see them fail in greater numbers than they already do.",
                                    "author": "storm170",
                                    "id": "hz88wg2",
                                    "parent_id": "t1_hz88l1o",
                                    "score": 4,
                                    "created_utc": 1646339514.0,
                                    "replies": [
                                        {
                                            "body": "Yeah, it's the classic SB gets lowballed and wants to rant about it and blame all SDs instead of accept the rejection.",
                                            "author": null,
                                            "id": "hz89db4",
                                            "parent_id": "t1_hz88wg2",
                                            "score": 3,
                                            "created_utc": 1646339701.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Rent and a trip to the nail salon shouldn’t break the bank. I agree it would reduce the amount of “SD’s” because as I said, not all men are meant to be SD’s.",
                    "author": "bubblerush",
                    "id": "hz800ht",
                    "parent_id": "t1_hz7zf7j",
                    "score": 12,
                    "created_utc": 1646336014.0,
                    "replies": [
                        {
                            "body": "and ultimately a lot less women would get to be SB with your proposal. Many of these women are girls next door, not insta models. they’re not looking for designer anything, some just want help with rent, tuition or some just want to be able to afford to spoil themselves.\n\nThe other problem with your proposal is that is it sounds a lot like a traditional sugar relationship with an emotional connection. Many SB some want that and want to keep it NSA. Manny would have no interest in the time involved it would take to have that type of sugar relationship. Because no real SD would give all that for a structured 1 date a week arrangement. You’re talking about being a sugar girlfriend with multiple dates a week, traveling together, etc. Most women that join the bowl won’t invest into a relationship enough to even be worthy of your expectations",
                            "author": "NickPfromYuma",
                            "id": "hz8pue4",
                            "parent_id": "t1_hz800ht",
                            "score": 8,
                            "created_utc": 1646346592.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Thank you for this post! I had a debate with OP recently about this very thing. Girls like her insist that all SB's should have the same (somewhat ridiculously) high expectations. But you're right... there are only so many SD's to go around, especially when you live in a less populated area like I do. So no, I'm not being spoiled with designer purses and random vacations, but I'm making an extra $XXXX a month sugaring, which I'm not mad at, and getting taken out for dinner, drinks, and lunch several times a week. I'm happy with where I'm at, but according to her I'm not a \"real\" SB because I'm not raking in an arbitrary figure.",
                    "author": "HailToTheQuinn",
                    "id": "hz9ia9y",
                    "parent_id": "t1_hz7zf7j",
                    "score": -2,
                    "created_utc": 1646359291.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "🍿🍿🍿",
            "author": "chemistryromance",
            "id": "hz7ub87",
            "parent_id": "t3_t5ycmt",
            "score": 13,
            "created_utc": 1646333783.0,
            "replies": []
        },
        {
            "body": "I wish there was a way to emphasize that this is your opinion. This list is very specific to you.\n\nI'd like to think that most women in this community are smart and competent enough to know what they want out of a relationship without needing it spelled out for them. \n\nThere is a very vast gap between putting in the bare minimum effort and paying you an allowance to cover your rent and sending you on vacations. You're being very judgemental and condescending to women that don't expect as much yet have still consider their relationships successful and a positive impact on their life.",
            "author": "bigdickginger",
            "id": "hz7x5bc",
            "parent_id": "t3_t5ycmt",
            "score": 10,
            "created_utc": 1646334890.0,
            "replies": [
                {
                    "body": "As a woman, as a SB, I listen to other SB’s. I know how many other SB’s feel because we talk to each other openly. SD’s normally have no idea how these women are feeling because we don’t normally voice our opinions on sugar relationships to SD’s.",
                    "author": "bubblerush",
                    "id": "hz7xmxp",
                    "parent_id": "t1_hz7x5bc",
                    "score": 8,
                    "created_utc": 1646335083.0,
                    "replies": [
                        {
                            "body": "Then your sugar relationship is not very good if you can't communicate your expectations like adults. This is a \"you\" problem not an \"all SDs\" problem.",
                            "author": "bigdickginger",
                            "id": "hz7y6p4",
                            "parent_id": "t1_hz7xmxp",
                            "score": 21,
                            "created_utc": 1646335296.0,
                            "replies": [
                                {
                                    "body": "I communicate with my SD, but many women are uncomfortable with communicating these things. This post isn’t just my viewpoint, this is what most SB’s want from their relationships.",
                                    "author": "bubblerush",
                                    "id": "hz7yqns",
                                    "parent_id": "t1_hz7y6p4",
                                    "score": 4,
                                    "created_utc": 1646335515.0,
                                    "replies": [
                                        {
                                            "body": "Again. That's not a problem responsible adults have in their intimate relationships. If a woman can't communicate her needs in the context of her own relationships then that is a sign that she isn't ready for a real relationship and your little bullet list isn't doing anyone any favors in that scenario.\n\nThis is true for men as well. Communication is key for everyone.",
                                            "author": "bigdickginger",
                                            "id": "hz80y00",
                                            "parent_id": "t1_hz7yqns",
                                            "score": 13,
                                            "created_utc": 1646336383.0,
                                            "replies": [
                                                {
                                                    "body": "18-19 year old girls aren’t typically reasonable adults. They’re teenagers and there’s a lot of them in these relationships. It might come as a shock to you but teenage girls sometime have a hard time communicating with grown men.",
                                                    "author": "bubblerush",
                                                    "id": "hz81c2z",
                                                    "parent_id": "t1_hz80y00",
                                                    "score": 2,
                                                    "created_utc": 1646336539.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I think most ladies are smart enough to figure out on their own what constitutes a successful arrangement without your list of things that must be provided. Of course, I could be wrong.",
            "author": "AFSMSgt",
            "id": "hz7ru7t",
            "parent_id": "t3_t5ycmt",
            "score": 19,
            "created_utc": 1646332835.0,
            "replies": [
                {
                    "body": "Unfortunately a lot of very young women, teenagers even, are getting into sugar relationships not knowing what to expect. Young women are getting taken advantage of, getting hurt because they’re going into this blind.",
                    "author": "bubblerush",
                    "id": "hz7uhu8",
                    "parent_id": "t1_hz7ru7t",
                    "score": 12,
                    "created_utc": 1646333854.0,
                    "replies": [
                        {
                            "body": "I agree, especially if they have never had sex before.",
                            "author": "Ghostkittiee",
                            "id": "hz802g6",
                            "parent_id": "t1_hz7uhu8",
                            "score": 7,
                            "created_utc": 1646336035.0,
                            "replies": []
                        },
                        {
                            "body": "I agree. I mean most 18 year olds think about themselves and Starbucks and fake boobs… hardly a fun setup for SD when most people at that age are pretty self absorbed ( from both sides )",
                            "author": "Gold_Honeydew9577",
                            "id": "hz82n39",
                            "parent_id": "t1_hz7uhu8",
                            "score": 0,
                            "created_utc": 1646337051.0,
                            "replies": [
                                {
                                    "body": "Yes.. because they’re teenagers that shouldn’t be sugar dating in all honesty. Spend time with a child and expect them to act like a child.",
                                    "author": "bubblerush",
                                    "id": "hz832ea",
                                    "parent_id": "t1_hz82n39",
                                    "score": 19,
                                    "created_utc": 1646337216.0,
                                    "replies": [
                                        {
                                            "body": "Bang on - pretty tough to expect a janitor to act like an astronaught, so not sure why dudes expect young inexperienced girls to act full of class and sophistication either. \n\nPeople need to go in with their eyes wide open and not be salty if/when it doesn’t work out...",
                                            "author": "Intelli_gent_0601",
                                            "id": "hz8g4hx",
                                            "parent_id": "t1_hz832ea",
                                            "score": 10,
                                            "created_utc": 1646342394.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "I set the floor at 22.  I Prefer 25.  Every year I’ll see some stunning 19 year old and I’ll go to a meet and greet and want to claw my eyes out.  They are lovely but not a fit for me",
                                    "author": "LotBuilder",
                                    "id": "hz85wu4",
                                    "parent_id": "t1_hz82n39",
                                    "score": 7,
                                    "created_utc": 1646338338.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Women can mansplain too, even if they couch it as\n\n>I say this in a very nonjudgmental way\n\nWhy do  you feel it necessary to judgmentally lecture on your own narrow view of what other women \"should\" accept?",
            "author": null,
            "id": "hz7tkxh",
            "parent_id": "t3_t5ycmt",
            "score": 19,
            "created_utc": 1646333501.0,
            "replies": [
                {
                    "body": "As I said, this is just my personal opinion and I felt that it needed to be said. A lot of new, young girls are getting into this lifestyle not knowing what a sugar relationship looks like and they’re getting burned because of it. They’re getting taken advantage of because of it.",
                    "author": "bubblerush",
                    "id": "hz7u7sz",
                    "parent_id": "t1_hz7tkxh",
                    "score": 6,
                    "created_utc": 1646333746.0,
                    "replies": [
                        {
                            "body": "And as I said, this is only what a sugar relationship looks like to YOU.\n\nThere is vast distance between a young woman getting \"burned\" and your own definition of what a SR looks like.",
                            "author": null,
                            "id": "hz7unbt",
                            "parent_id": "t1_hz7u7sz",
                            "score": 8,
                            "created_utc": 1646333915.0,
                            "replies": [
                                {
                                    "body": "I personally feel like this is what a sugar relationship should look like to SB’s and SD’s. It’s a relationship, you should care about your partners needs, boundaries, and happiness. If you don’t want to support your partner and care for them then you’re a John and it isn’t a relationship; and if it is a relationship, you’re not a very good partner.",
                                    "author": "bubblerush",
                                    "id": "hz7v7un",
                                    "parent_id": "t1_hz7unbt",
                                    "score": 2,
                                    "created_utc": 1646334135.0,
                                    "replies": [
                                        {
                                            "body": "So I'm a \"john\" if I don't pay her rent?\n\nBeware of Rule 5.",
                                            "author": null,
                                            "id": "hz7wiu8",
                                            "parent_id": "t1_hz7v7un",
                                            "score": 3,
                                            "created_utc": 1646334645.0,
                                            "replies": [
                                                {
                                                    "body": "You’re a John if you have the means to care for your partners basic needs but you choose not to.",
                                                    "author": "bubblerush",
                                                    "id": "hz7wz7n",
                                                    "parent_id": "t1_hz7wiu8",
                                                    "score": 6,
                                                    "created_utc": 1646334825.0,
                                                    "replies": [
                                                        {
                                                            "body": "You're going to have a very bad time here if this is the attitude you have to SRs.",
                                                            "author": "bigdickginger",
                                                            "id": "hz7x8tk",
                                                            "parent_id": "t1_hz7wz7n",
                                                            "score": 4,
                                                            "created_utc": 1646334929.0,
                                                            "replies": [
                                                                {
                                                                    "body": "No, I’m really not. I’ve had two very successful relationships. One lasting two years, and he exceeded these expectations. I’ve had a great time, and I want other women to as well. :)",
                                                                    "author": "bubblerush",
                                                                    "id": "hz7xwhi",
                                                                    "parent_id": "t1_hz7x8tk",
                                                                    "score": 12,
                                                                    "created_utc": 1646335187.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "Your recent \"should I find a new SD\" post suggests otherwise.",
                                                                            "author": null,
                                                                            "id": "hz8jinf",
                                                                            "parent_id": "t1_hz7xwhi",
                                                                            "score": 14,
                                                                            "created_utc": 1646343898.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "Again I’ve had two, and when they don’t meet my expectations I end the relationship. Simple as that.",
                                                                                    "author": "bubblerush",
                                                                                    "id": "hz8jwwq",
                                                                                    "parent_id": "t1_hz8jinf",
                                                                                    "score": 3,
                                                                                    "created_utc": 1646344062.0,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "body": "Hmm, your post history suggests otherwise. You were complaining about your “Clingy” SD who wanted to spend more time with you a month back and the fact that you got him a more expensive gift than what he got you for Christmas",
                                                                            "author": "supportiveceo",
                                                                            "id": "hz886yz",
                                                                            "parent_id": "t1_hz7xwhi",
                                                                            "score": 12,
                                                                            "created_utc": 1646339232.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "What. And you’re a man saying this as if you know better. No trust us, women want what Op said. Period end of story. And if she doesn’t want it, it’s because no one showed her she could have it, she doesn’t know she could have it, so she doesn’t want it *yet.",
                    "author": null,
                    "id": "hz8y4a6",
                    "parent_id": "t1_hz7tkxh",
                    "score": 3,
                    "created_utc": 1646350125.0,
                    "replies": [
                        {
                            "body": "I want a pony.",
                            "author": null,
                            "id": "hz9b49f",
                            "parent_id": "t1_hz8y4a6",
                            "score": 3,
                            "created_utc": 1646355977.0,
                            "replies": []
                        },
                        {
                            "body": "What people want and what people find acceptable are two completely different concepts. Surely you understand that all women would want me to give them millions, but most are completely fine with thousands? \nPeople don't exist to give you whatever you want. Don't be entitled.",
                            "author": "YlangScent",
                            "id": "hz96lcv",
                            "parent_id": "t1_hz8y4a6",
                            "score": 0,
                            "created_utc": 1646353848.0,
                            "replies": [
                                {
                                    "body": "👏👏👏👏.  I feel like you and I have butted heads before, but I'm in complete agreement with you here.",
                                    "author": "HailToTheQuinn",
                                    "id": "hz9g8n9",
                                    "parent_id": "t1_hz96lcv",
                                    "score": 1,
                                    "created_utc": 1646358350.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "hz8m9pk",
            "parent_id": "t3_t5ycmt",
            "score": 11,
            "created_utc": 1646345096.0,
            "replies": [
                {
                    "body": "I am shocked that this is being described as “outrageous” right now.",
                    "author": null,
                    "id": "hz8t2ch",
                    "parent_id": "t1_hz8m9pk",
                    "score": 12,
                    "created_utc": 1646347954.0,
                    "replies": []
                },
                {
                    "body": "I agree. I was thinking I somehow misinterpreted this post based on all the comments challenging what she wrote.",
                    "author": "new_sd_acct",
                    "id": "hz97uw5",
                    "parent_id": "t1_hz8m9pk",
                    "score": 3,
                    "created_utc": 1646354414.0,
                    "replies": []
                },
                {
                    "body": "I didn't necessarily disagree with her points, though the emergency help should have had a qualifier of X months in the SR beforehand, I just found her personality entitled and obnoxious. It makes even reasonable statements or requests harder to consider.",
                    "author": "storm170",
                    "id": "hz9hj2g",
                    "parent_id": "t1_hz8m9pk",
                    "score": 3,
                    "created_utc": 1646358940.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Oof… gatekeeping, arbitrary claims about what money you should be getting given to / spent on you… claiming you magically put in this effort that no other woman in a relationship would! (Great job hating on other women btw 👏) and then the whole “wouldn’t date normally” to round out you proving how transactional it is… but you won’t admit it’s just sex work with extra steps, right?\n\nThis just reads as “squeeze m3n for whatever you can, because we’re better than vanilla women” 🙄🤮",
            "author": "allyafterdark",
            "id": "hz86ms8",
            "parent_id": "t3_t5ycmt",
            "score": 14,
            "created_utc": 1646338620.0,
            "replies": [
                {
                    "body": "But where did she say ANY of that? Anytime someone in this sub suggests SBs should hold men they interact with in the bowl to any sort of expectations, they are bashed for….what, exactly? For encouraging girls to have standards? At the end of the day, if someone nexts you or you next someone else because you don’t agree on what should be apart of a SR, then it is no sweat off your back. These comments are really telling.",
                    "author": "zara_io",
                    "id": "hz8gp6a",
                    "parent_id": "t1_hz86ms8",
                    "score": 15,
                    "created_utc": 1646342630.0,
                    "replies": [
                        {
                            "body": "Literally 👏 read 👏 the 👏 post 👏",
                            "author": "allyafterdark",
                            "id": "hz8hynx",
                            "parent_id": "t1_hz8gp6a",
                            "score": 2,
                            "created_utc": 1646343236.0,
                            "replies": [
                                {
                                    "body": "[removed]",
                                    "author": null,
                                    "id": "hz8npnr",
                                    "parent_id": "t1_hz8hynx",
                                    "score": 2,
                                    "created_utc": 1646345700.0,
                                    "replies": [
                                        {
                                            "body": "I can read, and I’m not the one projecting, but go off, “sweetie” - and take your passive-aggressive misogynist BS with you 💁‍♀️",
                                            "author": "allyafterdark",
                                            "id": "hz8p7l8",
                                            "parent_id": "t1_hz8npnr",
                                            "score": -1,
                                            "created_utc": 1646346324.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Never said we were “better than vanilla women” but we are different. We’re dating men who are typically older and not extremely attractive. We’re not getting the same things that we would in a vanilla relationship. If “SD’s” are essentially offering a vanilla relationship, what’s the appeal?",
                    "author": "bubblerush",
                    "id": "hz8hi3g",
                    "parent_id": "t1_hz86ms8",
                    "score": 7,
                    "created_utc": 1646343016.0,
                    "replies": [
                        {
                            "body": "We all know well how the so called “attractive” men treat you in vanilla and what’s worse is these guys are often not even attractive. \n\nPlus if there were so many fulfilling vanilla relationships why the fuck would ladies even date sugar! We all know, we all know every story there is about the pains and perils of dating loser vanillas.",
                            "author": null,
                            "id": "hz8mtq8",
                            "parent_id": "t1_hz8hi3g",
                            "score": 4,
                            "created_utc": 1646345330.0,
                            "replies": []
                        },
                        {
                            "body": "You claim you “put in a lot of effort to look good, be cheerful, make these men happy […] a lot more work than a vanilla relationship […]”\n\nI’m not saying there’s an appeal, why don’t you try answering what I asked before putting out shitty questions of your own and implying you’re somehow better than women who aren’t SB’s 😬",
                            "author": "allyafterdark",
                            "id": "hz8ib5h",
                            "parent_id": "t1_hz8hi3g",
                            "score": 0,
                            "created_utc": 1646343390.0,
                            "replies": [
                                {
                                    "body": "Again never said that we were better, just different. As a SB there’s more of an expectation, in a vanilla relationship I can show up with no makeup wearing sweatpants. I’m not saying that it’s SW with extra steps but lots of “SD’s” seem to treat it like it is. The whole idea behind sugar relationships is young attractive women dating older wealthy men so that they’re both able to experience things that they wouldn’t normally be able to. Unfortunately men seem to treat sugar relationships like a discount escort service because what their offering wouldn’t get them much from an escort.",
                                    "author": "bubblerush",
                                    "id": "hz8j2p0",
                                    "parent_id": "t1_hz8ib5h",
                                    "score": 9,
                                    "created_utc": 1646343715.0,
                                    "replies": [
                                        {
                                            "body": "It’s implied, I’m not saying you *literally said it in as many words,* you arrogant ass.\n\nLMAO, you think vanilla women turn up to dates and times out in sweatpants?! Are you just a misogynist troll, or are you **actually** that freaking ignorant?! 😂 \n\nNot sure why you insist on repeatedly putting SD in scare quotes, that’s literally the abbreviation they use… 🤷‍♀️ \n\nLiterally not addressing anything *still*, but go off.",
                                            "author": "allyafterdark",
                                            "id": "hz8k8v5",
                                            "parent_id": "t1_hz8j2p0",
                                            "score": 2,
                                            "created_utc": 1646344199.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "“a SB there’s more of an expectation, in a vanilla relationship I can show up with no makeup wearing sweatpants”.\n\nSeems like you have never been in a real sugar relationship! Of course there is a difference between dating loser vanillas and wealthy SDs but don’t tell me a genuine SD won’t mind you showing up more casually in an established sugar relationship.\n\nPlus we all know how you ladies take abuse and try to impress loser vanillas with clothes, makeup and instagram posts.",
                                            "author": null,
                                            "id": "hz8n75j",
                                            "parent_id": "t1_hz8j2p0",
                                            "score": -3,
                                            "created_utc": 1646345487.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "If a woman doesnt like what the bowl has to offer her, she can stick to vanilla dating. \n\nNo one deserves anything. People can want what they want, but if they cant get it, well, they get what they get or they look at the alternate options of what they can get.",
                            "author": "Yo_Mamas_azz",
                            "id": "hz8o43x",
                            "parent_id": "t1_hz8hi3g",
                            "score": -2,
                            "created_utc": 1646345871.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Expectations for a SB:  If you are with the right Sd,  the more you give the more you will get.",
            "author": "LotBuilder",
            "id": "hz864gk",
            "parent_id": "t3_t5ycmt",
            "score": 6,
            "created_utc": 1646338419.0,
            "replies": []
        },
        {
            "body": "When you look/dress like a vogue runway model and perform like a horny pornstar then maybe I'd let you expect this stuff from me.  Truth is most SBs aren't able to make these demands because most just are regular women, and while they're 'hot' in their neighborhood, they're likely average at best compared to the top shelf SBs. I've paid rents, granted RSUs from my company, and much more for some SBs -  but those were literally fantasy girls that come around once every few years.  And definitely not from scrolling on arrangement sites. I'd say sure, have rules for yourself and keep your standards high - but also, know your actual value and dont expect to get treated like a fancy head-turningly hot sex goddess unless you know....you actually are. Otherwise, sit down Karen.",
            "author": "rsteele2121",
            "id": "hz9abmy",
            "parent_id": "t3_t5ycmt",
            "score": 7,
            "created_utc": 1646355550.0,
            "replies": []
        },
        {
            "body": "Free market rules apply here.  It is a win-win situation if a struggling college girl is happy with the allowance/PPM that an SD can provide her even if it's lower than the average in their area.  Who am I to tell them what they should and especially what they shouldn't do?\n\nEstablishing a price cartel will never work in the sugar bowl.",
            "author": "EuropeanDaddyDom",
            "id": "hz8bl1z",
            "parent_id": "t3_t5ycmt",
            "score": 6,
            "created_utc": 1646340569.0,
            "replies": [
                {
                    "body": "Unless they become the OPEC of vagina. This ain’t going to work.",
                    "author": "JamesGarrison",
                    "id": "hz8si39",
                    "parent_id": "t1_hz8bl1z",
                    "score": -2,
                    "created_utc": 1646347716.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "hz7tbi0",
            "parent_id": "t3_t5ycmt",
            "score": 9,
            "created_utc": 1646333402.0,
            "replies": [
                {
                    "body": "As I said “usually.”  Some women find younger, attractive SD’s but that’s the minority. Normally these men are a lot older and there’s not much of a physical attraction. Women that are young and attractive are here because they want a man that can offer them what most men in their age range can’t. Support, mentorship, experiences.",
                    "author": "bubblerush",
                    "id": "hz7tydu",
                    "parent_id": "t1_hz7tbi0",
                    "score": 11,
                    "created_utc": 1646333647.0,
                    "replies": [
                        {
                            "body": "interesting.. i’ve only sugar date women that are attracted to me, want to spend time with me, and actually enjoy having sex with me and ask more… I’ve had age gaps from 20-30 years, and even with a 30 year age gap she couldn’t keep her hands off me. I think you forget how many women are attracted to older more mature men. Not all go for Chads and Fuck boys!",
                            "author": "NickPfromYuma",
                            "id": "hz8qeoz",
                            "parent_id": "t1_hz7tydu",
                            "score": 1,
                            "created_utc": 1646346828.0,
                            "replies": [
                                {
                                    "body": "Or maybe she's a good actress, ah no? Lol I swear you SDs on here are so delusional.",
                                    "author": "Pretty_Ant_3094",
                                    "id": "hz994bm",
                                    "parent_id": "t1_hz8qeoz",
                                    "score": 6,
                                    "created_utc": 1646354986.0,
                                    "replies": []
                                },
                                {
                                    "body": "You might be one of the few gorgeous ones, but the odds are more likely that your SB is simply a great actress and playing her part very well",
                                    "author": "Vegetable-Slip-6245",
                                    "id": "hz9a9bi",
                                    "parent_id": "t1_hz8qeoz",
                                    "score": 4,
                                    "created_utc": 1646355520.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "What nonsense! So you're the authority on exactly what SRs should be? My SB and I have a great relationship which has been working great for ***both*** of us for nearly eight months, yet looks very different from your mandate. How kind of you to let us know that we're doing it all wrong.  🙄",
            "author": null,
            "id": "hz8bwz8",
            "parent_id": "t3_t5ycmt",
            "score": 8,
            "created_utc": 1646340698.0,
            "replies": []
        },
        {
            "body": "I don’t get why some of the guys here are upset about this. This seems reasonable to me.",
            "author": "new_sd_acct",
            "id": "hz7y4of",
            "parent_id": "t3_t5ycmt",
            "score": 12,
            "created_utc": 1646335273.0,
            "replies": [
                {
                    "body": "100% thank you! 💕👏🏼",
                    "author": "bubblerush",
                    "id": "hz7z24t",
                    "parent_id": "t1_hz7y4of",
                    "score": 4,
                    "created_utc": 1646335640.0,
                    "replies": []
                },
                {
                    "body": "The white night has entered into the conversation. :)\n\nI think what OP describes fits some peoples subset of arrangement but not all. It is gatekeeping all other types of arrangements.",
                    "author": null,
                    "id": "hz87p08",
                    "parent_id": "t1_hz7y4of",
                    "score": 2,
                    "created_utc": 1646339036.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Respectfully, who the hell are you to decide and issue an unilateral proclamation of what things \"should be\"?\n\nI must have missed that ballot box day when we all voted to make you the arbiter (read spoiled princess) of all things sugar.",
            "author": "AustinMetz18",
            "id": "hz81kz7",
            "parent_id": "t3_t5ycmt",
            "score": 12,
            "created_utc": 1646336637.0,
            "replies": [
                {
                    "body": "A SB acting like a princess? That’s crazy! It’s almost like that’s the whole point of being a SB.",
                    "author": "bubblerush",
                    "id": "hz81qw4",
                    "parent_id": "t1_hz81kz7",
                    "score": 4,
                    "created_utc": 1646336700.0,
                    "replies": [
                        {
                            "body": "You missed the point by a mile. It's your attitude and view that is the problem. \n\nI treated my last SB like a princess specifically because she DIDN'T act like one. You'll get a lot further ahead if you drop the entitled attitude.",
                            "author": "AustinMetz18",
                            "id": "hz832yj",
                            "parent_id": "t1_hz81qw4",
                            "score": 7,
                            "created_utc": 1646337223.0,
                            "replies": [
                                {
                                    "body": "Believe me in doing just fine. I have my expectations and I only spend time with men who meet them.",
                                    "author": "bubblerush",
                                    "id": "hz839ci",
                                    "parent_id": "t1_hz832yj",
                                    "score": -5,
                                    "created_utc": 1646337293.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Only the salt daddies and “men” who can’t provide some not ALL listed above will get offended and wanna argue with you back and forth \n\nI agree wholeheartedly why be on a site knowing you have to provide for a female and try to penny pinch your way into her panties either go find a escort that’ll take your pennies or actually be a REAL Sd \n\nEveryone has their own take on what it means to be a Sd and it’s generally providing a younger female a enhancing life with your spoilings (money , vacations etc.) through a generous older man in a relationship",
            "author": "Grapefruit-Active",
            "id": "hz877yi",
            "parent_id": "t3_t5ycmt",
            "score": 8,
            "created_utc": 1646338849.0,
            "replies": [
                {
                    "body": "An escort wouldn’t accept their pennies, which is why it’s easier to find young/naive women on seeking.",
                    "author": "bubblerush",
                    "id": "hz8gduc",
                    "parent_id": "t1_hz877yi",
                    "score": 12,
                    "created_utc": 1646342499.0,
                    "replies": [
                        {
                            "body": "I think you’re sadly mistaken young padawan, actually many escorts would except pennies. There are prostitutes for just about every budget 😉",
                            "author": "NickPfromYuma",
                            "id": "hz8r4s7",
                            "parent_id": "t1_hz8gduc",
                            "score": -1,
                            "created_utc": 1646347138.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "hz82jcb",
            "parent_id": "t3_t5ycmt",
            "score": 4,
            "created_utc": 1646337010.0,
            "replies": [
                {
                    "body": "🙋🏼‍♀️I love gifts!! 🛍🎁💐🤩 \nAnd world peace 🌎\nAnd this forum.\nAnd my dog",
                    "author": "BeautyBaby247",
                    "id": "hz86j1v",
                    "parent_id": "t1_hz82jcb",
                    "score": 12,
                    "created_utc": 1646338581.0,
                    "replies": []
                },
                {
                    "body": "Sds should gift at least monthly. But some don’t gift at all… from my own experience.",
                    "author": null,
                    "id": "hz8xoe0",
                    "parent_id": "t1_hz82jcb",
                    "score": 5,
                    "created_utc": 1646349934.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "And not every woman is meant to be an SB.",
            "author": "TheSweetUglyTruth",
            "id": "hz7s19f",
            "parent_id": "t3_t5ycmt",
            "score": 8,
            "created_utc": 1646332909.0,
            "replies": [
                {
                    "body": "Completely agree! But this post isn’t about that. Maybe you can start your own post instead of trying to discredit this one with something that’s off topic.",
                    "author": "bubblerush",
                    "id": "hz7swtb",
                    "parent_id": "t1_hz7s19f",
                    "score": 8,
                    "created_utc": 1646333248.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "In a non-judgmental way, who the fuck voted you the queen of what other people need or want in their relationships?",
            "author": "UseTheForceRey",
            "id": "hz9kj8a",
            "parent_id": "t3_t5ycmt",
            "score": 5,
            "created_utc": 1646360324.0,
            "replies": []
        },
        {
            "body": "You forgot #6... a cheap pair of pants as a Christmas gift",
            "author": "BinghamtonSD",
            "id": "hz8pzfp",
            "parent_id": "t3_t5ycmt",
            "score": 4,
            "created_utc": 1646346652.0,
            "replies": [
                {
                    "body": "Or a used toaster oven 😂",
                    "author": "SatansBirthdayCake",
                    "id": "hz9eoz0",
                    "parent_id": "t1_hz8pzfp",
                    "score": 2,
                    "created_utc": 1646357643.0,
                    "replies": [
                        {
                            "body": "You may be able to put either in a fake Birkin",
                            "author": "BinghamtonSD",
                            "id": "hz9fzyq",
                            "parent_id": "t1_hz9eoz0",
                            "score": 1,
                            "created_utc": 1646358239.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "So true",
                    "author": "bubblerush",
                    "id": "hz8rj0b",
                    "parent_id": "t1_hz8pzfp",
                    "score": 1,
                    "created_utc": 1646347307.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "All the SDs in this throwing a tantrum tickles me. They assume endlessly that SBs have the same thoughts and priorities as they do. I date older men with or without sugar, but most of these girls aren't just into older guys without an incentive.",
            "author": "Equinox_Milk",
            "id": "hz828kf",
            "parent_id": "t3_t5ycmt",
            "score": 7,
            "created_utc": 1646336893.0,
            "replies": [
                {
                    "body": "Criticism of someone's opinion is not the same thing as throwing a tantrum.",
                    "author": "bigdickginger",
                    "id": "hz876bl",
                    "parent_id": "t1_hz828kf",
                    "score": 10,
                    "created_utc": 1646338832.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "The vehement response from the acclaimed “SDs” in this subreddit is exactly why girls need to see this post. And the SBs trying to undermine your point by speaking about how they approach sugaring aren’t much better. Yes, everyone’s SR is different. But the things you mentioned should be the bare minimum. If SBs decide to formulate their SR differently for whatever reason, that is their prerogative. However, SDs should be prepared to offer the things you mentioned at the LEAST. If you can’t (or outright refuse to), then SBs should have a standard set and if they choose to proceed that’s on them.",
            "author": "zara_io",
            "id": "hz8azlx",
            "parent_id": "t3_t5ycmt",
            "score": 8,
            "created_utc": 1646340335.0,
            "replies": []
        },
        {
            "body": "Wow you seem like a real gem. You act like we don't have options with ladies that don't treat us like a bank account only.",
            "author": "SD1070",
            "id": "hz8qoy7",
            "parent_id": "t3_t5ycmt",
            "score": 5,
            "created_utc": 1646346948.0,
            "replies": []
        },
        {
            "body": "It’s so gratifying to see so many SBs disagreeing with the OP because I find this post laughable and offensive. There’s better advice on Tik Tok. Any attempt to give advice should not only have more realistic expectations but also include something about what should be given in return and mention a few other little things like respect and compatibility. And the comparison to vanilla dating is especially offensive because OP is implying that I should cover emergency medical bills for my sugar baby but not for my vanilla girlfriend? That’s pretty fucking cynical.",
            "author": "Kevinburnz",
            "id": "hz8djwj",
            "parent_id": "t3_t5ycmt",
            "score": 6,
            "created_utc": 1646341339.0,
            "replies": []
        },
        {
            "body": "I would add, is she's still in college, the books should be covered at a minimum.",
            "author": "5hallowbutdeep",
            "id": "hz7tkyd",
            "parent_id": "t3_t5ycmt",
            "score": 4,
            "created_utc": 1646333502.0,
            "replies": [
                {
                    "body": "Hold on. Ain’t nobody here that rich.",
                    "author": "JamesGarrison",
                    "id": "hz8spso",
                    "parent_id": "t1_hz7tkyd",
                    "score": 5,
                    "created_utc": 1646347807.0,
                    "replies": [
                        {
                            "body": "ok a book for an elective would be sufficient.",
                            "author": "5hallowbutdeep",
                            "id": "hz8x9nv",
                            "parent_id": "t1_hz8spso",
                            "score": 2,
                            "created_utc": 1646349760.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I disagree. Those rules are too rigid.\n\nI pay my SB's a very high allowance. Gifts are infrequent. I tell her to save her allowances, so that she never has to ask for \"emergency\" expenses. Finance 101 for 20 year olds: job one as an adult, is to save 6 to 12 months in an emergency fund. They have no problem with any of this.\n\nThe hotel rule is bogus too. When we go to the Sturgis bike rally for example, she could care less how nice the hotel is.",
            "author": "Nomad_Bill",
            "id": "hz8w3dn",
            "parent_id": "t3_t5ycmt",
            "score": 3,
            "created_utc": 1646349253.0,
            "replies": [
                {
                    "body": ">When we go to the Sturgis bike rally for example, she could care less how nice the hotel is.\n\nTry the Four Points in Deadwood. I stayed there during the rally last year, and quite liked it. It's relatively new, clean and modern, and the staff is great. Right on the main street, too.",
                    "author": null,
                    "id": "hz9wlyw",
                    "parent_id": "t1_hz8w3dn",
                    "score": 2,
                    "created_utc": 1646366428.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "1. You got a point. If you're seeing someone X amount times in a month, it should possibly be equivalent to rent. Everyone always mentions the market price in cities, the PPM or allowance should be around that. But, people will agree with whatever fits their lifestyle.\n2. I think as long as he's treating you well, the frivolous small gifts and such is nothing and if it matters to the SB, maybe she should ask instead of expecting him to do that. If he's working a high stress job, plus with kids and a wife, he's probably not thinking about doing the small minor things like getting a bag. (treating you well as in active listening, giving you orgasms, getting the PPM right, giving you a great experience, overall joy to be around) \n3. If this happens, which is unfortunate, I do feel like the SD should be last person you go to for help and not the first. As selfish as it sounds, they want to have fun with you and not be burdened with your life problems. You got to ask family and close friends before you start involving them into your emergency issues.\n4. Yes.\n5. Unless that's someone's kink or fantasy, this is valid.",
            "author": "DottiesHotSake",
            "id": "hz8pqbd",
            "parent_id": "t3_t5ycmt",
            "score": 2,
            "created_utc": 1646346545.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "hz7uelb",
            "parent_id": "t3_t5ycmt",
            "score": 2,
            "created_utc": 1646333820.0,
            "replies": [
                {
                    "body": "I imagine she wanted an audience of more than 15 people, though they all lurk here anyways so she isn't getting any additional visibility.",
                    "author": "storm170",
                    "id": "hz82q9b",
                    "parent_id": "t1_hz7uelb",
                    "score": 9,
                    "created_utc": 1646337085.0,
                    "replies": [
                        {
                            "body": "😂😂😂",
                            "author": "NickPfromYuma",
                            "id": "hz8qtsq",
                            "parent_id": "t1_hz82q9b",
                            "score": 0,
                            "created_utc": 1646347006.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Just crossposting so as many SB’s as possible can see this. :)",
                    "author": "bubblerush",
                    "id": "hz7unzv",
                    "parent_id": "t1_hz7uelb",
                    "score": 6,
                    "created_utc": 1646333922.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "The people who write these posts are usually horrible people.\n\nMy last SB had this guy cover all this except the part of being an interesting & decent person.\n\nHe made his money the old fashioned way - inherited.\n\nHis teeth smelled like rotten pumpkins & he refused to hire cleaning people near his bedroom.\n\nHe had 3 cats & when she got up from the bed was covered in hair.\n\nThat wasn't even the worst of it.\n\nI mentored her & funded a very profitable retail flower business. Paid $3k for a course, $1k for business formation, etc.\n\nShe refuses to take more than $1k monthly allowance & twice weekly fine dining because she doesn't want to be trapped again.\n\nIn the end she controls her own life now. This dude is offering a poison pill for some.",
            "author": "notnoteworthyatall",
            "id": "hz9byrq",
            "parent_id": "t3_t5ycmt",
            "score": 1,
            "created_utc": 1646356370.0,
            "replies": []
        },
        {
            "body": "Sugar babies of the world, unite!  You have nothing to lose but your chains!",
            "author": "57hz",
            "id": "hz9v8rg",
            "parent_id": "t3_t5ycmt",
            "score": 2,
            "created_utc": 1646365750.0,
            "replies": []
        },
        {
            "body": "While I applaud your efforts to get women to form a union, the price of sex — which years ago was a ring and a lifetime of commitment & support — is likely going to continue to fall.",
            "author": "LaGriffeDuLion",
            "id": "hz8jbis",
            "parent_id": "t3_t5ycmt",
            "score": 0,
            "created_utc": 1646343818.0,
            "replies": [
                {
                    "body": "SB’s aren’t escorts. This post is about what I feel is a reasonable expectation to have for your partner. If SB’s started using typical escort rates, most men couldn’t afford what they’re looking for.",
                    "author": "bubblerush",
                    "id": "hz8jt5r",
                    "parent_id": "t1_hz8jbis",
                    "score": 8,
                    "created_utc": 1646344018.0,
                    "replies": [
                        {
                            "body": "he’s not talking about escorts. Men always pay for sex. It’s how the world was set up for 1000s of years. Marriage is the most expensive sex there is.",
                            "author": "NickPfromYuma",
                            "id": "hz8qqxo",
                            "parent_id": "t1_hz8jt5r",
                            "score": 8,
                            "created_utc": 1646346972.0,
                            "replies": []
                        },
                        {
                            "body": "I’m not talking about escorts. I’m not even talking about SBs. I’m talking about women in general.",
                            "author": "LaGriffeDuLion",
                            "id": "hz8k18p",
                            "parent_id": "t1_hz8jt5r",
                            "score": 2,
                            "created_utc": 1646344111.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "hz888uq",
            "parent_id": "t3_t5ycmt",
            "score": 1,
            "created_utc": 1646339253.0,
            "replies": [
                {
                    "body": "Sorry, this isn't a view we won't discuss here.  Sugar is not escorting.  We're not going to allow the escort community to set sugar \"pricing\", or have any voice whatsoever.  Escorts don't, and should not, have any say in what an SD or SB feel is fair financial support, and we won't bring their sex service pricing into SR financial support, any more than the price of bread should affect the cost of a movie.",
                    "author": "Azurecole",
                    "id": "hz8cf5v",
                    "parent_id": "t1_hz888uq",
                    "score": 0,
                    "created_utc": 1646340895.0,
                    "replies": [
                        {
                            "body": "Lol, oh man, you guys really show your hand on this one.  There is only one reason not to discuss wages.  An uninformed person is easier to manipulate and exploit.",
                            "author": "Zealousideal-Emu-863",
                            "id": "hz8g1uz",
                            "parent_id": "t1_hz8cf5v",
                            "score": 3,
                            "created_utc": 1646342364.0,
                            "replies": [
                                {
                                    "body": "\"Wages\" \"services\" hook your 'prices' into escort pricing ... talk about showing your hand.   A business-oriented sugar service is nothing like the sugar relationship the rest of us are here to talk about.  Financial support is often discussed here -- were are just  not going to let more business-oriented faux-sugar models introduce escort concepts, pricing, etc., into this sub.\n\nThere are a number of subs where escorts and service-centric revenue-oriented \"sugar\" services are discussed.  Escorts and johns are a problem within sugar, we're not going to let anyone gaslight us into thinking they're a solution.  You're not a good fit here if your concept of sugar is service-oriented, centered on \"wages\", etc.\n\nContrary to unpopular belief, one can discuss financial support without referencing sex service or escort rates.",
                                    "author": "Azurecole",
                                    "id": "hz8h0xz",
                                    "parent_id": "t1_hz8g1uz",
                                    "score": 0,
                                    "created_utc": 1646342776.0,
                                    "replies": []
                                },
                                {
                                    "body": "\"Wages\" \"services\" \"hook your 'prices' into escorts\" ... talking about showing your hand.   A business-oriented sugar service is nothing like the sugar relationship the rest of us are here to talk about.  Financial support is often discussed here -- were are just  not going to let more business-oriented faux-sugar models introduce escort concepts, pricing, etc., into this sub.  \n\nThere are a number of subs where escorts and service-centric revenue-oriented \"sugar\" services are discussed.  Escorts and johns are a problem within sugar, we're not going to let anyone gaslight us into thinking they're a solution.  You're not a good fit here if your concept of sugar is service-oriented, centered on \"wages\", etc.",
                                    "author": "Azurecole",
                                    "id": "hz8h0h0",
                                    "parent_id": "t1_hz8g1uz",
                                    "score": 1,
                                    "created_utc": 1646342769.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "hz89k9b",
                    "parent_id": "t1_hz888uq",
                    "score": 1,
                    "created_utc": 1646339776.0,
                    "replies": [
                        {
                            "body": "Absolutely not -- the entire notion that escorts should drive sugar \"pricing\" is itself a rule 12 violation.  I can't imagine any SB I've ever had, thinking she should compare sugar to a sex service.  They're different things, escorts have no say in sugar.",
                            "author": "Azurecole",
                            "id": "hz8bmlc",
                            "parent_id": "t1_hz89k9b",
                            "score": 0,
                            "created_utc": 1646340586.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Only standards I can truly control are the standards I try to hold myself to.",
            "author": "LippoLippi1500",
            "id": "hz8gukx",
            "parent_id": "t3_t5ycmt",
            "score": 1,
            "created_utc": 1646342696.0,
            "replies": []
        },
        {
            "body": "This is all my personal opinion of course but these are the things he should be providing at a minimum..\n\nHe should cover your rent (at the very least)\n\nLol lol lol\n\nHe should be buying you gifts, big or small, at least once a month. Bags, flowers, jewelry, vacations, or sending you to the nail salon. It doesn’t always need to be pricey but it should be something.\n\nLol\n\nHe should still cover your expenses if an emergency comes up and you can’t see him for a week or two (obviously depending on how long you’ve been seeing each other).\n\nLol lol lol lol lol lol lol and WTF\n\nHe needs to respect your boundaries. If it’s not something you want to do, he shouldn’t push you.\n\nOk fine! That’s definitely something that both sides should do.\n\nHe should never bring you to a cheap hotel or expect you to welcome him into your apartment if you’re not comfortable with it.\n\nNope. But I wonder why you SBs are ok fucking loser vanillas on the back of their truck, go to their dingy apartments and have sex there or travel with them to stay in cheap hotels/hostels and still end up paying for both of your expenses.",
            "author": null,
            "id": "hz8e307",
            "parent_id": "t3_t5ycmt",
            "score": -2,
            "created_utc": 1646341561.0,
            "replies": []
        },
        {
            "body": "So if I cover you rent and buy you flowers once a month I'm good, but if I pay for groceries and gas and take you shopping twice a month, buy you dinner once a week when we can't hang out and always pay for your nails and hair I'm not up to standard? LOL",
            "author": null,
            "id": "hz81x5q",
            "parent_id": "t3_t5ycmt",
            "score": -2,
            "created_utc": 1646336768.0,
            "replies": [
                {
                    "body": "Paying for groceries and gas is sugar to you? Wow it’s worse than I thought",
                    "author": "bubblerush",
                    "id": "hz828mi",
                    "parent_id": "t1_hz81x5q",
                    "score": 11,
                    "created_utc": 1646336894.0,
                    "replies": [
                        {
                            "body": "I think you just have a hard time understanding that some people are in different socioeconomic conditions than you. Many women would be thrilled to have their food and gas taken care of every month along with a few dinner dates. Get off your high horse trying to be the arbiter of how men spend their money and what women think is fair for their time.",
                            "author": "bigdickginger",
                            "id": "hz84hhn",
                            "parent_id": "t1_hz828mi",
                            "score": 4,
                            "created_utc": 1646337779.0,
                            "replies": [
                                {
                                    "body": "it’s just as bad as the SW gate keeping. SB of the world unite…! 😂😂😂\n\nFunny thing is there would be 1000s of scab SB that would cross the picket line to steel the entitled SBs SDs in a heart beat",
                                    "author": "NickPfromYuma",
                                    "id": "hz8rlox",
                                    "parent_id": "t1_hz84hhn",
                                    "score": 0,
                                    "created_utc": 1646347338.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "No it's not. It was a comparison based on an initial comment about if they don't cover rent and buy you a gift they aren't good enough. Which is just as ridiculous as what I said. All that stuff could add up to the same or more than just paying rent and bringing flowers. That was the point. There shouldn't be any arbitrary rules. Every person and every situation is different. Not sure why that's so hard to understand. Everything in life doesn't have to be a contest.",
                            "author": null,
                            "id": "hz87q7h",
                            "parent_id": "t1_hz828mi",
                            "score": 1,
                            "created_utc": 1646339049.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "One of your assumptions is SB's are putting a lot of effort into their looks daily. That is not true in my experience in my area. The pro's and ladies who live this lifestyle DO stay looking good at all times.  \n\n\nThe remaining 80% of women in the bowl ?? The effort in the looks and upkeep area is the same as they would in a vanilla relationship. I gather you're speaking for the small percent of ladies who have the looks,  presentation, and communication skills to get nothing less than your List.",
            "author": "southernslick",
            "id": "hz8omyl",
            "parent_id": "t3_t5ycmt",
            "score": 0,
            "created_utc": 1646346086.0,
            "replies": []
        },
        {
            "body": "I always thought some of the appeal for women was that sugar relationships are easier than vanilla ones?  None of the pressure, expectations, etc.",
            "author": null,
            "id": "hz7v170",
            "parent_id": "t3_t5ycmt",
            "score": -3,
            "created_utc": 1646334064.0,
            "replies": [
                {
                    "body": "Young attractive women can find that on tinder with young attractive men. Maybe some women are into older guys and that’s completely valid but for the majority why wouldn’t they download tinder instead?",
                    "author": "bubblerush",
                    "id": "hz7vflu",
                    "parent_id": "t1_hz7v170",
                    "score": 12,
                    "created_utc": 1646334220.0,
                    "replies": [
                        {
                            "body": "Because then you don’t get the benefits of sugar.  Why not both?  A sugar relationship should be beneficial AND easy.  If you’re treating it as work then yeah I can see why it feels like work.",
                            "author": null,
                            "id": "hz8pdja",
                            "parent_id": "t1_hz7vflu",
                            "score": -1,
                            "created_utc": 1646346394.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "..No. That's only for y'all. I'm a pretty woman. I can find something with no pressure and expectations with a hot guy my age VERY quickly.",
                    "author": "Equinox_Milk",
                    "id": "hz81qry",
                    "parent_id": "t1_hz7v170",
                    "score": 16,
                    "created_utc": 1646336699.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "hz8iqqy",
            "parent_id": "t3_t5ycmt",
            "score": 0,
            "created_utc": 1646343577.0,
            "replies": [
                {
                    "body": "👏🏼👏🏼👏🏼",
                    "author": "bubblerush",
                    "id": "hz8j76e",
                    "parent_id": "t1_hz8iqqy",
                    "score": 1,
                    "created_utc": 1646343768.0,
                    "replies": []
                },
                {
                    "body": "None of this is sugar.  SBs and SDs have exactly the same opportunity to see what others are getting, in the Allowance Master Thread.  This isn't escorting, so no escort discussion is allowed -- I don't know why escorts and business-oriented \"SBs\" feel entitled to escorts setting sugar \"rates\", but it's not what sugar is about.  Nor is it necessary to reference escorting at all, in order to have a discussion of financial support.  So we've got the gaslighting, and we've got the gatekeeping.\n\nThere are sexworker subs where your equivalence here is all welcome, but this sub isn't a good fit.",
                    "author": "Azurecole",
                    "id": "hz8r4r2",
                    "parent_id": "t1_hz8iqqy",
                    "score": 1,
                    "created_utc": 1646347138.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "hz8951i",
            "parent_id": "t3_t5ycmt",
            "score": -3,
            "created_utc": 1646339610.0,
            "replies": [
                {
                    "body": "it gets posted every few months lol",
                    "author": "NickPfromYuma",
                    "id": "hz8r8ss",
                    "parent_id": "t1_hz8951i",
                    "score": -1,
                    "created_utc": 1646347187.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Hahaha wut? Hilarious post.",
            "author": "alleycat5703",
            "id": "hz8jin9",
            "parent_id": "t3_t5ycmt",
            "score": -2,
            "created_utc": 1646343898.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "hz8scvx",
            "parent_id": "t3_t5ycmt",
            "score": -4,
            "created_utc": 1646347655.0,
            "replies": [
                {
                    "body": "You wouldn’t be interested? Dang it!",
                    "author": "bubblerush",
                    "id": "hz8sfs5",
                    "parent_id": "t1_hz8scvx",
                    "score": 6,
                    "created_utc": 1646347688.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Man this was the same SB telling girls that if they go to budget hotels that they are whores by definition. \n\n I took offense to this because my SB’s agenda is to assure that my whole budget for her goes to her ppm - I dont take kindly to some superior moron unfavorably defining the most beloved woman in my life.  She’s my heart.",
            "author": "JDMultralight",
            "id": "hz90exk",
            "parent_id": "t1_hz81ago",
            "score": 34,
            "created_utc": 1646351129.0,
            "replies": [
                {
                    "body": "How did u guys meet?",
                    "author": "beswelly",
                    "id": "hz9pdb5",
                    "parent_id": "t1_hz90exk",
                    "score": 1,
                    "created_utc": 1646362913.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "What I find most funny about posts like these is the people that make these posts would almost assuredly be left out of the smaller, more exclusive bowl that their suggestions would create. I wonder if their opinion would change then?",
            "author": "storm170",
            "id": "hz83862",
            "parent_id": "t1_hz81ago",
            "score": 30,
            "created_utc": 1646337281.0,
            "replies": [
                {
                    "body": "I hear you man. In an ideal world the bowl would just be me and Selena Gomez. And then where would OP be? Pretty sure she didn't take THAT into consideration.\n\nUnless OP IS Selena Gomez. In which case bring it on.",
                    "author": "ChapterRelative",
                    "id": "hz8phjr",
                    "parent_id": "t1_hz83862",
                    "score": 15,
                    "created_utc": 1646346442.0,
                    "replies": [
                        {
                            "body": "Selena Gomez would be my SM, that lady earns.",
                            "author": "storm170",
                            "id": "hz8qz5b",
                            "parent_id": "t1_hz8phjr",
                            "score": 14,
                            "created_utc": 1646347072.0,
                            "replies": [
                                {
                                    "body": "She'd be your SB if you were any kind of SD.",
                                    "author": "ChapterRelative",
                                    "id": "hz97myd",
                                    "parent_id": "t1_hz8qz5b",
                                    "score": 0,
                                    "created_utc": 1646354314.0,
                                    "replies": [
                                        {
                                            "body": "She out earns this entire forum, what are we offering her that she doesn't already have for herself?",
                                            "author": "storm170",
                                            "id": "hz9b120",
                                            "parent_id": "t1_hz97myd",
                                            "score": 25,
                                            "created_utc": 1646355935.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Omg that’s fucking hilarious 😆",
                    "author": "wb19081908",
                    "id": "hz8jgzb",
                    "parent_id": "t1_hz83862",
                    "score": -1,
                    "created_utc": 1646343879.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "100 up votes.",
            "author": "southernslick",
            "id": "hz8o2qc",
            "parent_id": "t1_hz81ago",
            "score": 3,
            "created_utc": 1646345855.0,
            "replies": []
        },
        {
            "body": "What’s SA? And why do I keep getting scammed and can’t find anyone serious besides like “knock off SD” had a good one and he was killed. Just got over him and trying to do it again.",
            "author": "beswelly",
            "id": "hz9pb5i",
            "parent_id": "t1_hz81ago",
            "score": 0,
            "created_utc": 1646362883.0,
            "replies": []
        },
        {
            "body": "Exactly",
            "author": "nwa747",
            "id": "hz89ldd",
            "parent_id": "t1_hz81ago",
            "score": -1,
            "created_utc": 1646339789.0,
            "replies": []
        },
        {
            "body": "Completely agree, but if it’s an actual sugar relationship a SD should want to genuinely support his SB.",
            "author": "bubblerush",
            "id": "hz7sgc2",
            "parent_id": "t1_hz7s3v3",
            "score": 8,
            "created_utc": 1646333071.0,
            "replies": [
                {
                    "body": "Why are \"covering rent\" and \"genuinely support\" synonymous to you?",
                    "author": null,
                    "id": "hz7uhog",
                    "parent_id": "t1_hz7sgc2",
                    "score": 23,
                    "created_utc": 1646333853.0,
                    "replies": [
                        {
                            "body": "I could be wrong but I think she’s just trying to showcase a dollar value, not the actual of paying the rent per se",
                            "author": "Cdnsugarr",
                            "id": "hz8ci4w",
                            "parent_id": "t1_hz7uhog",
                            "score": 23,
                            "created_utc": 1646340927.0,
                            "replies": []
                        },
                        {
                            "body": "Yes this is weird outlook.\n\n“He should provide a level of support that makes you feel, comfortable, appreciated and wanted.”\n\nNot “cover my rent”.",
                            "author": null,
                            "id": "hz870ya",
                            "parent_id": "t1_hz7uhog",
                            "score": 8,
                            "created_utc": 1646338775.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I completely agree to this. \n\nLevel of attractiveness, the ability to hold conversations, intelligence, availability in terms of hours etc play a big role. Trying to apply minimum standards may lead to not finding SD.",
            "author": "iamdesi60",
            "id": "hz84f95",
            "parent_id": "t1_hz7tmh0",
            "score": 22,
            "created_utc": 1646337754.0,
            "replies": [
                {
                    "body": "Yeah I second this. I can only speak from my personal experience but I was younger, prettier, and thinner when I first jumped into the bowl but I didn't make nearly as much or find the serious whales. I think that was because I didn't know how to navigate the bowl. I made a lot more (money, gifts, luxury vacations, etc...) when I figured out how to find the sugar and fend off the salt even though I had gained about 15lbs (wasn't fat or anything but not as thin as I had been) and I was in my late 20s at that point. Even now I've jumped back in the bowl and made quite a bit and have a few very promising potential SDs. So what I'm saying is that you don't have to be the most attractive, or the smartest to get the best daddies BUT you do need to know how to navigate the bowl. Figuring out how to make it work for you and also being decently attractive and intelligent, will go a long way in finding what you're looking for in sugar dating.",
                    "author": "sbxox10",
                    "id": "hz91qol",
                    "parent_id": "t1_hz84f95",
                    "score": 17,
                    "created_utc": 1646351699.0,
                    "replies": []
                },
                {
                    "body": "Agreed! \n\nAll SDs are not same and all SBs are not same. Also various locations have various availability of SDs and SBs. Trying to put some minimum expectations in SBs minds is not going to work!",
                    "author": "married_n_bored",
                    "id": "hz85q5a",
                    "parent_id": "t1_hz84f95",
                    "score": 6,
                    "created_utc": 1646338265.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "There’s statistically more attractive women in the world than wealthy men so like…….",
            "author": "sienfiekdsa",
            "id": "hz9ric5",
            "parent_id": "t1_hz7tmh0",
            "score": 8,
            "created_utc": 1646363939.0,
            "replies": [
                {
                    "body": "That's the point.",
                    "author": null,
                    "id": "hz9vnnm",
                    "parent_id": "t1_hz9ric5",
                    "score": 3,
                    "created_utc": 1646365953.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Most women are not fit to be a SB. I think it would be best if they leave the bowl entirely, though I think the OP would suggest that they should stay in and demand the same things that actual SBs deserve.\n\nI don't sense a lot of mutually beneficial thinking coming from this post/poster.",
            "author": "storm170",
            "id": "hz81tj0",
            "parent_id": "t1_hz7tmh0",
            "score": 18,
            "created_utc": 1646336729.0,
            "replies": [
                {
                    "body": "I agree with you. I feel like a lot of times they create more problems than solve.",
                    "author": "SatansBirthdayCake",
                    "id": "hz9ezxp",
                    "parent_id": "t1_hz81tj0",
                    "score": 4,
                    "created_utc": 1646357781.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "that’s because only so many men have that type of money and they already have the top 1% of women as SB\n\nThat’s the problem with modern society every women thinks she deserves a 6’ handsome guy that makes over 6 figures, and most don’t have what it takes to get that",
            "author": "NickPfromYuma",
            "id": "hz8rvp1",
            "parent_id": "t1_hz8nc61",
            "score": 21,
            "created_utc": 1646347455.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "hz9q50j",
            "parent_id": "t1_hz87kh7",
            "score": -1,
            "created_utc": 1646363278.0,
            "replies": [
                {
                    "body": "that's what they're telling you",
                    "author": null,
                    "id": "hz9v882",
                    "parent_id": "t1_hz9q50j",
                    "score": 6,
                    "created_utc": 1646365743.0,
                    "replies": []
                },
                {
                    "body": "And I know a bunch of dudes who have sex with beautiful women FOR FREE!  Incredible, isn’t it?",
                    "author": "57hz",
                    "id": "hz9vi0q",
                    "parent_id": "t1_hz9q50j",
                    "score": 6,
                    "created_utc": 1646365875.0,
                    "replies": []
                },
                {
                    "body": "What?",
                    "author": "Chill_SD1974",
                    "id": "hz9waw6",
                    "parent_id": "t1_hz9q50j",
                    "score": 2,
                    "created_utc": 1646366272.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I’m in this same boat of being “mature” (26) and being able to pay my own rent and I’m financially secure. At this point, the money is to get ahead, not stay afloat. \n\nI also look for more of an emotional and intellectual connection with no BS. If vanilla dating were like SR dating in that there isn’t the drama, the games, etc, I’d probably be married by now. Alas. \n\nI can compromise a bit on my financial ask if it means I’m getting a quality person. A lot of SBs don’t realize that the real good gains (like any investment) are in the long game. I don’t need or even want to be spoiled (though it is a wonderful bonus); I want to be treated like a lady and enjoy his time and enjoy his intellect. \n\nThe money doesn’t make a man any more attractive to me, it just gets him in the door. Even if he meets my financial ask, if he’s rude the wait staff, chews with his mouth open, or talks down to me, I’m out.",
            "author": "SatansBirthdayCake",
            "id": "hz8vceg",
            "parent_id": "t1_hz832h4",
            "score": 20,
            "created_utc": 1646348921.0,
            "replies": []
        },
        {
            "body": "If you want to learn how too yolo investments like a WSB retard… im here for you lol.",
            "author": "JamesGarrison",
            "id": "hz86698",
            "parent_id": "t1_hz832h4",
            "score": 0,
            "created_utc": 1646338439.0,
            "replies": [
                {
                    "body": "What? I’m thinking your smart ass comment backfired with too many typos…",
                    "author": "Kevinburnz",
                    "id": "hz8bexm",
                    "parent_id": "t1_hz86698",
                    "score": 8,
                    "created_utc": 1646340501.0,
                    "replies": [
                        {
                            "body": "I was an active participant in wallstreetbets. A subreddit. Typos and calling yourself retarded is kinda the thing there. She mentioned wanting portfolio advice. That’s actually one thing I’m great at and also terrible at. Like losing a quarter million a week ago in a stupid options bet.",
                            "author": "JamesGarrison",
                            "id": "hz8cpbr",
                            "parent_id": "t1_hz8bexm",
                            "score": 4,
                            "created_utc": 1646341007.0,
                            "replies": [
                                {
                                    "body": "Gotcha lol. I feel you. I’m great at picking good investments. They are the ones I don’t go into…",
                                    "author": "Kevinburnz",
                                    "id": "hz8cyhe",
                                    "parent_id": "t1_hz8cpbr",
                                    "score": 7,
                                    "created_utc": 1646341107.0,
                                    "replies": [
                                        {
                                            "body": "Because If YOU go into… the opposite happens. A felllow retard. Hello friend.",
                                            "author": "JamesGarrison",
                                            "id": "hz8d8rz",
                                            "parent_id": "t1_hz8cyhe",
                                            "score": 0,
                                            "created_utc": 1646341217.0,
                                            "replies": [
                                                {
                                                    "body": "Greetings. See you at the crypto rally 😜",
                                                    "author": "Kevinburnz",
                                                    "id": "hz8dnlk",
                                                    "parent_id": "t1_hz8d8rz",
                                                    "score": 3,
                                                    "created_utc": 1646341380.0,
                                                    "replies": [
                                                        {
                                                            "body": "Winter is coming…",
                                                            "author": "JamesGarrison",
                                                            "id": "hz8dt2w",
                                                            "parent_id": "t1_hz8dnlk",
                                                            "score": 1,
                                                            "created_utc": 1646341445.0,
                                                            "replies": [
                                                                {
                                                                    "body": "If you’re out, I’m in bro 😂😂\n\nI agree with you tho, winter is coming. Good year for accumulating..",
                                                                    "author": "Intelli_gent_0601",
                                                                    "id": "hz8euax",
                                                                    "parent_id": "t1_hz8dt2w",
                                                                    "score": 2,
                                                                    "created_utc": 1646341872.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "This",
            "author": "Kevinburnz",
            "id": "hz864u9",
            "parent_id": "t1_hz832h4",
            "score": -1,
            "created_utc": 1646338423.0,
            "replies": []
        },
        {
            "body": "This is the bare minimum for a vanilla relationship or just general human decency. I think that the standards for a SR should be all those things and them some.",
            "author": "zara_io",
            "id": "hz8fzhu",
            "parent_id": "t1_hz85ai2",
            "score": 27,
            "created_utc": 1646342337.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "hz8hxgj",
                    "parent_id": "t1_hz8fzhu",
                    "score": 0,
                    "created_utc": 1646343221.0,
                    "replies": [
                        {
                            "body": "That doesn’t change the valid point that was made about how the standards should be. What women and SBs decide to accept is another matter.  Obviously everything said comes with nuance and other factors to consider, but I personally don’t accept any SR that doesn’t ascribe to those standards. I will say I also don’t sugar out of desperation, which will change what SBs will accept. But even if I was desperate, I personally would not use sugaring as the means to rectify it because it’s too easy to get exploited.",
                            "author": "zara_io",
                            "id": "hz8odvi",
                            "parent_id": "t1_hz8hxgj",
                            "score": 5,
                            "created_utc": 1646345983.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "What is a vanilla relationship?",
                    "author": "beswelly",
                    "id": "hz9qask",
                    "parent_id": "t1_hz8fzhu",
                    "score": -1,
                    "created_utc": 1646363357.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yeah. Guys like this don't tip and abuse women. He didn't mention a single thing about her emotional needs.",
            "author": "notnoteworthyatall",
            "id": "hz9c0pn",
            "parent_id": "t1_hz85ai2",
            "score": 2,
            "created_utc": 1646356395.0,
            "replies": []
        },
        {
            "body": "The responses are very telling. I’m a tiny bit surprised also, lol.",
            "author": null,
            "id": "hz8sr0w",
            "parent_id": "t1_hz7wajd",
            "score": 10,
            "created_utc": 1646347822.0,
            "replies": []
        },
        {
            "body": "You could have made the post to reflect that priority but you didn't. Your first two points said the SD should always pay rent and send you to the nail salon and on vacations.\n\nYou should have boundaries and stick to them, but that's not where you decided to focus your attention. Nobody is disagreeing that having boundaries is a bad thing. Nobody is going to say that a man should be allowed to disrespect your boundaries.",
            "author": "bigdickginger",
            "id": "hz7xr72",
            "parent_id": "t1_hz7wajd",
            "score": 16,
            "created_utc": 1646335129.0,
            "replies": [
                {
                    "body": "If a SD isn’t treating you every once in awhile and caring for your needs what’s the point? Why don’t SB’s find young attractive men to spend time with, and if SD’s don’t want to support their partners why don’t they jump on Eharmony or Ashleymadison and find someone their own age who won’t have these expectations? You want a young attractive woman, why should she want you?",
                    "author": "bubblerush",
                    "id": "hz7yg4o",
                    "parent_id": "t1_hz7xr72",
                    "score": 12,
                    "created_utc": 1646335398.0,
                    "replies": [
                        {
                            "body": "Even now you're not making an argument about safety or boundaries.\n\nI'm not even sure what you are arguing here. It's not your place to dictate why other women want to have sugar relationships.",
                            "author": "bigdickginger",
                            "id": "hz80j0v",
                            "parent_id": "t1_hz7yg4o",
                            "score": 13,
                            "created_utc": 1646336219.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I haven't seen anyone \"upset\".  You're equating challenges to your idea as emotional distress.\n\nYou're receiving challenges because your idea would destroy the market and hurt everyone in the process.",
            "author": null,
            "id": "hz8031f",
            "parent_id": "t1_hz7wajd",
            "score": 4,
            "created_utc": 1646336042.0,
            "replies": []
        },
        {
            "body": "People here are not upset at all. You hang around in echo chambers so much that any neutrally thought out argument is upsetting *you*.",
            "author": "YlangScent",
            "id": "hz9810l",
            "parent_id": "t1_hz7wajd",
            "score": 4,
            "created_utc": 1646354492.0,
            "replies": []
        },
        {
            "body": "This is actually reading a lot like that popular tinder post a week or so ago. Talking about outlandish expectations. When In fact most people are average.",
            "author": "JamesGarrison",
            "id": "hz86km5",
            "parent_id": "t1_hz7zf7j",
            "score": 12,
            "created_utc": 1646338597.0,
            "replies": [
                {
                    "body": "90% of the population is undatable!",
                    "author": "Kevinburnz",
                    "id": "hz8bru9",
                    "parent_id": "t1_hz86km5",
                    "score": 1,
                    "created_utc": 1646340642.0,
                    "replies": [
                        {
                            "body": "Thanks Jerry.",
                            "author": "BinghamtonSD",
                            "id": "hz8pfoy",
                            "parent_id": "t1_hz8bru9",
                            "score": 1,
                            "created_utc": 1646346419.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "tinder on reddit or some sort of official tinder blog?",
                    "author": "newtexansd",
                    "id": "hz8s3nw",
                    "parent_id": "t1_hz86km5",
                    "score": 1,
                    "created_utc": 1646347546.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I bring this up occasionally when posts like this are made, the OP is (probably unknown to her) suggesting an artificial price floor and has no idea that her suggestion ends up hurting far more SBs than the SDs she is targeting.\n\nIt's simple economics, and whether you want it to or not economics impacts anything that deals with money. Sugaring included.",
            "author": "storm170",
            "id": "hz82ext",
            "parent_id": "t1_hz7zf7j",
            "score": 20,
            "created_utc": 1646336962.0,
            "replies": [
                {
                    "body": "It’s almost like the minimum wage conversation…",
                    "author": null,
                    "id": "hz87c0t",
                    "parent_id": "t1_hz82ext",
                    "score": 5,
                    "created_utc": 1646338893.0,
                    "replies": [
                        {
                            "body": "Indeed, at least minimum wage can be subsidized by local and federal government. I doubt high end SBs are going to break off a piece of their allowances to take care of all the SBs forced out of the market due to the gatekeeping the OP is asking for.",
                            "author": "storm170",
                            "id": "hz87m0z",
                            "parent_id": "t1_hz87c0t",
                            "score": 10,
                            "created_utc": 1646339003.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "It could ultimately result in seeking going out of business and relegating sugar to just freestyling.",
                    "author": null,
                    "id": "hz88l1o",
                    "parent_id": "t1_hz82ext",
                    "score": 2,
                    "created_utc": 1646339387.0,
                    "replies": [
                        {
                            "body": "Which would reduce the number of successful SBs to a fraction of their current numbers, increasing the number of SBs negatively impacted by her suggestions.\n\nApparently, she just hates other SBs and wants to see them fail in greater numbers than they already do.",
                            "author": "storm170",
                            "id": "hz88wg2",
                            "parent_id": "t1_hz88l1o",
                            "score": 4,
                            "created_utc": 1646339514.0,
                            "replies": [
                                {
                                    "body": "Yeah, it's the classic SB gets lowballed and wants to rant about it and blame all SDs instead of accept the rejection.",
                                    "author": null,
                                    "id": "hz89db4",
                                    "parent_id": "t1_hz88wg2",
                                    "score": 3,
                                    "created_utc": 1646339701.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Rent and a trip to the nail salon shouldn’t break the bank. I agree it would reduce the amount of “SD’s” because as I said, not all men are meant to be SD’s.",
            "author": "bubblerush",
            "id": "hz800ht",
            "parent_id": "t1_hz7zf7j",
            "score": 12,
            "created_utc": 1646336014.0,
            "replies": [
                {
                    "body": "and ultimately a lot less women would get to be SB with your proposal. Many of these women are girls next door, not insta models. they’re not looking for designer anything, some just want help with rent, tuition or some just want to be able to afford to spoil themselves.\n\nThe other problem with your proposal is that is it sounds a lot like a traditional sugar relationship with an emotional connection. Many SB some want that and want to keep it NSA. Manny would have no interest in the time involved it would take to have that type of sugar relationship. Because no real SD would give all that for a structured 1 date a week arrangement. You’re talking about being a sugar girlfriend with multiple dates a week, traveling together, etc. Most women that join the bowl won’t invest into a relationship enough to even be worthy of your expectations",
                    "author": "NickPfromYuma",
                    "id": "hz8pue4",
                    "parent_id": "t1_hz800ht",
                    "score": 8,
                    "created_utc": 1646346592.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Thank you for this post! I had a debate with OP recently about this very thing. Girls like her insist that all SB's should have the same (somewhat ridiculously) high expectations. But you're right... there are only so many SD's to go around, especially when you live in a less populated area like I do. So no, I'm not being spoiled with designer purses and random vacations, but I'm making an extra $XXXX a month sugaring, which I'm not mad at, and getting taken out for dinner, drinks, and lunch several times a week. I'm happy with where I'm at, but according to her I'm not a \"real\" SB because I'm not raking in an arbitrary figure.",
            "author": "HailToTheQuinn",
            "id": "hz9ia9y",
            "parent_id": "t1_hz7zf7j",
            "score": -2,
            "created_utc": 1646359291.0,
            "replies": []
        },
        {
            "body": "As a woman, as a SB, I listen to other SB’s. I know how many other SB’s feel because we talk to each other openly. SD’s normally have no idea how these women are feeling because we don’t normally voice our opinions on sugar relationships to SD’s.",
            "author": "bubblerush",
            "id": "hz7xmxp",
            "parent_id": "t1_hz7x5bc",
            "score": 8,
            "created_utc": 1646335083.0,
            "replies": [
                {
                    "body": "Then your sugar relationship is not very good if you can't communicate your expectations like adults. This is a \"you\" problem not an \"all SDs\" problem.",
                    "author": "bigdickginger",
                    "id": "hz7y6p4",
                    "parent_id": "t1_hz7xmxp",
                    "score": 21,
                    "created_utc": 1646335296.0,
                    "replies": [
                        {
                            "body": "I communicate with my SD, but many women are uncomfortable with communicating these things. This post isn’t just my viewpoint, this is what most SB’s want from their relationships.",
                            "author": "bubblerush",
                            "id": "hz7yqns",
                            "parent_id": "t1_hz7y6p4",
                            "score": 4,
                            "created_utc": 1646335515.0,
                            "replies": [
                                {
                                    "body": "Again. That's not a problem responsible adults have in their intimate relationships. If a woman can't communicate her needs in the context of her own relationships then that is a sign that she isn't ready for a real relationship and your little bullet list isn't doing anyone any favors in that scenario.\n\nThis is true for men as well. Communication is key for everyone.",
                                    "author": "bigdickginger",
                                    "id": "hz80y00",
                                    "parent_id": "t1_hz7yqns",
                                    "score": 13,
                                    "created_utc": 1646336383.0,
                                    "replies": [
                                        {
                                            "body": "18-19 year old girls aren’t typically reasonable adults. They’re teenagers and there’s a lot of them in these relationships. It might come as a shock to you but teenage girls sometime have a hard time communicating with grown men.",
                                            "author": "bubblerush",
                                            "id": "hz81c2z",
                                            "parent_id": "t1_hz80y00",
                                            "score": 2,
                                            "created_utc": 1646336539.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Unfortunately a lot of very young women, teenagers even, are getting into sugar relationships not knowing what to expect. Young women are getting taken advantage of, getting hurt because they’re going into this blind.",
            "author": "bubblerush",
            "id": "hz7uhu8",
            "parent_id": "t1_hz7ru7t",
            "score": 12,
            "created_utc": 1646333854.0,
            "replies": [
                {
                    "body": "I agree, especially if they have never had sex before.",
                    "author": "Ghostkittiee",
                    "id": "hz802g6",
                    "parent_id": "t1_hz7uhu8",
                    "score": 7,
                    "created_utc": 1646336035.0,
                    "replies": []
                },
                {
                    "body": "I agree. I mean most 18 year olds think about themselves and Starbucks and fake boobs… hardly a fun setup for SD when most people at that age are pretty self absorbed ( from both sides )",
                    "author": "Gold_Honeydew9577",
                    "id": "hz82n39",
                    "parent_id": "t1_hz7uhu8",
                    "score": 0,
                    "created_utc": 1646337051.0,
                    "replies": [
                        {
                            "body": "Yes.. because they’re teenagers that shouldn’t be sugar dating in all honesty. Spend time with a child and expect them to act like a child.",
                            "author": "bubblerush",
                            "id": "hz832ea",
                            "parent_id": "t1_hz82n39",
                            "score": 19,
                            "created_utc": 1646337216.0,
                            "replies": [
                                {
                                    "body": "Bang on - pretty tough to expect a janitor to act like an astronaught, so not sure why dudes expect young inexperienced girls to act full of class and sophistication either. \n\nPeople need to go in with their eyes wide open and not be salty if/when it doesn’t work out...",
                                    "author": "Intelli_gent_0601",
                                    "id": "hz8g4hx",
                                    "parent_id": "t1_hz832ea",
                                    "score": 10,
                                    "created_utc": 1646342394.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "I set the floor at 22.  I Prefer 25.  Every year I’ll see some stunning 19 year old and I’ll go to a meet and greet and want to claw my eyes out.  They are lovely but not a fit for me",
                            "author": "LotBuilder",
                            "id": "hz85wu4",
                            "parent_id": "t1_hz82n39",
                            "score": 7,
                            "created_utc": 1646338338.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "As I said, this is just my personal opinion and I felt that it needed to be said. A lot of new, young girls are getting into this lifestyle not knowing what a sugar relationship looks like and they’re getting burned because of it. They’re getting taken advantage of because of it.",
            "author": "bubblerush",
            "id": "hz7u7sz",
            "parent_id": "t1_hz7tkxh",
            "score": 6,
            "created_utc": 1646333746.0,
            "replies": [
                {
                    "body": "And as I said, this is only what a sugar relationship looks like to YOU.\n\nThere is vast distance between a young woman getting \"burned\" and your own definition of what a SR looks like.",
                    "author": null,
                    "id": "hz7unbt",
                    "parent_id": "t1_hz7u7sz",
                    "score": 8,
                    "created_utc": 1646333915.0,
                    "replies": [
                        {
                            "body": "I personally feel like this is what a sugar relationship should look like to SB’s and SD’s. It’s a relationship, you should care about your partners needs, boundaries, and happiness. If you don’t want to support your partner and care for them then you’re a John and it isn’t a relationship; and if it is a relationship, you’re not a very good partner.",
                            "author": "bubblerush",
                            "id": "hz7v7un",
                            "parent_id": "t1_hz7unbt",
                            "score": 2,
                            "created_utc": 1646334135.0,
                            "replies": [
                                {
                                    "body": "So I'm a \"john\" if I don't pay her rent?\n\nBeware of Rule 5.",
                                    "author": null,
                                    "id": "hz7wiu8",
                                    "parent_id": "t1_hz7v7un",
                                    "score": 3,
                                    "created_utc": 1646334645.0,
                                    "replies": [
                                        {
                                            "body": "You’re a John if you have the means to care for your partners basic needs but you choose not to.",
                                            "author": "bubblerush",
                                            "id": "hz7wz7n",
                                            "parent_id": "t1_hz7wiu8",
                                            "score": 6,
                                            "created_utc": 1646334825.0,
                                            "replies": [
                                                {
                                                    "body": "You're going to have a very bad time here if this is the attitude you have to SRs.",
                                                    "author": "bigdickginger",
                                                    "id": "hz7x8tk",
                                                    "parent_id": "t1_hz7wz7n",
                                                    "score": 4,
                                                    "created_utc": 1646334929.0,
                                                    "replies": [
                                                        {
                                                            "body": "No, I’m really not. I’ve had two very successful relationships. One lasting two years, and he exceeded these expectations. I’ve had a great time, and I want other women to as well. :)",
                                                            "author": "bubblerush",
                                                            "id": "hz7xwhi",
                                                            "parent_id": "t1_hz7x8tk",
                                                            "score": 12,
                                                            "created_utc": 1646335187.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Your recent \"should I find a new SD\" post suggests otherwise.",
                                                                    "author": null,
                                                                    "id": "hz8jinf",
                                                                    "parent_id": "t1_hz7xwhi",
                                                                    "score": 14,
                                                                    "created_utc": 1646343898.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "Again I’ve had two, and when they don’t meet my expectations I end the relationship. Simple as that.",
                                                                            "author": "bubblerush",
                                                                            "id": "hz8jwwq",
                                                                            "parent_id": "t1_hz8jinf",
                                                                            "score": 3,
                                                                            "created_utc": 1646344062.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "body": "Hmm, your post history suggests otherwise. You were complaining about your “Clingy” SD who wanted to spend more time with you a month back and the fact that you got him a more expensive gift than what he got you for Christmas",
                                                                    "author": "supportiveceo",
                                                                    "id": "hz886yz",
                                                                    "parent_id": "t1_hz7xwhi",
                                                                    "score": 12,
                                                                    "created_utc": 1646339232.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "What. And you’re a man saying this as if you know better. No trust us, women want what Op said. Period end of story. And if she doesn’t want it, it’s because no one showed her she could have it, she doesn’t know she could have it, so she doesn’t want it *yet.",
            "author": null,
            "id": "hz8y4a6",
            "parent_id": "t1_hz7tkxh",
            "score": 3,
            "created_utc": 1646350125.0,
            "replies": [
                {
                    "body": "I want a pony.",
                    "author": null,
                    "id": "hz9b49f",
                    "parent_id": "t1_hz8y4a6",
                    "score": 3,
                    "created_utc": 1646355977.0,
                    "replies": []
                },
                {
                    "body": "What people want and what people find acceptable are two completely different concepts. Surely you understand that all women would want me to give them millions, but most are completely fine with thousands? \nPeople don't exist to give you whatever you want. Don't be entitled.",
                    "author": "YlangScent",
                    "id": "hz96lcv",
                    "parent_id": "t1_hz8y4a6",
                    "score": 0,
                    "created_utc": 1646353848.0,
                    "replies": [
                        {
                            "body": "👏👏👏👏.  I feel like you and I have butted heads before, but I'm in complete agreement with you here.",
                            "author": "HailToTheQuinn",
                            "id": "hz9g8n9",
                            "parent_id": "t1_hz96lcv",
                            "score": 1,
                            "created_utc": 1646358350.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I am shocked that this is being described as “outrageous” right now.",
            "author": null,
            "id": "hz8t2ch",
            "parent_id": "t1_hz8m9pk",
            "score": 12,
            "created_utc": 1646347954.0,
            "replies": []
        },
        {
            "body": "I agree. I was thinking I somehow misinterpreted this post based on all the comments challenging what she wrote.",
            "author": "new_sd_acct",
            "id": "hz97uw5",
            "parent_id": "t1_hz8m9pk",
            "score": 3,
            "created_utc": 1646354414.0,
            "replies": []
        },
        {
            "body": "I didn't necessarily disagree with her points, though the emergency help should have had a qualifier of X months in the SR beforehand, I just found her personality entitled and obnoxious. It makes even reasonable statements or requests harder to consider.",
            "author": "storm170",
            "id": "hz9hj2g",
            "parent_id": "t1_hz8m9pk",
            "score": 3,
            "created_utc": 1646358940.0,
            "replies": []
        },
        {
            "body": "But where did she say ANY of that? Anytime someone in this sub suggests SBs should hold men they interact with in the bowl to any sort of expectations, they are bashed for….what, exactly? For encouraging girls to have standards? At the end of the day, if someone nexts you or you next someone else because you don’t agree on what should be apart of a SR, then it is no sweat off your back. These comments are really telling.",
            "author": "zara_io",
            "id": "hz8gp6a",
            "parent_id": "t1_hz86ms8",
            "score": 15,
            "created_utc": 1646342630.0,
            "replies": [
                {
                    "body": "Literally 👏 read 👏 the 👏 post 👏",
                    "author": "allyafterdark",
                    "id": "hz8hynx",
                    "parent_id": "t1_hz8gp6a",
                    "score": 2,
                    "created_utc": 1646343236.0,
                    "replies": [
                        {
                            "body": "[removed]",
                            "author": null,
                            "id": "hz8npnr",
                            "parent_id": "t1_hz8hynx",
                            "score": 2,
                            "created_utc": 1646345700.0,
                            "replies": [
                                {
                                    "body": "I can read, and I’m not the one projecting, but go off, “sweetie” - and take your passive-aggressive misogynist BS with you 💁‍♀️",
                                    "author": "allyafterdark",
                                    "id": "hz8p7l8",
                                    "parent_id": "t1_hz8npnr",
                                    "score": -1,
                                    "created_utc": 1646346324.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Never said we were “better than vanilla women” but we are different. We’re dating men who are typically older and not extremely attractive. We’re not getting the same things that we would in a vanilla relationship. If “SD’s” are essentially offering a vanilla relationship, what’s the appeal?",
            "author": "bubblerush",
            "id": "hz8hi3g",
            "parent_id": "t1_hz86ms8",
            "score": 7,
            "created_utc": 1646343016.0,
            "replies": [
                {
                    "body": "We all know well how the so called “attractive” men treat you in vanilla and what’s worse is these guys are often not even attractive. \n\nPlus if there were so many fulfilling vanilla relationships why the fuck would ladies even date sugar! We all know, we all know every story there is about the pains and perils of dating loser vanillas.",
                    "author": null,
                    "id": "hz8mtq8",
                    "parent_id": "t1_hz8hi3g",
                    "score": 4,
                    "created_utc": 1646345330.0,
                    "replies": []
                },
                {
                    "body": "You claim you “put in a lot of effort to look good, be cheerful, make these men happy […] a lot more work than a vanilla relationship […]”\n\nI’m not saying there’s an appeal, why don’t you try answering what I asked before putting out shitty questions of your own and implying you’re somehow better than women who aren’t SB’s 😬",
                    "author": "allyafterdark",
                    "id": "hz8ib5h",
                    "parent_id": "t1_hz8hi3g",
                    "score": 0,
                    "created_utc": 1646343390.0,
                    "replies": [
                        {
                            "body": "Again never said that we were better, just different. As a SB there’s more of an expectation, in a vanilla relationship I can show up with no makeup wearing sweatpants. I’m not saying that it’s SW with extra steps but lots of “SD’s” seem to treat it like it is. The whole idea behind sugar relationships is young attractive women dating older wealthy men so that they’re both able to experience things that they wouldn’t normally be able to. Unfortunately men seem to treat sugar relationships like a discount escort service because what their offering wouldn’t get them much from an escort.",
                            "author": "bubblerush",
                            "id": "hz8j2p0",
                            "parent_id": "t1_hz8ib5h",
                            "score": 9,
                            "created_utc": 1646343715.0,
                            "replies": [
                                {
                                    "body": "It’s implied, I’m not saying you *literally said it in as many words,* you arrogant ass.\n\nLMAO, you think vanilla women turn up to dates and times out in sweatpants?! Are you just a misogynist troll, or are you **actually** that freaking ignorant?! 😂 \n\nNot sure why you insist on repeatedly putting SD in scare quotes, that’s literally the abbreviation they use… 🤷‍♀️ \n\nLiterally not addressing anything *still*, but go off.",
                                    "author": "allyafterdark",
                                    "id": "hz8k8v5",
                                    "parent_id": "t1_hz8j2p0",
                                    "score": 2,
                                    "created_utc": 1646344199.0,
                                    "replies": []
                                },
                                {
                                    "body": "“a SB there’s more of an expectation, in a vanilla relationship I can show up with no makeup wearing sweatpants”.\n\nSeems like you have never been in a real sugar relationship! Of course there is a difference between dating loser vanillas and wealthy SDs but don’t tell me a genuine SD won’t mind you showing up more casually in an established sugar relationship.\n\nPlus we all know how you ladies take abuse and try to impress loser vanillas with clothes, makeup and instagram posts.",
                                    "author": null,
                                    "id": "hz8n75j",
                                    "parent_id": "t1_hz8j2p0",
                                    "score": -3,
                                    "created_utc": 1646345487.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "If a woman doesnt like what the bowl has to offer her, she can stick to vanilla dating. \n\nNo one deserves anything. People can want what they want, but if they cant get it, well, they get what they get or they look at the alternate options of what they can get.",
                    "author": "Yo_Mamas_azz",
                    "id": "hz8o43x",
                    "parent_id": "t1_hz8hi3g",
                    "score": -2,
                    "created_utc": 1646345871.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Unless they become the OPEC of vagina. This ain’t going to work.",
            "author": "JamesGarrison",
            "id": "hz8si39",
            "parent_id": "t1_hz8bl1z",
            "score": -2,
            "created_utc": 1646347716.0,
            "replies": []
        },
        {
            "body": "As I said “usually.”  Some women find younger, attractive SD’s but that’s the minority. Normally these men are a lot older and there’s not much of a physical attraction. Women that are young and attractive are here because they want a man that can offer them what most men in their age range can’t. Support, mentorship, experiences.",
            "author": "bubblerush",
            "id": "hz7tydu",
            "parent_id": "t1_hz7tbi0",
            "score": 11,
            "created_utc": 1646333647.0,
            "replies": [
                {
                    "body": "interesting.. i’ve only sugar date women that are attracted to me, want to spend time with me, and actually enjoy having sex with me and ask more… I’ve had age gaps from 20-30 years, and even with a 30 year age gap she couldn’t keep her hands off me. I think you forget how many women are attracted to older more mature men. Not all go for Chads and Fuck boys!",
                    "author": "NickPfromYuma",
                    "id": "hz8qeoz",
                    "parent_id": "t1_hz7tydu",
                    "score": 1,
                    "created_utc": 1646346828.0,
                    "replies": [
                        {
                            "body": "Or maybe she's a good actress, ah no? Lol I swear you SDs on here are so delusional.",
                            "author": "Pretty_Ant_3094",
                            "id": "hz994bm",
                            "parent_id": "t1_hz8qeoz",
                            "score": 6,
                            "created_utc": 1646354986.0,
                            "replies": []
                        },
                        {
                            "body": "You might be one of the few gorgeous ones, but the odds are more likely that your SB is simply a great actress and playing her part very well",
                            "author": "Vegetable-Slip-6245",
                            "id": "hz9a9bi",
                            "parent_id": "t1_hz8qeoz",
                            "score": 4,
                            "created_utc": 1646355520.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "100% thank you! 💕👏🏼",
            "author": "bubblerush",
            "id": "hz7z24t",
            "parent_id": "t1_hz7y4of",
            "score": 4,
            "created_utc": 1646335640.0,
            "replies": []
        },
        {
            "body": "The white night has entered into the conversation. :)\n\nI think what OP describes fits some peoples subset of arrangement but not all. It is gatekeeping all other types of arrangements.",
            "author": null,
            "id": "hz87p08",
            "parent_id": "t1_hz7y4of",
            "score": 2,
            "created_utc": 1646339036.0,
            "replies": []
        },
        {
            "body": "A SB acting like a princess? That’s crazy! It’s almost like that’s the whole point of being a SB.",
            "author": "bubblerush",
            "id": "hz81qw4",
            "parent_id": "t1_hz81kz7",
            "score": 4,
            "created_utc": 1646336700.0,
            "replies": [
                {
                    "body": "You missed the point by a mile. It's your attitude and view that is the problem. \n\nI treated my last SB like a princess specifically because she DIDN'T act like one. You'll get a lot further ahead if you drop the entitled attitude.",
                    "author": "AustinMetz18",
                    "id": "hz832yj",
                    "parent_id": "t1_hz81qw4",
                    "score": 7,
                    "created_utc": 1646337223.0,
                    "replies": [
                        {
                            "body": "Believe me in doing just fine. I have my expectations and I only spend time with men who meet them.",
                            "author": "bubblerush",
                            "id": "hz839ci",
                            "parent_id": "t1_hz832yj",
                            "score": -5,
                            "created_utc": 1646337293.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "An escort wouldn’t accept their pennies, which is why it’s easier to find young/naive women on seeking.",
            "author": "bubblerush",
            "id": "hz8gduc",
            "parent_id": "t1_hz877yi",
            "score": 12,
            "created_utc": 1646342499.0,
            "replies": [
                {
                    "body": "I think you’re sadly mistaken young padawan, actually many escorts would except pennies. There are prostitutes for just about every budget 😉",
                    "author": "NickPfromYuma",
                    "id": "hz8r4s7",
                    "parent_id": "t1_hz8gduc",
                    "score": -1,
                    "created_utc": 1646347138.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "🙋🏼‍♀️I love gifts!! 🛍🎁💐🤩 \nAnd world peace 🌎\nAnd this forum.\nAnd my dog",
            "author": "BeautyBaby247",
            "id": "hz86j1v",
            "parent_id": "t1_hz82jcb",
            "score": 12,
            "created_utc": 1646338581.0,
            "replies": []
        },
        {
            "body": "Sds should gift at least monthly. But some don’t gift at all… from my own experience.",
            "author": null,
            "id": "hz8xoe0",
            "parent_id": "t1_hz82jcb",
            "score": 5,
            "created_utc": 1646349934.0,
            "replies": []
        },
        {
            "body": "Completely agree! But this post isn’t about that. Maybe you can start your own post instead of trying to discredit this one with something that’s off topic.",
            "author": "bubblerush",
            "id": "hz7swtb",
            "parent_id": "t1_hz7s19f",
            "score": 8,
            "created_utc": 1646333248.0,
            "replies": []
        },
        {
            "body": "Or a used toaster oven 😂",
            "author": "SatansBirthdayCake",
            "id": "hz9eoz0",
            "parent_id": "t1_hz8pzfp",
            "score": 2,
            "created_utc": 1646357643.0,
            "replies": [
                {
                    "body": "You may be able to put either in a fake Birkin",
                    "author": "BinghamtonSD",
                    "id": "hz9fzyq",
                    "parent_id": "t1_hz9eoz0",
                    "score": 1,
                    "created_utc": 1646358239.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "So true",
            "author": "bubblerush",
            "id": "hz8rj0b",
            "parent_id": "t1_hz8pzfp",
            "score": 1,
            "created_utc": 1646347307.0,
            "replies": []
        },
        {
            "body": "Criticism of someone's opinion is not the same thing as throwing a tantrum.",
            "author": "bigdickginger",
            "id": "hz876bl",
            "parent_id": "t1_hz828kf",
            "score": 10,
            "created_utc": 1646338832.0,
            "replies": []
        },
        {
            "body": "Hold on. Ain’t nobody here that rich.",
            "author": "JamesGarrison",
            "id": "hz8spso",
            "parent_id": "t1_hz7tkyd",
            "score": 5,
            "created_utc": 1646347807.0,
            "replies": [
                {
                    "body": "ok a book for an elective would be sufficient.",
                    "author": "5hallowbutdeep",
                    "id": "hz8x9nv",
                    "parent_id": "t1_hz8spso",
                    "score": 2,
                    "created_utc": 1646349760.0,
                    "replies": []
                }
            ]
        },
        {
            "body": ">When we go to the Sturgis bike rally for example, she could care less how nice the hotel is.\n\nTry the Four Points in Deadwood. I stayed there during the rally last year, and quite liked it. It's relatively new, clean and modern, and the staff is great. Right on the main street, too.",
            "author": null,
            "id": "hz9wlyw",
            "parent_id": "t1_hz8w3dn",
            "score": 2,
            "created_utc": 1646366428.0,
            "replies": []
        },
        {
            "body": "I imagine she wanted an audience of more than 15 people, though they all lurk here anyways so she isn't getting any additional visibility.",
            "author": "storm170",
            "id": "hz82q9b",
            "parent_id": "t1_hz7uelb",
            "score": 9,
            "created_utc": 1646337085.0,
            "replies": [
                {
                    "body": "😂😂😂",
                    "author": "NickPfromYuma",
                    "id": "hz8qtsq",
                    "parent_id": "t1_hz82q9b",
                    "score": 0,
                    "created_utc": 1646347006.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Just crossposting so as many SB’s as possible can see this. :)",
            "author": "bubblerush",
            "id": "hz7unzv",
            "parent_id": "t1_hz7uelb",
            "score": 6,
            "created_utc": 1646333922.0,
            "replies": []
        },
        {
            "body": "SB’s aren’t escorts. This post is about what I feel is a reasonable expectation to have for your partner. If SB’s started using typical escort rates, most men couldn’t afford what they’re looking for.",
            "author": "bubblerush",
            "id": "hz8jt5r",
            "parent_id": "t1_hz8jbis",
            "score": 8,
            "created_utc": 1646344018.0,
            "replies": [
                {
                    "body": "he’s not talking about escorts. Men always pay for sex. It’s how the world was set up for 1000s of years. Marriage is the most expensive sex there is.",
                    "author": "NickPfromYuma",
                    "id": "hz8qqxo",
                    "parent_id": "t1_hz8jt5r",
                    "score": 8,
                    "created_utc": 1646346972.0,
                    "replies": []
                },
                {
                    "body": "I’m not talking about escorts. I’m not even talking about SBs. I’m talking about women in general.",
                    "author": "LaGriffeDuLion",
                    "id": "hz8k18p",
                    "parent_id": "t1_hz8jt5r",
                    "score": 2,
                    "created_utc": 1646344111.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Sorry, this isn't a view we won't discuss here.  Sugar is not escorting.  We're not going to allow the escort community to set sugar \"pricing\", or have any voice whatsoever.  Escorts don't, and should not, have any say in what an SD or SB feel is fair financial support, and we won't bring their sex service pricing into SR financial support, any more than the price of bread should affect the cost of a movie.",
            "author": "Azurecole",
            "id": "hz8cf5v",
            "parent_id": "t1_hz888uq",
            "score": 0,
            "created_utc": 1646340895.0,
            "replies": [
                {
                    "body": "Lol, oh man, you guys really show your hand on this one.  There is only one reason not to discuss wages.  An uninformed person is easier to manipulate and exploit.",
                    "author": "Zealousideal-Emu-863",
                    "id": "hz8g1uz",
                    "parent_id": "t1_hz8cf5v",
                    "score": 3,
                    "created_utc": 1646342364.0,
                    "replies": [
                        {
                            "body": "\"Wages\" \"services\" hook your 'prices' into escort pricing ... talk about showing your hand.   A business-oriented sugar service is nothing like the sugar relationship the rest of us are here to talk about.  Financial support is often discussed here -- were are just  not going to let more business-oriented faux-sugar models introduce escort concepts, pricing, etc., into this sub.\n\nThere are a number of subs where escorts and service-centric revenue-oriented \"sugar\" services are discussed.  Escorts and johns are a problem within sugar, we're not going to let anyone gaslight us into thinking they're a solution.  You're not a good fit here if your concept of sugar is service-oriented, centered on \"wages\", etc.\n\nContrary to unpopular belief, one can discuss financial support without referencing sex service or escort rates.",
                            "author": "Azurecole",
                            "id": "hz8h0xz",
                            "parent_id": "t1_hz8g1uz",
                            "score": 0,
                            "created_utc": 1646342776.0,
                            "replies": []
                        },
                        {
                            "body": "\"Wages\" \"services\" \"hook your 'prices' into escorts\" ... talking about showing your hand.   A business-oriented sugar service is nothing like the sugar relationship the rest of us are here to talk about.  Financial support is often discussed here -- were are just  not going to let more business-oriented faux-sugar models introduce escort concepts, pricing, etc., into this sub.  \n\nThere are a number of subs where escorts and service-centric revenue-oriented \"sugar\" services are discussed.  Escorts and johns are a problem within sugar, we're not going to let anyone gaslight us into thinking they're a solution.  You're not a good fit here if your concept of sugar is service-oriented, centered on \"wages\", etc.",
                            "author": "Azurecole",
                            "id": "hz8h0h0",
                            "parent_id": "t1_hz8g1uz",
                            "score": 1,
                            "created_utc": 1646342769.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "hz89k9b",
            "parent_id": "t1_hz888uq",
            "score": 1,
            "created_utc": 1646339776.0,
            "replies": [
                {
                    "body": "Absolutely not -- the entire notion that escorts should drive sugar \"pricing\" is itself a rule 12 violation.  I can't imagine any SB I've ever had, thinking she should compare sugar to a sex service.  They're different things, escorts have no say in sugar.",
                    "author": "Azurecole",
                    "id": "hz8bmlc",
                    "parent_id": "t1_hz89k9b",
                    "score": 0,
                    "created_utc": 1646340586.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Paying for groceries and gas is sugar to you? Wow it’s worse than I thought",
            "author": "bubblerush",
            "id": "hz828mi",
            "parent_id": "t1_hz81x5q",
            "score": 11,
            "created_utc": 1646336894.0,
            "replies": [
                {
                    "body": "I think you just have a hard time understanding that some people are in different socioeconomic conditions than you. Many women would be thrilled to have their food and gas taken care of every month along with a few dinner dates. Get off your high horse trying to be the arbiter of how men spend their money and what women think is fair for their time.",
                    "author": "bigdickginger",
                    "id": "hz84hhn",
                    "parent_id": "t1_hz828mi",
                    "score": 4,
                    "created_utc": 1646337779.0,
                    "replies": [
                        {
                            "body": "it’s just as bad as the SW gate keeping. SB of the world unite…! 😂😂😂\n\nFunny thing is there would be 1000s of scab SB that would cross the picket line to steel the entitled SBs SDs in a heart beat",
                            "author": "NickPfromYuma",
                            "id": "hz8rlox",
                            "parent_id": "t1_hz84hhn",
                            "score": 0,
                            "created_utc": 1646347338.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "No it's not. It was a comparison based on an initial comment about if they don't cover rent and buy you a gift they aren't good enough. Which is just as ridiculous as what I said. All that stuff could add up to the same or more than just paying rent and bringing flowers. That was the point. There shouldn't be any arbitrary rules. Every person and every situation is different. Not sure why that's so hard to understand. Everything in life doesn't have to be a contest.",
                    "author": null,
                    "id": "hz87q7h",
                    "parent_id": "t1_hz828mi",
                    "score": 1,
                    "created_utc": 1646339049.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Young attractive women can find that on tinder with young attractive men. Maybe some women are into older guys and that’s completely valid but for the majority why wouldn’t they download tinder instead?",
            "author": "bubblerush",
            "id": "hz7vflu",
            "parent_id": "t1_hz7v170",
            "score": 12,
            "created_utc": 1646334220.0,
            "replies": [
                {
                    "body": "Because then you don’t get the benefits of sugar.  Why not both?  A sugar relationship should be beneficial AND easy.  If you’re treating it as work then yeah I can see why it feels like work.",
                    "author": null,
                    "id": "hz8pdja",
                    "parent_id": "t1_hz7vflu",
                    "score": -1,
                    "created_utc": 1646346394.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "..No. That's only for y'all. I'm a pretty woman. I can find something with no pressure and expectations with a hot guy my age VERY quickly.",
            "author": "Equinox_Milk",
            "id": "hz81qry",
            "parent_id": "t1_hz7v170",
            "score": 16,
            "created_utc": 1646336699.0,
            "replies": []
        },
        {
            "body": "👏🏼👏🏼👏🏼",
            "author": "bubblerush",
            "id": "hz8j76e",
            "parent_id": "t1_hz8iqqy",
            "score": 1,
            "created_utc": 1646343768.0,
            "replies": []
        },
        {
            "body": "None of this is sugar.  SBs and SDs have exactly the same opportunity to see what others are getting, in the Allowance Master Thread.  This isn't escorting, so no escort discussion is allowed -- I don't know why escorts and business-oriented \"SBs\" feel entitled to escorts setting sugar \"rates\", but it's not what sugar is about.  Nor is it necessary to reference escorting at all, in order to have a discussion of financial support.  So we've got the gaslighting, and we've got the gatekeeping.\n\nThere are sexworker subs where your equivalence here is all welcome, but this sub isn't a good fit.",
            "author": "Azurecole",
            "id": "hz8r4r2",
            "parent_id": "t1_hz8iqqy",
            "score": 1,
            "created_utc": 1646347138.0,
            "replies": []
        },
        {
            "body": "it gets posted every few months lol",
            "author": "NickPfromYuma",
            "id": "hz8r8ss",
            "parent_id": "t1_hz8951i",
            "score": -1,
            "created_utc": 1646347187.0,
            "replies": []
        },
        {
            "body": "You wouldn’t be interested? Dang it!",
            "author": "bubblerush",
            "id": "hz8sfs5",
            "parent_id": "t1_hz8scvx",
            "score": 6,
            "created_utc": 1646347688.0,
            "replies": []
        },
        {
            "body": "How did u guys meet?",
            "author": "beswelly",
            "id": "hz9pdb5",
            "parent_id": "t1_hz90exk",
            "score": 1,
            "created_utc": 1646362913.0,
            "replies": []
        },
        {
            "body": "I hear you man. In an ideal world the bowl would just be me and Selena Gomez. And then where would OP be? Pretty sure she didn't take THAT into consideration.\n\nUnless OP IS Selena Gomez. In which case bring it on.",
            "author": "ChapterRelative",
            "id": "hz8phjr",
            "parent_id": "t1_hz83862",
            "score": 15,
            "created_utc": 1646346442.0,
            "replies": [
                {
                    "body": "Selena Gomez would be my SM, that lady earns.",
                    "author": "storm170",
                    "id": "hz8qz5b",
                    "parent_id": "t1_hz8phjr",
                    "score": 14,
                    "created_utc": 1646347072.0,
                    "replies": [
                        {
                            "body": "She'd be your SB if you were any kind of SD.",
                            "author": "ChapterRelative",
                            "id": "hz97myd",
                            "parent_id": "t1_hz8qz5b",
                            "score": 0,
                            "created_utc": 1646354314.0,
                            "replies": [
                                {
                                    "body": "She out earns this entire forum, what are we offering her that she doesn't already have for herself?",
                                    "author": "storm170",
                                    "id": "hz9b120",
                                    "parent_id": "t1_hz97myd",
                                    "score": 25,
                                    "created_utc": 1646355935.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Omg that’s fucking hilarious 😆",
            "author": "wb19081908",
            "id": "hz8jgzb",
            "parent_id": "t1_hz83862",
            "score": -1,
            "created_utc": 1646343879.0,
            "replies": []
        },
        {
            "body": "Why are \"covering rent\" and \"genuinely support\" synonymous to you?",
            "author": null,
            "id": "hz7uhog",
            "parent_id": "t1_hz7sgc2",
            "score": 23,
            "created_utc": 1646333853.0,
            "replies": [
                {
                    "body": "I could be wrong but I think she’s just trying to showcase a dollar value, not the actual of paying the rent per se",
                    "author": "Cdnsugarr",
                    "id": "hz8ci4w",
                    "parent_id": "t1_hz7uhog",
                    "score": 23,
                    "created_utc": 1646340927.0,
                    "replies": []
                },
                {
                    "body": "Yes this is weird outlook.\n\n“He should provide a level of support that makes you feel, comfortable, appreciated and wanted.”\n\nNot “cover my rent”.",
                    "author": null,
                    "id": "hz870ya",
                    "parent_id": "t1_hz7uhog",
                    "score": 8,
                    "created_utc": 1646338775.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yeah I second this. I can only speak from my personal experience but I was younger, prettier, and thinner when I first jumped into the bowl but I didn't make nearly as much or find the serious whales. I think that was because I didn't know how to navigate the bowl. I made a lot more (money, gifts, luxury vacations, etc...) when I figured out how to find the sugar and fend off the salt even though I had gained about 15lbs (wasn't fat or anything but not as thin as I had been) and I was in my late 20s at that point. Even now I've jumped back in the bowl and made quite a bit and have a few very promising potential SDs. So what I'm saying is that you don't have to be the most attractive, or the smartest to get the best daddies BUT you do need to know how to navigate the bowl. Figuring out how to make it work for you and also being decently attractive and intelligent, will go a long way in finding what you're looking for in sugar dating.",
            "author": "sbxox10",
            "id": "hz91qol",
            "parent_id": "t1_hz84f95",
            "score": 17,
            "created_utc": 1646351699.0,
            "replies": []
        },
        {
            "body": "Agreed! \n\nAll SDs are not same and all SBs are not same. Also various locations have various availability of SDs and SBs. Trying to put some minimum expectations in SBs minds is not going to work!",
            "author": "married_n_bored",
            "id": "hz85q5a",
            "parent_id": "t1_hz84f95",
            "score": 6,
            "created_utc": 1646338265.0,
            "replies": []
        },
        {
            "body": "That's the point.",
            "author": null,
            "id": "hz9vnnm",
            "parent_id": "t1_hz9ric5",
            "score": 3,
            "created_utc": 1646365953.0,
            "replies": []
        },
        {
            "body": "I agree with you. I feel like a lot of times they create more problems than solve.",
            "author": "SatansBirthdayCake",
            "id": "hz9ezxp",
            "parent_id": "t1_hz81tj0",
            "score": 4,
            "created_utc": 1646357781.0,
            "replies": []
        },
        {
            "body": "that's what they're telling you",
            "author": null,
            "id": "hz9v882",
            "parent_id": "t1_hz9q50j",
            "score": 6,
            "created_utc": 1646365743.0,
            "replies": []
        },
        {
            "body": "And I know a bunch of dudes who have sex with beautiful women FOR FREE!  Incredible, isn’t it?",
            "author": "57hz",
            "id": "hz9vi0q",
            "parent_id": "t1_hz9q50j",
            "score": 6,
            "created_utc": 1646365875.0,
            "replies": []
        },
        {
            "body": "What?",
            "author": "Chill_SD1974",
            "id": "hz9waw6",
            "parent_id": "t1_hz9q50j",
            "score": 2,
            "created_utc": 1646366272.0,
            "replies": []
        },
        {
            "body": "What? I’m thinking your smart ass comment backfired with too many typos…",
            "author": "Kevinburnz",
            "id": "hz8bexm",
            "parent_id": "t1_hz86698",
            "score": 8,
            "created_utc": 1646340501.0,
            "replies": [
                {
                    "body": "I was an active participant in wallstreetbets. A subreddit. Typos and calling yourself retarded is kinda the thing there. She mentioned wanting portfolio advice. That’s actually one thing I’m great at and also terrible at. Like losing a quarter million a week ago in a stupid options bet.",
                    "author": "JamesGarrison",
                    "id": "hz8cpbr",
                    "parent_id": "t1_hz8bexm",
                    "score": 4,
                    "created_utc": 1646341007.0,
                    "replies": [
                        {
                            "body": "Gotcha lol. I feel you. I’m great at picking good investments. They are the ones I don’t go into…",
                            "author": "Kevinburnz",
                            "id": "hz8cyhe",
                            "parent_id": "t1_hz8cpbr",
                            "score": 7,
                            "created_utc": 1646341107.0,
                            "replies": [
                                {
                                    "body": "Because If YOU go into… the opposite happens. A felllow retard. Hello friend.",
                                    "author": "JamesGarrison",
                                    "id": "hz8d8rz",
                                    "parent_id": "t1_hz8cyhe",
                                    "score": 0,
                                    "created_utc": 1646341217.0,
                                    "replies": [
                                        {
                                            "body": "Greetings. See you at the crypto rally 😜",
                                            "author": "Kevinburnz",
                                            "id": "hz8dnlk",
                                            "parent_id": "t1_hz8d8rz",
                                            "score": 3,
                                            "created_utc": 1646341380.0,
                                            "replies": [
                                                {
                                                    "body": "Winter is coming…",
                                                    "author": "JamesGarrison",
                                                    "id": "hz8dt2w",
                                                    "parent_id": "t1_hz8dnlk",
                                                    "score": 1,
                                                    "created_utc": 1646341445.0,
                                                    "replies": [
                                                        {
                                                            "body": "If you’re out, I’m in bro 😂😂\n\nI agree with you tho, winter is coming. Good year for accumulating..",
                                                            "author": "Intelli_gent_0601",
                                                            "id": "hz8euax",
                                                            "parent_id": "t1_hz8dt2w",
                                                            "score": 2,
                                                            "created_utc": 1646341872.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "hz8hxgj",
            "parent_id": "t1_hz8fzhu",
            "score": 0,
            "created_utc": 1646343221.0,
            "replies": [
                {
                    "body": "That doesn’t change the valid point that was made about how the standards should be. What women and SBs decide to accept is another matter.  Obviously everything said comes with nuance and other factors to consider, but I personally don’t accept any SR that doesn’t ascribe to those standards. I will say I also don’t sugar out of desperation, which will change what SBs will accept. But even if I was desperate, I personally would not use sugaring as the means to rectify it because it’s too easy to get exploited.",
                    "author": "zara_io",
                    "id": "hz8odvi",
                    "parent_id": "t1_hz8hxgj",
                    "score": 5,
                    "created_utc": 1646345983.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "What is a vanilla relationship?",
            "author": "beswelly",
            "id": "hz9qask",
            "parent_id": "t1_hz8fzhu",
            "score": -1,
            "created_utc": 1646363357.0,
            "replies": []
        },
        {
            "body": "If a SD isn’t treating you every once in awhile and caring for your needs what’s the point? Why don’t SB’s find young attractive men to spend time with, and if SD’s don’t want to support their partners why don’t they jump on Eharmony or Ashleymadison and find someone their own age who won’t have these expectations? You want a young attractive woman, why should she want you?",
            "author": "bubblerush",
            "id": "hz7yg4o",
            "parent_id": "t1_hz7xr72",
            "score": 12,
            "created_utc": 1646335398.0,
            "replies": [
                {
                    "body": "Even now you're not making an argument about safety or boundaries.\n\nI'm not even sure what you are arguing here. It's not your place to dictate why other women want to have sugar relationships.",
                    "author": "bigdickginger",
                    "id": "hz80j0v",
                    "parent_id": "t1_hz7yg4o",
                    "score": 13,
                    "created_utc": 1646336219.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "90% of the population is undatable!",
            "author": "Kevinburnz",
            "id": "hz8bru9",
            "parent_id": "t1_hz86km5",
            "score": 1,
            "created_utc": 1646340642.0,
            "replies": [
                {
                    "body": "Thanks Jerry.",
                    "author": "BinghamtonSD",
                    "id": "hz8pfoy",
                    "parent_id": "t1_hz8bru9",
                    "score": 1,
                    "created_utc": 1646346419.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "tinder on reddit or some sort of official tinder blog?",
            "author": "newtexansd",
            "id": "hz8s3nw",
            "parent_id": "t1_hz86km5",
            "score": 1,
            "created_utc": 1646347546.0,
            "replies": []
        },
        {
            "body": "It’s almost like the minimum wage conversation…",
            "author": null,
            "id": "hz87c0t",
            "parent_id": "t1_hz82ext",
            "score": 5,
            "created_utc": 1646338893.0,
            "replies": [
                {
                    "body": "Indeed, at least minimum wage can be subsidized by local and federal government. I doubt high end SBs are going to break off a piece of their allowances to take care of all the SBs forced out of the market due to the gatekeeping the OP is asking for.",
                    "author": "storm170",
                    "id": "hz87m0z",
                    "parent_id": "t1_hz87c0t",
                    "score": 10,
                    "created_utc": 1646339003.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "It could ultimately result in seeking going out of business and relegating sugar to just freestyling.",
            "author": null,
            "id": "hz88l1o",
            "parent_id": "t1_hz82ext",
            "score": 2,
            "created_utc": 1646339387.0,
            "replies": [
                {
                    "body": "Which would reduce the number of successful SBs to a fraction of their current numbers, increasing the number of SBs negatively impacted by her suggestions.\n\nApparently, she just hates other SBs and wants to see them fail in greater numbers than they already do.",
                    "author": "storm170",
                    "id": "hz88wg2",
                    "parent_id": "t1_hz88l1o",
                    "score": 4,
                    "created_utc": 1646339514.0,
                    "replies": [
                        {
                            "body": "Yeah, it's the classic SB gets lowballed and wants to rant about it and blame all SDs instead of accept the rejection.",
                            "author": null,
                            "id": "hz89db4",
                            "parent_id": "t1_hz88wg2",
                            "score": 3,
                            "created_utc": 1646339701.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "and ultimately a lot less women would get to be SB with your proposal. Many of these women are girls next door, not insta models. they’re not looking for designer anything, some just want help with rent, tuition or some just want to be able to afford to spoil themselves.\n\nThe other problem with your proposal is that is it sounds a lot like a traditional sugar relationship with an emotional connection. Many SB some want that and want to keep it NSA. Manny would have no interest in the time involved it would take to have that type of sugar relationship. Because no real SD would give all that for a structured 1 date a week arrangement. You’re talking about being a sugar girlfriend with multiple dates a week, traveling together, etc. Most women that join the bowl won’t invest into a relationship enough to even be worthy of your expectations",
            "author": "NickPfromYuma",
            "id": "hz8pue4",
            "parent_id": "t1_hz800ht",
            "score": 8,
            "created_utc": 1646346592.0,
            "replies": []
        },
        {
            "body": "Then your sugar relationship is not very good if you can't communicate your expectations like adults. This is a \"you\" problem not an \"all SDs\" problem.",
            "author": "bigdickginger",
            "id": "hz7y6p4",
            "parent_id": "t1_hz7xmxp",
            "score": 21,
            "created_utc": 1646335296.0,
            "replies": [
                {
                    "body": "I communicate with my SD, but many women are uncomfortable with communicating these things. This post isn’t just my viewpoint, this is what most SB’s want from their relationships.",
                    "author": "bubblerush",
                    "id": "hz7yqns",
                    "parent_id": "t1_hz7y6p4",
                    "score": 4,
                    "created_utc": 1646335515.0,
                    "replies": [
                        {
                            "body": "Again. That's not a problem responsible adults have in their intimate relationships. If a woman can't communicate her needs in the context of her own relationships then that is a sign that she isn't ready for a real relationship and your little bullet list isn't doing anyone any favors in that scenario.\n\nThis is true for men as well. Communication is key for everyone.",
                            "author": "bigdickginger",
                            "id": "hz80y00",
                            "parent_id": "t1_hz7yqns",
                            "score": 13,
                            "created_utc": 1646336383.0,
                            "replies": [
                                {
                                    "body": "18-19 year old girls aren’t typically reasonable adults. They’re teenagers and there’s a lot of them in these relationships. It might come as a shock to you but teenage girls sometime have a hard time communicating with grown men.",
                                    "author": "bubblerush",
                                    "id": "hz81c2z",
                                    "parent_id": "t1_hz80y00",
                                    "score": 2,
                                    "created_utc": 1646336539.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I agree, especially if they have never had sex before.",
            "author": "Ghostkittiee",
            "id": "hz802g6",
            "parent_id": "t1_hz7uhu8",
            "score": 7,
            "created_utc": 1646336035.0,
            "replies": []
        },
        {
            "body": "I agree. I mean most 18 year olds think about themselves and Starbucks and fake boobs… hardly a fun setup for SD when most people at that age are pretty self absorbed ( from both sides )",
            "author": "Gold_Honeydew9577",
            "id": "hz82n39",
            "parent_id": "t1_hz7uhu8",
            "score": 0,
            "created_utc": 1646337051.0,
            "replies": [
                {
                    "body": "Yes.. because they’re teenagers that shouldn’t be sugar dating in all honesty. Spend time with a child and expect them to act like a child.",
                    "author": "bubblerush",
                    "id": "hz832ea",
                    "parent_id": "t1_hz82n39",
                    "score": 19,
                    "created_utc": 1646337216.0,
                    "replies": [
                        {
                            "body": "Bang on - pretty tough to expect a janitor to act like an astronaught, so not sure why dudes expect young inexperienced girls to act full of class and sophistication either. \n\nPeople need to go in with their eyes wide open and not be salty if/when it doesn’t work out...",
                            "author": "Intelli_gent_0601",
                            "id": "hz8g4hx",
                            "parent_id": "t1_hz832ea",
                            "score": 10,
                            "created_utc": 1646342394.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "I set the floor at 22.  I Prefer 25.  Every year I’ll see some stunning 19 year old and I’ll go to a meet and greet and want to claw my eyes out.  They are lovely but not a fit for me",
                    "author": "LotBuilder",
                    "id": "hz85wu4",
                    "parent_id": "t1_hz82n39",
                    "score": 7,
                    "created_utc": 1646338338.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "And as I said, this is only what a sugar relationship looks like to YOU.\n\nThere is vast distance between a young woman getting \"burned\" and your own definition of what a SR looks like.",
            "author": null,
            "id": "hz7unbt",
            "parent_id": "t1_hz7u7sz",
            "score": 8,
            "created_utc": 1646333915.0,
            "replies": [
                {
                    "body": "I personally feel like this is what a sugar relationship should look like to SB’s and SD’s. It’s a relationship, you should care about your partners needs, boundaries, and happiness. If you don’t want to support your partner and care for them then you’re a John and it isn’t a relationship; and if it is a relationship, you’re not a very good partner.",
                    "author": "bubblerush",
                    "id": "hz7v7un",
                    "parent_id": "t1_hz7unbt",
                    "score": 2,
                    "created_utc": 1646334135.0,
                    "replies": [
                        {
                            "body": "So I'm a \"john\" if I don't pay her rent?\n\nBeware of Rule 5.",
                            "author": null,
                            "id": "hz7wiu8",
                            "parent_id": "t1_hz7v7un",
                            "score": 3,
                            "created_utc": 1646334645.0,
                            "replies": [
                                {
                                    "body": "You’re a John if you have the means to care for your partners basic needs but you choose not to.",
                                    "author": "bubblerush",
                                    "id": "hz7wz7n",
                                    "parent_id": "t1_hz7wiu8",
                                    "score": 6,
                                    "created_utc": 1646334825.0,
                                    "replies": [
                                        {
                                            "body": "You're going to have a very bad time here if this is the attitude you have to SRs.",
                                            "author": "bigdickginger",
                                            "id": "hz7x8tk",
                                            "parent_id": "t1_hz7wz7n",
                                            "score": 4,
                                            "created_utc": 1646334929.0,
                                            "replies": [
                                                {
                                                    "body": "No, I’m really not. I’ve had two very successful relationships. One lasting two years, and he exceeded these expectations. I’ve had a great time, and I want other women to as well. :)",
                                                    "author": "bubblerush",
                                                    "id": "hz7xwhi",
                                                    "parent_id": "t1_hz7x8tk",
                                                    "score": 12,
                                                    "created_utc": 1646335187.0,
                                                    "replies": [
                                                        {
                                                            "body": "Your recent \"should I find a new SD\" post suggests otherwise.",
                                                            "author": null,
                                                            "id": "hz8jinf",
                                                            "parent_id": "t1_hz7xwhi",
                                                            "score": 14,
                                                            "created_utc": 1646343898.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Again I’ve had two, and when they don’t meet my expectations I end the relationship. Simple as that.",
                                                                    "author": "bubblerush",
                                                                    "id": "hz8jwwq",
                                                                    "parent_id": "t1_hz8jinf",
                                                                    "score": 3,
                                                                    "created_utc": 1646344062.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "body": "Hmm, your post history suggests otherwise. You were complaining about your “Clingy” SD who wanted to spend more time with you a month back and the fact that you got him a more expensive gift than what he got you for Christmas",
                                                            "author": "supportiveceo",
                                                            "id": "hz886yz",
                                                            "parent_id": "t1_hz7xwhi",
                                                            "score": 12,
                                                            "created_utc": 1646339232.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I want a pony.",
            "author": null,
            "id": "hz9b49f",
            "parent_id": "t1_hz8y4a6",
            "score": 3,
            "created_utc": 1646355977.0,
            "replies": []
        },
        {
            "body": "What people want and what people find acceptable are two completely different concepts. Surely you understand that all women would want me to give them millions, but most are completely fine with thousands? \nPeople don't exist to give you whatever you want. Don't be entitled.",
            "author": "YlangScent",
            "id": "hz96lcv",
            "parent_id": "t1_hz8y4a6",
            "score": 0,
            "created_utc": 1646353848.0,
            "replies": [
                {
                    "body": "👏👏👏👏.  I feel like you and I have butted heads before, but I'm in complete agreement with you here.",
                    "author": "HailToTheQuinn",
                    "id": "hz9g8n9",
                    "parent_id": "t1_hz96lcv",
                    "score": 1,
                    "created_utc": 1646358350.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Literally 👏 read 👏 the 👏 post 👏",
            "author": "allyafterdark",
            "id": "hz8hynx",
            "parent_id": "t1_hz8gp6a",
            "score": 2,
            "created_utc": 1646343236.0,
            "replies": [
                {
                    "body": "[removed]",
                    "author": null,
                    "id": "hz8npnr",
                    "parent_id": "t1_hz8hynx",
                    "score": 2,
                    "created_utc": 1646345700.0,
                    "replies": [
                        {
                            "body": "I can read, and I’m not the one projecting, but go off, “sweetie” - and take your passive-aggressive misogynist BS with you 💁‍♀️",
                            "author": "allyafterdark",
                            "id": "hz8p7l8",
                            "parent_id": "t1_hz8npnr",
                            "score": -1,
                            "created_utc": 1646346324.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "We all know well how the so called “attractive” men treat you in vanilla and what’s worse is these guys are often not even attractive. \n\nPlus if there were so many fulfilling vanilla relationships why the fuck would ladies even date sugar! We all know, we all know every story there is about the pains and perils of dating loser vanillas.",
            "author": null,
            "id": "hz8mtq8",
            "parent_id": "t1_hz8hi3g",
            "score": 4,
            "created_utc": 1646345330.0,
            "replies": []
        },
        {
            "body": "You claim you “put in a lot of effort to look good, be cheerful, make these men happy […] a lot more work than a vanilla relationship […]”\n\nI’m not saying there’s an appeal, why don’t you try answering what I asked before putting out shitty questions of your own and implying you’re somehow better than women who aren’t SB’s 😬",
            "author": "allyafterdark",
            "id": "hz8ib5h",
            "parent_id": "t1_hz8hi3g",
            "score": 0,
            "created_utc": 1646343390.0,
            "replies": [
                {
                    "body": "Again never said that we were better, just different. As a SB there’s more of an expectation, in a vanilla relationship I can show up with no makeup wearing sweatpants. I’m not saying that it’s SW with extra steps but lots of “SD’s” seem to treat it like it is. The whole idea behind sugar relationships is young attractive women dating older wealthy men so that they’re both able to experience things that they wouldn’t normally be able to. Unfortunately men seem to treat sugar relationships like a discount escort service because what their offering wouldn’t get them much from an escort.",
                    "author": "bubblerush",
                    "id": "hz8j2p0",
                    "parent_id": "t1_hz8ib5h",
                    "score": 9,
                    "created_utc": 1646343715.0,
                    "replies": [
                        {
                            "body": "It’s implied, I’m not saying you *literally said it in as many words,* you arrogant ass.\n\nLMAO, you think vanilla women turn up to dates and times out in sweatpants?! Are you just a misogynist troll, or are you **actually** that freaking ignorant?! 😂 \n\nNot sure why you insist on repeatedly putting SD in scare quotes, that’s literally the abbreviation they use… 🤷‍♀️ \n\nLiterally not addressing anything *still*, but go off.",
                            "author": "allyafterdark",
                            "id": "hz8k8v5",
                            "parent_id": "t1_hz8j2p0",
                            "score": 2,
                            "created_utc": 1646344199.0,
                            "replies": []
                        },
                        {
                            "body": "“a SB there’s more of an expectation, in a vanilla relationship I can show up with no makeup wearing sweatpants”.\n\nSeems like you have never been in a real sugar relationship! Of course there is a difference between dating loser vanillas and wealthy SDs but don’t tell me a genuine SD won’t mind you showing up more casually in an established sugar relationship.\n\nPlus we all know how you ladies take abuse and try to impress loser vanillas with clothes, makeup and instagram posts.",
                            "author": null,
                            "id": "hz8n75j",
                            "parent_id": "t1_hz8j2p0",
                            "score": -3,
                            "created_utc": 1646345487.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "If a woman doesnt like what the bowl has to offer her, she can stick to vanilla dating. \n\nNo one deserves anything. People can want what they want, but if they cant get it, well, they get what they get or they look at the alternate options of what they can get.",
            "author": "Yo_Mamas_azz",
            "id": "hz8o43x",
            "parent_id": "t1_hz8hi3g",
            "score": -2,
            "created_utc": 1646345871.0,
            "replies": []
        },
        {
            "body": "interesting.. i’ve only sugar date women that are attracted to me, want to spend time with me, and actually enjoy having sex with me and ask more… I’ve had age gaps from 20-30 years, and even with a 30 year age gap she couldn’t keep her hands off me. I think you forget how many women are attracted to older more mature men. Not all go for Chads and Fuck boys!",
            "author": "NickPfromYuma",
            "id": "hz8qeoz",
            "parent_id": "t1_hz7tydu",
            "score": 1,
            "created_utc": 1646346828.0,
            "replies": [
                {
                    "body": "Or maybe she's a good actress, ah no? Lol I swear you SDs on here are so delusional.",
                    "author": "Pretty_Ant_3094",
                    "id": "hz994bm",
                    "parent_id": "t1_hz8qeoz",
                    "score": 6,
                    "created_utc": 1646354986.0,
                    "replies": []
                },
                {
                    "body": "You might be one of the few gorgeous ones, but the odds are more likely that your SB is simply a great actress and playing her part very well",
                    "author": "Vegetable-Slip-6245",
                    "id": "hz9a9bi",
                    "parent_id": "t1_hz8qeoz",
                    "score": 4,
                    "created_utc": 1646355520.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "You missed the point by a mile. It's your attitude and view that is the problem. \n\nI treated my last SB like a princess specifically because she DIDN'T act like one. You'll get a lot further ahead if you drop the entitled attitude.",
            "author": "AustinMetz18",
            "id": "hz832yj",
            "parent_id": "t1_hz81qw4",
            "score": 7,
            "created_utc": 1646337223.0,
            "replies": [
                {
                    "body": "Believe me in doing just fine. I have my expectations and I only spend time with men who meet them.",
                    "author": "bubblerush",
                    "id": "hz839ci",
                    "parent_id": "t1_hz832yj",
                    "score": -5,
                    "created_utc": 1646337293.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I think you’re sadly mistaken young padawan, actually many escorts would except pennies. There are prostitutes for just about every budget 😉",
            "author": "NickPfromYuma",
            "id": "hz8r4s7",
            "parent_id": "t1_hz8gduc",
            "score": -1,
            "created_utc": 1646347138.0,
            "replies": []
        },
        {
            "body": "You may be able to put either in a fake Birkin",
            "author": "BinghamtonSD",
            "id": "hz9fzyq",
            "parent_id": "t1_hz9eoz0",
            "score": 1,
            "created_utc": 1646358239.0,
            "replies": []
        },
        {
            "body": "ok a book for an elective would be sufficient.",
            "author": "5hallowbutdeep",
            "id": "hz8x9nv",
            "parent_id": "t1_hz8spso",
            "score": 2,
            "created_utc": 1646349760.0,
            "replies": []
        },
        {
            "body": "😂😂😂",
            "author": "NickPfromYuma",
            "id": "hz8qtsq",
            "parent_id": "t1_hz82q9b",
            "score": 0,
            "created_utc": 1646347006.0,
            "replies": []
        },
        {
            "body": "he’s not talking about escorts. Men always pay for sex. It’s how the world was set up for 1000s of years. Marriage is the most expensive sex there is.",
            "author": "NickPfromYuma",
            "id": "hz8qqxo",
            "parent_id": "t1_hz8jt5r",
            "score": 8,
            "created_utc": 1646346972.0,
            "replies": []
        },
        {
            "body": "I’m not talking about escorts. I’m not even talking about SBs. I’m talking about women in general.",
            "author": "LaGriffeDuLion",
            "id": "hz8k18p",
            "parent_id": "t1_hz8jt5r",
            "score": 2,
            "created_utc": 1646344111.0,
            "replies": []
        },
        {
            "body": "Lol, oh man, you guys really show your hand on this one.  There is only one reason not to discuss wages.  An uninformed person is easier to manipulate and exploit.",
            "author": "Zealousideal-Emu-863",
            "id": "hz8g1uz",
            "parent_id": "t1_hz8cf5v",
            "score": 3,
            "created_utc": 1646342364.0,
            "replies": [
                {
                    "body": "\"Wages\" \"services\" hook your 'prices' into escort pricing ... talk about showing your hand.   A business-oriented sugar service is nothing like the sugar relationship the rest of us are here to talk about.  Financial support is often discussed here -- were are just  not going to let more business-oriented faux-sugar models introduce escort concepts, pricing, etc., into this sub.\n\nThere are a number of subs where escorts and service-centric revenue-oriented \"sugar\" services are discussed.  Escorts and johns are a problem within sugar, we're not going to let anyone gaslight us into thinking they're a solution.  You're not a good fit here if your concept of sugar is service-oriented, centered on \"wages\", etc.\n\nContrary to unpopular belief, one can discuss financial support without referencing sex service or escort rates.",
                    "author": "Azurecole",
                    "id": "hz8h0xz",
                    "parent_id": "t1_hz8g1uz",
                    "score": 0,
                    "created_utc": 1646342776.0,
                    "replies": []
                },
                {
                    "body": "\"Wages\" \"services\" \"hook your 'prices' into escorts\" ... talking about showing your hand.   A business-oriented sugar service is nothing like the sugar relationship the rest of us are here to talk about.  Financial support is often discussed here -- were are just  not going to let more business-oriented faux-sugar models introduce escort concepts, pricing, etc., into this sub.  \n\nThere are a number of subs where escorts and service-centric revenue-oriented \"sugar\" services are discussed.  Escorts and johns are a problem within sugar, we're not going to let anyone gaslight us into thinking they're a solution.  You're not a good fit here if your concept of sugar is service-oriented, centered on \"wages\", etc.",
                    "author": "Azurecole",
                    "id": "hz8h0h0",
                    "parent_id": "t1_hz8g1uz",
                    "score": 1,
                    "created_utc": 1646342769.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Absolutely not -- the entire notion that escorts should drive sugar \"pricing\" is itself a rule 12 violation.  I can't imagine any SB I've ever had, thinking she should compare sugar to a sex service.  They're different things, escorts have no say in sugar.",
            "author": "Azurecole",
            "id": "hz8bmlc",
            "parent_id": "t1_hz89k9b",
            "score": 0,
            "created_utc": 1646340586.0,
            "replies": []
        },
        {
            "body": "I think you just have a hard time understanding that some people are in different socioeconomic conditions than you. Many women would be thrilled to have their food and gas taken care of every month along with a few dinner dates. Get off your high horse trying to be the arbiter of how men spend their money and what women think is fair for their time.",
            "author": "bigdickginger",
            "id": "hz84hhn",
            "parent_id": "t1_hz828mi",
            "score": 4,
            "created_utc": 1646337779.0,
            "replies": [
                {
                    "body": "it’s just as bad as the SW gate keeping. SB of the world unite…! 😂😂😂\n\nFunny thing is there would be 1000s of scab SB that would cross the picket line to steel the entitled SBs SDs in a heart beat",
                    "author": "NickPfromYuma",
                    "id": "hz8rlox",
                    "parent_id": "t1_hz84hhn",
                    "score": 0,
                    "created_utc": 1646347338.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "No it's not. It was a comparison based on an initial comment about if they don't cover rent and buy you a gift they aren't good enough. Which is just as ridiculous as what I said. All that stuff could add up to the same or more than just paying rent and bringing flowers. That was the point. There shouldn't be any arbitrary rules. Every person and every situation is different. Not sure why that's so hard to understand. Everything in life doesn't have to be a contest.",
            "author": null,
            "id": "hz87q7h",
            "parent_id": "t1_hz828mi",
            "score": 1,
            "created_utc": 1646339049.0,
            "replies": []
        },
        {
            "body": "Because then you don’t get the benefits of sugar.  Why not both?  A sugar relationship should be beneficial AND easy.  If you’re treating it as work then yeah I can see why it feels like work.",
            "author": null,
            "id": "hz8pdja",
            "parent_id": "t1_hz7vflu",
            "score": -1,
            "created_utc": 1646346394.0,
            "replies": []
        },
        {
            "body": "Selena Gomez would be my SM, that lady earns.",
            "author": "storm170",
            "id": "hz8qz5b",
            "parent_id": "t1_hz8phjr",
            "score": 14,
            "created_utc": 1646347072.0,
            "replies": [
                {
                    "body": "She'd be your SB if you were any kind of SD.",
                    "author": "ChapterRelative",
                    "id": "hz97myd",
                    "parent_id": "t1_hz8qz5b",
                    "score": 0,
                    "created_utc": 1646354314.0,
                    "replies": [
                        {
                            "body": "She out earns this entire forum, what are we offering her that she doesn't already have for herself?",
                            "author": "storm170",
                            "id": "hz9b120",
                            "parent_id": "t1_hz97myd",
                            "score": 25,
                            "created_utc": 1646355935.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I could be wrong but I think she’s just trying to showcase a dollar value, not the actual of paying the rent per se",
            "author": "Cdnsugarr",
            "id": "hz8ci4w",
            "parent_id": "t1_hz7uhog",
            "score": 23,
            "created_utc": 1646340927.0,
            "replies": []
        },
        {
            "body": "Yes this is weird outlook.\n\n“He should provide a level of support that makes you feel, comfortable, appreciated and wanted.”\n\nNot “cover my rent”.",
            "author": null,
            "id": "hz870ya",
            "parent_id": "t1_hz7uhog",
            "score": 8,
            "created_utc": 1646338775.0,
            "replies": []
        },
        {
            "body": "I was an active participant in wallstreetbets. A subreddit. Typos and calling yourself retarded is kinda the thing there. She mentioned wanting portfolio advice. That’s actually one thing I’m great at and also terrible at. Like losing a quarter million a week ago in a stupid options bet.",
            "author": "JamesGarrison",
            "id": "hz8cpbr",
            "parent_id": "t1_hz8bexm",
            "score": 4,
            "created_utc": 1646341007.0,
            "replies": [
                {
                    "body": "Gotcha lol. I feel you. I’m great at picking good investments. They are the ones I don’t go into…",
                    "author": "Kevinburnz",
                    "id": "hz8cyhe",
                    "parent_id": "t1_hz8cpbr",
                    "score": 7,
                    "created_utc": 1646341107.0,
                    "replies": [
                        {
                            "body": "Because If YOU go into… the opposite happens. A felllow retard. Hello friend.",
                            "author": "JamesGarrison",
                            "id": "hz8d8rz",
                            "parent_id": "t1_hz8cyhe",
                            "score": 0,
                            "created_utc": 1646341217.0,
                            "replies": [
                                {
                                    "body": "Greetings. See you at the crypto rally 😜",
                                    "author": "Kevinburnz",
                                    "id": "hz8dnlk",
                                    "parent_id": "t1_hz8d8rz",
                                    "score": 3,
                                    "created_utc": 1646341380.0,
                                    "replies": [
                                        {
                                            "body": "Winter is coming…",
                                            "author": "JamesGarrison",
                                            "id": "hz8dt2w",
                                            "parent_id": "t1_hz8dnlk",
                                            "score": 1,
                                            "created_utc": 1646341445.0,
                                            "replies": [
                                                {
                                                    "body": "If you’re out, I’m in bro 😂😂\n\nI agree with you tho, winter is coming. Good year for accumulating..",
                                                    "author": "Intelli_gent_0601",
                                                    "id": "hz8euax",
                                                    "parent_id": "t1_hz8dt2w",
                                                    "score": 2,
                                                    "created_utc": 1646341872.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "That doesn’t change the valid point that was made about how the standards should be. What women and SBs decide to accept is another matter.  Obviously everything said comes with nuance and other factors to consider, but I personally don’t accept any SR that doesn’t ascribe to those standards. I will say I also don’t sugar out of desperation, which will change what SBs will accept. But even if I was desperate, I personally would not use sugaring as the means to rectify it because it’s too easy to get exploited.",
            "author": "zara_io",
            "id": "hz8odvi",
            "parent_id": "t1_hz8hxgj",
            "score": 5,
            "created_utc": 1646345983.0,
            "replies": []
        },
        {
            "body": "Even now you're not making an argument about safety or boundaries.\n\nI'm not even sure what you are arguing here. It's not your place to dictate why other women want to have sugar relationships.",
            "author": "bigdickginger",
            "id": "hz80j0v",
            "parent_id": "t1_hz7yg4o",
            "score": 13,
            "created_utc": 1646336219.0,
            "replies": []
        },
        {
            "body": "Thanks Jerry.",
            "author": "BinghamtonSD",
            "id": "hz8pfoy",
            "parent_id": "t1_hz8bru9",
            "score": 1,
            "created_utc": 1646346419.0,
            "replies": []
        },
        {
            "body": "Indeed, at least minimum wage can be subsidized by local and federal government. I doubt high end SBs are going to break off a piece of their allowances to take care of all the SBs forced out of the market due to the gatekeeping the OP is asking for.",
            "author": "storm170",
            "id": "hz87m0z",
            "parent_id": "t1_hz87c0t",
            "score": 10,
            "created_utc": 1646339003.0,
            "replies": []
        },
        {
            "body": "Which would reduce the number of successful SBs to a fraction of their current numbers, increasing the number of SBs negatively impacted by her suggestions.\n\nApparently, she just hates other SBs and wants to see them fail in greater numbers than they already do.",
            "author": "storm170",
            "id": "hz88wg2",
            "parent_id": "t1_hz88l1o",
            "score": 4,
            "created_utc": 1646339514.0,
            "replies": [
                {
                    "body": "Yeah, it's the classic SB gets lowballed and wants to rant about it and blame all SDs instead of accept the rejection.",
                    "author": null,
                    "id": "hz89db4",
                    "parent_id": "t1_hz88wg2",
                    "score": 3,
                    "created_utc": 1646339701.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I communicate with my SD, but many women are uncomfortable with communicating these things. This post isn’t just my viewpoint, this is what most SB’s want from their relationships.",
            "author": "bubblerush",
            "id": "hz7yqns",
            "parent_id": "t1_hz7y6p4",
            "score": 4,
            "created_utc": 1646335515.0,
            "replies": [
                {
                    "body": "Again. That's not a problem responsible adults have in their intimate relationships. If a woman can't communicate her needs in the context of her own relationships then that is a sign that she isn't ready for a real relationship and your little bullet list isn't doing anyone any favors in that scenario.\n\nThis is true for men as well. Communication is key for everyone.",
                    "author": "bigdickginger",
                    "id": "hz80y00",
                    "parent_id": "t1_hz7yqns",
                    "score": 13,
                    "created_utc": 1646336383.0,
                    "replies": [
                        {
                            "body": "18-19 year old girls aren’t typically reasonable adults. They’re teenagers and there’s a lot of them in these relationships. It might come as a shock to you but teenage girls sometime have a hard time communicating with grown men.",
                            "author": "bubblerush",
                            "id": "hz81c2z",
                            "parent_id": "t1_hz80y00",
                            "score": 2,
                            "created_utc": 1646336539.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yes.. because they’re teenagers that shouldn’t be sugar dating in all honesty. Spend time with a child and expect them to act like a child.",
            "author": "bubblerush",
            "id": "hz832ea",
            "parent_id": "t1_hz82n39",
            "score": 19,
            "created_utc": 1646337216.0,
            "replies": [
                {
                    "body": "Bang on - pretty tough to expect a janitor to act like an astronaught, so not sure why dudes expect young inexperienced girls to act full of class and sophistication either. \n\nPeople need to go in with their eyes wide open and not be salty if/when it doesn’t work out...",
                    "author": "Intelli_gent_0601",
                    "id": "hz8g4hx",
                    "parent_id": "t1_hz832ea",
                    "score": 10,
                    "created_utc": 1646342394.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I set the floor at 22.  I Prefer 25.  Every year I’ll see some stunning 19 year old and I’ll go to a meet and greet and want to claw my eyes out.  They are lovely but not a fit for me",
            "author": "LotBuilder",
            "id": "hz85wu4",
            "parent_id": "t1_hz82n39",
            "score": 7,
            "created_utc": 1646338338.0,
            "replies": []
        },
        {
            "body": "I personally feel like this is what a sugar relationship should look like to SB’s and SD’s. It’s a relationship, you should care about your partners needs, boundaries, and happiness. If you don’t want to support your partner and care for them then you’re a John and it isn’t a relationship; and if it is a relationship, you’re not a very good partner.",
            "author": "bubblerush",
            "id": "hz7v7un",
            "parent_id": "t1_hz7unbt",
            "score": 2,
            "created_utc": 1646334135.0,
            "replies": [
                {
                    "body": "So I'm a \"john\" if I don't pay her rent?\n\nBeware of Rule 5.",
                    "author": null,
                    "id": "hz7wiu8",
                    "parent_id": "t1_hz7v7un",
                    "score": 3,
                    "created_utc": 1646334645.0,
                    "replies": [
                        {
                            "body": "You’re a John if you have the means to care for your partners basic needs but you choose not to.",
                            "author": "bubblerush",
                            "id": "hz7wz7n",
                            "parent_id": "t1_hz7wiu8",
                            "score": 6,
                            "created_utc": 1646334825.0,
                            "replies": [
                                {
                                    "body": "You're going to have a very bad time here if this is the attitude you have to SRs.",
                                    "author": "bigdickginger",
                                    "id": "hz7x8tk",
                                    "parent_id": "t1_hz7wz7n",
                                    "score": 4,
                                    "created_utc": 1646334929.0,
                                    "replies": [
                                        {
                                            "body": "No, I’m really not. I’ve had two very successful relationships. One lasting two years, and he exceeded these expectations. I’ve had a great time, and I want other women to as well. :)",
                                            "author": "bubblerush",
                                            "id": "hz7xwhi",
                                            "parent_id": "t1_hz7x8tk",
                                            "score": 12,
                                            "created_utc": 1646335187.0,
                                            "replies": [
                                                {
                                                    "body": "Your recent \"should I find a new SD\" post suggests otherwise.",
                                                    "author": null,
                                                    "id": "hz8jinf",
                                                    "parent_id": "t1_hz7xwhi",
                                                    "score": 14,
                                                    "created_utc": 1646343898.0,
                                                    "replies": [
                                                        {
                                                            "body": "Again I’ve had two, and when they don’t meet my expectations I end the relationship. Simple as that.",
                                                            "author": "bubblerush",
                                                            "id": "hz8jwwq",
                                                            "parent_id": "t1_hz8jinf",
                                                            "score": 3,
                                                            "created_utc": 1646344062.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "body": "Hmm, your post history suggests otherwise. You were complaining about your “Clingy” SD who wanted to spend more time with you a month back and the fact that you got him a more expensive gift than what he got you for Christmas",
                                                    "author": "supportiveceo",
                                                    "id": "hz886yz",
                                                    "parent_id": "t1_hz7xwhi",
                                                    "score": 12,
                                                    "created_utc": 1646339232.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "👏👏👏👏.  I feel like you and I have butted heads before, but I'm in complete agreement with you here.",
            "author": "HailToTheQuinn",
            "id": "hz9g8n9",
            "parent_id": "t1_hz96lcv",
            "score": 1,
            "created_utc": 1646358350.0,
            "replies": []
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "hz8npnr",
            "parent_id": "t1_hz8hynx",
            "score": 2,
            "created_utc": 1646345700.0,
            "replies": [
                {
                    "body": "I can read, and I’m not the one projecting, but go off, “sweetie” - and take your passive-aggressive misogynist BS with you 💁‍♀️",
                    "author": "allyafterdark",
                    "id": "hz8p7l8",
                    "parent_id": "t1_hz8npnr",
                    "score": -1,
                    "created_utc": 1646346324.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Again never said that we were better, just different. As a SB there’s more of an expectation, in a vanilla relationship I can show up with no makeup wearing sweatpants. I’m not saying that it’s SW with extra steps but lots of “SD’s” seem to treat it like it is. The whole idea behind sugar relationships is young attractive women dating older wealthy men so that they’re both able to experience things that they wouldn’t normally be able to. Unfortunately men seem to treat sugar relationships like a discount escort service because what their offering wouldn’t get them much from an escort.",
            "author": "bubblerush",
            "id": "hz8j2p0",
            "parent_id": "t1_hz8ib5h",
            "score": 9,
            "created_utc": 1646343715.0,
            "replies": [
                {
                    "body": "It’s implied, I’m not saying you *literally said it in as many words,* you arrogant ass.\n\nLMAO, you think vanilla women turn up to dates and times out in sweatpants?! Are you just a misogynist troll, or are you **actually** that freaking ignorant?! 😂 \n\nNot sure why you insist on repeatedly putting SD in scare quotes, that’s literally the abbreviation they use… 🤷‍♀️ \n\nLiterally not addressing anything *still*, but go off.",
                    "author": "allyafterdark",
                    "id": "hz8k8v5",
                    "parent_id": "t1_hz8j2p0",
                    "score": 2,
                    "created_utc": 1646344199.0,
                    "replies": []
                },
                {
                    "body": "“a SB there’s more of an expectation, in a vanilla relationship I can show up with no makeup wearing sweatpants”.\n\nSeems like you have never been in a real sugar relationship! Of course there is a difference between dating loser vanillas and wealthy SDs but don’t tell me a genuine SD won’t mind you showing up more casually in an established sugar relationship.\n\nPlus we all know how you ladies take abuse and try to impress loser vanillas with clothes, makeup and instagram posts.",
                    "author": null,
                    "id": "hz8n75j",
                    "parent_id": "t1_hz8j2p0",
                    "score": -3,
                    "created_utc": 1646345487.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Or maybe she's a good actress, ah no? Lol I swear you SDs on here are so delusional.",
            "author": "Pretty_Ant_3094",
            "id": "hz994bm",
            "parent_id": "t1_hz8qeoz",
            "score": 6,
            "created_utc": 1646354986.0,
            "replies": []
        },
        {
            "body": "You might be one of the few gorgeous ones, but the odds are more likely that your SB is simply a great actress and playing her part very well",
            "author": "Vegetable-Slip-6245",
            "id": "hz9a9bi",
            "parent_id": "t1_hz8qeoz",
            "score": 4,
            "created_utc": 1646355520.0,
            "replies": []
        },
        {
            "body": "Believe me in doing just fine. I have my expectations and I only spend time with men who meet them.",
            "author": "bubblerush",
            "id": "hz839ci",
            "parent_id": "t1_hz832yj",
            "score": -5,
            "created_utc": 1646337293.0,
            "replies": []
        },
        {
            "body": "\"Wages\" \"services\" hook your 'prices' into escort pricing ... talk about showing your hand.   A business-oriented sugar service is nothing like the sugar relationship the rest of us are here to talk about.  Financial support is often discussed here -- were are just  not going to let more business-oriented faux-sugar models introduce escort concepts, pricing, etc., into this sub.\n\nThere are a number of subs where escorts and service-centric revenue-oriented \"sugar\" services are discussed.  Escorts and johns are a problem within sugar, we're not going to let anyone gaslight us into thinking they're a solution.  You're not a good fit here if your concept of sugar is service-oriented, centered on \"wages\", etc.\n\nContrary to unpopular belief, one can discuss financial support without referencing sex service or escort rates.",
            "author": "Azurecole",
            "id": "hz8h0xz",
            "parent_id": "t1_hz8g1uz",
            "score": 0,
            "created_utc": 1646342776.0,
            "replies": []
        },
        {
            "body": "\"Wages\" \"services\" \"hook your 'prices' into escorts\" ... talking about showing your hand.   A business-oriented sugar service is nothing like the sugar relationship the rest of us are here to talk about.  Financial support is often discussed here -- were are just  not going to let more business-oriented faux-sugar models introduce escort concepts, pricing, etc., into this sub.  \n\nThere are a number of subs where escorts and service-centric revenue-oriented \"sugar\" services are discussed.  Escorts and johns are a problem within sugar, we're not going to let anyone gaslight us into thinking they're a solution.  You're not a good fit here if your concept of sugar is service-oriented, centered on \"wages\", etc.",
            "author": "Azurecole",
            "id": "hz8h0h0",
            "parent_id": "t1_hz8g1uz",
            "score": 1,
            "created_utc": 1646342769.0,
            "replies": []
        },
        {
            "body": "it’s just as bad as the SW gate keeping. SB of the world unite…! 😂😂😂\n\nFunny thing is there would be 1000s of scab SB that would cross the picket line to steel the entitled SBs SDs in a heart beat",
            "author": "NickPfromYuma",
            "id": "hz8rlox",
            "parent_id": "t1_hz84hhn",
            "score": 0,
            "created_utc": 1646347338.0,
            "replies": []
        },
        {
            "body": "She'd be your SB if you were any kind of SD.",
            "author": "ChapterRelative",
            "id": "hz97myd",
            "parent_id": "t1_hz8qz5b",
            "score": 0,
            "created_utc": 1646354314.0,
            "replies": [
                {
                    "body": "She out earns this entire forum, what are we offering her that she doesn't already have for herself?",
                    "author": "storm170",
                    "id": "hz9b120",
                    "parent_id": "t1_hz97myd",
                    "score": 25,
                    "created_utc": 1646355935.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Gotcha lol. I feel you. I’m great at picking good investments. They are the ones I don’t go into…",
            "author": "Kevinburnz",
            "id": "hz8cyhe",
            "parent_id": "t1_hz8cpbr",
            "score": 7,
            "created_utc": 1646341107.0,
            "replies": [
                {
                    "body": "Because If YOU go into… the opposite happens. A felllow retard. Hello friend.",
                    "author": "JamesGarrison",
                    "id": "hz8d8rz",
                    "parent_id": "t1_hz8cyhe",
                    "score": 0,
                    "created_utc": 1646341217.0,
                    "replies": [
                        {
                            "body": "Greetings. See you at the crypto rally 😜",
                            "author": "Kevinburnz",
                            "id": "hz8dnlk",
                            "parent_id": "t1_hz8d8rz",
                            "score": 3,
                            "created_utc": 1646341380.0,
                            "replies": [
                                {
                                    "body": "Winter is coming…",
                                    "author": "JamesGarrison",
                                    "id": "hz8dt2w",
                                    "parent_id": "t1_hz8dnlk",
                                    "score": 1,
                                    "created_utc": 1646341445.0,
                                    "replies": [
                                        {
                                            "body": "If you’re out, I’m in bro 😂😂\n\nI agree with you tho, winter is coming. Good year for accumulating..",
                                            "author": "Intelli_gent_0601",
                                            "id": "hz8euax",
                                            "parent_id": "t1_hz8dt2w",
                                            "score": 2,
                                            "created_utc": 1646341872.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yeah, it's the classic SB gets lowballed and wants to rant about it and blame all SDs instead of accept the rejection.",
            "author": null,
            "id": "hz89db4",
            "parent_id": "t1_hz88wg2",
            "score": 3,
            "created_utc": 1646339701.0,
            "replies": []
        },
        {
            "body": "Again. That's not a problem responsible adults have in their intimate relationships. If a woman can't communicate her needs in the context of her own relationships then that is a sign that she isn't ready for a real relationship and your little bullet list isn't doing anyone any favors in that scenario.\n\nThis is true for men as well. Communication is key for everyone.",
            "author": "bigdickginger",
            "id": "hz80y00",
            "parent_id": "t1_hz7yqns",
            "score": 13,
            "created_utc": 1646336383.0,
            "replies": [
                {
                    "body": "18-19 year old girls aren’t typically reasonable adults. They’re teenagers and there’s a lot of them in these relationships. It might come as a shock to you but teenage girls sometime have a hard time communicating with grown men.",
                    "author": "bubblerush",
                    "id": "hz81c2z",
                    "parent_id": "t1_hz80y00",
                    "score": 2,
                    "created_utc": 1646336539.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Bang on - pretty tough to expect a janitor to act like an astronaught, so not sure why dudes expect young inexperienced girls to act full of class and sophistication either. \n\nPeople need to go in with their eyes wide open and not be salty if/when it doesn’t work out...",
            "author": "Intelli_gent_0601",
            "id": "hz8g4hx",
            "parent_id": "t1_hz832ea",
            "score": 10,
            "created_utc": 1646342394.0,
            "replies": []
        },
        {
            "body": "So I'm a \"john\" if I don't pay her rent?\n\nBeware of Rule 5.",
            "author": null,
            "id": "hz7wiu8",
            "parent_id": "t1_hz7v7un",
            "score": 3,
            "created_utc": 1646334645.0,
            "replies": [
                {
                    "body": "You’re a John if you have the means to care for your partners basic needs but you choose not to.",
                    "author": "bubblerush",
                    "id": "hz7wz7n",
                    "parent_id": "t1_hz7wiu8",
                    "score": 6,
                    "created_utc": 1646334825.0,
                    "replies": [
                        {
                            "body": "You're going to have a very bad time here if this is the attitude you have to SRs.",
                            "author": "bigdickginger",
                            "id": "hz7x8tk",
                            "parent_id": "t1_hz7wz7n",
                            "score": 4,
                            "created_utc": 1646334929.0,
                            "replies": [
                                {
                                    "body": "No, I’m really not. I’ve had two very successful relationships. One lasting two years, and he exceeded these expectations. I’ve had a great time, and I want other women to as well. :)",
                                    "author": "bubblerush",
                                    "id": "hz7xwhi",
                                    "parent_id": "t1_hz7x8tk",
                                    "score": 12,
                                    "created_utc": 1646335187.0,
                                    "replies": [
                                        {
                                            "body": "Your recent \"should I find a new SD\" post suggests otherwise.",
                                            "author": null,
                                            "id": "hz8jinf",
                                            "parent_id": "t1_hz7xwhi",
                                            "score": 14,
                                            "created_utc": 1646343898.0,
                                            "replies": [
                                                {
                                                    "body": "Again I’ve had two, and when they don’t meet my expectations I end the relationship. Simple as that.",
                                                    "author": "bubblerush",
                                                    "id": "hz8jwwq",
                                                    "parent_id": "t1_hz8jinf",
                                                    "score": 3,
                                                    "created_utc": 1646344062.0,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "body": "Hmm, your post history suggests otherwise. You were complaining about your “Clingy” SD who wanted to spend more time with you a month back and the fact that you got him a more expensive gift than what he got you for Christmas",
                                            "author": "supportiveceo",
                                            "id": "hz886yz",
                                            "parent_id": "t1_hz7xwhi",
                                            "score": 12,
                                            "created_utc": 1646339232.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I can read, and I’m not the one projecting, but go off, “sweetie” - and take your passive-aggressive misogynist BS with you 💁‍♀️",
            "author": "allyafterdark",
            "id": "hz8p7l8",
            "parent_id": "t1_hz8npnr",
            "score": -1,
            "created_utc": 1646346324.0,
            "replies": []
        },
        {
            "body": "It’s implied, I’m not saying you *literally said it in as many words,* you arrogant ass.\n\nLMAO, you think vanilla women turn up to dates and times out in sweatpants?! Are you just a misogynist troll, or are you **actually** that freaking ignorant?! 😂 \n\nNot sure why you insist on repeatedly putting SD in scare quotes, that’s literally the abbreviation they use… 🤷‍♀️ \n\nLiterally not addressing anything *still*, but go off.",
            "author": "allyafterdark",
            "id": "hz8k8v5",
            "parent_id": "t1_hz8j2p0",
            "score": 2,
            "created_utc": 1646344199.0,
            "replies": []
        },
        {
            "body": "“a SB there’s more of an expectation, in a vanilla relationship I can show up with no makeup wearing sweatpants”.\n\nSeems like you have never been in a real sugar relationship! Of course there is a difference between dating loser vanillas and wealthy SDs but don’t tell me a genuine SD won’t mind you showing up more casually in an established sugar relationship.\n\nPlus we all know how you ladies take abuse and try to impress loser vanillas with clothes, makeup and instagram posts.",
            "author": null,
            "id": "hz8n75j",
            "parent_id": "t1_hz8j2p0",
            "score": -3,
            "created_utc": 1646345487.0,
            "replies": []
        },
        {
            "body": "She out earns this entire forum, what are we offering her that she doesn't already have for herself?",
            "author": "storm170",
            "id": "hz9b120",
            "parent_id": "t1_hz97myd",
            "score": 25,
            "created_utc": 1646355935.0,
            "replies": []
        },
        {
            "body": "Because If YOU go into… the opposite happens. A felllow retard. Hello friend.",
            "author": "JamesGarrison",
            "id": "hz8d8rz",
            "parent_id": "t1_hz8cyhe",
            "score": 0,
            "created_utc": 1646341217.0,
            "replies": [
                {
                    "body": "Greetings. See you at the crypto rally 😜",
                    "author": "Kevinburnz",
                    "id": "hz8dnlk",
                    "parent_id": "t1_hz8d8rz",
                    "score": 3,
                    "created_utc": 1646341380.0,
                    "replies": [
                        {
                            "body": "Winter is coming…",
                            "author": "JamesGarrison",
                            "id": "hz8dt2w",
                            "parent_id": "t1_hz8dnlk",
                            "score": 1,
                            "created_utc": 1646341445.0,
                            "replies": [
                                {
                                    "body": "If you’re out, I’m in bro 😂😂\n\nI agree with you tho, winter is coming. Good year for accumulating..",
                                    "author": "Intelli_gent_0601",
                                    "id": "hz8euax",
                                    "parent_id": "t1_hz8dt2w",
                                    "score": 2,
                                    "created_utc": 1646341872.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "18-19 year old girls aren’t typically reasonable adults. They’re teenagers and there’s a lot of them in these relationships. It might come as a shock to you but teenage girls sometime have a hard time communicating with grown men.",
            "author": "bubblerush",
            "id": "hz81c2z",
            "parent_id": "t1_hz80y00",
            "score": 2,
            "created_utc": 1646336539.0,
            "replies": []
        },
        {
            "body": "You’re a John if you have the means to care for your partners basic needs but you choose not to.",
            "author": "bubblerush",
            "id": "hz7wz7n",
            "parent_id": "t1_hz7wiu8",
            "score": 6,
            "created_utc": 1646334825.0,
            "replies": [
                {
                    "body": "You're going to have a very bad time here if this is the attitude you have to SRs.",
                    "author": "bigdickginger",
                    "id": "hz7x8tk",
                    "parent_id": "t1_hz7wz7n",
                    "score": 4,
                    "created_utc": 1646334929.0,
                    "replies": [
                        {
                            "body": "No, I’m really not. I’ve had two very successful relationships. One lasting two years, and he exceeded these expectations. I’ve had a great time, and I want other women to as well. :)",
                            "author": "bubblerush",
                            "id": "hz7xwhi",
                            "parent_id": "t1_hz7x8tk",
                            "score": 12,
                            "created_utc": 1646335187.0,
                            "replies": [
                                {
                                    "body": "Your recent \"should I find a new SD\" post suggests otherwise.",
                                    "author": null,
                                    "id": "hz8jinf",
                                    "parent_id": "t1_hz7xwhi",
                                    "score": 14,
                                    "created_utc": 1646343898.0,
                                    "replies": [
                                        {
                                            "body": "Again I’ve had two, and when they don’t meet my expectations I end the relationship. Simple as that.",
                                            "author": "bubblerush",
                                            "id": "hz8jwwq",
                                            "parent_id": "t1_hz8jinf",
                                            "score": 3,
                                            "created_utc": 1646344062.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "Hmm, your post history suggests otherwise. You were complaining about your “Clingy” SD who wanted to spend more time with you a month back and the fact that you got him a more expensive gift than what he got you for Christmas",
                                    "author": "supportiveceo",
                                    "id": "hz886yz",
                                    "parent_id": "t1_hz7xwhi",
                                    "score": 12,
                                    "created_utc": 1646339232.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Greetings. See you at the crypto rally 😜",
            "author": "Kevinburnz",
            "id": "hz8dnlk",
            "parent_id": "t1_hz8d8rz",
            "score": 3,
            "created_utc": 1646341380.0,
            "replies": [
                {
                    "body": "Winter is coming…",
                    "author": "JamesGarrison",
                    "id": "hz8dt2w",
                    "parent_id": "t1_hz8dnlk",
                    "score": 1,
                    "created_utc": 1646341445.0,
                    "replies": [
                        {
                            "body": "If you’re out, I’m in bro 😂😂\n\nI agree with you tho, winter is coming. Good year for accumulating..",
                            "author": "Intelli_gent_0601",
                            "id": "hz8euax",
                            "parent_id": "t1_hz8dt2w",
                            "score": 2,
                            "created_utc": 1646341872.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "You're going to have a very bad time here if this is the attitude you have to SRs.",
            "author": "bigdickginger",
            "id": "hz7x8tk",
            "parent_id": "t1_hz7wz7n",
            "score": 4,
            "created_utc": 1646334929.0,
            "replies": [
                {
                    "body": "No, I’m really not. I’ve had two very successful relationships. One lasting two years, and he exceeded these expectations. I’ve had a great time, and I want other women to as well. :)",
                    "author": "bubblerush",
                    "id": "hz7xwhi",
                    "parent_id": "t1_hz7x8tk",
                    "score": 12,
                    "created_utc": 1646335187.0,
                    "replies": [
                        {
                            "body": "Your recent \"should I find a new SD\" post suggests otherwise.",
                            "author": null,
                            "id": "hz8jinf",
                            "parent_id": "t1_hz7xwhi",
                            "score": 14,
                            "created_utc": 1646343898.0,
                            "replies": [
                                {
                                    "body": "Again I’ve had two, and when they don’t meet my expectations I end the relationship. Simple as that.",
                                    "author": "bubblerush",
                                    "id": "hz8jwwq",
                                    "parent_id": "t1_hz8jinf",
                                    "score": 3,
                                    "created_utc": 1646344062.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Hmm, your post history suggests otherwise. You were complaining about your “Clingy” SD who wanted to spend more time with you a month back and the fact that you got him a more expensive gift than what he got you for Christmas",
                            "author": "supportiveceo",
                            "id": "hz886yz",
                            "parent_id": "t1_hz7xwhi",
                            "score": 12,
                            "created_utc": 1646339232.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Winter is coming…",
            "author": "JamesGarrison",
            "id": "hz8dt2w",
            "parent_id": "t1_hz8dnlk",
            "score": 1,
            "created_utc": 1646341445.0,
            "replies": [
                {
                    "body": "If you’re out, I’m in bro 😂😂\n\nI agree with you tho, winter is coming. Good year for accumulating..",
                    "author": "Intelli_gent_0601",
                    "id": "hz8euax",
                    "parent_id": "t1_hz8dt2w",
                    "score": 2,
                    "created_utc": 1646341872.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "No, I’m really not. I’ve had two very successful relationships. One lasting two years, and he exceeded these expectations. I’ve had a great time, and I want other women to as well. :)",
            "author": "bubblerush",
            "id": "hz7xwhi",
            "parent_id": "t1_hz7x8tk",
            "score": 12,
            "created_utc": 1646335187.0,
            "replies": [
                {
                    "body": "Your recent \"should I find a new SD\" post suggests otherwise.",
                    "author": null,
                    "id": "hz8jinf",
                    "parent_id": "t1_hz7xwhi",
                    "score": 14,
                    "created_utc": 1646343898.0,
                    "replies": [
                        {
                            "body": "Again I’ve had two, and when they don’t meet my expectations I end the relationship. Simple as that.",
                            "author": "bubblerush",
                            "id": "hz8jwwq",
                            "parent_id": "t1_hz8jinf",
                            "score": 3,
                            "created_utc": 1646344062.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Hmm, your post history suggests otherwise. You were complaining about your “Clingy” SD who wanted to spend more time with you a month back and the fact that you got him a more expensive gift than what he got you for Christmas",
                    "author": "supportiveceo",
                    "id": "hz886yz",
                    "parent_id": "t1_hz7xwhi",
                    "score": 12,
                    "created_utc": 1646339232.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "If you’re out, I’m in bro 😂😂\n\nI agree with you tho, winter is coming. Good year for accumulating..",
            "author": "Intelli_gent_0601",
            "id": "hz8euax",
            "parent_id": "t1_hz8dt2w",
            "score": 2,
            "created_utc": 1646341872.0,
            "replies": []
        },
        {
            "body": "Your recent \"should I find a new SD\" post suggests otherwise.",
            "author": null,
            "id": "hz8jinf",
            "parent_id": "t1_hz7xwhi",
            "score": 14,
            "created_utc": 1646343898.0,
            "replies": [
                {
                    "body": "Again I’ve had two, and when they don’t meet my expectations I end the relationship. Simple as that.",
                    "author": "bubblerush",
                    "id": "hz8jwwq",
                    "parent_id": "t1_hz8jinf",
                    "score": 3,
                    "created_utc": 1646344062.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Hmm, your post history suggests otherwise. You were complaining about your “Clingy” SD who wanted to spend more time with you a month back and the fact that you got him a more expensive gift than what he got you for Christmas",
            "author": "supportiveceo",
            "id": "hz886yz",
            "parent_id": "t1_hz7xwhi",
            "score": 12,
            "created_utc": 1646339232.0,
            "replies": []
        },
        {
            "body": "Again I’ve had two, and when they don’t meet my expectations I end the relationship. Simple as that.",
            "author": "bubblerush",
            "id": "hz8jwwq",
            "parent_id": "t1_hz8jinf",
            "score": 3,
            "created_utc": 1646344062.0,
            "replies": []
        }
    ]
}