{
    "title": "RAGE POST** SD left me with a very large tab tonight",
    "post_id": "h97b2f",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/h97b2f/rage_post_sd_left_me_with_a_very_large_tab_tonight/",
    "author": "_Fortuna_",
    "body": "So let me start out by saying that I've been seeing this man for quite some time. He's very hard working and generous, but can be incredibly self absorbed and childish at times, particularly when he drinks. He also has difficulty making plans that are not day of/last minute, which I have taken issue with and have tried to politely set boundaries in regards to this.\n\n&#x200B;\n\n&#x200B;\n\nANYWHOOOO. He's been asking me to go to dinner all week long, and I told him early on that I would be very busy all week with work and family. We made plans to go out Thursday after I was done with family lake day. I ended up being too tired to go out so we just doordashed n chilled. Great food, sex, stand up comedy, everything.\n\n&#x200B;\n\nToday he again asks to go to dinner. I'm working all day, but I agree. What I meant to tell him is that I cant stay with him tonight. What I actually said was that I can't be up late. A minute but mountain of a detail in events to come.\n\n&#x200B;\n\nAt dinner he begins to talk about what we're doing after, and I remind him that I can't be up late. I'd like to just go home. Well.... he starts pitching the mother of all bitch fits. I mean he's spearing his salad like a cave man, elbows on the table, looking like a baby with a popped balloon. I immediately apologize about the miscommunication. Because he chose to make plans the day of I was texting him from work and didn't send the entirety of my commitment to said evening.\n\n&#x200B;\n\nApparently he didn't want an apology. He just wanted to be a fucking child, and talk down to me for being so \"inconsiderate.\" About this time I had about enough of him accosting the appetizers and gaslighting me, so I went into full on you-will-stop-this-childish-behavior-right-now-young-man-or-so-help-me mode. I told him thru gritted teeth that he was being self-absorbed, hurtful, rude, and embarrassing. To which he responded, \"Yeah, well maybe you are too.\" I was not.\n\n&#x200B;\n\nI then threatened to leave, he calmed down, then started back at again, I'm really going to leave now, he says, \"No I'm leaving, you got the tab.\"\n\n&#x200B;\n\nAND HE LEAVES. I have several hundred dollars worth of food now. Yay. Literally a day and a half's pay for me down the hole. Lesson learned.\n\n&#x200B;\n\nFriends, keep an eye out for those red flags. They are red for a reason. smdh\n\n&#x200B;\n\n&#x200B;\n\n&#x200B;\n\nEDIT: Guys he left his credit card at my house. He frequently lets me use it for shopping so it isn't unusual for me to have it. I would never use it without persmission... right?\n\n&#x200B;\n\n&#x200B;\n\nEdit: Some things to add that I said in the comments\n\n&#x200B;\n\nSo after he stormed off,  he called my phone about 5 times (rejected) then comes back about ten minutes later. He sat down and before he could speak I said, \"This is all my food now. You can go.\"\n\nMy dignity is not a worth a damn dinner.\n\nI used my own money to pay. His card was at my house. I'm thinking of sending him the world's biggest dildo and a penis pump. Let me know if you think of anything else.\n\nWe've been together 5 ish months, though I've known a few of his friends for 10+ years. He's very good to me most of the time, but his drinking is problematic. He'd been out on his boat all day so he showed up late and apparently pretty lit. Unfortunately I didn't realize this till after we got to the restaurant.\n\nAs for the cc, it's not mine, but he gives it to me to use pretty regularly. Like I said, he can be very sweet. He gets me gifts and things he thinks I might need all the time. I just have to mention in passing that I need to go buy something and suddenly it's already been purchased and on the way. He'll text me when he's at the mall and demand that I send him pics of things I want. He'll go to the grocery store and bring me piles of food then cooks me dinner AND cleans!\n\nI'm not ppm or monthly, but he'll give me money whenever I say I need it.\n\nI don't know what to do with this man!\n\n&#x200B;",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/h97b2f/rage_post_sd_left_me_with_a_very_large_tab_tonight/",
    "score": 129,
    "upvote_ratio": 0.89,
    "created_utc": 1592188495.0,
    "num_comments": 138,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "Damn, what a child. Can’t wait to hear how he tries to come crawling back.",
            "author": "mraspencer",
            "id": "fuv3x2a",
            "parent_id": "t3_h97b2f",
            "score": 59,
            "created_utc": 1592189612.0,
            "replies": [
                {
                    "body": "Guarantee he will 100%. We met through mutual friends, and we hang out at some of the same places. I highly doubt I'll be rid of him for a while.\n\n&#x200B;\n\nDo I have permission to rinse his ass for this?",
                    "author": "_Fortuna_",
                    "id": "fuv4e5l",
                    "parent_id": "t1_fuv3x2a",
                    "score": 54,
                    "created_utc": 1592189917.0,
                    "replies": [
                        {
                            "body": "He definitely owes you. And not just for the cost of the bill, there’s an asshole tax",
                            "author": "mraspencer",
                            "id": "fuv4gqa",
                            "parent_id": "t1_fuv4e5l",
                            "score": 57,
                            "created_utc": 1592189963.0,
                            "replies": []
                        },
                        {
                            "body": "Why would you want him back though? Buy stuff on his card equivalent to what his food would have cost then break contact and don't bother engaging with him in any way again. If he's going to be a baby don't chance that he'll make a fuss about payments on his cards that might bring undue scrutiny. Compensate yourself then cut him out of your Life.",
                            "author": "KeyToGramercy",
                            "id": "fuwcqjl",
                            "parent_id": "t1_fuv4e5l",
                            "score": 11,
                            "created_utc": 1592226922.0,
                            "replies": []
                        },
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "fuv4jzo",
                            "parent_id": "t1_fuv4e5l",
                            "score": 28,
                            "created_utc": 1592190022.0,
                            "replies": [
                                {
                                    "body": "Only shave off ONE   let him decide if he wants to look  crazy or like a drag queen",
                                    "author": "pinotandsugar",
                                    "id": "fuvesot",
                                    "parent_id": "t1_fuv4jzo",
                                    "score": 20,
                                    "created_utc": 1592197197.0,
                                    "replies": [
                                        {
                                            "body": "Oh my god, you genius maniac!",
                                            "author": "_Fortuna_",
                                            "id": "fuvfmc9",
                                            "parent_id": "t1_fuvesot",
                                            "score": 6,
                                            "created_utc": 1592197822.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "yessss.... I'm thinking I'll shave off all the \"hair\" in his bald spot too",
                                    "author": "_Fortuna_",
                                    "id": "fuv4xro",
                                    "parent_id": "t1_fuv4jzo",
                                    "score": 28,
                                    "created_utc": 1592190274.0,
                                    "replies": [
                                        {
                                            "body": "I like the idea of you giving him an heir cut.",
                                            "author": "TY2022",
                                            "id": "fuv7qhn",
                                            "parent_id": "t1_fuv4xro",
                                            "score": 11,
                                            "created_utc": 1592192150.0,
                                            "replies": [
                                                {
                                                    "body": "Hmmm, are you saying I should have his baby? Yes... yes... the ultimate rinse... child support.",
                                                    "author": "_Fortuna_",
                                                    "id": "fuv7vh2",
                                                    "parent_id": "t1_fuv7qhn",
                                                    "score": 29,
                                                    "created_utc": 1592192244.0,
                                                    "replies": [
                                                        {
                                                            "body": "[deleted]",
                                                            "author": null,
                                                            "id": "fuv8ipa",
                                                            "parent_id": "t1_fuv7vh2",
                                                            "score": 11,
                                                            "created_utc": 1592192674.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Why not both?",
                                                                    "author": "superneutral",
                                                                    "id": "fux0zj9",
                                                                    "parent_id": "t1_fuv8ipa",
                                                                    "score": 2,
                                                                    "created_utc": 1592239515.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "body": "Oh my god yessssssss 🤣🤣🤣",
                                                            "author": "kimchi_Queen",
                                                            "id": "fuvt1rn",
                                                            "parent_id": "t1_fuv7vh2",
                                                            "score": 3,
                                                            "created_utc": 1592209448.0,
                                                            "replies": []
                                                        },
                                                        {
                                                            "body": "hahahahahahahahahhahahhahaha",
                                                            "author": "TY2022",
                                                            "id": "fuv7y5h",
                                                            "parent_id": "t1_fuv7vh2",
                                                            "score": 5,
                                                            "created_utc": 1592192293.0,
                                                            "replies": []
                                                        },
                                                        {
                                                            "body": "Would his genes help produce a quality baby?",
                                                            "author": "mrjimmyjsz",
                                                            "id": "fuy3wg1",
                                                            "parent_id": "t1_fuv7vh2",
                                                            "score": 2,
                                                            "created_utc": 1592258135.0,
                                                            "replies": [
                                                                {
                                                                    "body": "I'm afraid mine would be doing most of the heavy lifting 😅",
                                                                    "author": "_Fortuna_",
                                                                    "id": "fuy4s2q",
                                                                    "parent_id": "t1_fuy3wg1",
                                                                    "score": 3,
                                                                    "created_utc": 1592258538.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "fuv54yh",
                                            "parent_id": "t1_fuv4xro",
                                            "score": 16,
                                            "created_utc": 1592190407.0,
                                            "replies": [
                                                {
                                                    "body": "OMG, the fact that there's a word for that is just outstanding.",
                                                    "author": "_Fortuna_",
                                                    "id": "fuv5vrf",
                                                    "parent_id": "t1_fuv54yh",
                                                    "score": 12,
                                                    "created_utc": 1592190903.0,
                                                    "replies": []
                                                },
                                                {
                                                    "body": "💀💀💀",
                                                    "author": "LikeHoney99",
                                                    "id": "fuwyfbb",
                                                    "parent_id": "t1_fuv54yh",
                                                    "score": 1,
                                                    "created_utc": 1592238275.0,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "body": "Shave off all the hair around his bald spot, just leave the fluff :)",
                                            "author": "SlothsvPangolins",
                                            "id": "fuwrfbh",
                                            "parent_id": "t1_fuv4xro",
                                            "score": 3,
                                            "created_utc": 1592234947.0,
                                            "replies": [
                                                {
                                                    "body": "Absolutely savage.  I love it.",
                                                    "author": "_Fortuna_",
                                                    "id": "fuy7zsy",
                                                    "parent_id": "t1_fuwrfbh",
                                                    "score": 1,
                                                    "created_utc": 1592260025.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Holy Shiet! what a douche.\n\nI would work that credit card until the magnetic strip is worn off.",
                            "author": "GSSD",
                            "id": "fuwdvht",
                            "parent_id": "t1_fuv4e5l",
                            "score": 11,
                            "created_utc": 1592227650.0,
                            "replies": []
                        },
                        {
                            "body": "Yeah, you definetely have to keep us posted",
                            "author": null,
                            "id": "fuvaqro",
                            "parent_id": "t1_fuv4e5l",
                            "score": 6,
                            "created_utc": 1592194225.0,
                            "replies": []
                        },
                        {
                            "body": "*Let the rain fall down away from me...*",
                            "author": null,
                            "id": "fuvxet6",
                            "parent_id": "t1_fuv4e5l",
                            "score": 6,
                            "created_utc": 1592213857.0,
                            "replies": []
                        },
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "fux0wqu",
                            "parent_id": "t1_fuv4e5l",
                            "score": 3,
                            "created_utc": 1592239478.0,
                            "replies": [
                                {
                                    "body": "I've actually been trying to put up some healthy boundaries so I can make this work. We had stayed together all weekend so spending Sunday dinner with him seemed like an acquiescence on my part.  \n\nYou're right, he's great when he wants to be!",
                                    "author": "_Fortuna_",
                                    "id": "fux3sas",
                                    "parent_id": "t1_fux0wqu",
                                    "score": 3,
                                    "created_utc": 1592240888.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Yes. Buy things on the card in the amount you paid for that dinner. Absolutely. It’s an arrangement. Never lose sight of that or let him lose sight of that either. God ! This sounds exactly like an SD I had ! So many great qualities and could be super helpful and generous ... then such a big. Fat. Fricking. Baby. Especially when he drank. And the storming out then calling a million times minutes later. And the for no good reason last minute dates. Mine was married, but even then, the last minute stuff didn’t make sense. He had a million excuses he could have used to make plans.",
                            "author": null,
                            "id": "fuz3yoj",
                            "parent_id": "t1_fuv4e5l",
                            "score": 3,
                            "created_utc": 1592277667.0,
                            "replies": []
                        },
                        {
                            "body": "It would be interesting what his view of the nights events would be.  I would guess he would tell a very different version than yours, a may share a version of it with mutual friends.   Just be careful for this blow up withing your mutual friends network.",
                            "author": "willfromvb",
                            "id": "fuw5p28",
                            "parent_id": "t1_fuv4e5l",
                            "score": 2,
                            "created_utc": 1592221676.0,
                            "replies": [
                                {
                                    "body": "Of course he would tell a very different version.  One where it's ok to invite me to dinner and be justified in leaving me with a tab he knows I can't afford.",
                                    "author": "_Fortuna_",
                                    "id": "fuwlanz",
                                    "parent_id": "t1_fuw5p28",
                                    "score": 6,
                                    "created_utc": 1592231888.0,
                                    "replies": []
                                },
                                {
                                    "body": "You know what’s interesting is, whenever I tried to discuss his behavior the next day, he definitely was embarrassed. He wouldn’t want to “get into it” Though. “Can you just give me the benefit of the doubt?”",
                                    "author": null,
                                    "id": "fuz4dss",
                                    "parent_id": "t1_fuw5p28",
                                    "score": 2,
                                    "created_utc": 1592277930.0,
                                    "replies": []
                                },
                                {
                                    "body": "Really? My guess is they also know what he’s like drunk.",
                                    "author": "LikeHoney99",
                                    "id": "fuwyksg",
                                    "parent_id": "t1_fuw5p28",
                                    "score": 2,
                                    "created_utc": 1592238346.0,
                                    "replies": [
                                        {
                                            "body": "Yes you pretty much nailed it. There's really no trouble he could cause for me that wouldn't make things worse for him.",
                                            "author": "_Fortuna_",
                                            "id": "fuy8kg2",
                                            "parent_id": "t1_fuwyksg",
                                            "score": 3,
                                            "created_utc": 1592260295.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "Could be.  Then she wouldnt have to worry if he tried to poison the well with their mutual friends.  \n\nIm just saying that if he is that vindictive to leave her with the bill, I would be concerned with what else he may try to do t ok influence their mutual friends.  It gets sloppy with mutual friend.\n\nI'm certainly not trying to take his side.  We only know her side of the story.",
                                            "author": "willfromvb",
                                            "id": "fux0n23",
                                            "parent_id": "t1_fuwyksg",
                                            "score": 1,
                                            "created_utc": 1592239348.0,
                                            "replies": [
                                                {
                                                    "body": "You sound awfully apologetic for not being on his side....",
                                                    "author": "LikeHoney99",
                                                    "id": "fux1paq",
                                                    "parent_id": "t1_fux0n23",
                                                    "score": -1,
                                                    "created_utc": 1592239865.0,
                                                    "replies": [
                                                        {
                                                            "body": "That's a strange reaction.",
                                                            "author": "willfromvb",
                                                            "id": "fuxkx2b",
                                                            "parent_id": "t1_fux1paq",
                                                            "score": 2,
                                                            "created_utc": 1592248835.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Oh, how so?",
                                                                    "author": "LikeHoney99",
                                                                    "id": "fuxkzlx",
                                                                    "parent_id": "t1_fuxkx2b",
                                                                    "score": 0,
                                                                    "created_utc": 1592248869.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "I'm amazed how quickly people are rendering judgement and  recommending punishment knowing only her side of the story.  \n\nI regularly meditate workplace disputes.  You rarely get the full story when you only hear one side.   I never want  to take sides other than the side of truth. \n\nBy her own admission she has being seeing this man for \"some time\" .  If he really is \"all bad\" and she is \"all good\", she has some culpability for continuing the relationship.  I suspect he is neither \"all bad\" nor is she \"all good\" and there is history in their relationship that contributed to his behavior more than what is described.",
                                                                            "author": "willfromvb",
                                                                            "id": "fuxngi3",
                                                                            "parent_id": "t1_fuxkzlx",
                                                                            "score": 1,
                                                                            "created_utc": 1592250068.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "That's interesting, but doesn't make my comment about you seeming like his apologist strange, or explain why you found it strange.",
                                                                                    "author": "LikeHoney99",
                                                                                    "id": "fuxq42i",
                                                                                    "parent_id": "t1_fuxngi3",
                                                                                    "score": 1,
                                                                                    "created_utc": 1592251361.0,
                                                                                    "replies": [
                                                                                        {
                                                                                            "body": "The assumption that there is only her side or his side is what seems strange to me.  There is also the side of truth.",
                                                                                            "author": "willfromvb",
                                                                                            "id": "fuxr61r",
                                                                                            "parent_id": "t1_fuxq42i",
                                                                                            "score": 1,
                                                                                            "created_utc": 1592251880.0,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "body": "I don’t think we’re talking about the same thing 🤷‍♀️",
                                                                                                    "author": "LikeHoney99",
                                                                                                    "id": "fuxrsjj",
                                                                                                    "parent_id": "t1_fuxr61r",
                                                                                                    "score": 2,
                                                                                                    "created_utc": 1592252191.0,
                                                                                                    "replies": []
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Why would that credit card still work? If the guy has any sense he blocked it already.",
                            "author": null,
                            "id": "fv301zy",
                            "parent_id": "t1_fuv4e5l",
                            "score": 1,
                            "created_utc": 1592361565.0,
                            "replies": [
                                {
                                    "body": "A valid assumption for any normal human being.",
                                    "author": "_Fortuna_",
                                    "id": "fv37vkq",
                                    "parent_id": "t1_fv301zy",
                                    "score": 1,
                                    "created_utc": 1592366440.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yep he is a full on jerk. \n\nThat being said just walk away or buy groceries in exactly the amount of the tab he left you with but I wouldn't do anything else with that card.",
            "author": "craa141",
            "id": "fuv7fwo",
            "parent_id": "t3_h97b2f",
            "score": 44,
            "created_utc": 1592191952.0,
            "replies": [
                {
                    "body": "She should add a tax for the inconvenience too.",
                    "author": null,
                    "id": "fuvb2ug",
                    "parent_id": "t1_fuv7fwo",
                    "score": 16,
                    "created_utc": 1592194462.0,
                    "replies": []
                },
                {
                    "body": "It is possible he thought she had the card with her and would use it for the dinner ?  Regardless he needs to be put out for recycling   However, if the sugar is needed you might keep him until you don't need to keep him.",
                    "author": "pinotandsugar",
                    "id": "fuvezwm",
                    "parent_id": "t1_fuv7fwo",
                    "score": 5,
                    "created_utc": 1592197349.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "It would be a SHAME if he never got his credit card back because his number was blocked and you accidentally got some new purses without being able to ask for his permission. It would be a real bummer if you made domestic purchases that were not of unordinary amounts, any international purchase could set off his bank to call him and verify the purchases",
            "author": "bstractig",
            "id": "fuv72ch",
            "parent_id": "t3_h97b2f",
            "score": 42,
            "created_utc": 1592191699.0,
            "replies": [
                {
                    "body": "Gosh such a thing would be sooo unfortunate.",
                    "author": "_Fortuna_",
                    "id": "fuv780f",
                    "parent_id": "t1_fuv72ch",
                    "score": 18,
                    "created_utc": 1592191805.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Sorry this happened to you, probably better it happened now than later though.",
            "author": "canavatar12",
            "id": "fuv39u7",
            "parent_id": "t3_h97b2f",
            "score": 11,
            "created_utc": 1592189204.0,
            "replies": [
                {
                    "body": "Wish it had happened before we ordered! I had to get a ride home too because he drove me 😅",
                    "author": "_Fortuna_",
                    "id": "fuv3o80",
                    "parent_id": "t1_fuv39u7",
                    "score": 18,
                    "created_utc": 1592189456.0,
                    "replies": [
                        {
                            "body": "I hope the food was good at least",
                            "author": "canavatar12",
                            "id": "fuv58fq",
                            "parent_id": "t1_fuv3o80",
                            "score": 5,
                            "created_utc": 1592190471.0,
                            "replies": [
                                {
                                    "body": "Hell yes!\n\nBurrata with Prosciutto\n\nwedge salad\n\nchilean sea bass, 11 oz Filet, 6 oz lobster\n\nBacon Brussels Sprouts, Au Gratin Potatoes\n\nKey lime pie\n\nespresso martini, Manhattan, blue cheese olive belvedere martini\n\n&#x200B;\n\n&#x200B;\n\nI have leftovers if you're hungry",
                                    "author": "_Fortuna_",
                                    "id": "fuv5ors",
                                    "parent_id": "t1_fuv58fq",
                                    "score": 41,
                                    "created_utc": 1592190773.0,
                                    "replies": [
                                        {
                                            "body": "Lol that does sound expensive",
                                            "author": "canavatar12",
                                            "id": "fuv8zbk",
                                            "parent_id": "t1_fuv5ors",
                                            "score": 10,
                                            "created_utc": 1592192988.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "fuw73ul",
                                            "parent_id": "t1_fuv5ors",
                                            "score": 9,
                                            "created_utc": 1592222834.0,
                                            "replies": [
                                                {
                                                    "body": "I wouldn't make you sleep with me if you want the leftovers lol",
                                                    "author": "_Fortuna_",
                                                    "id": "fuwmoab",
                                                    "parent_id": "t1_fuw73ul",
                                                    "score": 4,
                                                    "created_utc": 1592232588.0,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "body": "Omg. I love this list.",
                                            "author": null,
                                            "id": "fuz4orn",
                                            "parent_id": "t1_fuv5ors",
                                            "score": 2,
                                            "created_utc": 1592278118.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "So yes he's crazy but in dealing with crazy selfish people you put yourself first.... take the crap and baby behavior UNTIL AFTER he pays the bill...then let him have it...self preservation always Dear...",
            "author": null,
            "id": "fuvxcm8",
            "parent_id": "t3_h97b2f",
            "score": 9,
            "created_utc": 1592213794.0,
            "replies": [
                {
                    "body": "This is a very super great point. I take this mindset in sugaring too. I’m nice as pie til that sugar comes.",
                    "author": null,
                    "id": "fuz4vno",
                    "parent_id": "t1_fuvxcm8",
                    "score": 3,
                    "created_utc": 1592278237.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "So what brand of bag are you going to buy?? \n\nIn all seriousness, you don't owe him shit. Rinse him for the value of dinner + the headache of knowing him.",
            "author": "Actually_a_bot_accnt",
            "id": "fuvjjze",
            "parent_id": "t3_h97b2f",
            "score": 14,
            "created_utc": 1592200936.0,
            "replies": [
                {
                    "body": "I'm thinking an Hermes Birkin. Ya know, really test the limits of that cc.",
                    "author": "_Fortuna_",
                    "id": "fuvjpls",
                    "parent_id": "t1_fuvjjze",
                    "score": 13,
                    "created_utc": 1592201062.0,
                    "replies": [
                        {
                            "body": "Smart girl, Birkins can be an investment. Good luck to you, nice to see a boss bitch taking no shit from a man.",
                            "author": "Actually_a_bot_accnt",
                            "id": "fuvk3hl",
                            "parent_id": "t1_fuvjpls",
                            "score": 3,
                            "created_utc": 1592201378.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Next next next",
            "author": "lady_marin",
            "id": "fuvc9uh",
            "parent_id": "t3_h97b2f",
            "score": 8,
            "created_utc": 1592195324.0,
            "replies": []
        },
        {
            "body": "A guy who lets the woman pick up the tab is a piece of shit. Sorry you had to go through this.",
            "author": "realitytomydreams",
            "id": "fuv4l9q",
            "parent_id": "t3_h97b2f",
            "score": 50,
            "created_utc": 1592190045.0,
            "replies": [
                {
                    "body": "Yep! An absolute joke of a man that one.",
                    "author": "_Fortuna_",
                    "id": "fuv6idt",
                    "parent_id": "t1_fuv4l9q",
                    "score": 17,
                    "created_utc": 1592191325.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I would be very tempted to use the card for the amount the bill came to, but at the same time I really don’t know that it is worth it as he sounds like someone that is better to remove from your life than continue any type of interaction with.",
            "author": null,
            "id": "fuvtx6c",
            "parent_id": "t3_h97b2f",
            "score": 6,
            "created_utc": 1592210300.0,
            "replies": []
        },
        {
            "body": "Girl use that card for all its worth! He should not have put you through that!",
            "author": "caresbuns",
            "id": "fuv6sum",
            "parent_id": "t3_h97b2f",
            "score": 21,
            "created_utc": 1592191520.0,
            "replies": [
                {
                    "body": "Yeah, if she doesn’t have specific permission it could be a felony.",
                    "author": "garret6758",
                    "id": "fuvd4fk",
                    "parent_id": "t1_fuv6sum",
                    "score": 14,
                    "created_utc": 1592195947.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "In this case, I would have been tempted to use that card if I were you. \n\nHe's obviously got something going on that may not be healthy for you to be involved with. I hope you will find a graceful exit from the relationship very quickly.\n\nI think most of the gents here would agree with me.",
            "author": "ctla50-50",
            "id": "fuwpmc5",
            "parent_id": "t3_h97b2f",
            "score": 5,
            "created_utc": 1592234057.0,
            "replies": []
        },
        {
            "body": "Update us!!!!! Thanks for sharing. We have all been through this and it's important to see the true emotional energy that gets drained from an SB in these types of arrangements.",
            "author": "kimchi_Queen",
            "id": "fuvsynv",
            "parent_id": "t3_h97b2f",
            "score": 7,
            "created_utc": 1592209363.0,
            "replies": [
                {
                    "body": "Absolutely! We too often forget that our emotional currency has value as well.",
                    "author": "_Fortuna_",
                    "id": "fuy8snl",
                    "parent_id": "t1_fuvsynv",
                    "score": 2,
                    "created_utc": 1592260401.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Well, you do have the permission to do so. Why would you date him if you have to spend for him anyways?",
            "author": "freeyaman",
            "id": "fuvnnn2",
            "parent_id": "t3_h97b2f",
            "score": 3,
            "created_utc": 1592204426.0,
            "replies": []
        },
        {
            "body": "Ugh i’m so sorry, some men stay boys. but yes, it would be fair to withdraw the same amount of cash with his cc on top of some groceries... not sure about the legalities but it would send a great message if you think he wouldn’t be petty enough to threaten legal action over it.",
            "author": null,
            "id": "fuvokp8",
            "parent_id": "t3_h97b2f",
            "score": 3,
            "created_utc": 1592205245.0,
            "replies": []
        },
        {
            "body": "Are you PPM or allowance?",
            "author": "AlwaysOverPar123",
            "id": "fuwegyr",
            "parent_id": "t3_h97b2f",
            "score": 3,
            "created_utc": 1592228022.0,
            "replies": [
                {
                    "body": "Neither. More sgf",
                    "author": "_Fortuna_",
                    "id": "fuwklrc",
                    "parent_id": "t1_fuwegyr",
                    "score": 3,
                    "created_utc": 1592231527.0,
                    "replies": [
                        {
                            "body": "Jesus.",
                            "author": "LikeHoney99",
                            "id": "fuwz10y",
                            "parent_id": "t1_fuwklrc",
                            "score": 2,
                            "created_utc": 1592238559.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I am going to start charging my SB's a surcharge for not being a jerk.",
            "author": null,
            "id": "fuv4n2w",
            "parent_id": "t3_h97b2f",
            "score": 11,
            "created_utc": 1592190079.0,
            "replies": [
                {
                    "body": "This could potentially be incredibly lucrative.",
                    "author": "_Fortuna_",
                    "id": "fuv6loq",
                    "parent_id": "t1_fuv4n2w",
                    "score": 11,
                    "created_utc": 1592191387.0,
                    "replies": []
                },
                {
                    "body": "Now let's try to stay grounded in reality here.",
                    "author": "TY2022",
                    "id": "fuv6od6",
                    "parent_id": "t1_fuv4n2w",
                    "score": 15,
                    "created_utc": 1592191437.0,
                    "replies": []
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "fuv6gy9",
                    "parent_id": "t1_fuv4n2w",
                    "score": 9,
                    "created_utc": 1592191297.0,
                    "replies": [
                        {
                            "body": "😂",
                            "author": "LikeHoney99",
                            "id": "fuwyucr",
                            "parent_id": "t1_fuv6gy9",
                            "score": 2,
                            "created_utc": 1592238471.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Call the cc company and dispute the charge. Buy yourself something with the full cost of the dinner to pay for your time. Drop the card off on his porch or something.",
            "author": null,
            "id": "fuvdcao",
            "parent_id": "t3_h97b2f",
            "score": 6,
            "created_utc": 1592196112.0,
            "replies": [
                {
                    "body": "Oof. It's super tempting, but we have some mutual friends that all hang out in the same place.  I'll probably just return the card and loudly drag him for leaving me with such a big bill.  Social shame pays dividends.",
                    "author": "_Fortuna_",
                    "id": "fuvdqf1",
                    "parent_id": "t1_fuvdcao",
                    "score": 22,
                    "created_utc": 1592196402.0,
                    "replies": [
                        {
                            "body": ">Social shame pays dividends.\n\nThat is very true!",
                            "author": "bsbdfw",
                            "id": "fux0qkm",
                            "parent_id": "t1_fuvdqf1",
                            "score": 5,
                            "created_utc": 1592239394.0,
                            "replies": []
                        },
                        {
                            "body": "It does. You do you boo!",
                            "author": null,
                            "id": "fvd2vwv",
                            "parent_id": "t1_fuvdqf1",
                            "score": 1,
                            "created_utc": 1592591591.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Completely agree that this guy is an S.O.B. and an incredible jerk.  Having said that...\n\nAnyone who has worked in a corporate setting long enough has had to live with such people.  People with authority over you who are not as capable as you.  People who behave in ways that would not be countenanced in other settings.  People who you come to despise for their often intentionally intimidating behaviour directed at you.  People in a position of power over you who f\\*ck with your career and you have no recourse but to accept it, unless that behaviour becomes so untenable that you choose to leave that job.\n\nI had one of those jobs.  To make a long story short, it was a hellacious work situation for which I made about $10K per day in stock vesting.  So I ask: how long would you continue to work in a terrible job for that kind of reward?\n\nWhat I am hoping to put on display is that you are certain to have to interact with miserable people in your lifetime, people who have something you want.  With time and experience you learn to weigh the pros and cons of that job and then to do the calculus.  Of course this person should get their comeuppance, but you can't just call the police and solve that non-criminal problem.  Only you can decide how much compensation the pain is worth.",
            "author": "TY2022",
            "id": "fuv6jgn",
            "parent_id": "t3_h97b2f",
            "score": 8,
            "created_utc": 1592191346.0,
            "replies": [
                {
                    "body": "I 100% agree. \n\n&#x200B;\n\nI didn't mention that he actually came back for a second and sat down. I said, \"This is all my food now, you can go.\"\n\n&#x200B;\n\nMy dignity is not a worth a damn dinner.",
                    "author": "_Fortuna_",
                    "id": "fuv6wbj",
                    "parent_id": "t1_fuv6jgn",
                    "score": 17,
                    "created_utc": 1592191586.0,
                    "replies": [
                        {
                            "body": "WOAH! Good for fucking you. He storms off and then comes back?? How long did it take for him to come back ? What did he say? Did you pay for the dinner or did you use his card?\n\nIf you used your own CC you could pay off the balance with his CC. I really don't think it would be much of an issue. Especially since he obviously felt bad.\n\n  \nYour response is hilarious. How long have you been together? Is he good to you? He as a CC for you, so that alone seems like he might be very good to you. I have yet to ever reach that level, but I am super informal about sugaring and only ever have 1 if I do.",
                            "author": "kimchi_Queen",
                            "id": "fuvtaii",
                            "parent_id": "t1_fuv6wbj",
                            "score": 6,
                            "created_utc": 1592209685.0,
                            "replies": [
                                {
                                    "body": "Yes!! He stormed off, called my phone about 5 times (rejected) then comes back about ten minutes later. He sat down and before he could speak I told him to leave.\n\nI used my own money to pay. His card was at my house. I'm thinking of sending him the world's biggest dildo and a penis pump. Let me know if you think of anything else lol.\n\n&#x200B;\n\nWe've been together 5 ish months, though I've known a few of friends for 10+ years. He's very good to me most of the time, but his drinking is problematic. He'd been out on his boat all day so he showed up late and apparently pretty lit. Unfortunately I didn't realize this till after we got to the restaurant.\n\n&#x200B;\n\nAs for the cc, it's not mine, but he gives it to me to use pretty regularly. Like I said, he can be very sweet. He gets me gifts and things he thinks I might need all the time. He'll text me when he's at the mall and demand that I send him pics of things I want. He'll go to the grocery store and bring me piles of food then cook me dinner AND clean! \n\nI'm not ppm or monthly, but he'll give me money whenever I say I need it.\n\nI don't know what to do with this man!",
                                    "author": "_Fortuna_",
                                    "id": "fuwpnae",
                                    "parent_id": "t1_fuvtaii",
                                    "score": 5,
                                    "created_utc": 1592234070.0,
                                    "replies": [
                                        {
                                            "body": "Awe! You are fucking hilarious. Seems like he might have a sensitive fragile ego. Would you say he does? Fuccckkkk that gift is making me crack up.\n\nDoes sound like a sweetie regardless. God, what is up with men and drinking problems? I had to leave my last ex of a few years because he was a real sweetheart but a huge asshole when he was drunk and he is drunk all the time. I've been connecting with a new person, not on a sugaring level, but in the short time we have been hanging, he totally changes into an overly sensitive and accusatory asshole when he is drunk. Bleck!",
                                            "author": "kimchi_Queen",
                                            "id": "fuxjupl",
                                            "parent_id": "t1_fuwpnae",
                                            "score": 4,
                                            "created_utc": 1592248315.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Would you have just smiled if it was $10K per day?",
                            "author": "TY2022",
                            "id": "fuv76zv",
                            "parent_id": "t1_fuv6wbj",
                            "score": 0,
                            "created_utc": 1592191786.0,
                            "replies": [
                                {
                                    "body": "No, but I've done it in the past.",
                                    "author": "_Fortuna_",
                                    "id": "fuv7gbo",
                                    "parent_id": "t1_fuv76zv",
                                    "score": 7,
                                    "created_utc": 1592191960.0,
                                    "replies": [
                                        {
                                            "body": "Roger that.  😉",
                                            "author": "TY2022",
                                            "id": "fuv7j1z",
                                            "parent_id": "t1_fuv7gbo",
                                            "score": 2,
                                            "created_utc": 1592192013.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "How much did you clear pre-taxes in a year's time working that $10k/day job?",
                    "author": "mrjimmyjsz",
                    "id": "fuy4974",
                    "parent_id": "t1_fuv6jgn",
                    "score": 4,
                    "created_utc": 1592258295.0,
                    "replies": [
                        {
                            "body": "About five point nine mil over two years..",
                            "author": "TY2022",
                            "id": "fuy8gsj",
                            "parent_id": "t1_fuy4974",
                            "score": 2,
                            "created_utc": 1592260246.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "complete man child",
            "author": "Grimouire",
            "id": "fuwk6qt",
            "parent_id": "t3_h97b2f",
            "score": 2,
            "created_utc": 1592231310.0,
            "replies": []
        },
        {
            "body": "Ring or meet him, be the adult, try to talk to him about it and see if he will give you the money, if he doesn't then take it anyway and just say you thought you could still use it since he didn't get it back",
            "author": "nomadzebra",
            "id": "fuwqnzs",
            "parent_id": "t3_h97b2f",
            "score": 2,
            "created_utc": 1592234571.0,
            "replies": []
        },
        {
            "body": "Lol. And I wouldn't pay a quarter for you....👍😁",
            "author": "momsboytoy75",
            "id": "fvrx576",
            "parent_id": "t3_h97b2f",
            "score": 2,
            "created_utc": 1592940956.0,
            "replies": [
                {
                    "body": "All good, I'd hate to take your virginity anyway.",
                    "author": "_Fortuna_",
                    "id": "fvs5h3t",
                    "parent_id": "t1_fvrx576",
                    "score": 2,
                    "created_utc": 1592945030.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "AND....you Have NO \"Self Respect.\" If your living off of someone else and laying around NOT doing anything productive for society and your Life...",
            "author": "momsboytoy75",
            "id": "fvryi6j",
            "parent_id": "t3_h97b2f",
            "score": 2,
            "created_utc": 1592941618.0,
            "replies": [
                {
                    "body": "I have kids and a job. Go back to your incel troll hole.",
                    "author": "_Fortuna_",
                    "id": "fvs5l5a",
                    "parent_id": "t1_fvryi6j",
                    "score": 2,
                    "created_utc": 1592945084.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yeah right. I believe the kids part...👍😮",
            "author": "momsboytoy75",
            "id": "fvs7q1b",
            "parent_id": "t3_h97b2f",
            "score": 2,
            "created_utc": 1592946126.0,
            "replies": []
        },
        {
            "body": "send him a soother, a diaper, a bonnet, onesie and baby food, then send him a dog collar and write \"you're nothing but a b\\*tch\" <3",
            "author": "angiepoop",
            "id": "fux9xn0",
            "parent_id": "t3_h97b2f",
            "score": 3,
            "created_utc": 1592243681.0,
            "replies": [
                {
                    "body": "Yes, absolutely savage.",
                    "author": "_Fortuna_",
                    "id": "fuxae6a",
                    "parent_id": "t1_fux9xn0",
                    "score": 4,
                    "created_utc": 1592243886.0,
                    "replies": []
                },
                {
                    "body": "O hell yeah 💀💀💀",
                    "author": "LikeHoney99",
                    "id": "fuxi6ql",
                    "parent_id": "t1_fux9xn0",
                    "score": 3,
                    "created_utc": 1592247505.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "damn that sounds intense. hopefully this is just a once in a blue moon thing",
            "author": "absolutelyhere11",
            "id": "fuv7g1y",
            "parent_id": "t3_h97b2f",
            "score": 4,
            "created_utc": 1592191954.0,
            "replies": []
        },
        {
            "body": "What a total asshole. Shred the credit card and never talk to him again.  You deserve better and sounds like you handled the situation the best you could. If having dinner and conversation with a beautiful woman isn't enough to make him happy there is no hope for him. His loss.",
            "author": "sirthunksalot",
            "id": "fuvxe5e",
            "parent_id": "t3_h97b2f",
            "score": 2,
            "created_utc": 1592213838.0,
            "replies": []
        },
        {
            "body": "First of all, you should have left his ass right where he had you fucked up, which was in those piss-poor text messages. Because first of all, your time is valuable, you are not his mother, and he needs to grow up.\n\nSecond of all, do you have a roster of men? If not, please invest in one. So anytime an SD gets to acting up, you leave his ass where he had you fucked up, again, and entertain the new SD until that little boy, SD, acts right and does right by you. You have to show people better than you can tell them.\n\nLast, and this is towards you, do not ever tolerate such behavior and antics. Establish upfront that you are not the one, the two, the three, or the remaining numbers.",
            "author": "AsheGuade",
            "id": "fv3ecwx",
            "parent_id": "t3_h97b2f",
            "score": 1,
            "created_utc": 1592371039.0,
            "replies": [
                {
                    "body": "Don't come at me like that.",
                    "author": "_Fortuna_",
                    "id": "fv3ekm6",
                    "parent_id": "t1_fv3ecwx",
                    "score": 2,
                    "created_utc": 1592371202.0,
                    "replies": [
                        {
                            "body": "I am not coming at you at all. LOL. I am just stating that you should not have to deal with his behavior. I do not agree with the last-minute plans. That is disregarding your time and your plans that you may have had before he contacted you. Also, him acting like a child at the table should have been the last straw. If I were you, I would have said nothing, removed myself from the table, and went home. I am not a fan of grown men acting out. It is embarrassing, and it is not cute. On top of that, he was gaslighting you, and he attempted to keep you out late after you said, \"I don't want to be up late.\" He has disregarded you twice....Again, I am not coming at you. I am just simply saying that when you encounter men like him, you respond accordingly.",
                            "author": "AsheGuade",
                            "id": "fv3h8ge",
                            "parent_id": "t1_fv3ekm6",
                            "score": 1,
                            "created_utc": 1592373280.0,
                            "replies": [
                                {
                                    "body": "I addressed a lot of this in the thread. Sorry it sounded like you were trying to tell me what to do!",
                                    "author": "_Fortuna_",
                                    "id": "fv6v1e0",
                                    "parent_id": "t1_fv3h8ge",
                                    "score": 1,
                                    "created_utc": 1592445871.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "i want updates!",
            "author": null,
            "id": "fz0ak9j",
            "parent_id": "t3_h97b2f",
            "score": 1,
            "created_utc": 1595530048.0,
            "replies": [
                {
                    "body": "I have updates! Will take some time to type it up in the next few days",
                    "author": "_Fortuna_",
                    "id": "fz0osas",
                    "parent_id": "t1_fz0ak9j",
                    "score": 1,
                    "created_utc": 1595536688.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I want to be the devils advocate. But with everyone here piling on him, meh... not worth it.",
            "author": "captainIsBack4u",
            "id": "fux5pzh",
            "parent_id": "t3_h97b2f",
            "score": 1,
            "created_utc": 1592241780.0,
            "replies": []
        },
        {
            "body": "Possession = permission",
            "author": null,
            "id": "fuwkedw",
            "parent_id": "t3_h97b2f",
            "score": 1,
            "created_utc": 1592231420.0,
            "replies": []
        },
        {
            "body": "Lol. I DON'T see how people can be with someone else that ONLY is with them for their money. Or that is a Major component. I myself will Never have to pay for sex.....",
            "author": "momsboytoy75",
            "id": "fvrtpsk",
            "parent_id": "t3_h97b2f",
            "score": 1,
            "created_utc": 1592939294.0,
            "replies": [
                {
                    "body": "Welp buddy boy you may just wanna see your happy ass out of the Sugar Lifestyle Forum then.",
                    "author": "_Fortuna_",
                    "id": "fvrv6w6",
                    "parent_id": "t1_fvrtpsk",
                    "score": 1,
                    "created_utc": 1592940007.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Virginity? Lol. My WIFE has a Good career as do I. We BOTH contribute to the relationship. No $1,000.00 purses for a 30 min blowjob here. Besides these guys pay for sex and whatever. That's sad and desperate. And the whores that take their money. Well exactly what they are. At the end of the day your human also. You might be pretty in the face have nice a body. But u still piss, shit and bleed. And one day will get old sick and die. Not worth it.",
            "author": "momsboytoy75",
            "id": "fvs640x",
            "parent_id": "t3_h97b2f",
            "score": 1,
            "created_utc": 1592945343.0,
            "replies": [
                {
                    "body": "Ok goodbye virgin boy!",
                    "author": "_Fortuna_",
                    "id": "fvs8j0l",
                    "parent_id": "t1_fvs640x",
                    "score": 2,
                    "created_utc": 1592946524.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "When your married sex happens less, yes. Anybody will tell you that after 16 yrs of marriage.....At least I don't pay for it in order to get it...",
            "author": "momsboytoy75",
            "id": "fvscqo8",
            "parent_id": "t3_h97b2f",
            "score": 1,
            "created_utc": 1592948617.0,
            "replies": []
        },
        {
            "body": "He was drunk and screwed up. We've all done it.",
            "author": "BigMattress269",
            "id": "fw13pct",
            "parent_id": "t3_h97b2f",
            "score": 1,
            "created_utc": 1593145668.0,
            "replies": [
                {
                    "body": "No dear, no we haven't.",
                    "author": "_Fortuna_",
                    "id": "fw2xsvv",
                    "parent_id": "t1_fw13pct",
                    "score": 1,
                    "created_utc": 1593191880.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fuw6w1n",
            "parent_id": "t3_h97b2f",
            "score": 1,
            "created_utc": 1592222656.0,
            "replies": [
                {
                    "body": "The undertones are more for comedic relief than anything.  I needed to vent. In person I was incredibly patient and tried to be understanding for a considerable amount of time.  He started raising his voice in a very nice restaurant. I went into survival mode, tried to get an uber, and he left before I could.",
                    "author": "_Fortuna_",
                    "id": "fuwlsb0",
                    "parent_id": "t1_fuw6w1n",
                    "score": 2,
                    "created_utc": 1592232137.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "He sounds like a complete ass, but honestly i wouldnt want to date someone who routinely orders several hundred dollars worth of food lol",
            "author": "dade_murphy1",
            "id": "fuw5tbv",
            "parent_id": "t3_h97b2f",
            "score": 0,
            "created_utc": 1592221775.0,
            "replies": [
                {
                    "body": "He ordered",
                    "author": "_Fortuna_",
                    "id": "fuwknwy",
                    "parent_id": "t1_fuw5tbv",
                    "score": 5,
                    "created_utc": 1592231558.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "With a big part of the country not exactly dining out, where did this episode occur?",
            "author": null,
            "id": "fuwb8xi",
            "parent_id": "t3_h97b2f",
            "score": 0,
            "created_utc": 1592225913.0,
            "replies": [
                {
                    "body": "The other part.",
                    "author": "_Fortuna_",
                    "id": "fuwlxmz",
                    "parent_id": "t1_fuwb8xi",
                    "score": 4,
                    "created_utc": 1592232213.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "This person is so lonely.... none of this shit even happened. Show me a bill.... right, you cant. Please give this person some much needed attention.  Smh",
            "author": "Snoo78258",
            "id": "fuwgbed",
            "parent_id": "t3_h97b2f",
            "score": -1,
            "created_utc": 1592229151.0,
            "replies": [
                {
                    "body": "Thank you for the attention. \\*Tips fedora\\*",
                    "author": "_Fortuna_",
                    "id": "fuwunk3",
                    "parent_id": "t1_fuwgbed",
                    "score": 1,
                    "created_utc": 1592236502.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "He did something you perceived as wrong, and now you think it entitles you to credit card fraud? \n\nWho is showing the red flags here?\n\nThat is the kind of thing that scares me about someone badly.\n\nInstead of going to the guy after he cools down, explaining and saying you feel you deserve an apology, your first thought is that he's an unsalvageable loser and now it's your right to commit what is in actuality a crime that can get you prison time.\n\nStop and think for a minute.\n\nAlso from his perspective, he felt that he got lured out to pay for a dinner that you wanted to have and then you decided to bolt early. That's why he's pissed off, he feels like he got used as an ATM. This is due to your inability to phrase it correctly that you were not going to be getting together with him. \n\nYou should have said you want to see him for a platonic date night. You recognize that part of it but you don't accept any responsibility for what happened after and want to conclude it with theft.\n\nHe acted inappropriately and not like a gentleman. But you set it up knowing that you're already playing with fire with this guy and that you think crime is OK says a lot about you and what you should be working on for yourself. You guys are a good match.\n\nThe ATM thing you have to realize girls are constantly doing that to us. My last M+G, in advance I tried to work out the allowance details to know if we're on the same page. She said she wanted to talk about that in person (this is in my experience never comfortable to start from zero with this conversation). Halfway through the dinner she just flat out asked me to give her EDIT: a bunch of money right there. This wasn't in context of allowance this was just give me this now.\n\nShe left after to hang out with friends. \n\nSo all she was looking for was a meal and a pickup at an ATM and then to go spend the money with friends. The reason she didn't want to talk about that in advance is that I'd probably have said no to the date entirely having recognized her as a rinser. Instead she at least gets the meal for sure and she gets to play the lotto to see how stupid I am on the spot. \n\nI gave her a bit for showing up to show I'm sincere and as a transportation fee. Then got a taxi for her after which she walked because her friends were literally waiting for her a few hundred yards away. So more like champagne money than a long taxi ride home. \n\nSo that's why men get pissed off if they think plans are changing midstream. Because they know that plans are not changing midstream but this is how it was intended to go and they're just not getting an honest shake, rather they are getting an honest shakedown a lot of the time. It can be very, very triggering. This is not to excuse his behavior, he handled it like a child and he owes you an apology. The context though helps to explain how he gets there.\n\nIf you leave your guard down this can happen to you a few times a week from people on the site.\n\nIf you try to defend your wallet you start getting lines about \"oh so sex is the ONLY thing you're interested in\" to which you have to respond \"money seems to be the only thing you're interested in... and free food.\" From there you get a complete dissolution of any vibe or relationship, but that is indeed the conversation that can happen from there.",
            "author": "amigodeface",
            "id": "fuv988i",
            "parent_id": "t3_h97b2f",
            "score": -13,
            "created_utc": 1592193158.0,
            "replies": [
                {
                    "body": "You are conflating the first dinner date you had which went bad with an established SR. Is that comparing like with like?\n\nYou are conflating talk about doing something, and with no expressed intention to do it with actually doing something.\n\nYou are suggesting that even if there was a miscommunication, that it was one party's fault?\n\nFinally, whatever the rights and wrongs, do you think it would ever have been right for the guy to stiff her for the whole bill? Without even an adult conversation? Is that how you operate?\n\nYou know, perhaps your POTs are picking up a vibe here and that's why they head off after a meal?",
                    "author": "Mangotingthroneway",
                    "id": "fuvuwxa",
                    "parent_id": "t1_fuv988i",
                    "score": 12,
                    "created_utc": 1592211307.0,
                    "replies": []
                },
                {
                    "body": "He left me with a $350 tab. We go on platonic dates all the time. I stay with him without sleeping with him all the time. You do not know more about my arrangement than I do.\n\nThe bit about the credit card was an obvious joke. \n\n&#x200B;\n\nGoodbye",
                    "author": "_Fortuna_",
                    "id": "fuv9jl8",
                    "parent_id": "t1_fuv988i",
                    "score": 22,
                    "created_utc": 1592193383.0,
                    "replies": [
                        {
                            "body": "ah yes this is the height of maturity. You did skip over all parts where I say he acted inappropriately and you deserve an apology. But because I say you are partially responsible you write this kind of childish thing like \"Goodbye\". Anyone who is going to react like that isn't ready to deal with things on an adult level, so you should look at this kind of response and how you painted the person you chose to be with and understand that there are parallels.\n\n\"We go on platonic dates all the time\" --> not important to me, all I am doing is working with the information you gave me. Which is that he was upset that he got on a platonic date this time. If you want to throw that line out the one you want to use it on him, I'm trying to help you understand how he may have felt. You're dismissing how he may have felt because you want to take no responsibility at all for the results (even though you admit to some).",
                            "author": "amigodeface",
                            "id": "fuvaue2",
                            "parent_id": "t1_fuv9jl8",
                            "score": -16,
                            "created_utc": 1592194296.0,
                            "replies": [
                                {
                                    "body": "Who hurt you.",
                                    "author": "_Fortuna_",
                                    "id": "fuvbhpr",
                                    "parent_id": "t1_fuvaue2",
                                    "score": 16,
                                    "created_utc": 1592194759.0,
                                    "replies": [
                                        {
                                            "body": "Clearly his last M+G...\n\nPoor baby!  /s",
                                            "author": "Actually_a_bot_accnt",
                                            "id": "fuvjtte",
                                            "parent_id": "t1_fuvbhpr",
                                            "score": 16,
                                            "created_utc": 1592201158.0,
                                            "replies": [
                                                {
                                                    "body": "Yeah that m&g was definitely MY fault. It had nothing to do with his over stuffed suitcase of issues that we don't even want to begin to unpack.",
                                                    "author": "_Fortuna_",
                                                    "id": "fuvkb52",
                                                    "parent_id": "t1_fuvjtte",
                                                    "score": 7,
                                                    "created_utc": 1592201558.0,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "body": "Might be your \"SD\" in lurk mode.",
                                            "author": "Mangotingthroneway",
                                            "id": "fuvudfl",
                                            "parent_id": "t1_fuvbhpr",
                                            "score": 9,
                                            "created_utc": 1592210755.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "> Who hurt you\n\nAs I said, you're showing the height of maturity. \n\nYou posted a set of actions which means it's open to analysis and criticism. You got some, you even got some sympathy, and you ignore the sympathy and instead you just see red and try to hurt someone you don't know.\n\nBut I'm past my 20s so trying the \"who hurt you\" meme line doesn't really bother me, just confirms what I've been saying.\n\nYou're more than happy to tear your SD a huge new asshole here out in public and paint yourself as the hero. You receive a mixed bag of sympathy and criticism and you decide you have to treat the person saying that as an enemy, because criticism is not something you can handle apparently.\n\nAlso I thought we were at \"Goodbye\" already.",
                                            "author": "amigodeface",
                                            "id": "fuvc2al",
                                            "parent_id": "t1_fuvbhpr",
                                            "score": -8,
                                            "created_utc": 1592195173.0,
                                            "replies": [
                                                {
                                                    "body": "I am also very well past my 20s.",
                                                    "author": "_Fortuna_",
                                                    "id": "fuvca3b",
                                                    "parent_id": "t1_fuvc2al",
                                                    "score": 8,
                                                    "created_utc": 1592195328.0,
                                                    "replies": [
                                                        {
                                                            "body": "> I am also very well past my 20s.\n\nThen it's time to leave things like \"who hurt you\" as a response behind for the teenagers and those just out of their teens, isn't it?\n\nYou don't have to lash out. I tried to give you something constructive and I will repeat, I said he acted inappropriately and you deserved an apology but all that did was trigger attack mode because I dared to say it was a mixed bag and not just m'lady you.\n\nThere is a reason why some people will not give the benefit of their thoughts and it's because not acting in politically desirable ways just attracts people lashing out and a bunch of downvotes from people who think that we should just be in head patting mode.\n\nFrom time to time I try it because I think it's constructive to hold up a mirror, if someone wants to grow from the experience.",
                                                            "author": "amigodeface",
                                                            "id": "fuvckkv",
                                                            "parent_id": "t1_fuvca3b",
                                                            "score": 0,
                                                            "created_utc": 1592195541.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Don’t waste your time, she just wants to rant about how she was wronged, what a strong woman she is, and rally the SBs here to her cause. Any of the insight you’ve provided is wasted/",
                                                                    "author": "garret6758",
                                                                    "id": "fuvdf38",
                                                                    "parent_id": "t1_fuvckkv",
                                                                    "score": -12,
                                                                    "created_utc": 1592196168.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": ">and rally the SBs here to her cause\n\nAre you so innately sexist that your eyes simply gloss over the numerous SD's who posted on her side? How strange.",
                                                                            "author": "blonde-throwaway",
                                                                            "id": "fuvvlhx",
                                                                            "parent_id": "t1_fuvdf38",
                                                                            "score": 11,
                                                                            "created_utc": 1592212011.0,
                                                                            "replies": []
                                                                        },
                                                                        {
                                                                            "body": "A+ thanks",
                                                                            "author": "amigodeface",
                                                                            "id": "fvdcs66",
                                                                            "parent_id": "t1_fuvdf38",
                                                                            "score": 2,
                                                                            "created_utc": 1592596473.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "I see you may have posted a number which is most likely an amount in relations to an arrangement. If this is the case, you are violating Rule#4 - \"No dollar amounts that are in reference to allowance/PPM are allowed.\"\n\n\nIf you are curious about Allowances reported by SLF contributors please see the [Allowance Master Thread 2019-2020](https://www.reddit.com/r/sugarlifestyleforum/comments/dezl91/allowance_master_thread_20192020/?utm_source=reddit&utm_medium=usertext&utm_name=sugarlifestyleforum&utm_content=t3_dnk455)\n\nYour post will not be approved until you remove the amount.  Please read the sub [Rules](https://www.reddit.com/r/sugarlifestyleforum/comments/748zta/updated_and_clarified_rules_for_slf/) prior to posting anything else. \n\nIf you simply posted a number not referencing a monetary amount, please message the MODs to approve your post.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/sugarlifestyleforum) if you have any questions or concerns.*",
                    "author": "AutoModerator",
                    "id": "fuv9t85",
                    "parent_id": "t1_fuv988i",
                    "score": 2,
                    "created_utc": 1592193571.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "fvs8ypw",
            "parent_id": "t3_h97b2f",
            "score": 0,
            "created_utc": 1592946738.0,
            "replies": [
                {
                    "body": "A married virgin?  That's probably the saddest thing I've ever heard.",
                    "author": "_Fortuna_",
                    "id": "fvsagcc",
                    "parent_id": "t1_fvs8ypw",
                    "score": 1,
                    "created_utc": 1592947477.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Guarantee he will 100%. We met through mutual friends, and we hang out at some of the same places. I highly doubt I'll be rid of him for a while.\n\n&#x200B;\n\nDo I have permission to rinse his ass for this?",
            "author": "_Fortuna_",
            "id": "fuv4e5l",
            "parent_id": "t1_fuv3x2a",
            "score": 54,
            "created_utc": 1592189917.0,
            "replies": [
                {
                    "body": "He definitely owes you. And not just for the cost of the bill, there’s an asshole tax",
                    "author": "mraspencer",
                    "id": "fuv4gqa",
                    "parent_id": "t1_fuv4e5l",
                    "score": 57,
                    "created_utc": 1592189963.0,
                    "replies": []
                },
                {
                    "body": "Why would you want him back though? Buy stuff on his card equivalent to what his food would have cost then break contact and don't bother engaging with him in any way again. If he's going to be a baby don't chance that he'll make a fuss about payments on his cards that might bring undue scrutiny. Compensate yourself then cut him out of your Life.",
                    "author": "KeyToGramercy",
                    "id": "fuwcqjl",
                    "parent_id": "t1_fuv4e5l",
                    "score": 11,
                    "created_utc": 1592226922.0,
                    "replies": []
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "fuv4jzo",
                    "parent_id": "t1_fuv4e5l",
                    "score": 28,
                    "created_utc": 1592190022.0,
                    "replies": [
                        {
                            "body": "Only shave off ONE   let him decide if he wants to look  crazy or like a drag queen",
                            "author": "pinotandsugar",
                            "id": "fuvesot",
                            "parent_id": "t1_fuv4jzo",
                            "score": 20,
                            "created_utc": 1592197197.0,
                            "replies": [
                                {
                                    "body": "Oh my god, you genius maniac!",
                                    "author": "_Fortuna_",
                                    "id": "fuvfmc9",
                                    "parent_id": "t1_fuvesot",
                                    "score": 6,
                                    "created_utc": 1592197822.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "yessss.... I'm thinking I'll shave off all the \"hair\" in his bald spot too",
                            "author": "_Fortuna_",
                            "id": "fuv4xro",
                            "parent_id": "t1_fuv4jzo",
                            "score": 28,
                            "created_utc": 1592190274.0,
                            "replies": [
                                {
                                    "body": "I like the idea of you giving him an heir cut.",
                                    "author": "TY2022",
                                    "id": "fuv7qhn",
                                    "parent_id": "t1_fuv4xro",
                                    "score": 11,
                                    "created_utc": 1592192150.0,
                                    "replies": [
                                        {
                                            "body": "Hmmm, are you saying I should have his baby? Yes... yes... the ultimate rinse... child support.",
                                            "author": "_Fortuna_",
                                            "id": "fuv7vh2",
                                            "parent_id": "t1_fuv7qhn",
                                            "score": 29,
                                            "created_utc": 1592192244.0,
                                            "replies": [
                                                {
                                                    "body": "[deleted]",
                                                    "author": null,
                                                    "id": "fuv8ipa",
                                                    "parent_id": "t1_fuv7vh2",
                                                    "score": 11,
                                                    "created_utc": 1592192674.0,
                                                    "replies": [
                                                        {
                                                            "body": "Why not both?",
                                                            "author": "superneutral",
                                                            "id": "fux0zj9",
                                                            "parent_id": "t1_fuv8ipa",
                                                            "score": 2,
                                                            "created_utc": 1592239515.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "body": "Oh my god yessssssss 🤣🤣🤣",
                                                    "author": "kimchi_Queen",
                                                    "id": "fuvt1rn",
                                                    "parent_id": "t1_fuv7vh2",
                                                    "score": 3,
                                                    "created_utc": 1592209448.0,
                                                    "replies": []
                                                },
                                                {
                                                    "body": "hahahahahahahahahhahahhahaha",
                                                    "author": "TY2022",
                                                    "id": "fuv7y5h",
                                                    "parent_id": "t1_fuv7vh2",
                                                    "score": 5,
                                                    "created_utc": 1592192293.0,
                                                    "replies": []
                                                },
                                                {
                                                    "body": "Would his genes help produce a quality baby?",
                                                    "author": "mrjimmyjsz",
                                                    "id": "fuy3wg1",
                                                    "parent_id": "t1_fuv7vh2",
                                                    "score": 2,
                                                    "created_utc": 1592258135.0,
                                                    "replies": [
                                                        {
                                                            "body": "I'm afraid mine would be doing most of the heavy lifting 😅",
                                                            "author": "_Fortuna_",
                                                            "id": "fuy4s2q",
                                                            "parent_id": "t1_fuy3wg1",
                                                            "score": 3,
                                                            "created_utc": 1592258538.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "fuv54yh",
                                    "parent_id": "t1_fuv4xro",
                                    "score": 16,
                                    "created_utc": 1592190407.0,
                                    "replies": [
                                        {
                                            "body": "OMG, the fact that there's a word for that is just outstanding.",
                                            "author": "_Fortuna_",
                                            "id": "fuv5vrf",
                                            "parent_id": "t1_fuv54yh",
                                            "score": 12,
                                            "created_utc": 1592190903.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "💀💀💀",
                                            "author": "LikeHoney99",
                                            "id": "fuwyfbb",
                                            "parent_id": "t1_fuv54yh",
                                            "score": 1,
                                            "created_utc": 1592238275.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "Shave off all the hair around his bald spot, just leave the fluff :)",
                                    "author": "SlothsvPangolins",
                                    "id": "fuwrfbh",
                                    "parent_id": "t1_fuv4xro",
                                    "score": 3,
                                    "created_utc": 1592234947.0,
                                    "replies": [
                                        {
                                            "body": "Absolutely savage.  I love it.",
                                            "author": "_Fortuna_",
                                            "id": "fuy7zsy",
                                            "parent_id": "t1_fuwrfbh",
                                            "score": 1,
                                            "created_utc": 1592260025.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Holy Shiet! what a douche.\n\nI would work that credit card until the magnetic strip is worn off.",
                    "author": "GSSD",
                    "id": "fuwdvht",
                    "parent_id": "t1_fuv4e5l",
                    "score": 11,
                    "created_utc": 1592227650.0,
                    "replies": []
                },
                {
                    "body": "Yeah, you definetely have to keep us posted",
                    "author": null,
                    "id": "fuvaqro",
                    "parent_id": "t1_fuv4e5l",
                    "score": 6,
                    "created_utc": 1592194225.0,
                    "replies": []
                },
                {
                    "body": "*Let the rain fall down away from me...*",
                    "author": null,
                    "id": "fuvxet6",
                    "parent_id": "t1_fuv4e5l",
                    "score": 6,
                    "created_utc": 1592213857.0,
                    "replies": []
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "fux0wqu",
                    "parent_id": "t1_fuv4e5l",
                    "score": 3,
                    "created_utc": 1592239478.0,
                    "replies": [
                        {
                            "body": "I've actually been trying to put up some healthy boundaries so I can make this work. We had stayed together all weekend so spending Sunday dinner with him seemed like an acquiescence on my part.  \n\nYou're right, he's great when he wants to be!",
                            "author": "_Fortuna_",
                            "id": "fux3sas",
                            "parent_id": "t1_fux0wqu",
                            "score": 3,
                            "created_utc": 1592240888.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Yes. Buy things on the card in the amount you paid for that dinner. Absolutely. It’s an arrangement. Never lose sight of that or let him lose sight of that either. God ! This sounds exactly like an SD I had ! So many great qualities and could be super helpful and generous ... then such a big. Fat. Fricking. Baby. Especially when he drank. And the storming out then calling a million times minutes later. And the for no good reason last minute dates. Mine was married, but even then, the last minute stuff didn’t make sense. He had a million excuses he could have used to make plans.",
                    "author": null,
                    "id": "fuz3yoj",
                    "parent_id": "t1_fuv4e5l",
                    "score": 3,
                    "created_utc": 1592277667.0,
                    "replies": []
                },
                {
                    "body": "It would be interesting what his view of the nights events would be.  I would guess he would tell a very different version than yours, a may share a version of it with mutual friends.   Just be careful for this blow up withing your mutual friends network.",
                    "author": "willfromvb",
                    "id": "fuw5p28",
                    "parent_id": "t1_fuv4e5l",
                    "score": 2,
                    "created_utc": 1592221676.0,
                    "replies": [
                        {
                            "body": "Of course he would tell a very different version.  One where it's ok to invite me to dinner and be justified in leaving me with a tab he knows I can't afford.",
                            "author": "_Fortuna_",
                            "id": "fuwlanz",
                            "parent_id": "t1_fuw5p28",
                            "score": 6,
                            "created_utc": 1592231888.0,
                            "replies": []
                        },
                        {
                            "body": "You know what’s interesting is, whenever I tried to discuss his behavior the next day, he definitely was embarrassed. He wouldn’t want to “get into it” Though. “Can you just give me the benefit of the doubt?”",
                            "author": null,
                            "id": "fuz4dss",
                            "parent_id": "t1_fuw5p28",
                            "score": 2,
                            "created_utc": 1592277930.0,
                            "replies": []
                        },
                        {
                            "body": "Really? My guess is they also know what he’s like drunk.",
                            "author": "LikeHoney99",
                            "id": "fuwyksg",
                            "parent_id": "t1_fuw5p28",
                            "score": 2,
                            "created_utc": 1592238346.0,
                            "replies": [
                                {
                                    "body": "Yes you pretty much nailed it. There's really no trouble he could cause for me that wouldn't make things worse for him.",
                                    "author": "_Fortuna_",
                                    "id": "fuy8kg2",
                                    "parent_id": "t1_fuwyksg",
                                    "score": 3,
                                    "created_utc": 1592260295.0,
                                    "replies": []
                                },
                                {
                                    "body": "Could be.  Then she wouldnt have to worry if he tried to poison the well with their mutual friends.  \n\nIm just saying that if he is that vindictive to leave her with the bill, I would be concerned with what else he may try to do t ok influence their mutual friends.  It gets sloppy with mutual friend.\n\nI'm certainly not trying to take his side.  We only know her side of the story.",
                                    "author": "willfromvb",
                                    "id": "fux0n23",
                                    "parent_id": "t1_fuwyksg",
                                    "score": 1,
                                    "created_utc": 1592239348.0,
                                    "replies": [
                                        {
                                            "body": "You sound awfully apologetic for not being on his side....",
                                            "author": "LikeHoney99",
                                            "id": "fux1paq",
                                            "parent_id": "t1_fux0n23",
                                            "score": -1,
                                            "created_utc": 1592239865.0,
                                            "replies": [
                                                {
                                                    "body": "That's a strange reaction.",
                                                    "author": "willfromvb",
                                                    "id": "fuxkx2b",
                                                    "parent_id": "t1_fux1paq",
                                                    "score": 2,
                                                    "created_utc": 1592248835.0,
                                                    "replies": [
                                                        {
                                                            "body": "Oh, how so?",
                                                            "author": "LikeHoney99",
                                                            "id": "fuxkzlx",
                                                            "parent_id": "t1_fuxkx2b",
                                                            "score": 0,
                                                            "created_utc": 1592248869.0,
                                                            "replies": [
                                                                {
                                                                    "body": "I'm amazed how quickly people are rendering judgement and  recommending punishment knowing only her side of the story.  \n\nI regularly meditate workplace disputes.  You rarely get the full story when you only hear one side.   I never want  to take sides other than the side of truth. \n\nBy her own admission she has being seeing this man for \"some time\" .  If he really is \"all bad\" and she is \"all good\", she has some culpability for continuing the relationship.  I suspect he is neither \"all bad\" nor is she \"all good\" and there is history in their relationship that contributed to his behavior more than what is described.",
                                                                    "author": "willfromvb",
                                                                    "id": "fuxngi3",
                                                                    "parent_id": "t1_fuxkzlx",
                                                                    "score": 1,
                                                                    "created_utc": 1592250068.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "That's interesting, but doesn't make my comment about you seeming like his apologist strange, or explain why you found it strange.",
                                                                            "author": "LikeHoney99",
                                                                            "id": "fuxq42i",
                                                                            "parent_id": "t1_fuxngi3",
                                                                            "score": 1,
                                                                            "created_utc": 1592251361.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "The assumption that there is only her side or his side is what seems strange to me.  There is also the side of truth.",
                                                                                    "author": "willfromvb",
                                                                                    "id": "fuxr61r",
                                                                                    "parent_id": "t1_fuxq42i",
                                                                                    "score": 1,
                                                                                    "created_utc": 1592251880.0,
                                                                                    "replies": [
                                                                                        {
                                                                                            "body": "I don’t think we’re talking about the same thing 🤷‍♀️",
                                                                                            "author": "LikeHoney99",
                                                                                            "id": "fuxrsjj",
                                                                                            "parent_id": "t1_fuxr61r",
                                                                                            "score": 2,
                                                                                            "created_utc": 1592252191.0,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Why would that credit card still work? If the guy has any sense he blocked it already.",
                    "author": null,
                    "id": "fv301zy",
                    "parent_id": "t1_fuv4e5l",
                    "score": 1,
                    "created_utc": 1592361565.0,
                    "replies": [
                        {
                            "body": "A valid assumption for any normal human being.",
                            "author": "_Fortuna_",
                            "id": "fv37vkq",
                            "parent_id": "t1_fv301zy",
                            "score": 1,
                            "created_utc": 1592366440.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "She should add a tax for the inconvenience too.",
            "author": null,
            "id": "fuvb2ug",
            "parent_id": "t1_fuv7fwo",
            "score": 16,
            "created_utc": 1592194462.0,
            "replies": []
        },
        {
            "body": "It is possible he thought she had the card with her and would use it for the dinner ?  Regardless he needs to be put out for recycling   However, if the sugar is needed you might keep him until you don't need to keep him.",
            "author": "pinotandsugar",
            "id": "fuvezwm",
            "parent_id": "t1_fuv7fwo",
            "score": 5,
            "created_utc": 1592197349.0,
            "replies": []
        },
        {
            "body": "Gosh such a thing would be sooo unfortunate.",
            "author": "_Fortuna_",
            "id": "fuv780f",
            "parent_id": "t1_fuv72ch",
            "score": 18,
            "created_utc": 1592191805.0,
            "replies": []
        },
        {
            "body": "Wish it had happened before we ordered! I had to get a ride home too because he drove me 😅",
            "author": "_Fortuna_",
            "id": "fuv3o80",
            "parent_id": "t1_fuv39u7",
            "score": 18,
            "created_utc": 1592189456.0,
            "replies": [
                {
                    "body": "I hope the food was good at least",
                    "author": "canavatar12",
                    "id": "fuv58fq",
                    "parent_id": "t1_fuv3o80",
                    "score": 5,
                    "created_utc": 1592190471.0,
                    "replies": [
                        {
                            "body": "Hell yes!\n\nBurrata with Prosciutto\n\nwedge salad\n\nchilean sea bass, 11 oz Filet, 6 oz lobster\n\nBacon Brussels Sprouts, Au Gratin Potatoes\n\nKey lime pie\n\nespresso martini, Manhattan, blue cheese olive belvedere martini\n\n&#x200B;\n\n&#x200B;\n\nI have leftovers if you're hungry",
                            "author": "_Fortuna_",
                            "id": "fuv5ors",
                            "parent_id": "t1_fuv58fq",
                            "score": 41,
                            "created_utc": 1592190773.0,
                            "replies": [
                                {
                                    "body": "Lol that does sound expensive",
                                    "author": "canavatar12",
                                    "id": "fuv8zbk",
                                    "parent_id": "t1_fuv5ors",
                                    "score": 10,
                                    "created_utc": 1592192988.0,
                                    "replies": []
                                },
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "fuw73ul",
                                    "parent_id": "t1_fuv5ors",
                                    "score": 9,
                                    "created_utc": 1592222834.0,
                                    "replies": [
                                        {
                                            "body": "I wouldn't make you sleep with me if you want the leftovers lol",
                                            "author": "_Fortuna_",
                                            "id": "fuwmoab",
                                            "parent_id": "t1_fuw73ul",
                                            "score": 4,
                                            "created_utc": 1592232588.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "Omg. I love this list.",
                                    "author": null,
                                    "id": "fuz4orn",
                                    "parent_id": "t1_fuv5ors",
                                    "score": 2,
                                    "created_utc": 1592278118.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "This is a very super great point. I take this mindset in sugaring too. I’m nice as pie til that sugar comes.",
            "author": null,
            "id": "fuz4vno",
            "parent_id": "t1_fuvxcm8",
            "score": 3,
            "created_utc": 1592278237.0,
            "replies": []
        },
        {
            "body": "I'm thinking an Hermes Birkin. Ya know, really test the limits of that cc.",
            "author": "_Fortuna_",
            "id": "fuvjpls",
            "parent_id": "t1_fuvjjze",
            "score": 13,
            "created_utc": 1592201062.0,
            "replies": [
                {
                    "body": "Smart girl, Birkins can be an investment. Good luck to you, nice to see a boss bitch taking no shit from a man.",
                    "author": "Actually_a_bot_accnt",
                    "id": "fuvk3hl",
                    "parent_id": "t1_fuvjpls",
                    "score": 3,
                    "created_utc": 1592201378.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yep! An absolute joke of a man that one.",
            "author": "_Fortuna_",
            "id": "fuv6idt",
            "parent_id": "t1_fuv4l9q",
            "score": 17,
            "created_utc": 1592191325.0,
            "replies": []
        },
        {
            "body": "Yeah, if she doesn’t have specific permission it could be a felony.",
            "author": "garret6758",
            "id": "fuvd4fk",
            "parent_id": "t1_fuv6sum",
            "score": 14,
            "created_utc": 1592195947.0,
            "replies": []
        },
        {
            "body": "Absolutely! We too often forget that our emotional currency has value as well.",
            "author": "_Fortuna_",
            "id": "fuy8snl",
            "parent_id": "t1_fuvsynv",
            "score": 2,
            "created_utc": 1592260401.0,
            "replies": []
        },
        {
            "body": "Neither. More sgf",
            "author": "_Fortuna_",
            "id": "fuwklrc",
            "parent_id": "t1_fuwegyr",
            "score": 3,
            "created_utc": 1592231527.0,
            "replies": [
                {
                    "body": "Jesus.",
                    "author": "LikeHoney99",
                    "id": "fuwz10y",
                    "parent_id": "t1_fuwklrc",
                    "score": 2,
                    "created_utc": 1592238559.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "This could potentially be incredibly lucrative.",
            "author": "_Fortuna_",
            "id": "fuv6loq",
            "parent_id": "t1_fuv4n2w",
            "score": 11,
            "created_utc": 1592191387.0,
            "replies": []
        },
        {
            "body": "Now let's try to stay grounded in reality here.",
            "author": "TY2022",
            "id": "fuv6od6",
            "parent_id": "t1_fuv4n2w",
            "score": 15,
            "created_utc": 1592191437.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fuv6gy9",
            "parent_id": "t1_fuv4n2w",
            "score": 9,
            "created_utc": 1592191297.0,
            "replies": [
                {
                    "body": "😂",
                    "author": "LikeHoney99",
                    "id": "fuwyucr",
                    "parent_id": "t1_fuv6gy9",
                    "score": 2,
                    "created_utc": 1592238471.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Oof. It's super tempting, but we have some mutual friends that all hang out in the same place.  I'll probably just return the card and loudly drag him for leaving me with such a big bill.  Social shame pays dividends.",
            "author": "_Fortuna_",
            "id": "fuvdqf1",
            "parent_id": "t1_fuvdcao",
            "score": 22,
            "created_utc": 1592196402.0,
            "replies": [
                {
                    "body": ">Social shame pays dividends.\n\nThat is very true!",
                    "author": "bsbdfw",
                    "id": "fux0qkm",
                    "parent_id": "t1_fuvdqf1",
                    "score": 5,
                    "created_utc": 1592239394.0,
                    "replies": []
                },
                {
                    "body": "It does. You do you boo!",
                    "author": null,
                    "id": "fvd2vwv",
                    "parent_id": "t1_fuvdqf1",
                    "score": 1,
                    "created_utc": 1592591591.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I 100% agree. \n\n&#x200B;\n\nI didn't mention that he actually came back for a second and sat down. I said, \"This is all my food now, you can go.\"\n\n&#x200B;\n\nMy dignity is not a worth a damn dinner.",
            "author": "_Fortuna_",
            "id": "fuv6wbj",
            "parent_id": "t1_fuv6jgn",
            "score": 17,
            "created_utc": 1592191586.0,
            "replies": [
                {
                    "body": "WOAH! Good for fucking you. He storms off and then comes back?? How long did it take for him to come back ? What did he say? Did you pay for the dinner or did you use his card?\n\nIf you used your own CC you could pay off the balance with his CC. I really don't think it would be much of an issue. Especially since he obviously felt bad.\n\n  \nYour response is hilarious. How long have you been together? Is he good to you? He as a CC for you, so that alone seems like he might be very good to you. I have yet to ever reach that level, but I am super informal about sugaring and only ever have 1 if I do.",
                    "author": "kimchi_Queen",
                    "id": "fuvtaii",
                    "parent_id": "t1_fuv6wbj",
                    "score": 6,
                    "created_utc": 1592209685.0,
                    "replies": [
                        {
                            "body": "Yes!! He stormed off, called my phone about 5 times (rejected) then comes back about ten minutes later. He sat down and before he could speak I told him to leave.\n\nI used my own money to pay. His card was at my house. I'm thinking of sending him the world's biggest dildo and a penis pump. Let me know if you think of anything else lol.\n\n&#x200B;\n\nWe've been together 5 ish months, though I've known a few of friends for 10+ years. He's very good to me most of the time, but his drinking is problematic. He'd been out on his boat all day so he showed up late and apparently pretty lit. Unfortunately I didn't realize this till after we got to the restaurant.\n\n&#x200B;\n\nAs for the cc, it's not mine, but he gives it to me to use pretty regularly. Like I said, he can be very sweet. He gets me gifts and things he thinks I might need all the time. He'll text me when he's at the mall and demand that I send him pics of things I want. He'll go to the grocery store and bring me piles of food then cook me dinner AND clean! \n\nI'm not ppm or monthly, but he'll give me money whenever I say I need it.\n\nI don't know what to do with this man!",
                            "author": "_Fortuna_",
                            "id": "fuwpnae",
                            "parent_id": "t1_fuvtaii",
                            "score": 5,
                            "created_utc": 1592234070.0,
                            "replies": [
                                {
                                    "body": "Awe! You are fucking hilarious. Seems like he might have a sensitive fragile ego. Would you say he does? Fuccckkkk that gift is making me crack up.\n\nDoes sound like a sweetie regardless. God, what is up with men and drinking problems? I had to leave my last ex of a few years because he was a real sweetheart but a huge asshole when he was drunk and he is drunk all the time. I've been connecting with a new person, not on a sugaring level, but in the short time we have been hanging, he totally changes into an overly sensitive and accusatory asshole when he is drunk. Bleck!",
                                    "author": "kimchi_Queen",
                                    "id": "fuxjupl",
                                    "parent_id": "t1_fuwpnae",
                                    "score": 4,
                                    "created_utc": 1592248315.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Would you have just smiled if it was $10K per day?",
                    "author": "TY2022",
                    "id": "fuv76zv",
                    "parent_id": "t1_fuv6wbj",
                    "score": 0,
                    "created_utc": 1592191786.0,
                    "replies": [
                        {
                            "body": "No, but I've done it in the past.",
                            "author": "_Fortuna_",
                            "id": "fuv7gbo",
                            "parent_id": "t1_fuv76zv",
                            "score": 7,
                            "created_utc": 1592191960.0,
                            "replies": [
                                {
                                    "body": "Roger that.  😉",
                                    "author": "TY2022",
                                    "id": "fuv7j1z",
                                    "parent_id": "t1_fuv7gbo",
                                    "score": 2,
                                    "created_utc": 1592192013.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "How much did you clear pre-taxes in a year's time working that $10k/day job?",
            "author": "mrjimmyjsz",
            "id": "fuy4974",
            "parent_id": "t1_fuv6jgn",
            "score": 4,
            "created_utc": 1592258295.0,
            "replies": [
                {
                    "body": "About five point nine mil over two years..",
                    "author": "TY2022",
                    "id": "fuy8gsj",
                    "parent_id": "t1_fuy4974",
                    "score": 2,
                    "created_utc": 1592260246.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "All good, I'd hate to take your virginity anyway.",
            "author": "_Fortuna_",
            "id": "fvs5h3t",
            "parent_id": "t1_fvrx576",
            "score": 2,
            "created_utc": 1592945030.0,
            "replies": []
        },
        {
            "body": "I have kids and a job. Go back to your incel troll hole.",
            "author": "_Fortuna_",
            "id": "fvs5l5a",
            "parent_id": "t1_fvryi6j",
            "score": 2,
            "created_utc": 1592945084.0,
            "replies": []
        },
        {
            "body": "Yes, absolutely savage.",
            "author": "_Fortuna_",
            "id": "fuxae6a",
            "parent_id": "t1_fux9xn0",
            "score": 4,
            "created_utc": 1592243886.0,
            "replies": []
        },
        {
            "body": "O hell yeah 💀💀💀",
            "author": "LikeHoney99",
            "id": "fuxi6ql",
            "parent_id": "t1_fux9xn0",
            "score": 3,
            "created_utc": 1592247505.0,
            "replies": []
        },
        {
            "body": "Don't come at me like that.",
            "author": "_Fortuna_",
            "id": "fv3ekm6",
            "parent_id": "t1_fv3ecwx",
            "score": 2,
            "created_utc": 1592371202.0,
            "replies": [
                {
                    "body": "I am not coming at you at all. LOL. I am just stating that you should not have to deal with his behavior. I do not agree with the last-minute plans. That is disregarding your time and your plans that you may have had before he contacted you. Also, him acting like a child at the table should have been the last straw. If I were you, I would have said nothing, removed myself from the table, and went home. I am not a fan of grown men acting out. It is embarrassing, and it is not cute. On top of that, he was gaslighting you, and he attempted to keep you out late after you said, \"I don't want to be up late.\" He has disregarded you twice....Again, I am not coming at you. I am just simply saying that when you encounter men like him, you respond accordingly.",
                    "author": "AsheGuade",
                    "id": "fv3h8ge",
                    "parent_id": "t1_fv3ekm6",
                    "score": 1,
                    "created_utc": 1592373280.0,
                    "replies": [
                        {
                            "body": "I addressed a lot of this in the thread. Sorry it sounded like you were trying to tell me what to do!",
                            "author": "_Fortuna_",
                            "id": "fv6v1e0",
                            "parent_id": "t1_fv3h8ge",
                            "score": 1,
                            "created_utc": 1592445871.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I have updates! Will take some time to type it up in the next few days",
            "author": "_Fortuna_",
            "id": "fz0osas",
            "parent_id": "t1_fz0ak9j",
            "score": 1,
            "created_utc": 1595536688.0,
            "replies": []
        },
        {
            "body": "Welp buddy boy you may just wanna see your happy ass out of the Sugar Lifestyle Forum then.",
            "author": "_Fortuna_",
            "id": "fvrv6w6",
            "parent_id": "t1_fvrtpsk",
            "score": 1,
            "created_utc": 1592940007.0,
            "replies": []
        },
        {
            "body": "Ok goodbye virgin boy!",
            "author": "_Fortuna_",
            "id": "fvs8j0l",
            "parent_id": "t1_fvs640x",
            "score": 2,
            "created_utc": 1592946524.0,
            "replies": []
        },
        {
            "body": "No dear, no we haven't.",
            "author": "_Fortuna_",
            "id": "fw2xsvv",
            "parent_id": "t1_fw13pct",
            "score": 1,
            "created_utc": 1593191880.0,
            "replies": []
        },
        {
            "body": "The undertones are more for comedic relief than anything.  I needed to vent. In person I was incredibly patient and tried to be understanding for a considerable amount of time.  He started raising his voice in a very nice restaurant. I went into survival mode, tried to get an uber, and he left before I could.",
            "author": "_Fortuna_",
            "id": "fuwlsb0",
            "parent_id": "t1_fuw6w1n",
            "score": 2,
            "created_utc": 1592232137.0,
            "replies": []
        },
        {
            "body": "He ordered",
            "author": "_Fortuna_",
            "id": "fuwknwy",
            "parent_id": "t1_fuw5tbv",
            "score": 5,
            "created_utc": 1592231558.0,
            "replies": []
        },
        {
            "body": "The other part.",
            "author": "_Fortuna_",
            "id": "fuwlxmz",
            "parent_id": "t1_fuwb8xi",
            "score": 4,
            "created_utc": 1592232213.0,
            "replies": []
        },
        {
            "body": "Thank you for the attention. \\*Tips fedora\\*",
            "author": "_Fortuna_",
            "id": "fuwunk3",
            "parent_id": "t1_fuwgbed",
            "score": 1,
            "created_utc": 1592236502.0,
            "replies": []
        },
        {
            "body": "You are conflating the first dinner date you had which went bad with an established SR. Is that comparing like with like?\n\nYou are conflating talk about doing something, and with no expressed intention to do it with actually doing something.\n\nYou are suggesting that even if there was a miscommunication, that it was one party's fault?\n\nFinally, whatever the rights and wrongs, do you think it would ever have been right for the guy to stiff her for the whole bill? Without even an adult conversation? Is that how you operate?\n\nYou know, perhaps your POTs are picking up a vibe here and that's why they head off after a meal?",
            "author": "Mangotingthroneway",
            "id": "fuvuwxa",
            "parent_id": "t1_fuv988i",
            "score": 12,
            "created_utc": 1592211307.0,
            "replies": []
        },
        {
            "body": "He left me with a $350 tab. We go on platonic dates all the time. I stay with him without sleeping with him all the time. You do not know more about my arrangement than I do.\n\nThe bit about the credit card was an obvious joke. \n\n&#x200B;\n\nGoodbye",
            "author": "_Fortuna_",
            "id": "fuv9jl8",
            "parent_id": "t1_fuv988i",
            "score": 22,
            "created_utc": 1592193383.0,
            "replies": [
                {
                    "body": "ah yes this is the height of maturity. You did skip over all parts where I say he acted inappropriately and you deserve an apology. But because I say you are partially responsible you write this kind of childish thing like \"Goodbye\". Anyone who is going to react like that isn't ready to deal with things on an adult level, so you should look at this kind of response and how you painted the person you chose to be with and understand that there are parallels.\n\n\"We go on platonic dates all the time\" --> not important to me, all I am doing is working with the information you gave me. Which is that he was upset that he got on a platonic date this time. If you want to throw that line out the one you want to use it on him, I'm trying to help you understand how he may have felt. You're dismissing how he may have felt because you want to take no responsibility at all for the results (even though you admit to some).",
                    "author": "amigodeface",
                    "id": "fuvaue2",
                    "parent_id": "t1_fuv9jl8",
                    "score": -16,
                    "created_utc": 1592194296.0,
                    "replies": [
                        {
                            "body": "Who hurt you.",
                            "author": "_Fortuna_",
                            "id": "fuvbhpr",
                            "parent_id": "t1_fuvaue2",
                            "score": 16,
                            "created_utc": 1592194759.0,
                            "replies": [
                                {
                                    "body": "Clearly his last M+G...\n\nPoor baby!  /s",
                                    "author": "Actually_a_bot_accnt",
                                    "id": "fuvjtte",
                                    "parent_id": "t1_fuvbhpr",
                                    "score": 16,
                                    "created_utc": 1592201158.0,
                                    "replies": [
                                        {
                                            "body": "Yeah that m&g was definitely MY fault. It had nothing to do with his over stuffed suitcase of issues that we don't even want to begin to unpack.",
                                            "author": "_Fortuna_",
                                            "id": "fuvkb52",
                                            "parent_id": "t1_fuvjtte",
                                            "score": 7,
                                            "created_utc": 1592201558.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "Might be your \"SD\" in lurk mode.",
                                    "author": "Mangotingthroneway",
                                    "id": "fuvudfl",
                                    "parent_id": "t1_fuvbhpr",
                                    "score": 9,
                                    "created_utc": 1592210755.0,
                                    "replies": []
                                },
                                {
                                    "body": "> Who hurt you\n\nAs I said, you're showing the height of maturity. \n\nYou posted a set of actions which means it's open to analysis and criticism. You got some, you even got some sympathy, and you ignore the sympathy and instead you just see red and try to hurt someone you don't know.\n\nBut I'm past my 20s so trying the \"who hurt you\" meme line doesn't really bother me, just confirms what I've been saying.\n\nYou're more than happy to tear your SD a huge new asshole here out in public and paint yourself as the hero. You receive a mixed bag of sympathy and criticism and you decide you have to treat the person saying that as an enemy, because criticism is not something you can handle apparently.\n\nAlso I thought we were at \"Goodbye\" already.",
                                    "author": "amigodeface",
                                    "id": "fuvc2al",
                                    "parent_id": "t1_fuvbhpr",
                                    "score": -8,
                                    "created_utc": 1592195173.0,
                                    "replies": [
                                        {
                                            "body": "I am also very well past my 20s.",
                                            "author": "_Fortuna_",
                                            "id": "fuvca3b",
                                            "parent_id": "t1_fuvc2al",
                                            "score": 8,
                                            "created_utc": 1592195328.0,
                                            "replies": [
                                                {
                                                    "body": "> I am also very well past my 20s.\n\nThen it's time to leave things like \"who hurt you\" as a response behind for the teenagers and those just out of their teens, isn't it?\n\nYou don't have to lash out. I tried to give you something constructive and I will repeat, I said he acted inappropriately and you deserved an apology but all that did was trigger attack mode because I dared to say it was a mixed bag and not just m'lady you.\n\nThere is a reason why some people will not give the benefit of their thoughts and it's because not acting in politically desirable ways just attracts people lashing out and a bunch of downvotes from people who think that we should just be in head patting mode.\n\nFrom time to time I try it because I think it's constructive to hold up a mirror, if someone wants to grow from the experience.",
                                                    "author": "amigodeface",
                                                    "id": "fuvckkv",
                                                    "parent_id": "t1_fuvca3b",
                                                    "score": 0,
                                                    "created_utc": 1592195541.0,
                                                    "replies": [
                                                        {
                                                            "body": "Don’t waste your time, she just wants to rant about how she was wronged, what a strong woman she is, and rally the SBs here to her cause. Any of the insight you’ve provided is wasted/",
                                                            "author": "garret6758",
                                                            "id": "fuvdf38",
                                                            "parent_id": "t1_fuvckkv",
                                                            "score": -12,
                                                            "created_utc": 1592196168.0,
                                                            "replies": [
                                                                {
                                                                    "body": ">and rally the SBs here to her cause\n\nAre you so innately sexist that your eyes simply gloss over the numerous SD's who posted on her side? How strange.",
                                                                    "author": "blonde-throwaway",
                                                                    "id": "fuvvlhx",
                                                                    "parent_id": "t1_fuvdf38",
                                                                    "score": 11,
                                                                    "created_utc": 1592212011.0,
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "body": "A+ thanks",
                                                                    "author": "amigodeface",
                                                                    "id": "fvdcs66",
                                                                    "parent_id": "t1_fuvdf38",
                                                                    "score": 2,
                                                                    "created_utc": 1592596473.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I see you may have posted a number which is most likely an amount in relations to an arrangement. If this is the case, you are violating Rule#4 - \"No dollar amounts that are in reference to allowance/PPM are allowed.\"\n\n\nIf you are curious about Allowances reported by SLF contributors please see the [Allowance Master Thread 2019-2020](https://www.reddit.com/r/sugarlifestyleforum/comments/dezl91/allowance_master_thread_20192020/?utm_source=reddit&utm_medium=usertext&utm_name=sugarlifestyleforum&utm_content=t3_dnk455)\n\nYour post will not be approved until you remove the amount.  Please read the sub [Rules](https://www.reddit.com/r/sugarlifestyleforum/comments/748zta/updated_and_clarified_rules_for_slf/) prior to posting anything else. \n\nIf you simply posted a number not referencing a monetary amount, please message the MODs to approve your post.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/sugarlifestyleforum) if you have any questions or concerns.*",
            "author": "AutoModerator",
            "id": "fuv9t85",
            "parent_id": "t1_fuv988i",
            "score": 2,
            "created_utc": 1592193571.0,
            "replies": []
        },
        {
            "body": "A married virgin?  That's probably the saddest thing I've ever heard.",
            "author": "_Fortuna_",
            "id": "fvsagcc",
            "parent_id": "t1_fvs8ypw",
            "score": 1,
            "created_utc": 1592947477.0,
            "replies": []
        },
        {
            "body": "He definitely owes you. And not just for the cost of the bill, there’s an asshole tax",
            "author": "mraspencer",
            "id": "fuv4gqa",
            "parent_id": "t1_fuv4e5l",
            "score": 57,
            "created_utc": 1592189963.0,
            "replies": []
        },
        {
            "body": "Why would you want him back though? Buy stuff on his card equivalent to what his food would have cost then break contact and don't bother engaging with him in any way again. If he's going to be a baby don't chance that he'll make a fuss about payments on his cards that might bring undue scrutiny. Compensate yourself then cut him out of your Life.",
            "author": "KeyToGramercy",
            "id": "fuwcqjl",
            "parent_id": "t1_fuv4e5l",
            "score": 11,
            "created_utc": 1592226922.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fuv4jzo",
            "parent_id": "t1_fuv4e5l",
            "score": 28,
            "created_utc": 1592190022.0,
            "replies": [
                {
                    "body": "Only shave off ONE   let him decide if he wants to look  crazy or like a drag queen",
                    "author": "pinotandsugar",
                    "id": "fuvesot",
                    "parent_id": "t1_fuv4jzo",
                    "score": 20,
                    "created_utc": 1592197197.0,
                    "replies": [
                        {
                            "body": "Oh my god, you genius maniac!",
                            "author": "_Fortuna_",
                            "id": "fuvfmc9",
                            "parent_id": "t1_fuvesot",
                            "score": 6,
                            "created_utc": 1592197822.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "yessss.... I'm thinking I'll shave off all the \"hair\" in his bald spot too",
                    "author": "_Fortuna_",
                    "id": "fuv4xro",
                    "parent_id": "t1_fuv4jzo",
                    "score": 28,
                    "created_utc": 1592190274.0,
                    "replies": [
                        {
                            "body": "I like the idea of you giving him an heir cut.",
                            "author": "TY2022",
                            "id": "fuv7qhn",
                            "parent_id": "t1_fuv4xro",
                            "score": 11,
                            "created_utc": 1592192150.0,
                            "replies": [
                                {
                                    "body": "Hmmm, are you saying I should have his baby? Yes... yes... the ultimate rinse... child support.",
                                    "author": "_Fortuna_",
                                    "id": "fuv7vh2",
                                    "parent_id": "t1_fuv7qhn",
                                    "score": 29,
                                    "created_utc": 1592192244.0,
                                    "replies": [
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "fuv8ipa",
                                            "parent_id": "t1_fuv7vh2",
                                            "score": 11,
                                            "created_utc": 1592192674.0,
                                            "replies": [
                                                {
                                                    "body": "Why not both?",
                                                    "author": "superneutral",
                                                    "id": "fux0zj9",
                                                    "parent_id": "t1_fuv8ipa",
                                                    "score": 2,
                                                    "created_utc": 1592239515.0,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "body": "Oh my god yessssssss 🤣🤣🤣",
                                            "author": "kimchi_Queen",
                                            "id": "fuvt1rn",
                                            "parent_id": "t1_fuv7vh2",
                                            "score": 3,
                                            "created_utc": 1592209448.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "hahahahahahahahahhahahhahaha",
                                            "author": "TY2022",
                                            "id": "fuv7y5h",
                                            "parent_id": "t1_fuv7vh2",
                                            "score": 5,
                                            "created_utc": 1592192293.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "Would his genes help produce a quality baby?",
                                            "author": "mrjimmyjsz",
                                            "id": "fuy3wg1",
                                            "parent_id": "t1_fuv7vh2",
                                            "score": 2,
                                            "created_utc": 1592258135.0,
                                            "replies": [
                                                {
                                                    "body": "I'm afraid mine would be doing most of the heavy lifting 😅",
                                                    "author": "_Fortuna_",
                                                    "id": "fuy4s2q",
                                                    "parent_id": "t1_fuy3wg1",
                                                    "score": 3,
                                                    "created_utc": 1592258538.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "fuv54yh",
                            "parent_id": "t1_fuv4xro",
                            "score": 16,
                            "created_utc": 1592190407.0,
                            "replies": [
                                {
                                    "body": "OMG, the fact that there's a word for that is just outstanding.",
                                    "author": "_Fortuna_",
                                    "id": "fuv5vrf",
                                    "parent_id": "t1_fuv54yh",
                                    "score": 12,
                                    "created_utc": 1592190903.0,
                                    "replies": []
                                },
                                {
                                    "body": "💀💀💀",
                                    "author": "LikeHoney99",
                                    "id": "fuwyfbb",
                                    "parent_id": "t1_fuv54yh",
                                    "score": 1,
                                    "created_utc": 1592238275.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Shave off all the hair around his bald spot, just leave the fluff :)",
                            "author": "SlothsvPangolins",
                            "id": "fuwrfbh",
                            "parent_id": "t1_fuv4xro",
                            "score": 3,
                            "created_utc": 1592234947.0,
                            "replies": [
                                {
                                    "body": "Absolutely savage.  I love it.",
                                    "author": "_Fortuna_",
                                    "id": "fuy7zsy",
                                    "parent_id": "t1_fuwrfbh",
                                    "score": 1,
                                    "created_utc": 1592260025.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Holy Shiet! what a douche.\n\nI would work that credit card until the magnetic strip is worn off.",
            "author": "GSSD",
            "id": "fuwdvht",
            "parent_id": "t1_fuv4e5l",
            "score": 11,
            "created_utc": 1592227650.0,
            "replies": []
        },
        {
            "body": "Yeah, you definetely have to keep us posted",
            "author": null,
            "id": "fuvaqro",
            "parent_id": "t1_fuv4e5l",
            "score": 6,
            "created_utc": 1592194225.0,
            "replies": []
        },
        {
            "body": "*Let the rain fall down away from me...*",
            "author": null,
            "id": "fuvxet6",
            "parent_id": "t1_fuv4e5l",
            "score": 6,
            "created_utc": 1592213857.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fux0wqu",
            "parent_id": "t1_fuv4e5l",
            "score": 3,
            "created_utc": 1592239478.0,
            "replies": [
                {
                    "body": "I've actually been trying to put up some healthy boundaries so I can make this work. We had stayed together all weekend so spending Sunday dinner with him seemed like an acquiescence on my part.  \n\nYou're right, he's great when he wants to be!",
                    "author": "_Fortuna_",
                    "id": "fux3sas",
                    "parent_id": "t1_fux0wqu",
                    "score": 3,
                    "created_utc": 1592240888.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yes. Buy things on the card in the amount you paid for that dinner. Absolutely. It’s an arrangement. Never lose sight of that or let him lose sight of that either. God ! This sounds exactly like an SD I had ! So many great qualities and could be super helpful and generous ... then such a big. Fat. Fricking. Baby. Especially when he drank. And the storming out then calling a million times minutes later. And the for no good reason last minute dates. Mine was married, but even then, the last minute stuff didn’t make sense. He had a million excuses he could have used to make plans.",
            "author": null,
            "id": "fuz3yoj",
            "parent_id": "t1_fuv4e5l",
            "score": 3,
            "created_utc": 1592277667.0,
            "replies": []
        },
        {
            "body": "It would be interesting what his view of the nights events would be.  I would guess he would tell a very different version than yours, a may share a version of it with mutual friends.   Just be careful for this blow up withing your mutual friends network.",
            "author": "willfromvb",
            "id": "fuw5p28",
            "parent_id": "t1_fuv4e5l",
            "score": 2,
            "created_utc": 1592221676.0,
            "replies": [
                {
                    "body": "Of course he would tell a very different version.  One where it's ok to invite me to dinner and be justified in leaving me with a tab he knows I can't afford.",
                    "author": "_Fortuna_",
                    "id": "fuwlanz",
                    "parent_id": "t1_fuw5p28",
                    "score": 6,
                    "created_utc": 1592231888.0,
                    "replies": []
                },
                {
                    "body": "You know what’s interesting is, whenever I tried to discuss his behavior the next day, he definitely was embarrassed. He wouldn’t want to “get into it” Though. “Can you just give me the benefit of the doubt?”",
                    "author": null,
                    "id": "fuz4dss",
                    "parent_id": "t1_fuw5p28",
                    "score": 2,
                    "created_utc": 1592277930.0,
                    "replies": []
                },
                {
                    "body": "Really? My guess is they also know what he’s like drunk.",
                    "author": "LikeHoney99",
                    "id": "fuwyksg",
                    "parent_id": "t1_fuw5p28",
                    "score": 2,
                    "created_utc": 1592238346.0,
                    "replies": [
                        {
                            "body": "Yes you pretty much nailed it. There's really no trouble he could cause for me that wouldn't make things worse for him.",
                            "author": "_Fortuna_",
                            "id": "fuy8kg2",
                            "parent_id": "t1_fuwyksg",
                            "score": 3,
                            "created_utc": 1592260295.0,
                            "replies": []
                        },
                        {
                            "body": "Could be.  Then she wouldnt have to worry if he tried to poison the well with their mutual friends.  \n\nIm just saying that if he is that vindictive to leave her with the bill, I would be concerned with what else he may try to do t ok influence their mutual friends.  It gets sloppy with mutual friend.\n\nI'm certainly not trying to take his side.  We only know her side of the story.",
                            "author": "willfromvb",
                            "id": "fux0n23",
                            "parent_id": "t1_fuwyksg",
                            "score": 1,
                            "created_utc": 1592239348.0,
                            "replies": [
                                {
                                    "body": "You sound awfully apologetic for not being on his side....",
                                    "author": "LikeHoney99",
                                    "id": "fux1paq",
                                    "parent_id": "t1_fux0n23",
                                    "score": -1,
                                    "created_utc": 1592239865.0,
                                    "replies": [
                                        {
                                            "body": "That's a strange reaction.",
                                            "author": "willfromvb",
                                            "id": "fuxkx2b",
                                            "parent_id": "t1_fux1paq",
                                            "score": 2,
                                            "created_utc": 1592248835.0,
                                            "replies": [
                                                {
                                                    "body": "Oh, how so?",
                                                    "author": "LikeHoney99",
                                                    "id": "fuxkzlx",
                                                    "parent_id": "t1_fuxkx2b",
                                                    "score": 0,
                                                    "created_utc": 1592248869.0,
                                                    "replies": [
                                                        {
                                                            "body": "I'm amazed how quickly people are rendering judgement and  recommending punishment knowing only her side of the story.  \n\nI regularly meditate workplace disputes.  You rarely get the full story when you only hear one side.   I never want  to take sides other than the side of truth. \n\nBy her own admission she has being seeing this man for \"some time\" .  If he really is \"all bad\" and she is \"all good\", she has some culpability for continuing the relationship.  I suspect he is neither \"all bad\" nor is she \"all good\" and there is history in their relationship that contributed to his behavior more than what is described.",
                                                            "author": "willfromvb",
                                                            "id": "fuxngi3",
                                                            "parent_id": "t1_fuxkzlx",
                                                            "score": 1,
                                                            "created_utc": 1592250068.0,
                                                            "replies": [
                                                                {
                                                                    "body": "That's interesting, but doesn't make my comment about you seeming like his apologist strange, or explain why you found it strange.",
                                                                    "author": "LikeHoney99",
                                                                    "id": "fuxq42i",
                                                                    "parent_id": "t1_fuxngi3",
                                                                    "score": 1,
                                                                    "created_utc": 1592251361.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "The assumption that there is only her side or his side is what seems strange to me.  There is also the side of truth.",
                                                                            "author": "willfromvb",
                                                                            "id": "fuxr61r",
                                                                            "parent_id": "t1_fuxq42i",
                                                                            "score": 1,
                                                                            "created_utc": 1592251880.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "I don’t think we’re talking about the same thing 🤷‍♀️",
                                                                                    "author": "LikeHoney99",
                                                                                    "id": "fuxrsjj",
                                                                                    "parent_id": "t1_fuxr61r",
                                                                                    "score": 2,
                                                                                    "created_utc": 1592252191.0,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Why would that credit card still work? If the guy has any sense he blocked it already.",
            "author": null,
            "id": "fv301zy",
            "parent_id": "t1_fuv4e5l",
            "score": 1,
            "created_utc": 1592361565.0,
            "replies": [
                {
                    "body": "A valid assumption for any normal human being.",
                    "author": "_Fortuna_",
                    "id": "fv37vkq",
                    "parent_id": "t1_fv301zy",
                    "score": 1,
                    "created_utc": 1592366440.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I hope the food was good at least",
            "author": "canavatar12",
            "id": "fuv58fq",
            "parent_id": "t1_fuv3o80",
            "score": 5,
            "created_utc": 1592190471.0,
            "replies": [
                {
                    "body": "Hell yes!\n\nBurrata with Prosciutto\n\nwedge salad\n\nchilean sea bass, 11 oz Filet, 6 oz lobster\n\nBacon Brussels Sprouts, Au Gratin Potatoes\n\nKey lime pie\n\nespresso martini, Manhattan, blue cheese olive belvedere martini\n\n&#x200B;\n\n&#x200B;\n\nI have leftovers if you're hungry",
                    "author": "_Fortuna_",
                    "id": "fuv5ors",
                    "parent_id": "t1_fuv58fq",
                    "score": 41,
                    "created_utc": 1592190773.0,
                    "replies": [
                        {
                            "body": "Lol that does sound expensive",
                            "author": "canavatar12",
                            "id": "fuv8zbk",
                            "parent_id": "t1_fuv5ors",
                            "score": 10,
                            "created_utc": 1592192988.0,
                            "replies": []
                        },
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "fuw73ul",
                            "parent_id": "t1_fuv5ors",
                            "score": 9,
                            "created_utc": 1592222834.0,
                            "replies": [
                                {
                                    "body": "I wouldn't make you sleep with me if you want the leftovers lol",
                                    "author": "_Fortuna_",
                                    "id": "fuwmoab",
                                    "parent_id": "t1_fuw73ul",
                                    "score": 4,
                                    "created_utc": 1592232588.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Omg. I love this list.",
                            "author": null,
                            "id": "fuz4orn",
                            "parent_id": "t1_fuv5ors",
                            "score": 2,
                            "created_utc": 1592278118.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Smart girl, Birkins can be an investment. Good luck to you, nice to see a boss bitch taking no shit from a man.",
            "author": "Actually_a_bot_accnt",
            "id": "fuvk3hl",
            "parent_id": "t1_fuvjpls",
            "score": 3,
            "created_utc": 1592201378.0,
            "replies": []
        },
        {
            "body": "Jesus.",
            "author": "LikeHoney99",
            "id": "fuwz10y",
            "parent_id": "t1_fuwklrc",
            "score": 2,
            "created_utc": 1592238559.0,
            "replies": []
        },
        {
            "body": "😂",
            "author": "LikeHoney99",
            "id": "fuwyucr",
            "parent_id": "t1_fuv6gy9",
            "score": 2,
            "created_utc": 1592238471.0,
            "replies": []
        },
        {
            "body": ">Social shame pays dividends.\n\nThat is very true!",
            "author": "bsbdfw",
            "id": "fux0qkm",
            "parent_id": "t1_fuvdqf1",
            "score": 5,
            "created_utc": 1592239394.0,
            "replies": []
        },
        {
            "body": "It does. You do you boo!",
            "author": null,
            "id": "fvd2vwv",
            "parent_id": "t1_fuvdqf1",
            "score": 1,
            "created_utc": 1592591591.0,
            "replies": []
        },
        {
            "body": "WOAH! Good for fucking you. He storms off and then comes back?? How long did it take for him to come back ? What did he say? Did you pay for the dinner or did you use his card?\n\nIf you used your own CC you could pay off the balance with his CC. I really don't think it would be much of an issue. Especially since he obviously felt bad.\n\n  \nYour response is hilarious. How long have you been together? Is he good to you? He as a CC for you, so that alone seems like he might be very good to you. I have yet to ever reach that level, but I am super informal about sugaring and only ever have 1 if I do.",
            "author": "kimchi_Queen",
            "id": "fuvtaii",
            "parent_id": "t1_fuv6wbj",
            "score": 6,
            "created_utc": 1592209685.0,
            "replies": [
                {
                    "body": "Yes!! He stormed off, called my phone about 5 times (rejected) then comes back about ten minutes later. He sat down and before he could speak I told him to leave.\n\nI used my own money to pay. His card was at my house. I'm thinking of sending him the world's biggest dildo and a penis pump. Let me know if you think of anything else lol.\n\n&#x200B;\n\nWe've been together 5 ish months, though I've known a few of friends for 10+ years. He's very good to me most of the time, but his drinking is problematic. He'd been out on his boat all day so he showed up late and apparently pretty lit. Unfortunately I didn't realize this till after we got to the restaurant.\n\n&#x200B;\n\nAs for the cc, it's not mine, but he gives it to me to use pretty regularly. Like I said, he can be very sweet. He gets me gifts and things he thinks I might need all the time. He'll text me when he's at the mall and demand that I send him pics of things I want. He'll go to the grocery store and bring me piles of food then cook me dinner AND clean! \n\nI'm not ppm or monthly, but he'll give me money whenever I say I need it.\n\nI don't know what to do with this man!",
                    "author": "_Fortuna_",
                    "id": "fuwpnae",
                    "parent_id": "t1_fuvtaii",
                    "score": 5,
                    "created_utc": 1592234070.0,
                    "replies": [
                        {
                            "body": "Awe! You are fucking hilarious. Seems like he might have a sensitive fragile ego. Would you say he does? Fuccckkkk that gift is making me crack up.\n\nDoes sound like a sweetie regardless. God, what is up with men and drinking problems? I had to leave my last ex of a few years because he was a real sweetheart but a huge asshole when he was drunk and he is drunk all the time. I've been connecting with a new person, not on a sugaring level, but in the short time we have been hanging, he totally changes into an overly sensitive and accusatory asshole when he is drunk. Bleck!",
                            "author": "kimchi_Queen",
                            "id": "fuxjupl",
                            "parent_id": "t1_fuwpnae",
                            "score": 4,
                            "created_utc": 1592248315.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Would you have just smiled if it was $10K per day?",
            "author": "TY2022",
            "id": "fuv76zv",
            "parent_id": "t1_fuv6wbj",
            "score": 0,
            "created_utc": 1592191786.0,
            "replies": [
                {
                    "body": "No, but I've done it in the past.",
                    "author": "_Fortuna_",
                    "id": "fuv7gbo",
                    "parent_id": "t1_fuv76zv",
                    "score": 7,
                    "created_utc": 1592191960.0,
                    "replies": [
                        {
                            "body": "Roger that.  😉",
                            "author": "TY2022",
                            "id": "fuv7j1z",
                            "parent_id": "t1_fuv7gbo",
                            "score": 2,
                            "created_utc": 1592192013.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "About five point nine mil over two years..",
            "author": "TY2022",
            "id": "fuy8gsj",
            "parent_id": "t1_fuy4974",
            "score": 2,
            "created_utc": 1592260246.0,
            "replies": []
        },
        {
            "body": "I am not coming at you at all. LOL. I am just stating that you should not have to deal with his behavior. I do not agree with the last-minute plans. That is disregarding your time and your plans that you may have had before he contacted you. Also, him acting like a child at the table should have been the last straw. If I were you, I would have said nothing, removed myself from the table, and went home. I am not a fan of grown men acting out. It is embarrassing, and it is not cute. On top of that, he was gaslighting you, and he attempted to keep you out late after you said, \"I don't want to be up late.\" He has disregarded you twice....Again, I am not coming at you. I am just simply saying that when you encounter men like him, you respond accordingly.",
            "author": "AsheGuade",
            "id": "fv3h8ge",
            "parent_id": "t1_fv3ekm6",
            "score": 1,
            "created_utc": 1592373280.0,
            "replies": [
                {
                    "body": "I addressed a lot of this in the thread. Sorry it sounded like you were trying to tell me what to do!",
                    "author": "_Fortuna_",
                    "id": "fv6v1e0",
                    "parent_id": "t1_fv3h8ge",
                    "score": 1,
                    "created_utc": 1592445871.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "ah yes this is the height of maturity. You did skip over all parts where I say he acted inappropriately and you deserve an apology. But because I say you are partially responsible you write this kind of childish thing like \"Goodbye\". Anyone who is going to react like that isn't ready to deal with things on an adult level, so you should look at this kind of response and how you painted the person you chose to be with and understand that there are parallels.\n\n\"We go on platonic dates all the time\" --> not important to me, all I am doing is working with the information you gave me. Which is that he was upset that he got on a platonic date this time. If you want to throw that line out the one you want to use it on him, I'm trying to help you understand how he may have felt. You're dismissing how he may have felt because you want to take no responsibility at all for the results (even though you admit to some).",
            "author": "amigodeface",
            "id": "fuvaue2",
            "parent_id": "t1_fuv9jl8",
            "score": -16,
            "created_utc": 1592194296.0,
            "replies": [
                {
                    "body": "Who hurt you.",
                    "author": "_Fortuna_",
                    "id": "fuvbhpr",
                    "parent_id": "t1_fuvaue2",
                    "score": 16,
                    "created_utc": 1592194759.0,
                    "replies": [
                        {
                            "body": "Clearly his last M+G...\n\nPoor baby!  /s",
                            "author": "Actually_a_bot_accnt",
                            "id": "fuvjtte",
                            "parent_id": "t1_fuvbhpr",
                            "score": 16,
                            "created_utc": 1592201158.0,
                            "replies": [
                                {
                                    "body": "Yeah that m&g was definitely MY fault. It had nothing to do with his over stuffed suitcase of issues that we don't even want to begin to unpack.",
                                    "author": "_Fortuna_",
                                    "id": "fuvkb52",
                                    "parent_id": "t1_fuvjtte",
                                    "score": 7,
                                    "created_utc": 1592201558.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Might be your \"SD\" in lurk mode.",
                            "author": "Mangotingthroneway",
                            "id": "fuvudfl",
                            "parent_id": "t1_fuvbhpr",
                            "score": 9,
                            "created_utc": 1592210755.0,
                            "replies": []
                        },
                        {
                            "body": "> Who hurt you\n\nAs I said, you're showing the height of maturity. \n\nYou posted a set of actions which means it's open to analysis and criticism. You got some, you even got some sympathy, and you ignore the sympathy and instead you just see red and try to hurt someone you don't know.\n\nBut I'm past my 20s so trying the \"who hurt you\" meme line doesn't really bother me, just confirms what I've been saying.\n\nYou're more than happy to tear your SD a huge new asshole here out in public and paint yourself as the hero. You receive a mixed bag of sympathy and criticism and you decide you have to treat the person saying that as an enemy, because criticism is not something you can handle apparently.\n\nAlso I thought we were at \"Goodbye\" already.",
                            "author": "amigodeface",
                            "id": "fuvc2al",
                            "parent_id": "t1_fuvbhpr",
                            "score": -8,
                            "created_utc": 1592195173.0,
                            "replies": [
                                {
                                    "body": "I am also very well past my 20s.",
                                    "author": "_Fortuna_",
                                    "id": "fuvca3b",
                                    "parent_id": "t1_fuvc2al",
                                    "score": 8,
                                    "created_utc": 1592195328.0,
                                    "replies": [
                                        {
                                            "body": "> I am also very well past my 20s.\n\nThen it's time to leave things like \"who hurt you\" as a response behind for the teenagers and those just out of their teens, isn't it?\n\nYou don't have to lash out. I tried to give you something constructive and I will repeat, I said he acted inappropriately and you deserved an apology but all that did was trigger attack mode because I dared to say it was a mixed bag and not just m'lady you.\n\nThere is a reason why some people will not give the benefit of their thoughts and it's because not acting in politically desirable ways just attracts people lashing out and a bunch of downvotes from people who think that we should just be in head patting mode.\n\nFrom time to time I try it because I think it's constructive to hold up a mirror, if someone wants to grow from the experience.",
                                            "author": "amigodeface",
                                            "id": "fuvckkv",
                                            "parent_id": "t1_fuvca3b",
                                            "score": 0,
                                            "created_utc": 1592195541.0,
                                            "replies": [
                                                {
                                                    "body": "Don’t waste your time, she just wants to rant about how she was wronged, what a strong woman she is, and rally the SBs here to her cause. Any of the insight you’ve provided is wasted/",
                                                    "author": "garret6758",
                                                    "id": "fuvdf38",
                                                    "parent_id": "t1_fuvckkv",
                                                    "score": -12,
                                                    "created_utc": 1592196168.0,
                                                    "replies": [
                                                        {
                                                            "body": ">and rally the SBs here to her cause\n\nAre you so innately sexist that your eyes simply gloss over the numerous SD's who posted on her side? How strange.",
                                                            "author": "blonde-throwaway",
                                                            "id": "fuvvlhx",
                                                            "parent_id": "t1_fuvdf38",
                                                            "score": 11,
                                                            "created_utc": 1592212011.0,
                                                            "replies": []
                                                        },
                                                        {
                                                            "body": "A+ thanks",
                                                            "author": "amigodeface",
                                                            "id": "fvdcs66",
                                                            "parent_id": "t1_fuvdf38",
                                                            "score": 2,
                                                            "created_utc": 1592596473.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Only shave off ONE   let him decide if he wants to look  crazy or like a drag queen",
            "author": "pinotandsugar",
            "id": "fuvesot",
            "parent_id": "t1_fuv4jzo",
            "score": 20,
            "created_utc": 1592197197.0,
            "replies": [
                {
                    "body": "Oh my god, you genius maniac!",
                    "author": "_Fortuna_",
                    "id": "fuvfmc9",
                    "parent_id": "t1_fuvesot",
                    "score": 6,
                    "created_utc": 1592197822.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "yessss.... I'm thinking I'll shave off all the \"hair\" in his bald spot too",
            "author": "_Fortuna_",
            "id": "fuv4xro",
            "parent_id": "t1_fuv4jzo",
            "score": 28,
            "created_utc": 1592190274.0,
            "replies": [
                {
                    "body": "I like the idea of you giving him an heir cut.",
                    "author": "TY2022",
                    "id": "fuv7qhn",
                    "parent_id": "t1_fuv4xro",
                    "score": 11,
                    "created_utc": 1592192150.0,
                    "replies": [
                        {
                            "body": "Hmmm, are you saying I should have his baby? Yes... yes... the ultimate rinse... child support.",
                            "author": "_Fortuna_",
                            "id": "fuv7vh2",
                            "parent_id": "t1_fuv7qhn",
                            "score": 29,
                            "created_utc": 1592192244.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "fuv8ipa",
                                    "parent_id": "t1_fuv7vh2",
                                    "score": 11,
                                    "created_utc": 1592192674.0,
                                    "replies": [
                                        {
                                            "body": "Why not both?",
                                            "author": "superneutral",
                                            "id": "fux0zj9",
                                            "parent_id": "t1_fuv8ipa",
                                            "score": 2,
                                            "created_utc": 1592239515.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "Oh my god yessssssss 🤣🤣🤣",
                                    "author": "kimchi_Queen",
                                    "id": "fuvt1rn",
                                    "parent_id": "t1_fuv7vh2",
                                    "score": 3,
                                    "created_utc": 1592209448.0,
                                    "replies": []
                                },
                                {
                                    "body": "hahahahahahahahahhahahhahaha",
                                    "author": "TY2022",
                                    "id": "fuv7y5h",
                                    "parent_id": "t1_fuv7vh2",
                                    "score": 5,
                                    "created_utc": 1592192293.0,
                                    "replies": []
                                },
                                {
                                    "body": "Would his genes help produce a quality baby?",
                                    "author": "mrjimmyjsz",
                                    "id": "fuy3wg1",
                                    "parent_id": "t1_fuv7vh2",
                                    "score": 2,
                                    "created_utc": 1592258135.0,
                                    "replies": [
                                        {
                                            "body": "I'm afraid mine would be doing most of the heavy lifting 😅",
                                            "author": "_Fortuna_",
                                            "id": "fuy4s2q",
                                            "parent_id": "t1_fuy3wg1",
                                            "score": 3,
                                            "created_utc": 1592258538.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "fuv54yh",
                    "parent_id": "t1_fuv4xro",
                    "score": 16,
                    "created_utc": 1592190407.0,
                    "replies": [
                        {
                            "body": "OMG, the fact that there's a word for that is just outstanding.",
                            "author": "_Fortuna_",
                            "id": "fuv5vrf",
                            "parent_id": "t1_fuv54yh",
                            "score": 12,
                            "created_utc": 1592190903.0,
                            "replies": []
                        },
                        {
                            "body": "💀💀💀",
                            "author": "LikeHoney99",
                            "id": "fuwyfbb",
                            "parent_id": "t1_fuv54yh",
                            "score": 1,
                            "created_utc": 1592238275.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Shave off all the hair around his bald spot, just leave the fluff :)",
                    "author": "SlothsvPangolins",
                    "id": "fuwrfbh",
                    "parent_id": "t1_fuv4xro",
                    "score": 3,
                    "created_utc": 1592234947.0,
                    "replies": [
                        {
                            "body": "Absolutely savage.  I love it.",
                            "author": "_Fortuna_",
                            "id": "fuy7zsy",
                            "parent_id": "t1_fuwrfbh",
                            "score": 1,
                            "created_utc": 1592260025.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I've actually been trying to put up some healthy boundaries so I can make this work. We had stayed together all weekend so spending Sunday dinner with him seemed like an acquiescence on my part.  \n\nYou're right, he's great when he wants to be!",
            "author": "_Fortuna_",
            "id": "fux3sas",
            "parent_id": "t1_fux0wqu",
            "score": 3,
            "created_utc": 1592240888.0,
            "replies": []
        },
        {
            "body": "Of course he would tell a very different version.  One where it's ok to invite me to dinner and be justified in leaving me with a tab he knows I can't afford.",
            "author": "_Fortuna_",
            "id": "fuwlanz",
            "parent_id": "t1_fuw5p28",
            "score": 6,
            "created_utc": 1592231888.0,
            "replies": []
        },
        {
            "body": "You know what’s interesting is, whenever I tried to discuss his behavior the next day, he definitely was embarrassed. He wouldn’t want to “get into it” Though. “Can you just give me the benefit of the doubt?”",
            "author": null,
            "id": "fuz4dss",
            "parent_id": "t1_fuw5p28",
            "score": 2,
            "created_utc": 1592277930.0,
            "replies": []
        },
        {
            "body": "Really? My guess is they also know what he’s like drunk.",
            "author": "LikeHoney99",
            "id": "fuwyksg",
            "parent_id": "t1_fuw5p28",
            "score": 2,
            "created_utc": 1592238346.0,
            "replies": [
                {
                    "body": "Yes you pretty much nailed it. There's really no trouble he could cause for me that wouldn't make things worse for him.",
                    "author": "_Fortuna_",
                    "id": "fuy8kg2",
                    "parent_id": "t1_fuwyksg",
                    "score": 3,
                    "created_utc": 1592260295.0,
                    "replies": []
                },
                {
                    "body": "Could be.  Then she wouldnt have to worry if he tried to poison the well with their mutual friends.  \n\nIm just saying that if he is that vindictive to leave her with the bill, I would be concerned with what else he may try to do t ok influence their mutual friends.  It gets sloppy with mutual friend.\n\nI'm certainly not trying to take his side.  We only know her side of the story.",
                    "author": "willfromvb",
                    "id": "fux0n23",
                    "parent_id": "t1_fuwyksg",
                    "score": 1,
                    "created_utc": 1592239348.0,
                    "replies": [
                        {
                            "body": "You sound awfully apologetic for not being on his side....",
                            "author": "LikeHoney99",
                            "id": "fux1paq",
                            "parent_id": "t1_fux0n23",
                            "score": -1,
                            "created_utc": 1592239865.0,
                            "replies": [
                                {
                                    "body": "That's a strange reaction.",
                                    "author": "willfromvb",
                                    "id": "fuxkx2b",
                                    "parent_id": "t1_fux1paq",
                                    "score": 2,
                                    "created_utc": 1592248835.0,
                                    "replies": [
                                        {
                                            "body": "Oh, how so?",
                                            "author": "LikeHoney99",
                                            "id": "fuxkzlx",
                                            "parent_id": "t1_fuxkx2b",
                                            "score": 0,
                                            "created_utc": 1592248869.0,
                                            "replies": [
                                                {
                                                    "body": "I'm amazed how quickly people are rendering judgement and  recommending punishment knowing only her side of the story.  \n\nI regularly meditate workplace disputes.  You rarely get the full story when you only hear one side.   I never want  to take sides other than the side of truth. \n\nBy her own admission she has being seeing this man for \"some time\" .  If he really is \"all bad\" and she is \"all good\", she has some culpability for continuing the relationship.  I suspect he is neither \"all bad\" nor is she \"all good\" and there is history in their relationship that contributed to his behavior more than what is described.",
                                                    "author": "willfromvb",
                                                    "id": "fuxngi3",
                                                    "parent_id": "t1_fuxkzlx",
                                                    "score": 1,
                                                    "created_utc": 1592250068.0,
                                                    "replies": [
                                                        {
                                                            "body": "That's interesting, but doesn't make my comment about you seeming like his apologist strange, or explain why you found it strange.",
                                                            "author": "LikeHoney99",
                                                            "id": "fuxq42i",
                                                            "parent_id": "t1_fuxngi3",
                                                            "score": 1,
                                                            "created_utc": 1592251361.0,
                                                            "replies": [
                                                                {
                                                                    "body": "The assumption that there is only her side or his side is what seems strange to me.  There is also the side of truth.",
                                                                    "author": "willfromvb",
                                                                    "id": "fuxr61r",
                                                                    "parent_id": "t1_fuxq42i",
                                                                    "score": 1,
                                                                    "created_utc": 1592251880.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "I don’t think we’re talking about the same thing 🤷‍♀️",
                                                                            "author": "LikeHoney99",
                                                                            "id": "fuxrsjj",
                                                                            "parent_id": "t1_fuxr61r",
                                                                            "score": 2,
                                                                            "created_utc": 1592252191.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "A valid assumption for any normal human being.",
            "author": "_Fortuna_",
            "id": "fv37vkq",
            "parent_id": "t1_fv301zy",
            "score": 1,
            "created_utc": 1592366440.0,
            "replies": []
        },
        {
            "body": "Hell yes!\n\nBurrata with Prosciutto\n\nwedge salad\n\nchilean sea bass, 11 oz Filet, 6 oz lobster\n\nBacon Brussels Sprouts, Au Gratin Potatoes\n\nKey lime pie\n\nespresso martini, Manhattan, blue cheese olive belvedere martini\n\n&#x200B;\n\n&#x200B;\n\nI have leftovers if you're hungry",
            "author": "_Fortuna_",
            "id": "fuv5ors",
            "parent_id": "t1_fuv58fq",
            "score": 41,
            "created_utc": 1592190773.0,
            "replies": [
                {
                    "body": "Lol that does sound expensive",
                    "author": "canavatar12",
                    "id": "fuv8zbk",
                    "parent_id": "t1_fuv5ors",
                    "score": 10,
                    "created_utc": 1592192988.0,
                    "replies": []
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "fuw73ul",
                    "parent_id": "t1_fuv5ors",
                    "score": 9,
                    "created_utc": 1592222834.0,
                    "replies": [
                        {
                            "body": "I wouldn't make you sleep with me if you want the leftovers lol",
                            "author": "_Fortuna_",
                            "id": "fuwmoab",
                            "parent_id": "t1_fuw73ul",
                            "score": 4,
                            "created_utc": 1592232588.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Omg. I love this list.",
                    "author": null,
                    "id": "fuz4orn",
                    "parent_id": "t1_fuv5ors",
                    "score": 2,
                    "created_utc": 1592278118.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yes!! He stormed off, called my phone about 5 times (rejected) then comes back about ten minutes later. He sat down and before he could speak I told him to leave.\n\nI used my own money to pay. His card was at my house. I'm thinking of sending him the world's biggest dildo and a penis pump. Let me know if you think of anything else lol.\n\n&#x200B;\n\nWe've been together 5 ish months, though I've known a few of friends for 10+ years. He's very good to me most of the time, but his drinking is problematic. He'd been out on his boat all day so he showed up late and apparently pretty lit. Unfortunately I didn't realize this till after we got to the restaurant.\n\n&#x200B;\n\nAs for the cc, it's not mine, but he gives it to me to use pretty regularly. Like I said, he can be very sweet. He gets me gifts and things he thinks I might need all the time. He'll text me when he's at the mall and demand that I send him pics of things I want. He'll go to the grocery store and bring me piles of food then cook me dinner AND clean! \n\nI'm not ppm or monthly, but he'll give me money whenever I say I need it.\n\nI don't know what to do with this man!",
            "author": "_Fortuna_",
            "id": "fuwpnae",
            "parent_id": "t1_fuvtaii",
            "score": 5,
            "created_utc": 1592234070.0,
            "replies": [
                {
                    "body": "Awe! You are fucking hilarious. Seems like he might have a sensitive fragile ego. Would you say he does? Fuccckkkk that gift is making me crack up.\n\nDoes sound like a sweetie regardless. God, what is up with men and drinking problems? I had to leave my last ex of a few years because he was a real sweetheart but a huge asshole when he was drunk and he is drunk all the time. I've been connecting with a new person, not on a sugaring level, but in the short time we have been hanging, he totally changes into an overly sensitive and accusatory asshole when he is drunk. Bleck!",
                    "author": "kimchi_Queen",
                    "id": "fuxjupl",
                    "parent_id": "t1_fuwpnae",
                    "score": 4,
                    "created_utc": 1592248315.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "No, but I've done it in the past.",
            "author": "_Fortuna_",
            "id": "fuv7gbo",
            "parent_id": "t1_fuv76zv",
            "score": 7,
            "created_utc": 1592191960.0,
            "replies": [
                {
                    "body": "Roger that.  😉",
                    "author": "TY2022",
                    "id": "fuv7j1z",
                    "parent_id": "t1_fuv7gbo",
                    "score": 2,
                    "created_utc": 1592192013.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I addressed a lot of this in the thread. Sorry it sounded like you were trying to tell me what to do!",
            "author": "_Fortuna_",
            "id": "fv6v1e0",
            "parent_id": "t1_fv3h8ge",
            "score": 1,
            "created_utc": 1592445871.0,
            "replies": []
        },
        {
            "body": "Who hurt you.",
            "author": "_Fortuna_",
            "id": "fuvbhpr",
            "parent_id": "t1_fuvaue2",
            "score": 16,
            "created_utc": 1592194759.0,
            "replies": [
                {
                    "body": "Clearly his last M+G...\n\nPoor baby!  /s",
                    "author": "Actually_a_bot_accnt",
                    "id": "fuvjtte",
                    "parent_id": "t1_fuvbhpr",
                    "score": 16,
                    "created_utc": 1592201158.0,
                    "replies": [
                        {
                            "body": "Yeah that m&g was definitely MY fault. It had nothing to do with his over stuffed suitcase of issues that we don't even want to begin to unpack.",
                            "author": "_Fortuna_",
                            "id": "fuvkb52",
                            "parent_id": "t1_fuvjtte",
                            "score": 7,
                            "created_utc": 1592201558.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Might be your \"SD\" in lurk mode.",
                    "author": "Mangotingthroneway",
                    "id": "fuvudfl",
                    "parent_id": "t1_fuvbhpr",
                    "score": 9,
                    "created_utc": 1592210755.0,
                    "replies": []
                },
                {
                    "body": "> Who hurt you\n\nAs I said, you're showing the height of maturity. \n\nYou posted a set of actions which means it's open to analysis and criticism. You got some, you even got some sympathy, and you ignore the sympathy and instead you just see red and try to hurt someone you don't know.\n\nBut I'm past my 20s so trying the \"who hurt you\" meme line doesn't really bother me, just confirms what I've been saying.\n\nYou're more than happy to tear your SD a huge new asshole here out in public and paint yourself as the hero. You receive a mixed bag of sympathy and criticism and you decide you have to treat the person saying that as an enemy, because criticism is not something you can handle apparently.\n\nAlso I thought we were at \"Goodbye\" already.",
                    "author": "amigodeface",
                    "id": "fuvc2al",
                    "parent_id": "t1_fuvbhpr",
                    "score": -8,
                    "created_utc": 1592195173.0,
                    "replies": [
                        {
                            "body": "I am also very well past my 20s.",
                            "author": "_Fortuna_",
                            "id": "fuvca3b",
                            "parent_id": "t1_fuvc2al",
                            "score": 8,
                            "created_utc": 1592195328.0,
                            "replies": [
                                {
                                    "body": "> I am also very well past my 20s.\n\nThen it's time to leave things like \"who hurt you\" as a response behind for the teenagers and those just out of their teens, isn't it?\n\nYou don't have to lash out. I tried to give you something constructive and I will repeat, I said he acted inappropriately and you deserved an apology but all that did was trigger attack mode because I dared to say it was a mixed bag and not just m'lady you.\n\nThere is a reason why some people will not give the benefit of their thoughts and it's because not acting in politically desirable ways just attracts people lashing out and a bunch of downvotes from people who think that we should just be in head patting mode.\n\nFrom time to time I try it because I think it's constructive to hold up a mirror, if someone wants to grow from the experience.",
                                    "author": "amigodeface",
                                    "id": "fuvckkv",
                                    "parent_id": "t1_fuvca3b",
                                    "score": 0,
                                    "created_utc": 1592195541.0,
                                    "replies": [
                                        {
                                            "body": "Don’t waste your time, she just wants to rant about how she was wronged, what a strong woman she is, and rally the SBs here to her cause. Any of the insight you’ve provided is wasted/",
                                            "author": "garret6758",
                                            "id": "fuvdf38",
                                            "parent_id": "t1_fuvckkv",
                                            "score": -12,
                                            "created_utc": 1592196168.0,
                                            "replies": [
                                                {
                                                    "body": ">and rally the SBs here to her cause\n\nAre you so innately sexist that your eyes simply gloss over the numerous SD's who posted on her side? How strange.",
                                                    "author": "blonde-throwaway",
                                                    "id": "fuvvlhx",
                                                    "parent_id": "t1_fuvdf38",
                                                    "score": 11,
                                                    "created_utc": 1592212011.0,
                                                    "replies": []
                                                },
                                                {
                                                    "body": "A+ thanks",
                                                    "author": "amigodeface",
                                                    "id": "fvdcs66",
                                                    "parent_id": "t1_fuvdf38",
                                                    "score": 2,
                                                    "created_utc": 1592596473.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Oh my god, you genius maniac!",
            "author": "_Fortuna_",
            "id": "fuvfmc9",
            "parent_id": "t1_fuvesot",
            "score": 6,
            "created_utc": 1592197822.0,
            "replies": []
        },
        {
            "body": "I like the idea of you giving him an heir cut.",
            "author": "TY2022",
            "id": "fuv7qhn",
            "parent_id": "t1_fuv4xro",
            "score": 11,
            "created_utc": 1592192150.0,
            "replies": [
                {
                    "body": "Hmmm, are you saying I should have his baby? Yes... yes... the ultimate rinse... child support.",
                    "author": "_Fortuna_",
                    "id": "fuv7vh2",
                    "parent_id": "t1_fuv7qhn",
                    "score": 29,
                    "created_utc": 1592192244.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "fuv8ipa",
                            "parent_id": "t1_fuv7vh2",
                            "score": 11,
                            "created_utc": 1592192674.0,
                            "replies": [
                                {
                                    "body": "Why not both?",
                                    "author": "superneutral",
                                    "id": "fux0zj9",
                                    "parent_id": "t1_fuv8ipa",
                                    "score": 2,
                                    "created_utc": 1592239515.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Oh my god yessssssss 🤣🤣🤣",
                            "author": "kimchi_Queen",
                            "id": "fuvt1rn",
                            "parent_id": "t1_fuv7vh2",
                            "score": 3,
                            "created_utc": 1592209448.0,
                            "replies": []
                        },
                        {
                            "body": "hahahahahahahahahhahahhahaha",
                            "author": "TY2022",
                            "id": "fuv7y5h",
                            "parent_id": "t1_fuv7vh2",
                            "score": 5,
                            "created_utc": 1592192293.0,
                            "replies": []
                        },
                        {
                            "body": "Would his genes help produce a quality baby?",
                            "author": "mrjimmyjsz",
                            "id": "fuy3wg1",
                            "parent_id": "t1_fuv7vh2",
                            "score": 2,
                            "created_utc": 1592258135.0,
                            "replies": [
                                {
                                    "body": "I'm afraid mine would be doing most of the heavy lifting 😅",
                                    "author": "_Fortuna_",
                                    "id": "fuy4s2q",
                                    "parent_id": "t1_fuy3wg1",
                                    "score": 3,
                                    "created_utc": 1592258538.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fuv54yh",
            "parent_id": "t1_fuv4xro",
            "score": 16,
            "created_utc": 1592190407.0,
            "replies": [
                {
                    "body": "OMG, the fact that there's a word for that is just outstanding.",
                    "author": "_Fortuna_",
                    "id": "fuv5vrf",
                    "parent_id": "t1_fuv54yh",
                    "score": 12,
                    "created_utc": 1592190903.0,
                    "replies": []
                },
                {
                    "body": "💀💀💀",
                    "author": "LikeHoney99",
                    "id": "fuwyfbb",
                    "parent_id": "t1_fuv54yh",
                    "score": 1,
                    "created_utc": 1592238275.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Shave off all the hair around his bald spot, just leave the fluff :)",
            "author": "SlothsvPangolins",
            "id": "fuwrfbh",
            "parent_id": "t1_fuv4xro",
            "score": 3,
            "created_utc": 1592234947.0,
            "replies": [
                {
                    "body": "Absolutely savage.  I love it.",
                    "author": "_Fortuna_",
                    "id": "fuy7zsy",
                    "parent_id": "t1_fuwrfbh",
                    "score": 1,
                    "created_utc": 1592260025.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yes you pretty much nailed it. There's really no trouble he could cause for me that wouldn't make things worse for him.",
            "author": "_Fortuna_",
            "id": "fuy8kg2",
            "parent_id": "t1_fuwyksg",
            "score": 3,
            "created_utc": 1592260295.0,
            "replies": []
        },
        {
            "body": "Could be.  Then she wouldnt have to worry if he tried to poison the well with their mutual friends.  \n\nIm just saying that if he is that vindictive to leave her with the bill, I would be concerned with what else he may try to do t ok influence their mutual friends.  It gets sloppy with mutual friend.\n\nI'm certainly not trying to take his side.  We only know her side of the story.",
            "author": "willfromvb",
            "id": "fux0n23",
            "parent_id": "t1_fuwyksg",
            "score": 1,
            "created_utc": 1592239348.0,
            "replies": [
                {
                    "body": "You sound awfully apologetic for not being on his side....",
                    "author": "LikeHoney99",
                    "id": "fux1paq",
                    "parent_id": "t1_fux0n23",
                    "score": -1,
                    "created_utc": 1592239865.0,
                    "replies": [
                        {
                            "body": "That's a strange reaction.",
                            "author": "willfromvb",
                            "id": "fuxkx2b",
                            "parent_id": "t1_fux1paq",
                            "score": 2,
                            "created_utc": 1592248835.0,
                            "replies": [
                                {
                                    "body": "Oh, how so?",
                                    "author": "LikeHoney99",
                                    "id": "fuxkzlx",
                                    "parent_id": "t1_fuxkx2b",
                                    "score": 0,
                                    "created_utc": 1592248869.0,
                                    "replies": [
                                        {
                                            "body": "I'm amazed how quickly people are rendering judgement and  recommending punishment knowing only her side of the story.  \n\nI regularly meditate workplace disputes.  You rarely get the full story when you only hear one side.   I never want  to take sides other than the side of truth. \n\nBy her own admission she has being seeing this man for \"some time\" .  If he really is \"all bad\" and she is \"all good\", she has some culpability for continuing the relationship.  I suspect he is neither \"all bad\" nor is she \"all good\" and there is history in their relationship that contributed to his behavior more than what is described.",
                                            "author": "willfromvb",
                                            "id": "fuxngi3",
                                            "parent_id": "t1_fuxkzlx",
                                            "score": 1,
                                            "created_utc": 1592250068.0,
                                            "replies": [
                                                {
                                                    "body": "That's interesting, but doesn't make my comment about you seeming like his apologist strange, or explain why you found it strange.",
                                                    "author": "LikeHoney99",
                                                    "id": "fuxq42i",
                                                    "parent_id": "t1_fuxngi3",
                                                    "score": 1,
                                                    "created_utc": 1592251361.0,
                                                    "replies": [
                                                        {
                                                            "body": "The assumption that there is only her side or his side is what seems strange to me.  There is also the side of truth.",
                                                            "author": "willfromvb",
                                                            "id": "fuxr61r",
                                                            "parent_id": "t1_fuxq42i",
                                                            "score": 1,
                                                            "created_utc": 1592251880.0,
                                                            "replies": [
                                                                {
                                                                    "body": "I don’t think we’re talking about the same thing 🤷‍♀️",
                                                                    "author": "LikeHoney99",
                                                                    "id": "fuxrsjj",
                                                                    "parent_id": "t1_fuxr61r",
                                                                    "score": 2,
                                                                    "created_utc": 1592252191.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Lol that does sound expensive",
            "author": "canavatar12",
            "id": "fuv8zbk",
            "parent_id": "t1_fuv5ors",
            "score": 10,
            "created_utc": 1592192988.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fuw73ul",
            "parent_id": "t1_fuv5ors",
            "score": 9,
            "created_utc": 1592222834.0,
            "replies": [
                {
                    "body": "I wouldn't make you sleep with me if you want the leftovers lol",
                    "author": "_Fortuna_",
                    "id": "fuwmoab",
                    "parent_id": "t1_fuw73ul",
                    "score": 4,
                    "created_utc": 1592232588.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Omg. I love this list.",
            "author": null,
            "id": "fuz4orn",
            "parent_id": "t1_fuv5ors",
            "score": 2,
            "created_utc": 1592278118.0,
            "replies": []
        },
        {
            "body": "Awe! You are fucking hilarious. Seems like he might have a sensitive fragile ego. Would you say he does? Fuccckkkk that gift is making me crack up.\n\nDoes sound like a sweetie regardless. God, what is up with men and drinking problems? I had to leave my last ex of a few years because he was a real sweetheart but a huge asshole when he was drunk and he is drunk all the time. I've been connecting with a new person, not on a sugaring level, but in the short time we have been hanging, he totally changes into an overly sensitive and accusatory asshole when he is drunk. Bleck!",
            "author": "kimchi_Queen",
            "id": "fuxjupl",
            "parent_id": "t1_fuwpnae",
            "score": 4,
            "created_utc": 1592248315.0,
            "replies": []
        },
        {
            "body": "Roger that.  😉",
            "author": "TY2022",
            "id": "fuv7j1z",
            "parent_id": "t1_fuv7gbo",
            "score": 2,
            "created_utc": 1592192013.0,
            "replies": []
        },
        {
            "body": "Clearly his last M+G...\n\nPoor baby!  /s",
            "author": "Actually_a_bot_accnt",
            "id": "fuvjtte",
            "parent_id": "t1_fuvbhpr",
            "score": 16,
            "created_utc": 1592201158.0,
            "replies": [
                {
                    "body": "Yeah that m&g was definitely MY fault. It had nothing to do with his over stuffed suitcase of issues that we don't even want to begin to unpack.",
                    "author": "_Fortuna_",
                    "id": "fuvkb52",
                    "parent_id": "t1_fuvjtte",
                    "score": 7,
                    "created_utc": 1592201558.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Might be your \"SD\" in lurk mode.",
            "author": "Mangotingthroneway",
            "id": "fuvudfl",
            "parent_id": "t1_fuvbhpr",
            "score": 9,
            "created_utc": 1592210755.0,
            "replies": []
        },
        {
            "body": "> Who hurt you\n\nAs I said, you're showing the height of maturity. \n\nYou posted a set of actions which means it's open to analysis and criticism. You got some, you even got some sympathy, and you ignore the sympathy and instead you just see red and try to hurt someone you don't know.\n\nBut I'm past my 20s so trying the \"who hurt you\" meme line doesn't really bother me, just confirms what I've been saying.\n\nYou're more than happy to tear your SD a huge new asshole here out in public and paint yourself as the hero. You receive a mixed bag of sympathy and criticism and you decide you have to treat the person saying that as an enemy, because criticism is not something you can handle apparently.\n\nAlso I thought we were at \"Goodbye\" already.",
            "author": "amigodeface",
            "id": "fuvc2al",
            "parent_id": "t1_fuvbhpr",
            "score": -8,
            "created_utc": 1592195173.0,
            "replies": [
                {
                    "body": "I am also very well past my 20s.",
                    "author": "_Fortuna_",
                    "id": "fuvca3b",
                    "parent_id": "t1_fuvc2al",
                    "score": 8,
                    "created_utc": 1592195328.0,
                    "replies": [
                        {
                            "body": "> I am also very well past my 20s.\n\nThen it's time to leave things like \"who hurt you\" as a response behind for the teenagers and those just out of their teens, isn't it?\n\nYou don't have to lash out. I tried to give you something constructive and I will repeat, I said he acted inappropriately and you deserved an apology but all that did was trigger attack mode because I dared to say it was a mixed bag and not just m'lady you.\n\nThere is a reason why some people will not give the benefit of their thoughts and it's because not acting in politically desirable ways just attracts people lashing out and a bunch of downvotes from people who think that we should just be in head patting mode.\n\nFrom time to time I try it because I think it's constructive to hold up a mirror, if someone wants to grow from the experience.",
                            "author": "amigodeface",
                            "id": "fuvckkv",
                            "parent_id": "t1_fuvca3b",
                            "score": 0,
                            "created_utc": 1592195541.0,
                            "replies": [
                                {
                                    "body": "Don’t waste your time, she just wants to rant about how she was wronged, what a strong woman she is, and rally the SBs here to her cause. Any of the insight you’ve provided is wasted/",
                                    "author": "garret6758",
                                    "id": "fuvdf38",
                                    "parent_id": "t1_fuvckkv",
                                    "score": -12,
                                    "created_utc": 1592196168.0,
                                    "replies": [
                                        {
                                            "body": ">and rally the SBs here to her cause\n\nAre you so innately sexist that your eyes simply gloss over the numerous SD's who posted on her side? How strange.",
                                            "author": "blonde-throwaway",
                                            "id": "fuvvlhx",
                                            "parent_id": "t1_fuvdf38",
                                            "score": 11,
                                            "created_utc": 1592212011.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "A+ thanks",
                                            "author": "amigodeface",
                                            "id": "fvdcs66",
                                            "parent_id": "t1_fuvdf38",
                                            "score": 2,
                                            "created_utc": 1592596473.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Hmmm, are you saying I should have his baby? Yes... yes... the ultimate rinse... child support.",
            "author": "_Fortuna_",
            "id": "fuv7vh2",
            "parent_id": "t1_fuv7qhn",
            "score": 29,
            "created_utc": 1592192244.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "fuv8ipa",
                    "parent_id": "t1_fuv7vh2",
                    "score": 11,
                    "created_utc": 1592192674.0,
                    "replies": [
                        {
                            "body": "Why not both?",
                            "author": "superneutral",
                            "id": "fux0zj9",
                            "parent_id": "t1_fuv8ipa",
                            "score": 2,
                            "created_utc": 1592239515.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Oh my god yessssssss 🤣🤣🤣",
                    "author": "kimchi_Queen",
                    "id": "fuvt1rn",
                    "parent_id": "t1_fuv7vh2",
                    "score": 3,
                    "created_utc": 1592209448.0,
                    "replies": []
                },
                {
                    "body": "hahahahahahahahahhahahhahaha",
                    "author": "TY2022",
                    "id": "fuv7y5h",
                    "parent_id": "t1_fuv7vh2",
                    "score": 5,
                    "created_utc": 1592192293.0,
                    "replies": []
                },
                {
                    "body": "Would his genes help produce a quality baby?",
                    "author": "mrjimmyjsz",
                    "id": "fuy3wg1",
                    "parent_id": "t1_fuv7vh2",
                    "score": 2,
                    "created_utc": 1592258135.0,
                    "replies": [
                        {
                            "body": "I'm afraid mine would be doing most of the heavy lifting 😅",
                            "author": "_Fortuna_",
                            "id": "fuy4s2q",
                            "parent_id": "t1_fuy3wg1",
                            "score": 3,
                            "created_utc": 1592258538.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "OMG, the fact that there's a word for that is just outstanding.",
            "author": "_Fortuna_",
            "id": "fuv5vrf",
            "parent_id": "t1_fuv54yh",
            "score": 12,
            "created_utc": 1592190903.0,
            "replies": []
        },
        {
            "body": "💀💀💀",
            "author": "LikeHoney99",
            "id": "fuwyfbb",
            "parent_id": "t1_fuv54yh",
            "score": 1,
            "created_utc": 1592238275.0,
            "replies": []
        },
        {
            "body": "Absolutely savage.  I love it.",
            "author": "_Fortuna_",
            "id": "fuy7zsy",
            "parent_id": "t1_fuwrfbh",
            "score": 1,
            "created_utc": 1592260025.0,
            "replies": []
        },
        {
            "body": "You sound awfully apologetic for not being on his side....",
            "author": "LikeHoney99",
            "id": "fux1paq",
            "parent_id": "t1_fux0n23",
            "score": -1,
            "created_utc": 1592239865.0,
            "replies": [
                {
                    "body": "That's a strange reaction.",
                    "author": "willfromvb",
                    "id": "fuxkx2b",
                    "parent_id": "t1_fux1paq",
                    "score": 2,
                    "created_utc": 1592248835.0,
                    "replies": [
                        {
                            "body": "Oh, how so?",
                            "author": "LikeHoney99",
                            "id": "fuxkzlx",
                            "parent_id": "t1_fuxkx2b",
                            "score": 0,
                            "created_utc": 1592248869.0,
                            "replies": [
                                {
                                    "body": "I'm amazed how quickly people are rendering judgement and  recommending punishment knowing only her side of the story.  \n\nI regularly meditate workplace disputes.  You rarely get the full story when you only hear one side.   I never want  to take sides other than the side of truth. \n\nBy her own admission she has being seeing this man for \"some time\" .  If he really is \"all bad\" and she is \"all good\", she has some culpability for continuing the relationship.  I suspect he is neither \"all bad\" nor is she \"all good\" and there is history in their relationship that contributed to his behavior more than what is described.",
                                    "author": "willfromvb",
                                    "id": "fuxngi3",
                                    "parent_id": "t1_fuxkzlx",
                                    "score": 1,
                                    "created_utc": 1592250068.0,
                                    "replies": [
                                        {
                                            "body": "That's interesting, but doesn't make my comment about you seeming like his apologist strange, or explain why you found it strange.",
                                            "author": "LikeHoney99",
                                            "id": "fuxq42i",
                                            "parent_id": "t1_fuxngi3",
                                            "score": 1,
                                            "created_utc": 1592251361.0,
                                            "replies": [
                                                {
                                                    "body": "The assumption that there is only her side or his side is what seems strange to me.  There is also the side of truth.",
                                                    "author": "willfromvb",
                                                    "id": "fuxr61r",
                                                    "parent_id": "t1_fuxq42i",
                                                    "score": 1,
                                                    "created_utc": 1592251880.0,
                                                    "replies": [
                                                        {
                                                            "body": "I don’t think we’re talking about the same thing 🤷‍♀️",
                                                            "author": "LikeHoney99",
                                                            "id": "fuxrsjj",
                                                            "parent_id": "t1_fuxr61r",
                                                            "score": 2,
                                                            "created_utc": 1592252191.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I wouldn't make you sleep with me if you want the leftovers lol",
            "author": "_Fortuna_",
            "id": "fuwmoab",
            "parent_id": "t1_fuw73ul",
            "score": 4,
            "created_utc": 1592232588.0,
            "replies": []
        },
        {
            "body": "Yeah that m&g was definitely MY fault. It had nothing to do with his over stuffed suitcase of issues that we don't even want to begin to unpack.",
            "author": "_Fortuna_",
            "id": "fuvkb52",
            "parent_id": "t1_fuvjtte",
            "score": 7,
            "created_utc": 1592201558.0,
            "replies": []
        },
        {
            "body": "I am also very well past my 20s.",
            "author": "_Fortuna_",
            "id": "fuvca3b",
            "parent_id": "t1_fuvc2al",
            "score": 8,
            "created_utc": 1592195328.0,
            "replies": [
                {
                    "body": "> I am also very well past my 20s.\n\nThen it's time to leave things like \"who hurt you\" as a response behind for the teenagers and those just out of their teens, isn't it?\n\nYou don't have to lash out. I tried to give you something constructive and I will repeat, I said he acted inappropriately and you deserved an apology but all that did was trigger attack mode because I dared to say it was a mixed bag and not just m'lady you.\n\nThere is a reason why some people will not give the benefit of their thoughts and it's because not acting in politically desirable ways just attracts people lashing out and a bunch of downvotes from people who think that we should just be in head patting mode.\n\nFrom time to time I try it because I think it's constructive to hold up a mirror, if someone wants to grow from the experience.",
                    "author": "amigodeface",
                    "id": "fuvckkv",
                    "parent_id": "t1_fuvca3b",
                    "score": 0,
                    "created_utc": 1592195541.0,
                    "replies": [
                        {
                            "body": "Don’t waste your time, she just wants to rant about how she was wronged, what a strong woman she is, and rally the SBs here to her cause. Any of the insight you’ve provided is wasted/",
                            "author": "garret6758",
                            "id": "fuvdf38",
                            "parent_id": "t1_fuvckkv",
                            "score": -12,
                            "created_utc": 1592196168.0,
                            "replies": [
                                {
                                    "body": ">and rally the SBs here to her cause\n\nAre you so innately sexist that your eyes simply gloss over the numerous SD's who posted on her side? How strange.",
                                    "author": "blonde-throwaway",
                                    "id": "fuvvlhx",
                                    "parent_id": "t1_fuvdf38",
                                    "score": 11,
                                    "created_utc": 1592212011.0,
                                    "replies": []
                                },
                                {
                                    "body": "A+ thanks",
                                    "author": "amigodeface",
                                    "id": "fvdcs66",
                                    "parent_id": "t1_fuvdf38",
                                    "score": 2,
                                    "created_utc": 1592596473.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fuv8ipa",
            "parent_id": "t1_fuv7vh2",
            "score": 11,
            "created_utc": 1592192674.0,
            "replies": [
                {
                    "body": "Why not both?",
                    "author": "superneutral",
                    "id": "fux0zj9",
                    "parent_id": "t1_fuv8ipa",
                    "score": 2,
                    "created_utc": 1592239515.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Oh my god yessssssss 🤣🤣🤣",
            "author": "kimchi_Queen",
            "id": "fuvt1rn",
            "parent_id": "t1_fuv7vh2",
            "score": 3,
            "created_utc": 1592209448.0,
            "replies": []
        },
        {
            "body": "hahahahahahahahahhahahhahaha",
            "author": "TY2022",
            "id": "fuv7y5h",
            "parent_id": "t1_fuv7vh2",
            "score": 5,
            "created_utc": 1592192293.0,
            "replies": []
        },
        {
            "body": "Would his genes help produce a quality baby?",
            "author": "mrjimmyjsz",
            "id": "fuy3wg1",
            "parent_id": "t1_fuv7vh2",
            "score": 2,
            "created_utc": 1592258135.0,
            "replies": [
                {
                    "body": "I'm afraid mine would be doing most of the heavy lifting 😅",
                    "author": "_Fortuna_",
                    "id": "fuy4s2q",
                    "parent_id": "t1_fuy3wg1",
                    "score": 3,
                    "created_utc": 1592258538.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "That's a strange reaction.",
            "author": "willfromvb",
            "id": "fuxkx2b",
            "parent_id": "t1_fux1paq",
            "score": 2,
            "created_utc": 1592248835.0,
            "replies": [
                {
                    "body": "Oh, how so?",
                    "author": "LikeHoney99",
                    "id": "fuxkzlx",
                    "parent_id": "t1_fuxkx2b",
                    "score": 0,
                    "created_utc": 1592248869.0,
                    "replies": [
                        {
                            "body": "I'm amazed how quickly people are rendering judgement and  recommending punishment knowing only her side of the story.  \n\nI regularly meditate workplace disputes.  You rarely get the full story when you only hear one side.   I never want  to take sides other than the side of truth. \n\nBy her own admission she has being seeing this man for \"some time\" .  If he really is \"all bad\" and she is \"all good\", she has some culpability for continuing the relationship.  I suspect he is neither \"all bad\" nor is she \"all good\" and there is history in their relationship that contributed to his behavior more than what is described.",
                            "author": "willfromvb",
                            "id": "fuxngi3",
                            "parent_id": "t1_fuxkzlx",
                            "score": 1,
                            "created_utc": 1592250068.0,
                            "replies": [
                                {
                                    "body": "That's interesting, but doesn't make my comment about you seeming like his apologist strange, or explain why you found it strange.",
                                    "author": "LikeHoney99",
                                    "id": "fuxq42i",
                                    "parent_id": "t1_fuxngi3",
                                    "score": 1,
                                    "created_utc": 1592251361.0,
                                    "replies": [
                                        {
                                            "body": "The assumption that there is only her side or his side is what seems strange to me.  There is also the side of truth.",
                                            "author": "willfromvb",
                                            "id": "fuxr61r",
                                            "parent_id": "t1_fuxq42i",
                                            "score": 1,
                                            "created_utc": 1592251880.0,
                                            "replies": [
                                                {
                                                    "body": "I don’t think we’re talking about the same thing 🤷‍♀️",
                                                    "author": "LikeHoney99",
                                                    "id": "fuxrsjj",
                                                    "parent_id": "t1_fuxr61r",
                                                    "score": 2,
                                                    "created_utc": 1592252191.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "> I am also very well past my 20s.\n\nThen it's time to leave things like \"who hurt you\" as a response behind for the teenagers and those just out of their teens, isn't it?\n\nYou don't have to lash out. I tried to give you something constructive and I will repeat, I said he acted inappropriately and you deserved an apology but all that did was trigger attack mode because I dared to say it was a mixed bag and not just m'lady you.\n\nThere is a reason why some people will not give the benefit of their thoughts and it's because not acting in politically desirable ways just attracts people lashing out and a bunch of downvotes from people who think that we should just be in head patting mode.\n\nFrom time to time I try it because I think it's constructive to hold up a mirror, if someone wants to grow from the experience.",
            "author": "amigodeface",
            "id": "fuvckkv",
            "parent_id": "t1_fuvca3b",
            "score": 0,
            "created_utc": 1592195541.0,
            "replies": [
                {
                    "body": "Don’t waste your time, she just wants to rant about how she was wronged, what a strong woman she is, and rally the SBs here to her cause. Any of the insight you’ve provided is wasted/",
                    "author": "garret6758",
                    "id": "fuvdf38",
                    "parent_id": "t1_fuvckkv",
                    "score": -12,
                    "created_utc": 1592196168.0,
                    "replies": [
                        {
                            "body": ">and rally the SBs here to her cause\n\nAre you so innately sexist that your eyes simply gloss over the numerous SD's who posted on her side? How strange.",
                            "author": "blonde-throwaway",
                            "id": "fuvvlhx",
                            "parent_id": "t1_fuvdf38",
                            "score": 11,
                            "created_utc": 1592212011.0,
                            "replies": []
                        },
                        {
                            "body": "A+ thanks",
                            "author": "amigodeface",
                            "id": "fvdcs66",
                            "parent_id": "t1_fuvdf38",
                            "score": 2,
                            "created_utc": 1592596473.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Why not both?",
            "author": "superneutral",
            "id": "fux0zj9",
            "parent_id": "t1_fuv8ipa",
            "score": 2,
            "created_utc": 1592239515.0,
            "replies": []
        },
        {
            "body": "I'm afraid mine would be doing most of the heavy lifting 😅",
            "author": "_Fortuna_",
            "id": "fuy4s2q",
            "parent_id": "t1_fuy3wg1",
            "score": 3,
            "created_utc": 1592258538.0,
            "replies": []
        },
        {
            "body": "Oh, how so?",
            "author": "LikeHoney99",
            "id": "fuxkzlx",
            "parent_id": "t1_fuxkx2b",
            "score": 0,
            "created_utc": 1592248869.0,
            "replies": [
                {
                    "body": "I'm amazed how quickly people are rendering judgement and  recommending punishment knowing only her side of the story.  \n\nI regularly meditate workplace disputes.  You rarely get the full story when you only hear one side.   I never want  to take sides other than the side of truth. \n\nBy her own admission she has being seeing this man for \"some time\" .  If he really is \"all bad\" and she is \"all good\", she has some culpability for continuing the relationship.  I suspect he is neither \"all bad\" nor is she \"all good\" and there is history in their relationship that contributed to his behavior more than what is described.",
                    "author": "willfromvb",
                    "id": "fuxngi3",
                    "parent_id": "t1_fuxkzlx",
                    "score": 1,
                    "created_utc": 1592250068.0,
                    "replies": [
                        {
                            "body": "That's interesting, but doesn't make my comment about you seeming like his apologist strange, or explain why you found it strange.",
                            "author": "LikeHoney99",
                            "id": "fuxq42i",
                            "parent_id": "t1_fuxngi3",
                            "score": 1,
                            "created_utc": 1592251361.0,
                            "replies": [
                                {
                                    "body": "The assumption that there is only her side or his side is what seems strange to me.  There is also the side of truth.",
                                    "author": "willfromvb",
                                    "id": "fuxr61r",
                                    "parent_id": "t1_fuxq42i",
                                    "score": 1,
                                    "created_utc": 1592251880.0,
                                    "replies": [
                                        {
                                            "body": "I don’t think we’re talking about the same thing 🤷‍♀️",
                                            "author": "LikeHoney99",
                                            "id": "fuxrsjj",
                                            "parent_id": "t1_fuxr61r",
                                            "score": 2,
                                            "created_utc": 1592252191.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Don’t waste your time, she just wants to rant about how she was wronged, what a strong woman she is, and rally the SBs here to her cause. Any of the insight you’ve provided is wasted/",
            "author": "garret6758",
            "id": "fuvdf38",
            "parent_id": "t1_fuvckkv",
            "score": -12,
            "created_utc": 1592196168.0,
            "replies": [
                {
                    "body": ">and rally the SBs here to her cause\n\nAre you so innately sexist that your eyes simply gloss over the numerous SD's who posted on her side? How strange.",
                    "author": "blonde-throwaway",
                    "id": "fuvvlhx",
                    "parent_id": "t1_fuvdf38",
                    "score": 11,
                    "created_utc": 1592212011.0,
                    "replies": []
                },
                {
                    "body": "A+ thanks",
                    "author": "amigodeface",
                    "id": "fvdcs66",
                    "parent_id": "t1_fuvdf38",
                    "score": 2,
                    "created_utc": 1592596473.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I'm amazed how quickly people are rendering judgement and  recommending punishment knowing only her side of the story.  \n\nI regularly meditate workplace disputes.  You rarely get the full story when you only hear one side.   I never want  to take sides other than the side of truth. \n\nBy her own admission she has being seeing this man for \"some time\" .  If he really is \"all bad\" and she is \"all good\", she has some culpability for continuing the relationship.  I suspect he is neither \"all bad\" nor is she \"all good\" and there is history in their relationship that contributed to his behavior more than what is described.",
            "author": "willfromvb",
            "id": "fuxngi3",
            "parent_id": "t1_fuxkzlx",
            "score": 1,
            "created_utc": 1592250068.0,
            "replies": [
                {
                    "body": "That's interesting, but doesn't make my comment about you seeming like his apologist strange, or explain why you found it strange.",
                    "author": "LikeHoney99",
                    "id": "fuxq42i",
                    "parent_id": "t1_fuxngi3",
                    "score": 1,
                    "created_utc": 1592251361.0,
                    "replies": [
                        {
                            "body": "The assumption that there is only her side or his side is what seems strange to me.  There is also the side of truth.",
                            "author": "willfromvb",
                            "id": "fuxr61r",
                            "parent_id": "t1_fuxq42i",
                            "score": 1,
                            "created_utc": 1592251880.0,
                            "replies": [
                                {
                                    "body": "I don’t think we’re talking about the same thing 🤷‍♀️",
                                    "author": "LikeHoney99",
                                    "id": "fuxrsjj",
                                    "parent_id": "t1_fuxr61r",
                                    "score": 2,
                                    "created_utc": 1592252191.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": ">and rally the SBs here to her cause\n\nAre you so innately sexist that your eyes simply gloss over the numerous SD's who posted on her side? How strange.",
            "author": "blonde-throwaway",
            "id": "fuvvlhx",
            "parent_id": "t1_fuvdf38",
            "score": 11,
            "created_utc": 1592212011.0,
            "replies": []
        },
        {
            "body": "A+ thanks",
            "author": "amigodeface",
            "id": "fvdcs66",
            "parent_id": "t1_fuvdf38",
            "score": 2,
            "created_utc": 1592596473.0,
            "replies": []
        },
        {
            "body": "That's interesting, but doesn't make my comment about you seeming like his apologist strange, or explain why you found it strange.",
            "author": "LikeHoney99",
            "id": "fuxq42i",
            "parent_id": "t1_fuxngi3",
            "score": 1,
            "created_utc": 1592251361.0,
            "replies": [
                {
                    "body": "The assumption that there is only her side or his side is what seems strange to me.  There is also the side of truth.",
                    "author": "willfromvb",
                    "id": "fuxr61r",
                    "parent_id": "t1_fuxq42i",
                    "score": 1,
                    "created_utc": 1592251880.0,
                    "replies": [
                        {
                            "body": "I don’t think we’re talking about the same thing 🤷‍♀️",
                            "author": "LikeHoney99",
                            "id": "fuxrsjj",
                            "parent_id": "t1_fuxr61r",
                            "score": 2,
                            "created_utc": 1592252191.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "The assumption that there is only her side or his side is what seems strange to me.  There is also the side of truth.",
            "author": "willfromvb",
            "id": "fuxr61r",
            "parent_id": "t1_fuxq42i",
            "score": 1,
            "created_utc": 1592251880.0,
            "replies": [
                {
                    "body": "I don’t think we’re talking about the same thing 🤷‍♀️",
                    "author": "LikeHoney99",
                    "id": "fuxrsjj",
                    "parent_id": "t1_fuxr61r",
                    "score": 2,
                    "created_utc": 1592252191.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I don’t think we’re talking about the same thing 🤷‍♀️",
            "author": "LikeHoney99",
            "id": "fuxrsjj",
            "parent_id": "t1_fuxr61r",
            "score": 2,
            "created_utc": 1592252191.0,
            "replies": []
        }
    ]
}