{
    "title": "It do be like that",
    "post_id": "itt2bv",
    "post_url": "https://www.reddit.com/r/dankruto/comments/itt2bv/it_do_be_like_that/",
    "author": "Abin5ur",
    "body": "",
    "url": "https://i.redd.it/l1284pyaohn51.jpg",
    "score": 5356,
    "upvote_ratio": 0.98,
    "created_utc": 1600253019.0,
    "num_comments": 111,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "that scene got almost as much screen time as tenten",
            "author": "TightCold",
            "id": "g5h10db",
            "parent_id": "t3_itt2bv",
            "score": 520,
            "created_utc": 1600265812.0,
            "replies": [
                {
                    "body": "You are just spitting facts.",
                    "author": "prayul",
                    "id": "g5h82h0",
                    "parent_id": "t1_g5h10db",
                    "score": 95,
                    "created_utc": 1600269474.0,
                    "replies": [
                        {
                            "body": "S bruh lol.",
                            "author": "return3",
                            "id": "g5hal58",
                            "parent_id": "t1_g5h82h0",
                            "score": 31,
                            "created_utc": 1600270720.0,
                            "replies": [
                                {
                                    "body": "Lol my bad",
                                    "author": "prayul",
                                    "id": "g5i84lf",
                                    "parent_id": "t1_g5hal58",
                                    "score": 8,
                                    "created_utc": 1600286835.0,
                                    "replies": [
                                        {
                                            "body": "Nah ur good I just had anxiety for a sec lol.",
                                            "author": "return3",
                                            "id": "g5iil81",
                                            "parent_id": "t1_g5i84lf",
                                            "score": 4,
                                            "created_utc": 1600291042.0,
                                            "replies": [
                                                {
                                                    "body": "I'd like to say that tenten is the best character in the show.\nJust spitting out opinions no one cares about.",
                                                    "author": "AshenPlight",
                                                    "id": "g5jdpre",
                                                    "parent_id": "t1_g5iil81",
                                                    "score": 3,
                                                    "created_utc": 1600306916.0,
                                                    "replies": [
                                                        {
                                                            "body": "ok lol.",
                                                            "author": "return3",
                                                            "id": "g5jfoaw",
                                                            "parent_id": "t1_g5jdpre",
                                                            "score": 2,
                                                            "created_utc": 1600307816.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "I wish someone would do the math.",
                    "author": "dakotachip",
                    "id": "g5hpu8a",
                    "parent_id": "t1_g5h10db",
                    "score": 23,
                    "created_utc": 1600278081.0,
                    "replies": []
                },
                {
                    "body": "This is why you watch Naruto Kai it cuts all the bloody flashbacks and repeat scenes",
                    "author": "SmoothOctopus",
                    "id": "g5iw1n0",
                    "parent_id": "t1_g5h10db",
                    "score": 6,
                    "created_utc": 1600297229.0,
                    "replies": [
                        {
                            "body": "I've been meaning to check it out. I've watched the whole series and even recommended it to a lot of friends but most people aren't willing to watch it when they hear it's 700+ ep. Even if you cut out the filler, it's still over 400 atleast.\n\nBut I'm just wondering if Naruto Kai still manages to fit in all the important moments. It's only 92 ep right? Does it have all the fights? All the touching interactions? What about the flashbacks that are necessary for the plot - like Kakashi and Obito's stories, Minato and Kushina backstory etc?\n\nI want to know if Naruto Kai is worth recommending.",
                            "author": "Minato_the_legend",
                            "id": "g5jut1n",
                            "parent_id": "t1_g5iw1n0",
                            "score": 3,
                            "created_utc": 1600315286.0,
                            "replies": [
                                {
                                    "body": "Yeah it does I didn't notice anything missing except filler episodes it doesn't cut all the flashbacks just pretty much only plays them the first time not 3 times per episode",
                                    "author": "SmoothOctopus",
                                    "id": "g5jxjv2",
                                    "parent_id": "t1_g5jut1n",
                                    "score": 2,
                                    "created_utc": 1600316734.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "just no",
                            "author": "Dream_Scaper",
                            "id": "g63r1va",
                            "parent_id": "t1_g5iw1n0",
                            "score": 1,
                            "created_utc": 1600697550.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "oof that was cold",
                    "author": "heyyassbutt",
                    "id": "g5igm1r",
                    "parent_id": "t1_g5h10db",
                    "score": 2,
                    "created_utc": 1600290262.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I get to the pain arc I’m shippuden and that’s about as far as I can get on a rewatch and I skip a decent amount of episodes. Original Naruto? Going back to like my 5th rewatch and still get mega chills watching him snag his headband from zabuza and from the intro/credits (among plenty other scenes)",
            "author": null,
            "id": "g5h1je7",
            "parent_id": "t3_itt2bv",
            "score": 156,
            "created_utc": 1600266099.0,
            "replies": [
                {
                    "body": "Shippuden anime is way way fucking over stretched. But hot damn, I don't know how many times I've reread the manga. Shippuden is so fucking good without those fillers. I loved how they gave life to Akatsuki and how they developed Naruto's character. I still cri when I see Naruto meet his mom like holy shit.",
                    "author": null,
                    "id": "g5hc2a8",
                    "parent_id": "t1_g5h1je7",
                    "score": 115,
                    "created_utc": 1600271443.0,
                    "replies": [
                        {
                            "body": "I never read the manga unfortunately and only have the anime to go off of. Glad to discuss the show with some fans regardless of preference",
                            "author": null,
                            "id": "g5hcece",
                            "parent_id": "t1_g5hc2a8",
                            "score": 35,
                            "created_utc": 1600271604.0,
                            "replies": [
                                {
                                    "body": "Just skip filler",
                                    "author": "Sasuke-Sarutobi",
                                    "id": "g5ibwvk",
                                    "parent_id": "t1_g5hcece",
                                    "score": 12,
                                    "created_utc": 1600288352.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Shippuden is actually paced fairly well without the filler. \n\nI’d say the first arc with sasori and deidara drags a little (how many episodes were they trailing deidara down that ravine? Lmao), but other than that it’s not too stretched out w/o the filler imo",
                            "author": null,
                            "id": "g5i8fe8",
                            "parent_id": "t1_g5hc2a8",
                            "score": 25,
                            "created_utc": 1600286953.0,
                            "replies": []
                        },
                        {
                            "body": "I’ve never watched the filler always skipped",
                            "author": "astrapes",
                            "id": "g5hywbh",
                            "parent_id": "t1_g5hc2a8",
                            "score": 3,
                            "created_utc": 1600282482.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "If you think OG Naruto is better than Shippuden(minus the War arc), you're probably clouded by nostalgia.",
                    "author": "Lxilind",
                    "id": "g5ha01v",
                    "parent_id": "t1_g5h1je7",
                    "score": 39,
                    "created_utc": 1600270431.0,
                    "replies": [
                        {
                            "body": "True i would rank the complete series as Naruto shippuden (until pain arc)> naruto og > naruto Shippuden (war arc).\n\nI have watched the series twice once when I was 15 then during quarantine 3 months ago.\n\nThen again people can have preferences but naruto part 2 was so much better for me especially the rinneangan reveal itachi backstory man I used to have goosebumps every naruto episode back then",
                            "author": "upvote-me-ya-bish",
                            "id": "g5hbspa",
                            "parent_id": "t1_g5ha01v",
                            "score": 27,
                            "created_utc": 1600271312.0,
                            "replies": [
                                {
                                    "body": "Everything after pain arc, was just a giant cluster fuck of power levels going through the fucking roof.  Might as well have just been dragon ball z at that point.",
                                    "author": "cheese4352",
                                    "id": "g5idy7g",
                                    "parent_id": "t1_g5hbspa",
                                    "score": 5,
                                    "created_utc": 1600289192.0,
                                    "replies": [
                                        {
                                            "body": "Nah i still love the war arc it had its moments and not for a second i felt bored(ofc i skipped through fillers and flashbacks). As a collective it didn't make much sense but ill be damned if gai 8gates, madara hashirama backstory, nagato/itachi meet with naruto, gaara and his dad reunion or practically any scene witth madara in it weren't some of the finest moments in anime i have ever seen.\n\nAs for it being dbz i dont get it sure at some times it was my jutsu beam vs your tailed beast bomb but it was always tactical like itachi figuring out core of planetary devastation or obito going through different dimensions to find sassuke.",
                                            "author": "upvote-me-ya-bish",
                                            "id": "g5k7m5t",
                                            "parent_id": "t1_g5idy7g",
                                            "score": 2,
                                            "created_utc": 1600324202.0,
                                            "replies": [
                                                {
                                                    "body": "Dragonball z in multiple regards.  Yes the giant beams and shit, but the very shift of the story itself and the tone shift.\n\n\nAliens and giant open field battles.  Everything just jumped thr shark.  8 gate gai was really awesome, but it jumped the shark as well.  It got too ridiculous.",
                                                    "author": "cheese4352",
                                                    "id": "g5kq8hg",
                                                    "parent_id": "t1_g5k7m5t",
                                                    "score": 1,
                                                    "created_utc": 1600343200.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "I started watching when I was 23, longer reply incoming",
                            "author": null,
                            "id": "g5ha6qh",
                            "parent_id": "t1_g5ha01v",
                            "score": 12,
                            "created_utc": 1600270523.0,
                            "replies": []
                        },
                        {
                            "body": "I just rewatched OG, I still prefer it mainly because of the more grounded battles",
                            "author": "McThije",
                            "id": "g5i6vhi",
                            "parent_id": "t1_g5ha01v",
                            "score": 2,
                            "created_utc": 1600286336.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "The mist arc is the best arc, nobody can convince me otherwise. The manga just had this entirely different feel to it that was way more adult themed/complex than the follow up good vs evil plotline kishi followed afterwards.",
                    "author": "wenchslapper",
                    "id": "g5j5vg8",
                    "parent_id": "t1_g5h1je7",
                    "score": 6,
                    "created_utc": 1600302728.0,
                    "replies": [
                        {
                            "body": "1,000% agree",
                            "author": null,
                            "id": "g5j6ooe",
                            "parent_id": "t1_g5j5vg8",
                            "score": 1,
                            "created_utc": 1600303181.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "I respect your opinion and taste but I just can not personally understand the hype around og Naruto. I think so much of it was cringey and literally half the show was boring filler... Shippuden was only marginally better",
                    "author": "clouds_over_asia",
                    "id": "g5h8wvk",
                    "parent_id": "t1_g5h1je7",
                    "score": 10,
                    "created_utc": 1600269893.0,
                    "replies": [
                        {
                            "body": "Agreed, part 1 is a fantastic story and is great, but God it moves so damn slow and is just all around boring sometimes. Shippuden, even for all its power creep and inconsistencies, is just 10x more interesting to me.",
                            "author": "VanillaDylan",
                            "id": "g5hamw1",
                            "parent_id": "t1_g5h8wvk",
                            "score": 17,
                            "created_utc": 1600270742.0,
                            "replies": []
                        },
                        {
                            "body": "Lengthy fanboy reply incoming, side note my first time watching was at age 23 and I hadn’t watched a ton of anime before. \n\nI was hooked at the end of episode 1 when naruto heard iruka accept him and he summoned a forest of shadow clones to save him. Iruka had a big ass shuriken sticking out of his back and it gave the show a dark edge/art style that really resonated with me. It really felt like someone could get offed at any time. \n\nThis goes directly into naruto/sasuke rivalry and meeting kakashi, which you didn’t know what to think after letting the eraser prank get him. The bell test expanded the knowledge of the jutsu rules and kakashi’s skills as well as the skill gap naruto needs to overcome. \n\nThis goes directly into the land of waves arc, which set in stone how much I will always love the show. You get a feel for sasuke’s skills and get a morsel of information about narutos chakra capabilities. Zabuza’s appearance put real fear into the characters and I had no idea how they’d persevere. Kakashi’s reveal of the sharingan was awesome and sasuke’s obvious surprise at how he could even have one added a lot of mystery. Top 3 moment for me is naruto retrieving his headband leading to the teamwork with sasuke and the awesome shot of him peering through the demon wind shuriken. \n\nI could go on and on but to me, og naruto is dark, humorous at times, does a great job of world building and shows very interesting teamwork/strategy (shikamaru any scene, sasuke retrieval arc especially). The side characters were very interesting and relevant. Shippuden has the akatsuki which was extremely interesting but seems to drag its feet at times and I feel that it’s missing that element of teamwork and camaraderie that I loved from the original as well as the darker art style. It’s all preference and I’m biased. Naruto surprising people with overcoming all obstacles in the original was very satisfying to me as well. \n\nA bit of a ramble and not even half of what I could write but there’s some of the reasoning and thought process of why I love the original over shippuden and think it’s more rewatchable",
                            "author": null,
                            "id": "g5hbv7p",
                            "parent_id": "t1_g5h8wvk",
                            "score": 11,
                            "created_utc": 1600271346.0,
                            "replies": [
                                {
                                    "body": "Fair enough man I also didn't start watching any anime until like 5 years ago, started with Attack on Titan, a few others and eventually onto Naruto... Was my favorite show as a whole for quite a long time, until I started watching One Piece lol. I get what you're saying about the dark themes and whatnot, but I personally feel that it's a little contrived at times, like it takes itself too seriously... After all it's not truly grim and gruesome like some series, like AoT. Which is totally fine, it just kinda pulls me out from the immersion. You got a good point about the cameraderie thing, not as much of it in shippuden - it's the Naruto Sasuke show. Which I think is honestly where most of my enjoyment of the series comes from anyway, so that's probably where our different opinions reside",
                                    "author": "clouds_over_asia",
                                    "id": "g5hd4k0",
                                    "parent_id": "t1_g5hbv7p",
                                    "score": 3,
                                    "created_utc": 1600271957.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "og naruto was way better",
                            "author": "ausername434",
                            "id": "g5h9svg",
                            "parent_id": "t1_g5h8wvk",
                            "score": 9,
                            "created_utc": 1600270332.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Ffs, you can skip filler",
                    "author": "Sasuke-Sarutobi",
                    "id": "g5ibw08",
                    "parent_id": "t1_g5h1je7",
                    "score": 2,
                    "created_utc": 1600288343.0,
                    "replies": []
                },
                {
                    "body": "Give Naruto Kai a try on your next rewatch, It's like a filler less release of Naruto and Naruto shippuden.",
                    "author": "lightninginstinct",
                    "id": "g5iqn92",
                    "parent_id": "t1_g5h1je7",
                    "score": 2,
                    "created_utc": 1600294469.0,
                    "replies": [
                        {
                            "body": "But in just 92 ep? Isn't that way too cramped?",
                            "author": "Minato_the_legend",
                            "id": "g5jvbgo",
                            "parent_id": "t1_g5iqn92",
                            "score": 1,
                            "created_utc": 1600315552.0,
                            "replies": [
                                {
                                    "body": "Each episode duration is about 1-2 hours, some even reaching 3 hours. Can easily account for 500+ episodes of both Naruto and Naruto shippuden.",
                                    "author": "lightninginstinct",
                                    "id": "g5lqdai",
                                    "parent_id": "t1_g5jvbgo",
                                    "score": 2,
                                    "created_utc": 1600361479.0,
                                    "replies": [
                                        {
                                            "body": "Ahh that makes so much more sense. That's perfect. I'll check it out myself and recommend to friends too",
                                            "author": "Minato_the_legend",
                                            "id": "g5lzi8x",
                                            "parent_id": "t1_g5lqdai",
                                            "score": 2,
                                            "created_utc": 1600365260.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "characters in Naruto : Buff Doge\n\ncharacters in Boruto:",
            "author": "nasgorhead",
            "id": "g5gp5a4",
            "parent_id": "t3_itt2bv",
            "score": 99,
            "created_utc": 1600258328.0,
            "replies": []
        },
        {
            "body": "There's a difference. \n\n\nNaruto was eventually loved. \n\nBoruto will never be loved because they say Naruto will die.",
            "author": "heyitsmeniraj",
            "id": "g5h1kmo",
            "parent_id": "t3_itt2bv",
            "score": 54,
            "created_utc": 1600266118.0,
            "replies": [
                {
                    "body": "There also the problem that Boruto is just talented at everything he does. Naruto had to put in hard work to get to where he is. Boruto can do what he wants cause he's a natural prodigy.",
                    "author": "infamusforever223",
                    "id": "g5h3cvi",
                    "parent_id": "t1_g5h1kmo",
                    "score": 37,
                    "created_utc": 1600267065.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "g5hii0a",
                            "parent_id": "t1_g5h3cvi",
                            "score": 24,
                            "created_utc": 1600274570.0,
                            "replies": [
                                {
                                    "body": "But as it sits right now, I as the reader(or watcher in terms of the anime) can't relate to him in anyway, shape or form. Nothing about his character translates well.",
                                    "author": "infamusforever223",
                                    "id": "g5hiso2",
                                    "parent_id": "t1_g5hii0a",
                                    "score": 15,
                                    "created_utc": 1600274712.0,
                                    "replies": [
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "g5hjrh6",
                                            "parent_id": "t1_g5hiso2",
                                            "score": 18,
                                            "created_utc": 1600275171.0,
                                            "replies": [
                                                {
                                                    "body": "In Luffy's case, while he is very advantaged, he is extremely likable. The same goes for Ichigo, though he gets knocked on his ass a lot. Boruto is a character that is not only extremely talented, but also bratty, and it's a turn off.",
                                                    "author": "infamusforever223",
                                                    "id": "g5hkmt9",
                                                    "parent_id": "t1_g5hjrh6",
                                                    "score": 7,
                                                    "created_utc": 1600275590.0,
                                                    "replies": [
                                                        {
                                                            "body": "Maybe that's the point? Maybe you aren't supposed to empathize with Boruto. Maybe him being so opposite to his mother and father is part of the struggle he'll face in the future? Maybe he learns to be more like them, in their absence?",
                                                            "author": "AlextheLyonnn",
                                                            "id": "g5hpo7p",
                                                            "parent_id": "t1_g5hkmt9",
                                                            "score": 17,
                                                            "created_utc": 1600278003.0,
                                                            "replies": [
                                                                {
                                                                    "body": "It could be. I'm only explaining why I don't like Boruto and jumped off a long time ago. I don't think less of those that like it, but I gave up on it.",
                                                                    "author": "infamusforever223",
                                                                    "id": "g5hvx7t",
                                                                    "parent_id": "t1_g5hpo7p",
                                                                    "score": 3,
                                                                    "created_utc": 1600281023.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "I hate that little shit, too. Don't worry. But we're getting to see what Naruto would have been like if Minato and Kushina lived, I guess. Can't stand the show though.",
                                                                            "author": "AlextheLyonnn",
                                                                            "id": "g5hy9cy",
                                                                            "parent_id": "t1_g5hvx7t",
                                                                            "score": 3,
                                                                            "created_utc": 1600282172.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "body": "Thats what I was thinking too. Both Boruto as the series and the character have insane potential to be amazing with all the things estabilished. Its just really, really, really badly executed, stupid, targeted at children and overall just a bad joke at best.",
                                                                    "author": "Remedh",
                                                                    "id": "g5ixbem",
                                                                    "parent_id": "t1_g5hpo7p",
                                                                    "score": 3,
                                                                    "created_utc": 1600297941.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "body": "Luffy grew up with bandits without even knowing he had parents and started discovering the world at 17 i think. thats the opposite of Boruto\n\nand Light from Death Note isnt relatable man",
                                                    "author": "LilQuasar",
                                                    "id": "g5iv2ae",
                                                    "parent_id": "t1_g5hjrh6",
                                                    "score": 3,
                                                    "created_utc": 1600296685.0,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "body": "Yes you’re not supposed to relate to him, the point is for him to mature through loss",
                                            "author": "Yourboyfibs",
                                            "id": "g5ir8m8",
                                            "parent_id": "t1_g5hiso2",
                                            "score": 4,
                                            "created_utc": 1600294724.0,
                                            "replies": [
                                                {
                                                    "body": "That's great and all, but I feel something was lost in translation, because he's so uncompelling that I don't want to continue with the story and I don't care what happens to him. I only have a passersby interest in seeing what happens to the original cast, and that means, in my eyes, you have failed at storytelling, as you haven't engaged me, the reader.",
                                                    "author": "infamusforever223",
                                                    "id": "g5it2wc",
                                                    "parent_id": "t1_g5ir8m8",
                                                    "score": 1,
                                                    "created_utc": 1600295593.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Agreed dude, the hustle Naruto went through which shaped his personality is what we fans love about the show. Whereas in Boruto it's like everyone's smart and can do whatever they wish to do.",
                            "author": "heyitsmeniraj",
                            "id": "g5h3pba",
                            "parent_id": "t1_g5h3cvi",
                            "score": 17,
                            "created_utc": 1600267243.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "All boruto needed is to have one epic fight scene like zabuza or like chunin ark..but it crossed over 160+ episodes  unfortunately few memorable events/ scenes in boruto was dominated by naruto characters and some ark like where sarada meets Sasuke for first time doesn't even have boruto in it...",
            "author": "praveeja",
            "id": "g5hrj52",
            "parent_id": "t3_itt2bv",
            "score": 11,
            "created_utc": 1600278881.0,
            "replies": [
                {
                    "body": "How the hell did they pump out that many episodes when there is like 50 issues of the manga?  I thought Natuto was bad for filler",
                    "author": null,
                    "id": "g5inh8u",
                    "parent_id": "t1_g5hrj52",
                    "score": 7,
                    "created_utc": 1600293123.0,
                    "replies": [
                        {
                            "body": "oh the anime didnt even touch chaper 10 yet lol",
                            "author": "Konoha__Shinobi",
                            "id": "g5jqtjc",
                            "parent_id": "t1_g5inh8u",
                            "score": 6,
                            "created_utc": 1600313287.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "g5gv99w",
            "parent_id": "t3_itt2bv",
            "score": 44,
            "created_utc": 1600262471.0,
            "replies": [
                {
                    "body": "It's not amazing but it's pretty good for what it is. People need to lower their expectations, I was never expecting Itachi subplot level writing at all from Boruto and I came out pleasantly surprised by what I've seen",
                    "author": "EnflamedHuevos",
                    "id": "g5gx9zw",
                    "parent_id": "t1_g5gv99w",
                    "score": 51,
                    "created_utc": 1600263695.0,
                    "replies": [
                        {
                            "body": "The same people who give Boruto unwarranted hate are the same people who complained that side characters didn't get any screen time, now that they are, they still complain. It's like they wanted the Chuunin Exams to happen in the first episode otherwise it's bad.\n\nI loved the slice of life at the beginning of the series, and I agree, it's not amazing but I love it. It's dark points are coming, (I'm not caught up in the manga but I think it's happening already).\n\nThey want it to be the exact same as Naruto, while at the same time complaining that it's the same.",
                            "author": "Chalaka",
                            "id": "g5h66gx",
                            "parent_id": "t1_g5gx9zw",
                            "score": 9,
                            "created_utc": 1600268512.0,
                            "replies": []
                        },
                        {
                            "body": "Yeah, I mean could you really call Naruto a well crafted anime? I wouldn't, but I enjoy the hell out of it!",
                            "author": "ElderlyPeanut",
                            "id": "g5gz3xb",
                            "parent_id": "t1_g5gx9zw",
                            "score": 22,
                            "created_utc": 1600264745.0,
                            "replies": [
                                {
                                    "body": "Naruto, yes you could call it well crafted. Shippuden? Nah not at all.",
                                    "author": "whatyouegg123",
                                    "id": "g5gzxfp",
                                    "parent_id": "t1_g5gz3xb",
                                    "score": 31,
                                    "created_utc": 1600265212.0,
                                    "replies": [
                                        {
                                            "body": "I mean world building wise it’s absolutely fantastic. Only issue I have is Kaguya and anime pacing, but making anime out of cherished epics Always have pacing issues",
                                            "author": "revmun",
                                            "id": "g5h1fbn",
                                            "parent_id": "t1_g5gzxfp",
                                            "score": 26,
                                            "created_utc": 1600266038.0,
                                            "replies": [
                                                {
                                                    "body": "the war arc was shit writing, “uhhh we ran out of characters, let’s bring back every dead character”, also shippuden was just this wack ass sasuke hunt, despite them making sasuke a dislikeable character I enjoyed the show overall but it was terribly written",
                                                    "author": "whatyouegg123",
                                                    "id": "g5h9vd3",
                                                    "parent_id": "t1_g5h1fbn",
                                                    "score": -5,
                                                    "created_utc": 1600270366.0,
                                                    "replies": [
                                                        {
                                                            "body": "Fairly sure they introduced more characters and backstory in the war arc than any previous arcs. Before war arc we literally only knew the leaf village and it’s heroes. War arc introduced us to all the lackeys from all over the place, past Kages and their feuds, all the seven swordsmen, ginkaku and his brother, and more(remembering might duy and his gate progress. these were all touched upon before but they were fully developed in the war arc.",
                                                            "author": "revmun",
                                                            "id": "g5hdr45",
                                                            "parent_id": "t1_g5h9vd3",
                                                            "score": 8,
                                                            "created_utc": 1600272263.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "We're all here, so we must have enjoyed it somewhat! But I agree. Naruto holds a place in my heart because of how long the series and characters have been in my life, not particularly because of the way it's crafted or paced. Anytime I see people complain about Boruto, they're usually things I tend to ignore or overlook while watching Naruto/Shippuden, but it's heresy to suggest that Boruto and Naruto are more alike as an anime series than fans will often want to admit.",
                                    "author": "secret101",
                                    "id": "g5h8ouy",
                                    "parent_id": "t1_g5gz3xb",
                                    "score": 7,
                                    "created_utc": 1600269785.0,
                                    "replies": [
                                        {
                                            "body": "My thought process was always \"The filler was backloaded in OG Naruto, and spaced throughout Shippuden. I so Boruto just has filler from the beginning. Whatever! It's still fun!\"",
                                            "author": "ElderlyPeanut",
                                            "id": "g5hdf7f",
                                            "parent_id": "t1_g5h8ouy",
                                            "score": 3,
                                            "created_utc": 1600272100.0,
                                            "replies": [
                                                {
                                                    "body": "I really enjoyed the starte filler of Boruto because I was utterly burnt out from the constant world-ending battle story arc that is the last few hundred episodes of Shippuden. \n\nSeeing the children of beloved characters and how those characters grew into adults is intriguing to me. I enjoy watching their growth, even if it's not all linear progression. Not all our beloved characters will become as strong as Naruto and Sasuke during all those years because everyone's journey is different and peacetime will definitely dull any of their senses after being constantly at war since birth.",
                                                    "author": "secret101",
                                                    "id": "g5hf5ai",
                                                    "parent_id": "t1_g5hdf7f",
                                                    "score": 5,
                                                    "created_utc": 1600272945.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "Boruto is not enjoyable for most of die hard Naruto fans. It would have done well for a standalone, but it had a garbage start to the series and got good too late. Not many fans have that much patience for a series with an unlikable character from the first chapter.",
                                    "author": "Huhwtfbleh",
                                    "id": "g5h0lvg",
                                    "parent_id": "t1_g5gz3xb",
                                    "score": 1,
                                    "created_utc": 1600265592.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "i like that the god fights stopped for a little while",
                    "author": "ausername434",
                    "id": "g5h9y9s",
                    "parent_id": "t1_g5gv99w",
                    "score": 2,
                    "created_utc": 1600270407.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Just recently finished watching Shippuden (rewatched) and decided to give Boruto a try. It sucks ass, I feel like there's absolutely no substance to it, like it's all bone and no meat. There are 165 episodes and nothing has really happened yet. The fuck is this bullshit? Are they just catering to a younger demographic?",
            "author": "Bumbleweave",
            "id": "g5hrwvs",
            "parent_id": "t3_itt2bv",
            "score": 3,
            "created_utc": 1600279062.0,
            "replies": [
                {
                    "body": "Yknow how back in the day people sometimes complained that Naruto and Sasuke got too much screentime and nobody else got to shine really? Well the way I see it Boruto is helping make up for that by giving everyone else their time to shine. We get to explore the ninja world lore more, see more possiblities, see how people have grown,  and new kekkai genkai and jutsu. Some people see that as boring and I can understand why, but for me just seeing something completely new is its own reward and I've loved every step of the way. I love a slice of life ninja show. I love Boruto.",
                    "author": "Poknberry",
                    "id": "g5hyrsl",
                    "parent_id": "t1_g5hrwvs",
                    "score": 2,
                    "created_utc": 1600282420.0,
                    "replies": []
                },
                {
                    "body": "Read the manga",
                    "author": "Yourboyfibs",
                    "id": "g5irib3",
                    "parent_id": "t1_g5hrwvs",
                    "score": 2,
                    "created_utc": 1600294842.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Well the difference is naruto didn't deserve all the hate. But boruto does. I'm still waiting for it to get better. I hope it gets better before one piece finishes airing.",
            "author": null,
            "id": "g5h2us5",
            "parent_id": "t3_itt2bv",
            "score": 10,
            "created_utc": 1600266801.0,
            "replies": [
                {
                    "body": "Did you read it?",
                    "author": "Yourboyfibs",
                    "id": "g5irdng",
                    "parent_id": "t1_g5h2us5",
                    "score": 2,
                    "created_utc": 1600294787.0,
                    "replies": [
                        {
                            "body": "I (hope) think they’re talking about the anime",
                            "author": "cj-the-man",
                            "id": "g5ithqq",
                            "parent_id": "t1_g5irdng",
                            "score": 1,
                            "created_utc": 1600295817.0,
                            "replies": [
                                {
                                    "body": "Yeah obviously.",
                                    "author": null,
                                    "id": "g5ixe7b",
                                    "parent_id": "t1_g5ithqq",
                                    "score": 1,
                                    "created_utc": 1600297984.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I think people just need to stop comparing Boruto to Naruto because its not the same thing. Boruto is much more slice of life than Naruto. I adore it, but unfortunately some people label that as 'filler' and then go around saying the show is ass or not as good as it could be simply because its different. Its understandable that those people would like Boruto less because it is different from Naruto, but that doesn't mean Boruto is bad it just means maybe its not for that specific person. But in my eyes its absolutely perfect. Filler and all. I love the slice of life, I love seeing new characters develop, I love seeing small things be explored for a change instead of the same people and jutsu everytime. Boruto is not a bad show, its being written by the same geniuses that wrote Naruto.",
            "author": "Poknberry",
            "id": "g5hzfgs",
            "parent_id": "t3_itt2bv",
            "score": 2,
            "created_utc": 1600282742.0,
            "replies": [
                {
                    "body": "I think boruto has a different writer and Kishimoto is just overseeing it",
                    "author": "cj-the-man",
                    "id": "g5itxdo",
                    "parent_id": "t1_g5hzfgs",
                    "score": 2,
                    "created_utc": 1600296056.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "The Boruto manga is pretty good. Totally different (and much better than) the anime version of Boruto. I would recommend it.",
            "author": "starkwhite95",
            "id": "g5i092e",
            "parent_id": "t3_itt2bv",
            "score": 2,
            "created_utc": 1600283156.0,
            "replies": []
        },
        {
            "body": "Palpatine: Ironic.",
            "author": "PhilpippOne",
            "id": "g5k9036",
            "parent_id": "t3_itt2bv",
            "score": 2,
            "created_utc": 1600325489.0,
            "replies": []
        },
        {
            "body": "I’m probably one of the only Naruto fans that enjoy boruto",
            "author": "J_B8S13",
            "id": "g5lpzc6",
            "parent_id": "t3_itt2bv",
            "score": 2,
            "created_utc": 1600361317.0,
            "replies": []
        },
        {
            "body": "It’s the characters and the kid-gloves story lines and arcs. It would be like watching konohamuru’s team when he was just a child watching them capture bears and shit over and over again.\n\nThe chances they take are weak with the storyline and honestly pretty uninteresting and shallow characters. In Natuto at least the main cast were complex and a lot was going on. Kids being forced into situations they aren’t ready for and real traumatic shit was the goods. Picking out someones outfit, playing video games and deciding what you want to eat - I have no interest in. First cool character got snipped. Class president, whatever her name was.",
            "author": "KazPrime",
            "id": "g5h32fk",
            "parent_id": "t3_itt2bv",
            "score": 7,
            "created_utc": 1600266912.0,
            "replies": [
                {
                    "body": "I really don't see how og main cast was any more complex than boruto's. Kids dealing with tramautic shit bc war vs kids dealing with mundane/relatable things to highlight peace times. Even has been explicitly stated by kakashi(?) that this generation is not ready to face a serious threat if it came upon them because they grew up in a peaceful era; they are not really combat experienced. Almost like an obvious foreshadowing for the tragedies that will occur",
                    "author": "clouds_over_asia",
                    "id": "g5h9y9w",
                    "parent_id": "t1_g5h32fk",
                    "score": 1,
                    "created_utc": 1600270407.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Boruto is absolutely great, as are all the series, except most of the fillers of course.",
            "author": "aeoure",
            "id": "g5hpj1f",
            "parent_id": "t3_itt2bv",
            "score": 2,
            "created_utc": 1600277933.0,
            "replies": []
        },
        {
            "body": "It's fair. Boruto is exceptionally subpar for what it could have been. The beginning fight against Momoshiki is about as good as it gets. It somehow goes from that, to like 100 filler episodes. From Shino becoming a doll collecting weeb, to Boruto going to jail. It's a wild ride for sure, but doesn't feel like Naruto in any capacity.",
            "author": "sleepyboylol",
            "id": "g5hdy4q",
            "parent_id": "t3_itt2bv",
            "score": 2,
            "created_utc": 1600272357.0,
            "replies": []
        },
        {
            "body": "If this ain't the realest shit though. The completely ruined Naruto in Boruto. And how come when Naruto beats a God (Kagyuya)  he doesbt get any boost but when Boruto does, he suddenly get the Jougan. Wtf is up with that",
            "author": "Blazeman0315",
            "id": "g5h83zi",
            "parent_id": "t3_itt2bv",
            "score": 3,
            "created_utc": 1600269496.0,
            "replies": [
                {
                    "body": "Naruto and Sasuke sealed Kaguya. Boruto killed momo... Correct me if I'm wrong",
                    "author": "clouds_over_asia",
                    "id": "g5h9dm0",
                    "parent_id": "t1_g5h83zi",
                    "score": 6,
                    "created_utc": 1600270121.0,
                    "replies": [
                        {
                            "body": "I like how Naruto and Sasuke did all the work but boruto gets the credit for finishing him off like that whole Rasengan wasn't naruto chakras",
                            "author": null,
                            "id": "g5ij0bg",
                            "parent_id": "t1_g5h9dm0",
                            "score": 1,
                            "created_utc": 1600291209.0,
                            "replies": [
                                {
                                    "body": "Fr though",
                                    "author": "Blazeman0315",
                                    "id": "g73an4f",
                                    "parent_id": "t1_g5ij0bg",
                                    "score": 1,
                                    "created_utc": 1601405079.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "But wouldn't  they both have a similar effect?  Unless people are counting them getting the 6 paths abilities, but I don't.",
                            "author": "Blazeman0315",
                            "id": "g5h9vhu",
                            "parent_id": "t1_g5h9dm0",
                            "score": 0,
                            "created_utc": 1600270368.0,
                            "replies": [
                                {
                                    "body": "Idk bro chalk it up to a plot hole I guess, it was my only albeit loose explanation I could think of",
                                    "author": "clouds_over_asia",
                                    "id": "g5hbtrf",
                                    "parent_id": "t1_g5h9vhu",
                                    "score": 0,
                                    "created_utc": 1600271326.0,
                                    "replies": [
                                        {
                                            "body": "Ig",
                                            "author": "Blazeman0315",
                                            "id": "g5hcxay",
                                            "parent_id": "t1_g5hbtrf",
                                            "score": 1,
                                            "created_utc": 1600271859.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Bruh LOL.",
            "author": "return3",
            "id": "g5hak1g",
            "parent_id": "t3_itt2bv",
            "score": 1,
            "created_utc": 1600270705.0,
            "replies": []
        },
        {
            "body": "How the tables have turned",
            "author": "nromer",
            "id": "g5i9oaj",
            "parent_id": "t3_itt2bv",
            "score": 1,
            "created_utc": 1600287454.0,
            "replies": []
        },
        {
            "body": "I actually couldn't get past the first 10 episodes of Boruto. I am sure it gets better as people say it does but I kinda like the closure Naruto Shippuden did and I don't wanna ruin that experience for me.",
            "author": "SHAGGYOop",
            "id": "g5iadqm",
            "parent_id": "t3_itt2bv",
            "score": 1,
            "created_utc": 1600287742.0,
            "replies": []
        },
        {
            "body": "I literally got killed the other day on the boruto sub because I said that kid who uses a computer in the show is a stupid character. Like imagine your fighting some kid and he pulls out a little computer while his teammates are putting in the work. I'm fine with him being in the anime but the dude can't be a ninja he should just go work in the scientific division.  But Boruto isn't that bad but when they give us that preview of Boruto vs Kawaki and build up the expectations of the viewers and than give us some straight dog shit episode",
            "author": null,
            "id": "g5ik8uj",
            "parent_id": "t3_itt2bv",
            "score": 1,
            "created_utc": 1600291712.0,
            "replies": []
        },
        {
            "body": "Basically, I think Naruto and Boruto are very different shows. The anime get some deserved hate from a Naruto fanbase who liked the more dark and traumatic parts of Naruto, which Boruto doesn't have. (for example, in the latest anime episode, I cussed at the screen because of Boruto's naivete and (as his opponent said) spoiled attitude when it comes to fighting). Also, the slice of life stuff in the Boruto anime is very uninteresting to a major part of the Naruto fandom. Slice of life in a small nation is interesting. But stuff like the ChoCho arc? Disgusting and boring. I think most haters/naruto fans of that spectrum (including myself) should read the Boruto manga. There, his early development is much like Naruto's, and afterwards he is much more mature and much less naive. It is also generally darker and more deserving of calling itself a sequel to Naruto. So...read the manga, people, and screw the anime!",
            "author": "UchihaKiriken",
            "id": "g5inrq1",
            "parent_id": "t3_itt2bv",
            "score": 1,
            "created_utc": 1600293253.0,
            "replies": []
        },
        {
            "body": "I guess I'm Shikamaru then",
            "author": "ShadowDragonSlayer",
            "id": "g5iz8wf",
            "parent_id": "t3_itt2bv",
            "score": 1,
            "created_utc": 1600299013.0,
            "replies": []
        },
        {
            "body": "Its like that because Boruto as an anime hasn't proven itself yet, or at least didnt prove itself in a big enough way soon enough and needs to keep aiming for its theoreical Pain moment. As a legacy series, people want a show that builds on either the whole world or a very specific part of the world (likely one we haven't seen before like how burn the Witch kind of did) and how the previous characters are effected by this, but Boruto from what I saw takes that to far. We no longer have the gritty world of Naruto, but a world were anyone that challenges the leaf has 2 God killers to deal with, so everything feels unimportant. I personally always think that Boruto should have been setup more like Jojo part 2, where a generation has been skipped and things could easily have been lost and found during a new mystery period like all that time we had prior to Naruto being born, not to mention it would be a more effective way to reset the power scaling rather than starting Boruto off like this is new game +",
            "author": "wolffox87",
            "id": "g5l7l6b",
            "parent_id": "t3_itt2bv",
            "score": 1,
            "created_utc": 1600353551.0,
            "replies": []
        },
        {
            "body": "But Boruto fucking sucks. It is such a shameless cash grab. It would be better if that show didn't exist because it is ruining my memory of such an originally fantastic show. Fuck Boruto.",
            "author": "CarlosimoDangerosimo",
            "id": "g5gr58q",
            "parent_id": "t3_itt2bv",
            "score": -5,
            "created_utc": 1600259791.0,
            "replies": [
                {
                    "body": "I don't like boruto as much as the next guy, but dude it's a fucking cartoon. relax",
                    "author": "uge_doodle",
                    "id": "g5gtu8i",
                    "parent_id": "t1_g5gr58q",
                    "score": 33,
                    "created_utc": 1600261579.0,
                    "replies": []
                },
                {
                    "body": "watered down Naruto",
                    "author": "nasgorhead",
                    "id": "g5gwexp",
                    "parent_id": "t1_g5gr58q",
                    "score": 3,
                    "created_utc": 1600263181.0,
                    "replies": []
                },
                {
                    "body": "I agree Boruto is a spoiled brat who is rude to his father, and doesn’t listen to his mother.\n(Hinata and Naruto, completely ruining NaruHina)",
                    "author": "Natsurixsayonika",
                    "id": "g5gunql",
                    "parent_id": "t1_g5gr58q",
                    "score": -2,
                    "created_utc": 1600262098.0,
                    "replies": [
                        {
                            "body": "Bruh just watch it. He isn’t as spoiled anymore",
                            "author": "Wookkiepedia",
                            "id": "g5gzhwg",
                            "parent_id": "t1_g5gunql",
                            "score": 6,
                            "created_utc": 1600264965.0,
                            "replies": [
                                {
                                    "body": "True that. He's definitely changed.",
                                    "author": "singhsama_08",
                                    "id": "g5hlzho",
                                    "parent_id": "t1_g5gzhwg",
                                    "score": 2,
                                    "created_utc": 1600276234.0,
                                    "replies": []
                                },
                                {
                                    "body": "Ok.\n\nEdit:I said I would watch it...why the downvote?\nBut ok, that’s fine.",
                                    "author": "Natsurixsayonika",
                                    "id": "g5h3lr8",
                                    "parent_id": "t1_g5gzhwg",
                                    "score": -3,
                                    "created_utc": 1600267192.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Bruh",
                    "author": "blooper111",
                    "id": "g5hcyuf",
                    "parent_id": "t1_g5gr58q",
                    "score": 1,
                    "created_utc": 1600271880.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Why they hate it so much?",
            "author": "NipLixYT",
            "id": "g5hlu2o",
            "parent_id": "t3_itt2bv",
            "score": 1,
            "created_utc": 1600276162.0,
            "replies": []
        },
        {
            "body": "I might cry",
            "author": null,
            "id": "g5hlzmf",
            "parent_id": "t3_itt2bv",
            "score": 1,
            "created_utc": 1600276236.0,
            "replies": []
        },
        {
            "body": "Naruto was orphaned on the day of his birth, had a monster inside him, the whole village hated him and the whole world was trying to kill him.\n\nHow dare you compare Boruto to him?",
            "author": null,
            "id": "g5gs5as",
            "parent_id": "t3_itt2bv",
            "score": -10,
            "created_utc": 1600260477.0,
            "replies": [
                {
                    "body": "I'm not comparing Naruto with Boruto. I'm just stating a fact.",
                    "author": "Abin5ur",
                    "id": "g5gsqt8",
                    "parent_id": "t1_g5gs5as",
                    "score": 26,
                    "created_utc": 1600260870.0,
                    "replies": []
                },
                {
                    "body": "The juxtaposition of boruto's childhood to Naruto is suuuuch an obvious foreshadowing amongst many other blatant clues thrown in that boruto will face tragedies as great or greater than Naruto, it's just comedic that people still compare the two in this way. Like yall just want to hate it just because. Which is fair, to each their own. Boruto will certainly come around once it reaches peak suffering",
                    "author": "clouds_over_asia",
                    "id": "g5ham9p",
                    "parent_id": "t1_g5gs5as",
                    "score": 3,
                    "created_utc": 1600270734.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Only this time, Boruto deserved it.",
            "author": null,
            "id": "g5im7ug",
            "parent_id": "t3_itt2bv",
            "score": 0,
            "created_utc": 1600292568.0,
            "replies": []
        },
        {
            "body": "You are just spitting facts.",
            "author": "prayul",
            "id": "g5h82h0",
            "parent_id": "t1_g5h10db",
            "score": 95,
            "created_utc": 1600269474.0,
            "replies": [
                {
                    "body": "S bruh lol.",
                    "author": "return3",
                    "id": "g5hal58",
                    "parent_id": "t1_g5h82h0",
                    "score": 31,
                    "created_utc": 1600270720.0,
                    "replies": [
                        {
                            "body": "Lol my bad",
                            "author": "prayul",
                            "id": "g5i84lf",
                            "parent_id": "t1_g5hal58",
                            "score": 8,
                            "created_utc": 1600286835.0,
                            "replies": [
                                {
                                    "body": "Nah ur good I just had anxiety for a sec lol.",
                                    "author": "return3",
                                    "id": "g5iil81",
                                    "parent_id": "t1_g5i84lf",
                                    "score": 4,
                                    "created_utc": 1600291042.0,
                                    "replies": [
                                        {
                                            "body": "I'd like to say that tenten is the best character in the show.\nJust spitting out opinions no one cares about.",
                                            "author": "AshenPlight",
                                            "id": "g5jdpre",
                                            "parent_id": "t1_g5iil81",
                                            "score": 3,
                                            "created_utc": 1600306916.0,
                                            "replies": [
                                                {
                                                    "body": "ok lol.",
                                                    "author": "return3",
                                                    "id": "g5jfoaw",
                                                    "parent_id": "t1_g5jdpre",
                                                    "score": 2,
                                                    "created_utc": 1600307816.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I wish someone would do the math.",
            "author": "dakotachip",
            "id": "g5hpu8a",
            "parent_id": "t1_g5h10db",
            "score": 23,
            "created_utc": 1600278081.0,
            "replies": []
        },
        {
            "body": "This is why you watch Naruto Kai it cuts all the bloody flashbacks and repeat scenes",
            "author": "SmoothOctopus",
            "id": "g5iw1n0",
            "parent_id": "t1_g5h10db",
            "score": 6,
            "created_utc": 1600297229.0,
            "replies": [
                {
                    "body": "I've been meaning to check it out. I've watched the whole series and even recommended it to a lot of friends but most people aren't willing to watch it when they hear it's 700+ ep. Even if you cut out the filler, it's still over 400 atleast.\n\nBut I'm just wondering if Naruto Kai still manages to fit in all the important moments. It's only 92 ep right? Does it have all the fights? All the touching interactions? What about the flashbacks that are necessary for the plot - like Kakashi and Obito's stories, Minato and Kushina backstory etc?\n\nI want to know if Naruto Kai is worth recommending.",
                    "author": "Minato_the_legend",
                    "id": "g5jut1n",
                    "parent_id": "t1_g5iw1n0",
                    "score": 3,
                    "created_utc": 1600315286.0,
                    "replies": [
                        {
                            "body": "Yeah it does I didn't notice anything missing except filler episodes it doesn't cut all the flashbacks just pretty much only plays them the first time not 3 times per episode",
                            "author": "SmoothOctopus",
                            "id": "g5jxjv2",
                            "parent_id": "t1_g5jut1n",
                            "score": 2,
                            "created_utc": 1600316734.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "just no",
                    "author": "Dream_Scaper",
                    "id": "g63r1va",
                    "parent_id": "t1_g5iw1n0",
                    "score": 1,
                    "created_utc": 1600697550.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "oof that was cold",
            "author": "heyyassbutt",
            "id": "g5igm1r",
            "parent_id": "t1_g5h10db",
            "score": 2,
            "created_utc": 1600290262.0,
            "replies": []
        },
        {
            "body": "Shippuden anime is way way fucking over stretched. But hot damn, I don't know how many times I've reread the manga. Shippuden is so fucking good without those fillers. I loved how they gave life to Akatsuki and how they developed Naruto's character. I still cri when I see Naruto meet his mom like holy shit.",
            "author": null,
            "id": "g5hc2a8",
            "parent_id": "t1_g5h1je7",
            "score": 115,
            "created_utc": 1600271443.0,
            "replies": [
                {
                    "body": "I never read the manga unfortunately and only have the anime to go off of. Glad to discuss the show with some fans regardless of preference",
                    "author": null,
                    "id": "g5hcece",
                    "parent_id": "t1_g5hc2a8",
                    "score": 35,
                    "created_utc": 1600271604.0,
                    "replies": [
                        {
                            "body": "Just skip filler",
                            "author": "Sasuke-Sarutobi",
                            "id": "g5ibwvk",
                            "parent_id": "t1_g5hcece",
                            "score": 12,
                            "created_utc": 1600288352.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Shippuden is actually paced fairly well without the filler. \n\nI’d say the first arc with sasori and deidara drags a little (how many episodes were they trailing deidara down that ravine? Lmao), but other than that it’s not too stretched out w/o the filler imo",
                    "author": null,
                    "id": "g5i8fe8",
                    "parent_id": "t1_g5hc2a8",
                    "score": 25,
                    "created_utc": 1600286953.0,
                    "replies": []
                },
                {
                    "body": "I’ve never watched the filler always skipped",
                    "author": "astrapes",
                    "id": "g5hywbh",
                    "parent_id": "t1_g5hc2a8",
                    "score": 3,
                    "created_utc": 1600282482.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "If you think OG Naruto is better than Shippuden(minus the War arc), you're probably clouded by nostalgia.",
            "author": "Lxilind",
            "id": "g5ha01v",
            "parent_id": "t1_g5h1je7",
            "score": 39,
            "created_utc": 1600270431.0,
            "replies": [
                {
                    "body": "True i would rank the complete series as Naruto shippuden (until pain arc)> naruto og > naruto Shippuden (war arc).\n\nI have watched the series twice once when I was 15 then during quarantine 3 months ago.\n\nThen again people can have preferences but naruto part 2 was so much better for me especially the rinneangan reveal itachi backstory man I used to have goosebumps every naruto episode back then",
                    "author": "upvote-me-ya-bish",
                    "id": "g5hbspa",
                    "parent_id": "t1_g5ha01v",
                    "score": 27,
                    "created_utc": 1600271312.0,
                    "replies": [
                        {
                            "body": "Everything after pain arc, was just a giant cluster fuck of power levels going through the fucking roof.  Might as well have just been dragon ball z at that point.",
                            "author": "cheese4352",
                            "id": "g5idy7g",
                            "parent_id": "t1_g5hbspa",
                            "score": 5,
                            "created_utc": 1600289192.0,
                            "replies": [
                                {
                                    "body": "Nah i still love the war arc it had its moments and not for a second i felt bored(ofc i skipped through fillers and flashbacks). As a collective it didn't make much sense but ill be damned if gai 8gates, madara hashirama backstory, nagato/itachi meet with naruto, gaara and his dad reunion or practically any scene witth madara in it weren't some of the finest moments in anime i have ever seen.\n\nAs for it being dbz i dont get it sure at some times it was my jutsu beam vs your tailed beast bomb but it was always tactical like itachi figuring out core of planetary devastation or obito going through different dimensions to find sassuke.",
                                    "author": "upvote-me-ya-bish",
                                    "id": "g5k7m5t",
                                    "parent_id": "t1_g5idy7g",
                                    "score": 2,
                                    "created_utc": 1600324202.0,
                                    "replies": [
                                        {
                                            "body": "Dragonball z in multiple regards.  Yes the giant beams and shit, but the very shift of the story itself and the tone shift.\n\n\nAliens and giant open field battles.  Everything just jumped thr shark.  8 gate gai was really awesome, but it jumped the shark as well.  It got too ridiculous.",
                                            "author": "cheese4352",
                                            "id": "g5kq8hg",
                                            "parent_id": "t1_g5k7m5t",
                                            "score": 1,
                                            "created_utc": 1600343200.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "I started watching when I was 23, longer reply incoming",
                    "author": null,
                    "id": "g5ha6qh",
                    "parent_id": "t1_g5ha01v",
                    "score": 12,
                    "created_utc": 1600270523.0,
                    "replies": []
                },
                {
                    "body": "I just rewatched OG, I still prefer it mainly because of the more grounded battles",
                    "author": "McThije",
                    "id": "g5i6vhi",
                    "parent_id": "t1_g5ha01v",
                    "score": 2,
                    "created_utc": 1600286336.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "The mist arc is the best arc, nobody can convince me otherwise. The manga just had this entirely different feel to it that was way more adult themed/complex than the follow up good vs evil plotline kishi followed afterwards.",
            "author": "wenchslapper",
            "id": "g5j5vg8",
            "parent_id": "t1_g5h1je7",
            "score": 6,
            "created_utc": 1600302728.0,
            "replies": [
                {
                    "body": "1,000% agree",
                    "author": null,
                    "id": "g5j6ooe",
                    "parent_id": "t1_g5j5vg8",
                    "score": 1,
                    "created_utc": 1600303181.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I respect your opinion and taste but I just can not personally understand the hype around og Naruto. I think so much of it was cringey and literally half the show was boring filler... Shippuden was only marginally better",
            "author": "clouds_over_asia",
            "id": "g5h8wvk",
            "parent_id": "t1_g5h1je7",
            "score": 10,
            "created_utc": 1600269893.0,
            "replies": [
                {
                    "body": "Agreed, part 1 is a fantastic story and is great, but God it moves so damn slow and is just all around boring sometimes. Shippuden, even for all its power creep and inconsistencies, is just 10x more interesting to me.",
                    "author": "VanillaDylan",
                    "id": "g5hamw1",
                    "parent_id": "t1_g5h8wvk",
                    "score": 17,
                    "created_utc": 1600270742.0,
                    "replies": []
                },
                {
                    "body": "Lengthy fanboy reply incoming, side note my first time watching was at age 23 and I hadn’t watched a ton of anime before. \n\nI was hooked at the end of episode 1 when naruto heard iruka accept him and he summoned a forest of shadow clones to save him. Iruka had a big ass shuriken sticking out of his back and it gave the show a dark edge/art style that really resonated with me. It really felt like someone could get offed at any time. \n\nThis goes directly into naruto/sasuke rivalry and meeting kakashi, which you didn’t know what to think after letting the eraser prank get him. The bell test expanded the knowledge of the jutsu rules and kakashi’s skills as well as the skill gap naruto needs to overcome. \n\nThis goes directly into the land of waves arc, which set in stone how much I will always love the show. You get a feel for sasuke’s skills and get a morsel of information about narutos chakra capabilities. Zabuza’s appearance put real fear into the characters and I had no idea how they’d persevere. Kakashi’s reveal of the sharingan was awesome and sasuke’s obvious surprise at how he could even have one added a lot of mystery. Top 3 moment for me is naruto retrieving his headband leading to the teamwork with sasuke and the awesome shot of him peering through the demon wind shuriken. \n\nI could go on and on but to me, og naruto is dark, humorous at times, does a great job of world building and shows very interesting teamwork/strategy (shikamaru any scene, sasuke retrieval arc especially). The side characters were very interesting and relevant. Shippuden has the akatsuki which was extremely interesting but seems to drag its feet at times and I feel that it’s missing that element of teamwork and camaraderie that I loved from the original as well as the darker art style. It’s all preference and I’m biased. Naruto surprising people with overcoming all obstacles in the original was very satisfying to me as well. \n\nA bit of a ramble and not even half of what I could write but there’s some of the reasoning and thought process of why I love the original over shippuden and think it’s more rewatchable",
                    "author": null,
                    "id": "g5hbv7p",
                    "parent_id": "t1_g5h8wvk",
                    "score": 11,
                    "created_utc": 1600271346.0,
                    "replies": [
                        {
                            "body": "Fair enough man I also didn't start watching any anime until like 5 years ago, started with Attack on Titan, a few others and eventually onto Naruto... Was my favorite show as a whole for quite a long time, until I started watching One Piece lol. I get what you're saying about the dark themes and whatnot, but I personally feel that it's a little contrived at times, like it takes itself too seriously... After all it's not truly grim and gruesome like some series, like AoT. Which is totally fine, it just kinda pulls me out from the immersion. You got a good point about the cameraderie thing, not as much of it in shippuden - it's the Naruto Sasuke show. Which I think is honestly where most of my enjoyment of the series comes from anyway, so that's probably where our different opinions reside",
                            "author": "clouds_over_asia",
                            "id": "g5hd4k0",
                            "parent_id": "t1_g5hbv7p",
                            "score": 3,
                            "created_utc": 1600271957.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "og naruto was way better",
                    "author": "ausername434",
                    "id": "g5h9svg",
                    "parent_id": "t1_g5h8wvk",
                    "score": 9,
                    "created_utc": 1600270332.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Ffs, you can skip filler",
            "author": "Sasuke-Sarutobi",
            "id": "g5ibw08",
            "parent_id": "t1_g5h1je7",
            "score": 2,
            "created_utc": 1600288343.0,
            "replies": []
        },
        {
            "body": "Give Naruto Kai a try on your next rewatch, It's like a filler less release of Naruto and Naruto shippuden.",
            "author": "lightninginstinct",
            "id": "g5iqn92",
            "parent_id": "t1_g5h1je7",
            "score": 2,
            "created_utc": 1600294469.0,
            "replies": [
                {
                    "body": "But in just 92 ep? Isn't that way too cramped?",
                    "author": "Minato_the_legend",
                    "id": "g5jvbgo",
                    "parent_id": "t1_g5iqn92",
                    "score": 1,
                    "created_utc": 1600315552.0,
                    "replies": [
                        {
                            "body": "Each episode duration is about 1-2 hours, some even reaching 3 hours. Can easily account for 500+ episodes of both Naruto and Naruto shippuden.",
                            "author": "lightninginstinct",
                            "id": "g5lqdai",
                            "parent_id": "t1_g5jvbgo",
                            "score": 2,
                            "created_utc": 1600361479.0,
                            "replies": [
                                {
                                    "body": "Ahh that makes so much more sense. That's perfect. I'll check it out myself and recommend to friends too",
                                    "author": "Minato_the_legend",
                                    "id": "g5lzi8x",
                                    "parent_id": "t1_g5lqdai",
                                    "score": 2,
                                    "created_utc": 1600365260.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "There also the problem that Boruto is just talented at everything he does. Naruto had to put in hard work to get to where he is. Boruto can do what he wants cause he's a natural prodigy.",
            "author": "infamusforever223",
            "id": "g5h3cvi",
            "parent_id": "t1_g5h1kmo",
            "score": 37,
            "created_utc": 1600267065.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "g5hii0a",
                    "parent_id": "t1_g5h3cvi",
                    "score": 24,
                    "created_utc": 1600274570.0,
                    "replies": [
                        {
                            "body": "But as it sits right now, I as the reader(or watcher in terms of the anime) can't relate to him in anyway, shape or form. Nothing about his character translates well.",
                            "author": "infamusforever223",
                            "id": "g5hiso2",
                            "parent_id": "t1_g5hii0a",
                            "score": 15,
                            "created_utc": 1600274712.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "g5hjrh6",
                                    "parent_id": "t1_g5hiso2",
                                    "score": 18,
                                    "created_utc": 1600275171.0,
                                    "replies": [
                                        {
                                            "body": "In Luffy's case, while he is very advantaged, he is extremely likable. The same goes for Ichigo, though he gets knocked on his ass a lot. Boruto is a character that is not only extremely talented, but also bratty, and it's a turn off.",
                                            "author": "infamusforever223",
                                            "id": "g5hkmt9",
                                            "parent_id": "t1_g5hjrh6",
                                            "score": 7,
                                            "created_utc": 1600275590.0,
                                            "replies": [
                                                {
                                                    "body": "Maybe that's the point? Maybe you aren't supposed to empathize with Boruto. Maybe him being so opposite to his mother and father is part of the struggle he'll face in the future? Maybe he learns to be more like them, in their absence?",
                                                    "author": "AlextheLyonnn",
                                                    "id": "g5hpo7p",
                                                    "parent_id": "t1_g5hkmt9",
                                                    "score": 17,
                                                    "created_utc": 1600278003.0,
                                                    "replies": [
                                                        {
                                                            "body": "It could be. I'm only explaining why I don't like Boruto and jumped off a long time ago. I don't think less of those that like it, but I gave up on it.",
                                                            "author": "infamusforever223",
                                                            "id": "g5hvx7t",
                                                            "parent_id": "t1_g5hpo7p",
                                                            "score": 3,
                                                            "created_utc": 1600281023.0,
                                                            "replies": [
                                                                {
                                                                    "body": "I hate that little shit, too. Don't worry. But we're getting to see what Naruto would have been like if Minato and Kushina lived, I guess. Can't stand the show though.",
                                                                    "author": "AlextheLyonnn",
                                                                    "id": "g5hy9cy",
                                                                    "parent_id": "t1_g5hvx7t",
                                                                    "score": 3,
                                                                    "created_utc": 1600282172.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "body": "Thats what I was thinking too. Both Boruto as the series and the character have insane potential to be amazing with all the things estabilished. Its just really, really, really badly executed, stupid, targeted at children and overall just a bad joke at best.",
                                                            "author": "Remedh",
                                                            "id": "g5ixbem",
                                                            "parent_id": "t1_g5hpo7p",
                                                            "score": 3,
                                                            "created_utc": 1600297941.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "body": "Luffy grew up with bandits without even knowing he had parents and started discovering the world at 17 i think. thats the opposite of Boruto\n\nand Light from Death Note isnt relatable man",
                                            "author": "LilQuasar",
                                            "id": "g5iv2ae",
                                            "parent_id": "t1_g5hjrh6",
                                            "score": 3,
                                            "created_utc": 1600296685.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "Yes you’re not supposed to relate to him, the point is for him to mature through loss",
                                    "author": "Yourboyfibs",
                                    "id": "g5ir8m8",
                                    "parent_id": "t1_g5hiso2",
                                    "score": 4,
                                    "created_utc": 1600294724.0,
                                    "replies": [
                                        {
                                            "body": "That's great and all, but I feel something was lost in translation, because he's so uncompelling that I don't want to continue with the story and I don't care what happens to him. I only have a passersby interest in seeing what happens to the original cast, and that means, in my eyes, you have failed at storytelling, as you haven't engaged me, the reader.",
                                            "author": "infamusforever223",
                                            "id": "g5it2wc",
                                            "parent_id": "t1_g5ir8m8",
                                            "score": 1,
                                            "created_utc": 1600295593.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Agreed dude, the hustle Naruto went through which shaped his personality is what we fans love about the show. Whereas in Boruto it's like everyone's smart and can do whatever they wish to do.",
                    "author": "heyitsmeniraj",
                    "id": "g5h3pba",
                    "parent_id": "t1_g5h3cvi",
                    "score": 17,
                    "created_utc": 1600267243.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "How the hell did they pump out that many episodes when there is like 50 issues of the manga?  I thought Natuto was bad for filler",
            "author": null,
            "id": "g5inh8u",
            "parent_id": "t1_g5hrj52",
            "score": 7,
            "created_utc": 1600293123.0,
            "replies": [
                {
                    "body": "oh the anime didnt even touch chaper 10 yet lol",
                    "author": "Konoha__Shinobi",
                    "id": "g5jqtjc",
                    "parent_id": "t1_g5inh8u",
                    "score": 6,
                    "created_utc": 1600313287.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "It's not amazing but it's pretty good for what it is. People need to lower their expectations, I was never expecting Itachi subplot level writing at all from Boruto and I came out pleasantly surprised by what I've seen",
            "author": "EnflamedHuevos",
            "id": "g5gx9zw",
            "parent_id": "t1_g5gv99w",
            "score": 51,
            "created_utc": 1600263695.0,
            "replies": [
                {
                    "body": "The same people who give Boruto unwarranted hate are the same people who complained that side characters didn't get any screen time, now that they are, they still complain. It's like they wanted the Chuunin Exams to happen in the first episode otherwise it's bad.\n\nI loved the slice of life at the beginning of the series, and I agree, it's not amazing but I love it. It's dark points are coming, (I'm not caught up in the manga but I think it's happening already).\n\nThey want it to be the exact same as Naruto, while at the same time complaining that it's the same.",
                    "author": "Chalaka",
                    "id": "g5h66gx",
                    "parent_id": "t1_g5gx9zw",
                    "score": 9,
                    "created_utc": 1600268512.0,
                    "replies": []
                },
                {
                    "body": "Yeah, I mean could you really call Naruto a well crafted anime? I wouldn't, but I enjoy the hell out of it!",
                    "author": "ElderlyPeanut",
                    "id": "g5gz3xb",
                    "parent_id": "t1_g5gx9zw",
                    "score": 22,
                    "created_utc": 1600264745.0,
                    "replies": [
                        {
                            "body": "Naruto, yes you could call it well crafted. Shippuden? Nah not at all.",
                            "author": "whatyouegg123",
                            "id": "g5gzxfp",
                            "parent_id": "t1_g5gz3xb",
                            "score": 31,
                            "created_utc": 1600265212.0,
                            "replies": [
                                {
                                    "body": "I mean world building wise it’s absolutely fantastic. Only issue I have is Kaguya and anime pacing, but making anime out of cherished epics Always have pacing issues",
                                    "author": "revmun",
                                    "id": "g5h1fbn",
                                    "parent_id": "t1_g5gzxfp",
                                    "score": 26,
                                    "created_utc": 1600266038.0,
                                    "replies": [
                                        {
                                            "body": "the war arc was shit writing, “uhhh we ran out of characters, let’s bring back every dead character”, also shippuden was just this wack ass sasuke hunt, despite them making sasuke a dislikeable character I enjoyed the show overall but it was terribly written",
                                            "author": "whatyouegg123",
                                            "id": "g5h9vd3",
                                            "parent_id": "t1_g5h1fbn",
                                            "score": -5,
                                            "created_utc": 1600270366.0,
                                            "replies": [
                                                {
                                                    "body": "Fairly sure they introduced more characters and backstory in the war arc than any previous arcs. Before war arc we literally only knew the leaf village and it’s heroes. War arc introduced us to all the lackeys from all over the place, past Kages and their feuds, all the seven swordsmen, ginkaku and his brother, and more(remembering might duy and his gate progress. these were all touched upon before but they were fully developed in the war arc.",
                                                    "author": "revmun",
                                                    "id": "g5hdr45",
                                                    "parent_id": "t1_g5h9vd3",
                                                    "score": 8,
                                                    "created_utc": 1600272263.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "We're all here, so we must have enjoyed it somewhat! But I agree. Naruto holds a place in my heart because of how long the series and characters have been in my life, not particularly because of the way it's crafted or paced. Anytime I see people complain about Boruto, they're usually things I tend to ignore or overlook while watching Naruto/Shippuden, but it's heresy to suggest that Boruto and Naruto are more alike as an anime series than fans will often want to admit.",
                            "author": "secret101",
                            "id": "g5h8ouy",
                            "parent_id": "t1_g5gz3xb",
                            "score": 7,
                            "created_utc": 1600269785.0,
                            "replies": [
                                {
                                    "body": "My thought process was always \"The filler was backloaded in OG Naruto, and spaced throughout Shippuden. I so Boruto just has filler from the beginning. Whatever! It's still fun!\"",
                                    "author": "ElderlyPeanut",
                                    "id": "g5hdf7f",
                                    "parent_id": "t1_g5h8ouy",
                                    "score": 3,
                                    "created_utc": 1600272100.0,
                                    "replies": [
                                        {
                                            "body": "I really enjoyed the starte filler of Boruto because I was utterly burnt out from the constant world-ending battle story arc that is the last few hundred episodes of Shippuden. \n\nSeeing the children of beloved characters and how those characters grew into adults is intriguing to me. I enjoy watching their growth, even if it's not all linear progression. Not all our beloved characters will become as strong as Naruto and Sasuke during all those years because everyone's journey is different and peacetime will definitely dull any of their senses after being constantly at war since birth.",
                                            "author": "secret101",
                                            "id": "g5hf5ai",
                                            "parent_id": "t1_g5hdf7f",
                                            "score": 5,
                                            "created_utc": 1600272945.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Boruto is not enjoyable for most of die hard Naruto fans. It would have done well for a standalone, but it had a garbage start to the series and got good too late. Not many fans have that much patience for a series with an unlikable character from the first chapter.",
                            "author": "Huhwtfbleh",
                            "id": "g5h0lvg",
                            "parent_id": "t1_g5gz3xb",
                            "score": 1,
                            "created_utc": 1600265592.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "i like that the god fights stopped for a little while",
            "author": "ausername434",
            "id": "g5h9y9s",
            "parent_id": "t1_g5gv99w",
            "score": 2,
            "created_utc": 1600270407.0,
            "replies": []
        },
        {
            "body": "Yknow how back in the day people sometimes complained that Naruto and Sasuke got too much screentime and nobody else got to shine really? Well the way I see it Boruto is helping make up for that by giving everyone else their time to shine. We get to explore the ninja world lore more, see more possiblities, see how people have grown,  and new kekkai genkai and jutsu. Some people see that as boring and I can understand why, but for me just seeing something completely new is its own reward and I've loved every step of the way. I love a slice of life ninja show. I love Boruto.",
            "author": "Poknberry",
            "id": "g5hyrsl",
            "parent_id": "t1_g5hrwvs",
            "score": 2,
            "created_utc": 1600282420.0,
            "replies": []
        },
        {
            "body": "Read the manga",
            "author": "Yourboyfibs",
            "id": "g5irib3",
            "parent_id": "t1_g5hrwvs",
            "score": 2,
            "created_utc": 1600294842.0,
            "replies": []
        },
        {
            "body": "Did you read it?",
            "author": "Yourboyfibs",
            "id": "g5irdng",
            "parent_id": "t1_g5h2us5",
            "score": 2,
            "created_utc": 1600294787.0,
            "replies": [
                {
                    "body": "I (hope) think they’re talking about the anime",
                    "author": "cj-the-man",
                    "id": "g5ithqq",
                    "parent_id": "t1_g5irdng",
                    "score": 1,
                    "created_utc": 1600295817.0,
                    "replies": [
                        {
                            "body": "Yeah obviously.",
                            "author": null,
                            "id": "g5ixe7b",
                            "parent_id": "t1_g5ithqq",
                            "score": 1,
                            "created_utc": 1600297984.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I think boruto has a different writer and Kishimoto is just overseeing it",
            "author": "cj-the-man",
            "id": "g5itxdo",
            "parent_id": "t1_g5hzfgs",
            "score": 2,
            "created_utc": 1600296056.0,
            "replies": []
        },
        {
            "body": "I really don't see how og main cast was any more complex than boruto's. Kids dealing with tramautic shit bc war vs kids dealing with mundane/relatable things to highlight peace times. Even has been explicitly stated by kakashi(?) that this generation is not ready to face a serious threat if it came upon them because they grew up in a peaceful era; they are not really combat experienced. Almost like an obvious foreshadowing for the tragedies that will occur",
            "author": "clouds_over_asia",
            "id": "g5h9y9w",
            "parent_id": "t1_g5h32fk",
            "score": 1,
            "created_utc": 1600270407.0,
            "replies": []
        },
        {
            "body": "Naruto and Sasuke sealed Kaguya. Boruto killed momo... Correct me if I'm wrong",
            "author": "clouds_over_asia",
            "id": "g5h9dm0",
            "parent_id": "t1_g5h83zi",
            "score": 6,
            "created_utc": 1600270121.0,
            "replies": [
                {
                    "body": "I like how Naruto and Sasuke did all the work but boruto gets the credit for finishing him off like that whole Rasengan wasn't naruto chakras",
                    "author": null,
                    "id": "g5ij0bg",
                    "parent_id": "t1_g5h9dm0",
                    "score": 1,
                    "created_utc": 1600291209.0,
                    "replies": [
                        {
                            "body": "Fr though",
                            "author": "Blazeman0315",
                            "id": "g73an4f",
                            "parent_id": "t1_g5ij0bg",
                            "score": 1,
                            "created_utc": 1601405079.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "But wouldn't  they both have a similar effect?  Unless people are counting them getting the 6 paths abilities, but I don't.",
                    "author": "Blazeman0315",
                    "id": "g5h9vhu",
                    "parent_id": "t1_g5h9dm0",
                    "score": 0,
                    "created_utc": 1600270368.0,
                    "replies": [
                        {
                            "body": "Idk bro chalk it up to a plot hole I guess, it was my only albeit loose explanation I could think of",
                            "author": "clouds_over_asia",
                            "id": "g5hbtrf",
                            "parent_id": "t1_g5h9vhu",
                            "score": 0,
                            "created_utc": 1600271326.0,
                            "replies": [
                                {
                                    "body": "Ig",
                                    "author": "Blazeman0315",
                                    "id": "g5hcxay",
                                    "parent_id": "t1_g5hbtrf",
                                    "score": 1,
                                    "created_utc": 1600271859.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I don't like boruto as much as the next guy, but dude it's a fucking cartoon. relax",
            "author": "uge_doodle",
            "id": "g5gtu8i",
            "parent_id": "t1_g5gr58q",
            "score": 33,
            "created_utc": 1600261579.0,
            "replies": []
        },
        {
            "body": "watered down Naruto",
            "author": "nasgorhead",
            "id": "g5gwexp",
            "parent_id": "t1_g5gr58q",
            "score": 3,
            "created_utc": 1600263181.0,
            "replies": []
        },
        {
            "body": "I agree Boruto is a spoiled brat who is rude to his father, and doesn’t listen to his mother.\n(Hinata and Naruto, completely ruining NaruHina)",
            "author": "Natsurixsayonika",
            "id": "g5gunql",
            "parent_id": "t1_g5gr58q",
            "score": -2,
            "created_utc": 1600262098.0,
            "replies": [
                {
                    "body": "Bruh just watch it. He isn’t as spoiled anymore",
                    "author": "Wookkiepedia",
                    "id": "g5gzhwg",
                    "parent_id": "t1_g5gunql",
                    "score": 6,
                    "created_utc": 1600264965.0,
                    "replies": [
                        {
                            "body": "True that. He's definitely changed.",
                            "author": "singhsama_08",
                            "id": "g5hlzho",
                            "parent_id": "t1_g5gzhwg",
                            "score": 2,
                            "created_utc": 1600276234.0,
                            "replies": []
                        },
                        {
                            "body": "Ok.\n\nEdit:I said I would watch it...why the downvote?\nBut ok, that’s fine.",
                            "author": "Natsurixsayonika",
                            "id": "g5h3lr8",
                            "parent_id": "t1_g5gzhwg",
                            "score": -3,
                            "created_utc": 1600267192.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Bruh",
            "author": "blooper111",
            "id": "g5hcyuf",
            "parent_id": "t1_g5gr58q",
            "score": 1,
            "created_utc": 1600271880.0,
            "replies": []
        },
        {
            "body": "I'm not comparing Naruto with Boruto. I'm just stating a fact.",
            "author": "Abin5ur",
            "id": "g5gsqt8",
            "parent_id": "t1_g5gs5as",
            "score": 26,
            "created_utc": 1600260870.0,
            "replies": []
        },
        {
            "body": "The juxtaposition of boruto's childhood to Naruto is suuuuch an obvious foreshadowing amongst many other blatant clues thrown in that boruto will face tragedies as great or greater than Naruto, it's just comedic that people still compare the two in this way. Like yall just want to hate it just because. Which is fair, to each their own. Boruto will certainly come around once it reaches peak suffering",
            "author": "clouds_over_asia",
            "id": "g5ham9p",
            "parent_id": "t1_g5gs5as",
            "score": 3,
            "created_utc": 1600270734.0,
            "replies": []
        },
        {
            "body": "S bruh lol.",
            "author": "return3",
            "id": "g5hal58",
            "parent_id": "t1_g5h82h0",
            "score": 31,
            "created_utc": 1600270720.0,
            "replies": [
                {
                    "body": "Lol my bad",
                    "author": "prayul",
                    "id": "g5i84lf",
                    "parent_id": "t1_g5hal58",
                    "score": 8,
                    "created_utc": 1600286835.0,
                    "replies": [
                        {
                            "body": "Nah ur good I just had anxiety for a sec lol.",
                            "author": "return3",
                            "id": "g5iil81",
                            "parent_id": "t1_g5i84lf",
                            "score": 4,
                            "created_utc": 1600291042.0,
                            "replies": [
                                {
                                    "body": "I'd like to say that tenten is the best character in the show.\nJust spitting out opinions no one cares about.",
                                    "author": "AshenPlight",
                                    "id": "g5jdpre",
                                    "parent_id": "t1_g5iil81",
                                    "score": 3,
                                    "created_utc": 1600306916.0,
                                    "replies": [
                                        {
                                            "body": "ok lol.",
                                            "author": "return3",
                                            "id": "g5jfoaw",
                                            "parent_id": "t1_g5jdpre",
                                            "score": 2,
                                            "created_utc": 1600307816.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I've been meaning to check it out. I've watched the whole series and even recommended it to a lot of friends but most people aren't willing to watch it when they hear it's 700+ ep. Even if you cut out the filler, it's still over 400 atleast.\n\nBut I'm just wondering if Naruto Kai still manages to fit in all the important moments. It's only 92 ep right? Does it have all the fights? All the touching interactions? What about the flashbacks that are necessary for the plot - like Kakashi and Obito's stories, Minato and Kushina backstory etc?\n\nI want to know if Naruto Kai is worth recommending.",
            "author": "Minato_the_legend",
            "id": "g5jut1n",
            "parent_id": "t1_g5iw1n0",
            "score": 3,
            "created_utc": 1600315286.0,
            "replies": [
                {
                    "body": "Yeah it does I didn't notice anything missing except filler episodes it doesn't cut all the flashbacks just pretty much only plays them the first time not 3 times per episode",
                    "author": "SmoothOctopus",
                    "id": "g5jxjv2",
                    "parent_id": "t1_g5jut1n",
                    "score": 2,
                    "created_utc": 1600316734.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "just no",
            "author": "Dream_Scaper",
            "id": "g63r1va",
            "parent_id": "t1_g5iw1n0",
            "score": 1,
            "created_utc": 1600697550.0,
            "replies": []
        },
        {
            "body": "I never read the manga unfortunately and only have the anime to go off of. Glad to discuss the show with some fans regardless of preference",
            "author": null,
            "id": "g5hcece",
            "parent_id": "t1_g5hc2a8",
            "score": 35,
            "created_utc": 1600271604.0,
            "replies": [
                {
                    "body": "Just skip filler",
                    "author": "Sasuke-Sarutobi",
                    "id": "g5ibwvk",
                    "parent_id": "t1_g5hcece",
                    "score": 12,
                    "created_utc": 1600288352.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Shippuden is actually paced fairly well without the filler. \n\nI’d say the first arc with sasori and deidara drags a little (how many episodes were they trailing deidara down that ravine? Lmao), but other than that it’s not too stretched out w/o the filler imo",
            "author": null,
            "id": "g5i8fe8",
            "parent_id": "t1_g5hc2a8",
            "score": 25,
            "created_utc": 1600286953.0,
            "replies": []
        },
        {
            "body": "I’ve never watched the filler always skipped",
            "author": "astrapes",
            "id": "g5hywbh",
            "parent_id": "t1_g5hc2a8",
            "score": 3,
            "created_utc": 1600282482.0,
            "replies": []
        },
        {
            "body": "True i would rank the complete series as Naruto shippuden (until pain arc)> naruto og > naruto Shippuden (war arc).\n\nI have watched the series twice once when I was 15 then during quarantine 3 months ago.\n\nThen again people can have preferences but naruto part 2 was so much better for me especially the rinneangan reveal itachi backstory man I used to have goosebumps every naruto episode back then",
            "author": "upvote-me-ya-bish",
            "id": "g5hbspa",
            "parent_id": "t1_g5ha01v",
            "score": 27,
            "created_utc": 1600271312.0,
            "replies": [
                {
                    "body": "Everything after pain arc, was just a giant cluster fuck of power levels going through the fucking roof.  Might as well have just been dragon ball z at that point.",
                    "author": "cheese4352",
                    "id": "g5idy7g",
                    "parent_id": "t1_g5hbspa",
                    "score": 5,
                    "created_utc": 1600289192.0,
                    "replies": [
                        {
                            "body": "Nah i still love the war arc it had its moments and not for a second i felt bored(ofc i skipped through fillers and flashbacks). As a collective it didn't make much sense but ill be damned if gai 8gates, madara hashirama backstory, nagato/itachi meet with naruto, gaara and his dad reunion or practically any scene witth madara in it weren't some of the finest moments in anime i have ever seen.\n\nAs for it being dbz i dont get it sure at some times it was my jutsu beam vs your tailed beast bomb but it was always tactical like itachi figuring out core of planetary devastation or obito going through different dimensions to find sassuke.",
                            "author": "upvote-me-ya-bish",
                            "id": "g5k7m5t",
                            "parent_id": "t1_g5idy7g",
                            "score": 2,
                            "created_utc": 1600324202.0,
                            "replies": [
                                {
                                    "body": "Dragonball z in multiple regards.  Yes the giant beams and shit, but the very shift of the story itself and the tone shift.\n\n\nAliens and giant open field battles.  Everything just jumped thr shark.  8 gate gai was really awesome, but it jumped the shark as well.  It got too ridiculous.",
                                    "author": "cheese4352",
                                    "id": "g5kq8hg",
                                    "parent_id": "t1_g5k7m5t",
                                    "score": 1,
                                    "created_utc": 1600343200.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I started watching when I was 23, longer reply incoming",
            "author": null,
            "id": "g5ha6qh",
            "parent_id": "t1_g5ha01v",
            "score": 12,
            "created_utc": 1600270523.0,
            "replies": []
        },
        {
            "body": "I just rewatched OG, I still prefer it mainly because of the more grounded battles",
            "author": "McThije",
            "id": "g5i6vhi",
            "parent_id": "t1_g5ha01v",
            "score": 2,
            "created_utc": 1600286336.0,
            "replies": []
        },
        {
            "body": "1,000% agree",
            "author": null,
            "id": "g5j6ooe",
            "parent_id": "t1_g5j5vg8",
            "score": 1,
            "created_utc": 1600303181.0,
            "replies": []
        },
        {
            "body": "Agreed, part 1 is a fantastic story and is great, but God it moves so damn slow and is just all around boring sometimes. Shippuden, even for all its power creep and inconsistencies, is just 10x more interesting to me.",
            "author": "VanillaDylan",
            "id": "g5hamw1",
            "parent_id": "t1_g5h8wvk",
            "score": 17,
            "created_utc": 1600270742.0,
            "replies": []
        },
        {
            "body": "Lengthy fanboy reply incoming, side note my first time watching was at age 23 and I hadn’t watched a ton of anime before. \n\nI was hooked at the end of episode 1 when naruto heard iruka accept him and he summoned a forest of shadow clones to save him. Iruka had a big ass shuriken sticking out of his back and it gave the show a dark edge/art style that really resonated with me. It really felt like someone could get offed at any time. \n\nThis goes directly into naruto/sasuke rivalry and meeting kakashi, which you didn’t know what to think after letting the eraser prank get him. The bell test expanded the knowledge of the jutsu rules and kakashi’s skills as well as the skill gap naruto needs to overcome. \n\nThis goes directly into the land of waves arc, which set in stone how much I will always love the show. You get a feel for sasuke’s skills and get a morsel of information about narutos chakra capabilities. Zabuza’s appearance put real fear into the characters and I had no idea how they’d persevere. Kakashi’s reveal of the sharingan was awesome and sasuke’s obvious surprise at how he could even have one added a lot of mystery. Top 3 moment for me is naruto retrieving his headband leading to the teamwork with sasuke and the awesome shot of him peering through the demon wind shuriken. \n\nI could go on and on but to me, og naruto is dark, humorous at times, does a great job of world building and shows very interesting teamwork/strategy (shikamaru any scene, sasuke retrieval arc especially). The side characters were very interesting and relevant. Shippuden has the akatsuki which was extremely interesting but seems to drag its feet at times and I feel that it’s missing that element of teamwork and camaraderie that I loved from the original as well as the darker art style. It’s all preference and I’m biased. Naruto surprising people with overcoming all obstacles in the original was very satisfying to me as well. \n\nA bit of a ramble and not even half of what I could write but there’s some of the reasoning and thought process of why I love the original over shippuden and think it’s more rewatchable",
            "author": null,
            "id": "g5hbv7p",
            "parent_id": "t1_g5h8wvk",
            "score": 11,
            "created_utc": 1600271346.0,
            "replies": [
                {
                    "body": "Fair enough man I also didn't start watching any anime until like 5 years ago, started with Attack on Titan, a few others and eventually onto Naruto... Was my favorite show as a whole for quite a long time, until I started watching One Piece lol. I get what you're saying about the dark themes and whatnot, but I personally feel that it's a little contrived at times, like it takes itself too seriously... After all it's not truly grim and gruesome like some series, like AoT. Which is totally fine, it just kinda pulls me out from the immersion. You got a good point about the cameraderie thing, not as much of it in shippuden - it's the Naruto Sasuke show. Which I think is honestly where most of my enjoyment of the series comes from anyway, so that's probably where our different opinions reside",
                    "author": "clouds_over_asia",
                    "id": "g5hd4k0",
                    "parent_id": "t1_g5hbv7p",
                    "score": 3,
                    "created_utc": 1600271957.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "og naruto was way better",
            "author": "ausername434",
            "id": "g5h9svg",
            "parent_id": "t1_g5h8wvk",
            "score": 9,
            "created_utc": 1600270332.0,
            "replies": []
        },
        {
            "body": "But in just 92 ep? Isn't that way too cramped?",
            "author": "Minato_the_legend",
            "id": "g5jvbgo",
            "parent_id": "t1_g5iqn92",
            "score": 1,
            "created_utc": 1600315552.0,
            "replies": [
                {
                    "body": "Each episode duration is about 1-2 hours, some even reaching 3 hours. Can easily account for 500+ episodes of both Naruto and Naruto shippuden.",
                    "author": "lightninginstinct",
                    "id": "g5lqdai",
                    "parent_id": "t1_g5jvbgo",
                    "score": 2,
                    "created_utc": 1600361479.0,
                    "replies": [
                        {
                            "body": "Ahh that makes so much more sense. That's perfect. I'll check it out myself and recommend to friends too",
                            "author": "Minato_the_legend",
                            "id": "g5lzi8x",
                            "parent_id": "t1_g5lqdai",
                            "score": 2,
                            "created_utc": 1600365260.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "g5hii0a",
            "parent_id": "t1_g5h3cvi",
            "score": 24,
            "created_utc": 1600274570.0,
            "replies": [
                {
                    "body": "But as it sits right now, I as the reader(or watcher in terms of the anime) can't relate to him in anyway, shape or form. Nothing about his character translates well.",
                    "author": "infamusforever223",
                    "id": "g5hiso2",
                    "parent_id": "t1_g5hii0a",
                    "score": 15,
                    "created_utc": 1600274712.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "g5hjrh6",
                            "parent_id": "t1_g5hiso2",
                            "score": 18,
                            "created_utc": 1600275171.0,
                            "replies": [
                                {
                                    "body": "In Luffy's case, while he is very advantaged, he is extremely likable. The same goes for Ichigo, though he gets knocked on his ass a lot. Boruto is a character that is not only extremely talented, but also bratty, and it's a turn off.",
                                    "author": "infamusforever223",
                                    "id": "g5hkmt9",
                                    "parent_id": "t1_g5hjrh6",
                                    "score": 7,
                                    "created_utc": 1600275590.0,
                                    "replies": [
                                        {
                                            "body": "Maybe that's the point? Maybe you aren't supposed to empathize with Boruto. Maybe him being so opposite to his mother and father is part of the struggle he'll face in the future? Maybe he learns to be more like them, in their absence?",
                                            "author": "AlextheLyonnn",
                                            "id": "g5hpo7p",
                                            "parent_id": "t1_g5hkmt9",
                                            "score": 17,
                                            "created_utc": 1600278003.0,
                                            "replies": [
                                                {
                                                    "body": "It could be. I'm only explaining why I don't like Boruto and jumped off a long time ago. I don't think less of those that like it, but I gave up on it.",
                                                    "author": "infamusforever223",
                                                    "id": "g5hvx7t",
                                                    "parent_id": "t1_g5hpo7p",
                                                    "score": 3,
                                                    "created_utc": 1600281023.0,
                                                    "replies": [
                                                        {
                                                            "body": "I hate that little shit, too. Don't worry. But we're getting to see what Naruto would have been like if Minato and Kushina lived, I guess. Can't stand the show though.",
                                                            "author": "AlextheLyonnn",
                                                            "id": "g5hy9cy",
                                                            "parent_id": "t1_g5hvx7t",
                                                            "score": 3,
                                                            "created_utc": 1600282172.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "body": "Thats what I was thinking too. Both Boruto as the series and the character have insane potential to be amazing with all the things estabilished. Its just really, really, really badly executed, stupid, targeted at children and overall just a bad joke at best.",
                                                    "author": "Remedh",
                                                    "id": "g5ixbem",
                                                    "parent_id": "t1_g5hpo7p",
                                                    "score": 3,
                                                    "created_utc": 1600297941.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "Luffy grew up with bandits without even knowing he had parents and started discovering the world at 17 i think. thats the opposite of Boruto\n\nand Light from Death Note isnt relatable man",
                                    "author": "LilQuasar",
                                    "id": "g5iv2ae",
                                    "parent_id": "t1_g5hjrh6",
                                    "score": 3,
                                    "created_utc": 1600296685.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Yes you’re not supposed to relate to him, the point is for him to mature through loss",
                            "author": "Yourboyfibs",
                            "id": "g5ir8m8",
                            "parent_id": "t1_g5hiso2",
                            "score": 4,
                            "created_utc": 1600294724.0,
                            "replies": [
                                {
                                    "body": "That's great and all, but I feel something was lost in translation, because he's so uncompelling that I don't want to continue with the story and I don't care what happens to him. I only have a passersby interest in seeing what happens to the original cast, and that means, in my eyes, you have failed at storytelling, as you haven't engaged me, the reader.",
                                    "author": "infamusforever223",
                                    "id": "g5it2wc",
                                    "parent_id": "t1_g5ir8m8",
                                    "score": 1,
                                    "created_utc": 1600295593.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Agreed dude, the hustle Naruto went through which shaped his personality is what we fans love about the show. Whereas in Boruto it's like everyone's smart and can do whatever they wish to do.",
            "author": "heyitsmeniraj",
            "id": "g5h3pba",
            "parent_id": "t1_g5h3cvi",
            "score": 17,
            "created_utc": 1600267243.0,
            "replies": []
        },
        {
            "body": "oh the anime didnt even touch chaper 10 yet lol",
            "author": "Konoha__Shinobi",
            "id": "g5jqtjc",
            "parent_id": "t1_g5inh8u",
            "score": 6,
            "created_utc": 1600313287.0,
            "replies": []
        },
        {
            "body": "The same people who give Boruto unwarranted hate are the same people who complained that side characters didn't get any screen time, now that they are, they still complain. It's like they wanted the Chuunin Exams to happen in the first episode otherwise it's bad.\n\nI loved the slice of life at the beginning of the series, and I agree, it's not amazing but I love it. It's dark points are coming, (I'm not caught up in the manga but I think it's happening already).\n\nThey want it to be the exact same as Naruto, while at the same time complaining that it's the same.",
            "author": "Chalaka",
            "id": "g5h66gx",
            "parent_id": "t1_g5gx9zw",
            "score": 9,
            "created_utc": 1600268512.0,
            "replies": []
        },
        {
            "body": "Yeah, I mean could you really call Naruto a well crafted anime? I wouldn't, but I enjoy the hell out of it!",
            "author": "ElderlyPeanut",
            "id": "g5gz3xb",
            "parent_id": "t1_g5gx9zw",
            "score": 22,
            "created_utc": 1600264745.0,
            "replies": [
                {
                    "body": "Naruto, yes you could call it well crafted. Shippuden? Nah not at all.",
                    "author": "whatyouegg123",
                    "id": "g5gzxfp",
                    "parent_id": "t1_g5gz3xb",
                    "score": 31,
                    "created_utc": 1600265212.0,
                    "replies": [
                        {
                            "body": "I mean world building wise it’s absolutely fantastic. Only issue I have is Kaguya and anime pacing, but making anime out of cherished epics Always have pacing issues",
                            "author": "revmun",
                            "id": "g5h1fbn",
                            "parent_id": "t1_g5gzxfp",
                            "score": 26,
                            "created_utc": 1600266038.0,
                            "replies": [
                                {
                                    "body": "the war arc was shit writing, “uhhh we ran out of characters, let’s bring back every dead character”, also shippuden was just this wack ass sasuke hunt, despite them making sasuke a dislikeable character I enjoyed the show overall but it was terribly written",
                                    "author": "whatyouegg123",
                                    "id": "g5h9vd3",
                                    "parent_id": "t1_g5h1fbn",
                                    "score": -5,
                                    "created_utc": 1600270366.0,
                                    "replies": [
                                        {
                                            "body": "Fairly sure they introduced more characters and backstory in the war arc than any previous arcs. Before war arc we literally only knew the leaf village and it’s heroes. War arc introduced us to all the lackeys from all over the place, past Kages and their feuds, all the seven swordsmen, ginkaku and his brother, and more(remembering might duy and his gate progress. these were all touched upon before but they were fully developed in the war arc.",
                                            "author": "revmun",
                                            "id": "g5hdr45",
                                            "parent_id": "t1_g5h9vd3",
                                            "score": 8,
                                            "created_utc": 1600272263.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "We're all here, so we must have enjoyed it somewhat! But I agree. Naruto holds a place in my heart because of how long the series and characters have been in my life, not particularly because of the way it's crafted or paced. Anytime I see people complain about Boruto, they're usually things I tend to ignore or overlook while watching Naruto/Shippuden, but it's heresy to suggest that Boruto and Naruto are more alike as an anime series than fans will often want to admit.",
                    "author": "secret101",
                    "id": "g5h8ouy",
                    "parent_id": "t1_g5gz3xb",
                    "score": 7,
                    "created_utc": 1600269785.0,
                    "replies": [
                        {
                            "body": "My thought process was always \"The filler was backloaded in OG Naruto, and spaced throughout Shippuden. I so Boruto just has filler from the beginning. Whatever! It's still fun!\"",
                            "author": "ElderlyPeanut",
                            "id": "g5hdf7f",
                            "parent_id": "t1_g5h8ouy",
                            "score": 3,
                            "created_utc": 1600272100.0,
                            "replies": [
                                {
                                    "body": "I really enjoyed the starte filler of Boruto because I was utterly burnt out from the constant world-ending battle story arc that is the last few hundred episodes of Shippuden. \n\nSeeing the children of beloved characters and how those characters grew into adults is intriguing to me. I enjoy watching their growth, even if it's not all linear progression. Not all our beloved characters will become as strong as Naruto and Sasuke during all those years because everyone's journey is different and peacetime will definitely dull any of their senses after being constantly at war since birth.",
                                    "author": "secret101",
                                    "id": "g5hf5ai",
                                    "parent_id": "t1_g5hdf7f",
                                    "score": 5,
                                    "created_utc": 1600272945.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Boruto is not enjoyable for most of die hard Naruto fans. It would have done well for a standalone, but it had a garbage start to the series and got good too late. Not many fans have that much patience for a series with an unlikable character from the first chapter.",
                    "author": "Huhwtfbleh",
                    "id": "g5h0lvg",
                    "parent_id": "t1_g5gz3xb",
                    "score": 1,
                    "created_utc": 1600265592.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I (hope) think they’re talking about the anime",
            "author": "cj-the-man",
            "id": "g5ithqq",
            "parent_id": "t1_g5irdng",
            "score": 1,
            "created_utc": 1600295817.0,
            "replies": [
                {
                    "body": "Yeah obviously.",
                    "author": null,
                    "id": "g5ixe7b",
                    "parent_id": "t1_g5ithqq",
                    "score": 1,
                    "created_utc": 1600297984.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I like how Naruto and Sasuke did all the work but boruto gets the credit for finishing him off like that whole Rasengan wasn't naruto chakras",
            "author": null,
            "id": "g5ij0bg",
            "parent_id": "t1_g5h9dm0",
            "score": 1,
            "created_utc": 1600291209.0,
            "replies": [
                {
                    "body": "Fr though",
                    "author": "Blazeman0315",
                    "id": "g73an4f",
                    "parent_id": "t1_g5ij0bg",
                    "score": 1,
                    "created_utc": 1601405079.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "But wouldn't  they both have a similar effect?  Unless people are counting them getting the 6 paths abilities, but I don't.",
            "author": "Blazeman0315",
            "id": "g5h9vhu",
            "parent_id": "t1_g5h9dm0",
            "score": 0,
            "created_utc": 1600270368.0,
            "replies": [
                {
                    "body": "Idk bro chalk it up to a plot hole I guess, it was my only albeit loose explanation I could think of",
                    "author": "clouds_over_asia",
                    "id": "g5hbtrf",
                    "parent_id": "t1_g5h9vhu",
                    "score": 0,
                    "created_utc": 1600271326.0,
                    "replies": [
                        {
                            "body": "Ig",
                            "author": "Blazeman0315",
                            "id": "g5hcxay",
                            "parent_id": "t1_g5hbtrf",
                            "score": 1,
                            "created_utc": 1600271859.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Bruh just watch it. He isn’t as spoiled anymore",
            "author": "Wookkiepedia",
            "id": "g5gzhwg",
            "parent_id": "t1_g5gunql",
            "score": 6,
            "created_utc": 1600264965.0,
            "replies": [
                {
                    "body": "True that. He's definitely changed.",
                    "author": "singhsama_08",
                    "id": "g5hlzho",
                    "parent_id": "t1_g5gzhwg",
                    "score": 2,
                    "created_utc": 1600276234.0,
                    "replies": []
                },
                {
                    "body": "Ok.\n\nEdit:I said I would watch it...why the downvote?\nBut ok, that’s fine.",
                    "author": "Natsurixsayonika",
                    "id": "g5h3lr8",
                    "parent_id": "t1_g5gzhwg",
                    "score": -3,
                    "created_utc": 1600267192.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Lol my bad",
            "author": "prayul",
            "id": "g5i84lf",
            "parent_id": "t1_g5hal58",
            "score": 8,
            "created_utc": 1600286835.0,
            "replies": [
                {
                    "body": "Nah ur good I just had anxiety for a sec lol.",
                    "author": "return3",
                    "id": "g5iil81",
                    "parent_id": "t1_g5i84lf",
                    "score": 4,
                    "created_utc": 1600291042.0,
                    "replies": [
                        {
                            "body": "I'd like to say that tenten is the best character in the show.\nJust spitting out opinions no one cares about.",
                            "author": "AshenPlight",
                            "id": "g5jdpre",
                            "parent_id": "t1_g5iil81",
                            "score": 3,
                            "created_utc": 1600306916.0,
                            "replies": [
                                {
                                    "body": "ok lol.",
                                    "author": "return3",
                                    "id": "g5jfoaw",
                                    "parent_id": "t1_g5jdpre",
                                    "score": 2,
                                    "created_utc": 1600307816.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yeah it does I didn't notice anything missing except filler episodes it doesn't cut all the flashbacks just pretty much only plays them the first time not 3 times per episode",
            "author": "SmoothOctopus",
            "id": "g5jxjv2",
            "parent_id": "t1_g5jut1n",
            "score": 2,
            "created_utc": 1600316734.0,
            "replies": []
        },
        {
            "body": "Just skip filler",
            "author": "Sasuke-Sarutobi",
            "id": "g5ibwvk",
            "parent_id": "t1_g5hcece",
            "score": 12,
            "created_utc": 1600288352.0,
            "replies": []
        },
        {
            "body": "Everything after pain arc, was just a giant cluster fuck of power levels going through the fucking roof.  Might as well have just been dragon ball z at that point.",
            "author": "cheese4352",
            "id": "g5idy7g",
            "parent_id": "t1_g5hbspa",
            "score": 5,
            "created_utc": 1600289192.0,
            "replies": [
                {
                    "body": "Nah i still love the war arc it had its moments and not for a second i felt bored(ofc i skipped through fillers and flashbacks). As a collective it didn't make much sense but ill be damned if gai 8gates, madara hashirama backstory, nagato/itachi meet with naruto, gaara and his dad reunion or practically any scene witth madara in it weren't some of the finest moments in anime i have ever seen.\n\nAs for it being dbz i dont get it sure at some times it was my jutsu beam vs your tailed beast bomb but it was always tactical like itachi figuring out core of planetary devastation or obito going through different dimensions to find sassuke.",
                    "author": "upvote-me-ya-bish",
                    "id": "g5k7m5t",
                    "parent_id": "t1_g5idy7g",
                    "score": 2,
                    "created_utc": 1600324202.0,
                    "replies": [
                        {
                            "body": "Dragonball z in multiple regards.  Yes the giant beams and shit, but the very shift of the story itself and the tone shift.\n\n\nAliens and giant open field battles.  Everything just jumped thr shark.  8 gate gai was really awesome, but it jumped the shark as well.  It got too ridiculous.",
                            "author": "cheese4352",
                            "id": "g5kq8hg",
                            "parent_id": "t1_g5k7m5t",
                            "score": 1,
                            "created_utc": 1600343200.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Fair enough man I also didn't start watching any anime until like 5 years ago, started with Attack on Titan, a few others and eventually onto Naruto... Was my favorite show as a whole for quite a long time, until I started watching One Piece lol. I get what you're saying about the dark themes and whatnot, but I personally feel that it's a little contrived at times, like it takes itself too seriously... After all it's not truly grim and gruesome like some series, like AoT. Which is totally fine, it just kinda pulls me out from the immersion. You got a good point about the cameraderie thing, not as much of it in shippuden - it's the Naruto Sasuke show. Which I think is honestly where most of my enjoyment of the series comes from anyway, so that's probably where our different opinions reside",
            "author": "clouds_over_asia",
            "id": "g5hd4k0",
            "parent_id": "t1_g5hbv7p",
            "score": 3,
            "created_utc": 1600271957.0,
            "replies": []
        },
        {
            "body": "Each episode duration is about 1-2 hours, some even reaching 3 hours. Can easily account for 500+ episodes of both Naruto and Naruto shippuden.",
            "author": "lightninginstinct",
            "id": "g5lqdai",
            "parent_id": "t1_g5jvbgo",
            "score": 2,
            "created_utc": 1600361479.0,
            "replies": [
                {
                    "body": "Ahh that makes so much more sense. That's perfect. I'll check it out myself and recommend to friends too",
                    "author": "Minato_the_legend",
                    "id": "g5lzi8x",
                    "parent_id": "t1_g5lqdai",
                    "score": 2,
                    "created_utc": 1600365260.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "But as it sits right now, I as the reader(or watcher in terms of the anime) can't relate to him in anyway, shape or form. Nothing about his character translates well.",
            "author": "infamusforever223",
            "id": "g5hiso2",
            "parent_id": "t1_g5hii0a",
            "score": 15,
            "created_utc": 1600274712.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "g5hjrh6",
                    "parent_id": "t1_g5hiso2",
                    "score": 18,
                    "created_utc": 1600275171.0,
                    "replies": [
                        {
                            "body": "In Luffy's case, while he is very advantaged, he is extremely likable. The same goes for Ichigo, though he gets knocked on his ass a lot. Boruto is a character that is not only extremely talented, but also bratty, and it's a turn off.",
                            "author": "infamusforever223",
                            "id": "g5hkmt9",
                            "parent_id": "t1_g5hjrh6",
                            "score": 7,
                            "created_utc": 1600275590.0,
                            "replies": [
                                {
                                    "body": "Maybe that's the point? Maybe you aren't supposed to empathize with Boruto. Maybe him being so opposite to his mother and father is part of the struggle he'll face in the future? Maybe he learns to be more like them, in their absence?",
                                    "author": "AlextheLyonnn",
                                    "id": "g5hpo7p",
                                    "parent_id": "t1_g5hkmt9",
                                    "score": 17,
                                    "created_utc": 1600278003.0,
                                    "replies": [
                                        {
                                            "body": "It could be. I'm only explaining why I don't like Boruto and jumped off a long time ago. I don't think less of those that like it, but I gave up on it.",
                                            "author": "infamusforever223",
                                            "id": "g5hvx7t",
                                            "parent_id": "t1_g5hpo7p",
                                            "score": 3,
                                            "created_utc": 1600281023.0,
                                            "replies": [
                                                {
                                                    "body": "I hate that little shit, too. Don't worry. But we're getting to see what Naruto would have been like if Minato and Kushina lived, I guess. Can't stand the show though.",
                                                    "author": "AlextheLyonnn",
                                                    "id": "g5hy9cy",
                                                    "parent_id": "t1_g5hvx7t",
                                                    "score": 3,
                                                    "created_utc": 1600282172.0,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "body": "Thats what I was thinking too. Both Boruto as the series and the character have insane potential to be amazing with all the things estabilished. Its just really, really, really badly executed, stupid, targeted at children and overall just a bad joke at best.",
                                            "author": "Remedh",
                                            "id": "g5ixbem",
                                            "parent_id": "t1_g5hpo7p",
                                            "score": 3,
                                            "created_utc": 1600297941.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Luffy grew up with bandits without even knowing he had parents and started discovering the world at 17 i think. thats the opposite of Boruto\n\nand Light from Death Note isnt relatable man",
                            "author": "LilQuasar",
                            "id": "g5iv2ae",
                            "parent_id": "t1_g5hjrh6",
                            "score": 3,
                            "created_utc": 1600296685.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Yes you’re not supposed to relate to him, the point is for him to mature through loss",
                    "author": "Yourboyfibs",
                    "id": "g5ir8m8",
                    "parent_id": "t1_g5hiso2",
                    "score": 4,
                    "created_utc": 1600294724.0,
                    "replies": [
                        {
                            "body": "That's great and all, but I feel something was lost in translation, because he's so uncompelling that I don't want to continue with the story and I don't care what happens to him. I only have a passersby interest in seeing what happens to the original cast, and that means, in my eyes, you have failed at storytelling, as you haven't engaged me, the reader.",
                            "author": "infamusforever223",
                            "id": "g5it2wc",
                            "parent_id": "t1_g5ir8m8",
                            "score": 1,
                            "created_utc": 1600295593.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Naruto, yes you could call it well crafted. Shippuden? Nah not at all.",
            "author": "whatyouegg123",
            "id": "g5gzxfp",
            "parent_id": "t1_g5gz3xb",
            "score": 31,
            "created_utc": 1600265212.0,
            "replies": [
                {
                    "body": "I mean world building wise it’s absolutely fantastic. Only issue I have is Kaguya and anime pacing, but making anime out of cherished epics Always have pacing issues",
                    "author": "revmun",
                    "id": "g5h1fbn",
                    "parent_id": "t1_g5gzxfp",
                    "score": 26,
                    "created_utc": 1600266038.0,
                    "replies": [
                        {
                            "body": "the war arc was shit writing, “uhhh we ran out of characters, let’s bring back every dead character”, also shippuden was just this wack ass sasuke hunt, despite them making sasuke a dislikeable character I enjoyed the show overall but it was terribly written",
                            "author": "whatyouegg123",
                            "id": "g5h9vd3",
                            "parent_id": "t1_g5h1fbn",
                            "score": -5,
                            "created_utc": 1600270366.0,
                            "replies": [
                                {
                                    "body": "Fairly sure they introduced more characters and backstory in the war arc than any previous arcs. Before war arc we literally only knew the leaf village and it’s heroes. War arc introduced us to all the lackeys from all over the place, past Kages and their feuds, all the seven swordsmen, ginkaku and his brother, and more(remembering might duy and his gate progress. these were all touched upon before but they were fully developed in the war arc.",
                                    "author": "revmun",
                                    "id": "g5hdr45",
                                    "parent_id": "t1_g5h9vd3",
                                    "score": 8,
                                    "created_utc": 1600272263.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "We're all here, so we must have enjoyed it somewhat! But I agree. Naruto holds a place in my heart because of how long the series and characters have been in my life, not particularly because of the way it's crafted or paced. Anytime I see people complain about Boruto, they're usually things I tend to ignore or overlook while watching Naruto/Shippuden, but it's heresy to suggest that Boruto and Naruto are more alike as an anime series than fans will often want to admit.",
            "author": "secret101",
            "id": "g5h8ouy",
            "parent_id": "t1_g5gz3xb",
            "score": 7,
            "created_utc": 1600269785.0,
            "replies": [
                {
                    "body": "My thought process was always \"The filler was backloaded in OG Naruto, and spaced throughout Shippuden. I so Boruto just has filler from the beginning. Whatever! It's still fun!\"",
                    "author": "ElderlyPeanut",
                    "id": "g5hdf7f",
                    "parent_id": "t1_g5h8ouy",
                    "score": 3,
                    "created_utc": 1600272100.0,
                    "replies": [
                        {
                            "body": "I really enjoyed the starte filler of Boruto because I was utterly burnt out from the constant world-ending battle story arc that is the last few hundred episodes of Shippuden. \n\nSeeing the children of beloved characters and how those characters grew into adults is intriguing to me. I enjoy watching their growth, even if it's not all linear progression. Not all our beloved characters will become as strong as Naruto and Sasuke during all those years because everyone's journey is different and peacetime will definitely dull any of their senses after being constantly at war since birth.",
                            "author": "secret101",
                            "id": "g5hf5ai",
                            "parent_id": "t1_g5hdf7f",
                            "score": 5,
                            "created_utc": 1600272945.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Boruto is not enjoyable for most of die hard Naruto fans. It would have done well for a standalone, but it had a garbage start to the series and got good too late. Not many fans have that much patience for a series with an unlikable character from the first chapter.",
            "author": "Huhwtfbleh",
            "id": "g5h0lvg",
            "parent_id": "t1_g5gz3xb",
            "score": 1,
            "created_utc": 1600265592.0,
            "replies": []
        },
        {
            "body": "Yeah obviously.",
            "author": null,
            "id": "g5ixe7b",
            "parent_id": "t1_g5ithqq",
            "score": 1,
            "created_utc": 1600297984.0,
            "replies": []
        },
        {
            "body": "Fr though",
            "author": "Blazeman0315",
            "id": "g73an4f",
            "parent_id": "t1_g5ij0bg",
            "score": 1,
            "created_utc": 1601405079.0,
            "replies": []
        },
        {
            "body": "Idk bro chalk it up to a plot hole I guess, it was my only albeit loose explanation I could think of",
            "author": "clouds_over_asia",
            "id": "g5hbtrf",
            "parent_id": "t1_g5h9vhu",
            "score": 0,
            "created_utc": 1600271326.0,
            "replies": [
                {
                    "body": "Ig",
                    "author": "Blazeman0315",
                    "id": "g5hcxay",
                    "parent_id": "t1_g5hbtrf",
                    "score": 1,
                    "created_utc": 1600271859.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "True that. He's definitely changed.",
            "author": "singhsama_08",
            "id": "g5hlzho",
            "parent_id": "t1_g5gzhwg",
            "score": 2,
            "created_utc": 1600276234.0,
            "replies": []
        },
        {
            "body": "Ok.\n\nEdit:I said I would watch it...why the downvote?\nBut ok, that’s fine.",
            "author": "Natsurixsayonika",
            "id": "g5h3lr8",
            "parent_id": "t1_g5gzhwg",
            "score": -3,
            "created_utc": 1600267192.0,
            "replies": []
        },
        {
            "body": "Nah ur good I just had anxiety for a sec lol.",
            "author": "return3",
            "id": "g5iil81",
            "parent_id": "t1_g5i84lf",
            "score": 4,
            "created_utc": 1600291042.0,
            "replies": [
                {
                    "body": "I'd like to say that tenten is the best character in the show.\nJust spitting out opinions no one cares about.",
                    "author": "AshenPlight",
                    "id": "g5jdpre",
                    "parent_id": "t1_g5iil81",
                    "score": 3,
                    "created_utc": 1600306916.0,
                    "replies": [
                        {
                            "body": "ok lol.",
                            "author": "return3",
                            "id": "g5jfoaw",
                            "parent_id": "t1_g5jdpre",
                            "score": 2,
                            "created_utc": 1600307816.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Nah i still love the war arc it had its moments and not for a second i felt bored(ofc i skipped through fillers and flashbacks). As a collective it didn't make much sense but ill be damned if gai 8gates, madara hashirama backstory, nagato/itachi meet with naruto, gaara and his dad reunion or practically any scene witth madara in it weren't some of the finest moments in anime i have ever seen.\n\nAs for it being dbz i dont get it sure at some times it was my jutsu beam vs your tailed beast bomb but it was always tactical like itachi figuring out core of planetary devastation or obito going through different dimensions to find sassuke.",
            "author": "upvote-me-ya-bish",
            "id": "g5k7m5t",
            "parent_id": "t1_g5idy7g",
            "score": 2,
            "created_utc": 1600324202.0,
            "replies": [
                {
                    "body": "Dragonball z in multiple regards.  Yes the giant beams and shit, but the very shift of the story itself and the tone shift.\n\n\nAliens and giant open field battles.  Everything just jumped thr shark.  8 gate gai was really awesome, but it jumped the shark as well.  It got too ridiculous.",
                    "author": "cheese4352",
                    "id": "g5kq8hg",
                    "parent_id": "t1_g5k7m5t",
                    "score": 1,
                    "created_utc": 1600343200.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Ahh that makes so much more sense. That's perfect. I'll check it out myself and recommend to friends too",
            "author": "Minato_the_legend",
            "id": "g5lzi8x",
            "parent_id": "t1_g5lqdai",
            "score": 2,
            "created_utc": 1600365260.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "g5hjrh6",
            "parent_id": "t1_g5hiso2",
            "score": 18,
            "created_utc": 1600275171.0,
            "replies": [
                {
                    "body": "In Luffy's case, while he is very advantaged, he is extremely likable. The same goes for Ichigo, though he gets knocked on his ass a lot. Boruto is a character that is not only extremely talented, but also bratty, and it's a turn off.",
                    "author": "infamusforever223",
                    "id": "g5hkmt9",
                    "parent_id": "t1_g5hjrh6",
                    "score": 7,
                    "created_utc": 1600275590.0,
                    "replies": [
                        {
                            "body": "Maybe that's the point? Maybe you aren't supposed to empathize with Boruto. Maybe him being so opposite to his mother and father is part of the struggle he'll face in the future? Maybe he learns to be more like them, in their absence?",
                            "author": "AlextheLyonnn",
                            "id": "g5hpo7p",
                            "parent_id": "t1_g5hkmt9",
                            "score": 17,
                            "created_utc": 1600278003.0,
                            "replies": [
                                {
                                    "body": "It could be. I'm only explaining why I don't like Boruto and jumped off a long time ago. I don't think less of those that like it, but I gave up on it.",
                                    "author": "infamusforever223",
                                    "id": "g5hvx7t",
                                    "parent_id": "t1_g5hpo7p",
                                    "score": 3,
                                    "created_utc": 1600281023.0,
                                    "replies": [
                                        {
                                            "body": "I hate that little shit, too. Don't worry. But we're getting to see what Naruto would have been like if Minato and Kushina lived, I guess. Can't stand the show though.",
                                            "author": "AlextheLyonnn",
                                            "id": "g5hy9cy",
                                            "parent_id": "t1_g5hvx7t",
                                            "score": 3,
                                            "created_utc": 1600282172.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "Thats what I was thinking too. Both Boruto as the series and the character have insane potential to be amazing with all the things estabilished. Its just really, really, really badly executed, stupid, targeted at children and overall just a bad joke at best.",
                                    "author": "Remedh",
                                    "id": "g5ixbem",
                                    "parent_id": "t1_g5hpo7p",
                                    "score": 3,
                                    "created_utc": 1600297941.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Luffy grew up with bandits without even knowing he had parents and started discovering the world at 17 i think. thats the opposite of Boruto\n\nand Light from Death Note isnt relatable man",
                    "author": "LilQuasar",
                    "id": "g5iv2ae",
                    "parent_id": "t1_g5hjrh6",
                    "score": 3,
                    "created_utc": 1600296685.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yes you’re not supposed to relate to him, the point is for him to mature through loss",
            "author": "Yourboyfibs",
            "id": "g5ir8m8",
            "parent_id": "t1_g5hiso2",
            "score": 4,
            "created_utc": 1600294724.0,
            "replies": [
                {
                    "body": "That's great and all, but I feel something was lost in translation, because he's so uncompelling that I don't want to continue with the story and I don't care what happens to him. I only have a passersby interest in seeing what happens to the original cast, and that means, in my eyes, you have failed at storytelling, as you haven't engaged me, the reader.",
                    "author": "infamusforever223",
                    "id": "g5it2wc",
                    "parent_id": "t1_g5ir8m8",
                    "score": 1,
                    "created_utc": 1600295593.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I mean world building wise it’s absolutely fantastic. Only issue I have is Kaguya and anime pacing, but making anime out of cherished epics Always have pacing issues",
            "author": "revmun",
            "id": "g5h1fbn",
            "parent_id": "t1_g5gzxfp",
            "score": 26,
            "created_utc": 1600266038.0,
            "replies": [
                {
                    "body": "the war arc was shit writing, “uhhh we ran out of characters, let’s bring back every dead character”, also shippuden was just this wack ass sasuke hunt, despite them making sasuke a dislikeable character I enjoyed the show overall but it was terribly written",
                    "author": "whatyouegg123",
                    "id": "g5h9vd3",
                    "parent_id": "t1_g5h1fbn",
                    "score": -5,
                    "created_utc": 1600270366.0,
                    "replies": [
                        {
                            "body": "Fairly sure they introduced more characters and backstory in the war arc than any previous arcs. Before war arc we literally only knew the leaf village and it’s heroes. War arc introduced us to all the lackeys from all over the place, past Kages and their feuds, all the seven swordsmen, ginkaku and his brother, and more(remembering might duy and his gate progress. these were all touched upon before but they were fully developed in the war arc.",
                            "author": "revmun",
                            "id": "g5hdr45",
                            "parent_id": "t1_g5h9vd3",
                            "score": 8,
                            "created_utc": 1600272263.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "My thought process was always \"The filler was backloaded in OG Naruto, and spaced throughout Shippuden. I so Boruto just has filler from the beginning. Whatever! It's still fun!\"",
            "author": "ElderlyPeanut",
            "id": "g5hdf7f",
            "parent_id": "t1_g5h8ouy",
            "score": 3,
            "created_utc": 1600272100.0,
            "replies": [
                {
                    "body": "I really enjoyed the starte filler of Boruto because I was utterly burnt out from the constant world-ending battle story arc that is the last few hundred episodes of Shippuden. \n\nSeeing the children of beloved characters and how those characters grew into adults is intriguing to me. I enjoy watching their growth, even if it's not all linear progression. Not all our beloved characters will become as strong as Naruto and Sasuke during all those years because everyone's journey is different and peacetime will definitely dull any of their senses after being constantly at war since birth.",
                    "author": "secret101",
                    "id": "g5hf5ai",
                    "parent_id": "t1_g5hdf7f",
                    "score": 5,
                    "created_utc": 1600272945.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Ig",
            "author": "Blazeman0315",
            "id": "g5hcxay",
            "parent_id": "t1_g5hbtrf",
            "score": 1,
            "created_utc": 1600271859.0,
            "replies": []
        },
        {
            "body": "I'd like to say that tenten is the best character in the show.\nJust spitting out opinions no one cares about.",
            "author": "AshenPlight",
            "id": "g5jdpre",
            "parent_id": "t1_g5iil81",
            "score": 3,
            "created_utc": 1600306916.0,
            "replies": [
                {
                    "body": "ok lol.",
                    "author": "return3",
                    "id": "g5jfoaw",
                    "parent_id": "t1_g5jdpre",
                    "score": 2,
                    "created_utc": 1600307816.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Dragonball z in multiple regards.  Yes the giant beams and shit, but the very shift of the story itself and the tone shift.\n\n\nAliens and giant open field battles.  Everything just jumped thr shark.  8 gate gai was really awesome, but it jumped the shark as well.  It got too ridiculous.",
            "author": "cheese4352",
            "id": "g5kq8hg",
            "parent_id": "t1_g5k7m5t",
            "score": 1,
            "created_utc": 1600343200.0,
            "replies": []
        },
        {
            "body": "In Luffy's case, while he is very advantaged, he is extremely likable. The same goes for Ichigo, though he gets knocked on his ass a lot. Boruto is a character that is not only extremely talented, but also bratty, and it's a turn off.",
            "author": "infamusforever223",
            "id": "g5hkmt9",
            "parent_id": "t1_g5hjrh6",
            "score": 7,
            "created_utc": 1600275590.0,
            "replies": [
                {
                    "body": "Maybe that's the point? Maybe you aren't supposed to empathize with Boruto. Maybe him being so opposite to his mother and father is part of the struggle he'll face in the future? Maybe he learns to be more like them, in their absence?",
                    "author": "AlextheLyonnn",
                    "id": "g5hpo7p",
                    "parent_id": "t1_g5hkmt9",
                    "score": 17,
                    "created_utc": 1600278003.0,
                    "replies": [
                        {
                            "body": "It could be. I'm only explaining why I don't like Boruto and jumped off a long time ago. I don't think less of those that like it, but I gave up on it.",
                            "author": "infamusforever223",
                            "id": "g5hvx7t",
                            "parent_id": "t1_g5hpo7p",
                            "score": 3,
                            "created_utc": 1600281023.0,
                            "replies": [
                                {
                                    "body": "I hate that little shit, too. Don't worry. But we're getting to see what Naruto would have been like if Minato and Kushina lived, I guess. Can't stand the show though.",
                                    "author": "AlextheLyonnn",
                                    "id": "g5hy9cy",
                                    "parent_id": "t1_g5hvx7t",
                                    "score": 3,
                                    "created_utc": 1600282172.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Thats what I was thinking too. Both Boruto as the series and the character have insane potential to be amazing with all the things estabilished. Its just really, really, really badly executed, stupid, targeted at children and overall just a bad joke at best.",
                            "author": "Remedh",
                            "id": "g5ixbem",
                            "parent_id": "t1_g5hpo7p",
                            "score": 3,
                            "created_utc": 1600297941.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Luffy grew up with bandits without even knowing he had parents and started discovering the world at 17 i think. thats the opposite of Boruto\n\nand Light from Death Note isnt relatable man",
            "author": "LilQuasar",
            "id": "g5iv2ae",
            "parent_id": "t1_g5hjrh6",
            "score": 3,
            "created_utc": 1600296685.0,
            "replies": []
        },
        {
            "body": "That's great and all, but I feel something was lost in translation, because he's so uncompelling that I don't want to continue with the story and I don't care what happens to him. I only have a passersby interest in seeing what happens to the original cast, and that means, in my eyes, you have failed at storytelling, as you haven't engaged me, the reader.",
            "author": "infamusforever223",
            "id": "g5it2wc",
            "parent_id": "t1_g5ir8m8",
            "score": 1,
            "created_utc": 1600295593.0,
            "replies": []
        },
        {
            "body": "the war arc was shit writing, “uhhh we ran out of characters, let’s bring back every dead character”, also shippuden was just this wack ass sasuke hunt, despite them making sasuke a dislikeable character I enjoyed the show overall but it was terribly written",
            "author": "whatyouegg123",
            "id": "g5h9vd3",
            "parent_id": "t1_g5h1fbn",
            "score": -5,
            "created_utc": 1600270366.0,
            "replies": [
                {
                    "body": "Fairly sure they introduced more characters and backstory in the war arc than any previous arcs. Before war arc we literally only knew the leaf village and it’s heroes. War arc introduced us to all the lackeys from all over the place, past Kages and their feuds, all the seven swordsmen, ginkaku and his brother, and more(remembering might duy and his gate progress. these were all touched upon before but they were fully developed in the war arc.",
                    "author": "revmun",
                    "id": "g5hdr45",
                    "parent_id": "t1_g5h9vd3",
                    "score": 8,
                    "created_utc": 1600272263.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I really enjoyed the starte filler of Boruto because I was utterly burnt out from the constant world-ending battle story arc that is the last few hundred episodes of Shippuden. \n\nSeeing the children of beloved characters and how those characters grew into adults is intriguing to me. I enjoy watching their growth, even if it's not all linear progression. Not all our beloved characters will become as strong as Naruto and Sasuke during all those years because everyone's journey is different and peacetime will definitely dull any of their senses after being constantly at war since birth.",
            "author": "secret101",
            "id": "g5hf5ai",
            "parent_id": "t1_g5hdf7f",
            "score": 5,
            "created_utc": 1600272945.0,
            "replies": []
        },
        {
            "body": "ok lol.",
            "author": "return3",
            "id": "g5jfoaw",
            "parent_id": "t1_g5jdpre",
            "score": 2,
            "created_utc": 1600307816.0,
            "replies": []
        },
        {
            "body": "Maybe that's the point? Maybe you aren't supposed to empathize with Boruto. Maybe him being so opposite to his mother and father is part of the struggle he'll face in the future? Maybe he learns to be more like them, in their absence?",
            "author": "AlextheLyonnn",
            "id": "g5hpo7p",
            "parent_id": "t1_g5hkmt9",
            "score": 17,
            "created_utc": 1600278003.0,
            "replies": [
                {
                    "body": "It could be. I'm only explaining why I don't like Boruto and jumped off a long time ago. I don't think less of those that like it, but I gave up on it.",
                    "author": "infamusforever223",
                    "id": "g5hvx7t",
                    "parent_id": "t1_g5hpo7p",
                    "score": 3,
                    "created_utc": 1600281023.0,
                    "replies": [
                        {
                            "body": "I hate that little shit, too. Don't worry. But we're getting to see what Naruto would have been like if Minato and Kushina lived, I guess. Can't stand the show though.",
                            "author": "AlextheLyonnn",
                            "id": "g5hy9cy",
                            "parent_id": "t1_g5hvx7t",
                            "score": 3,
                            "created_utc": 1600282172.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Thats what I was thinking too. Both Boruto as the series and the character have insane potential to be amazing with all the things estabilished. Its just really, really, really badly executed, stupid, targeted at children and overall just a bad joke at best.",
                    "author": "Remedh",
                    "id": "g5ixbem",
                    "parent_id": "t1_g5hpo7p",
                    "score": 3,
                    "created_utc": 1600297941.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Fairly sure they introduced more characters and backstory in the war arc than any previous arcs. Before war arc we literally only knew the leaf village and it’s heroes. War arc introduced us to all the lackeys from all over the place, past Kages and their feuds, all the seven swordsmen, ginkaku and his brother, and more(remembering might duy and his gate progress. these were all touched upon before but they were fully developed in the war arc.",
            "author": "revmun",
            "id": "g5hdr45",
            "parent_id": "t1_g5h9vd3",
            "score": 8,
            "created_utc": 1600272263.0,
            "replies": []
        },
        {
            "body": "It could be. I'm only explaining why I don't like Boruto and jumped off a long time ago. I don't think less of those that like it, but I gave up on it.",
            "author": "infamusforever223",
            "id": "g5hvx7t",
            "parent_id": "t1_g5hpo7p",
            "score": 3,
            "created_utc": 1600281023.0,
            "replies": [
                {
                    "body": "I hate that little shit, too. Don't worry. But we're getting to see what Naruto would have been like if Minato and Kushina lived, I guess. Can't stand the show though.",
                    "author": "AlextheLyonnn",
                    "id": "g5hy9cy",
                    "parent_id": "t1_g5hvx7t",
                    "score": 3,
                    "created_utc": 1600282172.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Thats what I was thinking too. Both Boruto as the series and the character have insane potential to be amazing with all the things estabilished. Its just really, really, really badly executed, stupid, targeted at children and overall just a bad joke at best.",
            "author": "Remedh",
            "id": "g5ixbem",
            "parent_id": "t1_g5hpo7p",
            "score": 3,
            "created_utc": 1600297941.0,
            "replies": []
        },
        {
            "body": "I hate that little shit, too. Don't worry. But we're getting to see what Naruto would have been like if Minato and Kushina lived, I guess. Can't stand the show though.",
            "author": "AlextheLyonnn",
            "id": "g5hy9cy",
            "parent_id": "t1_g5hvx7t",
            "score": 3,
            "created_utc": 1600282172.0,
            "replies": []
        }
    ]
}