{
    "title": "Was given fake money",
    "post_id": "deu7oy",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/deu7oy/was_given_fake_money/",
    "author": "candygirl95",
    "body": "Hey everyone,\n\nI was given motion picture money in lieu of an allowance. I won't really get into this but I'm creating this post as a warning to other girls out there - in my experience, scammers are rare but wow when it happens it feels so violating. I've never been given fake money before and I'm beyond pissed.\n\nSomeone seeming nice does not mean they won't scam you.  Getting along with someone does not mean they won't scam you. This guy and I talked for about 5 hours at dinner - I thought he was a good person. We had chemistry. We talked about things like traveling, volunteering, family, BEING SCAMMED ON SA lol. This evidently is not enough to be sure a person won't scam you.\n\nI know it's uncomfortable, but get the money as soon as you walk through the door of the house/hotel room/wherever the good stuff is going down - as soon as you climb in the back seat of the car, hey, I don't judge.  Get the money and CHECK IT. I never thought about this before. I heard people say to but I always dismissed it because I'm smart right? I thought I could detect a scammer but here I am with 600 in Hollywood money but no stores to spend it in.\n\nIf girls in LA/Orange County area want to private message me I can give you his details so you can avoid him to the best of your ability.\n\nStay safe out there everyone",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/deu7oy/was_given_fake_money/",
    "score": 146,
    "upvote_ratio": 0.97,
    "created_utc": 1570503756.0,
    "num_comments": 91,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "I also had another very interesting situation a while back.\nI went to visit him in his hotel room. He gave me the gift, we spent some time together, then I went home.\nThe next morning, I got a call from police asking me to come down because this man had called them after I left and reported that I stole his money... they told me he was frantic and obviously distressed. \n\nTurns out the guy had blown his rent money on me, and was having buyers’ remorse!\n\nI didn’t want any trouble,  so I told the cops I would gladly give it back… No amount of money is worth all the stress.\n\nBut this cop was so cool… He said to me “did he ask you to spend the time with him?” I said “yes, absolutely... everything was agreed to beforehand”... to which the cop replied, very adamantly and protectively of me “You earned that money… You’re not giving it back“!!!\n\nNever saw the guy again, but I can’t imagine that the cops were very nice to him after that!!",
            "author": "RealEarthAngel",
            "id": "f37aswa",
            "parent_id": "t3_deu7oy",
            "score": 17,
            "created_utc": 1570723617.0,
            "replies": [
                {
                    "body": "Wow!! You lucked out there! That's fucking awesome.",
                    "author": "kimchi_Queen",
                    "id": "f6bbnsv",
                    "parent_id": "t1_f37aswa",
                    "score": 3,
                    "created_utc": 1572771509.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "OP quick question, are these bills printed on standard paper, polymer or are they actually cotton paper like the real stuff? That's something to always notice, real money has a \"feel\" to it, not only the cotton but the printing is slightly raised/textured as well.",
            "author": "sdaddy305",
            "id": "f2z2xtd",
            "parent_id": "t3_deu7oy",
            "score": 13,
            "created_utc": 1570504882.0,
            "replies": [
                {
                    "body": "No, it feels incredibly fake. If I had touched it before taking it I would have known but it was in an envelope. He even really quickly counted it out before me but was clearly banking on me not looking too hard and it worked.",
                    "author": "candygirl95",
                    "id": "f2z31ut",
                    "parent_id": "t1_f2z2xtd",
                    "score": 43,
                    "created_utc": 1570504972.0,
                    "replies": [
                        {
                            "body": "Fair, I figured these are most likely regular pulp-paper so they'd feel super fake like you said.\n\nAnd yeah, it sounds like he's done this before unfortunately.",
                            "author": "sdaddy305",
                            "id": "f2z3599",
                            "parent_id": "t1_f2z31ut",
                            "score": 12,
                            "created_utc": 1570505051.0,
                            "replies": [
                                {
                                    "body": "Would be interesting to know if giving it to you as real cash constituted knowingly using counterfeit money",
                                    "author": "pinotandsugar",
                                    "id": "f2zdw8h",
                                    "parent_id": "t1_f2z3599",
                                    "score": 3,
                                    "created_utc": 1570516633.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "god. The mental dissonance to treat you so respectfully during dinner, to be totally normal then make an attempt to calm your nerves by counting it in front of you.... then expecting sex. I'm so disgusted by this person. Sounds like he's a psychopath. I could never keep that lie up.",
                            "author": null,
                            "id": "f2ztzgv",
                            "parent_id": "t1_f2z31ut",
                            "score": 8,
                            "created_utc": 1570538422.0,
                            "replies": [
                                {
                                    "body": "That was the part I just could not conceive of when it happened to me… Truly twisted. How do you look someone in the face knowing you’re about to do something so heinous??\nI don’t know how he felt afterwards, but I can only imagine that if he could actually go through with such a violating act, that he must not have any qualms about it… And that is at least sociopathic if not psychopathic.",
                                    "author": "RealEarthAngel",
                                    "id": "f378u1m",
                                    "parent_id": "t1_f2ztzgv",
                                    "score": 1,
                                    "created_utc": 1570722889.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Some sugar babies  carry a counterfeit pen. When you get your allowance don't be afraid to take your time examining and counting the money yourself. Please make sure to vet and check the the background of these men to make sure they are who they say they are. I highly doubt a real man of means will give out fake money. It's against the law.",
            "author": "liliflower85",
            "id": "f302c2y",
            "parent_id": "t3_deu7oy",
            "score": 10,
            "created_utc": 1570544778.0,
            "replies": [
                {
                    "body": "FYI:  Counterfeit pens don't work if the fake money is sprayed with hair spray or is real bleached bills that were printed with new amounts.",
                    "author": "ChobitsGirl",
                    "id": "f3142pd",
                    "parent_id": "t1_f302c2y",
                    "score": 5,
                    "created_utc": 1570567675.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "That is terrible. So sorry you went through this. I would be pissed as hell. Thank you for sharing",
            "author": null,
            "id": "f2z32ya",
            "parent_id": "t3_deu7oy",
            "score": 25,
            "created_utc": 1570504998.0,
            "replies": [
                {
                    "body": "Thank you for commiserating :)",
                    "author": "candygirl95",
                    "id": "f2z3q3f",
                    "parent_id": "t1_f2z32ya",
                    "score": 3,
                    "created_utc": 1570505541.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "f2z6isx",
                            "parent_id": "t1_f2z3q3f",
                            "score": 2,
                            "created_utc": 1570508088.0,
                            "replies": [
                                {
                                    "body": "It did not just include dinner :/",
                                    "author": "candygirl95",
                                    "id": "f2z76lq",
                                    "parent_id": "t1_f2z6isx",
                                    "score": 10,
                                    "created_utc": 1570508724.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Well that's a new one!\n\nTerribly sorry that this happened to you, or anyone really. Hopefully he gets caught using it soon enough.",
            "author": "sdaddy305",
            "id": "f2z2e9w",
            "parent_id": "t3_deu7oy",
            "score": 17,
            "created_utc": 1570504446.0,
            "replies": []
        },
        {
            "body": "That's horrible!\n\nWhat do you mean by fake money?",
            "author": "mtncityguy",
            "id": "f2z20uf",
            "parent_id": "t3_deu7oy",
            "score": 13,
            "created_utc": 1570504155.0,
            "replies": [
                {
                    "body": "[Motion picture money.](https://localtvwhnt.files.wordpress.com/2017/08/capture6.jpg?quality=85&strip=all) Literally movie/prop money.",
                    "author": "sdaddy305",
                    "id": "f2z2hl3",
                    "parent_id": "t1_f2z20uf",
                    "score": 18,
                    "created_utc": 1570504517.0,
                    "replies": [
                        {
                            "body": "Wow!  Guess Venmo can be safer than cash!",
                            "author": "mtncityguy",
                            "id": "f2z2niy",
                            "parent_id": "t1_f2z2hl3",
                            "score": 13,
                            "created_utc": 1570504645.0,
                            "replies": [
                                {
                                    "body": "LOL!\n\nIn this instance, I suppose you're right!",
                                    "author": "sdaddy305",
                                    "id": "f2z2tnh",
                                    "parent_id": "t1_f2z2niy",
                                    "score": 5,
                                    "created_utc": 1570504785.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "f2zg25r",
            "parent_id": "t3_deu7oy",
            "score": 13,
            "created_utc": 1570519817.0,
            "replies": [
                {
                    "body": "This is spot on. The standard advice is to get your money before sex begins and to verify and count it. Well, if you break all the rules, ignore red flags and don't vet the POT, yeah, you sure as hell better get that money ahead of time, because you're about to be scammed!",
                    "author": "gingerdaddy56",
                    "id": "f2zrm55",
                    "parent_id": "t1_f2zg25r",
                    "score": 5,
                    "created_utc": 1570536211.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "f30wc1n",
                            "parent_id": "t1_f2zrm55",
                            "score": 3,
                            "created_utc": 1570563573.0,
                            "replies": [
                                {
                                    "body": "Should you? Probably not, but it’s the nature of the sugar bowl, in the beginning at least.",
                                    "author": "RealEarthAngel",
                                    "id": "f37916a",
                                    "parent_id": "t1_f30wc1n",
                                    "score": 1,
                                    "created_utc": 1570722964.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": " I didn't realize there was a code of conduct sugar babies were required to follow at meetings. \n\nThere were no red flags - even retrospectively I can't find them. I talked to this guy for 5 hours before we moved back to his place. Starting an arrangement after a successful meeting isn't uncommon.",
                            "author": "candygirl95",
                            "id": "f3045t4",
                            "parent_id": "t1_f2zrm55",
                            "score": 3,
                            "created_utc": 1570545997.0,
                            "replies": [
                                {
                                    "body": "I apologize. You're right, you likely did nothing wrong. I too have begun arrangements on the same day also. Also, I would say, it's not like every SD is lying in wait for an SB to make a mistake so they can jump to take advantage of them.\n\nAlthough it seems you did nothing wrong here, and I am sad this happened to you, I think the advice still is relevant. If you follow the standard model: talk, vet, pay attention to red flags, don't jump into a sexual encounter, etc. one will be far less likely to be taken advantage of.",
                                    "author": "gingerdaddy56",
                                    "id": "f32kv9d",
                                    "parent_id": "t1_f3045t4",
                                    "score": 2,
                                    "created_utc": 1570615510.0,
                                    "replies": []
                                },
                                {
                                    "body": "Not uncommon at all.",
                                    "author": "RealEarthAngel",
                                    "id": "f37bd55",
                                    "parent_id": "t1_f3045t4",
                                    "score": 2,
                                    "created_utc": 1570723822.0,
                                    "replies": []
                                },
                                {
                                    "body": "I have moved to intimacy on a first date too but I think SBs are in a more vulnerable situation than a SD in moving quicker to intimacy.  A platonic m&g will definitely screen out the Johns on SA.  And the most valuable thing a platonic m&g will show you is a pot's generosity in a nonsexual situation -- because a real pot should give a gift if he likes you.  A scammer/fake John is not going to come out of pocket $100 to have drinks with you, so it is an easy way to flush them out.  Btw, I would find out where this guy lives and burn his house down. Or at a minimum, take photos of the fake money and send it to SA to get him banned.",
                                    "author": "mike_o212",
                                    "id": "f361sdw",
                                    "parent_id": "t1_f3045t4",
                                    "score": 1,
                                    "created_utc": 1570703139.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I am so sorry that this happened to you… I’ve been scammed a few times myself. A few years ago in Long Island, NY, I agreed to meet up with this guy for an extended hotel date and we agreed on 5K, which I know for a lot of women is completely unheard of, but it is not uncommon for me. He handed me an envelope and before he did, he opened it in front of me, took out the cash and counted it on the bed… He put it back in the envelope and I don’t know how he did it but he managed to switch the envelope with another one that had cut up pieces of paper in it the size of dollar bills. That’s the one he gave me ...and since he had just counted it in front of me, I didn’t check it. Normally I would. I didn’t know what had happened till after I left and got in my car, opened the envelope...  and I felt sick to my stomach… Mainly because I really needed the money at that point and I had planned to give some of it to a family member to help them too.\n\nYou are so right about it feeling like a horrible violation… I’ve never felt more violated in my life, having just been completely taken advantage of by the guy. I don’t know how these guys sleep at night. What a shitty thing to do to someone.",
            "author": "RealEarthAngel",
            "id": "f2zc8ly",
            "parent_id": "t3_deu7oy",
            "score": 24,
            "created_utc": 1570514376.0,
            "replies": []
        },
        {
            "body": "OP How many meets did you go on? You could pretend as if you have not noticed the money is fake and continue as normal. Keep contacting him, teasing him until he wants to meet then set him up with the police or (private security) to retrieve the money he owes. I'm not sure whether text messages and the SA communication is enough evidence for cops to take action but you could look into it or at least get him caught with authorities for counterfeit money and maybe sue his ass. I know it may be alot of hassle but that's probably what I would try to do.\n\nIf he confirmed in writing, (texting) he would pay you x x amount in exchange for your time, attention and energy it should be enforceable in a court of law, surely?",
            "author": "Billionbabe",
            "id": "f2znypf",
            "parent_id": "t3_deu7oy",
            "score": 6,
            "created_utc": 1570532146.0,
            "replies": [
                {
                    "body": "The police are not going to chase down some guy for money exchanged for \"her time\", which included intimacy, i.e. sex. \n\nA court will not entertain illegal contracts - the terms are not enforceable and the court will not entertain items that are in the fringe of legal agreements.\n\n[https://www.avvo.com/legal-answers/can-a-sugar-baby-take-a-sugar-daddy-to-small-claim-2205100.html](https://www.avvo.com/legal-answers/can-a-sugar-baby-take-a-sugar-daddy-to-small-claim-2205100.html)",
                    "author": "Academic_Set",
                    "id": "f2zsxeb",
                    "parent_id": "t1_f2znypf",
                    "score": 6,
                    "created_utc": 1570537476.0,
                    "replies": [
                        {
                            "body": "Actually, the police wouldn't necessarily be the people chasing down the scammer.\n\nCases involving fake currency are normally referred to the Secret Service.  In addition to protecting the President, this is one of their few functions.  And they do take the misuse of \"Hollywood\" money seriously.  So much so, that there has been a significant fight between the industry and the govt. over the last few decades that has resulted in movie money being deliberately made more and more unrealistic.\n\nIf OP really wanted to pursue getting her money back, the best course of action might be to threaten to involve the Feds.  I'm guessing a lot of scammers might pay $600 rather than deal with the Secret Service knocking on their door.",
                            "author": "Hello2reddit",
                            "id": "f2zyn6c",
                            "parent_id": "t1_f2zsxeb",
                            "score": 3,
                            "created_utc": 1570542168.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "f2zz2t3",
                                    "parent_id": "t1_f2zyn6c",
                                    "score": 1,
                                    "created_utc": 1570542490.0,
                                    "replies": [
                                        {
                                            "body": "And you're basing that assertion on what exactly?\n\nThere is someone out there that is in possession of fake money, and has demonstrated a willingness to use it.  Their interest might partially depend on how realistic the fake money is, but OPs scammer clearly constitutes an investigative avenue for them.  They would likely be interested in the source of the bills (movie money is actually more tightly controlled than you think), and whether they have been used elsewhere.  For data and tracking purposes, it makes sense that you would want to get every sample of fake currency that you possibly can.\n\nThe Secret Service doesn't give a fuck about OP, and won't recover any money on her behalf.  But I do think there are good reasons to believe they would be interested in this case, which does potentially provide her with leverage over her scammer.",
                                            "author": "Hello2reddit",
                                            "id": "f3005hh",
                                            "parent_id": "t1_f2zz2t3",
                                            "score": 0,
                                            "created_utc": 1570543266.0,
                                            "replies": [
                                                {
                                                    "body": "[deleted]",
                                                    "author": null,
                                                    "id": "f300ohv",
                                                    "parent_id": "t1_f3005hh",
                                                    "score": 1,
                                                    "created_utc": 1570543634.0,
                                                    "replies": [
                                                        {
                                                            "body": "In all likelihood, yes.  There are IP addresses, photos that likely contain metadata, investigating the purchase of the burner phone, and a bunch of other ways they could run down OPs scammer.\n\nBut I'm not seeing anything in the original post indicating that this particular scammer was smart enough to use a burner and fake ID anyway.",
                                                            "author": "Hello2reddit",
                                                            "id": "f301aat",
                                                            "parent_id": "t1_f300ohv",
                                                            "score": 0,
                                                            "created_utc": 1570544057.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Well it's counterfeit money which is illegal and also an agreement confirmed in writing between two parties may be enforceable if it can be proven that there was some form of breach or deceit ie scamming which has resulted in OP's loss. *Legal advise should obviously be sought*.",
                            "author": "Billionbabe",
                            "id": "f2ztmid",
                            "parent_id": "t1_f2zsxeb",
                            "score": 3,
                            "created_utc": 1570538108.0,
                            "replies": [
                                {
                                    "body": "There is no guarantee that there is an enforceable or legal contract.   \"Generally, something of value has to be exchanged for a court to find that a contract exists, as well as a certain other provisions that would memorialize the agreement.\"   If the value includes time and sex, the contract is nullified by the fact that the exchange is illegal.  No contract, no way to enforce it.\n\n[https://www.avvo.com/legal-answers/is-having-a-sugar-daddy-arrangement-illegal--3207335.html](https://www.avvo.com/legal-answers/is-having-a-sugar-daddy-arrangement-illegal--3207335.html)",
                                    "author": "Academic_Set",
                                    "id": "f2zvvhb",
                                    "parent_id": "t1_f2ztmid",
                                    "score": -1,
                                    "created_utc": 1570540026.0,
                                    "replies": [
                                        {
                                            "body": "Where did I state that it's guaranteed? The link above proves nothing as far as this case. Sugar relationship or not the OP was scammed by counterfeit money which is against the law.",
                                            "author": "Billionbabe",
                                            "id": "f2zxdju",
                                            "parent_id": "t1_f2zvvhb",
                                            "score": 3,
                                            "created_utc": 1570541219.0,
                                            "replies": [
                                                {
                                                    "body": "Scammed in an illegal arrangement.  She has no case.  Drug dealers can't sue if they get counterfeit money, either.  As stated above,  it absolutely was counterfeiting, but only if it was for a transaction rather than a gift, in which case her side of it was also illegal. There is no way for her to win here.",
                                                    "author": "Academic_Set",
                                                    "id": "f2zxnwn",
                                                    "parent_id": "t1_f2zxdju",
                                                    "score": 0,
                                                    "created_utc": 1570541436.0,
                                                    "replies": [
                                                        {
                                                            "body": "How was the arrangement illegal?",
                                                            "author": "Billionbabe",
                                                            "id": "f2zypom",
                                                            "parent_id": "t1_f2zxnwn",
                                                            "score": 0,
                                                            "created_utc": 1570542220.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Are you serious?\n\nContracting someone for time and intimacy associated within that time is illegal.",
                                                                    "author": "Academic_Set",
                                                                    "id": "f2zzjfc",
                                                                    "parent_id": "t1_f2zypom",
                                                                    "score": 5,
                                                                    "created_utc": 1570542824.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "I'm starting to think your the criminal in question here 😂 \n\nIntimacy is not an expectation in sugar relationships, however arrangements are based on gaining certain \"benefits\" which are to be mutually beneficial. I only mentioned time to define value, but point is OP was scammed and suffered loss which could be grounds for legal proceedings. The end!",
                                                                            "author": "Billionbabe",
                                                                            "id": "f301kwa",
                                                                            "parent_id": "t1_f2zzjfc",
                                                                            "score": 4,
                                                                            "created_utc": 1570544262.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "She suffered a loss due to a mutually beneficial agreement that included money for sex, which is an illegal contract.   You cannot contract sex for money (ie...the mutual benefits) legally in Los Angeles.  Therefore, there is no legal contract, and no case.   You can't go to court and ask for money back in an arrangement that the court would deem illegal, and lying in court about the arrangement being only for time is perjury.  She has no case.  She has no legal proceeding.",
                                                                                    "author": "Academic_Set",
                                                                                    "id": "f302d09",
                                                                                    "parent_id": "t1_f301kwa",
                                                                                    "score": 4,
                                                                                    "created_utc": 1570544795.0,
                                                                                    "replies": []
                                                                                },
                                                                                {
                                                                                    "body": "If I sell some drugs to a person and they give me fake money, should I also report them? I’m sorry but what happened is considered illegal in the US as much as some people on this forum want to think otherwise. Don’t give someone bad legal advice that could get them into trouble.",
                                                                                    "author": "FireWater86",
                                                                                    "id": "f30eyra",
                                                                                    "parent_id": "t1_f301kwa",
                                                                                    "score": 2,
                                                                                    "created_utc": 1570552926.0,
                                                                                    "replies": [
                                                                                        {
                                                                                            "body": "Sugar relationships are not illegal though so it's not comparable to drug dealing. Financial assistance in exchange for benefits is also NOT illegal. Lastly, I have not given legal advise, I merely suggested a number of scenarios for OP to explore if/when she decides to seek legal advise. 🙄",
                                                                                            "author": "Billionbabe",
                                                                                            "id": "f31lju2",
                                                                                            "parent_id": "t1_f30eyra",
                                                                                            "score": 1,
                                                                                            "created_utc": 1570578472.0,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "body": "It seems pretty debatable from the details she described but okay! I just don’t think you should tell someone to get the law involved when the transaction was made in questionable circumstances and they didn’t ask for advice about whether to get law enforcement involved.",
                                                                                                    "author": "FireWater86",
                                                                                                    "id": "f31nade",
                                                                                                    "parent_id": "t1_f31lju2",
                                                                                                    "score": 1,
                                                                                                    "created_utc": 1570579767.0,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "body": "You're entitled to your opinion, but without all the facts we really can't be certain of what's questionable or not. OP was scammed and became victim of a crime, she is well within her rights to involve the law if she chooses to.",
                                                                                                            "author": "Billionbabe",
                                                                                                            "id": "f32j09i",
                                                                                                            "parent_id": "t1_f31nade",
                                                                                                            "score": 1,
                                                                                                            "created_utc": 1570612445.0,
                                                                                                            "replies": []
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "I’ve never been a sugar baby but did this girl in the link you shared REALLY think this man was going to spoil her, give her thousands of dollars and mentor her whilst getting nothing in return? Like really? Lol who is that naive",
                            "author": null,
                            "id": "f2zvvgn",
                            "parent_id": "t1_f2zsxeb",
                            "score": -3,
                            "created_utc": 1570540026.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "did you meet him on SA? Did he have you blocked before you checked to see if he blocked you? This dude is straight psychopath.",
            "author": null,
            "id": "f2zu34z",
            "parent_id": "t3_deu7oy",
            "score": 3,
            "created_utc": 1570538511.0,
            "replies": [
                {
                    "body": "It was a while ago, so I don’t remember where he found me, but it quite possibly could’ve been SA.",
                    "author": "RealEarthAngel",
                    "id": "f37bio7",
                    "parent_id": "t1_f2zu34z",
                    "score": 1,
                    "created_utc": 1570723875.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Fully support the idea of going to the secret service and letting them know that you were going to provide some sort of companionship and this is what happened, this academic set guy here sounds like a scammer trying to dissuade you, you need to go after this guy and see what happens.",
            "author": "aj_sugar",
            "id": "f3020er",
            "parent_id": "t3_deu7oy",
            "score": 2,
            "created_utc": 1570544560.0,
            "replies": [
                {
                    "body": "Really? What horrible advice. It’s like a guy burglarizing a jewelry store getting robbed at gun point as he’s walking out the back door trying to report the armed robbery. \n\nIf she contacts authorities, ESPECIALLY FEDERAL AUTHORITIES, she will certainly be investigated for prostitution and which will most likely eventually be dropped because they will also hit her with RICO charges including tax evasion. Now she’ll do jail time AND have to pay taxes on every dime that she’s deposited for the last 5-7 years. The federal government / IRS live to go after unpaid taxes and is ultimately what brings down a lot of criminals in federal court. Just look at the college admissions scandal participants - a lot of the damage is being inflicted with tax evasion charges.",
                    "author": "TWatters19",
                    "id": "f3abhgm",
                    "parent_id": "t1_f3020er",
                    "score": 2,
                    "created_utc": 1570767080.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "This is unfortunately common for more regular sex workers. I guess those girls got smart to it so time to move to the sugar babies.",
            "author": "ZonaCouple",
            "id": "f2z8hv9",
            "parent_id": "t3_deu7oy",
            "score": 3,
            "created_utc": 1570510034.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "f2zbam6",
            "parent_id": "t3_deu7oy",
            "score": 4,
            "created_utc": 1570513180.0,
            "replies": [
                {
                    "body": "Pens can give false negatives.  If it feels weird, take a closer look.",
                    "author": "katilinavalek",
                    "id": "f31sxv2",
                    "parent_id": "t1_f2zbam6",
                    "score": 2,
                    "created_utc": 1570583938.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Thanks for the information.  Bottom line is that as technology improves and gets cheaper, the world’s criminals will be more than happy to supply others with fake currency (for a fee).  Notes differ from country to country - touch and feel, coloring methods, and security features embedded into the currency.  Unfortunately, we’re all going to carry pocket currency verifying gadgets (or smartphone apps).",
            "author": "MasterAcct2020",
            "id": "f2z95tw",
            "parent_id": "t3_deu7oy",
            "score": 2,
            "created_utc": 1570510728.0,
            "replies": []
        },
        {
            "body": "Wow, I’m so sorry something like this had to happen to you but this information will be so valuable to so many others, so thank you for that. \n\nWas it only detected when you went to cash it? If so what was the process like with your bank? If you can still you should report him to the site. Honestly wish you the best",
            "author": "brownbaby21",
            "id": "f2z44ix",
            "parent_id": "t3_deu7oy",
            "score": 2,
            "created_utc": 1570505889.0,
            "replies": []
        },
        {
            "body": "Of course it's LA...",
            "author": "KeyToGramercy",
            "id": "f2zbv3j",
            "parent_id": "t3_deu7oy",
            "score": 2,
            "created_utc": 1570513893.0,
            "replies": [
                {
                    "body": "I live nowhere near there & people try to use that at my job...\nSo scamming & deceit are universal.",
                    "author": "bsbdfw",
                    "id": "f2zc41u",
                    "parent_id": "t1_f2zbv3j",
                    "score": 6,
                    "created_utc": 1570514211.0,
                    "replies": [
                        {
                            "body": "I'm confident the availability of movie money is more prominent in LA.",
                            "author": "KeyToGramercy",
                            "id": "f2zfa62",
                            "parent_id": "t1_f2zc41u",
                            "score": 0,
                            "created_utc": 1570518637.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I don't know of the law of reporting someone for something like this, but certainly if he's on record for it and get multiple complaints something can happen?",
            "author": "tenmillionplus",
            "id": "f2z2ndm",
            "parent_id": "t3_deu7oy",
            "score": 2,
            "created_utc": 1570504642.0,
            "replies": [
                {
                    "body": "When I googled an image of motion picture money, it turned up a fair number of stories of people being arrested for it. Probably hard to prove in a person to person/\"he said, she said\" scenario, but if he's bold/dumb enough to try to use one at a store or something, he could be facing some time.",
                    "author": "sdaddy305",
                    "id": "f2z2rwu",
                    "parent_id": "t1_f2z2ndm",
                    "score": 2,
                    "created_utc": 1570504745.0,
                    "replies": [
                        {
                            "body": "I'm sure he's only using it to scam girls on SA :/ It's clearly fake but unfortunately a lot of girls feel uncomfortable asking for money upfront and checking it so it's a pretty easy scam to get away with.",
                            "author": "candygirl95",
                            "id": "f2z3603",
                            "parent_id": "t1_f2z2rwu",
                            "score": 7,
                            "created_utc": 1570505069.0,
                            "replies": [
                                {
                                    "body": "Definitely at least make a report on SA to describe this.",
                                    "author": "tenmillionplus",
                                    "id": "f2z5zr7",
                                    "parent_id": "t1_f2z3603",
                                    "score": 4,
                                    "created_utc": 1570507578.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "I think on a state level it's theft of services. But that would be a hard sell under these circumstances. Although pretty straight forward if used in a store or something.",
                            "author": "ZonaCouple",
                            "id": "f2z8f49",
                            "parent_id": "t1_f2z2rwu",
                            "score": 0,
                            "created_utc": 1570509961.0,
                            "replies": [
                                {
                                    "body": "It's only theft of service in a legal transaction.",
                                    "author": "Academic_Set",
                                    "id": "f2zz7o2",
                                    "parent_id": "t1_f2z8f49",
                                    "score": 1,
                                    "created_utc": 1570542588.0,
                                    "replies": [
                                        {
                                            "body": "Yep hence the hard sale.",
                                            "author": "ZonaCouple",
                                            "id": "f30qpjb",
                                            "parent_id": "t1_f2zz7o2",
                                            "score": 1,
                                            "created_utc": 1570560316.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Not sure what could be reported as a practical matter.\n\nDefinitely worth reporting him to SA though.",
                    "author": "mtncityguy",
                    "id": "f2z39ba",
                    "parent_id": "t1_f2z2ndm",
                    "score": 2,
                    "created_utc": 1570505147.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "f2z6tj7",
            "parent_id": "t3_deu7oy",
            "score": 1,
            "created_utc": 1570508368.0,
            "replies": [
                {
                    "body": "As much as I would love some sort of revenge (I have fantasized about 15 different scenarios so far) I have no proof that he's the one who gave me the money, nor do I have any contact information outside of a burner number and an SA account. \n\nI also don't love the idea of reporting to the police/secret service my SA activities - who knows what they could misconstrue out of that.",
                    "author": "candygirl95",
                    "id": "f2z7bcy",
                    "parent_id": "t1_f2z6tj7",
                    "score": 4,
                    "created_utc": 1570508853.0,
                    "replies": [
                        {
                            "body": ">  and an SA account.\n\nAt least report it to SA.",
                            "author": "Ranger3753",
                            "id": "f2z8dtn",
                            "parent_id": "t1_f2z7bcy",
                            "score": 4,
                            "created_utc": 1570509927.0,
                            "replies": []
                        },
                        {
                            "body": "SS can't do much, as long as it's marked movie money. If it's otherwise counterfeit, either burn it or put it in an envelope and give it to the police saying you found fake money without saying how you got it.",
                            "author": "AndThusThereWasLight",
                            "id": "f2zf9q8",
                            "parent_id": "t1_f2z7bcy",
                            "score": 1,
                            "created_utc": 1570518620.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": ">This is both a federal and state crime, and a serious one -- up to 20 years in prison.\n\nIt wasn't counterfeit it was play money printed for use in movies. There is no federal crime here, maybe a state one. But she would have to explain how she got it.",
                    "author": "ZonaCouple",
                    "id": "f2z8bvb",
                    "parent_id": "t1_f2z6tj7",
                    "score": 4,
                    "created_utc": 1570509875.0,
                    "replies": [
                        {
                            "body": "There is no federal crime for the movie company having it made as a prop, but it is definitely s crime to use it as legal currency. \nThe definition of counterfeit:  “made in imitation of something else with intent to deceive”. Once the money was spent with the intent to deceive someone it became counterfeit currency. If you find an idiot I go takes Monopoly money those bills are at that moment counterfeit. Intent is important. \n\nI used to working in the finance industry, st one point working as corporate compliance and security officer. The rules governing how currency can / can’t be replicated is easily found:  \n\nhttps://www.uscurrency.gov/media/currency-image-use\n\nEven with these guidelines, if you use these guidelines to copy money and try to pass it as legal currency you are guilty of counterfeiting.",
                            "author": "TWatters19",
                            "id": "f3ac9qy",
                            "parent_id": "t1_f2z8bvb",
                            "score": 1,
                            "created_utc": 1570767840.0,
                            "replies": [
                                {
                                    "body": ">“made in imitation of something else with intent to deceive”.\n\nThe key word there is \"made\". I have personally spoken to law enforcement when this happened at the club I danced at. It was not considered a federal crime. The local officer physically had a secret service agent on the phone, who told him there was nothing the feds could do as it meets all the criteria to not be considered counterfeit. The cops took a report for theft of services of course they did nothing with it.",
                                    "author": "ZonaCouple",
                                    "id": "f3ackn3",
                                    "parent_id": "t1_f3ac9qy",
                                    "score": 1,
                                    "created_utc": 1570768140.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "For you to report it as a crime it needs to be for a transaction not a gift, is there any chance you charged him a consulting fee? Maybe sold him a pair of your underwear?\n\nEstablish a transaction that isn't against the law",
            "author": "KnocDown",
            "id": "f3071pu",
            "parent_id": "t3_deu7oy",
            "score": 1,
            "created_utc": 1570547879.0,
            "replies": [
                {
                    "body": "A gift of counterfeit money is still illegal. If your intent was to deceive, you have broken the law.",
                    "author": "TWatters19",
                    "id": "f3acenh",
                    "parent_id": "t1_f3071pu",
                    "score": 1,
                    "created_utc": 1570767974.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Maybe throw that money on Craigslist and see if you can make a few bucks off it? Heck sorry that happened it’s almost straight if of a fiction novel.",
            "author": "FortuneGear09",
            "id": "f308dfy",
            "parent_id": "t3_deu7oy",
            "score": 1,
            "created_utc": 1570548733.0,
            "replies": []
        },
        {
            "body": "Go to the police with the money. He paid you for a service that was previously negotiated-a paid companion.  The treasury Dept might be interested in someone passing \"funny money\" . \n\nCash scams: \n-promise to pay and running out the door    \n-cash in an envelope but all $1.00s or short    \n-funny money   \n-cut paper in dollar shape    \nAny others?",
            "author": "GSSD",
            "id": "f309yxw",
            "parent_id": "t3_deu7oy",
            "score": 1,
            "created_utc": 1570549751.0,
            "replies": [
                {
                    "body": "And the IRS is definitely interested in somebody who takes in large amounts of cash and doesn’t pay taxes on that money. \n\nREALLY bad idea.",
                    "author": "TWatters19",
                    "id": "f3ache6",
                    "parent_id": "t1_f309yxw",
                    "score": 0,
                    "created_utc": 1570768049.0,
                    "replies": [
                        {
                            "body": "She would be reporting her one episode to another agency, not giving them her lifetime earnings history.",
                            "author": "GSSD",
                            "id": "f3aydm1",
                            "parent_id": "t1_f3ache6",
                            "score": 1,
                            "created_utc": 1570796228.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I’ve been in the LA/OC sugar scene for about 3 years now and this is the second time I’ve heard of this happening. It takes a real piece of work to have sat at dinner for as long as you did, and pull this scam off. This is not common for the area but it’s extremely unfortunate that it happened to you. I frequently am in the arrangements you seemingly had here and am never bothered by the checking the money in the bathroom move. If this guy is still frequenting SA send a report and at least get that paid account removed.",
            "author": "SDinSoCal",
            "id": "f30ac93",
            "parent_id": "t3_deu7oy",
            "score": 1,
            "created_utc": 1570549984.0,
            "replies": []
        },
        {
            "body": "A friend told me a lawyer left her an envelope full of newspaper cut to bill size. It's going to be \"he said, she said\" at this point. Only a sting would catch this guy, but it would probably be easy to setup if that is his modus operandi. Even then, he could say it was a joke.",
            "author": "ArnoldArmadillo",
            "id": "f3110ge",
            "parent_id": "t3_deu7oy",
            "score": 1,
            "created_utc": 1570566064.0,
            "replies": []
        },
        {
            "body": "Sadly, a SB has to collect the money up front AND count it before sex.  So many things to remember to do.",
            "author": "GSSD",
            "id": "f31501d",
            "parent_id": "t3_deu7oy",
            "score": 1,
            "created_utc": 1570568159.0,
            "replies": []
        },
        {
            "body": "If it makes you feel any better I took one of those as payment when I was bartending once. And my boss chewed my ass out when he counted my drawer and found that bad boy lol. It looked ridiculous too, like ben franklin basically had google eyes and it said \"motion picture money\" or whatever right in an arc in the middle of the bill. I was just super busy and took it without paying attention. I was a horrible bartender lol.\n\nA picture of it even got posted in our work Facebook page as a warning for all the other bartenders. Luckily my boss was a bro and didn't hold me responsible for the money that was basically \"missing\" from my till. Just roasted me and used it as an example of \"what not to do\" for the rest of my time there. But yeah, it's an easy mistake to make. You'll never take a bill without triple checking it again, but before it ever happens to you it's really easy to just be on autopilot and just \"stick money in the money spot\".\n\nSorry that happened though! Maybe some swamped bartender will take it off your hands lol. (just for clarity, do not this)",
            "author": "merewautt",
            "id": "f321ykv",
            "parent_id": "t3_deu7oy",
            "score": 1,
            "created_utc": 1570591005.0,
            "replies": []
        },
        {
            "body": "Another option is to carry a pocket sized uv flashlight and check for the security strips. And always remember a con artists best tool is their charm. Stay smart and stay safe y'all!",
            "author": "hailhydra8533",
            "id": "f37gkdd",
            "parent_id": "t3_deu7oy",
            "score": 1,
            "created_utc": 1570725647.0,
            "replies": []
        },
        {
            "body": "Waittttt a minute! *pulls out money with mr monopoly’s face*",
            "author": "soullessfreckles",
            "id": "f2zpq53",
            "parent_id": "t3_deu7oy",
            "score": 1,
            "created_utc": 1570534239.0,
            "replies": []
        },
        {
            "body": "This is so heart breaking 😞\nI’m so sorry for this.\n\nWould it be worth saying you sold him something on Craigslist and got fake money? Just as a way for him/his “money” to be investigated?\n\nNot sure if that would work...",
            "author": "CosmikLove",
            "id": "f302pt2",
            "parent_id": "t3_deu7oy",
            "score": 1,
            "created_utc": 1570545035.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "f2zkr8i",
            "parent_id": "t3_deu7oy",
            "score": -1,
            "created_utc": 1570527512.0,
            "replies": [
                {
                    "body": "How it was received is also considered illegal, which is why it’s so frustrating that she can’t do anything about it. That’s why these scams are able to work.",
                    "author": "FireWater86",
                    "id": "f2zq2gc",
                    "parent_id": "t1_f2zkr8i",
                    "score": 4,
                    "created_utc": 1570534614.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "f2zq7de",
                            "parent_id": "t1_f2zq2gc",
                            "score": -1,
                            "created_utc": 1570534760.0,
                            "replies": [
                                {
                                    "body": "It wasn’t counterfeit though. It was literally the fake money that is printed for use in movies and say so right on the bill. Like the money you buy children to play store with and it says so right on the bill that it’s fake. Completely legal to have it.",
                                    "author": null,
                                    "id": "f2zte1r",
                                    "parent_id": "t1_f2zq7de",
                                    "score": 3,
                                    "created_utc": 1570537899.0,
                                    "replies": []
                                },
                                {
                                    "body": "If that’s the case maybe she should give the fake bills to you and YOU report it. \n\nAnd your example is completely wrong. They can arrest for the drugs because they entered the home under exigent circumstances. Never watched a cop show? The cop tells his partner “don’t you hear screaming?” And they rush in and bust them for whatever illegal crap they see. \n\nShe calls the cops and most likely she’ll be charged with a crime that will get dropped, like you said, in favor RICO (money laundering) charges and tax evasion. \n\nReally bad idea.",
                                    "author": "TWatters19",
                                    "id": "f3acyi2",
                                    "parent_id": "t1_f2zq7de",
                                    "score": 1,
                                    "created_utc": 1570768526.0,
                                    "replies": []
                                },
                                {
                                    "body": "If that’s the case maybe she should give the fake bills to you and YOU report it. \n\nAnd your example is completely wrong. They can arrest for the drugs because they entered the home under exigent circumstances. Never watched a cop show? The cop tells his partner “don’t you hear screaming?” And they rush in and bust them for whatever illegal crap they see. \n\nShe calls the cops and most likely she’ll be charged with a crime that will get dropped, like you said, in favor RICO (money laundering) charges and tax evasion. \n\nReally bad idea.",
                                    "author": "TWatters19",
                                    "id": "f3ad8nb",
                                    "parent_id": "t1_f2zq7de",
                                    "score": 1,
                                    "created_utc": 1570768806.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "It wasn't counterfeit, it was motion picture money, that's a very important distinction.",
                    "author": "Seven_league_boots",
                    "id": "f304ixw",
                    "parent_id": "t1_f2zkr8i",
                    "score": 2,
                    "created_utc": 1570546233.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "woOoOOooow Fake money has never even occurred to me. So sorry that happened to you!11111",
            "author": null,
            "id": "f2ztu4n",
            "parent_id": "t3_deu7oy",
            "score": -1,
            "created_utc": 1570538292.0,
            "replies": []
        },
        {
            "body": "Did you have a platonic m&g separate from an intimate date?",
            "author": "mike_o212",
            "id": "f2zmrjj",
            "parent_id": "t3_deu7oy",
            "score": 0,
            "created_utc": 1570530546.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "f3sckyz",
                    "parent_id": "t1_f2zmrjj",
                    "score": 1,
                    "created_utc": 1571100621.0,
                    "replies": [
                        {
                            "body": "Filters out escorts, johns, scammers",
                            "author": "mike_o212",
                            "id": "f3uaekq",
                            "parent_id": "t1_f3sckyz",
                            "score": 1,
                            "created_utc": 1571156213.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Wow!! You lucked out there! That's fucking awesome.",
            "author": "kimchi_Queen",
            "id": "f6bbnsv",
            "parent_id": "t1_f37aswa",
            "score": 3,
            "created_utc": 1572771509.0,
            "replies": []
        },
        {
            "body": "No, it feels incredibly fake. If I had touched it before taking it I would have known but it was in an envelope. He even really quickly counted it out before me but was clearly banking on me not looking too hard and it worked.",
            "author": "candygirl95",
            "id": "f2z31ut",
            "parent_id": "t1_f2z2xtd",
            "score": 43,
            "created_utc": 1570504972.0,
            "replies": [
                {
                    "body": "Fair, I figured these are most likely regular pulp-paper so they'd feel super fake like you said.\n\nAnd yeah, it sounds like he's done this before unfortunately.",
                    "author": "sdaddy305",
                    "id": "f2z3599",
                    "parent_id": "t1_f2z31ut",
                    "score": 12,
                    "created_utc": 1570505051.0,
                    "replies": [
                        {
                            "body": "Would be interesting to know if giving it to you as real cash constituted knowingly using counterfeit money",
                            "author": "pinotandsugar",
                            "id": "f2zdw8h",
                            "parent_id": "t1_f2z3599",
                            "score": 3,
                            "created_utc": 1570516633.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "god. The mental dissonance to treat you so respectfully during dinner, to be totally normal then make an attempt to calm your nerves by counting it in front of you.... then expecting sex. I'm so disgusted by this person. Sounds like he's a psychopath. I could never keep that lie up.",
                    "author": null,
                    "id": "f2ztzgv",
                    "parent_id": "t1_f2z31ut",
                    "score": 8,
                    "created_utc": 1570538422.0,
                    "replies": [
                        {
                            "body": "That was the part I just could not conceive of when it happened to me… Truly twisted. How do you look someone in the face knowing you’re about to do something so heinous??\nI don’t know how he felt afterwards, but I can only imagine that if he could actually go through with such a violating act, that he must not have any qualms about it… And that is at least sociopathic if not psychopathic.",
                            "author": "RealEarthAngel",
                            "id": "f378u1m",
                            "parent_id": "t1_f2ztzgv",
                            "score": 1,
                            "created_utc": 1570722889.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "FYI:  Counterfeit pens don't work if the fake money is sprayed with hair spray or is real bleached bills that were printed with new amounts.",
            "author": "ChobitsGirl",
            "id": "f3142pd",
            "parent_id": "t1_f302c2y",
            "score": 5,
            "created_utc": 1570567675.0,
            "replies": []
        },
        {
            "body": "Thank you for commiserating :)",
            "author": "candygirl95",
            "id": "f2z3q3f",
            "parent_id": "t1_f2z32ya",
            "score": 3,
            "created_utc": 1570505541.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "f2z6isx",
                    "parent_id": "t1_f2z3q3f",
                    "score": 2,
                    "created_utc": 1570508088.0,
                    "replies": [
                        {
                            "body": "It did not just include dinner :/",
                            "author": "candygirl95",
                            "id": "f2z76lq",
                            "parent_id": "t1_f2z6isx",
                            "score": 10,
                            "created_utc": 1570508724.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "[Motion picture money.](https://localtvwhnt.files.wordpress.com/2017/08/capture6.jpg?quality=85&strip=all) Literally movie/prop money.",
            "author": "sdaddy305",
            "id": "f2z2hl3",
            "parent_id": "t1_f2z20uf",
            "score": 18,
            "created_utc": 1570504517.0,
            "replies": [
                {
                    "body": "Wow!  Guess Venmo can be safer than cash!",
                    "author": "mtncityguy",
                    "id": "f2z2niy",
                    "parent_id": "t1_f2z2hl3",
                    "score": 13,
                    "created_utc": 1570504645.0,
                    "replies": [
                        {
                            "body": "LOL!\n\nIn this instance, I suppose you're right!",
                            "author": "sdaddy305",
                            "id": "f2z2tnh",
                            "parent_id": "t1_f2z2niy",
                            "score": 5,
                            "created_utc": 1570504785.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "This is spot on. The standard advice is to get your money before sex begins and to verify and count it. Well, if you break all the rules, ignore red flags and don't vet the POT, yeah, you sure as hell better get that money ahead of time, because you're about to be scammed!",
            "author": "gingerdaddy56",
            "id": "f2zrm55",
            "parent_id": "t1_f2zg25r",
            "score": 5,
            "created_utc": 1570536211.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "f30wc1n",
                    "parent_id": "t1_f2zrm55",
                    "score": 3,
                    "created_utc": 1570563573.0,
                    "replies": [
                        {
                            "body": "Should you? Probably not, but it’s the nature of the sugar bowl, in the beginning at least.",
                            "author": "RealEarthAngel",
                            "id": "f37916a",
                            "parent_id": "t1_f30wc1n",
                            "score": 1,
                            "created_utc": 1570722964.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": " I didn't realize there was a code of conduct sugar babies were required to follow at meetings. \n\nThere were no red flags - even retrospectively I can't find them. I talked to this guy for 5 hours before we moved back to his place. Starting an arrangement after a successful meeting isn't uncommon.",
                    "author": "candygirl95",
                    "id": "f3045t4",
                    "parent_id": "t1_f2zrm55",
                    "score": 3,
                    "created_utc": 1570545997.0,
                    "replies": [
                        {
                            "body": "I apologize. You're right, you likely did nothing wrong. I too have begun arrangements on the same day also. Also, I would say, it's not like every SD is lying in wait for an SB to make a mistake so they can jump to take advantage of them.\n\nAlthough it seems you did nothing wrong here, and I am sad this happened to you, I think the advice still is relevant. If you follow the standard model: talk, vet, pay attention to red flags, don't jump into a sexual encounter, etc. one will be far less likely to be taken advantage of.",
                            "author": "gingerdaddy56",
                            "id": "f32kv9d",
                            "parent_id": "t1_f3045t4",
                            "score": 2,
                            "created_utc": 1570615510.0,
                            "replies": []
                        },
                        {
                            "body": "Not uncommon at all.",
                            "author": "RealEarthAngel",
                            "id": "f37bd55",
                            "parent_id": "t1_f3045t4",
                            "score": 2,
                            "created_utc": 1570723822.0,
                            "replies": []
                        },
                        {
                            "body": "I have moved to intimacy on a first date too but I think SBs are in a more vulnerable situation than a SD in moving quicker to intimacy.  A platonic m&g will definitely screen out the Johns on SA.  And the most valuable thing a platonic m&g will show you is a pot's generosity in a nonsexual situation -- because a real pot should give a gift if he likes you.  A scammer/fake John is not going to come out of pocket $100 to have drinks with you, so it is an easy way to flush them out.  Btw, I would find out where this guy lives and burn his house down. Or at a minimum, take photos of the fake money and send it to SA to get him banned.",
                            "author": "mike_o212",
                            "id": "f361sdw",
                            "parent_id": "t1_f3045t4",
                            "score": 1,
                            "created_utc": 1570703139.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "The police are not going to chase down some guy for money exchanged for \"her time\", which included intimacy, i.e. sex. \n\nA court will not entertain illegal contracts - the terms are not enforceable and the court will not entertain items that are in the fringe of legal agreements.\n\n[https://www.avvo.com/legal-answers/can-a-sugar-baby-take-a-sugar-daddy-to-small-claim-2205100.html](https://www.avvo.com/legal-answers/can-a-sugar-baby-take-a-sugar-daddy-to-small-claim-2205100.html)",
            "author": "Academic_Set",
            "id": "f2zsxeb",
            "parent_id": "t1_f2znypf",
            "score": 6,
            "created_utc": 1570537476.0,
            "replies": [
                {
                    "body": "Actually, the police wouldn't necessarily be the people chasing down the scammer.\n\nCases involving fake currency are normally referred to the Secret Service.  In addition to protecting the President, this is one of their few functions.  And they do take the misuse of \"Hollywood\" money seriously.  So much so, that there has been a significant fight between the industry and the govt. over the last few decades that has resulted in movie money being deliberately made more and more unrealistic.\n\nIf OP really wanted to pursue getting her money back, the best course of action might be to threaten to involve the Feds.  I'm guessing a lot of scammers might pay $600 rather than deal with the Secret Service knocking on their door.",
                    "author": "Hello2reddit",
                    "id": "f2zyn6c",
                    "parent_id": "t1_f2zsxeb",
                    "score": 3,
                    "created_utc": 1570542168.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "f2zz2t3",
                            "parent_id": "t1_f2zyn6c",
                            "score": 1,
                            "created_utc": 1570542490.0,
                            "replies": [
                                {
                                    "body": "And you're basing that assertion on what exactly?\n\nThere is someone out there that is in possession of fake money, and has demonstrated a willingness to use it.  Their interest might partially depend on how realistic the fake money is, but OPs scammer clearly constitutes an investigative avenue for them.  They would likely be interested in the source of the bills (movie money is actually more tightly controlled than you think), and whether they have been used elsewhere.  For data and tracking purposes, it makes sense that you would want to get every sample of fake currency that you possibly can.\n\nThe Secret Service doesn't give a fuck about OP, and won't recover any money on her behalf.  But I do think there are good reasons to believe they would be interested in this case, which does potentially provide her with leverage over her scammer.",
                                    "author": "Hello2reddit",
                                    "id": "f3005hh",
                                    "parent_id": "t1_f2zz2t3",
                                    "score": 0,
                                    "created_utc": 1570543266.0,
                                    "replies": [
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "f300ohv",
                                            "parent_id": "t1_f3005hh",
                                            "score": 1,
                                            "created_utc": 1570543634.0,
                                            "replies": [
                                                {
                                                    "body": "In all likelihood, yes.  There are IP addresses, photos that likely contain metadata, investigating the purchase of the burner phone, and a bunch of other ways they could run down OPs scammer.\n\nBut I'm not seeing anything in the original post indicating that this particular scammer was smart enough to use a burner and fake ID anyway.",
                                                    "author": "Hello2reddit",
                                                    "id": "f301aat",
                                                    "parent_id": "t1_f300ohv",
                                                    "score": 0,
                                                    "created_utc": 1570544057.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Well it's counterfeit money which is illegal and also an agreement confirmed in writing between two parties may be enforceable if it can be proven that there was some form of breach or deceit ie scamming which has resulted in OP's loss. *Legal advise should obviously be sought*.",
                    "author": "Billionbabe",
                    "id": "f2ztmid",
                    "parent_id": "t1_f2zsxeb",
                    "score": 3,
                    "created_utc": 1570538108.0,
                    "replies": [
                        {
                            "body": "There is no guarantee that there is an enforceable or legal contract.   \"Generally, something of value has to be exchanged for a court to find that a contract exists, as well as a certain other provisions that would memorialize the agreement.\"   If the value includes time and sex, the contract is nullified by the fact that the exchange is illegal.  No contract, no way to enforce it.\n\n[https://www.avvo.com/legal-answers/is-having-a-sugar-daddy-arrangement-illegal--3207335.html](https://www.avvo.com/legal-answers/is-having-a-sugar-daddy-arrangement-illegal--3207335.html)",
                            "author": "Academic_Set",
                            "id": "f2zvvhb",
                            "parent_id": "t1_f2ztmid",
                            "score": -1,
                            "created_utc": 1570540026.0,
                            "replies": [
                                {
                                    "body": "Where did I state that it's guaranteed? The link above proves nothing as far as this case. Sugar relationship or not the OP was scammed by counterfeit money which is against the law.",
                                    "author": "Billionbabe",
                                    "id": "f2zxdju",
                                    "parent_id": "t1_f2zvvhb",
                                    "score": 3,
                                    "created_utc": 1570541219.0,
                                    "replies": [
                                        {
                                            "body": "Scammed in an illegal arrangement.  She has no case.  Drug dealers can't sue if they get counterfeit money, either.  As stated above,  it absolutely was counterfeiting, but only if it was for a transaction rather than a gift, in which case her side of it was also illegal. There is no way for her to win here.",
                                            "author": "Academic_Set",
                                            "id": "f2zxnwn",
                                            "parent_id": "t1_f2zxdju",
                                            "score": 0,
                                            "created_utc": 1570541436.0,
                                            "replies": [
                                                {
                                                    "body": "How was the arrangement illegal?",
                                                    "author": "Billionbabe",
                                                    "id": "f2zypom",
                                                    "parent_id": "t1_f2zxnwn",
                                                    "score": 0,
                                                    "created_utc": 1570542220.0,
                                                    "replies": [
                                                        {
                                                            "body": "Are you serious?\n\nContracting someone for time and intimacy associated within that time is illegal.",
                                                            "author": "Academic_Set",
                                                            "id": "f2zzjfc",
                                                            "parent_id": "t1_f2zypom",
                                                            "score": 5,
                                                            "created_utc": 1570542824.0,
                                                            "replies": [
                                                                {
                                                                    "body": "I'm starting to think your the criminal in question here 😂 \n\nIntimacy is not an expectation in sugar relationships, however arrangements are based on gaining certain \"benefits\" which are to be mutually beneficial. I only mentioned time to define value, but point is OP was scammed and suffered loss which could be grounds for legal proceedings. The end!",
                                                                    "author": "Billionbabe",
                                                                    "id": "f301kwa",
                                                                    "parent_id": "t1_f2zzjfc",
                                                                    "score": 4,
                                                                    "created_utc": 1570544262.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "She suffered a loss due to a mutually beneficial agreement that included money for sex, which is an illegal contract.   You cannot contract sex for money (ie...the mutual benefits) legally in Los Angeles.  Therefore, there is no legal contract, and no case.   You can't go to court and ask for money back in an arrangement that the court would deem illegal, and lying in court about the arrangement being only for time is perjury.  She has no case.  She has no legal proceeding.",
                                                                            "author": "Academic_Set",
                                                                            "id": "f302d09",
                                                                            "parent_id": "t1_f301kwa",
                                                                            "score": 4,
                                                                            "created_utc": 1570544795.0,
                                                                            "replies": []
                                                                        },
                                                                        {
                                                                            "body": "If I sell some drugs to a person and they give me fake money, should I also report them? I’m sorry but what happened is considered illegal in the US as much as some people on this forum want to think otherwise. Don’t give someone bad legal advice that could get them into trouble.",
                                                                            "author": "FireWater86",
                                                                            "id": "f30eyra",
                                                                            "parent_id": "t1_f301kwa",
                                                                            "score": 2,
                                                                            "created_utc": 1570552926.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "Sugar relationships are not illegal though so it's not comparable to drug dealing. Financial assistance in exchange for benefits is also NOT illegal. Lastly, I have not given legal advise, I merely suggested a number of scenarios for OP to explore if/when she decides to seek legal advise. 🙄",
                                                                                    "author": "Billionbabe",
                                                                                    "id": "f31lju2",
                                                                                    "parent_id": "t1_f30eyra",
                                                                                    "score": 1,
                                                                                    "created_utc": 1570578472.0,
                                                                                    "replies": [
                                                                                        {
                                                                                            "body": "It seems pretty debatable from the details she described but okay! I just don’t think you should tell someone to get the law involved when the transaction was made in questionable circumstances and they didn’t ask for advice about whether to get law enforcement involved.",
                                                                                            "author": "FireWater86",
                                                                                            "id": "f31nade",
                                                                                            "parent_id": "t1_f31lju2",
                                                                                            "score": 1,
                                                                                            "created_utc": 1570579767.0,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "body": "You're entitled to your opinion, but without all the facts we really can't be certain of what's questionable or not. OP was scammed and became victim of a crime, she is well within her rights to involve the law if she chooses to.",
                                                                                                    "author": "Billionbabe",
                                                                                                    "id": "f32j09i",
                                                                                                    "parent_id": "t1_f31nade",
                                                                                                    "score": 1,
                                                                                                    "created_utc": 1570612445.0,
                                                                                                    "replies": []
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "I’ve never been a sugar baby but did this girl in the link you shared REALLY think this man was going to spoil her, give her thousands of dollars and mentor her whilst getting nothing in return? Like really? Lol who is that naive",
                    "author": null,
                    "id": "f2zvvgn",
                    "parent_id": "t1_f2zsxeb",
                    "score": -3,
                    "created_utc": 1570540026.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "It was a while ago, so I don’t remember where he found me, but it quite possibly could’ve been SA.",
            "author": "RealEarthAngel",
            "id": "f37bio7",
            "parent_id": "t1_f2zu34z",
            "score": 1,
            "created_utc": 1570723875.0,
            "replies": []
        },
        {
            "body": "Really? What horrible advice. It’s like a guy burglarizing a jewelry store getting robbed at gun point as he’s walking out the back door trying to report the armed robbery. \n\nIf she contacts authorities, ESPECIALLY FEDERAL AUTHORITIES, she will certainly be investigated for prostitution and which will most likely eventually be dropped because they will also hit her with RICO charges including tax evasion. Now she’ll do jail time AND have to pay taxes on every dime that she’s deposited for the last 5-7 years. The federal government / IRS live to go after unpaid taxes and is ultimately what brings down a lot of criminals in federal court. Just look at the college admissions scandal participants - a lot of the damage is being inflicted with tax evasion charges.",
            "author": "TWatters19",
            "id": "f3abhgm",
            "parent_id": "t1_f3020er",
            "score": 2,
            "created_utc": 1570767080.0,
            "replies": []
        },
        {
            "body": "Pens can give false negatives.  If it feels weird, take a closer look.",
            "author": "katilinavalek",
            "id": "f31sxv2",
            "parent_id": "t1_f2zbam6",
            "score": 2,
            "created_utc": 1570583938.0,
            "replies": []
        },
        {
            "body": "I live nowhere near there & people try to use that at my job...\nSo scamming & deceit are universal.",
            "author": "bsbdfw",
            "id": "f2zc41u",
            "parent_id": "t1_f2zbv3j",
            "score": 6,
            "created_utc": 1570514211.0,
            "replies": [
                {
                    "body": "I'm confident the availability of movie money is more prominent in LA.",
                    "author": "KeyToGramercy",
                    "id": "f2zfa62",
                    "parent_id": "t1_f2zc41u",
                    "score": 0,
                    "created_utc": 1570518637.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "When I googled an image of motion picture money, it turned up a fair number of stories of people being arrested for it. Probably hard to prove in a person to person/\"he said, she said\" scenario, but if he's bold/dumb enough to try to use one at a store or something, he could be facing some time.",
            "author": "sdaddy305",
            "id": "f2z2rwu",
            "parent_id": "t1_f2z2ndm",
            "score": 2,
            "created_utc": 1570504745.0,
            "replies": [
                {
                    "body": "I'm sure he's only using it to scam girls on SA :/ It's clearly fake but unfortunately a lot of girls feel uncomfortable asking for money upfront and checking it so it's a pretty easy scam to get away with.",
                    "author": "candygirl95",
                    "id": "f2z3603",
                    "parent_id": "t1_f2z2rwu",
                    "score": 7,
                    "created_utc": 1570505069.0,
                    "replies": [
                        {
                            "body": "Definitely at least make a report on SA to describe this.",
                            "author": "tenmillionplus",
                            "id": "f2z5zr7",
                            "parent_id": "t1_f2z3603",
                            "score": 4,
                            "created_utc": 1570507578.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "I think on a state level it's theft of services. But that would be a hard sell under these circumstances. Although pretty straight forward if used in a store or something.",
                    "author": "ZonaCouple",
                    "id": "f2z8f49",
                    "parent_id": "t1_f2z2rwu",
                    "score": 0,
                    "created_utc": 1570509961.0,
                    "replies": [
                        {
                            "body": "It's only theft of service in a legal transaction.",
                            "author": "Academic_Set",
                            "id": "f2zz7o2",
                            "parent_id": "t1_f2z8f49",
                            "score": 1,
                            "created_utc": 1570542588.0,
                            "replies": [
                                {
                                    "body": "Yep hence the hard sale.",
                                    "author": "ZonaCouple",
                                    "id": "f30qpjb",
                                    "parent_id": "t1_f2zz7o2",
                                    "score": 1,
                                    "created_utc": 1570560316.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Not sure what could be reported as a practical matter.\n\nDefinitely worth reporting him to SA though.",
            "author": "mtncityguy",
            "id": "f2z39ba",
            "parent_id": "t1_f2z2ndm",
            "score": 2,
            "created_utc": 1570505147.0,
            "replies": []
        },
        {
            "body": "As much as I would love some sort of revenge (I have fantasized about 15 different scenarios so far) I have no proof that he's the one who gave me the money, nor do I have any contact information outside of a burner number and an SA account. \n\nI also don't love the idea of reporting to the police/secret service my SA activities - who knows what they could misconstrue out of that.",
            "author": "candygirl95",
            "id": "f2z7bcy",
            "parent_id": "t1_f2z6tj7",
            "score": 4,
            "created_utc": 1570508853.0,
            "replies": [
                {
                    "body": ">  and an SA account.\n\nAt least report it to SA.",
                    "author": "Ranger3753",
                    "id": "f2z8dtn",
                    "parent_id": "t1_f2z7bcy",
                    "score": 4,
                    "created_utc": 1570509927.0,
                    "replies": []
                },
                {
                    "body": "SS can't do much, as long as it's marked movie money. If it's otherwise counterfeit, either burn it or put it in an envelope and give it to the police saying you found fake money without saying how you got it.",
                    "author": "AndThusThereWasLight",
                    "id": "f2zf9q8",
                    "parent_id": "t1_f2z7bcy",
                    "score": 1,
                    "created_utc": 1570518620.0,
                    "replies": []
                }
            ]
        },
        {
            "body": ">This is both a federal and state crime, and a serious one -- up to 20 years in prison.\n\nIt wasn't counterfeit it was play money printed for use in movies. There is no federal crime here, maybe a state one. But she would have to explain how she got it.",
            "author": "ZonaCouple",
            "id": "f2z8bvb",
            "parent_id": "t1_f2z6tj7",
            "score": 4,
            "created_utc": 1570509875.0,
            "replies": [
                {
                    "body": "There is no federal crime for the movie company having it made as a prop, but it is definitely s crime to use it as legal currency. \nThe definition of counterfeit:  “made in imitation of something else with intent to deceive”. Once the money was spent with the intent to deceive someone it became counterfeit currency. If you find an idiot I go takes Monopoly money those bills are at that moment counterfeit. Intent is important. \n\nI used to working in the finance industry, st one point working as corporate compliance and security officer. The rules governing how currency can / can’t be replicated is easily found:  \n\nhttps://www.uscurrency.gov/media/currency-image-use\n\nEven with these guidelines, if you use these guidelines to copy money and try to pass it as legal currency you are guilty of counterfeiting.",
                    "author": "TWatters19",
                    "id": "f3ac9qy",
                    "parent_id": "t1_f2z8bvb",
                    "score": 1,
                    "created_utc": 1570767840.0,
                    "replies": [
                        {
                            "body": ">“made in imitation of something else with intent to deceive”.\n\nThe key word there is \"made\". I have personally spoken to law enforcement when this happened at the club I danced at. It was not considered a federal crime. The local officer physically had a secret service agent on the phone, who told him there was nothing the feds could do as it meets all the criteria to not be considered counterfeit. The cops took a report for theft of services of course they did nothing with it.",
                            "author": "ZonaCouple",
                            "id": "f3ackn3",
                            "parent_id": "t1_f3ac9qy",
                            "score": 1,
                            "created_utc": 1570768140.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "A gift of counterfeit money is still illegal. If your intent was to deceive, you have broken the law.",
            "author": "TWatters19",
            "id": "f3acenh",
            "parent_id": "t1_f3071pu",
            "score": 1,
            "created_utc": 1570767974.0,
            "replies": []
        },
        {
            "body": "And the IRS is definitely interested in somebody who takes in large amounts of cash and doesn’t pay taxes on that money. \n\nREALLY bad idea.",
            "author": "TWatters19",
            "id": "f3ache6",
            "parent_id": "t1_f309yxw",
            "score": 0,
            "created_utc": 1570768049.0,
            "replies": [
                {
                    "body": "She would be reporting her one episode to another agency, not giving them her lifetime earnings history.",
                    "author": "GSSD",
                    "id": "f3aydm1",
                    "parent_id": "t1_f3ache6",
                    "score": 1,
                    "created_utc": 1570796228.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "How it was received is also considered illegal, which is why it’s so frustrating that she can’t do anything about it. That’s why these scams are able to work.",
            "author": "FireWater86",
            "id": "f2zq2gc",
            "parent_id": "t1_f2zkr8i",
            "score": 4,
            "created_utc": 1570534614.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "f2zq7de",
                    "parent_id": "t1_f2zq2gc",
                    "score": -1,
                    "created_utc": 1570534760.0,
                    "replies": [
                        {
                            "body": "It wasn’t counterfeit though. It was literally the fake money that is printed for use in movies and say so right on the bill. Like the money you buy children to play store with and it says so right on the bill that it’s fake. Completely legal to have it.",
                            "author": null,
                            "id": "f2zte1r",
                            "parent_id": "t1_f2zq7de",
                            "score": 3,
                            "created_utc": 1570537899.0,
                            "replies": []
                        },
                        {
                            "body": "If that’s the case maybe she should give the fake bills to you and YOU report it. \n\nAnd your example is completely wrong. They can arrest for the drugs because they entered the home under exigent circumstances. Never watched a cop show? The cop tells his partner “don’t you hear screaming?” And they rush in and bust them for whatever illegal crap they see. \n\nShe calls the cops and most likely she’ll be charged with a crime that will get dropped, like you said, in favor RICO (money laundering) charges and tax evasion. \n\nReally bad idea.",
                            "author": "TWatters19",
                            "id": "f3acyi2",
                            "parent_id": "t1_f2zq7de",
                            "score": 1,
                            "created_utc": 1570768526.0,
                            "replies": []
                        },
                        {
                            "body": "If that’s the case maybe she should give the fake bills to you and YOU report it. \n\nAnd your example is completely wrong. They can arrest for the drugs because they entered the home under exigent circumstances. Never watched a cop show? The cop tells his partner “don’t you hear screaming?” And they rush in and bust them for whatever illegal crap they see. \n\nShe calls the cops and most likely she’ll be charged with a crime that will get dropped, like you said, in favor RICO (money laundering) charges and tax evasion. \n\nReally bad idea.",
                            "author": "TWatters19",
                            "id": "f3ad8nb",
                            "parent_id": "t1_f2zq7de",
                            "score": 1,
                            "created_utc": 1570768806.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "It wasn't counterfeit, it was motion picture money, that's a very important distinction.",
            "author": "Seven_league_boots",
            "id": "f304ixw",
            "parent_id": "t1_f2zkr8i",
            "score": 2,
            "created_utc": 1570546233.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "f3sckyz",
            "parent_id": "t1_f2zmrjj",
            "score": 1,
            "created_utc": 1571100621.0,
            "replies": [
                {
                    "body": "Filters out escorts, johns, scammers",
                    "author": "mike_o212",
                    "id": "f3uaekq",
                    "parent_id": "t1_f3sckyz",
                    "score": 1,
                    "created_utc": 1571156213.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Fair, I figured these are most likely regular pulp-paper so they'd feel super fake like you said.\n\nAnd yeah, it sounds like he's done this before unfortunately.",
            "author": "sdaddy305",
            "id": "f2z3599",
            "parent_id": "t1_f2z31ut",
            "score": 12,
            "created_utc": 1570505051.0,
            "replies": [
                {
                    "body": "Would be interesting to know if giving it to you as real cash constituted knowingly using counterfeit money",
                    "author": "pinotandsugar",
                    "id": "f2zdw8h",
                    "parent_id": "t1_f2z3599",
                    "score": 3,
                    "created_utc": 1570516633.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "god. The mental dissonance to treat you so respectfully during dinner, to be totally normal then make an attempt to calm your nerves by counting it in front of you.... then expecting sex. I'm so disgusted by this person. Sounds like he's a psychopath. I could never keep that lie up.",
            "author": null,
            "id": "f2ztzgv",
            "parent_id": "t1_f2z31ut",
            "score": 8,
            "created_utc": 1570538422.0,
            "replies": [
                {
                    "body": "That was the part I just could not conceive of when it happened to me… Truly twisted. How do you look someone in the face knowing you’re about to do something so heinous??\nI don’t know how he felt afterwards, but I can only imagine that if he could actually go through with such a violating act, that he must not have any qualms about it… And that is at least sociopathic if not psychopathic.",
                    "author": "RealEarthAngel",
                    "id": "f378u1m",
                    "parent_id": "t1_f2ztzgv",
                    "score": 1,
                    "created_utc": 1570722889.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "f2z6isx",
            "parent_id": "t1_f2z3q3f",
            "score": 2,
            "created_utc": 1570508088.0,
            "replies": [
                {
                    "body": "It did not just include dinner :/",
                    "author": "candygirl95",
                    "id": "f2z76lq",
                    "parent_id": "t1_f2z6isx",
                    "score": 10,
                    "created_utc": 1570508724.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Wow!  Guess Venmo can be safer than cash!",
            "author": "mtncityguy",
            "id": "f2z2niy",
            "parent_id": "t1_f2z2hl3",
            "score": 13,
            "created_utc": 1570504645.0,
            "replies": [
                {
                    "body": "LOL!\n\nIn this instance, I suppose you're right!",
                    "author": "sdaddy305",
                    "id": "f2z2tnh",
                    "parent_id": "t1_f2z2niy",
                    "score": 5,
                    "created_utc": 1570504785.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "f30wc1n",
            "parent_id": "t1_f2zrm55",
            "score": 3,
            "created_utc": 1570563573.0,
            "replies": [
                {
                    "body": "Should you? Probably not, but it’s the nature of the sugar bowl, in the beginning at least.",
                    "author": "RealEarthAngel",
                    "id": "f37916a",
                    "parent_id": "t1_f30wc1n",
                    "score": 1,
                    "created_utc": 1570722964.0,
                    "replies": []
                }
            ]
        },
        {
            "body": " I didn't realize there was a code of conduct sugar babies were required to follow at meetings. \n\nThere were no red flags - even retrospectively I can't find them. I talked to this guy for 5 hours before we moved back to his place. Starting an arrangement after a successful meeting isn't uncommon.",
            "author": "candygirl95",
            "id": "f3045t4",
            "parent_id": "t1_f2zrm55",
            "score": 3,
            "created_utc": 1570545997.0,
            "replies": [
                {
                    "body": "I apologize. You're right, you likely did nothing wrong. I too have begun arrangements on the same day also. Also, I would say, it's not like every SD is lying in wait for an SB to make a mistake so they can jump to take advantage of them.\n\nAlthough it seems you did nothing wrong here, and I am sad this happened to you, I think the advice still is relevant. If you follow the standard model: talk, vet, pay attention to red flags, don't jump into a sexual encounter, etc. one will be far less likely to be taken advantage of.",
                    "author": "gingerdaddy56",
                    "id": "f32kv9d",
                    "parent_id": "t1_f3045t4",
                    "score": 2,
                    "created_utc": 1570615510.0,
                    "replies": []
                },
                {
                    "body": "Not uncommon at all.",
                    "author": "RealEarthAngel",
                    "id": "f37bd55",
                    "parent_id": "t1_f3045t4",
                    "score": 2,
                    "created_utc": 1570723822.0,
                    "replies": []
                },
                {
                    "body": "I have moved to intimacy on a first date too but I think SBs are in a more vulnerable situation than a SD in moving quicker to intimacy.  A platonic m&g will definitely screen out the Johns on SA.  And the most valuable thing a platonic m&g will show you is a pot's generosity in a nonsexual situation -- because a real pot should give a gift if he likes you.  A scammer/fake John is not going to come out of pocket $100 to have drinks with you, so it is an easy way to flush them out.  Btw, I would find out where this guy lives and burn his house down. Or at a minimum, take photos of the fake money and send it to SA to get him banned.",
                    "author": "mike_o212",
                    "id": "f361sdw",
                    "parent_id": "t1_f3045t4",
                    "score": 1,
                    "created_utc": 1570703139.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Actually, the police wouldn't necessarily be the people chasing down the scammer.\n\nCases involving fake currency are normally referred to the Secret Service.  In addition to protecting the President, this is one of their few functions.  And they do take the misuse of \"Hollywood\" money seriously.  So much so, that there has been a significant fight between the industry and the govt. over the last few decades that has resulted in movie money being deliberately made more and more unrealistic.\n\nIf OP really wanted to pursue getting her money back, the best course of action might be to threaten to involve the Feds.  I'm guessing a lot of scammers might pay $600 rather than deal with the Secret Service knocking on their door.",
            "author": "Hello2reddit",
            "id": "f2zyn6c",
            "parent_id": "t1_f2zsxeb",
            "score": 3,
            "created_utc": 1570542168.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "f2zz2t3",
                    "parent_id": "t1_f2zyn6c",
                    "score": 1,
                    "created_utc": 1570542490.0,
                    "replies": [
                        {
                            "body": "And you're basing that assertion on what exactly?\n\nThere is someone out there that is in possession of fake money, and has demonstrated a willingness to use it.  Their interest might partially depend on how realistic the fake money is, but OPs scammer clearly constitutes an investigative avenue for them.  They would likely be interested in the source of the bills (movie money is actually more tightly controlled than you think), and whether they have been used elsewhere.  For data and tracking purposes, it makes sense that you would want to get every sample of fake currency that you possibly can.\n\nThe Secret Service doesn't give a fuck about OP, and won't recover any money on her behalf.  But I do think there are good reasons to believe they would be interested in this case, which does potentially provide her with leverage over her scammer.",
                            "author": "Hello2reddit",
                            "id": "f3005hh",
                            "parent_id": "t1_f2zz2t3",
                            "score": 0,
                            "created_utc": 1570543266.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "f300ohv",
                                    "parent_id": "t1_f3005hh",
                                    "score": 1,
                                    "created_utc": 1570543634.0,
                                    "replies": [
                                        {
                                            "body": "In all likelihood, yes.  There are IP addresses, photos that likely contain metadata, investigating the purchase of the burner phone, and a bunch of other ways they could run down OPs scammer.\n\nBut I'm not seeing anything in the original post indicating that this particular scammer was smart enough to use a burner and fake ID anyway.",
                                            "author": "Hello2reddit",
                                            "id": "f301aat",
                                            "parent_id": "t1_f300ohv",
                                            "score": 0,
                                            "created_utc": 1570544057.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Well it's counterfeit money which is illegal and also an agreement confirmed in writing between two parties may be enforceable if it can be proven that there was some form of breach or deceit ie scamming which has resulted in OP's loss. *Legal advise should obviously be sought*.",
            "author": "Billionbabe",
            "id": "f2ztmid",
            "parent_id": "t1_f2zsxeb",
            "score": 3,
            "created_utc": 1570538108.0,
            "replies": [
                {
                    "body": "There is no guarantee that there is an enforceable or legal contract.   \"Generally, something of value has to be exchanged for a court to find that a contract exists, as well as a certain other provisions that would memorialize the agreement.\"   If the value includes time and sex, the contract is nullified by the fact that the exchange is illegal.  No contract, no way to enforce it.\n\n[https://www.avvo.com/legal-answers/is-having-a-sugar-daddy-arrangement-illegal--3207335.html](https://www.avvo.com/legal-answers/is-having-a-sugar-daddy-arrangement-illegal--3207335.html)",
                    "author": "Academic_Set",
                    "id": "f2zvvhb",
                    "parent_id": "t1_f2ztmid",
                    "score": -1,
                    "created_utc": 1570540026.0,
                    "replies": [
                        {
                            "body": "Where did I state that it's guaranteed? The link above proves nothing as far as this case. Sugar relationship or not the OP was scammed by counterfeit money which is against the law.",
                            "author": "Billionbabe",
                            "id": "f2zxdju",
                            "parent_id": "t1_f2zvvhb",
                            "score": 3,
                            "created_utc": 1570541219.0,
                            "replies": [
                                {
                                    "body": "Scammed in an illegal arrangement.  She has no case.  Drug dealers can't sue if they get counterfeit money, either.  As stated above,  it absolutely was counterfeiting, but only if it was for a transaction rather than a gift, in which case her side of it was also illegal. There is no way for her to win here.",
                                    "author": "Academic_Set",
                                    "id": "f2zxnwn",
                                    "parent_id": "t1_f2zxdju",
                                    "score": 0,
                                    "created_utc": 1570541436.0,
                                    "replies": [
                                        {
                                            "body": "How was the arrangement illegal?",
                                            "author": "Billionbabe",
                                            "id": "f2zypom",
                                            "parent_id": "t1_f2zxnwn",
                                            "score": 0,
                                            "created_utc": 1570542220.0,
                                            "replies": [
                                                {
                                                    "body": "Are you serious?\n\nContracting someone for time and intimacy associated within that time is illegal.",
                                                    "author": "Academic_Set",
                                                    "id": "f2zzjfc",
                                                    "parent_id": "t1_f2zypom",
                                                    "score": 5,
                                                    "created_utc": 1570542824.0,
                                                    "replies": [
                                                        {
                                                            "body": "I'm starting to think your the criminal in question here 😂 \n\nIntimacy is not an expectation in sugar relationships, however arrangements are based on gaining certain \"benefits\" which are to be mutually beneficial. I only mentioned time to define value, but point is OP was scammed and suffered loss which could be grounds for legal proceedings. The end!",
                                                            "author": "Billionbabe",
                                                            "id": "f301kwa",
                                                            "parent_id": "t1_f2zzjfc",
                                                            "score": 4,
                                                            "created_utc": 1570544262.0,
                                                            "replies": [
                                                                {
                                                                    "body": "She suffered a loss due to a mutually beneficial agreement that included money for sex, which is an illegal contract.   You cannot contract sex for money (ie...the mutual benefits) legally in Los Angeles.  Therefore, there is no legal contract, and no case.   You can't go to court and ask for money back in an arrangement that the court would deem illegal, and lying in court about the arrangement being only for time is perjury.  She has no case.  She has no legal proceeding.",
                                                                    "author": "Academic_Set",
                                                                    "id": "f302d09",
                                                                    "parent_id": "t1_f301kwa",
                                                                    "score": 4,
                                                                    "created_utc": 1570544795.0,
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "body": "If I sell some drugs to a person and they give me fake money, should I also report them? I’m sorry but what happened is considered illegal in the US as much as some people on this forum want to think otherwise. Don’t give someone bad legal advice that could get them into trouble.",
                                                                    "author": "FireWater86",
                                                                    "id": "f30eyra",
                                                                    "parent_id": "t1_f301kwa",
                                                                    "score": 2,
                                                                    "created_utc": 1570552926.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "Sugar relationships are not illegal though so it's not comparable to drug dealing. Financial assistance in exchange for benefits is also NOT illegal. Lastly, I have not given legal advise, I merely suggested a number of scenarios for OP to explore if/when she decides to seek legal advise. 🙄",
                                                                            "author": "Billionbabe",
                                                                            "id": "f31lju2",
                                                                            "parent_id": "t1_f30eyra",
                                                                            "score": 1,
                                                                            "created_utc": 1570578472.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "It seems pretty debatable from the details she described but okay! I just don’t think you should tell someone to get the law involved when the transaction was made in questionable circumstances and they didn’t ask for advice about whether to get law enforcement involved.",
                                                                                    "author": "FireWater86",
                                                                                    "id": "f31nade",
                                                                                    "parent_id": "t1_f31lju2",
                                                                                    "score": 1,
                                                                                    "created_utc": 1570579767.0,
                                                                                    "replies": [
                                                                                        {
                                                                                            "body": "You're entitled to your opinion, but without all the facts we really can't be certain of what's questionable or not. OP was scammed and became victim of a crime, she is well within her rights to involve the law if she chooses to.",
                                                                                            "author": "Billionbabe",
                                                                                            "id": "f32j09i",
                                                                                            "parent_id": "t1_f31nade",
                                                                                            "score": 1,
                                                                                            "created_utc": 1570612445.0,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I’ve never been a sugar baby but did this girl in the link you shared REALLY think this man was going to spoil her, give her thousands of dollars and mentor her whilst getting nothing in return? Like really? Lol who is that naive",
            "author": null,
            "id": "f2zvvgn",
            "parent_id": "t1_f2zsxeb",
            "score": -3,
            "created_utc": 1570540026.0,
            "replies": []
        },
        {
            "body": "I'm confident the availability of movie money is more prominent in LA.",
            "author": "KeyToGramercy",
            "id": "f2zfa62",
            "parent_id": "t1_f2zc41u",
            "score": 0,
            "created_utc": 1570518637.0,
            "replies": []
        },
        {
            "body": "I'm sure he's only using it to scam girls on SA :/ It's clearly fake but unfortunately a lot of girls feel uncomfortable asking for money upfront and checking it so it's a pretty easy scam to get away with.",
            "author": "candygirl95",
            "id": "f2z3603",
            "parent_id": "t1_f2z2rwu",
            "score": 7,
            "created_utc": 1570505069.0,
            "replies": [
                {
                    "body": "Definitely at least make a report on SA to describe this.",
                    "author": "tenmillionplus",
                    "id": "f2z5zr7",
                    "parent_id": "t1_f2z3603",
                    "score": 4,
                    "created_utc": 1570507578.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I think on a state level it's theft of services. But that would be a hard sell under these circumstances. Although pretty straight forward if used in a store or something.",
            "author": "ZonaCouple",
            "id": "f2z8f49",
            "parent_id": "t1_f2z2rwu",
            "score": 0,
            "created_utc": 1570509961.0,
            "replies": [
                {
                    "body": "It's only theft of service in a legal transaction.",
                    "author": "Academic_Set",
                    "id": "f2zz7o2",
                    "parent_id": "t1_f2z8f49",
                    "score": 1,
                    "created_utc": 1570542588.0,
                    "replies": [
                        {
                            "body": "Yep hence the hard sale.",
                            "author": "ZonaCouple",
                            "id": "f30qpjb",
                            "parent_id": "t1_f2zz7o2",
                            "score": 1,
                            "created_utc": 1570560316.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": ">  and an SA account.\n\nAt least report it to SA.",
            "author": "Ranger3753",
            "id": "f2z8dtn",
            "parent_id": "t1_f2z7bcy",
            "score": 4,
            "created_utc": 1570509927.0,
            "replies": []
        },
        {
            "body": "SS can't do much, as long as it's marked movie money. If it's otherwise counterfeit, either burn it or put it in an envelope and give it to the police saying you found fake money without saying how you got it.",
            "author": "AndThusThereWasLight",
            "id": "f2zf9q8",
            "parent_id": "t1_f2z7bcy",
            "score": 1,
            "created_utc": 1570518620.0,
            "replies": []
        },
        {
            "body": "There is no federal crime for the movie company having it made as a prop, but it is definitely s crime to use it as legal currency. \nThe definition of counterfeit:  “made in imitation of something else with intent to deceive”. Once the money was spent with the intent to deceive someone it became counterfeit currency. If you find an idiot I go takes Monopoly money those bills are at that moment counterfeit. Intent is important. \n\nI used to working in the finance industry, st one point working as corporate compliance and security officer. The rules governing how currency can / can’t be replicated is easily found:  \n\nhttps://www.uscurrency.gov/media/currency-image-use\n\nEven with these guidelines, if you use these guidelines to copy money and try to pass it as legal currency you are guilty of counterfeiting.",
            "author": "TWatters19",
            "id": "f3ac9qy",
            "parent_id": "t1_f2z8bvb",
            "score": 1,
            "created_utc": 1570767840.0,
            "replies": [
                {
                    "body": ">“made in imitation of something else with intent to deceive”.\n\nThe key word there is \"made\". I have personally spoken to law enforcement when this happened at the club I danced at. It was not considered a federal crime. The local officer physically had a secret service agent on the phone, who told him there was nothing the feds could do as it meets all the criteria to not be considered counterfeit. The cops took a report for theft of services of course they did nothing with it.",
                    "author": "ZonaCouple",
                    "id": "f3ackn3",
                    "parent_id": "t1_f3ac9qy",
                    "score": 1,
                    "created_utc": 1570768140.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "She would be reporting her one episode to another agency, not giving them her lifetime earnings history.",
            "author": "GSSD",
            "id": "f3aydm1",
            "parent_id": "t1_f3ache6",
            "score": 1,
            "created_utc": 1570796228.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "f2zq7de",
            "parent_id": "t1_f2zq2gc",
            "score": -1,
            "created_utc": 1570534760.0,
            "replies": [
                {
                    "body": "It wasn’t counterfeit though. It was literally the fake money that is printed for use in movies and say so right on the bill. Like the money you buy children to play store with and it says so right on the bill that it’s fake. Completely legal to have it.",
                    "author": null,
                    "id": "f2zte1r",
                    "parent_id": "t1_f2zq7de",
                    "score": 3,
                    "created_utc": 1570537899.0,
                    "replies": []
                },
                {
                    "body": "If that’s the case maybe she should give the fake bills to you and YOU report it. \n\nAnd your example is completely wrong. They can arrest for the drugs because they entered the home under exigent circumstances. Never watched a cop show? The cop tells his partner “don’t you hear screaming?” And they rush in and bust them for whatever illegal crap they see. \n\nShe calls the cops and most likely she’ll be charged with a crime that will get dropped, like you said, in favor RICO (money laundering) charges and tax evasion. \n\nReally bad idea.",
                    "author": "TWatters19",
                    "id": "f3acyi2",
                    "parent_id": "t1_f2zq7de",
                    "score": 1,
                    "created_utc": 1570768526.0,
                    "replies": []
                },
                {
                    "body": "If that’s the case maybe she should give the fake bills to you and YOU report it. \n\nAnd your example is completely wrong. They can arrest for the drugs because they entered the home under exigent circumstances. Never watched a cop show? The cop tells his partner “don’t you hear screaming?” And they rush in and bust them for whatever illegal crap they see. \n\nShe calls the cops and most likely she’ll be charged with a crime that will get dropped, like you said, in favor RICO (money laundering) charges and tax evasion. \n\nReally bad idea.",
                    "author": "TWatters19",
                    "id": "f3ad8nb",
                    "parent_id": "t1_f2zq7de",
                    "score": 1,
                    "created_utc": 1570768806.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Filters out escorts, johns, scammers",
            "author": "mike_o212",
            "id": "f3uaekq",
            "parent_id": "t1_f3sckyz",
            "score": 1,
            "created_utc": 1571156213.0,
            "replies": []
        },
        {
            "body": "Would be interesting to know if giving it to you as real cash constituted knowingly using counterfeit money",
            "author": "pinotandsugar",
            "id": "f2zdw8h",
            "parent_id": "t1_f2z3599",
            "score": 3,
            "created_utc": 1570516633.0,
            "replies": []
        },
        {
            "body": "That was the part I just could not conceive of when it happened to me… Truly twisted. How do you look someone in the face knowing you’re about to do something so heinous??\nI don’t know how he felt afterwards, but I can only imagine that if he could actually go through with such a violating act, that he must not have any qualms about it… And that is at least sociopathic if not psychopathic.",
            "author": "RealEarthAngel",
            "id": "f378u1m",
            "parent_id": "t1_f2ztzgv",
            "score": 1,
            "created_utc": 1570722889.0,
            "replies": []
        },
        {
            "body": "It did not just include dinner :/",
            "author": "candygirl95",
            "id": "f2z76lq",
            "parent_id": "t1_f2z6isx",
            "score": 10,
            "created_utc": 1570508724.0,
            "replies": []
        },
        {
            "body": "LOL!\n\nIn this instance, I suppose you're right!",
            "author": "sdaddy305",
            "id": "f2z2tnh",
            "parent_id": "t1_f2z2niy",
            "score": 5,
            "created_utc": 1570504785.0,
            "replies": []
        },
        {
            "body": "Should you? Probably not, but it’s the nature of the sugar bowl, in the beginning at least.",
            "author": "RealEarthAngel",
            "id": "f37916a",
            "parent_id": "t1_f30wc1n",
            "score": 1,
            "created_utc": 1570722964.0,
            "replies": []
        },
        {
            "body": "I apologize. You're right, you likely did nothing wrong. I too have begun arrangements on the same day also. Also, I would say, it's not like every SD is lying in wait for an SB to make a mistake so they can jump to take advantage of them.\n\nAlthough it seems you did nothing wrong here, and I am sad this happened to you, I think the advice still is relevant. If you follow the standard model: talk, vet, pay attention to red flags, don't jump into a sexual encounter, etc. one will be far less likely to be taken advantage of.",
            "author": "gingerdaddy56",
            "id": "f32kv9d",
            "parent_id": "t1_f3045t4",
            "score": 2,
            "created_utc": 1570615510.0,
            "replies": []
        },
        {
            "body": "Not uncommon at all.",
            "author": "RealEarthAngel",
            "id": "f37bd55",
            "parent_id": "t1_f3045t4",
            "score": 2,
            "created_utc": 1570723822.0,
            "replies": []
        },
        {
            "body": "I have moved to intimacy on a first date too but I think SBs are in a more vulnerable situation than a SD in moving quicker to intimacy.  A platonic m&g will definitely screen out the Johns on SA.  And the most valuable thing a platonic m&g will show you is a pot's generosity in a nonsexual situation -- because a real pot should give a gift if he likes you.  A scammer/fake John is not going to come out of pocket $100 to have drinks with you, so it is an easy way to flush them out.  Btw, I would find out where this guy lives and burn his house down. Or at a minimum, take photos of the fake money and send it to SA to get him banned.",
            "author": "mike_o212",
            "id": "f361sdw",
            "parent_id": "t1_f3045t4",
            "score": 1,
            "created_utc": 1570703139.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "f2zz2t3",
            "parent_id": "t1_f2zyn6c",
            "score": 1,
            "created_utc": 1570542490.0,
            "replies": [
                {
                    "body": "And you're basing that assertion on what exactly?\n\nThere is someone out there that is in possession of fake money, and has demonstrated a willingness to use it.  Their interest might partially depend on how realistic the fake money is, but OPs scammer clearly constitutes an investigative avenue for them.  They would likely be interested in the source of the bills (movie money is actually more tightly controlled than you think), and whether they have been used elsewhere.  For data and tracking purposes, it makes sense that you would want to get every sample of fake currency that you possibly can.\n\nThe Secret Service doesn't give a fuck about OP, and won't recover any money on her behalf.  But I do think there are good reasons to believe they would be interested in this case, which does potentially provide her with leverage over her scammer.",
                    "author": "Hello2reddit",
                    "id": "f3005hh",
                    "parent_id": "t1_f2zz2t3",
                    "score": 0,
                    "created_utc": 1570543266.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "f300ohv",
                            "parent_id": "t1_f3005hh",
                            "score": 1,
                            "created_utc": 1570543634.0,
                            "replies": [
                                {
                                    "body": "In all likelihood, yes.  There are IP addresses, photos that likely contain metadata, investigating the purchase of the burner phone, and a bunch of other ways they could run down OPs scammer.\n\nBut I'm not seeing anything in the original post indicating that this particular scammer was smart enough to use a burner and fake ID anyway.",
                                    "author": "Hello2reddit",
                                    "id": "f301aat",
                                    "parent_id": "t1_f300ohv",
                                    "score": 0,
                                    "created_utc": 1570544057.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "There is no guarantee that there is an enforceable or legal contract.   \"Generally, something of value has to be exchanged for a court to find that a contract exists, as well as a certain other provisions that would memorialize the agreement.\"   If the value includes time and sex, the contract is nullified by the fact that the exchange is illegal.  No contract, no way to enforce it.\n\n[https://www.avvo.com/legal-answers/is-having-a-sugar-daddy-arrangement-illegal--3207335.html](https://www.avvo.com/legal-answers/is-having-a-sugar-daddy-arrangement-illegal--3207335.html)",
            "author": "Academic_Set",
            "id": "f2zvvhb",
            "parent_id": "t1_f2ztmid",
            "score": -1,
            "created_utc": 1570540026.0,
            "replies": [
                {
                    "body": "Where did I state that it's guaranteed? The link above proves nothing as far as this case. Sugar relationship or not the OP was scammed by counterfeit money which is against the law.",
                    "author": "Billionbabe",
                    "id": "f2zxdju",
                    "parent_id": "t1_f2zvvhb",
                    "score": 3,
                    "created_utc": 1570541219.0,
                    "replies": [
                        {
                            "body": "Scammed in an illegal arrangement.  She has no case.  Drug dealers can't sue if they get counterfeit money, either.  As stated above,  it absolutely was counterfeiting, but only if it was for a transaction rather than a gift, in which case her side of it was also illegal. There is no way for her to win here.",
                            "author": "Academic_Set",
                            "id": "f2zxnwn",
                            "parent_id": "t1_f2zxdju",
                            "score": 0,
                            "created_utc": 1570541436.0,
                            "replies": [
                                {
                                    "body": "How was the arrangement illegal?",
                                    "author": "Billionbabe",
                                    "id": "f2zypom",
                                    "parent_id": "t1_f2zxnwn",
                                    "score": 0,
                                    "created_utc": 1570542220.0,
                                    "replies": [
                                        {
                                            "body": "Are you serious?\n\nContracting someone for time and intimacy associated within that time is illegal.",
                                            "author": "Academic_Set",
                                            "id": "f2zzjfc",
                                            "parent_id": "t1_f2zypom",
                                            "score": 5,
                                            "created_utc": 1570542824.0,
                                            "replies": [
                                                {
                                                    "body": "I'm starting to think your the criminal in question here 😂 \n\nIntimacy is not an expectation in sugar relationships, however arrangements are based on gaining certain \"benefits\" which are to be mutually beneficial. I only mentioned time to define value, but point is OP was scammed and suffered loss which could be grounds for legal proceedings. The end!",
                                                    "author": "Billionbabe",
                                                    "id": "f301kwa",
                                                    "parent_id": "t1_f2zzjfc",
                                                    "score": 4,
                                                    "created_utc": 1570544262.0,
                                                    "replies": [
                                                        {
                                                            "body": "She suffered a loss due to a mutually beneficial agreement that included money for sex, which is an illegal contract.   You cannot contract sex for money (ie...the mutual benefits) legally in Los Angeles.  Therefore, there is no legal contract, and no case.   You can't go to court and ask for money back in an arrangement that the court would deem illegal, and lying in court about the arrangement being only for time is perjury.  She has no case.  She has no legal proceeding.",
                                                            "author": "Academic_Set",
                                                            "id": "f302d09",
                                                            "parent_id": "t1_f301kwa",
                                                            "score": 4,
                                                            "created_utc": 1570544795.0,
                                                            "replies": []
                                                        },
                                                        {
                                                            "body": "If I sell some drugs to a person and they give me fake money, should I also report them? I’m sorry but what happened is considered illegal in the US as much as some people on this forum want to think otherwise. Don’t give someone bad legal advice that could get them into trouble.",
                                                            "author": "FireWater86",
                                                            "id": "f30eyra",
                                                            "parent_id": "t1_f301kwa",
                                                            "score": 2,
                                                            "created_utc": 1570552926.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Sugar relationships are not illegal though so it's not comparable to drug dealing. Financial assistance in exchange for benefits is also NOT illegal. Lastly, I have not given legal advise, I merely suggested a number of scenarios for OP to explore if/when she decides to seek legal advise. 🙄",
                                                                    "author": "Billionbabe",
                                                                    "id": "f31lju2",
                                                                    "parent_id": "t1_f30eyra",
                                                                    "score": 1,
                                                                    "created_utc": 1570578472.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "It seems pretty debatable from the details she described but okay! I just don’t think you should tell someone to get the law involved when the transaction was made in questionable circumstances and they didn’t ask for advice about whether to get law enforcement involved.",
                                                                            "author": "FireWater86",
                                                                            "id": "f31nade",
                                                                            "parent_id": "t1_f31lju2",
                                                                            "score": 1,
                                                                            "created_utc": 1570579767.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "You're entitled to your opinion, but without all the facts we really can't be certain of what's questionable or not. OP was scammed and became victim of a crime, she is well within her rights to involve the law if she chooses to.",
                                                                                    "author": "Billionbabe",
                                                                                    "id": "f32j09i",
                                                                                    "parent_id": "t1_f31nade",
                                                                                    "score": 1,
                                                                                    "created_utc": 1570612445.0,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Definitely at least make a report on SA to describe this.",
            "author": "tenmillionplus",
            "id": "f2z5zr7",
            "parent_id": "t1_f2z3603",
            "score": 4,
            "created_utc": 1570507578.0,
            "replies": []
        },
        {
            "body": "It's only theft of service in a legal transaction.",
            "author": "Academic_Set",
            "id": "f2zz7o2",
            "parent_id": "t1_f2z8f49",
            "score": 1,
            "created_utc": 1570542588.0,
            "replies": [
                {
                    "body": "Yep hence the hard sale.",
                    "author": "ZonaCouple",
                    "id": "f30qpjb",
                    "parent_id": "t1_f2zz7o2",
                    "score": 1,
                    "created_utc": 1570560316.0,
                    "replies": []
                }
            ]
        },
        {
            "body": ">“made in imitation of something else with intent to deceive”.\n\nThe key word there is \"made\". I have personally spoken to law enforcement when this happened at the club I danced at. It was not considered a federal crime. The local officer physically had a secret service agent on the phone, who told him there was nothing the feds could do as it meets all the criteria to not be considered counterfeit. The cops took a report for theft of services of course they did nothing with it.",
            "author": "ZonaCouple",
            "id": "f3ackn3",
            "parent_id": "t1_f3ac9qy",
            "score": 1,
            "created_utc": 1570768140.0,
            "replies": []
        },
        {
            "body": "It wasn’t counterfeit though. It was literally the fake money that is printed for use in movies and say so right on the bill. Like the money you buy children to play store with and it says so right on the bill that it’s fake. Completely legal to have it.",
            "author": null,
            "id": "f2zte1r",
            "parent_id": "t1_f2zq7de",
            "score": 3,
            "created_utc": 1570537899.0,
            "replies": []
        },
        {
            "body": "If that’s the case maybe she should give the fake bills to you and YOU report it. \n\nAnd your example is completely wrong. They can arrest for the drugs because they entered the home under exigent circumstances. Never watched a cop show? The cop tells his partner “don’t you hear screaming?” And they rush in and bust them for whatever illegal crap they see. \n\nShe calls the cops and most likely she’ll be charged with a crime that will get dropped, like you said, in favor RICO (money laundering) charges and tax evasion. \n\nReally bad idea.",
            "author": "TWatters19",
            "id": "f3acyi2",
            "parent_id": "t1_f2zq7de",
            "score": 1,
            "created_utc": 1570768526.0,
            "replies": []
        },
        {
            "body": "If that’s the case maybe she should give the fake bills to you and YOU report it. \n\nAnd your example is completely wrong. They can arrest for the drugs because they entered the home under exigent circumstances. Never watched a cop show? The cop tells his partner “don’t you hear screaming?” And they rush in and bust them for whatever illegal crap they see. \n\nShe calls the cops and most likely she’ll be charged with a crime that will get dropped, like you said, in favor RICO (money laundering) charges and tax evasion. \n\nReally bad idea.",
            "author": "TWatters19",
            "id": "f3ad8nb",
            "parent_id": "t1_f2zq7de",
            "score": 1,
            "created_utc": 1570768806.0,
            "replies": []
        },
        {
            "body": "And you're basing that assertion on what exactly?\n\nThere is someone out there that is in possession of fake money, and has demonstrated a willingness to use it.  Their interest might partially depend on how realistic the fake money is, but OPs scammer clearly constitutes an investigative avenue for them.  They would likely be interested in the source of the bills (movie money is actually more tightly controlled than you think), and whether they have been used elsewhere.  For data and tracking purposes, it makes sense that you would want to get every sample of fake currency that you possibly can.\n\nThe Secret Service doesn't give a fuck about OP, and won't recover any money on her behalf.  But I do think there are good reasons to believe they would be interested in this case, which does potentially provide her with leverage over her scammer.",
            "author": "Hello2reddit",
            "id": "f3005hh",
            "parent_id": "t1_f2zz2t3",
            "score": 0,
            "created_utc": 1570543266.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "f300ohv",
                    "parent_id": "t1_f3005hh",
                    "score": 1,
                    "created_utc": 1570543634.0,
                    "replies": [
                        {
                            "body": "In all likelihood, yes.  There are IP addresses, photos that likely contain metadata, investigating the purchase of the burner phone, and a bunch of other ways they could run down OPs scammer.\n\nBut I'm not seeing anything in the original post indicating that this particular scammer was smart enough to use a burner and fake ID anyway.",
                            "author": "Hello2reddit",
                            "id": "f301aat",
                            "parent_id": "t1_f300ohv",
                            "score": 0,
                            "created_utc": 1570544057.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Where did I state that it's guaranteed? The link above proves nothing as far as this case. Sugar relationship or not the OP was scammed by counterfeit money which is against the law.",
            "author": "Billionbabe",
            "id": "f2zxdju",
            "parent_id": "t1_f2zvvhb",
            "score": 3,
            "created_utc": 1570541219.0,
            "replies": [
                {
                    "body": "Scammed in an illegal arrangement.  She has no case.  Drug dealers can't sue if they get counterfeit money, either.  As stated above,  it absolutely was counterfeiting, but only if it was for a transaction rather than a gift, in which case her side of it was also illegal. There is no way for her to win here.",
                    "author": "Academic_Set",
                    "id": "f2zxnwn",
                    "parent_id": "t1_f2zxdju",
                    "score": 0,
                    "created_utc": 1570541436.0,
                    "replies": [
                        {
                            "body": "How was the arrangement illegal?",
                            "author": "Billionbabe",
                            "id": "f2zypom",
                            "parent_id": "t1_f2zxnwn",
                            "score": 0,
                            "created_utc": 1570542220.0,
                            "replies": [
                                {
                                    "body": "Are you serious?\n\nContracting someone for time and intimacy associated within that time is illegal.",
                                    "author": "Academic_Set",
                                    "id": "f2zzjfc",
                                    "parent_id": "t1_f2zypom",
                                    "score": 5,
                                    "created_utc": 1570542824.0,
                                    "replies": [
                                        {
                                            "body": "I'm starting to think your the criminal in question here 😂 \n\nIntimacy is not an expectation in sugar relationships, however arrangements are based on gaining certain \"benefits\" which are to be mutually beneficial. I only mentioned time to define value, but point is OP was scammed and suffered loss which could be grounds for legal proceedings. The end!",
                                            "author": "Billionbabe",
                                            "id": "f301kwa",
                                            "parent_id": "t1_f2zzjfc",
                                            "score": 4,
                                            "created_utc": 1570544262.0,
                                            "replies": [
                                                {
                                                    "body": "She suffered a loss due to a mutually beneficial agreement that included money for sex, which is an illegal contract.   You cannot contract sex for money (ie...the mutual benefits) legally in Los Angeles.  Therefore, there is no legal contract, and no case.   You can't go to court and ask for money back in an arrangement that the court would deem illegal, and lying in court about the arrangement being only for time is perjury.  She has no case.  She has no legal proceeding.",
                                                    "author": "Academic_Set",
                                                    "id": "f302d09",
                                                    "parent_id": "t1_f301kwa",
                                                    "score": 4,
                                                    "created_utc": 1570544795.0,
                                                    "replies": []
                                                },
                                                {
                                                    "body": "If I sell some drugs to a person and they give me fake money, should I also report them? I’m sorry but what happened is considered illegal in the US as much as some people on this forum want to think otherwise. Don’t give someone bad legal advice that could get them into trouble.",
                                                    "author": "FireWater86",
                                                    "id": "f30eyra",
                                                    "parent_id": "t1_f301kwa",
                                                    "score": 2,
                                                    "created_utc": 1570552926.0,
                                                    "replies": [
                                                        {
                                                            "body": "Sugar relationships are not illegal though so it's not comparable to drug dealing. Financial assistance in exchange for benefits is also NOT illegal. Lastly, I have not given legal advise, I merely suggested a number of scenarios for OP to explore if/when she decides to seek legal advise. 🙄",
                                                            "author": "Billionbabe",
                                                            "id": "f31lju2",
                                                            "parent_id": "t1_f30eyra",
                                                            "score": 1,
                                                            "created_utc": 1570578472.0,
                                                            "replies": [
                                                                {
                                                                    "body": "It seems pretty debatable from the details she described but okay! I just don’t think you should tell someone to get the law involved when the transaction was made in questionable circumstances and they didn’t ask for advice about whether to get law enforcement involved.",
                                                                    "author": "FireWater86",
                                                                    "id": "f31nade",
                                                                    "parent_id": "t1_f31lju2",
                                                                    "score": 1,
                                                                    "created_utc": 1570579767.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "You're entitled to your opinion, but without all the facts we really can't be certain of what's questionable or not. OP was scammed and became victim of a crime, she is well within her rights to involve the law if she chooses to.",
                                                                            "author": "Billionbabe",
                                                                            "id": "f32j09i",
                                                                            "parent_id": "t1_f31nade",
                                                                            "score": 1,
                                                                            "created_utc": 1570612445.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yep hence the hard sale.",
            "author": "ZonaCouple",
            "id": "f30qpjb",
            "parent_id": "t1_f2zz7o2",
            "score": 1,
            "created_utc": 1570560316.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "f300ohv",
            "parent_id": "t1_f3005hh",
            "score": 1,
            "created_utc": 1570543634.0,
            "replies": [
                {
                    "body": "In all likelihood, yes.  There are IP addresses, photos that likely contain metadata, investigating the purchase of the burner phone, and a bunch of other ways they could run down OPs scammer.\n\nBut I'm not seeing anything in the original post indicating that this particular scammer was smart enough to use a burner and fake ID anyway.",
                    "author": "Hello2reddit",
                    "id": "f301aat",
                    "parent_id": "t1_f300ohv",
                    "score": 0,
                    "created_utc": 1570544057.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Scammed in an illegal arrangement.  She has no case.  Drug dealers can't sue if they get counterfeit money, either.  As stated above,  it absolutely was counterfeiting, but only if it was for a transaction rather than a gift, in which case her side of it was also illegal. There is no way for her to win here.",
            "author": "Academic_Set",
            "id": "f2zxnwn",
            "parent_id": "t1_f2zxdju",
            "score": 0,
            "created_utc": 1570541436.0,
            "replies": [
                {
                    "body": "How was the arrangement illegal?",
                    "author": "Billionbabe",
                    "id": "f2zypom",
                    "parent_id": "t1_f2zxnwn",
                    "score": 0,
                    "created_utc": 1570542220.0,
                    "replies": [
                        {
                            "body": "Are you serious?\n\nContracting someone for time and intimacy associated within that time is illegal.",
                            "author": "Academic_Set",
                            "id": "f2zzjfc",
                            "parent_id": "t1_f2zypom",
                            "score": 5,
                            "created_utc": 1570542824.0,
                            "replies": [
                                {
                                    "body": "I'm starting to think your the criminal in question here 😂 \n\nIntimacy is not an expectation in sugar relationships, however arrangements are based on gaining certain \"benefits\" which are to be mutually beneficial. I only mentioned time to define value, but point is OP was scammed and suffered loss which could be grounds for legal proceedings. The end!",
                                    "author": "Billionbabe",
                                    "id": "f301kwa",
                                    "parent_id": "t1_f2zzjfc",
                                    "score": 4,
                                    "created_utc": 1570544262.0,
                                    "replies": [
                                        {
                                            "body": "She suffered a loss due to a mutually beneficial agreement that included money for sex, which is an illegal contract.   You cannot contract sex for money (ie...the mutual benefits) legally in Los Angeles.  Therefore, there is no legal contract, and no case.   You can't go to court and ask for money back in an arrangement that the court would deem illegal, and lying in court about the arrangement being only for time is perjury.  She has no case.  She has no legal proceeding.",
                                            "author": "Academic_Set",
                                            "id": "f302d09",
                                            "parent_id": "t1_f301kwa",
                                            "score": 4,
                                            "created_utc": 1570544795.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "If I sell some drugs to a person and they give me fake money, should I also report them? I’m sorry but what happened is considered illegal in the US as much as some people on this forum want to think otherwise. Don’t give someone bad legal advice that could get them into trouble.",
                                            "author": "FireWater86",
                                            "id": "f30eyra",
                                            "parent_id": "t1_f301kwa",
                                            "score": 2,
                                            "created_utc": 1570552926.0,
                                            "replies": [
                                                {
                                                    "body": "Sugar relationships are not illegal though so it's not comparable to drug dealing. Financial assistance in exchange for benefits is also NOT illegal. Lastly, I have not given legal advise, I merely suggested a number of scenarios for OP to explore if/when she decides to seek legal advise. 🙄",
                                                    "author": "Billionbabe",
                                                    "id": "f31lju2",
                                                    "parent_id": "t1_f30eyra",
                                                    "score": 1,
                                                    "created_utc": 1570578472.0,
                                                    "replies": [
                                                        {
                                                            "body": "It seems pretty debatable from the details she described but okay! I just don’t think you should tell someone to get the law involved when the transaction was made in questionable circumstances and they didn’t ask for advice about whether to get law enforcement involved.",
                                                            "author": "FireWater86",
                                                            "id": "f31nade",
                                                            "parent_id": "t1_f31lju2",
                                                            "score": 1,
                                                            "created_utc": 1570579767.0,
                                                            "replies": [
                                                                {
                                                                    "body": "You're entitled to your opinion, but without all the facts we really can't be certain of what's questionable or not. OP was scammed and became victim of a crime, she is well within her rights to involve the law if she chooses to.",
                                                                    "author": "Billionbabe",
                                                                    "id": "f32j09i",
                                                                    "parent_id": "t1_f31nade",
                                                                    "score": 1,
                                                                    "created_utc": 1570612445.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "In all likelihood, yes.  There are IP addresses, photos that likely contain metadata, investigating the purchase of the burner phone, and a bunch of other ways they could run down OPs scammer.\n\nBut I'm not seeing anything in the original post indicating that this particular scammer was smart enough to use a burner and fake ID anyway.",
            "author": "Hello2reddit",
            "id": "f301aat",
            "parent_id": "t1_f300ohv",
            "score": 0,
            "created_utc": 1570544057.0,
            "replies": []
        },
        {
            "body": "How was the arrangement illegal?",
            "author": "Billionbabe",
            "id": "f2zypom",
            "parent_id": "t1_f2zxnwn",
            "score": 0,
            "created_utc": 1570542220.0,
            "replies": [
                {
                    "body": "Are you serious?\n\nContracting someone for time and intimacy associated within that time is illegal.",
                    "author": "Academic_Set",
                    "id": "f2zzjfc",
                    "parent_id": "t1_f2zypom",
                    "score": 5,
                    "created_utc": 1570542824.0,
                    "replies": [
                        {
                            "body": "I'm starting to think your the criminal in question here 😂 \n\nIntimacy is not an expectation in sugar relationships, however arrangements are based on gaining certain \"benefits\" which are to be mutually beneficial. I only mentioned time to define value, but point is OP was scammed and suffered loss which could be grounds for legal proceedings. The end!",
                            "author": "Billionbabe",
                            "id": "f301kwa",
                            "parent_id": "t1_f2zzjfc",
                            "score": 4,
                            "created_utc": 1570544262.0,
                            "replies": [
                                {
                                    "body": "She suffered a loss due to a mutually beneficial agreement that included money for sex, which is an illegal contract.   You cannot contract sex for money (ie...the mutual benefits) legally in Los Angeles.  Therefore, there is no legal contract, and no case.   You can't go to court and ask for money back in an arrangement that the court would deem illegal, and lying in court about the arrangement being only for time is perjury.  She has no case.  She has no legal proceeding.",
                                    "author": "Academic_Set",
                                    "id": "f302d09",
                                    "parent_id": "t1_f301kwa",
                                    "score": 4,
                                    "created_utc": 1570544795.0,
                                    "replies": []
                                },
                                {
                                    "body": "If I sell some drugs to a person and they give me fake money, should I also report them? I’m sorry but what happened is considered illegal in the US as much as some people on this forum want to think otherwise. Don’t give someone bad legal advice that could get them into trouble.",
                                    "author": "FireWater86",
                                    "id": "f30eyra",
                                    "parent_id": "t1_f301kwa",
                                    "score": 2,
                                    "created_utc": 1570552926.0,
                                    "replies": [
                                        {
                                            "body": "Sugar relationships are not illegal though so it's not comparable to drug dealing. Financial assistance in exchange for benefits is also NOT illegal. Lastly, I have not given legal advise, I merely suggested a number of scenarios for OP to explore if/when she decides to seek legal advise. 🙄",
                                            "author": "Billionbabe",
                                            "id": "f31lju2",
                                            "parent_id": "t1_f30eyra",
                                            "score": 1,
                                            "created_utc": 1570578472.0,
                                            "replies": [
                                                {
                                                    "body": "It seems pretty debatable from the details she described but okay! I just don’t think you should tell someone to get the law involved when the transaction was made in questionable circumstances and they didn’t ask for advice about whether to get law enforcement involved.",
                                                    "author": "FireWater86",
                                                    "id": "f31nade",
                                                    "parent_id": "t1_f31lju2",
                                                    "score": 1,
                                                    "created_utc": 1570579767.0,
                                                    "replies": [
                                                        {
                                                            "body": "You're entitled to your opinion, but without all the facts we really can't be certain of what's questionable or not. OP was scammed and became victim of a crime, she is well within her rights to involve the law if she chooses to.",
                                                            "author": "Billionbabe",
                                                            "id": "f32j09i",
                                                            "parent_id": "t1_f31nade",
                                                            "score": 1,
                                                            "created_utc": 1570612445.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Are you serious?\n\nContracting someone for time and intimacy associated within that time is illegal.",
            "author": "Academic_Set",
            "id": "f2zzjfc",
            "parent_id": "t1_f2zypom",
            "score": 5,
            "created_utc": 1570542824.0,
            "replies": [
                {
                    "body": "I'm starting to think your the criminal in question here 😂 \n\nIntimacy is not an expectation in sugar relationships, however arrangements are based on gaining certain \"benefits\" which are to be mutually beneficial. I only mentioned time to define value, but point is OP was scammed and suffered loss which could be grounds for legal proceedings. The end!",
                    "author": "Billionbabe",
                    "id": "f301kwa",
                    "parent_id": "t1_f2zzjfc",
                    "score": 4,
                    "created_utc": 1570544262.0,
                    "replies": [
                        {
                            "body": "She suffered a loss due to a mutually beneficial agreement that included money for sex, which is an illegal contract.   You cannot contract sex for money (ie...the mutual benefits) legally in Los Angeles.  Therefore, there is no legal contract, and no case.   You can't go to court and ask for money back in an arrangement that the court would deem illegal, and lying in court about the arrangement being only for time is perjury.  She has no case.  She has no legal proceeding.",
                            "author": "Academic_Set",
                            "id": "f302d09",
                            "parent_id": "t1_f301kwa",
                            "score": 4,
                            "created_utc": 1570544795.0,
                            "replies": []
                        },
                        {
                            "body": "If I sell some drugs to a person and they give me fake money, should I also report them? I’m sorry but what happened is considered illegal in the US as much as some people on this forum want to think otherwise. Don’t give someone bad legal advice that could get them into trouble.",
                            "author": "FireWater86",
                            "id": "f30eyra",
                            "parent_id": "t1_f301kwa",
                            "score": 2,
                            "created_utc": 1570552926.0,
                            "replies": [
                                {
                                    "body": "Sugar relationships are not illegal though so it's not comparable to drug dealing. Financial assistance in exchange for benefits is also NOT illegal. Lastly, I have not given legal advise, I merely suggested a number of scenarios for OP to explore if/when she decides to seek legal advise. 🙄",
                                    "author": "Billionbabe",
                                    "id": "f31lju2",
                                    "parent_id": "t1_f30eyra",
                                    "score": 1,
                                    "created_utc": 1570578472.0,
                                    "replies": [
                                        {
                                            "body": "It seems pretty debatable from the details she described but okay! I just don’t think you should tell someone to get the law involved when the transaction was made in questionable circumstances and they didn’t ask for advice about whether to get law enforcement involved.",
                                            "author": "FireWater86",
                                            "id": "f31nade",
                                            "parent_id": "t1_f31lju2",
                                            "score": 1,
                                            "created_utc": 1570579767.0,
                                            "replies": [
                                                {
                                                    "body": "You're entitled to your opinion, but without all the facts we really can't be certain of what's questionable or not. OP was scammed and became victim of a crime, she is well within her rights to involve the law if she chooses to.",
                                                    "author": "Billionbabe",
                                                    "id": "f32j09i",
                                                    "parent_id": "t1_f31nade",
                                                    "score": 1,
                                                    "created_utc": 1570612445.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I'm starting to think your the criminal in question here 😂 \n\nIntimacy is not an expectation in sugar relationships, however arrangements are based on gaining certain \"benefits\" which are to be mutually beneficial. I only mentioned time to define value, but point is OP was scammed and suffered loss which could be grounds for legal proceedings. The end!",
            "author": "Billionbabe",
            "id": "f301kwa",
            "parent_id": "t1_f2zzjfc",
            "score": 4,
            "created_utc": 1570544262.0,
            "replies": [
                {
                    "body": "She suffered a loss due to a mutually beneficial agreement that included money for sex, which is an illegal contract.   You cannot contract sex for money (ie...the mutual benefits) legally in Los Angeles.  Therefore, there is no legal contract, and no case.   You can't go to court and ask for money back in an arrangement that the court would deem illegal, and lying in court about the arrangement being only for time is perjury.  She has no case.  She has no legal proceeding.",
                    "author": "Academic_Set",
                    "id": "f302d09",
                    "parent_id": "t1_f301kwa",
                    "score": 4,
                    "created_utc": 1570544795.0,
                    "replies": []
                },
                {
                    "body": "If I sell some drugs to a person and they give me fake money, should I also report them? I’m sorry but what happened is considered illegal in the US as much as some people on this forum want to think otherwise. Don’t give someone bad legal advice that could get them into trouble.",
                    "author": "FireWater86",
                    "id": "f30eyra",
                    "parent_id": "t1_f301kwa",
                    "score": 2,
                    "created_utc": 1570552926.0,
                    "replies": [
                        {
                            "body": "Sugar relationships are not illegal though so it's not comparable to drug dealing. Financial assistance in exchange for benefits is also NOT illegal. Lastly, I have not given legal advise, I merely suggested a number of scenarios for OP to explore if/when she decides to seek legal advise. 🙄",
                            "author": "Billionbabe",
                            "id": "f31lju2",
                            "parent_id": "t1_f30eyra",
                            "score": 1,
                            "created_utc": 1570578472.0,
                            "replies": [
                                {
                                    "body": "It seems pretty debatable from the details she described but okay! I just don’t think you should tell someone to get the law involved when the transaction was made in questionable circumstances and they didn’t ask for advice about whether to get law enforcement involved.",
                                    "author": "FireWater86",
                                    "id": "f31nade",
                                    "parent_id": "t1_f31lju2",
                                    "score": 1,
                                    "created_utc": 1570579767.0,
                                    "replies": [
                                        {
                                            "body": "You're entitled to your opinion, but without all the facts we really can't be certain of what's questionable or not. OP was scammed and became victim of a crime, she is well within her rights to involve the law if she chooses to.",
                                            "author": "Billionbabe",
                                            "id": "f32j09i",
                                            "parent_id": "t1_f31nade",
                                            "score": 1,
                                            "created_utc": 1570612445.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "She suffered a loss due to a mutually beneficial agreement that included money for sex, which is an illegal contract.   You cannot contract sex for money (ie...the mutual benefits) legally in Los Angeles.  Therefore, there is no legal contract, and no case.   You can't go to court and ask for money back in an arrangement that the court would deem illegal, and lying in court about the arrangement being only for time is perjury.  She has no case.  She has no legal proceeding.",
            "author": "Academic_Set",
            "id": "f302d09",
            "parent_id": "t1_f301kwa",
            "score": 4,
            "created_utc": 1570544795.0,
            "replies": []
        },
        {
            "body": "If I sell some drugs to a person and they give me fake money, should I also report them? I’m sorry but what happened is considered illegal in the US as much as some people on this forum want to think otherwise. Don’t give someone bad legal advice that could get them into trouble.",
            "author": "FireWater86",
            "id": "f30eyra",
            "parent_id": "t1_f301kwa",
            "score": 2,
            "created_utc": 1570552926.0,
            "replies": [
                {
                    "body": "Sugar relationships are not illegal though so it's not comparable to drug dealing. Financial assistance in exchange for benefits is also NOT illegal. Lastly, I have not given legal advise, I merely suggested a number of scenarios for OP to explore if/when she decides to seek legal advise. 🙄",
                    "author": "Billionbabe",
                    "id": "f31lju2",
                    "parent_id": "t1_f30eyra",
                    "score": 1,
                    "created_utc": 1570578472.0,
                    "replies": [
                        {
                            "body": "It seems pretty debatable from the details she described but okay! I just don’t think you should tell someone to get the law involved when the transaction was made in questionable circumstances and they didn’t ask for advice about whether to get law enforcement involved.",
                            "author": "FireWater86",
                            "id": "f31nade",
                            "parent_id": "t1_f31lju2",
                            "score": 1,
                            "created_utc": 1570579767.0,
                            "replies": [
                                {
                                    "body": "You're entitled to your opinion, but without all the facts we really can't be certain of what's questionable or not. OP was scammed and became victim of a crime, she is well within her rights to involve the law if she chooses to.",
                                    "author": "Billionbabe",
                                    "id": "f32j09i",
                                    "parent_id": "t1_f31nade",
                                    "score": 1,
                                    "created_utc": 1570612445.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Sugar relationships are not illegal though so it's not comparable to drug dealing. Financial assistance in exchange for benefits is also NOT illegal. Lastly, I have not given legal advise, I merely suggested a number of scenarios for OP to explore if/when she decides to seek legal advise. 🙄",
            "author": "Billionbabe",
            "id": "f31lju2",
            "parent_id": "t1_f30eyra",
            "score": 1,
            "created_utc": 1570578472.0,
            "replies": [
                {
                    "body": "It seems pretty debatable from the details she described but okay! I just don’t think you should tell someone to get the law involved when the transaction was made in questionable circumstances and they didn’t ask for advice about whether to get law enforcement involved.",
                    "author": "FireWater86",
                    "id": "f31nade",
                    "parent_id": "t1_f31lju2",
                    "score": 1,
                    "created_utc": 1570579767.0,
                    "replies": [
                        {
                            "body": "You're entitled to your opinion, but without all the facts we really can't be certain of what's questionable or not. OP was scammed and became victim of a crime, she is well within her rights to involve the law if she chooses to.",
                            "author": "Billionbabe",
                            "id": "f32j09i",
                            "parent_id": "t1_f31nade",
                            "score": 1,
                            "created_utc": 1570612445.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "It seems pretty debatable from the details she described but okay! I just don’t think you should tell someone to get the law involved when the transaction was made in questionable circumstances and they didn’t ask for advice about whether to get law enforcement involved.",
            "author": "FireWater86",
            "id": "f31nade",
            "parent_id": "t1_f31lju2",
            "score": 1,
            "created_utc": 1570579767.0,
            "replies": [
                {
                    "body": "You're entitled to your opinion, but without all the facts we really can't be certain of what's questionable or not. OP was scammed and became victim of a crime, she is well within her rights to involve the law if she chooses to.",
                    "author": "Billionbabe",
                    "id": "f32j09i",
                    "parent_id": "t1_f31nade",
                    "score": 1,
                    "created_utc": 1570612445.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "You're entitled to your opinion, but without all the facts we really can't be certain of what's questionable or not. OP was scammed and became victim of a crime, she is well within her rights to involve the law if she chooses to.",
            "author": "Billionbabe",
            "id": "f32j09i",
            "parent_id": "t1_f31nade",
            "score": 1,
            "created_utc": 1570612445.0,
            "replies": []
        }
    ]
}