{
    "title": "Rough day in the sugar world for me.",
    "post_id": "f1hzxw",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/f1hzxw/rough_day_in_the_sugar_world_for_me/",
    "author": "noBDEforU",
    "body": "I have to contact the mother of the depressed, suicidal, baby I love.\n\nBackstory... I met a college sugar baby 2 and a half years ago.  Beautiful and lost, the kind of girl that simply steals your heart before you even know.  Depressed, abandonment issues, probably a borderline personality disorder.  She was always unpredictable and really just a terrible \"sugar baby\", so, it didn't last.  It barely even started, but the emotional part was there regardless.  We split, and no communication for about a year.  Then she reaches out.  \"She's more mature now, needs me, wants to try again.\"  Well, since I still love her, we try again.  This time, 3 months of the worst arrangement in the history of arrangements, and I have to pull the plug again.  But she is sincerely lost, and depressed and needs guidance and anyone, someone in her life to care for her.  Her family has moved across the country, she's alone.  So.. we continue to talk on occasion.  Grab a dinner here and there, but nothing more than that.  Fall semester of what we hope is her final senior year (anyone heard of the 6 year plan) and she can't pay for it.  Surrogate no-sugar Daddy gives her a loan, yeah I know, she's never going to pay it back.  She struggles through the semester.  \n\nThen Friday morning, I get the text.  \"Crashed my car, in jail, help me\". Of course, she doesn't respond to further texts or calls.  (Did I mention she holds a planetary achievement for terrible communication).  I have no idea where she is.  So.. I wait.  2 hours later, the police department calls, asks if I know said female, then puts her in the phone.  She asks if I can come and get her.  I'm 2 hours drive away I tell her I can be there in 2 hours.  She says forget it, she'll get someone else.  I reach out to a girl, aka my most recent sugar baby, who's in the next town and ask if she can get trainwreck girl.  She calls the police station and is told someone else is on the way.  But plus one for the sugar sisterhood, she tried.\n\nTrainwreck girl gets home, room in shared house near campus, and texts me that she'll call me.  Refuses to answer phone.  Finally.. the next night, calls me.  She's super depressed and suicidal, her car was her everything, her sanctuary, and its gone, devastation.  Oh, I bought it for her, btw.  \"We can get a new one.\" i say.  She tells me I don't understand and hangs up.  This goes on through 4 abbreviated phone calls.  I tell her I'm going to get her.  She tells me all the terrible drugs she's going to use to kill herself, tells me she won't see me.  Then tells me to get her.  Back and forth.  Fucking Trainwreck.  30 minutes into my late night drive.. she tells me she won't see me, don't come.  It's too much.  I know I can't help her.  I contact her mother through venmo.  Yeah.. it's the only way I could find her, leaving a message that her daughter is suicidal.  \n\nToday, I wake up to emails sent in my sleep.  She needs me to get her.  She's suicidal, she knows she needs me.  God.. heart wrenching.  I send the suicide hotline number to her.  Maybe she's still alive, probably, I don't know, but I can't do this shit.  She doesn't respond to any communication.\nI literally break down crying in the Staples parking lot.  Like wtf!  \n\nHer mother finally reacts to my venmo message, I'm older than the mother, btw.   We communicate on Google voice, text.  I don't want to disclose more than I need to.  She's on the phone with her daughter, she's alive.  I tell the mother about the drugs her daughter is on.  Apparently she didn't know.  I hope she's going to get the help she seriously needs now.  But I don't know, the mother is an anti-medicine, antivaxer, psychiatrists are evil.  Fingers crossed.\n\nSo.. my duty is done.  Who knows what the fallout will be.  The price of being a sugar daddy is sometimes heavier than we thought we could afford.\n\nEdit1: Thank you everyone for your thoughts and concerns.  It gives me hope, knowing that we're all humans with care for each other, that we have this community, not to just debate paid meet and greets, but to help each other as well.  I'm hoping she will get the help she needs finally.  I'll probably never see her again, and recognizing that her health is worth my heartache.  Fingers crossed.",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/f1hzxw/rough_day_in_the_sugar_world_for_me/",
    "score": 157,
    "upvote_ratio": 0.98,
    "created_utc": 1581294504.0,
    "num_comments": 61,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "I applaud you for being a stand-up guy and helping this girl out in her time of need. BUT...I also feel like the kind of help she needs is way beyond anything YOU can or even should - be expected to give. Your job is done, I'd simply back away from this girl until she gets her mental and emotional health together.",
            "author": "letsjusthavefunnow",
            "id": "fh69ui1",
            "parent_id": "t3_f1hzxw",
            "score": 55,
            "created_utc": 1581296467.0,
            "replies": [
                {
                    "body": "I agree. I was gonna comment something like this but I couldn't think of such a graceful way to word it. This is such a touchy situation, but she needs help for sure and I hope OP knows he can't give her everything she needs, unfortunately.",
                    "author": null,
                    "id": "fh7326n",
                    "parent_id": "t1_fh69ui1",
                    "score": 6,
                    "created_utc": 1581313396.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I will say something less popular. MNO, mean no offense, but you sound like the quintessential Knight in Shinning Armor going out of the way to help the damsel in distress. \n\nMy 40 plus years of walking on this planet have taught me a lot both in life and in business and such cases are to be avoided with an 90 foot pole. Sure we all want to help fellow humans but it depends on how fall into your circle of life. A former SB,  train wreck, nope. Actually I screen for mental stability and I don’t let SB’s who can’t give me that gut comfort.\n\nWhere is the catch! Everywhere. This lady will repeat this many times in her life over and over again. Each time she runs into trouble, she will call you. When the tornado passes she will forget you. What it will do to you is wreck you up mentally. Not worth it.\n\nYou ought to treat this like an incident on the freeway where you witness an accident, stay in to help until help arrives and then walk away for good.",
            "author": null,
            "id": "fh6srn5",
            "parent_id": "t3_f1hzxw",
            "score": 34,
            "created_utc": 1581305215.0,
            "replies": [
                {
                    "body": "> This lady will repeat this many times in her life over and over again. Each time she runs into trouble, she will call you. When the tornado passes she will forget you. What it will do to you is wreck you up mentally. Not worth it.\n\nI hate to say it...but I agree with this 100%. When dealing romantically with people who have serious mental health issues, it is a NEVER-ending unpredictable cycle. (Been there done that - won't do it again. Had a bipolar ex when vanilla dating and grew up with a sibling with BPD).",
                    "author": "letsjusthavefunnow",
                    "id": "fh73i6l",
                    "parent_id": "t1_fh6srn5",
                    "score": 13,
                    "created_utc": 1581313830.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Holy crap. These are the kind of guys who you don’t flake on, or act like he’s a walking ATM, ladies. Much respect, sir.",
            "author": "EastTexas_SD",
            "id": "fh64i7p",
            "parent_id": "t3_f1hzxw",
            "score": 65,
            "created_utc": 1581295128.0,
            "replies": []
        },
        {
            "body": "You're so sweet.  I just love caring guys like you.  I hope she gets the help she needs.  ❤️😘",
            "author": "naughtychick9999",
            "id": "fh65yr7",
            "parent_id": "t3_f1hzxw",
            "score": 20,
            "created_utc": 1581295510.0,
            "replies": []
        },
        {
            "body": "You have done your part,  now step away for your own good.   I have had my share of those types and it will never get better.  Chaos is what they do.",
            "author": "LotBuilder",
            "id": "fh6ni8p",
            "parent_id": "t3_f1hzxw",
            "score": 10,
            "created_utc": 1581301964.0,
            "replies": [
                {
                    "body": "They are human tornadoes who will destroy every one in their way. You don’t fight a tornado, you take shelter from it or stay out of its way.",
                    "author": null,
                    "id": "fh6tdov",
                    "parent_id": "t1_fh6ni8p",
                    "score": 7,
                    "created_utc": 1581305612.0,
                    "replies": [
                        {
                            "body": "Yep,  sadly it is like throwing time, money, energy and love into a black hole.",
                            "author": "LotBuilder",
                            "id": "fh6zeac",
                            "parent_id": "t1_fh6tdov",
                            "score": 5,
                            "created_utc": 1581310121.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "She’s lucky to of had someone to care for her wellbeing. You did more than the average person would! You were probably a source of security for her which is why she reached out. Hope everything gets better for her. And bless you kind sir for your efforts. ❤️",
            "author": "babylikesfinewine",
            "id": "fh6bbm7",
            "parent_id": "t3_f1hzxw",
            "score": 10,
            "created_utc": 1581296919.0,
            "replies": []
        },
        {
            "body": "that's such a terrible situation to be in. I am sorry you had to go through this, and I hope she gets the help she needs",
            "author": "GypsyDraig",
            "id": "fh666ms",
            "parent_id": "t3_f1hzxw",
            "score": 7,
            "created_utc": 1581295597.0,
            "replies": []
        },
        {
            "body": "Congrats for not running away, and also congrats for not trying to do too much. Very difficult path to walk and you are walking it with honor.",
            "author": "sugarthrowSD",
            "id": "fh6c099",
            "parent_id": "t3_f1hzxw",
            "score": 7,
            "created_utc": 1581297048.0,
            "replies": []
        },
        {
            "body": "You have done more than enough. This makes me so sad. When someone pays for you to go to school you do EVERYTHING you can to succeed- because thats how you thank them. When they are buying you a car etc., you learn to become a better communicator- because thats how you thank them. I'm sure there are many other examples too. Considering how amazing you were to her and how you offered so much financial and other support I just feel terrible this same level of care wasn't returned.",
            "author": "MJline",
            "id": "fh6nw9v",
            "parent_id": "t3_f1hzxw",
            "score": 5,
            "created_utc": 1581302146.0,
            "replies": []
        },
        {
            "body": "You are the person most people like myself can only dream of coming in contact with. I hope she is okay and your kindness is repaid to you ten-fold.",
            "author": "Bells08",
            "id": "fh71dfm",
            "parent_id": "t3_f1hzxw",
            "score": 4,
            "created_utc": 1581311839.0,
            "replies": []
        },
        {
            "body": "You are a much kinder person than I am.  At the first sign of the slightest drama from an SB I am moving on.  I generate zero drama for my SB’s and I expect the same in return.  To me the bowl is a drama-free zone. I hope she is okay but I’d encourage you to move on from her for your own sake.",
            "author": "cooldudeATX",
            "id": "fh68ydq",
            "parent_id": "t3_f1hzxw",
            "score": 10,
            "created_utc": 1581296292.0,
            "replies": []
        },
        {
            "body": "I really appreciate this more than necessary patience and kindness you have this girl. As a SB and younger girl with borderline personality disorder nobody really does this",
            "author": null,
            "id": "fh6ieyx",
            "parent_id": "t3_f1hzxw",
            "score": 8,
            "created_utc": 1581299443.0,
            "replies": [
                {
                    "body": "I think it's my weakness",
                    "author": "noBDEforU",
                    "id": "fh6l2ux",
                    "parent_id": "t1_fh6ieyx",
                    "score": 3,
                    "created_utc": 1581300775.0,
                    "replies": [
                        {
                            "body": "If you look at it that way or it good be your strength you have excellent emotional intelligence. \n\nI do see how it can be a bit of a tragic flaw in an abstract way like as a hero, I understand that being in these situations isn’t health for yourself and being over empathetic and self sacrificing can drain you even though they produce positive effects for other people",
                            "author": null,
                            "id": "fh6m3ho",
                            "parent_id": "t1_fh6l2ux",
                            "score": 2,
                            "created_utc": 1581301278.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "You are a real angel. Coming from another part of the community with mental health issues, you really did all you could and more. I wish you the best of luck and know you will be blessed and bless others with your kind heart.",
            "author": "sickandsiiick",
            "id": "fh6quje",
            "parent_id": "t3_f1hzxw",
            "score": 3,
            "created_utc": 1581303853.0,
            "replies": []
        },
        {
            "body": "You can only do so much for someone like that.There is no reasoning with them. Hope she gets the help she needs.",
            "author": "agjrpsl",
            "id": "fh6toqx",
            "parent_id": "t3_f1hzxw",
            "score": 3,
            "created_utc": 1581305832.0,
            "replies": []
        },
        {
            "body": "I actually remember this story from a while ago (thinking its the same one). I applaud you for doing what you could, but I also feel like you're enabling her bad behavior. This is coming from someone who has a diagnosis of severe depression and was almost pink slipped in my early 20's. Sometimes its just best to let people hit their rock bottom.",
            "author": null,
            "id": "fh73zvt",
            "parent_id": "t3_f1hzxw",
            "score": 3,
            "created_utc": 1581314319.0,
            "replies": []
        },
        {
            "body": "Wow. I'm fairly apathetic and this just made my heart beat like twice for the girl and thrice for you. Congrats on just being you. You're a stand-up gentleman.",
            "author": "atypicalsb",
            "id": "fh646e8",
            "parent_id": "t3_f1hzxw",
            "score": 8,
            "created_utc": 1581295018.0,
            "replies": []
        },
        {
            "body": "I once had to tell my boyfriend at the times parents the same thing. It’s tough. He hated me for it. But they did get him help. We’re no longer together and he’s still depressed but at least he’s not on a bunch of drugs and I can rest easy knowing I did the best I could.",
            "author": "VGV1993",
            "id": "fh6io0n",
            "parent_id": "t3_f1hzxw",
            "score": 2,
            "created_utc": 1581299612.0,
            "replies": []
        },
        {
            "body": "Yep. This kind of stuff happens and you need to be there for the person. So much for Sugar dating is just transactional. Thanks for doing the right thing.",
            "author": "ab1035",
            "id": "fh6jd1f",
            "parent_id": "t3_f1hzxw",
            "score": 2,
            "created_utc": 1581299941.0,
            "replies": []
        },
        {
            "body": "*\"Realizing that her health is worth my heartache\"*\n\nThat is beautiful, and heart breaking.\n\nAnd I know from first hand experience how hard it is living with that sort of broken in your life. I also know how hard it is to walk away, how much strength it takes to do so. I unfortunately am not as strong as you. \nYou did the right thing ❤️",
            "author": "Dressedtokillxxx",
            "id": "fh6je3t",
            "parent_id": "t3_f1hzxw",
            "score": 2,
            "created_utc": 1581299955.0,
            "replies": []
        },
        {
            "body": "Oh wow. My heart aches for you. Loving someone who is broken, or feels thay way is gut wrenching. Its also a testament to who you are as a person. Take care of yourself ❤",
            "author": "OliviaWildflower2332",
            "id": "fh6xf3k",
            "parent_id": "t3_f1hzxw",
            "score": 2,
            "created_utc": 1581308569.0,
            "replies": []
        },
        {
            "body": "You’re a sweet person. ❤️",
            "author": null,
            "id": "fh6xh0j",
            "parent_id": "t3_f1hzxw",
            "score": 2,
            "created_utc": 1581308611.0,
            "replies": [
                {
                    "body": "Thank you",
                    "author": "noBDEforU",
                    "id": "fh70lmw",
                    "parent_id": "t1_fh6xh0j",
                    "score": 1,
                    "created_utc": 1581311150.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I read this and I just wish I could give you a hug. Without going into to much detail,to a degree I understand your pain. At the end of the day you can’t help someone who won’t help themselves. As someone else said it’s a tornado that you’re throwing your resources into. You’ll never get them back. \n\nAlso as someone who’s been officially diagnosed with bpd(among other things) it’s never ok for her to leave you in the dark. Mental illness is 100% not her fault but it’s still 100% her responsibility. It sounds harsh but it’s the truth. It’s something I’ve had to drill into my head over the years when helping out(playing savior) friends/exes. It’s also something I’ve had to drill into my head for myself and my actions towards others.",
            "author": "soullessfreckles",
            "id": "fh7ifhn",
            "parent_id": "t3_f1hzxw",
            "score": 2,
            "created_utc": 1581333425.0,
            "replies": []
        },
        {
            "body": "You're such a beautiful man. I hope you know that you made a difference and you're probably the reason why a young woman is still breathing today. Don't be hard on yourself, take time to take care of your own mental and physical wellbeing cos you've just been through a very tough emotional & physical situation. Sending lots of love and light your way, OP. ♥️",
            "author": "PioneerExperience",
            "id": "fh7o5r5",
            "parent_id": "t3_f1hzxw",
            "score": 2,
            "created_utc": 1581339773.0,
            "replies": []
        },
        {
            "body": "She needs a psychiatric intensive care unit right now... hopefully she'll get the care she needs. The OP has gone above and beyond the call of SD duty...",
            "author": "aesthete2061",
            "id": "fh9pm4u",
            "parent_id": "t3_f1hzxw",
            "score": 2,
            "created_utc": 1581386747.0,
            "replies": [
                {
                    "body": "Hopefully she's headed there with her family",
                    "author": "noBDEforU",
                    "id": "fh9sp4g",
                    "parent_id": "t1_fh9pm4u",
                    "score": 1,
                    "created_utc": 1581388718.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "This is awful for your mental and physical health.\n\nThere aren't as many healthy, happy days left in your future as there were when you were younger. Isn't your primary responsibility to yourself, and to get the most from the time you are given?\n\nIf this is your way of making your life more meaningful, ask yourself: If the roles were reversed, would this woman even give a passing thought to your predicament?\n\nEmotional health trumps all else. Be grateful for each moment, and live in the now.",
            "author": "BusddhistDSM",
            "id": "fh6apbr",
            "parent_id": "t3_f1hzxw",
            "score": 6,
            "created_utc": 1581296765.0,
            "replies": [
                {
                    "body": "Most people’s emotional health would be worse If they just ignored someone like this. Studies show Helping people makes you happier & healthier than focusing only on yourself. He’s focusing on himself & likely some others now after he got her to a safe place. I’m not saying everyone has to go to these lengths or do anything, but when you help someone, it’s a fantastic feeling. Just knowing she’s alive, not in jail, & has a chance is wonderful.  \n\nHe did it because it was the right thing to do & he cares about her, not to find meaning. What ‘meaning’ is there in unoriginally just looking out for yourself? Some people treat others the way they would like to be treated.  They don’t think- hmm, would this (apparently mentally ill or substance abuser) person do this for me? No, well I shouldn’t help them. \n\nI enjoy being around the first group much more.  It has a big, positive impact on my emotional health:)",
                    "author": "happyleap",
                    "id": "fh6iovb",
                    "parent_id": "t1_fh6apbr",
                    "score": 10,
                    "created_utc": 1581299627.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fh6977n",
            "parent_id": "t3_f1hzxw",
            "score": 2,
            "created_utc": 1581296326.0,
            "replies": [
                {
                    "body": "Who's to say",
                    "author": "noBDEforU",
                    "id": "fh6cukb",
                    "parent_id": "t1_fh6977n",
                    "score": 7,
                    "created_utc": 1581297372.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I think you did everything right. I’ve also been contacted by someone suicidal and after I did everything in my power to get him help, I backed away and let his family and the professionals do their job. It’s best that you take time for yourself and take care of your own mental health after helping with her crisis and although it may seem harsh- cut ties with her. It’s for the best. She may not know it now, but maybe sugaring (and anyone associated with sugaring) is a trigger for her.",
            "author": "N1595",
            "id": "fh6fmcn",
            "parent_id": "t3_f1hzxw",
            "score": 1,
            "created_utc": 1581298328.0,
            "replies": []
        },
        {
            "body": "You’re an amazing person for caring and putting up with that when you didn’t have to. \n\nIt made me smile seeing that sugar baby solidarity too, that the one was willing to go pick up the other. There’s so much about sugaring we have to hide from our friends, it’s nice when we can stick together for each other!",
            "author": "isglitteracolor",
            "id": "fh6icpc",
            "parent_id": "t3_f1hzxw",
            "score": 1,
            "created_utc": 1581299400.0,
            "replies": []
        },
        {
            "body": "This is such an incredibly heart lifting post. Everyone faces dark periods in life and the kindness and care of a stranger or friend goes a long way. It’s a human to human thing. Much love. 😇",
            "author": "techiesugar",
            "id": "fh6omgv",
            "parent_id": "t3_f1hzxw",
            "score": 1,
            "created_utc": 1581302485.0,
            "replies": []
        },
        {
            "body": "Always caring a bit too much; I understand. But sometimes, we can’t help where are hearts go.\n\nI hope that she finds what she needs, you did what you could for her and the rest, you cannot help with. I feel so sorry for you and this whole situation, best of luck to both of you.",
            "author": "why_so_sexy_",
            "id": "fh6p27v",
            "parent_id": "t3_f1hzxw",
            "score": 1,
            "created_utc": 1581302697.0,
            "replies": []
        },
        {
            "body": "Wow. That's a lot. Kudos to you for being a great human.",
            "author": "th24th24",
            "id": "fh6scsr",
            "parent_id": "t3_f1hzxw",
            "score": 1,
            "created_utc": 1581304921.0,
            "replies": []
        },
        {
            "body": "You deserve the biggest, warmest hug for how well you handled all of that. I hope she gets better and I hope you can move on from this. You're a good person.",
            "author": "Mopsydoll",
            "id": "fh74tqm",
            "parent_id": "t3_f1hzxw",
            "score": 1,
            "created_utc": 1581315160.0,
            "replies": []
        },
        {
            "body": "Top Mark to you and your current SB!",
            "author": "eurosd",
            "id": "fh79qb4",
            "parent_id": "t3_f1hzxw",
            "score": 1,
            "created_utc": 1581320889.0,
            "replies": [
                {
                    "body": "Thank you, though, the second is a past SB.  I have been out of the bowl for a few months.",
                    "author": "noBDEforU",
                    "id": "fh7jj47",
                    "parent_id": "t1_fh79qb4",
                    "score": 1,
                    "created_utc": 1581334857.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Had my fair share of trainwrecks, well, no-one come close to this girl, my 2 cents:\n1. Back the fuck off...\n2. And vanish...\n3. She has a lot of problems, you cant solve them for her... dont play savior to someone this unstable...\n\nSalut! For being so standup! You bring good name to the men in the bowl, make me feel better about 1000s I have spent over trying to help girls like this one in tge bowl...",
            "author": "generousexec",
            "id": "fh79yvl",
            "parent_id": "t3_f1hzxw",
            "score": 1,
            "created_utc": 1581321195.0,
            "replies": []
        },
        {
            "body": "Until you realize that a LOT of these women in the bowl are teetering on this kind of desperation, you will not really get the point of why they are sugaring.",
            "author": "Academic_Set",
            "id": "fh7ppdb",
            "parent_id": "t3_f1hzxw",
            "score": 1,
            "created_utc": 1581341190.0,
            "replies": [
                {
                    "body": "I'm fully aware",
                    "author": "noBDEforU",
                    "id": "fh7pqio",
                    "parent_id": "t1_fh7ppdb",
                    "score": 1,
                    "created_utc": 1581341218.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "What Woody Allen called a Kamikaze Woman",
            "author": "doctorcoolpop",
            "id": "fh85q1s",
            "parent_id": "t3_f1hzxw",
            "score": 1,
            "created_utc": 1581352615.0,
            "replies": []
        },
        {
            "body": "This is a really tough situation. I hope she can get the help and support she needs - kudos to you for wrapping the family in to her struggle.",
            "author": "roscoe7585",
            "id": "fh8rmc4",
            "parent_id": "t3_f1hzxw",
            "score": 1,
            "created_utc": 1581365946.0,
            "replies": []
        },
        {
            "body": "You're a way nicer person than I am. I would have blocked someone like that from here to takertown.",
            "author": "emptyoverflow",
            "id": "fh8vxp3",
            "parent_id": "t3_f1hzxw",
            "score": 1,
            "created_utc": 1581368473.0,
            "replies": []
        },
        {
            "body": "She needs a bed in a PICU not an SD.\n\nPICU = Psychiatric Intensive Care Unit.",
            "author": "aesthete2061",
            "id": "fh9p6kz",
            "parent_id": "t3_f1hzxw",
            "score": 1,
            "created_utc": 1581386460.0,
            "replies": []
        },
        {
            "body": "As someone who is a fellow human in-progress and sb with depression you did the right thing! Negativity is a disease that will spread! It sounds like she was trying to get others to motivate her, when she’s the only one who can help herself. When I wake up in the morning, I have to choose to smile, choose to be happy, even if it’s hard. I don’t know her exact situation but it’s no excuse to harm others. You need to hold her responsible even if it’s hard for you. Unfortunately if you don’t you’re only enabling this behavior. I hope things turned out okay. Take care of yourself. Hope you’re healing.",
            "author": "yoyoyoswag123",
            "id": "fosf5j4",
            "parent_id": "t3_f1hzxw",
            "score": 1,
            "created_utc": 1588029501.0,
            "replies": []
        },
        {
            "body": "If you ignore that many red flags because of a pretty face, this is the kind of mess you eventually end up in. I stay away from unstable, bipolar, addicted, self destructive types because they cannot be saved and always suck you into their mess. Wouldn't fuck them with a 10' pole",
            "author": "Casual_DM",
            "id": "fh87z4y",
            "parent_id": "t3_f1hzxw",
            "score": 1,
            "created_utc": 1581354023.0,
            "replies": []
        },
        {
            "body": "wow, all this for no sugar",
            "author": "SnoopTheWire",
            "id": "fh6prk4",
            "parent_id": "t3_f1hzxw",
            "score": 0,
            "created_utc": 1581303102.0,
            "replies": []
        },
        {
            "body": "One of my sbs showed up to a meet with her wrists cut. That was the last time i saw her, and she ended up in the hospital a year later.",
            "author": "dade_murphy1",
            "id": "fh74gro",
            "parent_id": "t3_f1hzxw",
            "score": 0,
            "created_utc": 1581314792.0,
            "replies": [
                {
                    "body": "Holy fk!",
                    "author": "noBDEforU",
                    "id": "fh7lbds",
                    "parent_id": "t1_fh74gro",
                    "score": 2,
                    "created_utc": 1581336953.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "You sound like you've taken being a john to pro-level",
            "author": "naturalheightgainer",
            "id": "fh6mtgz",
            "parent_id": "t3_f1hzxw",
            "score": -5,
            "created_utc": 1581301626.0,
            "replies": [
                {
                    "body": "Maybe you don't know what a sugar baby is",
                    "author": "noBDEforU",
                    "id": "fh6nebw",
                    "parent_id": "t1_fh6mtgz",
                    "score": 10,
                    "created_utc": 1581301912.0,
                    "replies": []
                },
                {
                    "body": "Actually he’s the exact opposite of a John.",
                    "author": "soullessfreckles",
                    "id": "fh7i16i",
                    "parent_id": "t1_fh6mtgz",
                    "score": 3,
                    "created_utc": 1581332874.0,
                    "replies": [
                        {
                            "body": "she takes his $, she'll accept his a$$i$tance, but otherwise won't communicate with him.  Hustler-to-john dynamic",
                            "author": "naturalheightgainer",
                            "id": "fh7idf9",
                            "parent_id": "t1_fh7i16i",
                            "score": 0,
                            "created_utc": 1581333348.0,
                            "replies": [
                                {
                                    "body": "She’s not physically capable of being a John 😑.",
                                    "author": "soullessfreckles",
                                    "id": "fh7iizk",
                                    "parent_id": "t1_fh7idf9",
                                    "score": 2,
                                    "created_utc": 1581333554.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I agree. I was gonna comment something like this but I couldn't think of such a graceful way to word it. This is such a touchy situation, but she needs help for sure and I hope OP knows he can't give her everything she needs, unfortunately.",
            "author": null,
            "id": "fh7326n",
            "parent_id": "t1_fh69ui1",
            "score": 6,
            "created_utc": 1581313396.0,
            "replies": []
        },
        {
            "body": "> This lady will repeat this many times in her life over and over again. Each time she runs into trouble, she will call you. When the tornado passes she will forget you. What it will do to you is wreck you up mentally. Not worth it.\n\nI hate to say it...but I agree with this 100%. When dealing romantically with people who have serious mental health issues, it is a NEVER-ending unpredictable cycle. (Been there done that - won't do it again. Had a bipolar ex when vanilla dating and grew up with a sibling with BPD).",
            "author": "letsjusthavefunnow",
            "id": "fh73i6l",
            "parent_id": "t1_fh6srn5",
            "score": 13,
            "created_utc": 1581313830.0,
            "replies": []
        },
        {
            "body": "They are human tornadoes who will destroy every one in their way. You don’t fight a tornado, you take shelter from it or stay out of its way.",
            "author": null,
            "id": "fh6tdov",
            "parent_id": "t1_fh6ni8p",
            "score": 7,
            "created_utc": 1581305612.0,
            "replies": [
                {
                    "body": "Yep,  sadly it is like throwing time, money, energy and love into a black hole.",
                    "author": "LotBuilder",
                    "id": "fh6zeac",
                    "parent_id": "t1_fh6tdov",
                    "score": 5,
                    "created_utc": 1581310121.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I think it's my weakness",
            "author": "noBDEforU",
            "id": "fh6l2ux",
            "parent_id": "t1_fh6ieyx",
            "score": 3,
            "created_utc": 1581300775.0,
            "replies": [
                {
                    "body": "If you look at it that way or it good be your strength you have excellent emotional intelligence. \n\nI do see how it can be a bit of a tragic flaw in an abstract way like as a hero, I understand that being in these situations isn’t health for yourself and being over empathetic and self sacrificing can drain you even though they produce positive effects for other people",
                    "author": null,
                    "id": "fh6m3ho",
                    "parent_id": "t1_fh6l2ux",
                    "score": 2,
                    "created_utc": 1581301278.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Thank you",
            "author": "noBDEforU",
            "id": "fh70lmw",
            "parent_id": "t1_fh6xh0j",
            "score": 1,
            "created_utc": 1581311150.0,
            "replies": []
        },
        {
            "body": "Hopefully she's headed there with her family",
            "author": "noBDEforU",
            "id": "fh9sp4g",
            "parent_id": "t1_fh9pm4u",
            "score": 1,
            "created_utc": 1581388718.0,
            "replies": []
        },
        {
            "body": "Most people’s emotional health would be worse If they just ignored someone like this. Studies show Helping people makes you happier & healthier than focusing only on yourself. He’s focusing on himself & likely some others now after he got her to a safe place. I’m not saying everyone has to go to these lengths or do anything, but when you help someone, it’s a fantastic feeling. Just knowing she’s alive, not in jail, & has a chance is wonderful.  \n\nHe did it because it was the right thing to do & he cares about her, not to find meaning. What ‘meaning’ is there in unoriginally just looking out for yourself? Some people treat others the way they would like to be treated.  They don’t think- hmm, would this (apparently mentally ill or substance abuser) person do this for me? No, well I shouldn’t help them. \n\nI enjoy being around the first group much more.  It has a big, positive impact on my emotional health:)",
            "author": "happyleap",
            "id": "fh6iovb",
            "parent_id": "t1_fh6apbr",
            "score": 10,
            "created_utc": 1581299627.0,
            "replies": []
        },
        {
            "body": "Who's to say",
            "author": "noBDEforU",
            "id": "fh6cukb",
            "parent_id": "t1_fh6977n",
            "score": 7,
            "created_utc": 1581297372.0,
            "replies": []
        },
        {
            "body": "Thank you, though, the second is a past SB.  I have been out of the bowl for a few months.",
            "author": "noBDEforU",
            "id": "fh7jj47",
            "parent_id": "t1_fh79qb4",
            "score": 1,
            "created_utc": 1581334857.0,
            "replies": []
        },
        {
            "body": "I'm fully aware",
            "author": "noBDEforU",
            "id": "fh7pqio",
            "parent_id": "t1_fh7ppdb",
            "score": 1,
            "created_utc": 1581341218.0,
            "replies": []
        },
        {
            "body": "Holy fk!",
            "author": "noBDEforU",
            "id": "fh7lbds",
            "parent_id": "t1_fh74gro",
            "score": 2,
            "created_utc": 1581336953.0,
            "replies": []
        },
        {
            "body": "Maybe you don't know what a sugar baby is",
            "author": "noBDEforU",
            "id": "fh6nebw",
            "parent_id": "t1_fh6mtgz",
            "score": 10,
            "created_utc": 1581301912.0,
            "replies": []
        },
        {
            "body": "Actually he’s the exact opposite of a John.",
            "author": "soullessfreckles",
            "id": "fh7i16i",
            "parent_id": "t1_fh6mtgz",
            "score": 3,
            "created_utc": 1581332874.0,
            "replies": [
                {
                    "body": "she takes his $, she'll accept his a$$i$tance, but otherwise won't communicate with him.  Hustler-to-john dynamic",
                    "author": "naturalheightgainer",
                    "id": "fh7idf9",
                    "parent_id": "t1_fh7i16i",
                    "score": 0,
                    "created_utc": 1581333348.0,
                    "replies": [
                        {
                            "body": "She’s not physically capable of being a John 😑.",
                            "author": "soullessfreckles",
                            "id": "fh7iizk",
                            "parent_id": "t1_fh7idf9",
                            "score": 2,
                            "created_utc": 1581333554.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yep,  sadly it is like throwing time, money, energy and love into a black hole.",
            "author": "LotBuilder",
            "id": "fh6zeac",
            "parent_id": "t1_fh6tdov",
            "score": 5,
            "created_utc": 1581310121.0,
            "replies": []
        },
        {
            "body": "If you look at it that way or it good be your strength you have excellent emotional intelligence. \n\nI do see how it can be a bit of a tragic flaw in an abstract way like as a hero, I understand that being in these situations isn’t health for yourself and being over empathetic and self sacrificing can drain you even though they produce positive effects for other people",
            "author": null,
            "id": "fh6m3ho",
            "parent_id": "t1_fh6l2ux",
            "score": 2,
            "created_utc": 1581301278.0,
            "replies": []
        },
        {
            "body": "she takes his $, she'll accept his a$$i$tance, but otherwise won't communicate with him.  Hustler-to-john dynamic",
            "author": "naturalheightgainer",
            "id": "fh7idf9",
            "parent_id": "t1_fh7i16i",
            "score": 0,
            "created_utc": 1581333348.0,
            "replies": [
                {
                    "body": "She’s not physically capable of being a John 😑.",
                    "author": "soullessfreckles",
                    "id": "fh7iizk",
                    "parent_id": "t1_fh7idf9",
                    "score": 2,
                    "created_utc": 1581333554.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "She’s not physically capable of being a John 😑.",
            "author": "soullessfreckles",
            "id": "fh7iizk",
            "parent_id": "t1_fh7idf9",
            "score": 2,
            "created_utc": 1581333554.0,
            "replies": []
        }
    ]
}