{
    "title": "The joy you bring.",
    "post_id": "iiogdh",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/iiogdh/the_joy_you_bring/",
    "author": "realitytomydreams",
    "body": "It’s 1:25 am and I’m lying on my couch replaying the scenes from my date with my SB earlier tonight.\n\nIt was another date full of laughter and cuddles and I suddenly find tears welling up in my eyes because finally in a long time, I found someone who makes me happy.\n\nI’ve gone about my 20s dedicating my life to work. I stopped looking for relationships and have gone for years without being with anyone. I would find someone and it just wouldn’t work out. And eventually I just stopped trying and got used to doing things by myself.\n\nSuddenly in my 30s, I found myself uprooting my single life and moving to the US to help rebuild a team. While my career path is now set, I also found myself alone, without family and friends in a new country.\n\nEventually I discovered the sugar bowl and made big mistakes with my first two SRs. And then out of nowhere, my current SB appeared in my DMs. Little did I know, she would go on to create this big impact in my life.\n\nIt’s amazing how getting a text message from her would relieve a stressful day at work, looking at her pictures would put this big smile on my face and thinking about past conversations would give me a chuckle or two.\n\nWith her in the picture, my life finally feels... complete. Work while stressful is projecting me towards my career goals and in my personal life, I finally found someone who’s able to give me the companionship, affection, emotional connection, physical intimacy and friendship I need in my life right now.\n\nUnfortunately my immigration status remains up in the air with the current administration which is why I cannot commit to anyone right now and prefer sugar dating over vanilla.\n\nWhile I know SRs may not last forever, I still get anxiety issues every now and then that this incredible SR I have with my SB will end one day.\n\nBut if our SR ever comes to an end, I will wish her well, happiness and love and I will always carry with me the happy memories we’ve had together. But until then, I will be here for as long as I can and I will do my best to give her all the happiness she deserves.\n\nTo my beautiful and amazing SB, I found a wonderful friend in you. And I cannot thank you enough for the joy you’ve brought to my life. ❤️",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/iiogdh/the_joy_you_bring/",
    "score": 96,
    "upvote_ratio": 0.94,
    "created_utc": 1598686351.0,
    "num_comments": 10,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "This is the best.  Might she read your post?",
            "author": "TY2022",
            "id": "g382sae",
            "parent_id": "t3_iiogdh",
            "score": 14,
            "created_utc": 1598690135.0,
            "replies": []
        },
        {
            "body": "Ohh... finally, a sweet SR story to make all our heart melt. I really appreciate how responsible you're about your relationships and how much you value the people in your life.",
            "author": "sautan21",
            "id": "g385x3t",
            "parent_id": "t3_iiogdh",
            "score": 11,
            "created_utc": 1598693423.0,
            "replies": []
        },
        {
            "body": "This is such a heartfelt post and a fresh reminder that SW is an amazing industry for us empaths. I have struggled in vanilla work simply because I couldn't handle not being able to constantly please/make everyone happy.",
            "author": null,
            "id": "g394t0z",
            "parent_id": "t3_iiogdh",
            "score": 3,
            "created_utc": 1598718187.0,
            "replies": []
        },
        {
            "body": "Awe 💕💕💕. I love to hear SD’s gush about their Sb/Sr. I often wonder how much of an impact I make on my SD’s life.  Hopefully, I make him feel somewhere close to what you just described. \n\nHappy for you!",
            "author": "ImaginaryBullfrog5",
            "id": "g39382b",
            "parent_id": "t3_iiogdh",
            "score": 2,
            "created_utc": 1598717501.0,
            "replies": []
        },
        {
            "body": "If your SB is American, maybe you can marry her , get a green card - then your life will truly be complete!",
            "author": "angelhair12",
            "id": "g39ef3k",
            "parent_id": "t3_iiogdh",
            "score": 2,
            "created_utc": 1598722324.0,
            "replies": []
        },
        {
            "body": "One day my SD will also write such things about me.\n\nMine hardly writes me :/",
            "author": null,
            "id": "g39lo9o",
            "parent_id": "t3_iiogdh",
            "score": 2,
            "created_utc": 1598725695.0,
            "replies": []
        },
        {
            "body": "This is so beautiful!",
            "author": null,
            "id": "g37zc2g",
            "parent_id": "t3_iiogdh",
            "score": 1,
            "created_utc": 1598686643.0,
            "replies": []
        },
        {
            "body": "Oh boy, this is just so sweet and wonderful. It sounds like you found a great match. So happy for you :)",
            "author": "InnerRadio7",
            "id": "g39keht",
            "parent_id": "t3_iiogdh",
            "score": 1,
            "created_utc": 1598725035.0,
            "replies": []
        },
        {
            "body": "Don't let yourself get too emotional. Concerned you'll get taken advantage of.",
            "author": "MGTOWManofMystery",
            "id": "g3abdmh",
            "parent_id": "t3_iiogdh",
            "score": 0,
            "created_utc": 1598736771.0,
            "replies": []
        }
    ]
}