{
    "title": "'How to ask the barber for...' Coming from a barber",
    "post_id": "hefy8d",
    "post_url": "https://www.reddit.com/r/malehairadvice/comments/hefy8d/how_to_ask_the_barber_for_coming_from_a_barber/",
    "author": "Wodr25",
    "body": "I see a lot of questions asking, how to ask the barber for a certain cut. \n\nJust show the picture, simple as that.\n\nNot every cut has a specific name and you can rarely describe the cut to your barber, so they will know exactly what you want. \nSometimes you may even misunderstand what you're looking at and tell the barber to give you something completely different.\n\nTo avoid all the confusion and anxiety, just show the picture. It's normal, common and makes the work for your barber MUCH easier.\nWe just look at the picture, know EXACTLY what you want and how to do it and then we can give your our feedback (how it'll look on you, our suggestions etc.)\n\nTldr; show the picture\n \n\nEnjoy your next cut!",
    "url": "https://www.reddit.com/r/malehairadvice/comments/hefy8d/how_to_ask_the_barber_for_coming_from_a_barber/",
    "score": 620,
    "upvote_ratio": 0.99,
    "created_utc": 1592923759.0,
    "num_comments": 69,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "I show the picture everytime I’m getting a haircut but it never looks like the picture.",
            "author": "Johny24F",
            "id": "fvr3nmj",
            "parent_id": "t3_hefy8d",
            "score": 218,
            "created_utc": 1592926686.0,
            "replies": [
                {
                    "body": "This could be for a couple reasons.\n\n1. Your barber sucks.\n2. Your hair type is different than the person in the photo (fine vs coarse)\n3. The hairstyle requires specific styling or product that you are not doing\n4. Your head and face shape is too different from the person in the photo.\n\nEither way, I’d try a different barber first.",
                    "author": "zaphodbeeblebrox42",
                    "id": "fvr4euu",
                    "parent_id": "t1_fvr3nmj",
                    "score": 235,
                    "created_utc": 1592927058.0,
                    "replies": []
                },
                {
                    "body": "Change the barber. A good barber will tell you what is different between you and the model in the picture and suggest a different style, or tell you what to expect.",
                    "author": "Wodr25",
                    "id": "fvr5r5g",
                    "parent_id": "t1_fvr3nmj",
                    "score": 206,
                    "created_utc": 1592927709.0,
                    "replies": [
                        {
                            "body": "Im also a barber and I approve this message",
                            "author": "13enning21",
                            "id": "fvr6s5v",
                            "parent_id": "t1_fvr5r5g",
                            "score": 98,
                            "created_utc": 1592928206.0,
                            "replies": []
                        },
                        {
                            "body": "It would be great if they actually told me and made some suggestions before doing something different. Last time I was asking for a simple fade and showed them the picture. They cut the sides way shorter and left me with a long hair on top for comb-over.",
                            "author": "Johny24F",
                            "id": "fvrjo4d",
                            "parent_id": "t1_fvr5r5g",
                            "score": 26,
                            "created_utc": 1592934437.0,
                            "replies": [
                                {
                                    "body": "Again. Change the barber. I used to try the same barber a few times, if I liked their personality. They may have had a bad day and it showed in their work.\n\nIt's hard and takea lots of time to find YOUR barber. Just try again and again and again.",
                                    "author": "Wodr25",
                                    "id": "fvrr01y",
                                    "parent_id": "t1_fvrjo4d",
                                    "score": 44,
                                    "created_utc": 1592937971.0,
                                    "replies": [
                                        {
                                            "body": "I can't afford to look a mess again and again and again everytime I get a shifty haircut tho. Not to mention all the money going to a haircut u didn't want.",
                                            "author": "foreverandaday13",
                                            "id": "fvseix0",
                                            "parent_id": "t1_fvrr01y",
                                            "score": -10,
                                            "created_utc": 1592949507.0,
                                            "replies": [
                                                {
                                                    "body": "So you suggest going to the same barber and get the same bad haircut?",
                                                    "author": "Wodr25",
                                                    "id": "fvsfumt",
                                                    "parent_id": "t1_fvseix0",
                                                    "score": 36,
                                                    "created_utc": 1592950178.0,
                                                    "replies": []
                                                },
                                                {
                                                    "body": "[deleted]",
                                                    "author": null,
                                                    "id": "fvsgbqp",
                                                    "parent_id": "t1_fvseix0",
                                                    "score": 14,
                                                    "created_utc": 1592950424.0,
                                                    "replies": [
                                                        {
                                                            "body": "Well then I will just stay miserable bitter ugly & with shitty hair, I guess.",
                                                            "author": "foreverandaday13",
                                                            "id": "fvsglb4",
                                                            "parent_id": "t1_fvsgbqp",
                                                            "score": -8,
                                                            "created_utc": 1592950561.0,
                                                            "replies": [
                                                                {
                                                                    "body": "https://www.reddit.com/r/orthotropics/comments/he7xgb/i_got_a_jawline_from_mewing_not_weight_loss/?utm_source=share&utm_medium=ios_app&utm_name=iossmf\n\nDon’t give up so easily. You can transform your appearance drastically if you put in the work to take care of yourself.",
                                                                    "author": "medina_ds3",
                                                                    "id": "fvspjv7",
                                                                    "parent_id": "t1_fvsglb4",
                                                                    "score": 2,
                                                                    "created_utc": 1592955364.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "body": "It took me 4 years to find the barber who was perfect for me. Four years of shitty cuts, barbers who didn’t listen, etc. Invest in some hats & beanies just in case, or ride it out until you find one. Ask others for recs too, unless they’re recommending their friends",
                                                    "author": null,
                                                    "id": "fvumv6n",
                                                    "parent_id": "t1_fvseix0",
                                                    "score": 1,
                                                    "created_utc": 1593006326.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "> calmover\n\ncomb-over =)",
                                    "author": "CancerousJedi",
                                    "id": "fvsefrn",
                                    "parent_id": "t1_fvrjo4d",
                                    "score": 2,
                                    "created_utc": 1592949463.0,
                                    "replies": [
                                        {
                                            "body": "I’m not a native speaker and couldn’t remember how to spell it. Thanks 😂",
                                            "author": "Johny24F",
                                            "id": "fvtu0g9",
                                            "parent_id": "t1_fvsefrn",
                                            "score": 3,
                                            "created_utc": 1592981348.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "FYI a comb over is what insecure balding men wear, like Donald Trump. They grow hair long where they have it and *comb* it *over* the bald spot. You are probably thinking of an undercut.",
                                    "author": "isarl",
                                    "id": "fvu8f1c",
                                    "parent_id": "t1_fvrjo4d",
                                    "score": -1,
                                    "created_utc": 1592995613.0,
                                    "replies": [
                                        {
                                            "body": "I had to google it and actually I meant slicked back side",
                                            "author": "Johny24F",
                                            "id": "fvujbvn",
                                            "parent_id": "t1_fvu8f1c",
                                            "score": 1,
                                            "created_utc": 1593004206.0,
                                            "replies": [
                                                {
                                                    "body": "Your previous description of “sides way shorter and left me with a long hair on top” would seem to be at odds with “slicked back sides” – just goes to show exactly what OP warns about: talking about hair, instead of using photos, is only liable to cause confusion.",
                                                    "author": "isarl",
                                                    "id": "fvvcqsq",
                                                    "parent_id": "t1_fvujbvn",
                                                    "score": 1,
                                                    "created_utc": 1593019506.0,
                                                    "replies": [
                                                        {
                                                            "body": "I wanted a fade with short hair on top, as it was on the picture I showed the barber, and I got fade mixed with slicked back hair. And I was specifically telling barber I don’t want long hair on top since I work early mornings and don’t have time to fix my hair.",
                                                            "author": "Johny24F",
                                                            "id": "fvvmbbq",
                                                            "parent_id": "t1_fvvcqsq",
                                                            "score": 1,
                                                            "created_utc": 1593024049.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Reminds me of the time I specifically had shown one of the barbers at my go to barbershop, a good phone pic of what I wanted. Given my long hair there was enough length to not go wrong. Well he turns me around and asks for my \"final\" say at the end of it. I wiped that grin off his face in front of a crowd of seated clients when I told him that looked nothing like the image with a stone cold expression. I paid my flat due without tip and learned not to feel pressured to go to anyone idk just because they call out your name on the list.",
                    "author": "tomitomo",
                    "id": "fvx0s0n",
                    "parent_id": "t1_fvr3nmj",
                    "score": 2,
                    "created_utc": 1593052134.0,
                    "replies": []
                },
                {
                    "body": "Either you haven't learned how to style it, or you need a better barber.",
                    "author": "darkthemeonly",
                    "id": "fvr4fmo",
                    "parent_id": "t1_fvr3nmj",
                    "score": 3,
                    "created_utc": 1592927068.0,
                    "replies": []
                },
                {
                    "body": "It’s because you’re not the model",
                    "author": "DarrenInAlberta",
                    "id": "fvtv6g3",
                    "parent_id": "t1_fvr3nmj",
                    "score": 1,
                    "created_utc": 1592982401.0,
                    "replies": [
                        {
                            "body": "I wasn’t showing pictures of a models, just some pictures of a character from a movies whose haircut I like. Definitely not a model.",
                            "author": "Johny24F",
                            "id": "fvujkvk",
                            "parent_id": "t1_fvtv6g3",
                            "score": 1,
                            "created_utc": 1593004366.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Honestly, it drives me crazy how often I see those posts. It's way easier for everyone to just show the picture lmao.",
            "author": "darkthemeonly",
            "id": "fvr4dge",
            "parent_id": "t3_hefy8d",
            "score": 54,
            "created_utc": 1592927039.0,
            "replies": [
                {
                    "body": "Same, that's why I decided to write this post in an encouraging manner and help people out.",
                    "author": "Wodr25",
                    "id": "fvr5ymj",
                    "parent_id": "t1_fvr4dge",
                    "score": 18,
                    "created_utc": 1592927809.0,
                    "replies": [
                        {
                            "body": "Thank you so much! I often post here as I started an apprenticeship in a barbershop but my senior passed away, so I couldn’t finish it. He wasn’t that old either 57. No one else would take on a woman. I tried to explain I didn’t want to work in a barber shop, I just wanted some knowledge, but I guess it’s against some kind of guy code. I still have 9 months and a cosmetologist license!",
                            "author": "beanner468",
                            "id": "fvs5nvb",
                            "parent_id": "t1_fvr5ymj",
                            "score": 6,
                            "created_utc": 1592945122.0,
                            "replies": [
                                {
                                    "body": "This really angers me... Any proffesion should be happy to welcome newcommers to share the knowledge, so we can ALL learn from eachother and ALL improve...\n\n\"Guy codes\" and \"exclusivity\" anfer me, annoy me and reek of insecurites and juvenile mindset. No girls allowed... Come on",
                                    "author": "Wodr25",
                                    "id": "fvs9hyh",
                                    "parent_id": "t1_fvs5nvb",
                                    "score": 9,
                                    "created_utc": 1592947000.0,
                                    "replies": [
                                        {
                                            "body": "It was 35 years ago, things have probably changed now.-you made me age myself!",
                                            "author": "beanner468",
                                            "id": "fvs9wtk",
                                            "parent_id": "t1_fvs9hyh",
                                            "score": 2,
                                            "created_utc": 1592947205.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "What? Most barbers in my country are woman...",
                                    "author": "CarasBridge",
                                    "id": "fvu9kfq",
                                    "parent_id": "t1_fvs5nvb",
                                    "score": 1,
                                    "created_utc": 1592996696.0,
                                    "replies": [
                                        {
                                            "body": "Most women are licensed Cosmetologists. We go to school for different things from an actual barber. Hairdressers, for instance, can not shave faces in most cases in the US. Barbers are not allowed to give manicures here. So they are actually very different titles, and licensing.",
                                            "author": "beanner468",
                                            "id": "fvua7a0",
                                            "parent_id": "t1_fvu9kfq",
                                            "score": 2,
                                            "created_utc": 1592997284.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "What if I want someone to tell me what cut I should have?  I haven’t found anyone willing to do this",
            "author": "srobison62",
            "id": "fvrgckj",
            "parent_id": "t3_hefy8d",
            "score": 17,
            "created_utc": 1592932856.0,
            "replies": [
                {
                    "body": "Some barbers don't have imaginaton, others are scared, and others don't know you.\n\nIf your barbers doesn't know you, they can't predict what'll fit your personality.\n\nSome barbers are also scared they'll do their thing and you'll get upset.\n\nI've experienced a girl tell the stylist to cut half an inch of her waist lenght hair. He cut a quarter of an inch. The girl had a full on hysteric meltdown, crying and yelling... 2 days later she came to apologise..",
                    "author": "Wodr25",
                    "id": "fvrql07",
                    "parent_id": "t1_fvrgckj",
                    "score": 17,
                    "created_utc": 1592937764.0,
                    "replies": [
                        {
                            "body": "Wow i thought you were gonna say she cut off a foot or something.  That’s ridiculous",
                            "author": "srobison62",
                            "id": "fvrr0hr",
                            "parent_id": "t1_fvrql07",
                            "score": 5,
                            "created_utc": 1592937977.0,
                            "replies": []
                        },
                        {
                            "body": "I've always found barber inches to be extra long. Or the hair get lighter it spring more and you loose another inch to that.",
                            "author": "f3xjc",
                            "id": "fvsn24x",
                            "parent_id": "t1_fvrql07",
                            "score": 3,
                            "created_utc": 1592953990.0,
                            "replies": [
                                {
                                    "body": "That's certainly one reason.\nThe other is, that you don't want people to hear: oh, hoe about we go shorter and then have to redo the whole thing.\nIt still happens. Several times in a row.",
                                    "author": "Wodr25",
                                    "id": "fvsoh1t",
                                    "parent_id": "t1_fvsn24x",
                                    "score": 4,
                                    "created_utc": 1592954764.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "That’s what this sub is supposed to do. I tried asking a few weeks ago and my post was ignored but you can try I guess",
                    "author": "mannerlybassoon",
                    "id": "fvrlgfp",
                    "parent_id": "t1_fvrgckj",
                    "score": 4,
                    "created_utc": 1592935281.0,
                    "replies": [
                        {
                            "body": "I’ve made a few posts too. But I’ll try [again](https://imgur.com/a/m19QUcT)",
                            "author": "srobison62",
                            "id": "fvrlmbr",
                            "parent_id": "t1_fvrlgfp",
                            "score": 1,
                            "created_utc": 1592935361.0,
                            "replies": [
                                {
                                    "body": "Sorry I’m not the right person to ask. I’m not very good at giving advice 😐. You should try to post it up again though, hopefully someone will help you out",
                                    "author": "mannerlybassoon",
                                    "id": "fvrnopg",
                                    "parent_id": "t1_fvrlmbr",
                                    "score": 2,
                                    "created_utc": 1592936362.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "That's my problem too. I honestly don't care what I look like, I am not the one looking at me! Especially the top of my own head!  Even more honestly, I don't care what other people look like either, there are much better things to pay attention to in the world than people's appearances. I am perfectly happy leaving it in the capable hands of someone who deals with that sort of thing on a daily basis. But no, it's always about what I want. Just doesn't make sense.",
                    "author": "mirin_rosewood",
                    "id": "fvs8lts",
                    "parent_id": "t1_fvrgckj",
                    "score": 1,
                    "created_utc": 1592946563.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I did that for the first time ever last month! I have never been so happy with the cut!\n\ntldr; show the picture!",
            "author": "Some_Belgian_Guy",
            "id": "fvr0bgp",
            "parent_id": "t3_hefy8d",
            "score": 29,
            "created_utc": 1592925008.0,
            "replies": []
        },
        {
            "body": "Thank you! I've seen so many posts about how this place sucks **because** all we do here is tell people to show the barber the picture. the fact is, most people who post here don't care about learning anything about their hair. \n\nMost people don't even know what their hair type is other than \"kinda thick and average\" or w/e. I don't know how barbers put up with this but bless you. \n\nI'm a novice, and this is my first time ever grow my hair out, and I already know that I have type 2B - 2C hair, that it grows around six inches per year, have created a routine, and know to use conditioner and a scrunch-out gel to combat frizz. if I wanted advice on a hairstyle, I know to actually post my face shape and to not use a blurry picture. \n\nThe issue isn't necessarily the people who post, but the requirements to post – there are none. If you have any guides on signs of hair loss, or terminology, or any guide you think would be useful feel free to send me a private message and I can be in contact with a mod. \nI will be asking others who are more knowledgeable than I am for guides as well.",
            "author": null,
            "id": "fvricp1",
            "parent_id": "t3_hefy8d",
            "score": 8,
            "created_utc": 1592933805.0,
            "replies": []
        },
        {
            "body": "Honestly, this should be in the rules on the sidewall.\n\nMods, can we get this fixed?!",
            "author": "Flowhill",
            "id": "fvrj6e8",
            "parent_id": "t3_hefy8d",
            "score": 7,
            "created_utc": 1592934202.0,
            "replies": [
                {
                    "body": "yeah for sure",
                    "author": "a_p3nguin",
                    "id": "fvrkf16",
                    "parent_id": "t1_fvrj6e8",
                    "score": 2,
                    "created_utc": 1592934788.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Hairstylist here. This goes for guys and gals, long or short cuts. Just show the picture, save us some trouble",
            "author": null,
            "id": "fvrhbkj",
            "parent_id": "t3_hefy8d",
            "score": 6,
            "created_utc": 1592933314.0,
            "replies": []
        },
        {
            "body": "Just make sure that your picture doesn't have a play button overlayed on it",
            "author": "YipManDan",
            "id": "fvrynqc",
            "parent_id": "t3_hefy8d",
            "score": 4,
            "created_utc": 1592941695.0,
            "replies": []
        },
        {
            "body": "This post should be pinned or at least be in the sidebar, it would reduce the unnecessary posts by quite a bit.\n\n\nu/r-r-roll\n\nu/SurakiDK \n\nu/ashrie0\n\nu/unofficialmoderator\n\nu/TheSemenThatLived",
            "author": "justabeewithdegree",
            "id": "fvs9j3k",
            "parent_id": "t3_hefy8d",
            "score": 4,
            "created_utc": 1592947015.0,
            "replies": [
                {
                    "body": "Tagging more than 3 users makes it so they don't actually get pinged.",
                    "author": "iEliteTester",
                    "id": "fvv5poj",
                    "parent_id": "t1_fvs9j3k",
                    "score": 1,
                    "created_utc": 1593016098.0,
                    "replies": [
                        {
                            "body": "I didn't knew that, thanks for the info",
                            "author": "justabeewithdegree",
                            "id": "fvv7gvl",
                            "parent_id": "t1_fvv5poj",
                            "score": 2,
                            "created_utc": 1593016965.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "MODS PIN THIS",
            "author": "Flablessguy",
            "id": "fvry9jt",
            "parent_id": "t3_hefy8d",
            "score": 3,
            "created_utc": 1592941503.0,
            "replies": []
        },
        {
            "body": "I just got a haircut and I showed the chick pictures I had taken off myself on a good hair day. She didn't listen at all. I got my sides trimmed with the wrong guard, the top is too short in front, and my neck is the wrong shape. Pictures don't always work, but I'm never going back to get again.",
            "author": "Princess_Little",
            "id": "fvs41uk",
            "parent_id": "t3_hefy8d",
            "score": 3,
            "created_utc": 1592944331.0,
            "replies": [
                {
                    "body": "Your neck?",
                    "author": "foreverandaday13",
                    "id": "fvsewxt",
                    "parent_id": "t1_fvs41uk",
                    "score": 1,
                    "created_utc": 1592949699.0,
                    "replies": [
                        {
                            "body": "Yeah I got a hairy neck that gets shaved. She didn't do the right shape.",
                            "author": "Princess_Little",
                            "id": "fvsi66d",
                            "parent_id": "t1_fvsewxt",
                            "score": 1,
                            "created_utc": 1592951388.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Damn",
            "author": "JoshuaKim02",
            "id": "fvrmhi0",
            "parent_id": "t3_hefy8d",
            "score": 2,
            "created_utc": 1592935783.0,
            "replies": []
        },
        {
            "body": "can this post be pinned please?",
            "author": "soysauuuuce",
            "id": "fvs28jt",
            "parent_id": "t3_hefy8d",
            "score": 2,
            "created_utc": 1592943441.0,
            "replies": []
        },
        {
            "body": "What if we don't know what we want?",
            "author": "8TheKingPin8",
            "id": "fvtk7ss",
            "parent_id": "t3_hefy8d",
            "score": 2,
            "created_utc": 1592973616.0,
            "replies": [
                {
                    "body": "Knowing what you don't want is a step towards knowing what you do",
                    "author": "Wodr25",
                    "id": "fvu90mz",
                    "parent_id": "t1_fvtk7ss",
                    "score": 2,
                    "created_utc": 1592996180.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "TFW there isn't a barber within 50 miles that has a shred of a clue what a man's haircut is supposed to look like.\n\nPictures, descriptions, name a tactic - doesn't matter - you still dread that first look in the mirror and the first two weeks until it grows out enough to hide the absurdity.\n\nI fucking swear. I'm 50 years old and I've had maybe 3 decent haircuts in all that time.",
            "author": "Scott555",
            "id": "fvrzwru",
            "parent_id": "t3_hefy8d",
            "score": 2,
            "created_utc": 1592942306.0,
            "replies": []
        },
        {
            "body": "I’m trying to grow my hair out past my shoulders and it’s a little past the ears now, people said that get a trim every once and a while helps with growth. Would I just tell the barber that I wanted it trimmed or how would I go about it?",
            "author": "Kalashnkov4774",
            "id": "fvru4ab",
            "parent_id": "t3_hefy8d",
            "score": 1,
            "created_utc": 1592939487.0,
            "replies": [
                {
                    "body": "I don't think this is the post to ask this...\nYou can grow it out, but if you have damaged ends, tell the barber you're growing your hair, so they can keep that in mind..",
                    "author": "Wodr25",
                    "id": "fvrw0er",
                    "parent_id": "t1_fvru4ab",
                    "score": 2,
                    "created_utc": 1592940406.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "You're a barber? Hey how do I get a haircut that looks like Robert Downy Jr.?",
            "author": "wtg2989",
            "id": "fvtkngy",
            "parent_id": "t3_hefy8d",
            "score": 1,
            "created_utc": 1592973922.0,
            "replies": [
                {
                    "body": "I don't think this is the place to discuss that, sorry :/",
                    "author": "Wodr25",
                    "id": "fvu92um",
                    "parent_id": "t1_fvtkngy",
                    "score": 1,
                    "created_utc": 1592996239.0,
                    "replies": [
                        {
                            "body": "It was a joke",
                            "author": "wtg2989",
                            "id": "fvu9kcp",
                            "parent_id": "t1_fvu92um",
                            "score": 1,
                            "created_utc": 1592996694.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "We need some kind of app that lets us choose a style and it’s specifications",
            "author": "HulioJohnson",
            "id": "fvtlynv",
            "parent_id": "t3_hefy8d",
            "score": 1,
            "created_utc": 1592974865.0,
            "replies": []
        },
        {
            "body": "Do all barber shops employ licensed barbers? \n\nIf not, why and how can a customer find out this information? \n\nIs it rude to ask in person or over the phone if the person cutting your hair is licensed to be a barber? \n\nWhat does the license look like and must barbers display it at their place if business?",
            "author": "sbmedlg",
            "id": "fvurxmh",
            "parent_id": "t3_hefy8d",
            "score": 1,
            "created_utc": 1593009147.0,
            "replies": []
        },
        {
            "body": "I did this and it didn’t go over well. \n\nBut I got the whole covid hair thing going on. Haven’t had longer hair in a couple of years, kinda sucks lol",
            "author": null,
            "id": "fvrkyb2",
            "parent_id": "t3_hefy8d",
            "score": 0,
            "created_utc": 1592935042.0,
            "replies": []
        },
        {
            "body": "How do you go about telling someone the cut won't work for them? Whether it be their hair color that might not present the same as the picture they show, or the thickness, etc. How do you decide what a good cut for you or for someone else is? And how do you direct the conversation that way?",
            "author": null,
            "id": "fvrpjr9",
            "parent_id": "t3_hefy8d",
            "score": 0,
            "created_utc": 1592937263.0,
            "replies": [
                {
                    "body": "I don't know about your barber, but mine always asks me what I want to get.\nI show the picture, tell them 'this is what I had in mind', what do you think about it? And you talk about it. What are the wishes, expectations, possibilites... Talk.",
                    "author": "Wodr25",
                    "id": "fvrrasz",
                    "parent_id": "t1_fvrpjr9",
                    "score": 3,
                    "created_utc": 1592938117.0,
                    "replies": [
                        {
                            "body": "Its probably a me thing, then. I don't mind talking once we get going but I feel bad taking up extra time by trying to hash all that out. I mean I don't get bad haircuts but im mostly just curious how people sit there and hash it out without taking up an excessive amount of time",
                            "author": null,
                            "id": "fvs5fs9",
                            "parent_id": "t1_fvrrasz",
                            "score": 1,
                            "created_utc": 1592945012.0,
                            "replies": [
                                {
                                    "body": "When your barber knows exactly ehat you want, they can do their job faster and better. Everyone likes clarity and happy customers 😊😊",
                                    "author": "Wodr25",
                                    "id": "fvs98qw",
                                    "parent_id": "t1_fvs5fs9",
                                    "score": 2,
                                    "created_utc": 1592946873.0,
                                    "replies": [
                                        {
                                            "body": "Valid point!",
                                            "author": null,
                                            "id": "fvs9dq5",
                                            "parent_id": "t1_fvs98qw",
                                            "score": 1,
                                            "created_utc": 1592946941.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "One of the last times I went to the barbers (I've admitted defeat to my hairline even though it's the one retreating) I asked for just a trim and I wear it messy.  He thought I wanted to look like this https://cdn.vox-cdn.com/thumbor/DaYxgp5CR8m-_1qlbuQ3PdT27Ks=/0x0:5472x3648/920x613/filters:focal(1821x457:2695x1331):format(webp)/cdn.vox-cdn.com/uploads/chorus_image/image/66345836/1206934772.jpg.0.jpg",
            "author": "highrouleur",
            "id": "fvuvkbb",
            "parent_id": "t3_hefy8d",
            "score": 0,
            "created_utc": 1593011049.0,
            "replies": []
        },
        {
            "body": "This could be for a couple reasons.\n\n1. Your barber sucks.\n2. Your hair type is different than the person in the photo (fine vs coarse)\n3. The hairstyle requires specific styling or product that you are not doing\n4. Your head and face shape is too different from the person in the photo.\n\nEither way, I’d try a different barber first.",
            "author": "zaphodbeeblebrox42",
            "id": "fvr4euu",
            "parent_id": "t1_fvr3nmj",
            "score": 235,
            "created_utc": 1592927058.0,
            "replies": []
        },
        {
            "body": "Change the barber. A good barber will tell you what is different between you and the model in the picture and suggest a different style, or tell you what to expect.",
            "author": "Wodr25",
            "id": "fvr5r5g",
            "parent_id": "t1_fvr3nmj",
            "score": 206,
            "created_utc": 1592927709.0,
            "replies": [
                {
                    "body": "Im also a barber and I approve this message",
                    "author": "13enning21",
                    "id": "fvr6s5v",
                    "parent_id": "t1_fvr5r5g",
                    "score": 98,
                    "created_utc": 1592928206.0,
                    "replies": []
                },
                {
                    "body": "It would be great if they actually told me and made some suggestions before doing something different. Last time I was asking for a simple fade and showed them the picture. They cut the sides way shorter and left me with a long hair on top for comb-over.",
                    "author": "Johny24F",
                    "id": "fvrjo4d",
                    "parent_id": "t1_fvr5r5g",
                    "score": 26,
                    "created_utc": 1592934437.0,
                    "replies": [
                        {
                            "body": "Again. Change the barber. I used to try the same barber a few times, if I liked their personality. They may have had a bad day and it showed in their work.\n\nIt's hard and takea lots of time to find YOUR barber. Just try again and again and again.",
                            "author": "Wodr25",
                            "id": "fvrr01y",
                            "parent_id": "t1_fvrjo4d",
                            "score": 44,
                            "created_utc": 1592937971.0,
                            "replies": [
                                {
                                    "body": "I can't afford to look a mess again and again and again everytime I get a shifty haircut tho. Not to mention all the money going to a haircut u didn't want.",
                                    "author": "foreverandaday13",
                                    "id": "fvseix0",
                                    "parent_id": "t1_fvrr01y",
                                    "score": -10,
                                    "created_utc": 1592949507.0,
                                    "replies": [
                                        {
                                            "body": "So you suggest going to the same barber and get the same bad haircut?",
                                            "author": "Wodr25",
                                            "id": "fvsfumt",
                                            "parent_id": "t1_fvseix0",
                                            "score": 36,
                                            "created_utc": 1592950178.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "fvsgbqp",
                                            "parent_id": "t1_fvseix0",
                                            "score": 14,
                                            "created_utc": 1592950424.0,
                                            "replies": [
                                                {
                                                    "body": "Well then I will just stay miserable bitter ugly & with shitty hair, I guess.",
                                                    "author": "foreverandaday13",
                                                    "id": "fvsglb4",
                                                    "parent_id": "t1_fvsgbqp",
                                                    "score": -8,
                                                    "created_utc": 1592950561.0,
                                                    "replies": [
                                                        {
                                                            "body": "https://www.reddit.com/r/orthotropics/comments/he7xgb/i_got_a_jawline_from_mewing_not_weight_loss/?utm_source=share&utm_medium=ios_app&utm_name=iossmf\n\nDon’t give up so easily. You can transform your appearance drastically if you put in the work to take care of yourself.",
                                                            "author": "medina_ds3",
                                                            "id": "fvspjv7",
                                                            "parent_id": "t1_fvsglb4",
                                                            "score": 2,
                                                            "created_utc": 1592955364.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "body": "It took me 4 years to find the barber who was perfect for me. Four years of shitty cuts, barbers who didn’t listen, etc. Invest in some hats & beanies just in case, or ride it out until you find one. Ask others for recs too, unless they’re recommending their friends",
                                            "author": null,
                                            "id": "fvumv6n",
                                            "parent_id": "t1_fvseix0",
                                            "score": 1,
                                            "created_utc": 1593006326.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "> calmover\n\ncomb-over =)",
                            "author": "CancerousJedi",
                            "id": "fvsefrn",
                            "parent_id": "t1_fvrjo4d",
                            "score": 2,
                            "created_utc": 1592949463.0,
                            "replies": [
                                {
                                    "body": "I’m not a native speaker and couldn’t remember how to spell it. Thanks 😂",
                                    "author": "Johny24F",
                                    "id": "fvtu0g9",
                                    "parent_id": "t1_fvsefrn",
                                    "score": 3,
                                    "created_utc": 1592981348.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "FYI a comb over is what insecure balding men wear, like Donald Trump. They grow hair long where they have it and *comb* it *over* the bald spot. You are probably thinking of an undercut.",
                            "author": "isarl",
                            "id": "fvu8f1c",
                            "parent_id": "t1_fvrjo4d",
                            "score": -1,
                            "created_utc": 1592995613.0,
                            "replies": [
                                {
                                    "body": "I had to google it and actually I meant slicked back side",
                                    "author": "Johny24F",
                                    "id": "fvujbvn",
                                    "parent_id": "t1_fvu8f1c",
                                    "score": 1,
                                    "created_utc": 1593004206.0,
                                    "replies": [
                                        {
                                            "body": "Your previous description of “sides way shorter and left me with a long hair on top” would seem to be at odds with “slicked back sides” – just goes to show exactly what OP warns about: talking about hair, instead of using photos, is only liable to cause confusion.",
                                            "author": "isarl",
                                            "id": "fvvcqsq",
                                            "parent_id": "t1_fvujbvn",
                                            "score": 1,
                                            "created_utc": 1593019506.0,
                                            "replies": [
                                                {
                                                    "body": "I wanted a fade with short hair on top, as it was on the picture I showed the barber, and I got fade mixed with slicked back hair. And I was specifically telling barber I don’t want long hair on top since I work early mornings and don’t have time to fix my hair.",
                                                    "author": "Johny24F",
                                                    "id": "fvvmbbq",
                                                    "parent_id": "t1_fvvcqsq",
                                                    "score": 1,
                                                    "created_utc": 1593024049.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Reminds me of the time I specifically had shown one of the barbers at my go to barbershop, a good phone pic of what I wanted. Given my long hair there was enough length to not go wrong. Well he turns me around and asks for my \"final\" say at the end of it. I wiped that grin off his face in front of a crowd of seated clients when I told him that looked nothing like the image with a stone cold expression. I paid my flat due without tip and learned not to feel pressured to go to anyone idk just because they call out your name on the list.",
            "author": "tomitomo",
            "id": "fvx0s0n",
            "parent_id": "t1_fvr3nmj",
            "score": 2,
            "created_utc": 1593052134.0,
            "replies": []
        },
        {
            "body": "Either you haven't learned how to style it, or you need a better barber.",
            "author": "darkthemeonly",
            "id": "fvr4fmo",
            "parent_id": "t1_fvr3nmj",
            "score": 3,
            "created_utc": 1592927068.0,
            "replies": []
        },
        {
            "body": "It’s because you’re not the model",
            "author": "DarrenInAlberta",
            "id": "fvtv6g3",
            "parent_id": "t1_fvr3nmj",
            "score": 1,
            "created_utc": 1592982401.0,
            "replies": [
                {
                    "body": "I wasn’t showing pictures of a models, just some pictures of a character from a movies whose haircut I like. Definitely not a model.",
                    "author": "Johny24F",
                    "id": "fvujkvk",
                    "parent_id": "t1_fvtv6g3",
                    "score": 1,
                    "created_utc": 1593004366.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Same, that's why I decided to write this post in an encouraging manner and help people out.",
            "author": "Wodr25",
            "id": "fvr5ymj",
            "parent_id": "t1_fvr4dge",
            "score": 18,
            "created_utc": 1592927809.0,
            "replies": [
                {
                    "body": "Thank you so much! I often post here as I started an apprenticeship in a barbershop but my senior passed away, so I couldn’t finish it. He wasn’t that old either 57. No one else would take on a woman. I tried to explain I didn’t want to work in a barber shop, I just wanted some knowledge, but I guess it’s against some kind of guy code. I still have 9 months and a cosmetologist license!",
                    "author": "beanner468",
                    "id": "fvs5nvb",
                    "parent_id": "t1_fvr5ymj",
                    "score": 6,
                    "created_utc": 1592945122.0,
                    "replies": [
                        {
                            "body": "This really angers me... Any proffesion should be happy to welcome newcommers to share the knowledge, so we can ALL learn from eachother and ALL improve...\n\n\"Guy codes\" and \"exclusivity\" anfer me, annoy me and reek of insecurites and juvenile mindset. No girls allowed... Come on",
                            "author": "Wodr25",
                            "id": "fvs9hyh",
                            "parent_id": "t1_fvs5nvb",
                            "score": 9,
                            "created_utc": 1592947000.0,
                            "replies": [
                                {
                                    "body": "It was 35 years ago, things have probably changed now.-you made me age myself!",
                                    "author": "beanner468",
                                    "id": "fvs9wtk",
                                    "parent_id": "t1_fvs9hyh",
                                    "score": 2,
                                    "created_utc": 1592947205.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "What? Most barbers in my country are woman...",
                            "author": "CarasBridge",
                            "id": "fvu9kfq",
                            "parent_id": "t1_fvs5nvb",
                            "score": 1,
                            "created_utc": 1592996696.0,
                            "replies": [
                                {
                                    "body": "Most women are licensed Cosmetologists. We go to school for different things from an actual barber. Hairdressers, for instance, can not shave faces in most cases in the US. Barbers are not allowed to give manicures here. So they are actually very different titles, and licensing.",
                                    "author": "beanner468",
                                    "id": "fvua7a0",
                                    "parent_id": "t1_fvu9kfq",
                                    "score": 2,
                                    "created_utc": 1592997284.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Some barbers don't have imaginaton, others are scared, and others don't know you.\n\nIf your barbers doesn't know you, they can't predict what'll fit your personality.\n\nSome barbers are also scared they'll do their thing and you'll get upset.\n\nI've experienced a girl tell the stylist to cut half an inch of her waist lenght hair. He cut a quarter of an inch. The girl had a full on hysteric meltdown, crying and yelling... 2 days later she came to apologise..",
            "author": "Wodr25",
            "id": "fvrql07",
            "parent_id": "t1_fvrgckj",
            "score": 17,
            "created_utc": 1592937764.0,
            "replies": [
                {
                    "body": "Wow i thought you were gonna say she cut off a foot or something.  That’s ridiculous",
                    "author": "srobison62",
                    "id": "fvrr0hr",
                    "parent_id": "t1_fvrql07",
                    "score": 5,
                    "created_utc": 1592937977.0,
                    "replies": []
                },
                {
                    "body": "I've always found barber inches to be extra long. Or the hair get lighter it spring more and you loose another inch to that.",
                    "author": "f3xjc",
                    "id": "fvsn24x",
                    "parent_id": "t1_fvrql07",
                    "score": 3,
                    "created_utc": 1592953990.0,
                    "replies": [
                        {
                            "body": "That's certainly one reason.\nThe other is, that you don't want people to hear: oh, hoe about we go shorter and then have to redo the whole thing.\nIt still happens. Several times in a row.",
                            "author": "Wodr25",
                            "id": "fvsoh1t",
                            "parent_id": "t1_fvsn24x",
                            "score": 4,
                            "created_utc": 1592954764.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "That’s what this sub is supposed to do. I tried asking a few weeks ago and my post was ignored but you can try I guess",
            "author": "mannerlybassoon",
            "id": "fvrlgfp",
            "parent_id": "t1_fvrgckj",
            "score": 4,
            "created_utc": 1592935281.0,
            "replies": [
                {
                    "body": "I’ve made a few posts too. But I’ll try [again](https://imgur.com/a/m19QUcT)",
                    "author": "srobison62",
                    "id": "fvrlmbr",
                    "parent_id": "t1_fvrlgfp",
                    "score": 1,
                    "created_utc": 1592935361.0,
                    "replies": [
                        {
                            "body": "Sorry I’m not the right person to ask. I’m not very good at giving advice 😐. You should try to post it up again though, hopefully someone will help you out",
                            "author": "mannerlybassoon",
                            "id": "fvrnopg",
                            "parent_id": "t1_fvrlmbr",
                            "score": 2,
                            "created_utc": 1592936362.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "That's my problem too. I honestly don't care what I look like, I am not the one looking at me! Especially the top of my own head!  Even more honestly, I don't care what other people look like either, there are much better things to pay attention to in the world than people's appearances. I am perfectly happy leaving it in the capable hands of someone who deals with that sort of thing on a daily basis. But no, it's always about what I want. Just doesn't make sense.",
            "author": "mirin_rosewood",
            "id": "fvs8lts",
            "parent_id": "t1_fvrgckj",
            "score": 1,
            "created_utc": 1592946563.0,
            "replies": []
        },
        {
            "body": "yeah for sure",
            "author": "a_p3nguin",
            "id": "fvrkf16",
            "parent_id": "t1_fvrj6e8",
            "score": 2,
            "created_utc": 1592934788.0,
            "replies": []
        },
        {
            "body": "Tagging more than 3 users makes it so they don't actually get pinged.",
            "author": "iEliteTester",
            "id": "fvv5poj",
            "parent_id": "t1_fvs9j3k",
            "score": 1,
            "created_utc": 1593016098.0,
            "replies": [
                {
                    "body": "I didn't knew that, thanks for the info",
                    "author": "justabeewithdegree",
                    "id": "fvv7gvl",
                    "parent_id": "t1_fvv5poj",
                    "score": 2,
                    "created_utc": 1593016965.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Your neck?",
            "author": "foreverandaday13",
            "id": "fvsewxt",
            "parent_id": "t1_fvs41uk",
            "score": 1,
            "created_utc": 1592949699.0,
            "replies": [
                {
                    "body": "Yeah I got a hairy neck that gets shaved. She didn't do the right shape.",
                    "author": "Princess_Little",
                    "id": "fvsi66d",
                    "parent_id": "t1_fvsewxt",
                    "score": 1,
                    "created_utc": 1592951388.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Knowing what you don't want is a step towards knowing what you do",
            "author": "Wodr25",
            "id": "fvu90mz",
            "parent_id": "t1_fvtk7ss",
            "score": 2,
            "created_utc": 1592996180.0,
            "replies": []
        },
        {
            "body": "I don't think this is the post to ask this...\nYou can grow it out, but if you have damaged ends, tell the barber you're growing your hair, so they can keep that in mind..",
            "author": "Wodr25",
            "id": "fvrw0er",
            "parent_id": "t1_fvru4ab",
            "score": 2,
            "created_utc": 1592940406.0,
            "replies": []
        },
        {
            "body": "I don't think this is the place to discuss that, sorry :/",
            "author": "Wodr25",
            "id": "fvu92um",
            "parent_id": "t1_fvtkngy",
            "score": 1,
            "created_utc": 1592996239.0,
            "replies": [
                {
                    "body": "It was a joke",
                    "author": "wtg2989",
                    "id": "fvu9kcp",
                    "parent_id": "t1_fvu92um",
                    "score": 1,
                    "created_utc": 1592996694.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I don't know about your barber, but mine always asks me what I want to get.\nI show the picture, tell them 'this is what I had in mind', what do you think about it? And you talk about it. What are the wishes, expectations, possibilites... Talk.",
            "author": "Wodr25",
            "id": "fvrrasz",
            "parent_id": "t1_fvrpjr9",
            "score": 3,
            "created_utc": 1592938117.0,
            "replies": [
                {
                    "body": "Its probably a me thing, then. I don't mind talking once we get going but I feel bad taking up extra time by trying to hash all that out. I mean I don't get bad haircuts but im mostly just curious how people sit there and hash it out without taking up an excessive amount of time",
                    "author": null,
                    "id": "fvs5fs9",
                    "parent_id": "t1_fvrrasz",
                    "score": 1,
                    "created_utc": 1592945012.0,
                    "replies": [
                        {
                            "body": "When your barber knows exactly ehat you want, they can do their job faster and better. Everyone likes clarity and happy customers 😊😊",
                            "author": "Wodr25",
                            "id": "fvs98qw",
                            "parent_id": "t1_fvs5fs9",
                            "score": 2,
                            "created_utc": 1592946873.0,
                            "replies": [
                                {
                                    "body": "Valid point!",
                                    "author": null,
                                    "id": "fvs9dq5",
                                    "parent_id": "t1_fvs98qw",
                                    "score": 1,
                                    "created_utc": 1592946941.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Im also a barber and I approve this message",
            "author": "13enning21",
            "id": "fvr6s5v",
            "parent_id": "t1_fvr5r5g",
            "score": 98,
            "created_utc": 1592928206.0,
            "replies": []
        },
        {
            "body": "It would be great if they actually told me and made some suggestions before doing something different. Last time I was asking for a simple fade and showed them the picture. They cut the sides way shorter and left me with a long hair on top for comb-over.",
            "author": "Johny24F",
            "id": "fvrjo4d",
            "parent_id": "t1_fvr5r5g",
            "score": 26,
            "created_utc": 1592934437.0,
            "replies": [
                {
                    "body": "Again. Change the barber. I used to try the same barber a few times, if I liked their personality. They may have had a bad day and it showed in their work.\n\nIt's hard and takea lots of time to find YOUR barber. Just try again and again and again.",
                    "author": "Wodr25",
                    "id": "fvrr01y",
                    "parent_id": "t1_fvrjo4d",
                    "score": 44,
                    "created_utc": 1592937971.0,
                    "replies": [
                        {
                            "body": "I can't afford to look a mess again and again and again everytime I get a shifty haircut tho. Not to mention all the money going to a haircut u didn't want.",
                            "author": "foreverandaday13",
                            "id": "fvseix0",
                            "parent_id": "t1_fvrr01y",
                            "score": -10,
                            "created_utc": 1592949507.0,
                            "replies": [
                                {
                                    "body": "So you suggest going to the same barber and get the same bad haircut?",
                                    "author": "Wodr25",
                                    "id": "fvsfumt",
                                    "parent_id": "t1_fvseix0",
                                    "score": 36,
                                    "created_utc": 1592950178.0,
                                    "replies": []
                                },
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "fvsgbqp",
                                    "parent_id": "t1_fvseix0",
                                    "score": 14,
                                    "created_utc": 1592950424.0,
                                    "replies": [
                                        {
                                            "body": "Well then I will just stay miserable bitter ugly & with shitty hair, I guess.",
                                            "author": "foreverandaday13",
                                            "id": "fvsglb4",
                                            "parent_id": "t1_fvsgbqp",
                                            "score": -8,
                                            "created_utc": 1592950561.0,
                                            "replies": [
                                                {
                                                    "body": "https://www.reddit.com/r/orthotropics/comments/he7xgb/i_got_a_jawline_from_mewing_not_weight_loss/?utm_source=share&utm_medium=ios_app&utm_name=iossmf\n\nDon’t give up so easily. You can transform your appearance drastically if you put in the work to take care of yourself.",
                                                    "author": "medina_ds3",
                                                    "id": "fvspjv7",
                                                    "parent_id": "t1_fvsglb4",
                                                    "score": 2,
                                                    "created_utc": 1592955364.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "It took me 4 years to find the barber who was perfect for me. Four years of shitty cuts, barbers who didn’t listen, etc. Invest in some hats & beanies just in case, or ride it out until you find one. Ask others for recs too, unless they’re recommending their friends",
                                    "author": null,
                                    "id": "fvumv6n",
                                    "parent_id": "t1_fvseix0",
                                    "score": 1,
                                    "created_utc": 1593006326.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "> calmover\n\ncomb-over =)",
                    "author": "CancerousJedi",
                    "id": "fvsefrn",
                    "parent_id": "t1_fvrjo4d",
                    "score": 2,
                    "created_utc": 1592949463.0,
                    "replies": [
                        {
                            "body": "I’m not a native speaker and couldn’t remember how to spell it. Thanks 😂",
                            "author": "Johny24F",
                            "id": "fvtu0g9",
                            "parent_id": "t1_fvsefrn",
                            "score": 3,
                            "created_utc": 1592981348.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "FYI a comb over is what insecure balding men wear, like Donald Trump. They grow hair long where they have it and *comb* it *over* the bald spot. You are probably thinking of an undercut.",
                    "author": "isarl",
                    "id": "fvu8f1c",
                    "parent_id": "t1_fvrjo4d",
                    "score": -1,
                    "created_utc": 1592995613.0,
                    "replies": [
                        {
                            "body": "I had to google it and actually I meant slicked back side",
                            "author": "Johny24F",
                            "id": "fvujbvn",
                            "parent_id": "t1_fvu8f1c",
                            "score": 1,
                            "created_utc": 1593004206.0,
                            "replies": [
                                {
                                    "body": "Your previous description of “sides way shorter and left me with a long hair on top” would seem to be at odds with “slicked back sides” – just goes to show exactly what OP warns about: talking about hair, instead of using photos, is only liable to cause confusion.",
                                    "author": "isarl",
                                    "id": "fvvcqsq",
                                    "parent_id": "t1_fvujbvn",
                                    "score": 1,
                                    "created_utc": 1593019506.0,
                                    "replies": [
                                        {
                                            "body": "I wanted a fade with short hair on top, as it was on the picture I showed the barber, and I got fade mixed with slicked back hair. And I was specifically telling barber I don’t want long hair on top since I work early mornings and don’t have time to fix my hair.",
                                            "author": "Johny24F",
                                            "id": "fvvmbbq",
                                            "parent_id": "t1_fvvcqsq",
                                            "score": 1,
                                            "created_utc": 1593024049.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I wasn’t showing pictures of a models, just some pictures of a character from a movies whose haircut I like. Definitely not a model.",
            "author": "Johny24F",
            "id": "fvujkvk",
            "parent_id": "t1_fvtv6g3",
            "score": 1,
            "created_utc": 1593004366.0,
            "replies": []
        },
        {
            "body": "Thank you so much! I often post here as I started an apprenticeship in a barbershop but my senior passed away, so I couldn’t finish it. He wasn’t that old either 57. No one else would take on a woman. I tried to explain I didn’t want to work in a barber shop, I just wanted some knowledge, but I guess it’s against some kind of guy code. I still have 9 months and a cosmetologist license!",
            "author": "beanner468",
            "id": "fvs5nvb",
            "parent_id": "t1_fvr5ymj",
            "score": 6,
            "created_utc": 1592945122.0,
            "replies": [
                {
                    "body": "This really angers me... Any proffesion should be happy to welcome newcommers to share the knowledge, so we can ALL learn from eachother and ALL improve...\n\n\"Guy codes\" and \"exclusivity\" anfer me, annoy me and reek of insecurites and juvenile mindset. No girls allowed... Come on",
                    "author": "Wodr25",
                    "id": "fvs9hyh",
                    "parent_id": "t1_fvs5nvb",
                    "score": 9,
                    "created_utc": 1592947000.0,
                    "replies": [
                        {
                            "body": "It was 35 years ago, things have probably changed now.-you made me age myself!",
                            "author": "beanner468",
                            "id": "fvs9wtk",
                            "parent_id": "t1_fvs9hyh",
                            "score": 2,
                            "created_utc": 1592947205.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "What? Most barbers in my country are woman...",
                    "author": "CarasBridge",
                    "id": "fvu9kfq",
                    "parent_id": "t1_fvs5nvb",
                    "score": 1,
                    "created_utc": 1592996696.0,
                    "replies": [
                        {
                            "body": "Most women are licensed Cosmetologists. We go to school for different things from an actual barber. Hairdressers, for instance, can not shave faces in most cases in the US. Barbers are not allowed to give manicures here. So they are actually very different titles, and licensing.",
                            "author": "beanner468",
                            "id": "fvua7a0",
                            "parent_id": "t1_fvu9kfq",
                            "score": 2,
                            "created_utc": 1592997284.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Wow i thought you were gonna say she cut off a foot or something.  That’s ridiculous",
            "author": "srobison62",
            "id": "fvrr0hr",
            "parent_id": "t1_fvrql07",
            "score": 5,
            "created_utc": 1592937977.0,
            "replies": []
        },
        {
            "body": "I've always found barber inches to be extra long. Or the hair get lighter it spring more and you loose another inch to that.",
            "author": "f3xjc",
            "id": "fvsn24x",
            "parent_id": "t1_fvrql07",
            "score": 3,
            "created_utc": 1592953990.0,
            "replies": [
                {
                    "body": "That's certainly one reason.\nThe other is, that you don't want people to hear: oh, hoe about we go shorter and then have to redo the whole thing.\nIt still happens. Several times in a row.",
                    "author": "Wodr25",
                    "id": "fvsoh1t",
                    "parent_id": "t1_fvsn24x",
                    "score": 4,
                    "created_utc": 1592954764.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I’ve made a few posts too. But I’ll try [again](https://imgur.com/a/m19QUcT)",
            "author": "srobison62",
            "id": "fvrlmbr",
            "parent_id": "t1_fvrlgfp",
            "score": 1,
            "created_utc": 1592935361.0,
            "replies": [
                {
                    "body": "Sorry I’m not the right person to ask. I’m not very good at giving advice 😐. You should try to post it up again though, hopefully someone will help you out",
                    "author": "mannerlybassoon",
                    "id": "fvrnopg",
                    "parent_id": "t1_fvrlmbr",
                    "score": 2,
                    "created_utc": 1592936362.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I didn't knew that, thanks for the info",
            "author": "justabeewithdegree",
            "id": "fvv7gvl",
            "parent_id": "t1_fvv5poj",
            "score": 2,
            "created_utc": 1593016965.0,
            "replies": []
        },
        {
            "body": "Yeah I got a hairy neck that gets shaved. She didn't do the right shape.",
            "author": "Princess_Little",
            "id": "fvsi66d",
            "parent_id": "t1_fvsewxt",
            "score": 1,
            "created_utc": 1592951388.0,
            "replies": []
        },
        {
            "body": "It was a joke",
            "author": "wtg2989",
            "id": "fvu9kcp",
            "parent_id": "t1_fvu92um",
            "score": 1,
            "created_utc": 1592996694.0,
            "replies": []
        },
        {
            "body": "Its probably a me thing, then. I don't mind talking once we get going but I feel bad taking up extra time by trying to hash all that out. I mean I don't get bad haircuts but im mostly just curious how people sit there and hash it out without taking up an excessive amount of time",
            "author": null,
            "id": "fvs5fs9",
            "parent_id": "t1_fvrrasz",
            "score": 1,
            "created_utc": 1592945012.0,
            "replies": [
                {
                    "body": "When your barber knows exactly ehat you want, they can do their job faster and better. Everyone likes clarity and happy customers 😊😊",
                    "author": "Wodr25",
                    "id": "fvs98qw",
                    "parent_id": "t1_fvs5fs9",
                    "score": 2,
                    "created_utc": 1592946873.0,
                    "replies": [
                        {
                            "body": "Valid point!",
                            "author": null,
                            "id": "fvs9dq5",
                            "parent_id": "t1_fvs98qw",
                            "score": 1,
                            "created_utc": 1592946941.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Again. Change the barber. I used to try the same barber a few times, if I liked their personality. They may have had a bad day and it showed in their work.\n\nIt's hard and takea lots of time to find YOUR barber. Just try again and again and again.",
            "author": "Wodr25",
            "id": "fvrr01y",
            "parent_id": "t1_fvrjo4d",
            "score": 44,
            "created_utc": 1592937971.0,
            "replies": [
                {
                    "body": "I can't afford to look a mess again and again and again everytime I get a shifty haircut tho. Not to mention all the money going to a haircut u didn't want.",
                    "author": "foreverandaday13",
                    "id": "fvseix0",
                    "parent_id": "t1_fvrr01y",
                    "score": -10,
                    "created_utc": 1592949507.0,
                    "replies": [
                        {
                            "body": "So you suggest going to the same barber and get the same bad haircut?",
                            "author": "Wodr25",
                            "id": "fvsfumt",
                            "parent_id": "t1_fvseix0",
                            "score": 36,
                            "created_utc": 1592950178.0,
                            "replies": []
                        },
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "fvsgbqp",
                            "parent_id": "t1_fvseix0",
                            "score": 14,
                            "created_utc": 1592950424.0,
                            "replies": [
                                {
                                    "body": "Well then I will just stay miserable bitter ugly & with shitty hair, I guess.",
                                    "author": "foreverandaday13",
                                    "id": "fvsglb4",
                                    "parent_id": "t1_fvsgbqp",
                                    "score": -8,
                                    "created_utc": 1592950561.0,
                                    "replies": [
                                        {
                                            "body": "https://www.reddit.com/r/orthotropics/comments/he7xgb/i_got_a_jawline_from_mewing_not_weight_loss/?utm_source=share&utm_medium=ios_app&utm_name=iossmf\n\nDon’t give up so easily. You can transform your appearance drastically if you put in the work to take care of yourself.",
                                            "author": "medina_ds3",
                                            "id": "fvspjv7",
                                            "parent_id": "t1_fvsglb4",
                                            "score": 2,
                                            "created_utc": 1592955364.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "It took me 4 years to find the barber who was perfect for me. Four years of shitty cuts, barbers who didn’t listen, etc. Invest in some hats & beanies just in case, or ride it out until you find one. Ask others for recs too, unless they’re recommending their friends",
                            "author": null,
                            "id": "fvumv6n",
                            "parent_id": "t1_fvseix0",
                            "score": 1,
                            "created_utc": 1593006326.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "> calmover\n\ncomb-over =)",
            "author": "CancerousJedi",
            "id": "fvsefrn",
            "parent_id": "t1_fvrjo4d",
            "score": 2,
            "created_utc": 1592949463.0,
            "replies": [
                {
                    "body": "I’m not a native speaker and couldn’t remember how to spell it. Thanks 😂",
                    "author": "Johny24F",
                    "id": "fvtu0g9",
                    "parent_id": "t1_fvsefrn",
                    "score": 3,
                    "created_utc": 1592981348.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "FYI a comb over is what insecure balding men wear, like Donald Trump. They grow hair long where they have it and *comb* it *over* the bald spot. You are probably thinking of an undercut.",
            "author": "isarl",
            "id": "fvu8f1c",
            "parent_id": "t1_fvrjo4d",
            "score": -1,
            "created_utc": 1592995613.0,
            "replies": [
                {
                    "body": "I had to google it and actually I meant slicked back side",
                    "author": "Johny24F",
                    "id": "fvujbvn",
                    "parent_id": "t1_fvu8f1c",
                    "score": 1,
                    "created_utc": 1593004206.0,
                    "replies": [
                        {
                            "body": "Your previous description of “sides way shorter and left me with a long hair on top” would seem to be at odds with “slicked back sides” – just goes to show exactly what OP warns about: talking about hair, instead of using photos, is only liable to cause confusion.",
                            "author": "isarl",
                            "id": "fvvcqsq",
                            "parent_id": "t1_fvujbvn",
                            "score": 1,
                            "created_utc": 1593019506.0,
                            "replies": [
                                {
                                    "body": "I wanted a fade with short hair on top, as it was on the picture I showed the barber, and I got fade mixed with slicked back hair. And I was specifically telling barber I don’t want long hair on top since I work early mornings and don’t have time to fix my hair.",
                                    "author": "Johny24F",
                                    "id": "fvvmbbq",
                                    "parent_id": "t1_fvvcqsq",
                                    "score": 1,
                                    "created_utc": 1593024049.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "This really angers me... Any proffesion should be happy to welcome newcommers to share the knowledge, so we can ALL learn from eachother and ALL improve...\n\n\"Guy codes\" and \"exclusivity\" anfer me, annoy me and reek of insecurites and juvenile mindset. No girls allowed... Come on",
            "author": "Wodr25",
            "id": "fvs9hyh",
            "parent_id": "t1_fvs5nvb",
            "score": 9,
            "created_utc": 1592947000.0,
            "replies": [
                {
                    "body": "It was 35 years ago, things have probably changed now.-you made me age myself!",
                    "author": "beanner468",
                    "id": "fvs9wtk",
                    "parent_id": "t1_fvs9hyh",
                    "score": 2,
                    "created_utc": 1592947205.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "What? Most barbers in my country are woman...",
            "author": "CarasBridge",
            "id": "fvu9kfq",
            "parent_id": "t1_fvs5nvb",
            "score": 1,
            "created_utc": 1592996696.0,
            "replies": [
                {
                    "body": "Most women are licensed Cosmetologists. We go to school for different things from an actual barber. Hairdressers, for instance, can not shave faces in most cases in the US. Barbers are not allowed to give manicures here. So they are actually very different titles, and licensing.",
                    "author": "beanner468",
                    "id": "fvua7a0",
                    "parent_id": "t1_fvu9kfq",
                    "score": 2,
                    "created_utc": 1592997284.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "That's certainly one reason.\nThe other is, that you don't want people to hear: oh, hoe about we go shorter and then have to redo the whole thing.\nIt still happens. Several times in a row.",
            "author": "Wodr25",
            "id": "fvsoh1t",
            "parent_id": "t1_fvsn24x",
            "score": 4,
            "created_utc": 1592954764.0,
            "replies": []
        },
        {
            "body": "Sorry I’m not the right person to ask. I’m not very good at giving advice 😐. You should try to post it up again though, hopefully someone will help you out",
            "author": "mannerlybassoon",
            "id": "fvrnopg",
            "parent_id": "t1_fvrlmbr",
            "score": 2,
            "created_utc": 1592936362.0,
            "replies": []
        },
        {
            "body": "When your barber knows exactly ehat you want, they can do their job faster and better. Everyone likes clarity and happy customers 😊😊",
            "author": "Wodr25",
            "id": "fvs98qw",
            "parent_id": "t1_fvs5fs9",
            "score": 2,
            "created_utc": 1592946873.0,
            "replies": [
                {
                    "body": "Valid point!",
                    "author": null,
                    "id": "fvs9dq5",
                    "parent_id": "t1_fvs98qw",
                    "score": 1,
                    "created_utc": 1592946941.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I can't afford to look a mess again and again and again everytime I get a shifty haircut tho. Not to mention all the money going to a haircut u didn't want.",
            "author": "foreverandaday13",
            "id": "fvseix0",
            "parent_id": "t1_fvrr01y",
            "score": -10,
            "created_utc": 1592949507.0,
            "replies": [
                {
                    "body": "So you suggest going to the same barber and get the same bad haircut?",
                    "author": "Wodr25",
                    "id": "fvsfumt",
                    "parent_id": "t1_fvseix0",
                    "score": 36,
                    "created_utc": 1592950178.0,
                    "replies": []
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "fvsgbqp",
                    "parent_id": "t1_fvseix0",
                    "score": 14,
                    "created_utc": 1592950424.0,
                    "replies": [
                        {
                            "body": "Well then I will just stay miserable bitter ugly & with shitty hair, I guess.",
                            "author": "foreverandaday13",
                            "id": "fvsglb4",
                            "parent_id": "t1_fvsgbqp",
                            "score": -8,
                            "created_utc": 1592950561.0,
                            "replies": [
                                {
                                    "body": "https://www.reddit.com/r/orthotropics/comments/he7xgb/i_got_a_jawline_from_mewing_not_weight_loss/?utm_source=share&utm_medium=ios_app&utm_name=iossmf\n\nDon’t give up so easily. You can transform your appearance drastically if you put in the work to take care of yourself.",
                                    "author": "medina_ds3",
                                    "id": "fvspjv7",
                                    "parent_id": "t1_fvsglb4",
                                    "score": 2,
                                    "created_utc": 1592955364.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "It took me 4 years to find the barber who was perfect for me. Four years of shitty cuts, barbers who didn’t listen, etc. Invest in some hats & beanies just in case, or ride it out until you find one. Ask others for recs too, unless they’re recommending their friends",
                    "author": null,
                    "id": "fvumv6n",
                    "parent_id": "t1_fvseix0",
                    "score": 1,
                    "created_utc": 1593006326.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I’m not a native speaker and couldn’t remember how to spell it. Thanks 😂",
            "author": "Johny24F",
            "id": "fvtu0g9",
            "parent_id": "t1_fvsefrn",
            "score": 3,
            "created_utc": 1592981348.0,
            "replies": []
        },
        {
            "body": "I had to google it and actually I meant slicked back side",
            "author": "Johny24F",
            "id": "fvujbvn",
            "parent_id": "t1_fvu8f1c",
            "score": 1,
            "created_utc": 1593004206.0,
            "replies": [
                {
                    "body": "Your previous description of “sides way shorter and left me with a long hair on top” would seem to be at odds with “slicked back sides” – just goes to show exactly what OP warns about: talking about hair, instead of using photos, is only liable to cause confusion.",
                    "author": "isarl",
                    "id": "fvvcqsq",
                    "parent_id": "t1_fvujbvn",
                    "score": 1,
                    "created_utc": 1593019506.0,
                    "replies": [
                        {
                            "body": "I wanted a fade with short hair on top, as it was on the picture I showed the barber, and I got fade mixed with slicked back hair. And I was specifically telling barber I don’t want long hair on top since I work early mornings and don’t have time to fix my hair.",
                            "author": "Johny24F",
                            "id": "fvvmbbq",
                            "parent_id": "t1_fvvcqsq",
                            "score": 1,
                            "created_utc": 1593024049.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "It was 35 years ago, things have probably changed now.-you made me age myself!",
            "author": "beanner468",
            "id": "fvs9wtk",
            "parent_id": "t1_fvs9hyh",
            "score": 2,
            "created_utc": 1592947205.0,
            "replies": []
        },
        {
            "body": "Most women are licensed Cosmetologists. We go to school for different things from an actual barber. Hairdressers, for instance, can not shave faces in most cases in the US. Barbers are not allowed to give manicures here. So they are actually very different titles, and licensing.",
            "author": "beanner468",
            "id": "fvua7a0",
            "parent_id": "t1_fvu9kfq",
            "score": 2,
            "created_utc": 1592997284.0,
            "replies": []
        },
        {
            "body": "Valid point!",
            "author": null,
            "id": "fvs9dq5",
            "parent_id": "t1_fvs98qw",
            "score": 1,
            "created_utc": 1592946941.0,
            "replies": []
        },
        {
            "body": "So you suggest going to the same barber and get the same bad haircut?",
            "author": "Wodr25",
            "id": "fvsfumt",
            "parent_id": "t1_fvseix0",
            "score": 36,
            "created_utc": 1592950178.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fvsgbqp",
            "parent_id": "t1_fvseix0",
            "score": 14,
            "created_utc": 1592950424.0,
            "replies": [
                {
                    "body": "Well then I will just stay miserable bitter ugly & with shitty hair, I guess.",
                    "author": "foreverandaday13",
                    "id": "fvsglb4",
                    "parent_id": "t1_fvsgbqp",
                    "score": -8,
                    "created_utc": 1592950561.0,
                    "replies": [
                        {
                            "body": "https://www.reddit.com/r/orthotropics/comments/he7xgb/i_got_a_jawline_from_mewing_not_weight_loss/?utm_source=share&utm_medium=ios_app&utm_name=iossmf\n\nDon’t give up so easily. You can transform your appearance drastically if you put in the work to take care of yourself.",
                            "author": "medina_ds3",
                            "id": "fvspjv7",
                            "parent_id": "t1_fvsglb4",
                            "score": 2,
                            "created_utc": 1592955364.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "It took me 4 years to find the barber who was perfect for me. Four years of shitty cuts, barbers who didn’t listen, etc. Invest in some hats & beanies just in case, or ride it out until you find one. Ask others for recs too, unless they’re recommending their friends",
            "author": null,
            "id": "fvumv6n",
            "parent_id": "t1_fvseix0",
            "score": 1,
            "created_utc": 1593006326.0,
            "replies": []
        },
        {
            "body": "Your previous description of “sides way shorter and left me with a long hair on top” would seem to be at odds with “slicked back sides” – just goes to show exactly what OP warns about: talking about hair, instead of using photos, is only liable to cause confusion.",
            "author": "isarl",
            "id": "fvvcqsq",
            "parent_id": "t1_fvujbvn",
            "score": 1,
            "created_utc": 1593019506.0,
            "replies": [
                {
                    "body": "I wanted a fade with short hair on top, as it was on the picture I showed the barber, and I got fade mixed with slicked back hair. And I was specifically telling barber I don’t want long hair on top since I work early mornings and don’t have time to fix my hair.",
                    "author": "Johny24F",
                    "id": "fvvmbbq",
                    "parent_id": "t1_fvvcqsq",
                    "score": 1,
                    "created_utc": 1593024049.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Well then I will just stay miserable bitter ugly & with shitty hair, I guess.",
            "author": "foreverandaday13",
            "id": "fvsglb4",
            "parent_id": "t1_fvsgbqp",
            "score": -8,
            "created_utc": 1592950561.0,
            "replies": [
                {
                    "body": "https://www.reddit.com/r/orthotropics/comments/he7xgb/i_got_a_jawline_from_mewing_not_weight_loss/?utm_source=share&utm_medium=ios_app&utm_name=iossmf\n\nDon’t give up so easily. You can transform your appearance drastically if you put in the work to take care of yourself.",
                    "author": "medina_ds3",
                    "id": "fvspjv7",
                    "parent_id": "t1_fvsglb4",
                    "score": 2,
                    "created_utc": 1592955364.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I wanted a fade with short hair on top, as it was on the picture I showed the barber, and I got fade mixed with slicked back hair. And I was specifically telling barber I don’t want long hair on top since I work early mornings and don’t have time to fix my hair.",
            "author": "Johny24F",
            "id": "fvvmbbq",
            "parent_id": "t1_fvvcqsq",
            "score": 1,
            "created_utc": 1593024049.0,
            "replies": []
        },
        {
            "body": "https://www.reddit.com/r/orthotropics/comments/he7xgb/i_got_a_jawline_from_mewing_not_weight_loss/?utm_source=share&utm_medium=ios_app&utm_name=iossmf\n\nDon’t give up so easily. You can transform your appearance drastically if you put in the work to take care of yourself.",
            "author": "medina_ds3",
            "id": "fvspjv7",
            "parent_id": "t1_fvsglb4",
            "score": 2,
            "created_utc": 1592955364.0,
            "replies": []
        }
    ]
}