{
    "title": "Is it just me, or do some “SD’s” not understand the concept of sugar dating?",
    "post_id": "rzcmr0",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/rzcmr0/is_it_just_me_or_do_some_sds_not_understand_the/",
    "author": null,
    "body": "Just told a POT that I’m interested in a mutually beneficial arrangement, and they said “so you’re looking for someone to be financially responsible for you?”\nDo you NOT understand what sugar dating is? OF COURSE there is a financial aspect to this, WHY ELSE would I be talking to men more than twice my age? I would not expect to have someone pay me for a platonic relationship, so why should I have a sexual relationship with an “SD” for free? I just don’t get it. Why are there so many guys like this on SA?",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/rzcmr0/is_it_just_me_or_do_some_sds_not_understand_the/",
    "score": 172,
    "upvote_ratio": 0.94,
    "created_utc": 1641682854.0,
    "num_comments": 145,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "[deleted]",
            "author": null,
            "id": "hrvy72s",
            "parent_id": "t3_rzcmr0",
            "score": 35,
            "created_utc": 1641712726.0,
            "replies": [
                {
                    "body": "100%! I had a man who told me he wouldn’t consider an arrangement until I had sex with him. Then called me a prostitute when I said no. \n\nIt scared me off of finding a SD for a good year.",
                    "author": "madlyintrigued",
                    "id": "hryqld1",
                    "parent_id": "t1_hrvy72s",
                    "score": 6,
                    "created_utc": 1641761723.0,
                    "replies": []
                },
                {
                    "body": "Yes!",
                    "author": "Bbygirlxxxx",
                    "id": "hryknfg",
                    "parent_id": "t1_hrvy72s",
                    "score": 1,
                    "created_utc": 1641759646.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "lol it’s absolutely hilarious when men think giving women orgasms and dinners are being “generous” and qualifies them as a sugar daddy.",
            "author": "ExExpectations",
            "id": "hrvb96c",
            "parent_id": "t3_rzcmr0",
            "score": 84,
            "created_utc": 1641700171.0,
            "replies": [
                {
                    "body": "No no no! That’s called “boyfriend”\n\nThis is only even discussed due to the current state of “vanilla” dating in which people think it’s ok to be selfish. Every relationship should be mutually beneficial. I’ve always with very rare exceptions paid for dinner, and never 50/50 unless it was a clear platonic/aromantic situation and the 50/50 was to emphasize that. Mutual orgasms are a “good relationship”",
                    "author": "daddoms",
                    "id": "hrx3snj",
                    "parent_id": "t1_hrvb96c",
                    "score": 14,
                    "created_utc": 1641740002.0,
                    "replies": []
                },
                {
                    "body": "This 😂 \"IMm NOt COmfortAbLe GIving MOnenY AnNd BEINg TRANSAcTIonAl\" 😑 \nWell im not comfortable having you just pay for dinner and expect sex b",
                    "author": "sundriedflowers",
                    "id": "hrytsop",
                    "parent_id": "t1_hrvb96c",
                    "score": 11,
                    "created_utc": 1641762859.0,
                    "replies": []
                },
                {
                    "body": "Peridot",
                    "author": "RealisticPossession0",
                    "id": "hrxiel0",
                    "parent_id": "t1_hrvb96c",
                    "score": 4,
                    "created_utc": 1641745844.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "hrv0t7i",
            "parent_id": "t3_rzcmr0",
            "score": 63,
            "created_utc": 1641695524.0,
            "replies": [
                {
                    "body": "Unfortunately, YES.",
                    "author": null,
                    "id": "hrvokm1",
                    "parent_id": "t1_hrv0t7i",
                    "score": 5,
                    "created_utc": 1641706903.0,
                    "replies": []
                },
                {
                    "body": "I’m sorry raisins and dried sausage TOOK ME OUT.",
                    "author": "No-Letterhead5328",
                    "id": "hrxw92e",
                    "parent_id": "t1_hrv0t7i",
                    "score": 2,
                    "created_utc": 1641751034.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "You have no idea how many GREEN women come to SA daily and fall for that. Or don't know how to respond to it. Go with flow and end up getting pumped and dumped with no money.\n\nThey don't know step 1 of how to act in the bowl. This sub is just a thin slice of those \"in the know\".",
            "author": "southernslick",
            "id": "hrucg0d",
            "parent_id": "t3_rzcmr0",
            "score": 20,
            "created_utc": 1641685227.0,
            "replies": [
                {
                    "body": "Why do you say ‘fall for that’? some girls on seeking aren’t even looking for finances. A minority for sure, but not unusual.",
                    "author": null,
                    "id": "hrx3ala",
                    "parent_id": "t1_hrucg0d",
                    "score": -6,
                    "created_utc": 1641739777.0,
                    "replies": [
                        {
                            "body": "I say that because it is true. Based on what I have seen locally in market talking to pot and sb's. And the countless stories in this sub by women who did \"fall for that\".  \n\n\nTo your second sentence. I operate on the rule and not the exception. There are women not looking for finances. They are the exception. And I'm not going operate like they are the rule just to make a point.",
                            "author": "southernslick",
                            "id": "hrx4tfi",
                            "parent_id": "t1_hrx3ala",
                            "score": 9,
                            "created_utc": 1641740453.0,
                            "replies": [
                                {
                                    "body": "The stories on this sub do not represent what’s happening in the real world. 90% + of users on seeking don’t bother coming here to complain about things. Those that find what they want just don’t bother coming onto Reddit! Guys complain about the platonic girls. They exist. I’ve talked to them. I move on quick but don’t come on here to complain.",
                                    "author": null,
                                    "id": "hrxcol4",
                                    "parent_id": "t1_hrx4tfi",
                                    "score": -2,
                                    "created_utc": 1641743656.0,
                                    "replies": [
                                        {
                                            "body": "I also mentioned what I've seen locally in my area talking to pot and sugarbabies who have no idea this sub exists. Their stories mirror what I read in here in spite of the fact these ladies I've spoken to don't come here.   \n\n\nSo we both have our experiences offline in the real world. Let's leave it at that.",
                                            "author": "southernslick",
                                            "id": "hrxd77s",
                                            "parent_id": "t1_hrxcol4",
                                            "score": 7,
                                            "created_utc": 1641743852.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "This is true. \n\nI had a very pretty woman of 24 (I'm 40), message me first, saying she was interested in meeting higher quality men than frat boys her age, and she wanted to experience some \"luxury\", i.e., nice dinners, etc.\n\nShe didn't want money, just better experiences.",
                            "author": null,
                            "id": "hrxq65o",
                            "parent_id": "t1_hrx3ala",
                            "score": 1,
                            "created_utc": 1641748791.0,
                            "replies": [
                                {
                                    "body": "So it certainly happens to others then! I guess you’re in shape and treat girls well and  probably intelligent and successful though? So I was 49 and dated a cute 23 year old student who just wanted nice dinners etc. So it happens. Not popular to say it. My comment is being downvoted …. Whatever🙄",
                                    "author": null,
                                    "id": "hry5btl",
                                    "parent_id": "t1_hrxq65o",
                                    "score": -3,
                                    "created_utc": 1641754256.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "\"No I am not looking for someone to support me,  I am looking for someone who wants to invest in me and my future.\"",
            "author": "pinotandsugar",
            "id": "hrv3jpc",
            "parent_id": "t3_rzcmr0",
            "score": 9,
            "created_utc": 1641696698.0,
            "replies": []
        },
        {
            "body": "The same can be said the other way around. There are a ton of \"SBs\" out there who will say things like \n\n\"I just want to chat and send pictures and videos online\" - So make an OnlyFans\n\n\"I don't want to do anything physical but I'm a great listener and I give great advice\" - yup, I'm talking to a woman half my age to get her advice on things that are currently affecting me and because I don't want to do anything physical. Caveat: I'm not one to force the physical part of a relationship, I never have and I never will, but if any woman - regardless of how we met, Tinder, Bumble Seeking, through friends...whatever - tells me the physical aspect of the relationship is and forever will be off the table from the get go, I'm out. \n\n\"Oh so you just want to treat me like a h\\*\\*ker and pay me for s\\*x?\" - no, but regardless of my ability to pay the allowance/ppm/whatever, it's a meaningful amount of money for you. If we're going to have a relationship, I don't want to start by taking things off the table, especially when I'm providing something that makes a difference in your life.",
            "author": "Then-Explanation8567",
            "id": "hrwty9j",
            "parent_id": "t3_rzcmr0",
            "score": 9,
            "created_utc": 1641735180.0,
            "replies": [
                {
                    "body": "Your 2nd quote is my favorite. I call it money for nothing, same with the picture sellers.",
                    "author": "Hungboy6969420",
                    "id": "huvjxkc",
                    "parent_id": "t1_hrwty9j",
                    "score": 1,
                    "created_utc": 1643563991.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Because there are women that fall for this.",
            "author": null,
            "id": "hru71ck",
            "parent_id": "t3_rzcmr0",
            "score": 44,
            "created_utc": 1641682990.0,
            "replies": [
                {
                    "body": "But why wouldn’t they get tired of people always having to set them straight? If I was an “SB” looking for platonic only, I’d only exhaust myself trying to find something, and just give up.",
                    "author": null,
                    "id": "hruan9h",
                    "parent_id": "t1_hru71ck",
                    "score": 15,
                    "created_utc": 1641684486.0,
                    "replies": [
                        {
                            "body": "Please don't let these men bully you into thinking this is the norm and what you should do. don't lower your standards or what you expect. You came into sugar dating for financial reasons and you should stick to it. There's nothing wrong with wanting financial  help and there isn't anything wrong with getting financial help and there isn't anything wrong with not wanting any",
                            "author": "glamour_doll",
                            "id": "hrudlvu",
                            "parent_id": "t1_hruan9h",
                            "score": 38,
                            "created_utc": 1641685710.0,
                            "replies": [
                                {
                                    "body": "Yes that’s what sugar dating is about the money part and it’s crazy that there are men who insert themselves into sugar dating to shame women who want money(these are the narcissist fake SD).\n\nMost of these guys are narcissists or have nothing to offer but money, so they use money to attract women because they know no decent woman wants them. So they come onto sugar dating instead of using common sense and going on bumble/tinder and add a bio, where you can brag about money since you have no qualities \n\nThere are girls out there who just want rich boyfriends so they probably come there, but even with wanting rich boyfriends, money is a big part",
                                    "author": "Specific-Fondant-525",
                                    "id": "hrueebo",
                                    "parent_id": "t1_hrudlvu",
                                    "score": 14,
                                    "created_utc": 1641686037.0,
                                    "replies": [
                                        {
                                            "body": "agreed 🙌",
                                            "author": "glamour_doll",
                                            "id": "hruenb5",
                                            "parent_id": "t1_hrueebo",
                                            "score": 6,
                                            "created_utc": 1641686139.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "I don’t think you realize how many girls are on seeking that are looking for, or open to something vanilla without an allowance. Whether or not you want to admit it, there are girls on seeking that are looking for this, and that is why there are guys on seeking looking for sex or vanilla with no allowance.\n\nIn November alone I went out with 5-6 girls from seeking that just wanted a rich boyfriend, no allowance or ppm required.",
                            "author": null,
                            "id": "hruayqk",
                            "parent_id": "t1_hruan9h",
                            "score": -3,
                            "created_utc": 1641684617.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "hrw8djs",
                                    "parent_id": "t1_hruayqk",
                                    "score": 7,
                                    "created_utc": 1641720048.0,
                                    "replies": [
                                        {
                                            "body": "Because on Hinge and Bumble there is no way to filter by wealth or income.\n\nAt least on SD it's safe to assume at least some of the guys there are wealthy and the ones that are are there even though they presume they'll have to pay.\n\nI have had at least 10 girls in the past year alone tell me they use Seeking to meet rich guys, not necessarily to sugar",
                                            "author": "gangsta_baby",
                                            "id": "hrwrx8h",
                                            "parent_id": "t1_hrw8djs",
                                            "score": 4,
                                            "created_utc": 1641734036.0,
                                            "replies": [
                                                {
                                                    "body": "Honestly it’s funny because even with the income listed on most SD profiles their level of wealth doesn’t mean they’re generous or would be willing to do luxurious things.",
                                                    "author": "No-Letterhead5328",
                                                    "id": "hrxzep5",
                                                    "parent_id": "t1_hrwrx8h",
                                                    "score": 4,
                                                    "created_utc": 1641752185.0,
                                                    "replies": [
                                                        {
                                                            "body": "We know.\n\nBut that is irrelevant to why women go to the site to find rich guys. The probability is just higher there than on regular dating sites to find a 'richer' guy than most.\n\nOn regular dating sites there is literally no way to determine that, or filter for wealth. Also putting 'I only want a wealthy man' on a regular dating site isn't really going to make you any friends. It'll turn off the 'regulars' and the rich guys among them will probably see it as a red flag.\n\nSo the other reason is that they can be explicit about what they want (even if they have to wade through a bunch of bullshit and scammers to get it)",
                                                            "author": "gangsta_baby",
                                                            "id": "hrypxb4",
                                                            "parent_id": "t1_hrxzep5",
                                                            "score": 0,
                                                            "created_utc": 1641761493.0,
                                                            "replies": [
                                                                {
                                                                    "body": "I was agreeing with you lol. I was just pointing out that it’s not always what it seems for some people and adding onto what you said.",
                                                                    "author": "No-Letterhead5328",
                                                                    "id": "hs3enpr",
                                                                    "parent_id": "t1_hrypxb4",
                                                                    "score": 2,
                                                                    "created_utc": 1641838830.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "body": "I don’t know, why don’t you ask them why they’re on seeking. But I can only guess because there’s more millionaires on seeking than any other dating site :)\n\nAlso, don’t you think most of these girls are also on hinge or bumble? I can’t tell you how many seeking girls I also see on the vanilla dating apps.",
                                            "author": null,
                                            "id": "hrxeamg",
                                            "parent_id": "t1_hrw8djs",
                                            "score": 1,
                                            "created_utc": 1641744270.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "\\>Why won’t these girls just go on hinge or bumble then?\n\nThat's inefficient, the whole point of SAS is that these guys are paying for a membership and that works as a filter.\n\nThere's no broke bros in SA as you need at least $100 to play but mountains of those guys are all over hinge/tinder/bumble.",
                                            "author": "No-Hat5902",
                                            "id": "hryt6u3",
                                            "parent_id": "t1_hrw8djs",
                                            "score": 0,
                                            "created_utc": 1641762638.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "It’s not BS by the way. At least not in Europe…",
                                            "author": null,
                                            "id": "hrx2tii",
                                            "parent_id": "t1_hrw8djs",
                                            "score": 1,
                                            "created_utc": 1641739562.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "Soo what happened with those 5-6 girls?",
                                    "author": "D2boujee",
                                    "id": "hrukacl",
                                    "parent_id": "t1_hruayqk",
                                    "score": 6,
                                    "created_utc": 1641688477.0,
                                    "replies": [
                                        {
                                            "body": "I still talk and casually see 3 of them. The other 3 it didn’t work out with or I decided not to see them again.",
                                            "author": null,
                                            "id": "hrul6ll",
                                            "parent_id": "t1_hrukacl",
                                            "score": -3,
                                            "created_utc": 1641688855.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "Everyone’s different. I once had a SB that just wanted to go to the mall and watch me swipe plastic. Never asked for a penny.",
                                    "author": "YakiMe",
                                    "id": "hrv0t55",
                                    "parent_id": "t1_hruayqk",
                                    "score": 1,
                                    "created_utc": 1641695523.0,
                                    "replies": []
                                },
                                {
                                    "body": "The pro SBs really don’t like hearing this. They want to protect the idea that girls on seeking should be acting according to their laws of sugaring. If they keep sleeping with guys for free it undermines their position. But not all girls on seeking are sugar babes. Many of us know that. Some girls want to sleep with guys twice the age without finances. I know that. Sorry. Downvotes expected….",
                                    "author": null,
                                    "id": "hrx2i71",
                                    "parent_id": "t1_hruayqk",
                                    "score": -2,
                                    "created_utc": 1641739420.0,
                                    "replies": [
                                        {
                                            "body": "You’re deluding yourself sir",
                                            "author": "Bbygirlxxxx",
                                            "id": "hrykypl",
                                            "parent_id": "t1_hrx2i71",
                                            "score": 4,
                                            "created_utc": 1641759756.0,
                                            "replies": [
                                                {
                                                    "body": "I’m just sharing my experience. Sorry.",
                                                    "author": null,
                                                    "id": "hs1b3fx",
                                                    "parent_id": "t1_hrykypl",
                                                    "score": 0,
                                                    "created_utc": 1641800482.0,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "body": "Oh yea I already expect downvotes whenever I say this lol.",
                                            "author": null,
                                            "id": "hrxe0oy",
                                            "parent_id": "t1_hrx2i71",
                                            "score": 3,
                                            "created_utc": 1641744162.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "So true. Same with men who hate the guys paying for platonic dates, pics, online relationships etc. It ruins the balance",
                                            "author": "Hungboy6969420",
                                            "id": "huvki7y",
                                            "parent_id": "t1_hrx2i71",
                                            "score": 1,
                                            "created_utc": 1643564208.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "High five lol",
                                    "author": "wb19081908",
                                    "id": "hrw651a",
                                    "parent_id": "t1_hruayqk",
                                    "score": -1,
                                    "created_utc": 1641718372.0,
                                    "replies": []
                                },
                                {
                                    "body": "Good to know. I might fire up SA sooner if I’m not happy with my vanilla activity. The only thing is my local vanilla aged women aren’t really girlfriend material. I just did a quick search for 26~33 (my normal vanilla match age), and I’m seeing a lot of fat women or single mothers. Could be a seasonal thing though, since I’m seeing a lot of that when I’ve been swiping mindlessly on tinder too.",
                                    "author": "sdthrowaway006",
                                    "id": "hrv00cu",
                                    "parent_id": "t1_hruayqk",
                                    "score": -7,
                                    "created_utc": 1641695178.0,
                                    "replies": [
                                        {
                                            "body": "Swipe app algorithms show you more of what you swipe right on.",
                                            "author": null,
                                            "id": "hrxqqoo",
                                            "parent_id": "t1_hrv00cu",
                                            "score": 2,
                                            "created_utc": 1641749001.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "Agreed. \n\nThere's a percentage of women that just don't want to date men they perceive to be broke, losers, etc.",
                                    "author": null,
                                    "id": "hrxqjm9",
                                    "parent_id": "t1_hruayqk",
                                    "score": 1,
                                    "created_utc": 1641748929.0,
                                    "replies": []
                                },
                                {
                                    "body": "Yep it's rich boyfriend finder. It's relatively common",
                                    "author": "Hungboy6969420",
                                    "id": "huvk3sf",
                                    "parent_id": "t1_hruayqk",
                                    "score": 1,
                                    "created_utc": 1643564058.0,
                                    "replies": [
                                        {
                                            "body": "100%",
                                            "author": null,
                                            "id": "huvk8be",
                                            "parent_id": "t1_huvk3sf",
                                            "score": 1,
                                            "created_utc": 1643564105.0,
                                            "replies": [
                                                {
                                                    "body": "I met a woman recently off there who claimed to have been in multiple long term relationships with daddies without ever actually taking allowance/ppm. She just wanted to be around rich dudes who spoiled her and she could learn from. Pretty smart imo",
                                                    "author": "Hungboy6969420",
                                                    "id": "huvkefr",
                                                    "parent_id": "t1_huvk8be",
                                                    "score": 1,
                                                    "created_utc": 1643564168.0,
                                                    "replies": [
                                                        {
                                                            "body": "Im going out with a pretty latina today who told me she doesn’t want any money from me, she just wants to date a more established man. She said she was tired of all the tinder fuck boys just looking for sex.",
                                                            "author": null,
                                                            "id": "huvkzp6",
                                                            "parent_id": "t1_huvkefr",
                                                            "score": 1,
                                                            "created_utc": 1643564395.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Ha that's almost exactly what this woman said too. \"I could hook up with a frat bro but that gets old, why not get something else outta having sex?\"",
                                                                    "author": "Hungboy6969420",
                                                                    "id": "huvl4bb",
                                                                    "parent_id": "t1_huvkzp6",
                                                                    "score": 1,
                                                                    "created_utc": 1643564442.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "Yep! I have a date next week with another young woman from SA, who said she likes older men and is looking for a relationship and no money. Works for me lol!",
                                                                            "author": null,
                                                                            "id": "huvm590",
                                                                            "parent_id": "t1_huvl4bb",
                                                                            "score": 1,
                                                                            "created_utc": 1643564835.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "This.",
                    "author": "oso8daddy",
                    "id": "hru92pk",
                    "parent_id": "t1_hru71ck",
                    "score": 0,
                    "created_utc": 1641683839.0,
                    "replies": []
                },
                {
                    "body": "Love your concise answer.  😃",
                    "author": "HappyBear1952",
                    "id": "hrulwuo",
                    "parent_id": "t1_hru71ck",
                    "score": -1,
                    "created_utc": 1641689163.0,
                    "replies": [
                        {
                            "body": "Straight to the point lol.",
                            "author": null,
                            "id": "hrulzhu",
                            "parent_id": "t1_hrulwuo",
                            "score": 0,
                            "created_utc": 1641689195.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "It's push back for the \"Can't meet due to Covid\" , pay my bills group. Every action has an equal & opposite reaction",
                    "author": "Smitt727",
                    "id": "hrv5qtx",
                    "parent_id": "t1_hru71ck",
                    "score": -1,
                    "created_utc": 1641697683.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Because from what the men say here there are also women on there who surprisingly “don’t want an allowance just nice dinners or experiences” 😂\n\nI won’t lie I seen some girl here before saying that is it bad she just wants a sugar daddy to buy her groceries and she would be so happy to have that. I just about died….. cause if that’s the case go to a food bank and get off this site. That’s not what an arrangement is supposed to be, it sounds like charity. Men and women are both fucking up the bowl in my opinion.",
            "author": "iwishyouwo0d",
            "id": "hruuoxu",
            "parent_id": "t3_rzcmr0",
            "score": 28,
            "created_utc": 1641692882.0,
            "replies": [
                {
                    "body": "First: I share the frustration you’re expressing.\n-BUT-\nLike the rest of societies’ norms, even the bowl is devolving.  Our only choices as “legacy” sugarers is to either adapt or branch out and find or create a new foothold for the way things used to be.  \n\nI’m on my 5th Platonic date with my latest POT.  I am thunderstruck and enamored, she is just amazing.  On our first date, she made it clear that she doesn’t ever want to feel like a hooker, and used that phrase.  Second date, she offers to split the check! This was after we had a convo about me providing an allowance! Third date we talked about medical history (she has a lifetime condition that requires consideration), STDs and getting tested, which we are doing already, plus great street tacos with green sauce!  4th date is a nice dinner with margaritas, some light touch and an agreement that we are gonna do this.  5th date tonight, I only had a sitter for 2 hours, so we meet for drinks in the bar of a 5-star resort mainly because they offer quiet corners.  Good lord, we cant stop talking and being excited!  I’m out of time, we’ve already planned an excursion in three weeks to go on a BBQ run for 3 days, with a break in the middle for Spa time.\n\nOther than a few kisses and some heavy flirting, we have not gone physical yet, but nor has any sugar($) been exchanged.  Yet we are both having a great time.\n\nOvernight at my home planned for later this week.  She’s going to cook us dinner, then we are gonna watch North By NorthWest.  Good googly-moogly, the bowl can be soooo good!",
                    "author": "txjerome",
                    "id": "hrvn4at",
                    "parent_id": "t1_hruuoxu",
                    "score": 3,
                    "created_utc": 1641706106.0,
                    "replies": [
                        {
                            "body": "Are you sure you're not impotent",
                            "author": null,
                            "id": "hrxre8i",
                            "parent_id": "t1_hrvn4at",
                            "score": 1,
                            "created_utc": 1641749240.0,
                            "replies": [
                                {
                                    "body": "Yup, no worries there, fortunately…",
                                    "author": "txjerome",
                                    "id": "hrxrz55",
                                    "parent_id": "t1_hrxre8i",
                                    "score": 2,
                                    "created_utc": 1641749456.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "That’s me! I love rich older men and all I expect from them is to pay for our dates :)",
                    "author": "nystatin94",
                    "id": "hruw3k1",
                    "parent_id": "t1_hruuoxu",
                    "score": -4,
                    "created_utc": 1641693486.0,
                    "replies": [
                        {
                            "body": "Uh, congratulations???\n\nThen you’re exactly who I’m talking about when I say “men and women fucking up the bowl”",
                            "author": "iwishyouwo0d",
                            "id": "hrux8km",
                            "parent_id": "t1_hruw3k1",
                            "score": 16,
                            "created_utc": 1641693979.0,
                            "replies": [
                                {
                                    "body": "She sounds like a WHOLE Pick me. Offering to split a check? cooking a man dinner? ... in the bowl?  \n\nLet me go over here and pray because I do not need to hear this level desperation on the Lord’s Day",
                                    "author": "TX_SB",
                                    "id": "hryoss9",
                                    "parent_id": "t1_hrux8km",
                                    "score": 5,
                                    "created_utc": 1641761101.0,
                                    "replies": []
                                },
                                {
                                    "body": "LMAO. She’s excited about getting a free dinner after fucking? 😢",
                                    "author": null,
                                    "id": "hrvob8a",
                                    "parent_id": "t1_hrux8km",
                                    "score": 9,
                                    "created_utc": 1641706757.0,
                                    "replies": [
                                        {
                                            "body": "Don’t forget about the free drinks!!! Dems expensive 🥂",
                                            "author": "iwishyouwo0d",
                                            "id": "hrvojfx",
                                            "parent_id": "t1_hrvob8a",
                                            "score": 6,
                                            "created_utc": 1641706885.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "[removed]",
                                    "author": null,
                                    "id": "hruydgt",
                                    "parent_id": "t1_hrux8km",
                                    "score": 1,
                                    "created_utc": 1641694471.0,
                                    "replies": [
                                        {
                                            "body": "So you’re saying sugar babies that require an allowance are prostitutes? Got it.",
                                            "author": "iwishyouwo0d",
                                            "id": "hrv2h84",
                                            "parent_id": "t1_hruydgt",
                                            "score": 8,
                                            "created_utc": 1641696237.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "[removed]",
                                    "author": null,
                                    "id": "hrvlrtd",
                                    "parent_id": "t1_hrux8km",
                                    "score": -1,
                                    "created_utc": 1641705373.0,
                                    "replies": [
                                        {
                                            "body": "The girls that get it, get it. The ones that don’t, don’t.",
                                            "author": "iwishyouwo0d",
                                            "id": "hrvz0j3",
                                            "parent_id": "t1_hrvlrtd",
                                            "score": 7,
                                            "created_utc": 1641713277.0,
                                            "replies": [
                                                {
                                                    "body": "Not everyone has to think like you. To each their own.",
                                                    "author": "dtan777",
                                                    "id": "hrxl4ru",
                                                    "parent_id": "t1_hrvz0j3",
                                                    "score": 0,
                                                    "created_utc": 1641746885.0,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "body": "She should be looking for Vanilla relationships since what she wants wouldn’t be considered sugar.",
                                            "author": "lenaanabelle",
                                            "id": "hrwi82y",
                                            "parent_id": "t1_hrvlrtd",
                                            "score": 6,
                                            "created_utc": 1641727696.0,
                                            "replies": [
                                                {
                                                    "body": "Yeah but how do you get to determine who belongs to SA or not. Everyone has the right to use it in whichever way they want. There are all kinds of mutually beneficial relationships, not just transactional ones.",
                                                    "author": "dtan777",
                                                    "id": "hrxl2b9",
                                                    "parent_id": "t1_hrwi82y",
                                                    "score": 0,
                                                    "created_utc": 1641746859.0,
                                                    "replies": [
                                                        {
                                                            "body": "Seeking is not a vanilla dating site.",
                                                            "author": "lenaanabelle",
                                                            "id": "hs8pim3",
                                                            "parent_id": "t1_hrxl2b9",
                                                            "score": 1,
                                                            "created_utc": 1641926790.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Mutually beneficial does not equal transactional. Maybe you’re the one who doesn’t belong on sugar dating sites.",
                                                                    "author": "dtan777",
                                                                    "id": "hs9omrg",
                                                                    "parent_id": "t1_hs8pim3",
                                                                    "score": 1,
                                                                    "created_utc": 1641939698.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "body": "No mutually beneficial doesn’t mean transactional, but the purpose of being in a mutually beneficial arrangement is because it’s not traditional.\n\nA guy buying you dinner is literally the bare minimum in traditional dating. Nothing wrong with it, but you can easily find that anywhere.",
                                                    "author": "lenaanabelle",
                                                    "id": "httwsqw",
                                                    "parent_id": "t1_hrwi82y",
                                                    "score": 1,
                                                    "created_utc": 1642906867.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I agree with the comments here: SA is evolving and more and more men and women are looking or open to a hybrid or vanilla arrangement/relationship. \n\nBut some of these guys on SA are obviously delusional. No attractive college woman is going to date an unattractive dude 2-3x her age without money. Those guys are wasting their time. Women on Seeking looking for vanilla are going to be pickier then women looking for an allowance. It’s still more focused on sugar then vanilla, this isn’t Bumble.",
            "author": "new_sd_acct",
            "id": "hrugaa0",
            "parent_id": "t3_rzcmr0",
            "score": 12,
            "created_utc": 1641686818.0,
            "replies": [
                {
                    "body": "This also is true in the flip side. \nJust this week a woman was here asking about a financial arrangement with no physical intimacy.  \nNo one will like a one sided long term arrangement.   On both sides we just need to quickly screen the naive and get to a great, mutually beneficial relationship",
                    "author": "DrZenRoot",
                    "id": "hrus3hr",
                    "parent_id": "t1_hrugaa0",
                    "score": 4,
                    "created_utc": 1641691765.0,
                    "replies": [
                        {
                            "body": "Just saying that does happen but is extremely rare, I got really lucky once (on tinder not SA actually) and had a purely textual relationship with a SD. Made a couple hundred bucks in about two months before school got in the way, but it wasn't bad for being a busy college kid and just sexting",
                            "author": "space-zebras",
                            "id": "hrvv07o",
                            "parent_id": "t1_hrus3hr",
                            "score": 0,
                            "created_utc": 1641710654.0,
                            "replies": []
                        },
                        {
                            "body": "Yup. Well said.",
                            "author": "new_sd_acct",
                            "id": "hruu1a9",
                            "parent_id": "t1_hrus3hr",
                            "score": 0,
                            "created_utc": 1641692598.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "DaveRamsey12 makes a great point sharing his experience about many women being satisfied with a wealthy boyfriend over a SD. 2 of the hottest women I've interacted with shared \"wealthy boyfriend\" experiences that they were completely happy with.\n\nSo what does that mean for you? Go older, go uglier, go fatter. We,  the older, uglier, fatter, do not receive much interest. Most of my messages are in \"delivered\" status. Meaning that she has not even read my preliminary message or viewed my profile. The younger men have lots of options. They are most coveted, competed for, and therefore have the luxury of getting what they want, and giving less if anything. The men in my group would never consider the possibility of no sugar. \n\nExpand your search criteria. Better yet shift it to the right on the age timeline. You are here to have needs met, but the younger and attractive men you seek as DaveRamsey12 attests, do not need to fill your needs to get theirs filled. It is your choice. Spend hours weeding through the guys you want, but are not willing to give, or find the men that want you, and are willing to give.",
            "author": "docrolling",
            "id": "hruhmwo",
            "parent_id": "t3_rzcmr0",
            "score": 28,
            "created_utc": 1641687377.0,
            "replies": [
                {
                    "body": "i have been seeing a lot on here about how even 30-45 year olds are just cheap and try to take advantage of you and as a result I have changed my search and looking for criteria to 45 + xD",
                    "author": "panda_person666",
                    "id": "hrvhnzo",
                    "parent_id": "t1_hruhmwo",
                    "score": 12,
                    "created_utc": 1641703222.0,
                    "replies": [
                        {
                            "body": "Why are they taking advantage? If they are up front about not offering to pay and they’re good looking enough to date vanilla, even though they’re using seeking, then what’s the issue. You just need to move on and find those that want to pay you. Just as SDs need to find those who aren’t just platonic or online only. It’s a filtering process that’s all. Seeking now has many kinds of people on both sides. No rules here, just keep looking til you find a match.",
                            "author": null,
                            "id": "hrx3svt",
                            "parent_id": "t1_hrvhnzo",
                            "score": 3,
                            "created_utc": 1641740004.0,
                            "replies": [
                                {
                                    "body": "you confuse me or aren't a real SD.... What is all this bull about looking good enough to vanilla date?? If you lowball offer because of this you are a fake SD trying to take advantage of SBs end of story. If you want, look at my most recent post for SLF. I am demisexual. I am not attracted to people like that. If you look hot by societal standards I don't care it doesn't make me like you so your point is useless for me. Anyone looks good enough to vanilla date.\n\nI am aware of all this, but thx I guess.",
                                    "author": "panda_person666",
                                    "id": "hs03abd",
                                    "parent_id": "t1_hrx3svt",
                                    "score": 3,
                                    "created_utc": 1641779959.0,
                                    "replies": [
                                        {
                                            "body": "I don't think you appreciate that on seeking (here in Europe at least) there are women who are not 'traditional SBs' looking for allowances...some just want a bit of pampering or to meet a stable intelligent (preferably good looking, or at least not fat and ugly) guy that may be alot older than them without ppms or allowances. I've met trad SBs AND these girls, they both exist. It's a wide world out there.",
                                            "author": null,
                                            "id": "hs1muse",
                                            "parent_id": "t1_hs03abd",
                                            "score": 0,
                                            "created_utc": 1641809083.0,
                                            "replies": [
                                                {
                                                    "body": "why should I appreciate that?? European or not?",
                                                    "author": "panda_person666",
                                                    "id": "hs3owr3",
                                                    "parent_id": "t1_hs1muse",
                                                    "score": 2,
                                                    "created_utc": 1641842535.0,
                                                    "replies": [
                                                        {
                                                            "body": "Appreciate as in ‘understand’. Anyway It’s just how it is over here. FYI.",
                                                            "author": null,
                                                            "id": "hs3tvur",
                                                            "parent_id": "t1_hs3owr3",
                                                            "score": 1,
                                                            "created_utc": 1641844359.0,
                                                            "replies": [
                                                                {
                                                                    "body": "then \"appreciate\" that isn't really how it is over here xD",
                                                                    "author": "panda_person666",
                                                                    "id": "hs4npfc",
                                                                    "parent_id": "t1_hs3tvur",
                                                                    "score": 1,
                                                                    "created_utc": 1641855519.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Same here, i dont bother with those youngins.",
                            "author": "LaIndiaDeAzucar",
                            "id": "hrw1rst",
                            "parent_id": "t1_hrvhnzo",
                            "score": 2,
                            "created_utc": 1641715189.0,
                            "replies": []
                        },
                        {
                            "body": "It always depends. I'm in that age range and I always pay very well. However, I have zero tolerance for girls who want to be paid without sex. If that's what you're looking for then, yes, stick to the fossils",
                            "author": "gangsta_baby",
                            "id": "hrwsai5",
                            "parent_id": "t1_hrvhnzo",
                            "score": 0,
                            "created_utc": 1641734246.0,
                            "replies": [
                                {
                                    "body": "that is not what I am looking for and never implied that is what I am looking for?\n\nyea makes sense. the same way I don't want to be kissed or touched when you only bought me dinner.",
                                    "author": "panda_person666",
                                    "id": "hs02gbc",
                                    "parent_id": "t1_hrwsai5",
                                    "score": 1,
                                    "created_utc": 1641779623.0,
                                    "replies": [
                                        {
                                            "body": "> yea makes sense. the same way I don't want to be kissed or touched when you only bought me dinner.\n\nI’m not talking about buying dinner. I’m talking about in a sugar relationship both sides need to be clear about their intentions. Too many aspiring SBs, not necessarily you, aren’t. And because they can’t be clear, honest and reliable, they just don’t get what they want.\n\nIt’s no different than an SD not being reliable and consistent for her.\n\nIf your sugar dates only boil down to dinners, you may be doing it wrong.",
                                            "author": "gangsta_baby",
                                            "id": "hs0rgw2",
                                            "parent_id": "t1_hs02gbc",
                                            "score": 0,
                                            "created_utc": 1641790053.0,
                                            "replies": [
                                                {
                                                    "body": "bruh. I know YOU aren't. I was making a comparison. You said you have 0 tolerance for girls who want money for platonic dates or no sex. I am saying I understand. it's like how I have zero tolerance for someone who wants to do stuff like foreplay on the first date but not give me anything in return really. Yea... I know many aren't why exactly are you telling me this? I am so lost as to what your point even is. Why are you even bringing any of this up. I never asked and it's not even related to what I commented about. All I said was that I have moved my age range up since most under 45 try to pull being cheap. not all but most. \n\nI'm not doing anything wrong?? I am talking about the M & G. Literally what are you talking about and why even??",
                                                    "author": "panda_person666",
                                                    "id": "hs10qe3",
                                                    "parent_id": "t1_hs0rgw2",
                                                    "score": 2,
                                                    "created_utc": 1641794263.0,
                                                    "replies": [
                                                        {
                                                            "body": "I’m not a Bruh I’m a Bro! j/k",
                                                            "author": "gangsta_baby",
                                                            "id": "hs14iin",
                                                            "parent_id": "t1_hs10qe3",
                                                            "score": 1,
                                                            "created_utc": 1641796400.0,
                                                            "replies": [
                                                                {
                                                                    "body": "nice not responding to my calling ya out",
                                                                    "author": "panda_person666",
                                                                    "id": "hs3m60h",
                                                                    "parent_id": "t1_hs14iin",
                                                                    "score": 2,
                                                                    "created_utc": 1641841542.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "What am I responding to you made a great point so I stopped. :-)",
                                                                            "author": "gangsta_baby",
                                                                            "id": "hs3ocu1",
                                                                            "parent_id": "t1_hs3m60h",
                                                                            "score": 1,
                                                                            "created_utc": 1641842336.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "This right here!!!",
                    "author": "iwishyouwo0d",
                    "id": "hruvyvu",
                    "parent_id": "t1_hruhmwo",
                    "score": 4,
                    "created_utc": 1641693430.0,
                    "replies": []
                },
                {
                    "body": "Well said.",
                    "author": null,
                    "id": "hruka86",
                    "parent_id": "t1_hruhmwo",
                    "score": 2,
                    "created_utc": 1641688475.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Breathe hun....let it go and move on. Being mad about basic bitches isn't worth your time. Stick to your guns and don't engage with those \"men\".",
            "author": "ModdedDoll",
            "id": "hrvdt34",
            "parent_id": "t3_rzcmr0",
            "score": 4,
            "created_utc": 1641701350.0,
            "replies": []
        },
        {
            "body": "SA is filled with tire-kicking cheap Johns. It's the tradeoff of using a free/cheap site.\n\nIf you want to only meet curated pre-selected rich guys, and not be exposed to the riff-raff, your only option is to hire a matchmaker to do the leg-work for you in filtering for those rich guys who are generous and authentic SD's.\n\nOtherwise, you're stuck having to do that filtering process on your own.",
            "author": "Nomad_Bill",
            "id": "hrv6d55",
            "parent_id": "t3_rzcmr0",
            "score": 6,
            "created_utc": 1641697964.0,
            "replies": [
                {
                    "body": "\\>your only option is to hire a matchmaker\n\nLol, matchmakers working with rich guys only choose very attractive and smart women. The average college girl wouldn't make the cut.",
                    "author": "No-Hat5902",
                    "id": "hrytuuk",
                    "parent_id": "t1_hrv6d55",
                    "score": 1,
                    "created_utc": 1641762882.0,
                    "replies": [
                        {
                            "body": "Not true, because those 2 things are far from mutually exclusive.\n\nA woman's peak sexual market value is age 23, so there is a vast overlap between even the \"average\" college girl, and what many rich guys will choose.",
                            "author": "Nomad_Bill",
                            "id": "hrzh7js",
                            "parent_id": "t1_hrytuuk",
                            "score": 1,
                            "created_utc": 1641771378.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "It’s been months since I’ve had even a MG because I ask first text. I’m not even about to waste my time or gas. \n\nIts really the nerve of them trying convince you that their too attractive for that or you’re an escort 😂\n\nI also see a pattern with these type of men seeing their mothers do it all. I feel sorry, but they truly like to project that on to any women they date…..",
            "author": "Woahyeah1",
            "id": "hruxyj6",
            "parent_id": "t3_rzcmr0",
            "score": 8,
            "created_utc": 1641694290.0,
            "replies": [
                {
                    "body": "Period! If we’re not aligned from the get go then there is no need for us to keep pointlessly having small talk, just to never meet. \n\nThere is a financial component to these relationships (true sugar daddy sugar baby) that is the reality of it… and that figure It either works for both people or it doesn’t. But if it doesn’t, move on. It it does, meet and see if you guys get on well. I don’t have time that I’m open to wasting.",
                    "author": "iwishyouwo0d",
                    "id": "hruzexd",
                    "parent_id": "t1_hruxyj6",
                    "score": 3,
                    "created_utc": 1641694923.0,
                    "replies": [
                        {
                            "body": "Listen its drives me insane 😂 I put I’m seeking a traditional SD so don’t even ask to view my photos! \n\nI’m even the same with vanilla dating. If you’re not taking me out more. And surprising me I don’t want you 🥴. SD get more of a pass on not being attentive bc it’s NSA…",
                            "author": "Woahyeah1",
                            "id": "hrv0qy8",
                            "parent_id": "t1_hruzexd",
                            "score": 5,
                            "created_utc": 1641695497.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "No need to get upset. Just respond logically like they're an idiot: \"Yes, that's what sugar dating is.\"",
            "author": "PLooBzor",
            "id": "hrwidmz",
            "parent_id": "t3_rzcmr0",
            "score": 3,
            "created_utc": 1641727812.0,
            "replies": []
        },
        {
            "body": "Because they've heard from other men posing as fake SDs pretending to be legit to any naive girl on the website who's too shy or desperate to ask for more that they can swindle or guilt ladies into banging for free.\n\nAn example: my ex-friend tried to slutshame me by bringing up how her SD, who has daughters only a few years older than her, that \"her sugar daddy doesn't like women who sugar for financial gain or social status\". So her original plan of getting a laptop and college funds or her own escape from home was instead traded out for sex for three days, half of a subway sandwich, some wine and weed with a fruit plate. She was happy, but god she veered far off the path...\n\nThere's girls who will do it, so there's an overabundance of men who try their luck. Since worst case scenario, they killed a few hours, and ended up the same spot they began; without any sugar to give nor get.\n\nSame reason for the overabundance of girls who want platonic stuff. Since there's naive guys who will send women money even if they don't know them without verifying if scammer or not. (I.e. a guy I went on a date with who talked about how he sent 50 dollars to a 'random pretty woman who texted him about supposedly getting his number off WYP' and they never met at all.)",
            "author": "sbgonebroke",
            "id": "hrwt8lz",
            "parent_id": "t3_rzcmr0",
            "score": 3,
            "created_utc": 1641734782.0,
            "replies": []
        },
        {
            "body": ">I would not expect to have someone pay me for a platonic relationship\n\n\n>why should I have a sexual relationship with an “SD” for free? \n\nIn fairness, in this sub, many many SBs keep claiming that the \"sexual relationship\" is not intrinsically part of the SR.  That not providing it is no reason to not provide the allowance.  \n\nThere have been at least three threads this past week with SBs militantly stating that. They seem to equate what you just described with \"sexwork\", which they then equate with street walkers.\n\nRead those posts and fight it out with them.",
            "author": "Invalid_Nulls",
            "id": "hruj3my",
            "parent_id": "t3_rzcmr0",
            "score": 5,
            "created_utc": 1641687985.0,
            "replies": [
                {
                    "body": "I agree, the sexual relationship is not essential to a SR, and this does benefit a lot of SB’s and SD’s who seek something more platonic, and that is their prerogative. I personally don’t seek out platonic only relations, and am not looking to invest emotionally in someone, which is why I wouldn’t expect to be paid for that. I will not be fighting with any other SB’s because they choose to keep things platonic, nor will I bash SD’s who find that type of arrangement beneficial to them.",
                    "author": null,
                    "id": "hrut2yh",
                    "parent_id": "t1_hruj3my",
                    "score": 4,
                    "created_utc": 1641692189.0,
                    "replies": [
                        {
                            "body": "But Men are not on there seeking platonic relationships (in the same numbers that “Sb” are) - that is a unicorn find. They ALL want sex. And that’s not a problem because yes, sex is an essential part of a normal, functioning sugar arrangement - but so is MONEY. This idea that sex or money are not important components to sugar relationships is so false.",
                            "author": "iwishyouwo0d",
                            "id": "hruwka0",
                            "parent_id": "t1_hrut2yh",
                            "score": 3,
                            "created_utc": 1641693687.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I once had a guy offer me $4 every 2 weeks. Holy cow.",
            "author": "lilypadbaby98",
            "id": "hrvuoyk",
            "parent_id": "t3_rzcmr0",
            "score": 5,
            "created_utc": 1641710461.0,
            "replies": []
        },
        {
            "body": "Lool you shouldn’t do anything for free for a sugar dad. His responsibility is to SPOIL and i mean SPOIL. You’re not some girl he found off tinder 😂 some guys think like this because a lot of girls twist the game unfortunately…",
            "author": "Valxxamorcitaaa",
            "id": "hrvayvm",
            "parent_id": "t3_rzcmr0",
            "score": 4,
            "created_utc": 1641700040.0,
            "replies": []
        },
        {
            "body": "Yes yes yes! So much yes! I had one tell me he’s only liked by what he gives!?!? Why you are you on a sugar dating website if you don’t want to give money?",
            "author": "4loveandsugar",
            "id": "hryxg0z",
            "parent_id": "t3_rzcmr0",
            "score": 2,
            "created_utc": 1641764178.0,
            "replies": []
        },
        {
            "body": "I was thinking about getting back in the bowl but it’s changed so much because I remember when sex wasn’t even an option and scammers would go for sugar babies as away to circumvent escort pricing.\nPlatonic meant we don’t even hold hands and we’re just friends. Now y’all saying that sex is expected and scammers are trying to get it for free? \n\nI think everyone involved has started to misunderstand the concept.",
            "author": "Jazzlike-Spot430",
            "id": "hs2rm34",
            "parent_id": "t3_rzcmr0",
            "score": 2,
            "created_utc": 1641830450.0,
            "replies": []
        },
        {
            "body": "It is a combination of Daters who are not SDs and players who call themselves SDs but either scam or intimidate girls into giving it up for free.\n\n “so you’re looking for someone to be financially responsible for you?” \n\nIs a shaming technique to intimidate you. Your answer to these A- Holes to their question is \"YES\"",
            "author": "GSSD",
            "id": "hs3azwx",
            "parent_id": "t3_rzcmr0",
            "score": 2,
            "created_utc": 1641837502.0,
            "replies": []
        },
        {
            "body": "Unfortunately the bowl is not as narrow as you think. It is broad and getting broader and now many men and women come to the bowl to seek vanilla relationships. Sure the more traditional ppm and allowance based sugar world also exists and in large numbers.",
            "author": null,
            "id": "hrubr0o",
            "parent_id": "t3_rzcmr0",
            "score": 5,
            "created_utc": 1641684943.0,
            "replies": [
                {
                    "body": "Well said.",
                    "author": "63daddy",
                    "id": "hrudkja",
                    "parent_id": "t1_hrubr0o",
                    "score": 0,
                    "created_utc": 1641685695.0,
                    "replies": [
                        {
                            "body": "Thanks! The breadth of the bowl is less obvious on this forum because it still swings towards hardcore pros and escorts who are deeply threatened anytime there is mention of vanilla or dating without ppm/allowance. They ought to remember not every lady out there depends on sugar for their livelihood and not every lady is looking to be paid by the hour “for companionship”.",
                            "author": null,
                            "id": "hruro7z",
                            "parent_id": "t1_hrudkja",
                            "score": -2,
                            "created_utc": 1641691585.0,
                            "replies": [
                                {
                                    "body": "Yeah.  I’ve been in Reddit a few years but only regular less than a month.   While it’s great to communicate with others with similar interests, I find Reddit forums tend to also have their own little bubbles of perspective.   \n\nSugar relationships may be on the rise, but they are still the exception, not the rule.  Sites like Seeking have all sorts of things going on, not just the sugar dating most here seek.",
                                    "author": "63daddy",
                                    "id": "hruu9p0",
                                    "parent_id": "t1_hruro7z",
                                    "score": 1,
                                    "created_utc": 1641692697.0,
                                    "replies": []
                                },
                                {
                                    "body": "Can confirm",
                                    "author": "WorldwideLoving",
                                    "id": "hruzgkk",
                                    "parent_id": "t1_hruro7z",
                                    "score": 1,
                                    "created_utc": 1641694943.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I think there is a disconnect on ladies financial expectations vs how many available men can actually do that.",
            "author": "Feisty_Pear8536",
            "id": "hrvvnx7",
            "parent_id": "t3_rzcmr0",
            "score": 2,
            "created_utc": 1641711063.0,
            "replies": []
        },
        {
            "body": "There’s an age gap Reddit forum in which there are many examples of women dating older men in a context other than sugar dating.   You may only wish to date men older than yourself for an allowance, but there are women who date older men without a predefined allowance.   \n\nThat said, if you are talking to someone claiming to be a sugar daddy, he is being deceitful if he doesn’t want to provide an allowance, ppm, or something of value.   Sugar daddy’s by definition provide sugar, but sites such as Seeking are not just about sugaring.  People are free to seek all sorts of relationships including vanilla relationships on that site.\n\nBottom line is most people you run into will be incompatible.  Don’t dwell on them.  Focus on those who are compatible.",
            "author": "63daddy",
            "id": "hrubldi",
            "parent_id": "t3_rzcmr0",
            "score": 1,
            "created_utc": 1641684878.0,
            "replies": [
                {
                    "body": "The age gap sub is a small community. The dating over thirty sub, for example, has almost 15x more members.",
                    "author": "new_sd_acct",
                    "id": "hrugqrq",
                    "parent_id": "t1_hrubldi",
                    "score": 5,
                    "created_utc": 1641687008.0,
                    "replies": [
                        {
                            "body": "AgeGap has a little less than half the members of this sub, which actually seems relatively in the same order of magnitude as the portion of women here who say they would be interested in an age gap for something more vanilla.",
                            "author": null,
                            "id": "hrw1d2i",
                            "parent_id": "t1_hrugqrq",
                            "score": 1,
                            "created_utc": 1641714898.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "His reply doesn’t scream “doesn’t understand the concept of sugar dating”, nor does it imply he understands either. It seems like a normal response to advance the conversation. He’s basically inviting you to confirm your understanding of mutually beneficial. \n\nMoreover, with SA’s more recent advertising/website shifts, I’m not sure what anyone on SA is looking for anymore. There are plenty of women who believe that men will give money to be online “friends” with them. Just as there are plenty of escorts/prostitutes. And some women looking for richer/wealthier boyfriends. And perhaps a handful of real SBs.\n\nOn the male side, you still have plenty of johns, some guys using it for vanilla dating, ostensibly some guys who just want to be friends, and of course, a handful of real SDs.\n\nThe problem is that some modern SRs can easily fly afoul of the SESTA legislation. So no site can really bill itself as a sugar dating site anymore. Not without accepting a bunch of liability. On a federal level, no less.\n\nAll you can do is continue to search/chat. I haven’t looked for an SB in almost 2yrs now (summer 2020 was so bad I went back to vanilla, which has been keeping me too busy to bother with SA).",
            "author": "sdthrowaway006",
            "id": "hruzbz0",
            "parent_id": "t3_rzcmr0",
            "score": 1,
            "created_utc": 1641694888.0,
            "replies": []
        },
        {
            "body": "SA has dropped the whole financial component from their marketing, so I'm not surprised that more and more SDs (who aren't in SLF) think it's about paying for fancy dates and experiences and fanciness. Because now that's what SA says you're there to do.\n\nI get that in SLF we all realize there's money involved, but...how many SDs sign up on SA and think that?",
            "author": "emptyoverflow",
            "id": "hrv3cl2",
            "parent_id": "t3_rzcmr0",
            "score": 1,
            "created_utc": 1641696613.0,
            "replies": []
        },
        {
            "body": "Theres no set definition for sugar dating lol",
            "author": null,
            "id": "hrvt0to",
            "parent_id": "t3_rzcmr0",
            "score": 1,
            "created_utc": 1641709460.0,
            "replies": [
                {
                    "body": "most of these definition do a good job explaining the gist of it.\n\nhowever, [https://www.urbandictionary.com/define.php?term=sugardating](https://www.urbandictionary.com/define.php?term=sugardating) is something else.",
                    "author": "dallas-explorer",
                    "id": "hs6g6p9",
                    "parent_id": "t1_hrvt0to",
                    "score": 2,
                    "created_utc": 1641884709.0,
                    "replies": [
                        {
                            "body": "😂🤣😭☠️💀",
                            "author": null,
                            "id": "hsatttr",
                            "parent_id": "t1_hs6g6p9",
                            "score": 1,
                            "created_utc": 1641957000.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "And us men ask why there are so many women on SA that have plutonic listed.... LOL",
            "author": "vrsc1962",
            "id": "hrwzcps",
            "parent_id": "t3_rzcmr0",
            "score": 1,
            "created_utc": 1641737921.0,
            "replies": []
        },
        {
            "body": "I mean there are actually many girls out there that are genuinely attracted to older guys not just for their money.  I’ve dated older guys but I don’t expect to get paid for it.  I make my own money.",
            "author": "nystatin94",
            "id": "hrujpcw",
            "parent_id": "t3_rzcmr0",
            "score": -1,
            "created_utc": 1641688233.0,
            "replies": [
                {
                    "body": "Yes, I make my own money as well Captain Obvious. But I’m doing this to live beyond my means.",
                    "author": null,
                    "id": "hruthk5",
                    "parent_id": "t1_hrujpcw",
                    "score": 11,
                    "created_utc": 1641692364.0,
                    "replies": [
                        {
                            "body": "So why would a rich guy want to date a young attractive girl who only wants him for his money when he could date an equally young and attractive girl who wants him for him?  Less money to waste on an “allowance” and more money to spend on trips and experiences",
                            "author": "nystatin94",
                            "id": "hruvteh",
                            "parent_id": "t1_hruthk5",
                            "score": -3,
                            "created_utc": 1641693362.0,
                            "replies": [
                                {
                                    "body": "If he can find a more attractive woman who he wants to date traditionally, then he should for sure go for it. But if he’s messaging me on SA and asking if I’m looking for someone to be financially responsible for me, my response still stands.",
                                    "author": null,
                                    "id": "hrvjftd",
                                    "parent_id": "t1_hruvteh",
                                    "score": 12,
                                    "created_utc": 1641704132.0,
                                    "replies": [
                                        {
                                            "body": "have you seen Seeking's advertising over the last year?\n\nif someone comes to the site as a result of Seeking's ads, they will have no idea that it is a sugar dating site.\n\n>asking if I’m looking for someone to be financially responsible for me\n\nsounds like he was worried that you might want him to fund your entire life, not just provide some extra support.",
                                            "author": "joc13",
                                            "id": "hrvnb5v",
                                            "parent_id": "t1_hrvjftd",
                                            "score": -2,
                                            "created_utc": 1641706211.0,
                                            "replies": [
                                                {
                                                    "body": "It’s calling seeking ARRANGEMENT sir. Real sugar babies are not amused by Splenda or salt daddies.",
                                                    "author": null,
                                                    "id": "hrvo4yq",
                                                    "parent_id": "t1_hrvnb5v",
                                                    "score": 7,
                                                    "created_utc": 1641706661.0,
                                                    "replies": [
                                                        {
                                                            "body": "no, the site is just called Seeking now. the word arrangement does not appear in their advertising anywhere and given the FWB tag being replaced with Friends, I'd be surprised if the word arrangement is used anywhere on the site any more.\n\n>Real sugar babies are not amused by Splenda or salt daddies.\n\nI don't disagree with you there at all, just like Real SD™️s are not amused by women wanting to date platonically (with or without an allowance) or date with the intention of getting married. but, the advertising aimed at women just says \"upgrade your dating life\" so they have no idea what sugar dating is all about.",
                                                            "author": "joc13",
                                                            "id": "hrvpvtn",
                                                            "parent_id": "t1_hrvo4yq",
                                                            "score": 2,
                                                            "created_utc": 1641707643.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Unpopular opinion.\n\nA lot of women have no problem with hooking up or casually dating guys they feel attracted to or feel a connection. Hell, some girls even chase down guys they get the tingles for and the guy gives zero attention and makes them split the bill. So, as a guy, why not give it a try?\n\nIts all very individual - the person and situation.\n\nI think the bigger challenge is keeping an open mind - both SBs and SDs - from the get go.\n\nMany POT SBs feel it's appropriate or ok to ask for handouts after 4 texts. It's not. It's disrespectful. And the SBs assume the SDs they are talking to are disgusting and gross.\n\nJust as SBs say \"I know my worth\", I know mine as a man. \n\nFor me, I am decent looking, I stay in shape by going to the gym, I'm wildly successful compared to 99% of my peers, I can hold a conversation, I can ensure a great and safe night out. I'm a catch and I have that power - I refuse to \"take advantage\" of it.  If I say I will deliver $X allowance, I do. It's an absolute pleasure to share what I have with an SB that enjoys and appreciates my time.\n\nThe challenge is many SBs feel they are entitled to my money just because they think they are hot.\n\nI deliver by being successful beyond what 99% of men or women can ever imagine, by being authentic and by delivering on my promises (both SRs and business) and I don't try to power play that against SBs.",
            "author": "archhatter",
            "id": "hrve6ur",
            "parent_id": "t3_rzcmr0",
            "score": -1,
            "created_utc": 1641701531.0,
            "replies": [
                {
                    "body": "If you think it’s okay to shoot your shot for a traditional relationship on a sugar dating website, then why don’t you just make a tinder or bumble? Show them that you “know your worth”\n\nPotential sugar babies that expect handouts without having anything to offer, shouldn’t be active on these sites either. They’re a detriment to those who are reliable and reasonable.",
                    "author": null,
                    "id": "hrvmahj",
                    "parent_id": "t1_hrve6ur",
                    "score": 8,
                    "created_utc": 1641705653.0,
                    "replies": [
                        {
                            "body": "SA is a lot better because theres far less men in proportion to women than on tinder or bumble. Its also not predominantly swipe based, which tends to make tinder/bumble mostly looked based. A lot of women swipe left on most profiles after a millisecond based solely on looks. Another thing is on tinder/bumble a lot of women set their upper range age much lower. All these combined, pragmatically make it a good choice for men whether they are looking to be an SD or not to use SA. \n\nPersonally im open to being an SD for the right girl, but ive had vanilla a handful of times from seeking as well. \n\nYeah I know its annoying to a lot of sbs for non sds to be on SA, but trust me the guys have a shit ton of annoyances on there as well with all the platonics, pic sellers etc. Just vet and move on.",
                            "author": "Yo_Mamas_azz",
                            "id": "hrx11hq",
                            "parent_id": "t1_hrvmahj",
                            "score": 1,
                            "created_utc": 1641738735.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Not all do",
            "author": null,
            "id": "hrvbir4",
            "parent_id": "t3_rzcmr0",
            "score": 0,
            "created_utc": 1641700293.0,
            "replies": []
        },
        {
            "body": "So he was just confirming what you were looking for.\n\nDon't see the issue?",
            "author": "Buckeyechamp21",
            "id": "hrxw3hj",
            "parent_id": "t3_rzcmr0",
            "score": 0,
            "created_utc": 1641750976.0,
            "replies": [
                {
                    "body": "Sir, I did not tell him I wanted him to be financially responsible for me. I am financially responsible for myself. People like this try to shame SB’s who look for compensation for their time and intimacy, and that is NOT okay. If he says he wants something mutually beneficial, should my response be, “So you’re looking for someone to be responsible for getting you off?”? I blocked him.",
                    "author": null,
                    "id": "hrxxtx6",
                    "parent_id": "t1_hrxw3hj",
                    "score": 2,
                    "created_utc": 1641751613.0,
                    "replies": [
                        {
                            "body": "You did the right thing. No need to be defensive.",
                            "author": "dallas-explorer",
                            "id": "hs6gfkz",
                            "parent_id": "t1_hrxxtx6",
                            "score": 1,
                            "created_utc": 1641884877.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "What is SA?",
            "author": "Joelmoneyman",
            "id": "hrwugmt",
            "parent_id": "t3_rzcmr0",
            "score": 1,
            "created_utc": 1641735453.0,
            "replies": [
                {
                    "body": "Seeking.com  \n\nFormally called Seeking Arrangement",
                    "author": null,
                    "id": "hrwxk9u",
                    "parent_id": "t1_hrwugmt",
                    "score": 2,
                    "created_utc": 1641737031.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "100%! I had a man who told me he wouldn’t consider an arrangement until I had sex with him. Then called me a prostitute when I said no. \n\nIt scared me off of finding a SD for a good year.",
            "author": "madlyintrigued",
            "id": "hryqld1",
            "parent_id": "t1_hrvy72s",
            "score": 6,
            "created_utc": 1641761723.0,
            "replies": []
        },
        {
            "body": "Yes!",
            "author": "Bbygirlxxxx",
            "id": "hryknfg",
            "parent_id": "t1_hrvy72s",
            "score": 1,
            "created_utc": 1641759646.0,
            "replies": []
        },
        {
            "body": "No no no! That’s called “boyfriend”\n\nThis is only even discussed due to the current state of “vanilla” dating in which people think it’s ok to be selfish. Every relationship should be mutually beneficial. I’ve always with very rare exceptions paid for dinner, and never 50/50 unless it was a clear platonic/aromantic situation and the 50/50 was to emphasize that. Mutual orgasms are a “good relationship”",
            "author": "daddoms",
            "id": "hrx3snj",
            "parent_id": "t1_hrvb96c",
            "score": 14,
            "created_utc": 1641740002.0,
            "replies": []
        },
        {
            "body": "This 😂 \"IMm NOt COmfortAbLe GIving MOnenY AnNd BEINg TRANSAcTIonAl\" 😑 \nWell im not comfortable having you just pay for dinner and expect sex b",
            "author": "sundriedflowers",
            "id": "hrytsop",
            "parent_id": "t1_hrvb96c",
            "score": 11,
            "created_utc": 1641762859.0,
            "replies": []
        },
        {
            "body": "Peridot",
            "author": "RealisticPossession0",
            "id": "hrxiel0",
            "parent_id": "t1_hrvb96c",
            "score": 4,
            "created_utc": 1641745844.0,
            "replies": []
        },
        {
            "body": "Unfortunately, YES.",
            "author": null,
            "id": "hrvokm1",
            "parent_id": "t1_hrv0t7i",
            "score": 5,
            "created_utc": 1641706903.0,
            "replies": []
        },
        {
            "body": "I’m sorry raisins and dried sausage TOOK ME OUT.",
            "author": "No-Letterhead5328",
            "id": "hrxw92e",
            "parent_id": "t1_hrv0t7i",
            "score": 2,
            "created_utc": 1641751034.0,
            "replies": []
        },
        {
            "body": "Why do you say ‘fall for that’? some girls on seeking aren’t even looking for finances. A minority for sure, but not unusual.",
            "author": null,
            "id": "hrx3ala",
            "parent_id": "t1_hrucg0d",
            "score": -6,
            "created_utc": 1641739777.0,
            "replies": [
                {
                    "body": "I say that because it is true. Based on what I have seen locally in market talking to pot and sb's. And the countless stories in this sub by women who did \"fall for that\".  \n\n\nTo your second sentence. I operate on the rule and not the exception. There are women not looking for finances. They are the exception. And I'm not going operate like they are the rule just to make a point.",
                    "author": "southernslick",
                    "id": "hrx4tfi",
                    "parent_id": "t1_hrx3ala",
                    "score": 9,
                    "created_utc": 1641740453.0,
                    "replies": [
                        {
                            "body": "The stories on this sub do not represent what’s happening in the real world. 90% + of users on seeking don’t bother coming here to complain about things. Those that find what they want just don’t bother coming onto Reddit! Guys complain about the platonic girls. They exist. I’ve talked to them. I move on quick but don’t come on here to complain.",
                            "author": null,
                            "id": "hrxcol4",
                            "parent_id": "t1_hrx4tfi",
                            "score": -2,
                            "created_utc": 1641743656.0,
                            "replies": [
                                {
                                    "body": "I also mentioned what I've seen locally in my area talking to pot and sugarbabies who have no idea this sub exists. Their stories mirror what I read in here in spite of the fact these ladies I've spoken to don't come here.   \n\n\nSo we both have our experiences offline in the real world. Let's leave it at that.",
                                    "author": "southernslick",
                                    "id": "hrxd77s",
                                    "parent_id": "t1_hrxcol4",
                                    "score": 7,
                                    "created_utc": 1641743852.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "This is true. \n\nI had a very pretty woman of 24 (I'm 40), message me first, saying she was interested in meeting higher quality men than frat boys her age, and she wanted to experience some \"luxury\", i.e., nice dinners, etc.\n\nShe didn't want money, just better experiences.",
                    "author": null,
                    "id": "hrxq65o",
                    "parent_id": "t1_hrx3ala",
                    "score": 1,
                    "created_utc": 1641748791.0,
                    "replies": [
                        {
                            "body": "So it certainly happens to others then! I guess you’re in shape and treat girls well and  probably intelligent and successful though? So I was 49 and dated a cute 23 year old student who just wanted nice dinners etc. So it happens. Not popular to say it. My comment is being downvoted …. Whatever🙄",
                            "author": null,
                            "id": "hry5btl",
                            "parent_id": "t1_hrxq65o",
                            "score": -3,
                            "created_utc": 1641754256.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Your 2nd quote is my favorite. I call it money for nothing, same with the picture sellers.",
            "author": "Hungboy6969420",
            "id": "huvjxkc",
            "parent_id": "t1_hrwty9j",
            "score": 1,
            "created_utc": 1643563991.0,
            "replies": []
        },
        {
            "body": "But why wouldn’t they get tired of people always having to set them straight? If I was an “SB” looking for platonic only, I’d only exhaust myself trying to find something, and just give up.",
            "author": null,
            "id": "hruan9h",
            "parent_id": "t1_hru71ck",
            "score": 15,
            "created_utc": 1641684486.0,
            "replies": [
                {
                    "body": "Please don't let these men bully you into thinking this is the norm and what you should do. don't lower your standards or what you expect. You came into sugar dating for financial reasons and you should stick to it. There's nothing wrong with wanting financial  help and there isn't anything wrong with getting financial help and there isn't anything wrong with not wanting any",
                    "author": "glamour_doll",
                    "id": "hrudlvu",
                    "parent_id": "t1_hruan9h",
                    "score": 38,
                    "created_utc": 1641685710.0,
                    "replies": [
                        {
                            "body": "Yes that’s what sugar dating is about the money part and it’s crazy that there are men who insert themselves into sugar dating to shame women who want money(these are the narcissist fake SD).\n\nMost of these guys are narcissists or have nothing to offer but money, so they use money to attract women because they know no decent woman wants them. So they come onto sugar dating instead of using common sense and going on bumble/tinder and add a bio, where you can brag about money since you have no qualities \n\nThere are girls out there who just want rich boyfriends so they probably come there, but even with wanting rich boyfriends, money is a big part",
                            "author": "Specific-Fondant-525",
                            "id": "hrueebo",
                            "parent_id": "t1_hrudlvu",
                            "score": 14,
                            "created_utc": 1641686037.0,
                            "replies": [
                                {
                                    "body": "agreed 🙌",
                                    "author": "glamour_doll",
                                    "id": "hruenb5",
                                    "parent_id": "t1_hrueebo",
                                    "score": 6,
                                    "created_utc": 1641686139.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "I don’t think you realize how many girls are on seeking that are looking for, or open to something vanilla without an allowance. Whether or not you want to admit it, there are girls on seeking that are looking for this, and that is why there are guys on seeking looking for sex or vanilla with no allowance.\n\nIn November alone I went out with 5-6 girls from seeking that just wanted a rich boyfriend, no allowance or ppm required.",
                    "author": null,
                    "id": "hruayqk",
                    "parent_id": "t1_hruan9h",
                    "score": -3,
                    "created_utc": 1641684617.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "hrw8djs",
                            "parent_id": "t1_hruayqk",
                            "score": 7,
                            "created_utc": 1641720048.0,
                            "replies": [
                                {
                                    "body": "Because on Hinge and Bumble there is no way to filter by wealth or income.\n\nAt least on SD it's safe to assume at least some of the guys there are wealthy and the ones that are are there even though they presume they'll have to pay.\n\nI have had at least 10 girls in the past year alone tell me they use Seeking to meet rich guys, not necessarily to sugar",
                                    "author": "gangsta_baby",
                                    "id": "hrwrx8h",
                                    "parent_id": "t1_hrw8djs",
                                    "score": 4,
                                    "created_utc": 1641734036.0,
                                    "replies": [
                                        {
                                            "body": "Honestly it’s funny because even with the income listed on most SD profiles their level of wealth doesn’t mean they’re generous or would be willing to do luxurious things.",
                                            "author": "No-Letterhead5328",
                                            "id": "hrxzep5",
                                            "parent_id": "t1_hrwrx8h",
                                            "score": 4,
                                            "created_utc": 1641752185.0,
                                            "replies": [
                                                {
                                                    "body": "We know.\n\nBut that is irrelevant to why women go to the site to find rich guys. The probability is just higher there than on regular dating sites to find a 'richer' guy than most.\n\nOn regular dating sites there is literally no way to determine that, or filter for wealth. Also putting 'I only want a wealthy man' on a regular dating site isn't really going to make you any friends. It'll turn off the 'regulars' and the rich guys among them will probably see it as a red flag.\n\nSo the other reason is that they can be explicit about what they want (even if they have to wade through a bunch of bullshit and scammers to get it)",
                                                    "author": "gangsta_baby",
                                                    "id": "hrypxb4",
                                                    "parent_id": "t1_hrxzep5",
                                                    "score": 0,
                                                    "created_utc": 1641761493.0,
                                                    "replies": [
                                                        {
                                                            "body": "I was agreeing with you lol. I was just pointing out that it’s not always what it seems for some people and adding onto what you said.",
                                                            "author": "No-Letterhead5328",
                                                            "id": "hs3enpr",
                                                            "parent_id": "t1_hrypxb4",
                                                            "score": 2,
                                                            "created_utc": 1641838830.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "I don’t know, why don’t you ask them why they’re on seeking. But I can only guess because there’s more millionaires on seeking than any other dating site :)\n\nAlso, don’t you think most of these girls are also on hinge or bumble? I can’t tell you how many seeking girls I also see on the vanilla dating apps.",
                                    "author": null,
                                    "id": "hrxeamg",
                                    "parent_id": "t1_hrw8djs",
                                    "score": 1,
                                    "created_utc": 1641744270.0,
                                    "replies": []
                                },
                                {
                                    "body": "\\>Why won’t these girls just go on hinge or bumble then?\n\nThat's inefficient, the whole point of SAS is that these guys are paying for a membership and that works as a filter.\n\nThere's no broke bros in SA as you need at least $100 to play but mountains of those guys are all over hinge/tinder/bumble.",
                                    "author": "No-Hat5902",
                                    "id": "hryt6u3",
                                    "parent_id": "t1_hrw8djs",
                                    "score": 0,
                                    "created_utc": 1641762638.0,
                                    "replies": []
                                },
                                {
                                    "body": "It’s not BS by the way. At least not in Europe…",
                                    "author": null,
                                    "id": "hrx2tii",
                                    "parent_id": "t1_hrw8djs",
                                    "score": 1,
                                    "created_utc": 1641739562.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Soo what happened with those 5-6 girls?",
                            "author": "D2boujee",
                            "id": "hrukacl",
                            "parent_id": "t1_hruayqk",
                            "score": 6,
                            "created_utc": 1641688477.0,
                            "replies": [
                                {
                                    "body": "I still talk and casually see 3 of them. The other 3 it didn’t work out with or I decided not to see them again.",
                                    "author": null,
                                    "id": "hrul6ll",
                                    "parent_id": "t1_hrukacl",
                                    "score": -3,
                                    "created_utc": 1641688855.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Everyone’s different. I once had a SB that just wanted to go to the mall and watch me swipe plastic. Never asked for a penny.",
                            "author": "YakiMe",
                            "id": "hrv0t55",
                            "parent_id": "t1_hruayqk",
                            "score": 1,
                            "created_utc": 1641695523.0,
                            "replies": []
                        },
                        {
                            "body": "The pro SBs really don’t like hearing this. They want to protect the idea that girls on seeking should be acting according to their laws of sugaring. If they keep sleeping with guys for free it undermines their position. But not all girls on seeking are sugar babes. Many of us know that. Some girls want to sleep with guys twice the age without finances. I know that. Sorry. Downvotes expected….",
                            "author": null,
                            "id": "hrx2i71",
                            "parent_id": "t1_hruayqk",
                            "score": -2,
                            "created_utc": 1641739420.0,
                            "replies": [
                                {
                                    "body": "You’re deluding yourself sir",
                                    "author": "Bbygirlxxxx",
                                    "id": "hrykypl",
                                    "parent_id": "t1_hrx2i71",
                                    "score": 4,
                                    "created_utc": 1641759756.0,
                                    "replies": [
                                        {
                                            "body": "I’m just sharing my experience. Sorry.",
                                            "author": null,
                                            "id": "hs1b3fx",
                                            "parent_id": "t1_hrykypl",
                                            "score": 0,
                                            "created_utc": 1641800482.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "Oh yea I already expect downvotes whenever I say this lol.",
                                    "author": null,
                                    "id": "hrxe0oy",
                                    "parent_id": "t1_hrx2i71",
                                    "score": 3,
                                    "created_utc": 1641744162.0,
                                    "replies": []
                                },
                                {
                                    "body": "So true. Same with men who hate the guys paying for platonic dates, pics, online relationships etc. It ruins the balance",
                                    "author": "Hungboy6969420",
                                    "id": "huvki7y",
                                    "parent_id": "t1_hrx2i71",
                                    "score": 1,
                                    "created_utc": 1643564208.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "High five lol",
                            "author": "wb19081908",
                            "id": "hrw651a",
                            "parent_id": "t1_hruayqk",
                            "score": -1,
                            "created_utc": 1641718372.0,
                            "replies": []
                        },
                        {
                            "body": "Good to know. I might fire up SA sooner if I’m not happy with my vanilla activity. The only thing is my local vanilla aged women aren’t really girlfriend material. I just did a quick search for 26~33 (my normal vanilla match age), and I’m seeing a lot of fat women or single mothers. Could be a seasonal thing though, since I’m seeing a lot of that when I’ve been swiping mindlessly on tinder too.",
                            "author": "sdthrowaway006",
                            "id": "hrv00cu",
                            "parent_id": "t1_hruayqk",
                            "score": -7,
                            "created_utc": 1641695178.0,
                            "replies": [
                                {
                                    "body": "Swipe app algorithms show you more of what you swipe right on.",
                                    "author": null,
                                    "id": "hrxqqoo",
                                    "parent_id": "t1_hrv00cu",
                                    "score": 2,
                                    "created_utc": 1641749001.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Agreed. \n\nThere's a percentage of women that just don't want to date men they perceive to be broke, losers, etc.",
                            "author": null,
                            "id": "hrxqjm9",
                            "parent_id": "t1_hruayqk",
                            "score": 1,
                            "created_utc": 1641748929.0,
                            "replies": []
                        },
                        {
                            "body": "Yep it's rich boyfriend finder. It's relatively common",
                            "author": "Hungboy6969420",
                            "id": "huvk3sf",
                            "parent_id": "t1_hruayqk",
                            "score": 1,
                            "created_utc": 1643564058.0,
                            "replies": [
                                {
                                    "body": "100%",
                                    "author": null,
                                    "id": "huvk8be",
                                    "parent_id": "t1_huvk3sf",
                                    "score": 1,
                                    "created_utc": 1643564105.0,
                                    "replies": [
                                        {
                                            "body": "I met a woman recently off there who claimed to have been in multiple long term relationships with daddies without ever actually taking allowance/ppm. She just wanted to be around rich dudes who spoiled her and she could learn from. Pretty smart imo",
                                            "author": "Hungboy6969420",
                                            "id": "huvkefr",
                                            "parent_id": "t1_huvk8be",
                                            "score": 1,
                                            "created_utc": 1643564168.0,
                                            "replies": [
                                                {
                                                    "body": "Im going out with a pretty latina today who told me she doesn’t want any money from me, she just wants to date a more established man. She said she was tired of all the tinder fuck boys just looking for sex.",
                                                    "author": null,
                                                    "id": "huvkzp6",
                                                    "parent_id": "t1_huvkefr",
                                                    "score": 1,
                                                    "created_utc": 1643564395.0,
                                                    "replies": [
                                                        {
                                                            "body": "Ha that's almost exactly what this woman said too. \"I could hook up with a frat bro but that gets old, why not get something else outta having sex?\"",
                                                            "author": "Hungboy6969420",
                                                            "id": "huvl4bb",
                                                            "parent_id": "t1_huvkzp6",
                                                            "score": 1,
                                                            "created_utc": 1643564442.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Yep! I have a date next week with another young woman from SA, who said she likes older men and is looking for a relationship and no money. Works for me lol!",
                                                                    "author": null,
                                                                    "id": "huvm590",
                                                                    "parent_id": "t1_huvl4bb",
                                                                    "score": 1,
                                                                    "created_utc": 1643564835.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "This.",
            "author": "oso8daddy",
            "id": "hru92pk",
            "parent_id": "t1_hru71ck",
            "score": 0,
            "created_utc": 1641683839.0,
            "replies": []
        },
        {
            "body": "Love your concise answer.  😃",
            "author": "HappyBear1952",
            "id": "hrulwuo",
            "parent_id": "t1_hru71ck",
            "score": -1,
            "created_utc": 1641689163.0,
            "replies": [
                {
                    "body": "Straight to the point lol.",
                    "author": null,
                    "id": "hrulzhu",
                    "parent_id": "t1_hrulwuo",
                    "score": 0,
                    "created_utc": 1641689195.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "It's push back for the \"Can't meet due to Covid\" , pay my bills group. Every action has an equal & opposite reaction",
            "author": "Smitt727",
            "id": "hrv5qtx",
            "parent_id": "t1_hru71ck",
            "score": -1,
            "created_utc": 1641697683.0,
            "replies": []
        },
        {
            "body": "First: I share the frustration you’re expressing.\n-BUT-\nLike the rest of societies’ norms, even the bowl is devolving.  Our only choices as “legacy” sugarers is to either adapt or branch out and find or create a new foothold for the way things used to be.  \n\nI’m on my 5th Platonic date with my latest POT.  I am thunderstruck and enamored, she is just amazing.  On our first date, she made it clear that she doesn’t ever want to feel like a hooker, and used that phrase.  Second date, she offers to split the check! This was after we had a convo about me providing an allowance! Third date we talked about medical history (she has a lifetime condition that requires consideration), STDs and getting tested, which we are doing already, plus great street tacos with green sauce!  4th date is a nice dinner with margaritas, some light touch and an agreement that we are gonna do this.  5th date tonight, I only had a sitter for 2 hours, so we meet for drinks in the bar of a 5-star resort mainly because they offer quiet corners.  Good lord, we cant stop talking and being excited!  I’m out of time, we’ve already planned an excursion in three weeks to go on a BBQ run for 3 days, with a break in the middle for Spa time.\n\nOther than a few kisses and some heavy flirting, we have not gone physical yet, but nor has any sugar($) been exchanged.  Yet we are both having a great time.\n\nOvernight at my home planned for later this week.  She’s going to cook us dinner, then we are gonna watch North By NorthWest.  Good googly-moogly, the bowl can be soooo good!",
            "author": "txjerome",
            "id": "hrvn4at",
            "parent_id": "t1_hruuoxu",
            "score": 3,
            "created_utc": 1641706106.0,
            "replies": [
                {
                    "body": "Are you sure you're not impotent",
                    "author": null,
                    "id": "hrxre8i",
                    "parent_id": "t1_hrvn4at",
                    "score": 1,
                    "created_utc": 1641749240.0,
                    "replies": [
                        {
                            "body": "Yup, no worries there, fortunately…",
                            "author": "txjerome",
                            "id": "hrxrz55",
                            "parent_id": "t1_hrxre8i",
                            "score": 2,
                            "created_utc": 1641749456.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "That’s me! I love rich older men and all I expect from them is to pay for our dates :)",
            "author": "nystatin94",
            "id": "hruw3k1",
            "parent_id": "t1_hruuoxu",
            "score": -4,
            "created_utc": 1641693486.0,
            "replies": [
                {
                    "body": "Uh, congratulations???\n\nThen you’re exactly who I’m talking about when I say “men and women fucking up the bowl”",
                    "author": "iwishyouwo0d",
                    "id": "hrux8km",
                    "parent_id": "t1_hruw3k1",
                    "score": 16,
                    "created_utc": 1641693979.0,
                    "replies": [
                        {
                            "body": "She sounds like a WHOLE Pick me. Offering to split a check? cooking a man dinner? ... in the bowl?  \n\nLet me go over here and pray because I do not need to hear this level desperation on the Lord’s Day",
                            "author": "TX_SB",
                            "id": "hryoss9",
                            "parent_id": "t1_hrux8km",
                            "score": 5,
                            "created_utc": 1641761101.0,
                            "replies": []
                        },
                        {
                            "body": "LMAO. She’s excited about getting a free dinner after fucking? 😢",
                            "author": null,
                            "id": "hrvob8a",
                            "parent_id": "t1_hrux8km",
                            "score": 9,
                            "created_utc": 1641706757.0,
                            "replies": [
                                {
                                    "body": "Don’t forget about the free drinks!!! Dems expensive 🥂",
                                    "author": "iwishyouwo0d",
                                    "id": "hrvojfx",
                                    "parent_id": "t1_hrvob8a",
                                    "score": 6,
                                    "created_utc": 1641706885.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "[removed]",
                            "author": null,
                            "id": "hruydgt",
                            "parent_id": "t1_hrux8km",
                            "score": 1,
                            "created_utc": 1641694471.0,
                            "replies": [
                                {
                                    "body": "So you’re saying sugar babies that require an allowance are prostitutes? Got it.",
                                    "author": "iwishyouwo0d",
                                    "id": "hrv2h84",
                                    "parent_id": "t1_hruydgt",
                                    "score": 8,
                                    "created_utc": 1641696237.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "[removed]",
                            "author": null,
                            "id": "hrvlrtd",
                            "parent_id": "t1_hrux8km",
                            "score": -1,
                            "created_utc": 1641705373.0,
                            "replies": [
                                {
                                    "body": "The girls that get it, get it. The ones that don’t, don’t.",
                                    "author": "iwishyouwo0d",
                                    "id": "hrvz0j3",
                                    "parent_id": "t1_hrvlrtd",
                                    "score": 7,
                                    "created_utc": 1641713277.0,
                                    "replies": [
                                        {
                                            "body": "Not everyone has to think like you. To each their own.",
                                            "author": "dtan777",
                                            "id": "hrxl4ru",
                                            "parent_id": "t1_hrvz0j3",
                                            "score": 0,
                                            "created_utc": 1641746885.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "She should be looking for Vanilla relationships since what she wants wouldn’t be considered sugar.",
                                    "author": "lenaanabelle",
                                    "id": "hrwi82y",
                                    "parent_id": "t1_hrvlrtd",
                                    "score": 6,
                                    "created_utc": 1641727696.0,
                                    "replies": [
                                        {
                                            "body": "Yeah but how do you get to determine who belongs to SA or not. Everyone has the right to use it in whichever way they want. There are all kinds of mutually beneficial relationships, not just transactional ones.",
                                            "author": "dtan777",
                                            "id": "hrxl2b9",
                                            "parent_id": "t1_hrwi82y",
                                            "score": 0,
                                            "created_utc": 1641746859.0,
                                            "replies": [
                                                {
                                                    "body": "Seeking is not a vanilla dating site.",
                                                    "author": "lenaanabelle",
                                                    "id": "hs8pim3",
                                                    "parent_id": "t1_hrxl2b9",
                                                    "score": 1,
                                                    "created_utc": 1641926790.0,
                                                    "replies": [
                                                        {
                                                            "body": "Mutually beneficial does not equal transactional. Maybe you’re the one who doesn’t belong on sugar dating sites.",
                                                            "author": "dtan777",
                                                            "id": "hs9omrg",
                                                            "parent_id": "t1_hs8pim3",
                                                            "score": 1,
                                                            "created_utc": 1641939698.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "body": "No mutually beneficial doesn’t mean transactional, but the purpose of being in a mutually beneficial arrangement is because it’s not traditional.\n\nA guy buying you dinner is literally the bare minimum in traditional dating. Nothing wrong with it, but you can easily find that anywhere.",
                                            "author": "lenaanabelle",
                                            "id": "httwsqw",
                                            "parent_id": "t1_hrwi82y",
                                            "score": 1,
                                            "created_utc": 1642906867.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "This also is true in the flip side. \nJust this week a woman was here asking about a financial arrangement with no physical intimacy.  \nNo one will like a one sided long term arrangement.   On both sides we just need to quickly screen the naive and get to a great, mutually beneficial relationship",
            "author": "DrZenRoot",
            "id": "hrus3hr",
            "parent_id": "t1_hrugaa0",
            "score": 4,
            "created_utc": 1641691765.0,
            "replies": [
                {
                    "body": "Just saying that does happen but is extremely rare, I got really lucky once (on tinder not SA actually) and had a purely textual relationship with a SD. Made a couple hundred bucks in about two months before school got in the way, but it wasn't bad for being a busy college kid and just sexting",
                    "author": "space-zebras",
                    "id": "hrvv07o",
                    "parent_id": "t1_hrus3hr",
                    "score": 0,
                    "created_utc": 1641710654.0,
                    "replies": []
                },
                {
                    "body": "Yup. Well said.",
                    "author": "new_sd_acct",
                    "id": "hruu1a9",
                    "parent_id": "t1_hrus3hr",
                    "score": 0,
                    "created_utc": 1641692598.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "i have been seeing a lot on here about how even 30-45 year olds are just cheap and try to take advantage of you and as a result I have changed my search and looking for criteria to 45 + xD",
            "author": "panda_person666",
            "id": "hrvhnzo",
            "parent_id": "t1_hruhmwo",
            "score": 12,
            "created_utc": 1641703222.0,
            "replies": [
                {
                    "body": "Why are they taking advantage? If they are up front about not offering to pay and they’re good looking enough to date vanilla, even though they’re using seeking, then what’s the issue. You just need to move on and find those that want to pay you. Just as SDs need to find those who aren’t just platonic or online only. It’s a filtering process that’s all. Seeking now has many kinds of people on both sides. No rules here, just keep looking til you find a match.",
                    "author": null,
                    "id": "hrx3svt",
                    "parent_id": "t1_hrvhnzo",
                    "score": 3,
                    "created_utc": 1641740004.0,
                    "replies": [
                        {
                            "body": "you confuse me or aren't a real SD.... What is all this bull about looking good enough to vanilla date?? If you lowball offer because of this you are a fake SD trying to take advantage of SBs end of story. If you want, look at my most recent post for SLF. I am demisexual. I am not attracted to people like that. If you look hot by societal standards I don't care it doesn't make me like you so your point is useless for me. Anyone looks good enough to vanilla date.\n\nI am aware of all this, but thx I guess.",
                            "author": "panda_person666",
                            "id": "hs03abd",
                            "parent_id": "t1_hrx3svt",
                            "score": 3,
                            "created_utc": 1641779959.0,
                            "replies": [
                                {
                                    "body": "I don't think you appreciate that on seeking (here in Europe at least) there are women who are not 'traditional SBs' looking for allowances...some just want a bit of pampering or to meet a stable intelligent (preferably good looking, or at least not fat and ugly) guy that may be alot older than them without ppms or allowances. I've met trad SBs AND these girls, they both exist. It's a wide world out there.",
                                    "author": null,
                                    "id": "hs1muse",
                                    "parent_id": "t1_hs03abd",
                                    "score": 0,
                                    "created_utc": 1641809083.0,
                                    "replies": [
                                        {
                                            "body": "why should I appreciate that?? European or not?",
                                            "author": "panda_person666",
                                            "id": "hs3owr3",
                                            "parent_id": "t1_hs1muse",
                                            "score": 2,
                                            "created_utc": 1641842535.0,
                                            "replies": [
                                                {
                                                    "body": "Appreciate as in ‘understand’. Anyway It’s just how it is over here. FYI.",
                                                    "author": null,
                                                    "id": "hs3tvur",
                                                    "parent_id": "t1_hs3owr3",
                                                    "score": 1,
                                                    "created_utc": 1641844359.0,
                                                    "replies": [
                                                        {
                                                            "body": "then \"appreciate\" that isn't really how it is over here xD",
                                                            "author": "panda_person666",
                                                            "id": "hs4npfc",
                                                            "parent_id": "t1_hs3tvur",
                                                            "score": 1,
                                                            "created_utc": 1641855519.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Same here, i dont bother with those youngins.",
                    "author": "LaIndiaDeAzucar",
                    "id": "hrw1rst",
                    "parent_id": "t1_hrvhnzo",
                    "score": 2,
                    "created_utc": 1641715189.0,
                    "replies": []
                },
                {
                    "body": "It always depends. I'm in that age range and I always pay very well. However, I have zero tolerance for girls who want to be paid without sex. If that's what you're looking for then, yes, stick to the fossils",
                    "author": "gangsta_baby",
                    "id": "hrwsai5",
                    "parent_id": "t1_hrvhnzo",
                    "score": 0,
                    "created_utc": 1641734246.0,
                    "replies": [
                        {
                            "body": "that is not what I am looking for and never implied that is what I am looking for?\n\nyea makes sense. the same way I don't want to be kissed or touched when you only bought me dinner.",
                            "author": "panda_person666",
                            "id": "hs02gbc",
                            "parent_id": "t1_hrwsai5",
                            "score": 1,
                            "created_utc": 1641779623.0,
                            "replies": [
                                {
                                    "body": "> yea makes sense. the same way I don't want to be kissed or touched when you only bought me dinner.\n\nI’m not talking about buying dinner. I’m talking about in a sugar relationship both sides need to be clear about their intentions. Too many aspiring SBs, not necessarily you, aren’t. And because they can’t be clear, honest and reliable, they just don’t get what they want.\n\nIt’s no different than an SD not being reliable and consistent for her.\n\nIf your sugar dates only boil down to dinners, you may be doing it wrong.",
                                    "author": "gangsta_baby",
                                    "id": "hs0rgw2",
                                    "parent_id": "t1_hs02gbc",
                                    "score": 0,
                                    "created_utc": 1641790053.0,
                                    "replies": [
                                        {
                                            "body": "bruh. I know YOU aren't. I was making a comparison. You said you have 0 tolerance for girls who want money for platonic dates or no sex. I am saying I understand. it's like how I have zero tolerance for someone who wants to do stuff like foreplay on the first date but not give me anything in return really. Yea... I know many aren't why exactly are you telling me this? I am so lost as to what your point even is. Why are you even bringing any of this up. I never asked and it's not even related to what I commented about. All I said was that I have moved my age range up since most under 45 try to pull being cheap. not all but most. \n\nI'm not doing anything wrong?? I am talking about the M & G. Literally what are you talking about and why even??",
                                            "author": "panda_person666",
                                            "id": "hs10qe3",
                                            "parent_id": "t1_hs0rgw2",
                                            "score": 2,
                                            "created_utc": 1641794263.0,
                                            "replies": [
                                                {
                                                    "body": "I’m not a Bruh I’m a Bro! j/k",
                                                    "author": "gangsta_baby",
                                                    "id": "hs14iin",
                                                    "parent_id": "t1_hs10qe3",
                                                    "score": 1,
                                                    "created_utc": 1641796400.0,
                                                    "replies": [
                                                        {
                                                            "body": "nice not responding to my calling ya out",
                                                            "author": "panda_person666",
                                                            "id": "hs3m60h",
                                                            "parent_id": "t1_hs14iin",
                                                            "score": 2,
                                                            "created_utc": 1641841542.0,
                                                            "replies": [
                                                                {
                                                                    "body": "What am I responding to you made a great point so I stopped. :-)",
                                                                    "author": "gangsta_baby",
                                                                    "id": "hs3ocu1",
                                                                    "parent_id": "t1_hs3m60h",
                                                                    "score": 1,
                                                                    "created_utc": 1641842336.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "This right here!!!",
            "author": "iwishyouwo0d",
            "id": "hruvyvu",
            "parent_id": "t1_hruhmwo",
            "score": 4,
            "created_utc": 1641693430.0,
            "replies": []
        },
        {
            "body": "Well said.",
            "author": null,
            "id": "hruka86",
            "parent_id": "t1_hruhmwo",
            "score": 2,
            "created_utc": 1641688475.0,
            "replies": []
        },
        {
            "body": "\\>your only option is to hire a matchmaker\n\nLol, matchmakers working with rich guys only choose very attractive and smart women. The average college girl wouldn't make the cut.",
            "author": "No-Hat5902",
            "id": "hrytuuk",
            "parent_id": "t1_hrv6d55",
            "score": 1,
            "created_utc": 1641762882.0,
            "replies": [
                {
                    "body": "Not true, because those 2 things are far from mutually exclusive.\n\nA woman's peak sexual market value is age 23, so there is a vast overlap between even the \"average\" college girl, and what many rich guys will choose.",
                    "author": "Nomad_Bill",
                    "id": "hrzh7js",
                    "parent_id": "t1_hrytuuk",
                    "score": 1,
                    "created_utc": 1641771378.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Period! If we’re not aligned from the get go then there is no need for us to keep pointlessly having small talk, just to never meet. \n\nThere is a financial component to these relationships (true sugar daddy sugar baby) that is the reality of it… and that figure It either works for both people or it doesn’t. But if it doesn’t, move on. It it does, meet and see if you guys get on well. I don’t have time that I’m open to wasting.",
            "author": "iwishyouwo0d",
            "id": "hruzexd",
            "parent_id": "t1_hruxyj6",
            "score": 3,
            "created_utc": 1641694923.0,
            "replies": [
                {
                    "body": "Listen its drives me insane 😂 I put I’m seeking a traditional SD so don’t even ask to view my photos! \n\nI’m even the same with vanilla dating. If you’re not taking me out more. And surprising me I don’t want you 🥴. SD get more of a pass on not being attentive bc it’s NSA…",
                    "author": "Woahyeah1",
                    "id": "hrv0qy8",
                    "parent_id": "t1_hruzexd",
                    "score": 5,
                    "created_utc": 1641695497.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I agree, the sexual relationship is not essential to a SR, and this does benefit a lot of SB’s and SD’s who seek something more platonic, and that is their prerogative. I personally don’t seek out platonic only relations, and am not looking to invest emotionally in someone, which is why I wouldn’t expect to be paid for that. I will not be fighting with any other SB’s because they choose to keep things platonic, nor will I bash SD’s who find that type of arrangement beneficial to them.",
            "author": null,
            "id": "hrut2yh",
            "parent_id": "t1_hruj3my",
            "score": 4,
            "created_utc": 1641692189.0,
            "replies": [
                {
                    "body": "But Men are not on there seeking platonic relationships (in the same numbers that “Sb” are) - that is a unicorn find. They ALL want sex. And that’s not a problem because yes, sex is an essential part of a normal, functioning sugar arrangement - but so is MONEY. This idea that sex or money are not important components to sugar relationships is so false.",
                    "author": "iwishyouwo0d",
                    "id": "hruwka0",
                    "parent_id": "t1_hrut2yh",
                    "score": 3,
                    "created_utc": 1641693687.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Well said.",
            "author": "63daddy",
            "id": "hrudkja",
            "parent_id": "t1_hrubr0o",
            "score": 0,
            "created_utc": 1641685695.0,
            "replies": [
                {
                    "body": "Thanks! The breadth of the bowl is less obvious on this forum because it still swings towards hardcore pros and escorts who are deeply threatened anytime there is mention of vanilla or dating without ppm/allowance. They ought to remember not every lady out there depends on sugar for their livelihood and not every lady is looking to be paid by the hour “for companionship”.",
                    "author": null,
                    "id": "hruro7z",
                    "parent_id": "t1_hrudkja",
                    "score": -2,
                    "created_utc": 1641691585.0,
                    "replies": [
                        {
                            "body": "Yeah.  I’ve been in Reddit a few years but only regular less than a month.   While it’s great to communicate with others with similar interests, I find Reddit forums tend to also have their own little bubbles of perspective.   \n\nSugar relationships may be on the rise, but they are still the exception, not the rule.  Sites like Seeking have all sorts of things going on, not just the sugar dating most here seek.",
                            "author": "63daddy",
                            "id": "hruu9p0",
                            "parent_id": "t1_hruro7z",
                            "score": 1,
                            "created_utc": 1641692697.0,
                            "replies": []
                        },
                        {
                            "body": "Can confirm",
                            "author": "WorldwideLoving",
                            "id": "hruzgkk",
                            "parent_id": "t1_hruro7z",
                            "score": 1,
                            "created_utc": 1641694943.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "The age gap sub is a small community. The dating over thirty sub, for example, has almost 15x more members.",
            "author": "new_sd_acct",
            "id": "hrugqrq",
            "parent_id": "t1_hrubldi",
            "score": 5,
            "created_utc": 1641687008.0,
            "replies": [
                {
                    "body": "AgeGap has a little less than half the members of this sub, which actually seems relatively in the same order of magnitude as the portion of women here who say they would be interested in an age gap for something more vanilla.",
                    "author": null,
                    "id": "hrw1d2i",
                    "parent_id": "t1_hrugqrq",
                    "score": 1,
                    "created_utc": 1641714898.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "most of these definition do a good job explaining the gist of it.\n\nhowever, [https://www.urbandictionary.com/define.php?term=sugardating](https://www.urbandictionary.com/define.php?term=sugardating) is something else.",
            "author": "dallas-explorer",
            "id": "hs6g6p9",
            "parent_id": "t1_hrvt0to",
            "score": 2,
            "created_utc": 1641884709.0,
            "replies": [
                {
                    "body": "😂🤣😭☠️💀",
                    "author": null,
                    "id": "hsatttr",
                    "parent_id": "t1_hs6g6p9",
                    "score": 1,
                    "created_utc": 1641957000.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yes, I make my own money as well Captain Obvious. But I’m doing this to live beyond my means.",
            "author": null,
            "id": "hruthk5",
            "parent_id": "t1_hrujpcw",
            "score": 11,
            "created_utc": 1641692364.0,
            "replies": [
                {
                    "body": "So why would a rich guy want to date a young attractive girl who only wants him for his money when he could date an equally young and attractive girl who wants him for him?  Less money to waste on an “allowance” and more money to spend on trips and experiences",
                    "author": "nystatin94",
                    "id": "hruvteh",
                    "parent_id": "t1_hruthk5",
                    "score": -3,
                    "created_utc": 1641693362.0,
                    "replies": [
                        {
                            "body": "If he can find a more attractive woman who he wants to date traditionally, then he should for sure go for it. But if he’s messaging me on SA and asking if I’m looking for someone to be financially responsible for me, my response still stands.",
                            "author": null,
                            "id": "hrvjftd",
                            "parent_id": "t1_hruvteh",
                            "score": 12,
                            "created_utc": 1641704132.0,
                            "replies": [
                                {
                                    "body": "have you seen Seeking's advertising over the last year?\n\nif someone comes to the site as a result of Seeking's ads, they will have no idea that it is a sugar dating site.\n\n>asking if I’m looking for someone to be financially responsible for me\n\nsounds like he was worried that you might want him to fund your entire life, not just provide some extra support.",
                                    "author": "joc13",
                                    "id": "hrvnb5v",
                                    "parent_id": "t1_hrvjftd",
                                    "score": -2,
                                    "created_utc": 1641706211.0,
                                    "replies": [
                                        {
                                            "body": "It’s calling seeking ARRANGEMENT sir. Real sugar babies are not amused by Splenda or salt daddies.",
                                            "author": null,
                                            "id": "hrvo4yq",
                                            "parent_id": "t1_hrvnb5v",
                                            "score": 7,
                                            "created_utc": 1641706661.0,
                                            "replies": [
                                                {
                                                    "body": "no, the site is just called Seeking now. the word arrangement does not appear in their advertising anywhere and given the FWB tag being replaced with Friends, I'd be surprised if the word arrangement is used anywhere on the site any more.\n\n>Real sugar babies are not amused by Splenda or salt daddies.\n\nI don't disagree with you there at all, just like Real SD™️s are not amused by women wanting to date platonically (with or without an allowance) or date with the intention of getting married. but, the advertising aimed at women just says \"upgrade your dating life\" so they have no idea what sugar dating is all about.",
                                                    "author": "joc13",
                                                    "id": "hrvpvtn",
                                                    "parent_id": "t1_hrvo4yq",
                                                    "score": 2,
                                                    "created_utc": 1641707643.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "If you think it’s okay to shoot your shot for a traditional relationship on a sugar dating website, then why don’t you just make a tinder or bumble? Show them that you “know your worth”\n\nPotential sugar babies that expect handouts without having anything to offer, shouldn’t be active on these sites either. They’re a detriment to those who are reliable and reasonable.",
            "author": null,
            "id": "hrvmahj",
            "parent_id": "t1_hrve6ur",
            "score": 8,
            "created_utc": 1641705653.0,
            "replies": [
                {
                    "body": "SA is a lot better because theres far less men in proportion to women than on tinder or bumble. Its also not predominantly swipe based, which tends to make tinder/bumble mostly looked based. A lot of women swipe left on most profiles after a millisecond based solely on looks. Another thing is on tinder/bumble a lot of women set their upper range age much lower. All these combined, pragmatically make it a good choice for men whether they are looking to be an SD or not to use SA. \n\nPersonally im open to being an SD for the right girl, but ive had vanilla a handful of times from seeking as well. \n\nYeah I know its annoying to a lot of sbs for non sds to be on SA, but trust me the guys have a shit ton of annoyances on there as well with all the platonics, pic sellers etc. Just vet and move on.",
                    "author": "Yo_Mamas_azz",
                    "id": "hrx11hq",
                    "parent_id": "t1_hrvmahj",
                    "score": 1,
                    "created_utc": 1641738735.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Sir, I did not tell him I wanted him to be financially responsible for me. I am financially responsible for myself. People like this try to shame SB’s who look for compensation for their time and intimacy, and that is NOT okay. If he says he wants something mutually beneficial, should my response be, “So you’re looking for someone to be responsible for getting you off?”? I blocked him.",
            "author": null,
            "id": "hrxxtx6",
            "parent_id": "t1_hrxw3hj",
            "score": 2,
            "created_utc": 1641751613.0,
            "replies": [
                {
                    "body": "You did the right thing. No need to be defensive.",
                    "author": "dallas-explorer",
                    "id": "hs6gfkz",
                    "parent_id": "t1_hrxxtx6",
                    "score": 1,
                    "created_utc": 1641884877.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Seeking.com  \n\nFormally called Seeking Arrangement",
            "author": null,
            "id": "hrwxk9u",
            "parent_id": "t1_hrwugmt",
            "score": 2,
            "created_utc": 1641737031.0,
            "replies": []
        },
        {
            "body": "I say that because it is true. Based on what I have seen locally in market talking to pot and sb's. And the countless stories in this sub by women who did \"fall for that\".  \n\n\nTo your second sentence. I operate on the rule and not the exception. There are women not looking for finances. They are the exception. And I'm not going operate like they are the rule just to make a point.",
            "author": "southernslick",
            "id": "hrx4tfi",
            "parent_id": "t1_hrx3ala",
            "score": 9,
            "created_utc": 1641740453.0,
            "replies": [
                {
                    "body": "The stories on this sub do not represent what’s happening in the real world. 90% + of users on seeking don’t bother coming here to complain about things. Those that find what they want just don’t bother coming onto Reddit! Guys complain about the platonic girls. They exist. I’ve talked to them. I move on quick but don’t come on here to complain.",
                    "author": null,
                    "id": "hrxcol4",
                    "parent_id": "t1_hrx4tfi",
                    "score": -2,
                    "created_utc": 1641743656.0,
                    "replies": [
                        {
                            "body": "I also mentioned what I've seen locally in my area talking to pot and sugarbabies who have no idea this sub exists. Their stories mirror what I read in here in spite of the fact these ladies I've spoken to don't come here.   \n\n\nSo we both have our experiences offline in the real world. Let's leave it at that.",
                            "author": "southernslick",
                            "id": "hrxd77s",
                            "parent_id": "t1_hrxcol4",
                            "score": 7,
                            "created_utc": 1641743852.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "This is true. \n\nI had a very pretty woman of 24 (I'm 40), message me first, saying she was interested in meeting higher quality men than frat boys her age, and she wanted to experience some \"luxury\", i.e., nice dinners, etc.\n\nShe didn't want money, just better experiences.",
            "author": null,
            "id": "hrxq65o",
            "parent_id": "t1_hrx3ala",
            "score": 1,
            "created_utc": 1641748791.0,
            "replies": [
                {
                    "body": "So it certainly happens to others then! I guess you’re in shape and treat girls well and  probably intelligent and successful though? So I was 49 and dated a cute 23 year old student who just wanted nice dinners etc. So it happens. Not popular to say it. My comment is being downvoted …. Whatever🙄",
                    "author": null,
                    "id": "hry5btl",
                    "parent_id": "t1_hrxq65o",
                    "score": -3,
                    "created_utc": 1641754256.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Please don't let these men bully you into thinking this is the norm and what you should do. don't lower your standards or what you expect. You came into sugar dating for financial reasons and you should stick to it. There's nothing wrong with wanting financial  help and there isn't anything wrong with getting financial help and there isn't anything wrong with not wanting any",
            "author": "glamour_doll",
            "id": "hrudlvu",
            "parent_id": "t1_hruan9h",
            "score": 38,
            "created_utc": 1641685710.0,
            "replies": [
                {
                    "body": "Yes that’s what sugar dating is about the money part and it’s crazy that there are men who insert themselves into sugar dating to shame women who want money(these are the narcissist fake SD).\n\nMost of these guys are narcissists or have nothing to offer but money, so they use money to attract women because they know no decent woman wants them. So they come onto sugar dating instead of using common sense and going on bumble/tinder and add a bio, where you can brag about money since you have no qualities \n\nThere are girls out there who just want rich boyfriends so they probably come there, but even with wanting rich boyfriends, money is a big part",
                    "author": "Specific-Fondant-525",
                    "id": "hrueebo",
                    "parent_id": "t1_hrudlvu",
                    "score": 14,
                    "created_utc": 1641686037.0,
                    "replies": [
                        {
                            "body": "agreed 🙌",
                            "author": "glamour_doll",
                            "id": "hruenb5",
                            "parent_id": "t1_hrueebo",
                            "score": 6,
                            "created_utc": 1641686139.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I don’t think you realize how many girls are on seeking that are looking for, or open to something vanilla without an allowance. Whether or not you want to admit it, there are girls on seeking that are looking for this, and that is why there are guys on seeking looking for sex or vanilla with no allowance.\n\nIn November alone I went out with 5-6 girls from seeking that just wanted a rich boyfriend, no allowance or ppm required.",
            "author": null,
            "id": "hruayqk",
            "parent_id": "t1_hruan9h",
            "score": -3,
            "created_utc": 1641684617.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "hrw8djs",
                    "parent_id": "t1_hruayqk",
                    "score": 7,
                    "created_utc": 1641720048.0,
                    "replies": [
                        {
                            "body": "Because on Hinge and Bumble there is no way to filter by wealth or income.\n\nAt least on SD it's safe to assume at least some of the guys there are wealthy and the ones that are are there even though they presume they'll have to pay.\n\nI have had at least 10 girls in the past year alone tell me they use Seeking to meet rich guys, not necessarily to sugar",
                            "author": "gangsta_baby",
                            "id": "hrwrx8h",
                            "parent_id": "t1_hrw8djs",
                            "score": 4,
                            "created_utc": 1641734036.0,
                            "replies": [
                                {
                                    "body": "Honestly it’s funny because even with the income listed on most SD profiles their level of wealth doesn’t mean they’re generous or would be willing to do luxurious things.",
                                    "author": "No-Letterhead5328",
                                    "id": "hrxzep5",
                                    "parent_id": "t1_hrwrx8h",
                                    "score": 4,
                                    "created_utc": 1641752185.0,
                                    "replies": [
                                        {
                                            "body": "We know.\n\nBut that is irrelevant to why women go to the site to find rich guys. The probability is just higher there than on regular dating sites to find a 'richer' guy than most.\n\nOn regular dating sites there is literally no way to determine that, or filter for wealth. Also putting 'I only want a wealthy man' on a regular dating site isn't really going to make you any friends. It'll turn off the 'regulars' and the rich guys among them will probably see it as a red flag.\n\nSo the other reason is that they can be explicit about what they want (even if they have to wade through a bunch of bullshit and scammers to get it)",
                                            "author": "gangsta_baby",
                                            "id": "hrypxb4",
                                            "parent_id": "t1_hrxzep5",
                                            "score": 0,
                                            "created_utc": 1641761493.0,
                                            "replies": [
                                                {
                                                    "body": "I was agreeing with you lol. I was just pointing out that it’s not always what it seems for some people and adding onto what you said.",
                                                    "author": "No-Letterhead5328",
                                                    "id": "hs3enpr",
                                                    "parent_id": "t1_hrypxb4",
                                                    "score": 2,
                                                    "created_utc": 1641838830.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "I don’t know, why don’t you ask them why they’re on seeking. But I can only guess because there’s more millionaires on seeking than any other dating site :)\n\nAlso, don’t you think most of these girls are also on hinge or bumble? I can’t tell you how many seeking girls I also see on the vanilla dating apps.",
                            "author": null,
                            "id": "hrxeamg",
                            "parent_id": "t1_hrw8djs",
                            "score": 1,
                            "created_utc": 1641744270.0,
                            "replies": []
                        },
                        {
                            "body": "\\>Why won’t these girls just go on hinge or bumble then?\n\nThat's inefficient, the whole point of SAS is that these guys are paying for a membership and that works as a filter.\n\nThere's no broke bros in SA as you need at least $100 to play but mountains of those guys are all over hinge/tinder/bumble.",
                            "author": "No-Hat5902",
                            "id": "hryt6u3",
                            "parent_id": "t1_hrw8djs",
                            "score": 0,
                            "created_utc": 1641762638.0,
                            "replies": []
                        },
                        {
                            "body": "It’s not BS by the way. At least not in Europe…",
                            "author": null,
                            "id": "hrx2tii",
                            "parent_id": "t1_hrw8djs",
                            "score": 1,
                            "created_utc": 1641739562.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Soo what happened with those 5-6 girls?",
                    "author": "D2boujee",
                    "id": "hrukacl",
                    "parent_id": "t1_hruayqk",
                    "score": 6,
                    "created_utc": 1641688477.0,
                    "replies": [
                        {
                            "body": "I still talk and casually see 3 of them. The other 3 it didn’t work out with or I decided not to see them again.",
                            "author": null,
                            "id": "hrul6ll",
                            "parent_id": "t1_hrukacl",
                            "score": -3,
                            "created_utc": 1641688855.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Everyone’s different. I once had a SB that just wanted to go to the mall and watch me swipe plastic. Never asked for a penny.",
                    "author": "YakiMe",
                    "id": "hrv0t55",
                    "parent_id": "t1_hruayqk",
                    "score": 1,
                    "created_utc": 1641695523.0,
                    "replies": []
                },
                {
                    "body": "The pro SBs really don’t like hearing this. They want to protect the idea that girls on seeking should be acting according to their laws of sugaring. If they keep sleeping with guys for free it undermines their position. But not all girls on seeking are sugar babes. Many of us know that. Some girls want to sleep with guys twice the age without finances. I know that. Sorry. Downvotes expected….",
                    "author": null,
                    "id": "hrx2i71",
                    "parent_id": "t1_hruayqk",
                    "score": -2,
                    "created_utc": 1641739420.0,
                    "replies": [
                        {
                            "body": "You’re deluding yourself sir",
                            "author": "Bbygirlxxxx",
                            "id": "hrykypl",
                            "parent_id": "t1_hrx2i71",
                            "score": 4,
                            "created_utc": 1641759756.0,
                            "replies": [
                                {
                                    "body": "I’m just sharing my experience. Sorry.",
                                    "author": null,
                                    "id": "hs1b3fx",
                                    "parent_id": "t1_hrykypl",
                                    "score": 0,
                                    "created_utc": 1641800482.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Oh yea I already expect downvotes whenever I say this lol.",
                            "author": null,
                            "id": "hrxe0oy",
                            "parent_id": "t1_hrx2i71",
                            "score": 3,
                            "created_utc": 1641744162.0,
                            "replies": []
                        },
                        {
                            "body": "So true. Same with men who hate the guys paying for platonic dates, pics, online relationships etc. It ruins the balance",
                            "author": "Hungboy6969420",
                            "id": "huvki7y",
                            "parent_id": "t1_hrx2i71",
                            "score": 1,
                            "created_utc": 1643564208.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "High five lol",
                    "author": "wb19081908",
                    "id": "hrw651a",
                    "parent_id": "t1_hruayqk",
                    "score": -1,
                    "created_utc": 1641718372.0,
                    "replies": []
                },
                {
                    "body": "Good to know. I might fire up SA sooner if I’m not happy with my vanilla activity. The only thing is my local vanilla aged women aren’t really girlfriend material. I just did a quick search for 26~33 (my normal vanilla match age), and I’m seeing a lot of fat women or single mothers. Could be a seasonal thing though, since I’m seeing a lot of that when I’ve been swiping mindlessly on tinder too.",
                    "author": "sdthrowaway006",
                    "id": "hrv00cu",
                    "parent_id": "t1_hruayqk",
                    "score": -7,
                    "created_utc": 1641695178.0,
                    "replies": [
                        {
                            "body": "Swipe app algorithms show you more of what you swipe right on.",
                            "author": null,
                            "id": "hrxqqoo",
                            "parent_id": "t1_hrv00cu",
                            "score": 2,
                            "created_utc": 1641749001.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Agreed. \n\nThere's a percentage of women that just don't want to date men they perceive to be broke, losers, etc.",
                    "author": null,
                    "id": "hrxqjm9",
                    "parent_id": "t1_hruayqk",
                    "score": 1,
                    "created_utc": 1641748929.0,
                    "replies": []
                },
                {
                    "body": "Yep it's rich boyfriend finder. It's relatively common",
                    "author": "Hungboy6969420",
                    "id": "huvk3sf",
                    "parent_id": "t1_hruayqk",
                    "score": 1,
                    "created_utc": 1643564058.0,
                    "replies": [
                        {
                            "body": "100%",
                            "author": null,
                            "id": "huvk8be",
                            "parent_id": "t1_huvk3sf",
                            "score": 1,
                            "created_utc": 1643564105.0,
                            "replies": [
                                {
                                    "body": "I met a woman recently off there who claimed to have been in multiple long term relationships with daddies without ever actually taking allowance/ppm. She just wanted to be around rich dudes who spoiled her and she could learn from. Pretty smart imo",
                                    "author": "Hungboy6969420",
                                    "id": "huvkefr",
                                    "parent_id": "t1_huvk8be",
                                    "score": 1,
                                    "created_utc": 1643564168.0,
                                    "replies": [
                                        {
                                            "body": "Im going out with a pretty latina today who told me she doesn’t want any money from me, she just wants to date a more established man. She said she was tired of all the tinder fuck boys just looking for sex.",
                                            "author": null,
                                            "id": "huvkzp6",
                                            "parent_id": "t1_huvkefr",
                                            "score": 1,
                                            "created_utc": 1643564395.0,
                                            "replies": [
                                                {
                                                    "body": "Ha that's almost exactly what this woman said too. \"I could hook up with a frat bro but that gets old, why not get something else outta having sex?\"",
                                                    "author": "Hungboy6969420",
                                                    "id": "huvl4bb",
                                                    "parent_id": "t1_huvkzp6",
                                                    "score": 1,
                                                    "created_utc": 1643564442.0,
                                                    "replies": [
                                                        {
                                                            "body": "Yep! I have a date next week with another young woman from SA, who said she likes older men and is looking for a relationship and no money. Works for me lol!",
                                                            "author": null,
                                                            "id": "huvm590",
                                                            "parent_id": "t1_huvl4bb",
                                                            "score": 1,
                                                            "created_utc": 1643564835.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Straight to the point lol.",
            "author": null,
            "id": "hrulzhu",
            "parent_id": "t1_hrulwuo",
            "score": 0,
            "created_utc": 1641689195.0,
            "replies": []
        },
        {
            "body": "Are you sure you're not impotent",
            "author": null,
            "id": "hrxre8i",
            "parent_id": "t1_hrvn4at",
            "score": 1,
            "created_utc": 1641749240.0,
            "replies": [
                {
                    "body": "Yup, no worries there, fortunately…",
                    "author": "txjerome",
                    "id": "hrxrz55",
                    "parent_id": "t1_hrxre8i",
                    "score": 2,
                    "created_utc": 1641749456.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Uh, congratulations???\n\nThen you’re exactly who I’m talking about when I say “men and women fucking up the bowl”",
            "author": "iwishyouwo0d",
            "id": "hrux8km",
            "parent_id": "t1_hruw3k1",
            "score": 16,
            "created_utc": 1641693979.0,
            "replies": [
                {
                    "body": "She sounds like a WHOLE Pick me. Offering to split a check? cooking a man dinner? ... in the bowl?  \n\nLet me go over here and pray because I do not need to hear this level desperation on the Lord’s Day",
                    "author": "TX_SB",
                    "id": "hryoss9",
                    "parent_id": "t1_hrux8km",
                    "score": 5,
                    "created_utc": 1641761101.0,
                    "replies": []
                },
                {
                    "body": "LMAO. She’s excited about getting a free dinner after fucking? 😢",
                    "author": null,
                    "id": "hrvob8a",
                    "parent_id": "t1_hrux8km",
                    "score": 9,
                    "created_utc": 1641706757.0,
                    "replies": [
                        {
                            "body": "Don’t forget about the free drinks!!! Dems expensive 🥂",
                            "author": "iwishyouwo0d",
                            "id": "hrvojfx",
                            "parent_id": "t1_hrvob8a",
                            "score": 6,
                            "created_utc": 1641706885.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "[removed]",
                    "author": null,
                    "id": "hruydgt",
                    "parent_id": "t1_hrux8km",
                    "score": 1,
                    "created_utc": 1641694471.0,
                    "replies": [
                        {
                            "body": "So you’re saying sugar babies that require an allowance are prostitutes? Got it.",
                            "author": "iwishyouwo0d",
                            "id": "hrv2h84",
                            "parent_id": "t1_hruydgt",
                            "score": 8,
                            "created_utc": 1641696237.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "[removed]",
                    "author": null,
                    "id": "hrvlrtd",
                    "parent_id": "t1_hrux8km",
                    "score": -1,
                    "created_utc": 1641705373.0,
                    "replies": [
                        {
                            "body": "The girls that get it, get it. The ones that don’t, don’t.",
                            "author": "iwishyouwo0d",
                            "id": "hrvz0j3",
                            "parent_id": "t1_hrvlrtd",
                            "score": 7,
                            "created_utc": 1641713277.0,
                            "replies": [
                                {
                                    "body": "Not everyone has to think like you. To each their own.",
                                    "author": "dtan777",
                                    "id": "hrxl4ru",
                                    "parent_id": "t1_hrvz0j3",
                                    "score": 0,
                                    "created_utc": 1641746885.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "She should be looking for Vanilla relationships since what she wants wouldn’t be considered sugar.",
                            "author": "lenaanabelle",
                            "id": "hrwi82y",
                            "parent_id": "t1_hrvlrtd",
                            "score": 6,
                            "created_utc": 1641727696.0,
                            "replies": [
                                {
                                    "body": "Yeah but how do you get to determine who belongs to SA or not. Everyone has the right to use it in whichever way they want. There are all kinds of mutually beneficial relationships, not just transactional ones.",
                                    "author": "dtan777",
                                    "id": "hrxl2b9",
                                    "parent_id": "t1_hrwi82y",
                                    "score": 0,
                                    "created_utc": 1641746859.0,
                                    "replies": [
                                        {
                                            "body": "Seeking is not a vanilla dating site.",
                                            "author": "lenaanabelle",
                                            "id": "hs8pim3",
                                            "parent_id": "t1_hrxl2b9",
                                            "score": 1,
                                            "created_utc": 1641926790.0,
                                            "replies": [
                                                {
                                                    "body": "Mutually beneficial does not equal transactional. Maybe you’re the one who doesn’t belong on sugar dating sites.",
                                                    "author": "dtan777",
                                                    "id": "hs9omrg",
                                                    "parent_id": "t1_hs8pim3",
                                                    "score": 1,
                                                    "created_utc": 1641939698.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "No mutually beneficial doesn’t mean transactional, but the purpose of being in a mutually beneficial arrangement is because it’s not traditional.\n\nA guy buying you dinner is literally the bare minimum in traditional dating. Nothing wrong with it, but you can easily find that anywhere.",
                                    "author": "lenaanabelle",
                                    "id": "httwsqw",
                                    "parent_id": "t1_hrwi82y",
                                    "score": 1,
                                    "created_utc": 1642906867.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Just saying that does happen but is extremely rare, I got really lucky once (on tinder not SA actually) and had a purely textual relationship with a SD. Made a couple hundred bucks in about two months before school got in the way, but it wasn't bad for being a busy college kid and just sexting",
            "author": "space-zebras",
            "id": "hrvv07o",
            "parent_id": "t1_hrus3hr",
            "score": 0,
            "created_utc": 1641710654.0,
            "replies": []
        },
        {
            "body": "Yup. Well said.",
            "author": "new_sd_acct",
            "id": "hruu1a9",
            "parent_id": "t1_hrus3hr",
            "score": 0,
            "created_utc": 1641692598.0,
            "replies": []
        },
        {
            "body": "Why are they taking advantage? If they are up front about not offering to pay and they’re good looking enough to date vanilla, even though they’re using seeking, then what’s the issue. You just need to move on and find those that want to pay you. Just as SDs need to find those who aren’t just platonic or online only. It’s a filtering process that’s all. Seeking now has many kinds of people on both sides. No rules here, just keep looking til you find a match.",
            "author": null,
            "id": "hrx3svt",
            "parent_id": "t1_hrvhnzo",
            "score": 3,
            "created_utc": 1641740004.0,
            "replies": [
                {
                    "body": "you confuse me or aren't a real SD.... What is all this bull about looking good enough to vanilla date?? If you lowball offer because of this you are a fake SD trying to take advantage of SBs end of story. If you want, look at my most recent post for SLF. I am demisexual. I am not attracted to people like that. If you look hot by societal standards I don't care it doesn't make me like you so your point is useless for me. Anyone looks good enough to vanilla date.\n\nI am aware of all this, but thx I guess.",
                    "author": "panda_person666",
                    "id": "hs03abd",
                    "parent_id": "t1_hrx3svt",
                    "score": 3,
                    "created_utc": 1641779959.0,
                    "replies": [
                        {
                            "body": "I don't think you appreciate that on seeking (here in Europe at least) there are women who are not 'traditional SBs' looking for allowances...some just want a bit of pampering or to meet a stable intelligent (preferably good looking, or at least not fat and ugly) guy that may be alot older than them without ppms or allowances. I've met trad SBs AND these girls, they both exist. It's a wide world out there.",
                            "author": null,
                            "id": "hs1muse",
                            "parent_id": "t1_hs03abd",
                            "score": 0,
                            "created_utc": 1641809083.0,
                            "replies": [
                                {
                                    "body": "why should I appreciate that?? European or not?",
                                    "author": "panda_person666",
                                    "id": "hs3owr3",
                                    "parent_id": "t1_hs1muse",
                                    "score": 2,
                                    "created_utc": 1641842535.0,
                                    "replies": [
                                        {
                                            "body": "Appreciate as in ‘understand’. Anyway It’s just how it is over here. FYI.",
                                            "author": null,
                                            "id": "hs3tvur",
                                            "parent_id": "t1_hs3owr3",
                                            "score": 1,
                                            "created_utc": 1641844359.0,
                                            "replies": [
                                                {
                                                    "body": "then \"appreciate\" that isn't really how it is over here xD",
                                                    "author": "panda_person666",
                                                    "id": "hs4npfc",
                                                    "parent_id": "t1_hs3tvur",
                                                    "score": 1,
                                                    "created_utc": 1641855519.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Same here, i dont bother with those youngins.",
            "author": "LaIndiaDeAzucar",
            "id": "hrw1rst",
            "parent_id": "t1_hrvhnzo",
            "score": 2,
            "created_utc": 1641715189.0,
            "replies": []
        },
        {
            "body": "It always depends. I'm in that age range and I always pay very well. However, I have zero tolerance for girls who want to be paid without sex. If that's what you're looking for then, yes, stick to the fossils",
            "author": "gangsta_baby",
            "id": "hrwsai5",
            "parent_id": "t1_hrvhnzo",
            "score": 0,
            "created_utc": 1641734246.0,
            "replies": [
                {
                    "body": "that is not what I am looking for and never implied that is what I am looking for?\n\nyea makes sense. the same way I don't want to be kissed or touched when you only bought me dinner.",
                    "author": "panda_person666",
                    "id": "hs02gbc",
                    "parent_id": "t1_hrwsai5",
                    "score": 1,
                    "created_utc": 1641779623.0,
                    "replies": [
                        {
                            "body": "> yea makes sense. the same way I don't want to be kissed or touched when you only bought me dinner.\n\nI’m not talking about buying dinner. I’m talking about in a sugar relationship both sides need to be clear about their intentions. Too many aspiring SBs, not necessarily you, aren’t. And because they can’t be clear, honest and reliable, they just don’t get what they want.\n\nIt’s no different than an SD not being reliable and consistent for her.\n\nIf your sugar dates only boil down to dinners, you may be doing it wrong.",
                            "author": "gangsta_baby",
                            "id": "hs0rgw2",
                            "parent_id": "t1_hs02gbc",
                            "score": 0,
                            "created_utc": 1641790053.0,
                            "replies": [
                                {
                                    "body": "bruh. I know YOU aren't. I was making a comparison. You said you have 0 tolerance for girls who want money for platonic dates or no sex. I am saying I understand. it's like how I have zero tolerance for someone who wants to do stuff like foreplay on the first date but not give me anything in return really. Yea... I know many aren't why exactly are you telling me this? I am so lost as to what your point even is. Why are you even bringing any of this up. I never asked and it's not even related to what I commented about. All I said was that I have moved my age range up since most under 45 try to pull being cheap. not all but most. \n\nI'm not doing anything wrong?? I am talking about the M & G. Literally what are you talking about and why even??",
                                    "author": "panda_person666",
                                    "id": "hs10qe3",
                                    "parent_id": "t1_hs0rgw2",
                                    "score": 2,
                                    "created_utc": 1641794263.0,
                                    "replies": [
                                        {
                                            "body": "I’m not a Bruh I’m a Bro! j/k",
                                            "author": "gangsta_baby",
                                            "id": "hs14iin",
                                            "parent_id": "t1_hs10qe3",
                                            "score": 1,
                                            "created_utc": 1641796400.0,
                                            "replies": [
                                                {
                                                    "body": "nice not responding to my calling ya out",
                                                    "author": "panda_person666",
                                                    "id": "hs3m60h",
                                                    "parent_id": "t1_hs14iin",
                                                    "score": 2,
                                                    "created_utc": 1641841542.0,
                                                    "replies": [
                                                        {
                                                            "body": "What am I responding to you made a great point so I stopped. :-)",
                                                            "author": "gangsta_baby",
                                                            "id": "hs3ocu1",
                                                            "parent_id": "t1_hs3m60h",
                                                            "score": 1,
                                                            "created_utc": 1641842336.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Not true, because those 2 things are far from mutually exclusive.\n\nA woman's peak sexual market value is age 23, so there is a vast overlap between even the \"average\" college girl, and what many rich guys will choose.",
            "author": "Nomad_Bill",
            "id": "hrzh7js",
            "parent_id": "t1_hrytuuk",
            "score": 1,
            "created_utc": 1641771378.0,
            "replies": []
        },
        {
            "body": "Listen its drives me insane 😂 I put I’m seeking a traditional SD so don’t even ask to view my photos! \n\nI’m even the same with vanilla dating. If you’re not taking me out more. And surprising me I don’t want you 🥴. SD get more of a pass on not being attentive bc it’s NSA…",
            "author": "Woahyeah1",
            "id": "hrv0qy8",
            "parent_id": "t1_hruzexd",
            "score": 5,
            "created_utc": 1641695497.0,
            "replies": []
        },
        {
            "body": "But Men are not on there seeking platonic relationships (in the same numbers that “Sb” are) - that is a unicorn find. They ALL want sex. And that’s not a problem because yes, sex is an essential part of a normal, functioning sugar arrangement - but so is MONEY. This idea that sex or money are not important components to sugar relationships is so false.",
            "author": "iwishyouwo0d",
            "id": "hruwka0",
            "parent_id": "t1_hrut2yh",
            "score": 3,
            "created_utc": 1641693687.0,
            "replies": []
        },
        {
            "body": "Thanks! The breadth of the bowl is less obvious on this forum because it still swings towards hardcore pros and escorts who are deeply threatened anytime there is mention of vanilla or dating without ppm/allowance. They ought to remember not every lady out there depends on sugar for their livelihood and not every lady is looking to be paid by the hour “for companionship”.",
            "author": null,
            "id": "hruro7z",
            "parent_id": "t1_hrudkja",
            "score": -2,
            "created_utc": 1641691585.0,
            "replies": [
                {
                    "body": "Yeah.  I’ve been in Reddit a few years but only regular less than a month.   While it’s great to communicate with others with similar interests, I find Reddit forums tend to also have their own little bubbles of perspective.   \n\nSugar relationships may be on the rise, but they are still the exception, not the rule.  Sites like Seeking have all sorts of things going on, not just the sugar dating most here seek.",
                    "author": "63daddy",
                    "id": "hruu9p0",
                    "parent_id": "t1_hruro7z",
                    "score": 1,
                    "created_utc": 1641692697.0,
                    "replies": []
                },
                {
                    "body": "Can confirm",
                    "author": "WorldwideLoving",
                    "id": "hruzgkk",
                    "parent_id": "t1_hruro7z",
                    "score": 1,
                    "created_utc": 1641694943.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "AgeGap has a little less than half the members of this sub, which actually seems relatively in the same order of magnitude as the portion of women here who say they would be interested in an age gap for something more vanilla.",
            "author": null,
            "id": "hrw1d2i",
            "parent_id": "t1_hrugqrq",
            "score": 1,
            "created_utc": 1641714898.0,
            "replies": []
        },
        {
            "body": "😂🤣😭☠️💀",
            "author": null,
            "id": "hsatttr",
            "parent_id": "t1_hs6g6p9",
            "score": 1,
            "created_utc": 1641957000.0,
            "replies": []
        },
        {
            "body": "So why would a rich guy want to date a young attractive girl who only wants him for his money when he could date an equally young and attractive girl who wants him for him?  Less money to waste on an “allowance” and more money to spend on trips and experiences",
            "author": "nystatin94",
            "id": "hruvteh",
            "parent_id": "t1_hruthk5",
            "score": -3,
            "created_utc": 1641693362.0,
            "replies": [
                {
                    "body": "If he can find a more attractive woman who he wants to date traditionally, then he should for sure go for it. But if he’s messaging me on SA and asking if I’m looking for someone to be financially responsible for me, my response still stands.",
                    "author": null,
                    "id": "hrvjftd",
                    "parent_id": "t1_hruvteh",
                    "score": 12,
                    "created_utc": 1641704132.0,
                    "replies": [
                        {
                            "body": "have you seen Seeking's advertising over the last year?\n\nif someone comes to the site as a result of Seeking's ads, they will have no idea that it is a sugar dating site.\n\n>asking if I’m looking for someone to be financially responsible for me\n\nsounds like he was worried that you might want him to fund your entire life, not just provide some extra support.",
                            "author": "joc13",
                            "id": "hrvnb5v",
                            "parent_id": "t1_hrvjftd",
                            "score": -2,
                            "created_utc": 1641706211.0,
                            "replies": [
                                {
                                    "body": "It’s calling seeking ARRANGEMENT sir. Real sugar babies are not amused by Splenda or salt daddies.",
                                    "author": null,
                                    "id": "hrvo4yq",
                                    "parent_id": "t1_hrvnb5v",
                                    "score": 7,
                                    "created_utc": 1641706661.0,
                                    "replies": [
                                        {
                                            "body": "no, the site is just called Seeking now. the word arrangement does not appear in their advertising anywhere and given the FWB tag being replaced with Friends, I'd be surprised if the word arrangement is used anywhere on the site any more.\n\n>Real sugar babies are not amused by Splenda or salt daddies.\n\nI don't disagree with you there at all, just like Real SD™️s are not amused by women wanting to date platonically (with or without an allowance) or date with the intention of getting married. but, the advertising aimed at women just says \"upgrade your dating life\" so they have no idea what sugar dating is all about.",
                                            "author": "joc13",
                                            "id": "hrvpvtn",
                                            "parent_id": "t1_hrvo4yq",
                                            "score": 2,
                                            "created_utc": 1641707643.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "SA is a lot better because theres far less men in proportion to women than on tinder or bumble. Its also not predominantly swipe based, which tends to make tinder/bumble mostly looked based. A lot of women swipe left on most profiles after a millisecond based solely on looks. Another thing is on tinder/bumble a lot of women set their upper range age much lower. All these combined, pragmatically make it a good choice for men whether they are looking to be an SD or not to use SA. \n\nPersonally im open to being an SD for the right girl, but ive had vanilla a handful of times from seeking as well. \n\nYeah I know its annoying to a lot of sbs for non sds to be on SA, but trust me the guys have a shit ton of annoyances on there as well with all the platonics, pic sellers etc. Just vet and move on.",
            "author": "Yo_Mamas_azz",
            "id": "hrx11hq",
            "parent_id": "t1_hrvmahj",
            "score": 1,
            "created_utc": 1641738735.0,
            "replies": []
        },
        {
            "body": "You did the right thing. No need to be defensive.",
            "author": "dallas-explorer",
            "id": "hs6gfkz",
            "parent_id": "t1_hrxxtx6",
            "score": 1,
            "created_utc": 1641884877.0,
            "replies": []
        },
        {
            "body": "The stories on this sub do not represent what’s happening in the real world. 90% + of users on seeking don’t bother coming here to complain about things. Those that find what they want just don’t bother coming onto Reddit! Guys complain about the platonic girls. They exist. I’ve talked to them. I move on quick but don’t come on here to complain.",
            "author": null,
            "id": "hrxcol4",
            "parent_id": "t1_hrx4tfi",
            "score": -2,
            "created_utc": 1641743656.0,
            "replies": [
                {
                    "body": "I also mentioned what I've seen locally in my area talking to pot and sugarbabies who have no idea this sub exists. Their stories mirror what I read in here in spite of the fact these ladies I've spoken to don't come here.   \n\n\nSo we both have our experiences offline in the real world. Let's leave it at that.",
                    "author": "southernslick",
                    "id": "hrxd77s",
                    "parent_id": "t1_hrxcol4",
                    "score": 7,
                    "created_utc": 1641743852.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "So it certainly happens to others then! I guess you’re in shape and treat girls well and  probably intelligent and successful though? So I was 49 and dated a cute 23 year old student who just wanted nice dinners etc. So it happens. Not popular to say it. My comment is being downvoted …. Whatever🙄",
            "author": null,
            "id": "hry5btl",
            "parent_id": "t1_hrxq65o",
            "score": -3,
            "created_utc": 1641754256.0,
            "replies": []
        },
        {
            "body": "Yes that’s what sugar dating is about the money part and it’s crazy that there are men who insert themselves into sugar dating to shame women who want money(these are the narcissist fake SD).\n\nMost of these guys are narcissists or have nothing to offer but money, so they use money to attract women because they know no decent woman wants them. So they come onto sugar dating instead of using common sense and going on bumble/tinder and add a bio, where you can brag about money since you have no qualities \n\nThere are girls out there who just want rich boyfriends so they probably come there, but even with wanting rich boyfriends, money is a big part",
            "author": "Specific-Fondant-525",
            "id": "hrueebo",
            "parent_id": "t1_hrudlvu",
            "score": 14,
            "created_utc": 1641686037.0,
            "replies": [
                {
                    "body": "agreed 🙌",
                    "author": "glamour_doll",
                    "id": "hruenb5",
                    "parent_id": "t1_hrueebo",
                    "score": 6,
                    "created_utc": 1641686139.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "hrw8djs",
            "parent_id": "t1_hruayqk",
            "score": 7,
            "created_utc": 1641720048.0,
            "replies": [
                {
                    "body": "Because on Hinge and Bumble there is no way to filter by wealth or income.\n\nAt least on SD it's safe to assume at least some of the guys there are wealthy and the ones that are are there even though they presume they'll have to pay.\n\nI have had at least 10 girls in the past year alone tell me they use Seeking to meet rich guys, not necessarily to sugar",
                    "author": "gangsta_baby",
                    "id": "hrwrx8h",
                    "parent_id": "t1_hrw8djs",
                    "score": 4,
                    "created_utc": 1641734036.0,
                    "replies": [
                        {
                            "body": "Honestly it’s funny because even with the income listed on most SD profiles their level of wealth doesn’t mean they’re generous or would be willing to do luxurious things.",
                            "author": "No-Letterhead5328",
                            "id": "hrxzep5",
                            "parent_id": "t1_hrwrx8h",
                            "score": 4,
                            "created_utc": 1641752185.0,
                            "replies": [
                                {
                                    "body": "We know.\n\nBut that is irrelevant to why women go to the site to find rich guys. The probability is just higher there than on regular dating sites to find a 'richer' guy than most.\n\nOn regular dating sites there is literally no way to determine that, or filter for wealth. Also putting 'I only want a wealthy man' on a regular dating site isn't really going to make you any friends. It'll turn off the 'regulars' and the rich guys among them will probably see it as a red flag.\n\nSo the other reason is that they can be explicit about what they want (even if they have to wade through a bunch of bullshit and scammers to get it)",
                                    "author": "gangsta_baby",
                                    "id": "hrypxb4",
                                    "parent_id": "t1_hrxzep5",
                                    "score": 0,
                                    "created_utc": 1641761493.0,
                                    "replies": [
                                        {
                                            "body": "I was agreeing with you lol. I was just pointing out that it’s not always what it seems for some people and adding onto what you said.",
                                            "author": "No-Letterhead5328",
                                            "id": "hs3enpr",
                                            "parent_id": "t1_hrypxb4",
                                            "score": 2,
                                            "created_utc": 1641838830.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "I don’t know, why don’t you ask them why they’re on seeking. But I can only guess because there’s more millionaires on seeking than any other dating site :)\n\nAlso, don’t you think most of these girls are also on hinge or bumble? I can’t tell you how many seeking girls I also see on the vanilla dating apps.",
                    "author": null,
                    "id": "hrxeamg",
                    "parent_id": "t1_hrw8djs",
                    "score": 1,
                    "created_utc": 1641744270.0,
                    "replies": []
                },
                {
                    "body": "\\>Why won’t these girls just go on hinge or bumble then?\n\nThat's inefficient, the whole point of SAS is that these guys are paying for a membership and that works as a filter.\n\nThere's no broke bros in SA as you need at least $100 to play but mountains of those guys are all over hinge/tinder/bumble.",
                    "author": "No-Hat5902",
                    "id": "hryt6u3",
                    "parent_id": "t1_hrw8djs",
                    "score": 0,
                    "created_utc": 1641762638.0,
                    "replies": []
                },
                {
                    "body": "It’s not BS by the way. At least not in Europe…",
                    "author": null,
                    "id": "hrx2tii",
                    "parent_id": "t1_hrw8djs",
                    "score": 1,
                    "created_utc": 1641739562.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Soo what happened with those 5-6 girls?",
            "author": "D2boujee",
            "id": "hrukacl",
            "parent_id": "t1_hruayqk",
            "score": 6,
            "created_utc": 1641688477.0,
            "replies": [
                {
                    "body": "I still talk and casually see 3 of them. The other 3 it didn’t work out with or I decided not to see them again.",
                    "author": null,
                    "id": "hrul6ll",
                    "parent_id": "t1_hrukacl",
                    "score": -3,
                    "created_utc": 1641688855.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Everyone’s different. I once had a SB that just wanted to go to the mall and watch me swipe plastic. Never asked for a penny.",
            "author": "YakiMe",
            "id": "hrv0t55",
            "parent_id": "t1_hruayqk",
            "score": 1,
            "created_utc": 1641695523.0,
            "replies": []
        },
        {
            "body": "The pro SBs really don’t like hearing this. They want to protect the idea that girls on seeking should be acting according to their laws of sugaring. If they keep sleeping with guys for free it undermines their position. But not all girls on seeking are sugar babes. Many of us know that. Some girls want to sleep with guys twice the age without finances. I know that. Sorry. Downvotes expected….",
            "author": null,
            "id": "hrx2i71",
            "parent_id": "t1_hruayqk",
            "score": -2,
            "created_utc": 1641739420.0,
            "replies": [
                {
                    "body": "You’re deluding yourself sir",
                    "author": "Bbygirlxxxx",
                    "id": "hrykypl",
                    "parent_id": "t1_hrx2i71",
                    "score": 4,
                    "created_utc": 1641759756.0,
                    "replies": [
                        {
                            "body": "I’m just sharing my experience. Sorry.",
                            "author": null,
                            "id": "hs1b3fx",
                            "parent_id": "t1_hrykypl",
                            "score": 0,
                            "created_utc": 1641800482.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Oh yea I already expect downvotes whenever I say this lol.",
                    "author": null,
                    "id": "hrxe0oy",
                    "parent_id": "t1_hrx2i71",
                    "score": 3,
                    "created_utc": 1641744162.0,
                    "replies": []
                },
                {
                    "body": "So true. Same with men who hate the guys paying for platonic dates, pics, online relationships etc. It ruins the balance",
                    "author": "Hungboy6969420",
                    "id": "huvki7y",
                    "parent_id": "t1_hrx2i71",
                    "score": 1,
                    "created_utc": 1643564208.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "High five lol",
            "author": "wb19081908",
            "id": "hrw651a",
            "parent_id": "t1_hruayqk",
            "score": -1,
            "created_utc": 1641718372.0,
            "replies": []
        },
        {
            "body": "Good to know. I might fire up SA sooner if I’m not happy with my vanilla activity. The only thing is my local vanilla aged women aren’t really girlfriend material. I just did a quick search for 26~33 (my normal vanilla match age), and I’m seeing a lot of fat women or single mothers. Could be a seasonal thing though, since I’m seeing a lot of that when I’ve been swiping mindlessly on tinder too.",
            "author": "sdthrowaway006",
            "id": "hrv00cu",
            "parent_id": "t1_hruayqk",
            "score": -7,
            "created_utc": 1641695178.0,
            "replies": [
                {
                    "body": "Swipe app algorithms show you more of what you swipe right on.",
                    "author": null,
                    "id": "hrxqqoo",
                    "parent_id": "t1_hrv00cu",
                    "score": 2,
                    "created_utc": 1641749001.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Agreed. \n\nThere's a percentage of women that just don't want to date men they perceive to be broke, losers, etc.",
            "author": null,
            "id": "hrxqjm9",
            "parent_id": "t1_hruayqk",
            "score": 1,
            "created_utc": 1641748929.0,
            "replies": []
        },
        {
            "body": "Yep it's rich boyfriend finder. It's relatively common",
            "author": "Hungboy6969420",
            "id": "huvk3sf",
            "parent_id": "t1_hruayqk",
            "score": 1,
            "created_utc": 1643564058.0,
            "replies": [
                {
                    "body": "100%",
                    "author": null,
                    "id": "huvk8be",
                    "parent_id": "t1_huvk3sf",
                    "score": 1,
                    "created_utc": 1643564105.0,
                    "replies": [
                        {
                            "body": "I met a woman recently off there who claimed to have been in multiple long term relationships with daddies without ever actually taking allowance/ppm. She just wanted to be around rich dudes who spoiled her and she could learn from. Pretty smart imo",
                            "author": "Hungboy6969420",
                            "id": "huvkefr",
                            "parent_id": "t1_huvk8be",
                            "score": 1,
                            "created_utc": 1643564168.0,
                            "replies": [
                                {
                                    "body": "Im going out with a pretty latina today who told me she doesn’t want any money from me, she just wants to date a more established man. She said she was tired of all the tinder fuck boys just looking for sex.",
                                    "author": null,
                                    "id": "huvkzp6",
                                    "parent_id": "t1_huvkefr",
                                    "score": 1,
                                    "created_utc": 1643564395.0,
                                    "replies": [
                                        {
                                            "body": "Ha that's almost exactly what this woman said too. \"I could hook up with a frat bro but that gets old, why not get something else outta having sex?\"",
                                            "author": "Hungboy6969420",
                                            "id": "huvl4bb",
                                            "parent_id": "t1_huvkzp6",
                                            "score": 1,
                                            "created_utc": 1643564442.0,
                                            "replies": [
                                                {
                                                    "body": "Yep! I have a date next week with another young woman from SA, who said she likes older men and is looking for a relationship and no money. Works for me lol!",
                                                    "author": null,
                                                    "id": "huvm590",
                                                    "parent_id": "t1_huvl4bb",
                                                    "score": 1,
                                                    "created_utc": 1643564835.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yup, no worries there, fortunately…",
            "author": "txjerome",
            "id": "hrxrz55",
            "parent_id": "t1_hrxre8i",
            "score": 2,
            "created_utc": 1641749456.0,
            "replies": []
        },
        {
            "body": "She sounds like a WHOLE Pick me. Offering to split a check? cooking a man dinner? ... in the bowl?  \n\nLet me go over here and pray because I do not need to hear this level desperation on the Lord’s Day",
            "author": "TX_SB",
            "id": "hryoss9",
            "parent_id": "t1_hrux8km",
            "score": 5,
            "created_utc": 1641761101.0,
            "replies": []
        },
        {
            "body": "LMAO. She’s excited about getting a free dinner after fucking? 😢",
            "author": null,
            "id": "hrvob8a",
            "parent_id": "t1_hrux8km",
            "score": 9,
            "created_utc": 1641706757.0,
            "replies": [
                {
                    "body": "Don’t forget about the free drinks!!! Dems expensive 🥂",
                    "author": "iwishyouwo0d",
                    "id": "hrvojfx",
                    "parent_id": "t1_hrvob8a",
                    "score": 6,
                    "created_utc": 1641706885.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "hruydgt",
            "parent_id": "t1_hrux8km",
            "score": 1,
            "created_utc": 1641694471.0,
            "replies": [
                {
                    "body": "So you’re saying sugar babies that require an allowance are prostitutes? Got it.",
                    "author": "iwishyouwo0d",
                    "id": "hrv2h84",
                    "parent_id": "t1_hruydgt",
                    "score": 8,
                    "created_utc": 1641696237.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "hrvlrtd",
            "parent_id": "t1_hrux8km",
            "score": -1,
            "created_utc": 1641705373.0,
            "replies": [
                {
                    "body": "The girls that get it, get it. The ones that don’t, don’t.",
                    "author": "iwishyouwo0d",
                    "id": "hrvz0j3",
                    "parent_id": "t1_hrvlrtd",
                    "score": 7,
                    "created_utc": 1641713277.0,
                    "replies": [
                        {
                            "body": "Not everyone has to think like you. To each their own.",
                            "author": "dtan777",
                            "id": "hrxl4ru",
                            "parent_id": "t1_hrvz0j3",
                            "score": 0,
                            "created_utc": 1641746885.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "She should be looking for Vanilla relationships since what she wants wouldn’t be considered sugar.",
                    "author": "lenaanabelle",
                    "id": "hrwi82y",
                    "parent_id": "t1_hrvlrtd",
                    "score": 6,
                    "created_utc": 1641727696.0,
                    "replies": [
                        {
                            "body": "Yeah but how do you get to determine who belongs to SA or not. Everyone has the right to use it in whichever way they want. There are all kinds of mutually beneficial relationships, not just transactional ones.",
                            "author": "dtan777",
                            "id": "hrxl2b9",
                            "parent_id": "t1_hrwi82y",
                            "score": 0,
                            "created_utc": 1641746859.0,
                            "replies": [
                                {
                                    "body": "Seeking is not a vanilla dating site.",
                                    "author": "lenaanabelle",
                                    "id": "hs8pim3",
                                    "parent_id": "t1_hrxl2b9",
                                    "score": 1,
                                    "created_utc": 1641926790.0,
                                    "replies": [
                                        {
                                            "body": "Mutually beneficial does not equal transactional. Maybe you’re the one who doesn’t belong on sugar dating sites.",
                                            "author": "dtan777",
                                            "id": "hs9omrg",
                                            "parent_id": "t1_hs8pim3",
                                            "score": 1,
                                            "created_utc": 1641939698.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "No mutually beneficial doesn’t mean transactional, but the purpose of being in a mutually beneficial arrangement is because it’s not traditional.\n\nA guy buying you dinner is literally the bare minimum in traditional dating. Nothing wrong with it, but you can easily find that anywhere.",
                            "author": "lenaanabelle",
                            "id": "httwsqw",
                            "parent_id": "t1_hrwi82y",
                            "score": 1,
                            "created_utc": 1642906867.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "you confuse me or aren't a real SD.... What is all this bull about looking good enough to vanilla date?? If you lowball offer because of this you are a fake SD trying to take advantage of SBs end of story. If you want, look at my most recent post for SLF. I am demisexual. I am not attracted to people like that. If you look hot by societal standards I don't care it doesn't make me like you so your point is useless for me. Anyone looks good enough to vanilla date.\n\nI am aware of all this, but thx I guess.",
            "author": "panda_person666",
            "id": "hs03abd",
            "parent_id": "t1_hrx3svt",
            "score": 3,
            "created_utc": 1641779959.0,
            "replies": [
                {
                    "body": "I don't think you appreciate that on seeking (here in Europe at least) there are women who are not 'traditional SBs' looking for allowances...some just want a bit of pampering or to meet a stable intelligent (preferably good looking, or at least not fat and ugly) guy that may be alot older than them without ppms or allowances. I've met trad SBs AND these girls, they both exist. It's a wide world out there.",
                    "author": null,
                    "id": "hs1muse",
                    "parent_id": "t1_hs03abd",
                    "score": 0,
                    "created_utc": 1641809083.0,
                    "replies": [
                        {
                            "body": "why should I appreciate that?? European or not?",
                            "author": "panda_person666",
                            "id": "hs3owr3",
                            "parent_id": "t1_hs1muse",
                            "score": 2,
                            "created_utc": 1641842535.0,
                            "replies": [
                                {
                                    "body": "Appreciate as in ‘understand’. Anyway It’s just how it is over here. FYI.",
                                    "author": null,
                                    "id": "hs3tvur",
                                    "parent_id": "t1_hs3owr3",
                                    "score": 1,
                                    "created_utc": 1641844359.0,
                                    "replies": [
                                        {
                                            "body": "then \"appreciate\" that isn't really how it is over here xD",
                                            "author": "panda_person666",
                                            "id": "hs4npfc",
                                            "parent_id": "t1_hs3tvur",
                                            "score": 1,
                                            "created_utc": 1641855519.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "that is not what I am looking for and never implied that is what I am looking for?\n\nyea makes sense. the same way I don't want to be kissed or touched when you only bought me dinner.",
            "author": "panda_person666",
            "id": "hs02gbc",
            "parent_id": "t1_hrwsai5",
            "score": 1,
            "created_utc": 1641779623.0,
            "replies": [
                {
                    "body": "> yea makes sense. the same way I don't want to be kissed or touched when you only bought me dinner.\n\nI’m not talking about buying dinner. I’m talking about in a sugar relationship both sides need to be clear about their intentions. Too many aspiring SBs, not necessarily you, aren’t. And because they can’t be clear, honest and reliable, they just don’t get what they want.\n\nIt’s no different than an SD not being reliable and consistent for her.\n\nIf your sugar dates only boil down to dinners, you may be doing it wrong.",
                    "author": "gangsta_baby",
                    "id": "hs0rgw2",
                    "parent_id": "t1_hs02gbc",
                    "score": 0,
                    "created_utc": 1641790053.0,
                    "replies": [
                        {
                            "body": "bruh. I know YOU aren't. I was making a comparison. You said you have 0 tolerance for girls who want money for platonic dates or no sex. I am saying I understand. it's like how I have zero tolerance for someone who wants to do stuff like foreplay on the first date but not give me anything in return really. Yea... I know many aren't why exactly are you telling me this? I am so lost as to what your point even is. Why are you even bringing any of this up. I never asked and it's not even related to what I commented about. All I said was that I have moved my age range up since most under 45 try to pull being cheap. not all but most. \n\nI'm not doing anything wrong?? I am talking about the M & G. Literally what are you talking about and why even??",
                            "author": "panda_person666",
                            "id": "hs10qe3",
                            "parent_id": "t1_hs0rgw2",
                            "score": 2,
                            "created_utc": 1641794263.0,
                            "replies": [
                                {
                                    "body": "I’m not a Bruh I’m a Bro! j/k",
                                    "author": "gangsta_baby",
                                    "id": "hs14iin",
                                    "parent_id": "t1_hs10qe3",
                                    "score": 1,
                                    "created_utc": 1641796400.0,
                                    "replies": [
                                        {
                                            "body": "nice not responding to my calling ya out",
                                            "author": "panda_person666",
                                            "id": "hs3m60h",
                                            "parent_id": "t1_hs14iin",
                                            "score": 2,
                                            "created_utc": 1641841542.0,
                                            "replies": [
                                                {
                                                    "body": "What am I responding to you made a great point so I stopped. :-)",
                                                    "author": "gangsta_baby",
                                                    "id": "hs3ocu1",
                                                    "parent_id": "t1_hs3m60h",
                                                    "score": 1,
                                                    "created_utc": 1641842336.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yeah.  I’ve been in Reddit a few years but only regular less than a month.   While it’s great to communicate with others with similar interests, I find Reddit forums tend to also have their own little bubbles of perspective.   \n\nSugar relationships may be on the rise, but they are still the exception, not the rule.  Sites like Seeking have all sorts of things going on, not just the sugar dating most here seek.",
            "author": "63daddy",
            "id": "hruu9p0",
            "parent_id": "t1_hruro7z",
            "score": 1,
            "created_utc": 1641692697.0,
            "replies": []
        },
        {
            "body": "Can confirm",
            "author": "WorldwideLoving",
            "id": "hruzgkk",
            "parent_id": "t1_hruro7z",
            "score": 1,
            "created_utc": 1641694943.0,
            "replies": []
        },
        {
            "body": "If he can find a more attractive woman who he wants to date traditionally, then he should for sure go for it. But if he’s messaging me on SA and asking if I’m looking for someone to be financially responsible for me, my response still stands.",
            "author": null,
            "id": "hrvjftd",
            "parent_id": "t1_hruvteh",
            "score": 12,
            "created_utc": 1641704132.0,
            "replies": [
                {
                    "body": "have you seen Seeking's advertising over the last year?\n\nif someone comes to the site as a result of Seeking's ads, they will have no idea that it is a sugar dating site.\n\n>asking if I’m looking for someone to be financially responsible for me\n\nsounds like he was worried that you might want him to fund your entire life, not just provide some extra support.",
                    "author": "joc13",
                    "id": "hrvnb5v",
                    "parent_id": "t1_hrvjftd",
                    "score": -2,
                    "created_utc": 1641706211.0,
                    "replies": [
                        {
                            "body": "It’s calling seeking ARRANGEMENT sir. Real sugar babies are not amused by Splenda or salt daddies.",
                            "author": null,
                            "id": "hrvo4yq",
                            "parent_id": "t1_hrvnb5v",
                            "score": 7,
                            "created_utc": 1641706661.0,
                            "replies": [
                                {
                                    "body": "no, the site is just called Seeking now. the word arrangement does not appear in their advertising anywhere and given the FWB tag being replaced with Friends, I'd be surprised if the word arrangement is used anywhere on the site any more.\n\n>Real sugar babies are not amused by Splenda or salt daddies.\n\nI don't disagree with you there at all, just like Real SD™️s are not amused by women wanting to date platonically (with or without an allowance) or date with the intention of getting married. but, the advertising aimed at women just says \"upgrade your dating life\" so they have no idea what sugar dating is all about.",
                                    "author": "joc13",
                                    "id": "hrvpvtn",
                                    "parent_id": "t1_hrvo4yq",
                                    "score": 2,
                                    "created_utc": 1641707643.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I also mentioned what I've seen locally in my area talking to pot and sugarbabies who have no idea this sub exists. Their stories mirror what I read in here in spite of the fact these ladies I've spoken to don't come here.   \n\n\nSo we both have our experiences offline in the real world. Let's leave it at that.",
            "author": "southernslick",
            "id": "hrxd77s",
            "parent_id": "t1_hrxcol4",
            "score": 7,
            "created_utc": 1641743852.0,
            "replies": []
        },
        {
            "body": "agreed 🙌",
            "author": "glamour_doll",
            "id": "hruenb5",
            "parent_id": "t1_hrueebo",
            "score": 6,
            "created_utc": 1641686139.0,
            "replies": []
        },
        {
            "body": "Because on Hinge and Bumble there is no way to filter by wealth or income.\n\nAt least on SD it's safe to assume at least some of the guys there are wealthy and the ones that are are there even though they presume they'll have to pay.\n\nI have had at least 10 girls in the past year alone tell me they use Seeking to meet rich guys, not necessarily to sugar",
            "author": "gangsta_baby",
            "id": "hrwrx8h",
            "parent_id": "t1_hrw8djs",
            "score": 4,
            "created_utc": 1641734036.0,
            "replies": [
                {
                    "body": "Honestly it’s funny because even with the income listed on most SD profiles their level of wealth doesn’t mean they’re generous or would be willing to do luxurious things.",
                    "author": "No-Letterhead5328",
                    "id": "hrxzep5",
                    "parent_id": "t1_hrwrx8h",
                    "score": 4,
                    "created_utc": 1641752185.0,
                    "replies": [
                        {
                            "body": "We know.\n\nBut that is irrelevant to why women go to the site to find rich guys. The probability is just higher there than on regular dating sites to find a 'richer' guy than most.\n\nOn regular dating sites there is literally no way to determine that, or filter for wealth. Also putting 'I only want a wealthy man' on a regular dating site isn't really going to make you any friends. It'll turn off the 'regulars' and the rich guys among them will probably see it as a red flag.\n\nSo the other reason is that they can be explicit about what they want (even if they have to wade through a bunch of bullshit and scammers to get it)",
                            "author": "gangsta_baby",
                            "id": "hrypxb4",
                            "parent_id": "t1_hrxzep5",
                            "score": 0,
                            "created_utc": 1641761493.0,
                            "replies": [
                                {
                                    "body": "I was agreeing with you lol. I was just pointing out that it’s not always what it seems for some people and adding onto what you said.",
                                    "author": "No-Letterhead5328",
                                    "id": "hs3enpr",
                                    "parent_id": "t1_hrypxb4",
                                    "score": 2,
                                    "created_utc": 1641838830.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I don’t know, why don’t you ask them why they’re on seeking. But I can only guess because there’s more millionaires on seeking than any other dating site :)\n\nAlso, don’t you think most of these girls are also on hinge or bumble? I can’t tell you how many seeking girls I also see on the vanilla dating apps.",
            "author": null,
            "id": "hrxeamg",
            "parent_id": "t1_hrw8djs",
            "score": 1,
            "created_utc": 1641744270.0,
            "replies": []
        },
        {
            "body": "\\>Why won’t these girls just go on hinge or bumble then?\n\nThat's inefficient, the whole point of SAS is that these guys are paying for a membership and that works as a filter.\n\nThere's no broke bros in SA as you need at least $100 to play but mountains of those guys are all over hinge/tinder/bumble.",
            "author": "No-Hat5902",
            "id": "hryt6u3",
            "parent_id": "t1_hrw8djs",
            "score": 0,
            "created_utc": 1641762638.0,
            "replies": []
        },
        {
            "body": "It’s not BS by the way. At least not in Europe…",
            "author": null,
            "id": "hrx2tii",
            "parent_id": "t1_hrw8djs",
            "score": 1,
            "created_utc": 1641739562.0,
            "replies": []
        },
        {
            "body": "I still talk and casually see 3 of them. The other 3 it didn’t work out with or I decided not to see them again.",
            "author": null,
            "id": "hrul6ll",
            "parent_id": "t1_hrukacl",
            "score": -3,
            "created_utc": 1641688855.0,
            "replies": []
        },
        {
            "body": "You’re deluding yourself sir",
            "author": "Bbygirlxxxx",
            "id": "hrykypl",
            "parent_id": "t1_hrx2i71",
            "score": 4,
            "created_utc": 1641759756.0,
            "replies": [
                {
                    "body": "I’m just sharing my experience. Sorry.",
                    "author": null,
                    "id": "hs1b3fx",
                    "parent_id": "t1_hrykypl",
                    "score": 0,
                    "created_utc": 1641800482.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Oh yea I already expect downvotes whenever I say this lol.",
            "author": null,
            "id": "hrxe0oy",
            "parent_id": "t1_hrx2i71",
            "score": 3,
            "created_utc": 1641744162.0,
            "replies": []
        },
        {
            "body": "So true. Same with men who hate the guys paying for platonic dates, pics, online relationships etc. It ruins the balance",
            "author": "Hungboy6969420",
            "id": "huvki7y",
            "parent_id": "t1_hrx2i71",
            "score": 1,
            "created_utc": 1643564208.0,
            "replies": []
        },
        {
            "body": "Swipe app algorithms show you more of what you swipe right on.",
            "author": null,
            "id": "hrxqqoo",
            "parent_id": "t1_hrv00cu",
            "score": 2,
            "created_utc": 1641749001.0,
            "replies": []
        },
        {
            "body": "100%",
            "author": null,
            "id": "huvk8be",
            "parent_id": "t1_huvk3sf",
            "score": 1,
            "created_utc": 1643564105.0,
            "replies": [
                {
                    "body": "I met a woman recently off there who claimed to have been in multiple long term relationships with daddies without ever actually taking allowance/ppm. She just wanted to be around rich dudes who spoiled her and she could learn from. Pretty smart imo",
                    "author": "Hungboy6969420",
                    "id": "huvkefr",
                    "parent_id": "t1_huvk8be",
                    "score": 1,
                    "created_utc": 1643564168.0,
                    "replies": [
                        {
                            "body": "Im going out with a pretty latina today who told me she doesn’t want any money from me, she just wants to date a more established man. She said she was tired of all the tinder fuck boys just looking for sex.",
                            "author": null,
                            "id": "huvkzp6",
                            "parent_id": "t1_huvkefr",
                            "score": 1,
                            "created_utc": 1643564395.0,
                            "replies": [
                                {
                                    "body": "Ha that's almost exactly what this woman said too. \"I could hook up with a frat bro but that gets old, why not get something else outta having sex?\"",
                                    "author": "Hungboy6969420",
                                    "id": "huvl4bb",
                                    "parent_id": "t1_huvkzp6",
                                    "score": 1,
                                    "created_utc": 1643564442.0,
                                    "replies": [
                                        {
                                            "body": "Yep! I have a date next week with another young woman from SA, who said she likes older men and is looking for a relationship and no money. Works for me lol!",
                                            "author": null,
                                            "id": "huvm590",
                                            "parent_id": "t1_huvl4bb",
                                            "score": 1,
                                            "created_utc": 1643564835.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Don’t forget about the free drinks!!! Dems expensive 🥂",
            "author": "iwishyouwo0d",
            "id": "hrvojfx",
            "parent_id": "t1_hrvob8a",
            "score": 6,
            "created_utc": 1641706885.0,
            "replies": []
        },
        {
            "body": "So you’re saying sugar babies that require an allowance are prostitutes? Got it.",
            "author": "iwishyouwo0d",
            "id": "hrv2h84",
            "parent_id": "t1_hruydgt",
            "score": 8,
            "created_utc": 1641696237.0,
            "replies": []
        },
        {
            "body": "The girls that get it, get it. The ones that don’t, don’t.",
            "author": "iwishyouwo0d",
            "id": "hrvz0j3",
            "parent_id": "t1_hrvlrtd",
            "score": 7,
            "created_utc": 1641713277.0,
            "replies": [
                {
                    "body": "Not everyone has to think like you. To each their own.",
                    "author": "dtan777",
                    "id": "hrxl4ru",
                    "parent_id": "t1_hrvz0j3",
                    "score": 0,
                    "created_utc": 1641746885.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "She should be looking for Vanilla relationships since what she wants wouldn’t be considered sugar.",
            "author": "lenaanabelle",
            "id": "hrwi82y",
            "parent_id": "t1_hrvlrtd",
            "score": 6,
            "created_utc": 1641727696.0,
            "replies": [
                {
                    "body": "Yeah but how do you get to determine who belongs to SA or not. Everyone has the right to use it in whichever way they want. There are all kinds of mutually beneficial relationships, not just transactional ones.",
                    "author": "dtan777",
                    "id": "hrxl2b9",
                    "parent_id": "t1_hrwi82y",
                    "score": 0,
                    "created_utc": 1641746859.0,
                    "replies": [
                        {
                            "body": "Seeking is not a vanilla dating site.",
                            "author": "lenaanabelle",
                            "id": "hs8pim3",
                            "parent_id": "t1_hrxl2b9",
                            "score": 1,
                            "created_utc": 1641926790.0,
                            "replies": [
                                {
                                    "body": "Mutually beneficial does not equal transactional. Maybe you’re the one who doesn’t belong on sugar dating sites.",
                                    "author": "dtan777",
                                    "id": "hs9omrg",
                                    "parent_id": "t1_hs8pim3",
                                    "score": 1,
                                    "created_utc": 1641939698.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "No mutually beneficial doesn’t mean transactional, but the purpose of being in a mutually beneficial arrangement is because it’s not traditional.\n\nA guy buying you dinner is literally the bare minimum in traditional dating. Nothing wrong with it, but you can easily find that anywhere.",
                    "author": "lenaanabelle",
                    "id": "httwsqw",
                    "parent_id": "t1_hrwi82y",
                    "score": 1,
                    "created_utc": 1642906867.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I don't think you appreciate that on seeking (here in Europe at least) there are women who are not 'traditional SBs' looking for allowances...some just want a bit of pampering or to meet a stable intelligent (preferably good looking, or at least not fat and ugly) guy that may be alot older than them without ppms or allowances. I've met trad SBs AND these girls, they both exist. It's a wide world out there.",
            "author": null,
            "id": "hs1muse",
            "parent_id": "t1_hs03abd",
            "score": 0,
            "created_utc": 1641809083.0,
            "replies": [
                {
                    "body": "why should I appreciate that?? European or not?",
                    "author": "panda_person666",
                    "id": "hs3owr3",
                    "parent_id": "t1_hs1muse",
                    "score": 2,
                    "created_utc": 1641842535.0,
                    "replies": [
                        {
                            "body": "Appreciate as in ‘understand’. Anyway It’s just how it is over here. FYI.",
                            "author": null,
                            "id": "hs3tvur",
                            "parent_id": "t1_hs3owr3",
                            "score": 1,
                            "created_utc": 1641844359.0,
                            "replies": [
                                {
                                    "body": "then \"appreciate\" that isn't really how it is over here xD",
                                    "author": "panda_person666",
                                    "id": "hs4npfc",
                                    "parent_id": "t1_hs3tvur",
                                    "score": 1,
                                    "created_utc": 1641855519.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "> yea makes sense. the same way I don't want to be kissed or touched when you only bought me dinner.\n\nI’m not talking about buying dinner. I’m talking about in a sugar relationship both sides need to be clear about their intentions. Too many aspiring SBs, not necessarily you, aren’t. And because they can’t be clear, honest and reliable, they just don’t get what they want.\n\nIt’s no different than an SD not being reliable and consistent for her.\n\nIf your sugar dates only boil down to dinners, you may be doing it wrong.",
            "author": "gangsta_baby",
            "id": "hs0rgw2",
            "parent_id": "t1_hs02gbc",
            "score": 0,
            "created_utc": 1641790053.0,
            "replies": [
                {
                    "body": "bruh. I know YOU aren't. I was making a comparison. You said you have 0 tolerance for girls who want money for platonic dates or no sex. I am saying I understand. it's like how I have zero tolerance for someone who wants to do stuff like foreplay on the first date but not give me anything in return really. Yea... I know many aren't why exactly are you telling me this? I am so lost as to what your point even is. Why are you even bringing any of this up. I never asked and it's not even related to what I commented about. All I said was that I have moved my age range up since most under 45 try to pull being cheap. not all but most. \n\nI'm not doing anything wrong?? I am talking about the M & G. Literally what are you talking about and why even??",
                    "author": "panda_person666",
                    "id": "hs10qe3",
                    "parent_id": "t1_hs0rgw2",
                    "score": 2,
                    "created_utc": 1641794263.0,
                    "replies": [
                        {
                            "body": "I’m not a Bruh I’m a Bro! j/k",
                            "author": "gangsta_baby",
                            "id": "hs14iin",
                            "parent_id": "t1_hs10qe3",
                            "score": 1,
                            "created_utc": 1641796400.0,
                            "replies": [
                                {
                                    "body": "nice not responding to my calling ya out",
                                    "author": "panda_person666",
                                    "id": "hs3m60h",
                                    "parent_id": "t1_hs14iin",
                                    "score": 2,
                                    "created_utc": 1641841542.0,
                                    "replies": [
                                        {
                                            "body": "What am I responding to you made a great point so I stopped. :-)",
                                            "author": "gangsta_baby",
                                            "id": "hs3ocu1",
                                            "parent_id": "t1_hs3m60h",
                                            "score": 1,
                                            "created_utc": 1641842336.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "have you seen Seeking's advertising over the last year?\n\nif someone comes to the site as a result of Seeking's ads, they will have no idea that it is a sugar dating site.\n\n>asking if I’m looking for someone to be financially responsible for me\n\nsounds like he was worried that you might want him to fund your entire life, not just provide some extra support.",
            "author": "joc13",
            "id": "hrvnb5v",
            "parent_id": "t1_hrvjftd",
            "score": -2,
            "created_utc": 1641706211.0,
            "replies": [
                {
                    "body": "It’s calling seeking ARRANGEMENT sir. Real sugar babies are not amused by Splenda or salt daddies.",
                    "author": null,
                    "id": "hrvo4yq",
                    "parent_id": "t1_hrvnb5v",
                    "score": 7,
                    "created_utc": 1641706661.0,
                    "replies": [
                        {
                            "body": "no, the site is just called Seeking now. the word arrangement does not appear in their advertising anywhere and given the FWB tag being replaced with Friends, I'd be surprised if the word arrangement is used anywhere on the site any more.\n\n>Real sugar babies are not amused by Splenda or salt daddies.\n\nI don't disagree with you there at all, just like Real SD™️s are not amused by women wanting to date platonically (with or without an allowance) or date with the intention of getting married. but, the advertising aimed at women just says \"upgrade your dating life\" so they have no idea what sugar dating is all about.",
                            "author": "joc13",
                            "id": "hrvpvtn",
                            "parent_id": "t1_hrvo4yq",
                            "score": 2,
                            "created_utc": 1641707643.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Honestly it’s funny because even with the income listed on most SD profiles their level of wealth doesn’t mean they’re generous or would be willing to do luxurious things.",
            "author": "No-Letterhead5328",
            "id": "hrxzep5",
            "parent_id": "t1_hrwrx8h",
            "score": 4,
            "created_utc": 1641752185.0,
            "replies": [
                {
                    "body": "We know.\n\nBut that is irrelevant to why women go to the site to find rich guys. The probability is just higher there than on regular dating sites to find a 'richer' guy than most.\n\nOn regular dating sites there is literally no way to determine that, or filter for wealth. Also putting 'I only want a wealthy man' on a regular dating site isn't really going to make you any friends. It'll turn off the 'regulars' and the rich guys among them will probably see it as a red flag.\n\nSo the other reason is that they can be explicit about what they want (even if they have to wade through a bunch of bullshit and scammers to get it)",
                    "author": "gangsta_baby",
                    "id": "hrypxb4",
                    "parent_id": "t1_hrxzep5",
                    "score": 0,
                    "created_utc": 1641761493.0,
                    "replies": [
                        {
                            "body": "I was agreeing with you lol. I was just pointing out that it’s not always what it seems for some people and adding onto what you said.",
                            "author": "No-Letterhead5328",
                            "id": "hs3enpr",
                            "parent_id": "t1_hrypxb4",
                            "score": 2,
                            "created_utc": 1641838830.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I’m just sharing my experience. Sorry.",
            "author": null,
            "id": "hs1b3fx",
            "parent_id": "t1_hrykypl",
            "score": 0,
            "created_utc": 1641800482.0,
            "replies": []
        },
        {
            "body": "I met a woman recently off there who claimed to have been in multiple long term relationships with daddies without ever actually taking allowance/ppm. She just wanted to be around rich dudes who spoiled her and she could learn from. Pretty smart imo",
            "author": "Hungboy6969420",
            "id": "huvkefr",
            "parent_id": "t1_huvk8be",
            "score": 1,
            "created_utc": 1643564168.0,
            "replies": [
                {
                    "body": "Im going out with a pretty latina today who told me she doesn’t want any money from me, she just wants to date a more established man. She said she was tired of all the tinder fuck boys just looking for sex.",
                    "author": null,
                    "id": "huvkzp6",
                    "parent_id": "t1_huvkefr",
                    "score": 1,
                    "created_utc": 1643564395.0,
                    "replies": [
                        {
                            "body": "Ha that's almost exactly what this woman said too. \"I could hook up with a frat bro but that gets old, why not get something else outta having sex?\"",
                            "author": "Hungboy6969420",
                            "id": "huvl4bb",
                            "parent_id": "t1_huvkzp6",
                            "score": 1,
                            "created_utc": 1643564442.0,
                            "replies": [
                                {
                                    "body": "Yep! I have a date next week with another young woman from SA, who said she likes older men and is looking for a relationship and no money. Works for me lol!",
                                    "author": null,
                                    "id": "huvm590",
                                    "parent_id": "t1_huvl4bb",
                                    "score": 1,
                                    "created_utc": 1643564835.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Not everyone has to think like you. To each their own.",
            "author": "dtan777",
            "id": "hrxl4ru",
            "parent_id": "t1_hrvz0j3",
            "score": 0,
            "created_utc": 1641746885.0,
            "replies": []
        },
        {
            "body": "Yeah but how do you get to determine who belongs to SA or not. Everyone has the right to use it in whichever way they want. There are all kinds of mutually beneficial relationships, not just transactional ones.",
            "author": "dtan777",
            "id": "hrxl2b9",
            "parent_id": "t1_hrwi82y",
            "score": 0,
            "created_utc": 1641746859.0,
            "replies": [
                {
                    "body": "Seeking is not a vanilla dating site.",
                    "author": "lenaanabelle",
                    "id": "hs8pim3",
                    "parent_id": "t1_hrxl2b9",
                    "score": 1,
                    "created_utc": 1641926790.0,
                    "replies": [
                        {
                            "body": "Mutually beneficial does not equal transactional. Maybe you’re the one who doesn’t belong on sugar dating sites.",
                            "author": "dtan777",
                            "id": "hs9omrg",
                            "parent_id": "t1_hs8pim3",
                            "score": 1,
                            "created_utc": 1641939698.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "No mutually beneficial doesn’t mean transactional, but the purpose of being in a mutually beneficial arrangement is because it’s not traditional.\n\nA guy buying you dinner is literally the bare minimum in traditional dating. Nothing wrong with it, but you can easily find that anywhere.",
            "author": "lenaanabelle",
            "id": "httwsqw",
            "parent_id": "t1_hrwi82y",
            "score": 1,
            "created_utc": 1642906867.0,
            "replies": []
        },
        {
            "body": "why should I appreciate that?? European or not?",
            "author": "panda_person666",
            "id": "hs3owr3",
            "parent_id": "t1_hs1muse",
            "score": 2,
            "created_utc": 1641842535.0,
            "replies": [
                {
                    "body": "Appreciate as in ‘understand’. Anyway It’s just how it is over here. FYI.",
                    "author": null,
                    "id": "hs3tvur",
                    "parent_id": "t1_hs3owr3",
                    "score": 1,
                    "created_utc": 1641844359.0,
                    "replies": [
                        {
                            "body": "then \"appreciate\" that isn't really how it is over here xD",
                            "author": "panda_person666",
                            "id": "hs4npfc",
                            "parent_id": "t1_hs3tvur",
                            "score": 1,
                            "created_utc": 1641855519.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "bruh. I know YOU aren't. I was making a comparison. You said you have 0 tolerance for girls who want money for platonic dates or no sex. I am saying I understand. it's like how I have zero tolerance for someone who wants to do stuff like foreplay on the first date but not give me anything in return really. Yea... I know many aren't why exactly are you telling me this? I am so lost as to what your point even is. Why are you even bringing any of this up. I never asked and it's not even related to what I commented about. All I said was that I have moved my age range up since most under 45 try to pull being cheap. not all but most. \n\nI'm not doing anything wrong?? I am talking about the M & G. Literally what are you talking about and why even??",
            "author": "panda_person666",
            "id": "hs10qe3",
            "parent_id": "t1_hs0rgw2",
            "score": 2,
            "created_utc": 1641794263.0,
            "replies": [
                {
                    "body": "I’m not a Bruh I’m a Bro! j/k",
                    "author": "gangsta_baby",
                    "id": "hs14iin",
                    "parent_id": "t1_hs10qe3",
                    "score": 1,
                    "created_utc": 1641796400.0,
                    "replies": [
                        {
                            "body": "nice not responding to my calling ya out",
                            "author": "panda_person666",
                            "id": "hs3m60h",
                            "parent_id": "t1_hs14iin",
                            "score": 2,
                            "created_utc": 1641841542.0,
                            "replies": [
                                {
                                    "body": "What am I responding to you made a great point so I stopped. :-)",
                                    "author": "gangsta_baby",
                                    "id": "hs3ocu1",
                                    "parent_id": "t1_hs3m60h",
                                    "score": 1,
                                    "created_utc": 1641842336.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "It’s calling seeking ARRANGEMENT sir. Real sugar babies are not amused by Splenda or salt daddies.",
            "author": null,
            "id": "hrvo4yq",
            "parent_id": "t1_hrvnb5v",
            "score": 7,
            "created_utc": 1641706661.0,
            "replies": [
                {
                    "body": "no, the site is just called Seeking now. the word arrangement does not appear in their advertising anywhere and given the FWB tag being replaced with Friends, I'd be surprised if the word arrangement is used anywhere on the site any more.\n\n>Real sugar babies are not amused by Splenda or salt daddies.\n\nI don't disagree with you there at all, just like Real SD™️s are not amused by women wanting to date platonically (with or without an allowance) or date with the intention of getting married. but, the advertising aimed at women just says \"upgrade your dating life\" so they have no idea what sugar dating is all about.",
                    "author": "joc13",
                    "id": "hrvpvtn",
                    "parent_id": "t1_hrvo4yq",
                    "score": 2,
                    "created_utc": 1641707643.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "We know.\n\nBut that is irrelevant to why women go to the site to find rich guys. The probability is just higher there than on regular dating sites to find a 'richer' guy than most.\n\nOn regular dating sites there is literally no way to determine that, or filter for wealth. Also putting 'I only want a wealthy man' on a regular dating site isn't really going to make you any friends. It'll turn off the 'regulars' and the rich guys among them will probably see it as a red flag.\n\nSo the other reason is that they can be explicit about what they want (even if they have to wade through a bunch of bullshit and scammers to get it)",
            "author": "gangsta_baby",
            "id": "hrypxb4",
            "parent_id": "t1_hrxzep5",
            "score": 0,
            "created_utc": 1641761493.0,
            "replies": [
                {
                    "body": "I was agreeing with you lol. I was just pointing out that it’s not always what it seems for some people and adding onto what you said.",
                    "author": "No-Letterhead5328",
                    "id": "hs3enpr",
                    "parent_id": "t1_hrypxb4",
                    "score": 2,
                    "created_utc": 1641838830.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Im going out with a pretty latina today who told me she doesn’t want any money from me, she just wants to date a more established man. She said she was tired of all the tinder fuck boys just looking for sex.",
            "author": null,
            "id": "huvkzp6",
            "parent_id": "t1_huvkefr",
            "score": 1,
            "created_utc": 1643564395.0,
            "replies": [
                {
                    "body": "Ha that's almost exactly what this woman said too. \"I could hook up with a frat bro but that gets old, why not get something else outta having sex?\"",
                    "author": "Hungboy6969420",
                    "id": "huvl4bb",
                    "parent_id": "t1_huvkzp6",
                    "score": 1,
                    "created_utc": 1643564442.0,
                    "replies": [
                        {
                            "body": "Yep! I have a date next week with another young woman from SA, who said she likes older men and is looking for a relationship and no money. Works for me lol!",
                            "author": null,
                            "id": "huvm590",
                            "parent_id": "t1_huvl4bb",
                            "score": 1,
                            "created_utc": 1643564835.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Seeking is not a vanilla dating site.",
            "author": "lenaanabelle",
            "id": "hs8pim3",
            "parent_id": "t1_hrxl2b9",
            "score": 1,
            "created_utc": 1641926790.0,
            "replies": [
                {
                    "body": "Mutually beneficial does not equal transactional. Maybe you’re the one who doesn’t belong on sugar dating sites.",
                    "author": "dtan777",
                    "id": "hs9omrg",
                    "parent_id": "t1_hs8pim3",
                    "score": 1,
                    "created_utc": 1641939698.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Appreciate as in ‘understand’. Anyway It’s just how it is over here. FYI.",
            "author": null,
            "id": "hs3tvur",
            "parent_id": "t1_hs3owr3",
            "score": 1,
            "created_utc": 1641844359.0,
            "replies": [
                {
                    "body": "then \"appreciate\" that isn't really how it is over here xD",
                    "author": "panda_person666",
                    "id": "hs4npfc",
                    "parent_id": "t1_hs3tvur",
                    "score": 1,
                    "created_utc": 1641855519.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I’m not a Bruh I’m a Bro! j/k",
            "author": "gangsta_baby",
            "id": "hs14iin",
            "parent_id": "t1_hs10qe3",
            "score": 1,
            "created_utc": 1641796400.0,
            "replies": [
                {
                    "body": "nice not responding to my calling ya out",
                    "author": "panda_person666",
                    "id": "hs3m60h",
                    "parent_id": "t1_hs14iin",
                    "score": 2,
                    "created_utc": 1641841542.0,
                    "replies": [
                        {
                            "body": "What am I responding to you made a great point so I stopped. :-)",
                            "author": "gangsta_baby",
                            "id": "hs3ocu1",
                            "parent_id": "t1_hs3m60h",
                            "score": 1,
                            "created_utc": 1641842336.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "no, the site is just called Seeking now. the word arrangement does not appear in their advertising anywhere and given the FWB tag being replaced with Friends, I'd be surprised if the word arrangement is used anywhere on the site any more.\n\n>Real sugar babies are not amused by Splenda or salt daddies.\n\nI don't disagree with you there at all, just like Real SD™️s are not amused by women wanting to date platonically (with or without an allowance) or date with the intention of getting married. but, the advertising aimed at women just says \"upgrade your dating life\" so they have no idea what sugar dating is all about.",
            "author": "joc13",
            "id": "hrvpvtn",
            "parent_id": "t1_hrvo4yq",
            "score": 2,
            "created_utc": 1641707643.0,
            "replies": []
        },
        {
            "body": "I was agreeing with you lol. I was just pointing out that it’s not always what it seems for some people and adding onto what you said.",
            "author": "No-Letterhead5328",
            "id": "hs3enpr",
            "parent_id": "t1_hrypxb4",
            "score": 2,
            "created_utc": 1641838830.0,
            "replies": []
        },
        {
            "body": "Ha that's almost exactly what this woman said too. \"I could hook up with a frat bro but that gets old, why not get something else outta having sex?\"",
            "author": "Hungboy6969420",
            "id": "huvl4bb",
            "parent_id": "t1_huvkzp6",
            "score": 1,
            "created_utc": 1643564442.0,
            "replies": [
                {
                    "body": "Yep! I have a date next week with another young woman from SA, who said she likes older men and is looking for a relationship and no money. Works for me lol!",
                    "author": null,
                    "id": "huvm590",
                    "parent_id": "t1_huvl4bb",
                    "score": 1,
                    "created_utc": 1643564835.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Mutually beneficial does not equal transactional. Maybe you’re the one who doesn’t belong on sugar dating sites.",
            "author": "dtan777",
            "id": "hs9omrg",
            "parent_id": "t1_hs8pim3",
            "score": 1,
            "created_utc": 1641939698.0,
            "replies": []
        },
        {
            "body": "then \"appreciate\" that isn't really how it is over here xD",
            "author": "panda_person666",
            "id": "hs4npfc",
            "parent_id": "t1_hs3tvur",
            "score": 1,
            "created_utc": 1641855519.0,
            "replies": []
        },
        {
            "body": "nice not responding to my calling ya out",
            "author": "panda_person666",
            "id": "hs3m60h",
            "parent_id": "t1_hs14iin",
            "score": 2,
            "created_utc": 1641841542.0,
            "replies": [
                {
                    "body": "What am I responding to you made a great point so I stopped. :-)",
                    "author": "gangsta_baby",
                    "id": "hs3ocu1",
                    "parent_id": "t1_hs3m60h",
                    "score": 1,
                    "created_utc": 1641842336.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yep! I have a date next week with another young woman from SA, who said she likes older men and is looking for a relationship and no money. Works for me lol!",
            "author": null,
            "id": "huvm590",
            "parent_id": "t1_huvl4bb",
            "score": 1,
            "created_utc": 1643564835.0,
            "replies": []
        },
        {
            "body": "What am I responding to you made a great point so I stopped. :-)",
            "author": "gangsta_baby",
            "id": "hs3ocu1",
            "parent_id": "t1_hs3m60h",
            "score": 1,
            "created_utc": 1641842336.0,
            "replies": []
        }
    ]
}