{
    "title": "Beware Secret Benefits from employee",
    "post_id": "n2mf23",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/n2mf23/beware_secret_benefits_from_employee/",
    "author": "Otherwise-Pen1730",
    "body": "I worked for them and I feel like hardworking men should know the truth. \n\nThey make fake profiles they use a company like cloudworkers https://www.cloudworkers.company/en to make profiles and message men. These are run by multiple men/women who are all over the world.\n\nThey send out fake profile views, fake favorites and fake messages - if you ask the member about it or if the member tries to tell you the conversation is instantly blocked meaning you’ve wasted credits. This happens about 80% of the time because the women try to be honest. \n\nThey can see EVERYTHING you send! They have a team of people who read every message sent they know someone is scamming you before you do they just don’t care \n\nThe verifications are often fake and mean nothing a lot of the time it’s not even the same person\n\nMany people who work for the site have online only or pic selling profiles this means the mostly African workers are scamming you both ways\n\nThe site is international to avoid regulations and rules such as age verification of minors. The site is flooded with underage girls who want to sell you feet pictures\n\nThe staff is 95% African, there are no background checks and they see and read all your info.\n\nIf you’ve ever bought credits on this site I highly suggest you get a refund. \n\nHerb and Stella are written by the same guy an unattractive married man who couldn’t get laid if his life depended on it and he’s definitely not a sugar daddy",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/n2mf23/beware_secret_benefits_from_employee/",
    "score": 110,
    "upvote_ratio": 0.95,
    "created_utc": 1619888427.0,
    "num_comments": 40,
    "links": [
        [
            "https://www.cloudworkers.company/en"
        ]
    ],
    "comments": [
        {
            "body": "It was quite apparent that they create fake profiles and messages. \n\nBut a warning about that site is always helpful so thank you!",
            "author": null,
            "id": "gwk7527",
            "parent_id": "t3_n2mf23",
            "score": 32,
            "created_utc": 1619888809.0,
            "replies": []
        },
        {
            "body": ">The staff is 95% African\n\nNot sure why you mention this, several times, as if it's a) relevant and b) inherently a bad thing. There are many legit, successful companies based in Africa (which fyi is a continent, not a country).",
            "author": "Dull_Palpitation_762",
            "id": "gwmgtas",
            "parent_id": "t3_n2mf23",
            "score": 17,
            "created_utc": 1619929080.0,
            "replies": [
                {
                    "body": "This ain't one of them",
                    "author": "No-Lake-9145",
                    "id": "j3yh8wi",
                    "parent_id": "t1_gwmgtas",
                    "score": 1,
                    "created_utc": 1673477484.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "After buying a second round of credits to give SB another try, I messaged their service link just to say that I wanted to support competition in this space, but the value proposition is not attractive.  I had spent around $200 to message a few profiles, read some messages and look at a few uninspiring private pictures.  I got 2 responses but neither had any chance of going anywhere.  Service didn't reply, but 300 credits appeared on my account.  I assumed that was their way to get me to keep visiting the site.  A few days later, both my previous payments were refunded and my account was closed.  No communication.  I\"m afraid Ashley Madison proved there is a big market for charging men for what appears to be a chance to meet women.  You don't even need actual women to sell the \"chance\".  I believe that is SB's business model.  If a few actual women also create profiles, all the better.  It just contributes to the perception of legitimacy.",
            "author": "NationalInspector511",
            "id": "gwka9hl",
            "parent_id": "t3_n2mf23",
            "score": 13,
            "created_utc": 1619890107.0,
            "replies": [
                {
                    "body": "I see you may have posted a number which is most likely an amount in relations to an arrangement. If this is the case, you are violating Rule #4 - \"No dollar amounts that are in reference to allowance/PPM are allowed.\"\n\nIf you are curious about Allowances reported by SLF contributors please see the [Allowance Master Thread 2020-2021](/r/sugarlifestyleforum/comments/ja37xt/allowance_master_thread_20202021/).\n\nYour post will not be approved until you remove the amount.  Please read the sub [Rules](/r/sugarlifestyleforum/comments/748zta/updated_and_clarified_rules_for_slf/) prior to posting anything else. \n\nIf you simply posted a number not referencing a monetary amount, please message the MODs to approve your post.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/sugarlifestyleforum) if you have any questions or concerns.*",
                    "author": "AutoModerator",
                    "id": "gwka9is",
                    "parent_id": "t1_gwka9hl",
                    "score": -2,
                    "created_utc": 1619890108.0,
                    "replies": []
                },
                {
                    "body": "Perhaps things have changed. I have had a few successful SR's in the last 2 years there. My current SR is coming up on a year, so I have not been active there at all for a while.  \nGood information regardless.",
                    "author": "KnottySexAcct",
                    "id": "gwlqg1g",
                    "parent_id": "t1_gwka9hl",
                    "score": 1,
                    "created_utc": 1619913605.0,
                    "replies": []
                },
                {
                    "body": "Why is seeking arrangements so successful??",
                    "author": "DarkandHandsome987",
                    "id": "gwmi86c",
                    "parent_id": "t1_gwka9hl",
                    "score": 1,
                    "created_utc": 1619929994.0,
                    "replies": [
                        {
                            "body": "I think it would be easy to come up with a better site from a technical perspective.  The barrier is getting enough members to make it a functional service.  I would gladly sign up as an early adopter for a well-designed service, knowing it would not be productive right away, if ever.  It's possible the sugaring population just isn't big enough to attract a serious competitor.  No site I'm aware of, including SA, is focused on helping POT's meet each other or creating a robust community.  They are all focused on maximizing short-term revenue from people who are TRYING to meet.  That means fake profiles, scammers, online only, platonics (all things that damage the community and make it harder for POT's to find each other) are beneficial to their business model.",
                            "author": "NationalInspector511",
                            "id": "gwozjlp",
                            "parent_id": "t1_gwmi86c",
                            "score": 3,
                            "created_utc": 1619979845.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Thanks for the warning. It's been said for years that they create fake profiles.  Their business model directly rewards such shenanigans, so I'm sure there's a strong motivation.  I figure even on SA, they are looking at all messages (or at least have the capability to do so).",
            "author": "Azurecole",
            "id": "gwk9rbx",
            "parent_id": "t3_n2mf23",
            "score": 6,
            "created_utc": 1619889900.0,
            "replies": [
                {
                    "body": "First thing I do on SA is tell the pot SB, let's switch to text for privacy.  Most people today realize apps give you 0 privacy.",
                    "author": "mollyflowers",
                    "id": "gwlczzi",
                    "parent_id": "t1_gwk9rbx",
                    "score": 2,
                    "created_utc": 1619906653.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "It’s pretty clear based on their pricing model that it’s full of shit. \n\nOn top of that, if you’ve made a dummy profile to check it out, the deluge of messages should also inform you that it’s a ruse. I still get messages on an account that I haven’t logged into for >1-2yrs.",
            "author": "sdthrowaway006",
            "id": "gwk9l3a",
            "parent_id": "t3_n2mf23",
            "score": 4,
            "created_utc": 1619889829.0,
            "replies": [
                {
                    "body": "Did you deactivate the account?  Or just not log in?",
                    "author": "jampot99",
                    "id": "hohjpcs",
                    "parent_id": "t1_gwk9l3a",
                    "score": 1,
                    "created_utc": 1639468258.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yes it's a lot of fake profiles on there. Similar to all the ladies from columbia finding and liking my profile on SA. I've linked up with ladies from Secret Benefits in the past. Afterwhile you quickly learn who are fake profiles and who are real.",
            "author": "southernslick",
            "id": "gwkcpfr",
            "parent_id": "t3_n2mf23",
            "score": 4,
            "created_utc": 1619891121.0,
            "replies": []
        },
        {
            "body": "Secret benefits screamed “scam” when their 1 karma Reddit accounts were spamming this sub with glowing recommendations last year \n\nNo thank you",
            "author": "KnocDown",
            "id": "gwm83sf",
            "parent_id": "t3_n2mf23",
            "score": 4,
            "created_utc": 1619923597.0,
            "replies": []
        },
        {
            "body": "That site looked like a total scam to me",
            "author": "UnearthlyDinosaur",
            "id": "gwkdamx",
            "parent_id": "t3_n2mf23",
            "score": 4,
            "created_utc": 1619891377.0,
            "replies": []
        },
        {
            "body": "Ive suspected sa does this too.  As much membership expires or just after I receive messages from pretty girls  and when I get sucked in and renew and respond get no response",
            "author": "wb19081908",
            "id": "gwlm3sl",
            "parent_id": "t3_n2mf23",
            "score": 2,
            "created_utc": 1619911244.0,
            "replies": [
                {
                    "body": "What is SA?",
                    "author": "Silver-Jacket",
                    "id": "ixj017e",
                    "parent_id": "t1_gwlm3sl",
                    "score": 1,
                    "created_utc": 1669234467.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Herb and Stella?",
            "author": "chamdigiri",
            "id": "gwluxzm",
            "parent_id": "t3_n2mf23",
            "score": 2,
            "created_utc": 1619916075.0,
            "replies": []
        },
        {
            "body": "Yes, wasted some money there. Keep sending messages using credits and get pretty close to zero returned messages.",
            "author": "Monte_Sailor",
            "id": "gwmdzgp",
            "parent_id": "t3_n2mf23",
            "score": 2,
            "created_utc": 1619927252.0,
            "replies": []
        },
        {
            "body": "After leaving a comment on here I try to sign into secret benefits and they have deleted my account with like $300 in credits on it this is terrible",
            "author": "Dense_Fishing6751",
            "id": "i2cd7rw",
            "parent_id": "t3_n2mf23",
            "score": 2,
            "created_utc": 1648405960.0,
            "replies": []
        },
        {
            "body": "Cautionary tale here for naive SDs who think with their dicks to be careful of such sites, scammers, sending pictures, getting on video calls etc.",
            "author": null,
            "id": "gwkn5u3",
            "parent_id": "t3_n2mf23",
            "score": 2,
            "created_utc": 1619895608.0,
            "replies": []
        },
        {
            "body": "I definitely know they create fake profiles. I busted them on it shortly after I joined. They claimed they didn't, of course, but offered to refund me the credits I had wasted on the fake profiles plus gave me 200 credits at no cost. Nowadays, I only deal with profiles that have a verification video, and so far none of them have seemed fake (yet).\n\n> They have a team of people who read every message sent\n\nThat seems like an absolute waste of money/resources. I can see reading someone's messages if they are accused or suspected of fraudulent activity, but all of *everyone's* messages? That's just moronic.\n\n> The site is flooded with underage girls who want to sell you feet pictures\n\nI've never encountered anyone remotely like that on the site. \n\n> The site is international to avoid regulations and rules such as age verification of minors.\n\nThat doesn't allow them to escape US trade laws that prohibit defrauding its citizens (which the creation of fake profiles is). I suspect if enough people report them to the FTC, things would change a bit.",
            "author": "Y_4Z44",
            "id": "gwk8wie",
            "parent_id": "t3_n2mf23",
            "score": 2,
            "created_utc": 1619889551.0,
            "replies": []
        },
        {
            "body": "I never had any good experiences from that site. Used credits and only got one date and that was average at best. The same goes for the sister site, [whatsyourprice.com](https://whatsyourprice.com) that one too is flaky but had better luck getting dates, but it costs for the date.",
            "author": "PotatoSquisher",
            "id": "gwkc3d9",
            "parent_id": "t3_n2mf23",
            "score": 0,
            "created_utc": 1619890865.0,
            "replies": []
        },
        {
            "body": "I had a disturbing incident today. I began communicating with an extremely beautiful young woman from Ashland, Oregon. She told me she was the boss and had to agree to her demands if I wanted to see her. She demanded I send her money and then a additional monthly stipend until she knew me well enough to be my sugar baby. I perceived she was scamming me. I told her I would give her a donation as soon as we met in a hotel room. She became incensed and said I was wasting her time. I told her that I thought she was trying to scam me. I doubted she was a beautiful young woman from Oregon but was probably an oil worker from Nigeria. She called me some names and cut off the conversation",
            "author": null,
            "id": "gwlx90e",
            "parent_id": "t3_n2mf23",
            "score": 0,
            "created_utc": 1619917372.0,
            "replies": [
                {
                    "body": "I see you may have posted a number which is most likely an amount in relations to an arrangement. If this is the case, you are violating Rule #4 - \"No dollar amounts that are in reference to allowance/PPM are allowed.\"\n\nIf you are curious about Allowances reported by SLF contributors please see the [Allowance Master Thread 2020-2021](/r/sugarlifestyleforum/comments/ja37xt/allowance_master_thread_20202021/).\n\nYour post will not be approved until you remove the amount.  Please read the sub [Rules](/r/sugarlifestyleforum/comments/748zta/updated_and_clarified_rules_for_slf/) prior to posting anything else. \n\nIf you simply posted a number not referencing a monetary amount, please message the MODs to approve your post.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/sugarlifestyleforum) if you have any questions or concerns.*",
                    "author": "AutoModerator",
                    "id": "gwlx91i",
                    "parent_id": "t1_gwlx90e",
                    "score": 1,
                    "created_utc": 1619917373.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Been on for a few weeks.   Had some successful meets.   Yes it full of fake profiles but no different in the end to the time wasters on sa.",
            "author": "brit-sd",
            "id": "gwkh73o",
            "parent_id": "t3_n2mf23",
            "score": -1,
            "created_utc": 1619892999.0,
            "replies": [
                {
                    "body": ">no different in the end\n\nI found it very different; fake profiles to a much much greater extent on SB.",
                    "author": null,
                    "id": "gwkk6s7",
                    "parent_id": "t1_gwkh73o",
                    "score": 4,
                    "created_utc": 1619894282.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I've seen few profiles on SB that also are on SA. The whole credit model is too much like Ashley Madison. One positive with Ashley Madison is that they will kick off the scammers and escorts.  Many credits came back with asking for them and also without asking.",
            "author": null,
            "id": "gwksnoo",
            "parent_id": "t3_n2mf23",
            "score": 1,
            "created_utc": 1619898089.0,
            "replies": []
        },
        {
            "body": "I'm 4 months into a SR that started from SB. 3 other M&G's that didn't pan out.  Maybe I just got lucky. Despite that success I've often wondered about the issues the OP is describing. Always been a fake vibe about that sight, but my early success there has kept me hanging in there. This info is the nudge I've needed. Deactivating asap.  Thanks!",
            "author": "CaptBrewster",
            "id": "gwm6mvp",
            "parent_id": "t3_n2mf23",
            "score": 1,
            "created_utc": 1619922735.0,
            "replies": []
        },
        {
            "body": "Do you think they take profiles that are inactive  (ie that have been deactivated by women) and periodically reactivate them without the women knowing?",
            "author": "jampot99",
            "id": "hohjfgj",
            "parent_id": "t3_n2mf23",
            "score": 1,
            "created_utc": 1639468050.0,
            "replies": [
                {
                    "body": "100% also If a member reports someone or if they’ve asked someone if their first message was fake or auto sent they block you from that person so they look deactivated. People think they’re giving them free credits to be nice but it’s because they’re a well known scam site with very low real profiles even the verified ones are often scams or people with multiple profiles. Sure there are a few people who will have success but generally that’s the guys into escorts or that are ok with the pic selling scams",
                    "author": "Otherwise-Pen1730",
                    "id": "hr0rlh1",
                    "parent_id": "t1_hohjfgj",
                    "score": 2,
                    "created_utc": 1641177242.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "If you can't bring them home to the kids, what's the point? 🤣",
            "author": "TCEffectrix",
            "id": "huizcv9",
            "parent_id": "t3_n2mf23",
            "score": 1,
            "created_utc": 1643335964.0,
            "replies": []
        },
        {
            "body": "bullshit op post. the website isnt from africa but cyprus.\n\nand half the profiles have vids where girls say \"let me be your secret\" ignore the op writer.",
            "author": "FossilFuelsss",
            "id": "i095cwq",
            "parent_id": "t3_n2mf23",
            "score": 1,
            "created_utc": 1647014518.0,
            "replies": []
        },
        {
            "body": "Yes I have you secret benefits also and it is a scam a lot of women I see on here in Buffalo I see walking the streets of Broadway as prostitutes two of them which I seen on here have HIV and are prostituting themselves in Buffalo this site is disgusting and it should be shut down I'm currently looking for a lawyer to try to Sue this company actually",
            "author": "Dense_Fishing6751",
            "id": "i2ccpvm",
            "parent_id": "t3_n2mf23",
            "score": 1,
            "created_utc": 1648405763.0,
            "replies": [
                {
                    "body": "Sooo you got HIV from a SB huh?",
                    "author": "Ram_Duro-5866",
                    "id": "j7d8pox",
                    "parent_id": "t1_i2ccpvm",
                    "score": 1,
                    "created_utc": 1675637840.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Sad but true.  Was on [Seeking.com](https://Seeking.com) for about 3 years and went on dates with 55 women.  52 of those were \"successful and satisfying dates\" (Sorry I suck).  I spoke with hundreds of women and got hundreds of phone numbers.  [Seeking.com](https://Seeking.com) is 100% legit.   \n\n\nBeen on [secretbenefits.com](https://secretbenefits.com) for about a year and have been suckered into paying $200 so far and haven't even had 1 person respond to over 100 \"hey theres\"   \n\n\n[Secretbenefits.com](https://Secretbenefits.com) is a scam.",
            "author": "Shot-Mixture9685",
            "id": "id8be2u",
            "parent_id": "t3_n2mf23",
            "score": 1,
            "created_utc": 1655847943.0,
            "replies": []
        },
        {
            "body": "Based on my experience all of the sites are the same as far as fake profiles go and if anyone is told they need a safe dating pass, such as CMA or the likes. Forget it these are all fake too, and if you start with a safe dating pass you'll regret it, they're designed to just keep going and going",
            "author": "Designer_Profile9269",
            "id": "ipsdaem",
            "parent_id": "t3_n2mf23",
            "score": 1,
            "created_utc": 1664069127.0,
            "replies": []
        },
        {
            "body": "I caught them a few days ago. A \"verified\" pot account messaged me and so forth but there's no verification video. Four minutes later I EXACT SAME pot messages me with the exact same photos and NOW with video. 🤦🏽",
            "author": "hindupornstar",
            "id": "iw6thli",
            "parent_id": "t3_n2mf23",
            "score": 1,
            "created_utc": 1668340772.0,
            "replies": []
        },
        {
            "body": "The difference in this site and others is they use a credit system instead of selling a monthly membership like seeking does.  Then it is to there benefit for you to run out of credits as soon as possible so you’ll buy more.  This site is such a scam that they created an additional site called sugardaddy.com which is the exact same site with the same members.  So if you see a girl with two profiles that’s why, but if you use credits to unlock a conversation with her off of one profile a lot of times you’ll get no response and then a couple days later you’ll get a message from her other profile and will have to spend more credits to read it.  I emailed them about it and got a 1000 credits when I called them out on it because the only purpose of the extra site is too make you burn more credits to talk to the same girls.  Then it also decreases your chances of actually meeting them so as long as you are only almost meeting girls and never finding a relationship you’ll keep buying credits.  I will say that I have hooked up with maybe 25-30 girls off the site but that took a lot of credits and the skill of being able to pick out the few real girls in the ocean of fakes.",
            "author": "Serious_Performer_41",
            "id": "iz91h0u",
            "parent_id": "t3_n2mf23",
            "score": 1,
            "created_utc": 1670410772.0,
            "replies": []
        },
        {
            "body": "This ain't one of them",
            "author": "No-Lake-9145",
            "id": "j3yh8wi",
            "parent_id": "t1_gwmgtas",
            "score": 1,
            "created_utc": 1673477484.0,
            "replies": []
        },
        {
            "body": "I see you may have posted a number which is most likely an amount in relations to an arrangement. If this is the case, you are violating Rule #4 - \"No dollar amounts that are in reference to allowance/PPM are allowed.\"\n\nIf you are curious about Allowances reported by SLF contributors please see the [Allowance Master Thread 2020-2021](/r/sugarlifestyleforum/comments/ja37xt/allowance_master_thread_20202021/).\n\nYour post will not be approved until you remove the amount.  Please read the sub [Rules](/r/sugarlifestyleforum/comments/748zta/updated_and_clarified_rules_for_slf/) prior to posting anything else. \n\nIf you simply posted a number not referencing a monetary amount, please message the MODs to approve your post.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/sugarlifestyleforum) if you have any questions or concerns.*",
            "author": "AutoModerator",
            "id": "gwka9is",
            "parent_id": "t1_gwka9hl",
            "score": -2,
            "created_utc": 1619890108.0,
            "replies": []
        },
        {
            "body": "Perhaps things have changed. I have had a few successful SR's in the last 2 years there. My current SR is coming up on a year, so I have not been active there at all for a while.  \nGood information regardless.",
            "author": "KnottySexAcct",
            "id": "gwlqg1g",
            "parent_id": "t1_gwka9hl",
            "score": 1,
            "created_utc": 1619913605.0,
            "replies": []
        },
        {
            "body": "Why is seeking arrangements so successful??",
            "author": "DarkandHandsome987",
            "id": "gwmi86c",
            "parent_id": "t1_gwka9hl",
            "score": 1,
            "created_utc": 1619929994.0,
            "replies": [
                {
                    "body": "I think it would be easy to come up with a better site from a technical perspective.  The barrier is getting enough members to make it a functional service.  I would gladly sign up as an early adopter for a well-designed service, knowing it would not be productive right away, if ever.  It's possible the sugaring population just isn't big enough to attract a serious competitor.  No site I'm aware of, including SA, is focused on helping POT's meet each other or creating a robust community.  They are all focused on maximizing short-term revenue from people who are TRYING to meet.  That means fake profiles, scammers, online only, platonics (all things that damage the community and make it harder for POT's to find each other) are beneficial to their business model.",
                    "author": "NationalInspector511",
                    "id": "gwozjlp",
                    "parent_id": "t1_gwmi86c",
                    "score": 3,
                    "created_utc": 1619979845.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "First thing I do on SA is tell the pot SB, let's switch to text for privacy.  Most people today realize apps give you 0 privacy.",
            "author": "mollyflowers",
            "id": "gwlczzi",
            "parent_id": "t1_gwk9rbx",
            "score": 2,
            "created_utc": 1619906653.0,
            "replies": []
        },
        {
            "body": "Did you deactivate the account?  Or just not log in?",
            "author": "jampot99",
            "id": "hohjpcs",
            "parent_id": "t1_gwk9l3a",
            "score": 1,
            "created_utc": 1639468258.0,
            "replies": []
        },
        {
            "body": "What is SA?",
            "author": "Silver-Jacket",
            "id": "ixj017e",
            "parent_id": "t1_gwlm3sl",
            "score": 1,
            "created_utc": 1669234467.0,
            "replies": []
        },
        {
            "body": "I see you may have posted a number which is most likely an amount in relations to an arrangement. If this is the case, you are violating Rule #4 - \"No dollar amounts that are in reference to allowance/PPM are allowed.\"\n\nIf you are curious about Allowances reported by SLF contributors please see the [Allowance Master Thread 2020-2021](/r/sugarlifestyleforum/comments/ja37xt/allowance_master_thread_20202021/).\n\nYour post will not be approved until you remove the amount.  Please read the sub [Rules](/r/sugarlifestyleforum/comments/748zta/updated_and_clarified_rules_for_slf/) prior to posting anything else. \n\nIf you simply posted a number not referencing a monetary amount, please message the MODs to approve your post.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/sugarlifestyleforum) if you have any questions or concerns.*",
            "author": "AutoModerator",
            "id": "gwlx91i",
            "parent_id": "t1_gwlx90e",
            "score": 1,
            "created_utc": 1619917373.0,
            "replies": []
        },
        {
            "body": ">no different in the end\n\nI found it very different; fake profiles to a much much greater extent on SB.",
            "author": null,
            "id": "gwkk6s7",
            "parent_id": "t1_gwkh73o",
            "score": 4,
            "created_utc": 1619894282.0,
            "replies": []
        },
        {
            "body": "100% also If a member reports someone or if they’ve asked someone if their first message was fake or auto sent they block you from that person so they look deactivated. People think they’re giving them free credits to be nice but it’s because they’re a well known scam site with very low real profiles even the verified ones are often scams or people with multiple profiles. Sure there are a few people who will have success but generally that’s the guys into escorts or that are ok with the pic selling scams",
            "author": "Otherwise-Pen1730",
            "id": "hr0rlh1",
            "parent_id": "t1_hohjfgj",
            "score": 2,
            "created_utc": 1641177242.0,
            "replies": []
        },
        {
            "body": "Sooo you got HIV from a SB huh?",
            "author": "Ram_Duro-5866",
            "id": "j7d8pox",
            "parent_id": "t1_i2ccpvm",
            "score": 1,
            "created_utc": 1675637840.0,
            "replies": []
        },
        {
            "body": "I think it would be easy to come up with a better site from a technical perspective.  The barrier is getting enough members to make it a functional service.  I would gladly sign up as an early adopter for a well-designed service, knowing it would not be productive right away, if ever.  It's possible the sugaring population just isn't big enough to attract a serious competitor.  No site I'm aware of, including SA, is focused on helping POT's meet each other or creating a robust community.  They are all focused on maximizing short-term revenue from people who are TRYING to meet.  That means fake profiles, scammers, online only, platonics (all things that damage the community and make it harder for POT's to find each other) are beneficial to their business model.",
            "author": "NationalInspector511",
            "id": "gwozjlp",
            "parent_id": "t1_gwmi86c",
            "score": 3,
            "created_utc": 1619979845.0,
            "replies": []
        }
    ]
}