{
    "title": "SLF and important SB topics & issues",
    "post_id": "mblyoy",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/mblyoy/slf_and_important_sb_topics_issues/",
    "author": "Azurecole",
    "body": "Hello slf!  the mods would like to address a topic of importance to every single  one of us, SB safety and other women's issues in the bowl.  Lately,  these topics have been driven by non-SBs, and have been framed in toxic ways through a gender war lens, in a way that guarantees divisiveness and anger.  It's a shame,  these are  topics that we are all pretty much agreed upon regardless of gender, or present a great opportunity for education.   There's a narrative being constructed that these non-SBs are being  banned from slf because of their posting on women's topics.  Instead,  they are leaving a long trail of toxicity that gets them banned for violations of  rule 1, 12, 14, and especially 9.  Yesterday's poster, after leaving a  long trail of gender hostility, was specifically banned for saying all  SDs need therapy and are psychopaths on a completely different thread, just the final straw (fyi, I  automatically ban redpillers as well, which is why SBs rarely see such posts on slf; those guys don't like me either, they just raise less of a fuss :)\n\nslf is for sugar.  If you believe \"sugar is just escorting with a  different rate\", you probably don't belong here, and won't be allowed to bring your views or attitude here.  There  are lots of other subs where you can express your views with like-minded folks.  If you believe sugar is NOT  just escorting with a different rate, you may belong here (yes,  even if you're an escort -- if you're an SB, you're an SB, regardless of  what else you do).\n\nI -- and all the mods -- want to invite SBs to discuss your issues here. While  all topics will and should generate discussion, questions, debate, and  *respectful disagreement*, we plan to more aggressively ensure there's no  dogpiling or other counterproductive behavior on threads on women's  topics written by actual **SBs** .  I would like to also  personally ask SDs that, when something comes up like an SB describing  an act as rape, you re-consider commenting about whether that particular act  technically falls under the legal definition of rape in your state -- that is  usually not the point that SB is making, and the fact is, we all agree  that acts like stealthing and not giving the PPM are traumatic, unethical, and  unacceptable violations of consent.\n\nSLF's SBs have made me a better SD, and I've seen just today SBs  saying the same thing about SLF's SDs.  Our strength is that have both  SBs and SDs here.  Let's drive out toxic elements who are not really  part of our community, and put in extra effort (I'll put myself at the  front of the line for that) into understanding each other, even if we  don't agree on everything",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/mblyoy/slf_and_important_sb_topics_issues/",
    "score": 188,
    "upvote_ratio": 0.95,
    "created_utc": 1616525935.0,
    "num_comments": 86,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "[deleted]",
            "author": null,
            "id": "grz1y08",
            "parent_id": "t3_mblyoy",
            "score": 65,
            "created_utc": 1616532809.0,
            "replies": [
                {
                    "body": "Thank you for putting this into words like this. Please don’t get off your soapbox. I mean, when you need to please do, we all need to eat and sleep. But, I really appreciate your presence here.",
                    "author": "buttery_bees",
                    "id": "grzyy37",
                    "parent_id": "t1_grz1y08",
                    "score": 12,
                    "created_utc": 1616548645.0,
                    "replies": []
                },
                {
                    "body": "Great analogy, couldn’t agree more.",
                    "author": null,
                    "id": "grz2tms",
                    "parent_id": "t1_grz1y08",
                    "score": 13,
                    "created_utc": 1616533185.0,
                    "replies": []
                },
                {
                    "body": "You are right. This forum is a great place for people with different viewpoints to discuss things together. The point isn’t what you technically  call xxxx rather that the act is wrong and makes someone feel violated. Tricking someone out of a PPM and stealthing are both behaviors that are inexcusable and should not be tolerated. We can listen and provide support if that’s what is wanted. We can, and have also, come up with guidelines. It’s helpful not to lump everyone into the same group, not consider all men to have the same views nor all women to have the same motives.",
                    "author": "daddoms",
                    "id": "grz3qtq",
                    "parent_id": "t1_grz1y08",
                    "score": 8,
                    "created_utc": 1616533585.0,
                    "replies": []
                },
                {
                    "body": "I love this!",
                    "author": "whatwouldjunedo",
                    "id": "grzd965",
                    "parent_id": "t1_grz1y08",
                    "score": 2,
                    "created_utc": 1616537791.0,
                    "replies": []
                },
                {
                    "body": "Lululemon offers free repairs for rips and holes.",
                    "author": "uniballSD",
                    "id": "grzfxoj",
                    "parent_id": "t1_grz1y08",
                    "score": 0,
                    "created_utc": 1616539052.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I like this post. I love men when they’re amazing, but some men can be very arrogant and toxic, equating women to a commodity to be bought and sold!?\n\nIt’s the tired old “women in the bowl....it’s a marketplace...supply and demand” analogy. \n\nOr you know...just consider women to be humans, and that the only people who buy and sell humans are slave owners?!!",
            "author": "whatwouldjunedo",
            "id": "grzdysv",
            "parent_id": "t3_mblyoy",
            "score": 23,
            "created_utc": 1616538126.0,
            "replies": [
                {
                    "body": "I am really, almost obsessively averse to using business metaphors in the bowl.  Not just \"marketplace\" and \"supply and demand\", but \"payments\" and other business and service-oriented concepts.  \n\nSome are clearly just people not sure what words to use, and grabbing on to whatever seems closest.  But calling SDs \"clients\" (as is common on the sexworker subs), or talking about \"market rates\".  I'd prefer we kept to relationship terms and concepts when possible, I think it captures the spirit of what an SR is better",
                    "author": "Azurecole",
                    "id": "grzex2b",
                    "parent_id": "t1_grzdysv",
                    "score": 21,
                    "created_utc": 1616538571.0,
                    "replies": [
                        {
                            "body": "I second this. Just yesterday some man referred to an SBs \"market value.\" Disgusted.",
                            "author": "viewfrom61",
                            "id": "gs01bej",
                            "parent_id": "t1_grzex2b",
                            "score": 8,
                            "created_utc": 1616549888.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Well, here goes my two cents; I think we're dealing with three issues, and yet nobody wants to discuss them.  The first is women and men are different.  We process information differently; therefore, It's bound to be some hurt feelings and misunderstandings.  Secondly, there is a generational gap, and our vocabulary has changed drastically within the last four years. It's hard to communicate without offending anyone. At the same time, we can understand what is being said.  Thirdly, some things just get lost in translation, from your brain to the paper.  Let's face it, we Americans aren't winning any high marks in English anymore.  I don't think this is the forum for expressing devasting events simply because it's not a visual medium.",
                    "author": "Darknlovely38",
                    "id": "h54dy18",
                    "parent_id": "t1_grzdysv",
                    "score": 1,
                    "created_utc": 1626238436.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "This is such a good reminder that people can differing opinions without being evil. And that people can disagree without name calling or insults.",
            "author": "OldschoolSD",
            "id": "grz5vsw",
            "parent_id": "t3_mblyoy",
            "score": 13,
            "created_utc": 1616534519.0,
            "replies": []
        },
        {
            "body": "Thank god for the notice about the quibbling over whether a violating act is “technically/legally” considered rape, that would only really ever matter when filing police reports yet is *somehow* constantly brought up in order to prove that someone’s post can’t be “all that bad.” I’m tired of seeing a majority of responses to one SB’s threads about a traumatic encounter being all about how the poor SD must have somehow been mistaken or the SB wasn’t being clear or was leading the poor man on. Leaves me more than a little skeptical that “we” of SLF actually all agree on some of these core gender and morality issues, but with that in mind, it’s good that instigators of conflict from either “side” are being dealt with and removed.",
            "author": "BunsGoSquish",
            "id": "grz0eke",
            "parent_id": "t3_mblyoy",
            "score": 25,
            "created_utc": 1616532140.0,
            "replies": [
                {
                    "body": "💯",
                    "author": "peachy731",
                    "id": "grzk5vb",
                    "parent_id": "t1_grz0eke",
                    "score": 5,
                    "created_utc": 1616541113.0,
                    "replies": []
                },
                {
                    "body": "I constantly express boundaries and tell SDs that I am not open to sexual acts (I have a bf). I have expressed this to several SDs and still been violated. Paying a woman for her time does not mean that she is obligated to do sexual things with you and it should never be portrayed as leaning the SD on. Just because we need money doesn’t mean we are willing to fuck every dude we meet for a date.",
                    "author": "puppyonshrooms",
                    "id": "gs0t49g",
                    "parent_id": "t1_grz0eke",
                    "score": 2,
                    "created_utc": 1616568263.0,
                    "replies": [
                        {
                            "body": "This is one of the reasons many people on this sub take a harsh view on platonic arrangements.  We all know there are a lot of bad actors (I'm not going to call them SDs) that will try to push (typically young/naïve) women into it - despite them being very clear about platonic from day 1.  I'm not saying platonic doesn't exist - but it's rare.  And many of the guys that go after platonic women have ulterior motives.  \n\nIt's a tough line between providing full support, but also trying to help the person unlearn the lies from tiktok and youtube - that are just likely to lead the person into a similar situation again.",
                            "author": "SDstartingOut",
                            "id": "gs1hboa",
                            "parent_id": "t1_gs0t49g",
                            "score": 4,
                            "created_utc": 1616589084.0,
                            "replies": [
                                {
                                    "body": "It will lead her back into that situation again because she doesn't know anything about men.  One thing for sure men has definitely changed since these SB/SD websites have popped up.  I'm sure I had some creeps in my life, but my experience with men was overwhelmingly positive.  I didn't have a problem with men trying to force me to do something I didn't want to do, and I still laid in the same bed with them.",
                                    "author": "Darknlovely38",
                                    "id": "h54kzbw",
                                    "parent_id": "t1_gs1hboa",
                                    "score": 1,
                                    "created_utc": 1626243836.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "I think this is because most guys, especially the young men under 50, see it as a quid pro quo, which means a favor or advantage granted or expected in return for something.  Let me ask you something, did any of your boyfriends expect a fuck after a date or two, and did you oblige? An S/D is supposed to be a boyfriend, but one who actually has money to put in your pocket!  Sweetheart, the only man who will give you money and don't want sex from you is your biological father.  By the way, your boyfriend is pimping you, if he's okay with you going out with men for money.",
                            "author": "Darknlovely38",
                            "id": "h54jowy",
                            "parent_id": "t1_gs0t49g",
                            "score": 1,
                            "created_utc": 1626242773.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "To ALL the Mods, thank you for this.",
            "author": "mraspencer",
            "id": "grypare",
            "parent_id": "t3_mblyoy",
            "score": 23,
            "created_utc": 1616527323.0,
            "replies": []
        },
        {
            "body": "Thank you!!!! I got pretty aggressive towards someone about the whole technical r*pe or not thing. Got a 2 week ban for it, which I understand I was being very mean 🤣 but I definitely don’t think that kind of discussion should be encouraged or allowed! Thanks again",
            "author": "ashes2asscheeks",
            "id": "gryy0j6",
            "parent_id": "t3_mblyoy",
            "score": 9,
            "created_utc": 1616531097.0,
            "replies": []
        },
        {
            "body": "Love this post. Very well stated.",
            "author": "MyBeautifulLife4Me",
            "id": "gryp70r",
            "parent_id": "t3_mblyoy",
            "score": 11,
            "created_utc": 1616527279.0,
            "replies": []
        },
        {
            "body": "👏👏👏",
            "author": "hereyougococo",
            "id": "grymzds",
            "parent_id": "t3_mblyoy",
            "score": 8,
            "created_utc": 1616526327.0,
            "replies": []
        },
        {
            "body": "[Just as things were starting to get interesting](https://gph.is/2SCGSYN)",
            "author": null,
            "id": "gryqy89",
            "parent_id": "t3_mblyoy",
            "score": 9,
            "created_utc": 1616528025.0,
            "replies": [
                {
                    "body": "lol!",
                    "author": "Azurecole",
                    "id": "gryr3bi",
                    "parent_id": "t1_gryqy89",
                    "score": 3,
                    "created_utc": 1616528086.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "What other kinds of topics or examples will get SBs banned? \nMy friend got her account banned for explaining how her clingy SD is and we really questioned what she did wrong.",
            "author": "ElegantAd5941",
            "id": "gryq1eg",
            "parent_id": "t3_mblyoy",
            "score": 5,
            "created_utc": 1616527635.0,
            "replies": [
                {
                    "body": "EA, I don't want to take us off on a tangent, if you have your friend send a Modmail, or DM me personally, I'll take a look at it.  We pretty much always reply if someone sends a respectful message to Modmail asking why they got banned.  There's also cases of bad aim by the Mod -- there's multiple ways to ban someone, and in one of the ways, it's easy to accidentally ban the thread OP rather than the person in the thread we were actually intending to ban.  We usually catch this super super fast, but sometimes we don't, so we depend on that (respectful please!) Modmail.  We'll hunt it down and reverse it if we got the wrong person",
                    "author": "Azurecole",
                    "id": "gryqqpz",
                    "parent_id": "t1_gryq1eg",
                    "score": 14,
                    "created_utc": 1616527935.0,
                    "replies": [
                        {
                            "body": "I'll second AZs comment on questioning a mod act if you feel your post was within the letter of and spirit of the rules and culture. \n\nI'll generally go through the harvest of posts waiting for mod review late in the evening on the west coast, after the other mods have done the heavy lifting and as a result of the hour, occasionally an innocent party gets the hammer. \n\nIt may be by accident or simply patience pushed too far by those nibbling at the edge of the rules envelope.  \n\nIf you feel you have been wronged check your post, check the rules and make a good faith presentation.  If it relates to something I flagged I will correct the act if I think you are right or leave it for another mod to make the final call .",
                            "author": "pinotandsugar",
                            "id": "grz1e9u",
                            "parent_id": "t1_gryqqpz",
                            "score": 6,
                            "created_utc": 1616532570.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Thank you for this! Appreciate all the work and effort that goes into making this a non-toxic community.",
            "author": null,
            "id": "gryyxe5",
            "parent_id": "t3_mblyoy",
            "score": 7,
            "created_utc": 1616531490.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gryr2ul",
            "parent_id": "t3_mblyoy",
            "score": 17,
            "created_utc": 1616528080.0,
            "replies": [
                {
                    "body": "Lol! I think that both are true to an extent. But the OP did cover that an SB can be both and many are! But the ones who do both tend to be a bit more brazen when it comes to certain topics for sure (with good reason). Whorephobia is flat out wrong though and we shouldn’t be talking down on them either because they’re only marginally different from SB and honestly all follow under SW umbrella.",
                    "author": "ashes2asscheeks",
                    "id": "gryyf4d",
                    "parent_id": "t1_gryr2ul",
                    "score": 8,
                    "created_utc": 1616531270.0,
                    "replies": []
                },
                {
                    "body": "This is what I think too.  The other sugar forum says slf panders to sugar babies.  The sexworker forums say the exact opposite.",
                    "author": "wb19081908",
                    "id": "gs050ef",
                    "parent_id": "t1_gryr2ul",
                    "score": 4,
                    "created_utc": 1616551824.0,
                    "replies": []
                },
                {
                    "body": "Exactly. People are just upset that not everyone agrees with their opinion. 🙄",
                    "author": "curly_spice",
                    "id": "gryrszz",
                    "parent_id": "t1_gryr2ul",
                    "score": 3,
                    "created_utc": 1616528396.0,
                    "replies": []
                }
            ]
        },
        {
            "body": ">we plan to more aggressively ensure there’s no dog piling or other counterproductive behavior \n\nI hope this enforcement applies to the triggered SDs who attack other SDs, calling them simps, white knights, or SBs pretending to be SDs.  \n\nIt contributes to divisions and toxicity.",
            "author": "uniballSD",
            "id": "grzffwg",
            "parent_id": "t3_mblyoy",
            "score": 10,
            "created_utc": 1616538815.0,
            "replies": [
                {
                    "body": "yes it does",
                    "author": "LaSirene23",
                    "id": "gs0gkj6",
                    "parent_id": "t1_grzffwg",
                    "score": 5,
                    "created_utc": 1616558417.0,
                    "replies": []
                },
                {
                    "body": "I think it's funny how SDs accuse of me being a white knight, a woman, etc. And then call me a bully when I make fun of them\n\nImagine being bullied by a simp and whiny on reddit about it",
                    "author": "RadicalSugar",
                    "id": "gsh9vqh",
                    "parent_id": "t1_grzffwg",
                    "score": 1,
                    "created_utc": 1616866173.0,
                    "replies": [
                        {
                            "body": "Dude this was 3 days ago. Lol",
                            "author": "uniballSD",
                            "id": "gsharu9",
                            "parent_id": "t1_gsh9vqh",
                            "score": 1,
                            "created_utc": 1616866390.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "> If you believe \"sugar is just escorting with a different rate\", you probably don't belong here, and won't be allowed to bring your views or attitude here.\n\nGood to hear\n\n>  we plan to more aggressively ensure there's no dogpiling or other counterproductive behavior on threads on women's topics written by actual SBs \n\nAlso good to hear, so long as it goes in both directions.\n\nKudos to you for this post and this approach.",
            "author": "Y_4Z44",
            "id": "gryn8rv",
            "parent_id": "t3_mblyoy",
            "score": 10,
            "created_utc": 1616526439.0,
            "replies": [
                {
                    "body": "Both directions.  I do believe it happens more in one direction than the other though, if I\"m being honest.  And I'm not saying there can't be disagreement.  I -- and I think you and everyone else -- just want to build a community where a 23-year-old newbie isn't terrified of posting about a traumatic experience.  And I think this is even more important than at first glance -- I wonder whether the SBs felt they weren't free to post about these things, which left a vacuum of important women's issues which weren't being discussed, which is why non-SBs from outside the community could sweep in and take over this discussion, to the detriment of the entire sub.",
                    "author": "Azurecole",
                    "id": "gryv8nb",
                    "parent_id": "t1_gryn8rv",
                    "score": 15,
                    "created_utc": 1616529888.0,
                    "replies": [
                        {
                            "body": ">  I do believe it happens more in one direction than the other though, if I\"m being honest\n\nI concur with this assessment.",
                            "author": "Y_4Z44",
                            "id": "grz90id",
                            "parent_id": "t1_gryv8nb",
                            "score": 2,
                            "created_utc": 1616535860.0,
                            "replies": []
                        },
                        {
                            "body": "I agree that someone that has experienced a traumatic event should be able to talk about it without fear of disparagement.  Which is why I don't think a sub like this is the right place for such discussion.  \n\nBy that, I mean if you want 100% support then you need to be in a place that caters to that issue, otherwise you WILL get disagreement, and with 100,000 members, some of that disagreement is going to be insensitive to the issue.\n\nMy point is that SLF, given its diverse makeup, isn't a great place for discussion of sensitive topics that can further traumatize people.  And i don't think trying to force the population of the sub to bite their tongues is going to be a fruitful endeaver... \n\nBut hey, it's your party so if that's how you want to spend your time... oh well",
                            "author": "Acrobatic_Half_6631",
                            "id": "gs0gxls",
                            "parent_id": "t1_gryv8nb",
                            "score": -2,
                            "created_utc": 1616558652.0,
                            "replies": [
                                {
                                    "body": "> And i don't think trying to force the population of the sub to bite their tongues is going to be a fruitful endeaver...\n\nWhat would be so difficult about reading the post and moving the hell on **without** a comment about whether it was technically or legally rape? This isn't a law forum.",
                                    "author": "LaSirene23",
                                    "id": "gs0i02w",
                                    "parent_id": "t1_gs0gxls",
                                    "score": 12,
                                    "created_utc": 1616559357.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Respectfully I think you’re missing at least one important point. These girls are not saying that sugaring is just escorting with a different rate, and instead that **the type of sugaring that is heavily promoted here** is escorting with a different rate. And less safety too.\n\nThese girls are “toxic” but not the men here who push ppm with sex on the first date after a 15min M&G, talk about a “buyer’s market”, or supply and demand when discussing how much allowance they should give instead of making it about the individual need and helping help their partner, etc. Okay....?\n\nIt’s not even about men, it’s the specific type of men who form a majority of active users on here, they sound a lot more like hobbyists than sugar daddies and if you’ve met hobbyists you know.\n\nBefore I get called a “toxic sex worker”, let me clarify that I started with SLF style sugaring and took a lot of advice from here, then I escorted for a few months too, and now I sugar exclusively. \n\nThe difference between my current sugar arrangement and SLF-style sugar is greater than between SLF-style sugar and escorting. \n\nI think if you want this subreddit to be specifically about sugar dating and not escorting, it doesn’t make sense to ban the people who argue that what’s being promoted here isn’t really what sugar dating looks like. \n\nWhat does seem biased is exactly the fact that these girls are banned and not men who make statements that should be considered equally outrageous and should make them “non-SDs” if these girls are “non-SBs”. When you add to that other factors like the fact that you can talk about every aspect of the arrangement except allowance, it does seem like this is not a place that is designed to be beneficial to SDs and SBs equally. \n\nAlso, unfair to compare to red pill trolls... Someone else has already stated why these girls feel the way they do and why they come here. They have experience with the type of men who post here and probably with the type of sugar talked about here.",
            "author": null,
            "id": "gs0jcy2",
            "parent_id": "t3_mblyoy",
            "score": 12,
            "created_utc": 1616560281.0,
            "replies": [
                {
                    "body": "domperina, I'm afraid that doesn't square with what's being said.  It's quite clear from the context I read that \"sugaring is escorting at a lower rate\" (slightly different than the way I put it) was a general observation about what sugar is in general.  And if they didn't believe sugar was a variation on escorting, they wouldn't call SDs clients and johns (which they do often), refer to allowance as rates (which they do often), advocate strongly for escort protocols around nearly everything (which they do often), say things like \"I don't spend time with any men without getting paid\", express the type of seething anger at SDs, clients, and men in general that are typical of escort forums but not sugar forums (which is a constant in the escorts-pretending-to-be-SBs subs), or talk about how they should create a new version of SA where sexworkers run it (in other words, NO ONE understands sugar except for escorts?).  Most believe these are small variations on each other. This is all crystal clear and easy for anyone to go read, if they have the stomach for it.\n\nThe people getting banned here aren't getting banned for arguing that what's being promoted here isn't sugar, they're being banned for making statements like \"all SDs need therapy and are psychopaths\" (one of a zillion examples of escort sub style man hate), promoting escort values as sugar, and being generally an incredibly toxic presence in the sub.  I agree with you about terms like \"buyers market\" and \"payments\", as I've said elsewhere in this thread, but these are opportunities for discussion and correction of the SDs and SBs using these terms, versus someone who believes everyone of the opposite gender is damaged -- such a person unlikely to ever contribute positively to the sub in any way, and THAT is who gets banned.  It is very similar to the \"redpill\" (I'm using that term wrong, just as a general term for the most disrespectful and john-like SDs) view that sugar is basically escorting, too, and the disrespectful way they talk about women.\n\nAll of my SRs have been so far from escorting that I'm not sure it makes sense to compare.  The experiences are incredibly different.  \n\nThe sub has been better since we started banning them a bit more quickly.  I hope this thread will lead to it being better still.  And we'll keep trying to make changes and improvements, that's all we can do.",
                    "author": "Azurecole",
                    "id": "gs0tvbn",
                    "parent_id": "t1_gs0jcy2",
                    "score": 6,
                    "created_utc": 1616568963.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Very well said!!!",
            "author": "daddoms",
            "id": "grynrft",
            "parent_id": "t3_mblyoy",
            "score": 6,
            "created_utc": 1616526666.0,
            "replies": []
        },
        {
            "body": "This was a great move, mods. Let's all keep this place non-toxic and our sugar partners happy!",
            "author": "roscoe7585",
            "id": "grz2sxt",
            "parent_id": "t3_mblyoy",
            "score": 6,
            "created_utc": 1616533176.0,
            "replies": []
        },
        {
            "body": "Well said.",
            "author": null,
            "id": "gryoefl",
            "parent_id": "t3_mblyoy",
            "score": 6,
            "created_utc": 1616526942.0,
            "replies": []
        },
        {
            "body": "Well said and Thank you!",
            "author": "Buckeyechamp21",
            "id": "gs2mpzz",
            "parent_id": "t3_mblyoy",
            "score": 2,
            "created_utc": 1616607575.0,
            "replies": []
        },
        {
            "body": "Thank you so much. Y’all rock! Appreciate the work you guys do.",
            "author": null,
            "id": "gs34crr",
            "parent_id": "t3_mblyoy",
            "score": 2,
            "created_utc": 1616614944.0,
            "replies": []
        },
        {
            "body": "Thank you for your work in cleaning up SLF. I had to step away for awhile as some of the posts just left me shaking my head or even triggered. Expecially those with women sharing their traumatic experiences. I'd guess at least 90-95% of women here have had some sort of assault, rape, physical or mental abuse at least once in their lifetime. Hopefully most have escaped the cycle of abuse. Part of that healing process can be in finding self worth, self-confidence and re-establishing their value as a person. The SDs that understand this and treat women with respect, respect their boundaries and comfort zones as well as past can be an amazing thing for a young woman who is a survivor. An understanding SD can provide a safe space for that young woman, help her rebuild and repair the damage that was done. At the end of the arrangement hopefully both of their lives are improved, enriched and they can move on from the experience with fond memories. Those are the kinds of stories I enjoy reading here. How have you improved your SB's life? How did you improve your SD's life? The heartwarming posts about arrangements that went well. \n\nIt seems like a lot had changed here and it is nice to see it get back to being a friendly place and a good resource for new people.",
            "author": "MidwestSB",
            "id": "gsp8tfb",
            "parent_id": "t3_mblyoy",
            "score": 2,
            "created_utc": 1617034412.0,
            "replies": [
                {
                    "body": "Glad you're back!  I could not agree more that an SR should build up and improve the lives of both SBs and SDs.  Or leave each of us better off than when we met",
                    "author": "Azurecole",
                    "id": "gspbgvc",
                    "parent_id": "t1_gsp8tfb",
                    "score": 2,
                    "created_utc": 1617035636.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "grzh9d7",
            "parent_id": "t3_mblyoy",
            "score": 6,
            "created_utc": 1616539690.0,
            "replies": [
                {
                    "body": "upvote for the free drink :)",
                    "author": "Azurecole",
                    "id": "grzs5jx",
                    "parent_id": "t1_grzh9d7",
                    "score": 7,
                    "created_utc": 1616545145.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "What is SLF defining as an actual SB?  Are posts by SDs under the same rule to be an actual SDs?",
            "author": "KittenReigns",
            "id": "grzdsoz",
            "parent_id": "t3_mblyoy",
            "score": 4,
            "created_utc": 1616538045.0,
            "replies": [
                {
                    "body": "To my knowledge, we've never formally defined this as a sub.   From what I can tell, SLF is the biggest forum to discuss sugar in the world, and I believe the way we think of it matters.   Perhaps in the future, it could be fodder for an interesting discussion thread for the entire community.  As it is, it's more of the mods putting together guidelines for ourselves as to what we view (and we think the members here view) as sugar.\n\nI do think the little rule of thumb I mentioned -- do you believe sugar is just escorting with different rates -- is a pretty quick and easy way to determine who **isn't** an SB or SD (yes, both).  This is the clear belief in many of the sexworker subs.  Not surprisingly, it is exactly the same belief among the redpillers and other toxic faux SDs who come in here.  Both groups are incredibly disruptive, divisive, and toxic here, because they're not in the right place; the main difference is we ban the redpillers faster and they leave quietly once they're gone.  But two sides of the same coin, and both fail the \"just different rates\" test.\n\nNo hard feelings for those who fail that test.  Vaya con Dios, good luck on your journey, but this isn't the right sub for you -- good news, there are a LOT of alternative subs.\n\nAnyway, just thinking out loud.",
                    "author": "Azurecole",
                    "id": "grzfxxf",
                    "parent_id": "t1_grzdsoz",
                    "score": 9,
                    "created_utc": 1616539055.0,
                    "replies": [
                        {
                            "body": "Just seeking clarification if there was another line of delineation not readily made known.",
                            "author": "KittenReigns",
                            "id": "grzgbu5",
                            "parent_id": "t1_grzfxxf",
                            "score": 4,
                            "created_utc": 1616539239.0,
                            "replies": [
                                {
                                    "body": "It's a good question.  I'd prefer lots of room for people to define sugar for themselves, with some guardrails on what it's definitely not",
                                    "author": "Azurecole",
                                    "id": "grznseo",
                                    "parent_id": "t1_grzgbu5",
                                    "score": 4,
                                    "created_utc": 1616542924.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "grzjw7c",
                    "parent_id": "t1_grzdsoz",
                    "score": 5,
                    "created_utc": 1616540980.0,
                    "replies": []
                },
                {
                    "body": "Confused about that too.",
                    "author": "uniballSD",
                    "id": "grzeuu0",
                    "parent_id": "t1_grzdsoz",
                    "score": 4,
                    "created_utc": 1616538541.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Thanks mods for doing this.",
            "author": null,
            "id": "grys0so",
            "parent_id": "t3_mblyoy",
            "score": 4,
            "created_utc": 1616528490.0,
            "replies": []
        },
        {
            "body": "Thanks for this post and the clarification. I agree wholeheartedly.",
            "author": "dontcallmechristian",
            "id": "grz1n7q",
            "parent_id": "t3_mblyoy",
            "score": 4,
            "created_utc": 1616532679.0,
            "replies": []
        },
        {
            "body": "Thanks. I enjoy reading about both sides of these relationships, and I appreciate the often thankless job Mods do, day after day.",
            "author": null,
            "id": "grz1lu1",
            "parent_id": "t3_mblyoy",
            "score": 4,
            "created_utc": 1616532663.0,
            "replies": []
        },
        {
            "body": "To reiterate, \"...no dogpiling or other counterproductive behavior on threads on women's topics written by actual **SBs** .\" Thank you mods for the reminder that toxic masculinity should not be tolerated.",
            "author": "ohh-daddy",
            "id": "grysthr",
            "parent_id": "t3_mblyoy",
            "score": 3,
            "created_utc": 1616528836.0,
            "replies": [
                {
                    "body": "Have you heard of Lewis's law.",
                    "author": "RadicalSugar",
                    "id": "gshaqxa",
                    "parent_id": "t1_grysthr",
                    "score": 2,
                    "created_utc": 1616866384.0,
                    "replies": []
                },
                {
                    "body": "simplified\n\ntoxic  not   tolerated",
                    "author": "pinotandsugar",
                    "id": "grz1oeb",
                    "parent_id": "t1_grysthr",
                    "score": 0,
                    "created_utc": 1616532693.0,
                    "replies": [
                        {
                            "body": "This is like saying all lives matter. \n\nYes, women can be toxic. But men being unempathetic about rape on r/slf is a common pattern of male behavior. Women can also be unempathetic about rape, but not in any notable way I've seen on here.",
                            "author": "RadicalSugar",
                            "id": "gshbi2n",
                            "parent_id": "t1_grz1oeb",
                            "score": 2,
                            "created_utc": 1616866567.0,
                            "replies": []
                        },
                        {
                            "body": "It’s okay to just leave it at toxic masculinity. \nAdd on toxic female behavior too, if you will, but it’s *really* important to call out toxic masculinity by name",
                            "author": "whatwouldjunedo",
                            "id": "grzdjdt",
                            "parent_id": "t1_grz1oeb",
                            "score": 5,
                            "created_utc": 1616537924.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "gs0e77v",
                                    "parent_id": "t1_grzdjdt",
                                    "score": 2,
                                    "created_utc": 1616556936.0,
                                    "replies": [
                                        {
                                            "body": "Toxic behavior from any gender is bad.  \nWe just want it stated clearly that  \n**TOXIC MASCULINITY IS BAD**\n\nWhy is there always pushback when anyone says that??  \nYa but not all men.  \nYa but not me.  \nYa but women are toxic too sometimes!  \nYa but what about sex workers being toxic??  \n\n\nCool cool. All great points.  \nAll we want to say is that  \n**TOXIC MASCULINITY SUCKS**\n\nDon’t bury our message with your “ya but” bullshit. \n\nJust respond with something positive like “*totally! toxic masculinity does suck! And it’s terrible that it’s so pervasive and so widely accepted! I hate it when some men act like that*”. \n\nBasically any other answer makes you part of the problem.",
                                            "author": "whatwouldjunedo",
                                            "id": "gs0elqp",
                                            "parent_id": "t1_gs0e77v",
                                            "score": 5,
                                            "created_utc": 1616557183.0,
                                            "replies": [
                                                {
                                                    "body": "A lot of people damage their message by demanding that other's use their terminology.    \n\nAnd NO, a person is not  automatically part of any problem just because they do not use the favored terminology of a group of people.",
                                                    "author": "pinotandsugar",
                                                    "id": "gs0i46b",
                                                    "parent_id": "t1_gs0elqp",
                                                    "score": 2,
                                                    "created_utc": 1616559435.0,
                                                    "replies": []
                                                },
                                                {
                                                    "body": "Is it possible for women to be toxic?",
                                                    "author": "UnearthlyDinosaur",
                                                    "id": "gs0lzab",
                                                    "parent_id": "t1_gs0elqp",
                                                    "score": 1,
                                                    "created_utc": 1616562175.0,
                                                    "replies": [
                                                        {
                                                            "body": "Is that a repeated and common issue in the sexual assault threads?",
                                                            "author": "RadicalSugar",
                                                            "id": "gshbtb5",
                                                            "parent_id": "t1_gs0lzab",
                                                            "score": 3,
                                                            "created_utc": 1616866641.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "body": "> Let’s just agree we don’t like toxic behavior.\n\namended \n\nLet’s just agree we will not encourage or  tolerate  toxic behavior.............  ( simplicity is the ultimate sophistication)",
                                            "author": "pinotandsugar",
                                            "id": "gs0hoeu",
                                            "parent_id": "t1_gs0e77v",
                                            "score": -1,
                                            "created_utc": 1616559138.0,
                                            "replies": [
                                                {
                                                    "body": "It’s not “simplicity at its best” to try to put a gag on someone for uttering the phrase “**toxic masculinity is bad**”.\n\nWhat’s simple is to just say nothing, or if you agree, to say that.\n\nThere’s absolutely no simplicity or sophistication in trying to be suave about getting someone to stop saying that **toxic masculinity is bad**.\n \nIf i make a post saying “I think the taste of lime juice is bad” you won’t see a dozen men swooping in going “Yes lime juice is bad, but lemon juice can be bad sometimes too, you know! Why single out limes??”\n\nIf a woman wants to say that she thinks toxic masculinity is bad, why can’t men just let her make that statement without swarming all over her with the “ya but” rebuttal?\n\nIf you’re not part of the problem then you shouldn’t feel attacked in any way. The statement that “toxic masculinity is bad” is only attacking the toxic male. Those men do not need to be defended. They need to be counseled and reformed, so as to stop hurting themselves and others!",
                                                    "author": "whatwouldjunedo",
                                                    "id": "gs0i4bg",
                                                    "parent_id": "t1_gs0hoeu",
                                                    "score": 2,
                                                    "created_utc": 1616559438.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "\n\n\n \nAwesome",
            "author": "pinotandsugar",
            "id": "gryzb6q",
            "parent_id": "t3_mblyoy",
            "score": 2,
            "created_utc": 1616531659.0,
            "replies": []
        },
        {
            "body": "There's a lot of disagreement about how inclusive sugaring ought to be. And a lot of confusion with posters thinking because a platform commonly associated with sugaring was used e.g. SA the interaction necessarily is under the sugar umbrella and thus appropriate to discuss here. \n\nThere's a little less ambiguity because of the OP. \n\nOf course the guidance on empathy is appropriate as well. \n\nI do believe a lot of the hostility is being driven by posters who would be considered 'outsiders' based on the guardrails you've established for the community. But I don't like to see differing viewpoints silenced as long as they're presented in a productive way.",
            "author": "OpenAirMarket901",
            "id": "grzy3kc",
            "parent_id": "t3_mblyoy",
            "score": 2,
            "created_utc": 1616548197.0,
            "replies": []
        },
        {
            "body": "Its also important to remember this is a voluntary sub. Participation is optional.  If you don't like the rules, or the mods, or comments you don't have to come. It seems like people read a sub or join and online group and forget its optional.  Maybe simplistic, but some people get so wound up and angry fighting for their cause its bad for their mental health. Its no different than irl relationships. Don't hang out with people that make you mad.",
            "author": "OldschoolSD",
            "id": "grzv19k",
            "parent_id": "t3_mblyoy",
            "score": 3,
            "created_utc": 1616546607.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "gs064jm",
                    "parent_id": "t1_grzv19k",
                    "score": 8,
                    "created_utc": 1616552415.0,
                    "replies": [
                        {
                            "body": "I absolutely agree and I'm preaching to most of the choir. I'm not talking about controversial topics and the mods almost never seem to ban do to topic, rather for lack of decorum. I refer to the small number of people who get so angry (repeatedly) that they can't discuss those topics without getting nasty. As was the case in this latest incident. \n\n\nI look at it this way. Among my two closest friends. One is a polar opposite from me politically, but  we have wonderful insightful debates because we can do so calmly. The other is very close to me politically, but I avoid any type of debate because he gets angry and rude. For me, the topic isn't always as important as the ability to discuss rationally.\n\n\nAs an old school SR guy. I advocate for the older, slower ways because I remember how much better and safer the bowl was and I catch some shit for it. I join you in wanting the bowl to be a better place. That's largely why I am here. I'm not even in market because my sugar situation is pretty settled in. I'm here for the love of the bowl. And to riff jokes.",
                            "author": "OldschoolSD",
                            "id": "gs0s760",
                            "parent_id": "t1_gs064jm",
                            "score": 2,
                            "created_utc": 1616567409.0,
                            "replies": []
                        },
                        {
                            "body": "My therapist keeps on telling me to not argue with people online.\n\nI always say, \"But then I wouldn't need to see you anymore.\"",
                            "author": "RadicalSugar",
                            "id": "gshcpoc",
                            "parent_id": "t1_gs064jm",
                            "score": 2,
                            "created_utc": 1616866862.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Your points are all true, but a SB made a good point that SLF is likely unique as a forum for people to get advice about problems or bad experiences in their sugar relationships (or even just vent!), where this kind of relationship is accepted and understood. That makes moderation and \"maintenance\" of the sub especially important.",
                    "author": "highfructoseSD",
                    "id": "gs32z4b",
                    "parent_id": "t1_grzv19k",
                    "score": 3,
                    "created_utc": 1616614370.0,
                    "replies": []
                },
                {
                    "body": "This is the main forum about sugar dating where a lot of “innocent” new SBs come get advice. I did the same too when I got into sugar dating and I really wish I had checked “non-sugar” subs too in addition to this one looking back. \n\n“Participation is voluntary” might work as a SD when you don’t have much at stake, but for girls who’ve been in difficult situations, it’s hard to see some things promoted to other girls who don’t know any better and not want to step in.",
                    "author": null,
                    "id": "gs0kiwf",
                    "parent_id": "t1_grzv19k",
                    "score": 2,
                    "created_utc": 1616561094.0,
                    "replies": [
                        {
                            "body": "I get that. My point is more aimed at people who come to argue.",
                            "author": "OldschoolSD",
                            "id": "gs0p00n",
                            "parent_id": "t1_gs0kiwf",
                            "score": 1,
                            "created_utc": 1616564612.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I absolutely agree that the SB’s here have made me a better SD. I sometimes ask for their advice and they give me a good honest response.\n\nI give credit to SD’s here for warning SBs about scams. I also give credit to SB’s for collectively advocating against online only and platonic SR’s. \n\n\nI’m fine with this as long as it doesn’t become “the woman is always right” because I’ve seen some sites/subs go down the tubes due to mod biases. Sugaring is a topic that many people are passionate about and I’ve always felt that because it’s on the “down low” there is often miscommunication involved.",
            "author": "UnearthlyDinosaur",
            "id": "gs0lnst",
            "parent_id": "t3_mblyoy",
            "score": 1,
            "created_utc": 1616561931.0,
            "replies": []
        },
        {
            "body": ">Yesterday's poster, after leaving a long trail of gender hostility, was specifically banned for saying all SDs need therapy and are psychopaths on a completely different thread\n\nMy perception since joining SLF is that gender hostility toward SDs (and complaints about them in general) here is much more prevalent in SB posts than the reverse case.  Shaming language directed at SDs being quite commonplace on SLF without any detected rebuke from the mods here.  Just my impression of course.\n\n>(fyi, I automatically ban redpillers as well, which is why SBs rarely see such posts on slf\n\nCurious about this, you mean someone who openly promotes RP philosophy here or because it's branded as misogynistic by some?  My understanding is there are many men on the RP spectrum that are quite favorably inclined toward SRs as an alternative to marriage or LTRs.\n\n>While all topics will and should generate discussion, questions, debate, and *respectful disagreement*, we plan to more aggressively ensure there's no dogpiling or other counterproductive behavior on threads on women's topics written by actual **SBs**\n\nAll to frequently, any disagreement (respectful being a very nebulous term) directed at SB postings here is treated with scorn and downvotes.  Dogpiling is not a gender specific behavior by any means especially in the context of down voting which I rarely do myself.    \n\n\n>SLF's SBs have made me a better SD\n\nTend to agree with respect to insights although how I treat my SB and views toward SRs and the bowl has changed little since joining here.  It's very apparent that some need to adjust their behavior, attitudes and expectations here on both sides of the gender divide.",
            "author": "Jeff_M3",
            "id": "grzo1ag",
            "parent_id": "t3_mblyoy",
            "score": -3,
            "created_utc": 1616543051.0,
            "replies": [
                {
                    "body": "I think it's common that your perception of who is hostile to whom depends on group you're in :)  I think there's plenty of sniping to go around ... but this post is less about pointing fingers, than ensuring slf tells its own story, and addresses the most pressing issue -- that SBs don't feel free to discuss their issues here.  But that doesn't mean there aren't other issues to discuss a different day.  And yes, brigading and dogpiling is far from a single-gender behavior.\n\n> Curious about this, you mean someone who openly promotes RP philosophy here or because it's branded as misogynistic by some? \n\nI'm using the term sloppily and somewhat inaccurately for those who show disdain for women and have a \"you're getting paid just do it\" attitude, which is the most common type I come across (and end up banning).  When I look in their post histories, it's common they're active in an mgtow or redpill sub, but not always.  I'm sure I'm not using the term accurately",
                    "author": "Azurecole",
                    "id": "grzs4bt",
                    "parent_id": "t1_grzo1ag",
                    "score": 2,
                    "created_utc": 1616545128.0,
                    "replies": [
                        {
                            "body": ">SBs don't feel free to discuss their issues here.\n\nIf that's the feedback you're getting as mods, definitely need to address this.  If you have surveyed this it would be interesting to see the results and why some SBs feel this way.  May give SDs pause with regard to how we comment.\n\nMGTOW generally identify as fervent anti-feminists who decry gynocentric laws, legal bias, blatant misandry in its many forms, promiscuity, hypergamy, demonization of masculinity etc. and promote avoidance of any form of pair bonding (cohabitation) or even socializing with women.  This hyper critical community is championed by various influencers like Sandman and have a dystopian view of the future of society. Collectively they definitely have disdain for women, especially feminists, openly express it and few would be SDs.\n\nRed Pill (using the Matrix metaphor for accepting gender dynamic realities) as a movement/community tends to be more measured in its assessment of, and in raising awareness of, the realities and associated risks of pair bonding with women but don't eschew engagement or intimate relationships with them.  Redpillars as you refer to them are definitely open to SRs and less likely to be a nuisance here. The true focus of RP philosophy is more about helping men to become better versions of themselves and not misogynistic in nature as opponents claim so as to dismiss and denigrate out of ignorance.\n\nWhile there are definite distinctions between mgtow and RP adherents, both share similar views on many topics and my descriptions are very summary of course.  As such, I don't wish engage in disputes about my characterizations of these movements here.",
                            "author": "Jeff_M3",
                            "id": "gs0ajpp",
                            "parent_id": "t1_grzs4bt",
                            "score": 1,
                            "created_utc": 1616554809.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Sugar babies are better than therapists so what they said doesn't make sense mainly for that reason.",
            "author": "anonaccount202",
            "id": "gs1zgkx",
            "parent_id": "t3_mblyoy",
            "score": -1,
            "created_utc": 1616597836.0,
            "replies": []
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "gshdbmt",
            "parent_id": "t3_mblyoy",
            "score": 1,
            "created_utc": 1616867012.0,
            "replies": [
                {
                    "body": "I see you may have posted a number which is most likely an amount in relations to an arrangement. If this is the case, you are violating Rule#4 - \"No dollar amounts that are in reference to allowance/PPM are allowed.\"\n\n\nIf you are curious about Allowances reported by SLF contributors please see the [Allowance Master Thread 2020-2021](https://www.reddit.com/r/sugarlifestyleforum/comments/ja37xt/allowance_master_thread_20202021/)\n\nYour post will not be approved until you remove the amount.  Please read the sub [Rules](https://www.reddit.com/r/sugarlifestyleforum/comments/748zta/updated_and_clarified_rules_for_slf/) prior to posting anything else. \n\nIf you simply posted a number not referencing a monetary amount, please message the MODs to approve your post.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/sugarlifestyleforum) if you have any questions or concerns.*",
                    "author": "AutoModerator",
                    "id": "gshdbpp",
                    "parent_id": "t1_gshdbmt",
                    "score": 1,
                    "created_utc": 1616867012.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Well done sir",
            "author": "Xixix90210",
            "id": "h1js68t",
            "parent_id": "t3_mblyoy",
            "score": 1,
            "created_utc": 1623528347.0,
            "replies": []
        },
        {
            "body": "Hi MODs, I don't know where to post this, and have tried searching this subreddit.   \nHowever is there a Discord community?",
            "author": "firecherry200",
            "id": "hvoqrju",
            "parent_id": "t3_mblyoy",
            "score": 1,
            "created_utc": 1644060238.0,
            "replies": [
                {
                    "body": "Hi, slf doesn't sponsor any outside communities (telegram, discord, etc) and doesn't allow any to be advertised here.  There are a whole bunch of people who have formed their own communities; since they can't advertise here, they tend to find you -- you post here enough, eventually people notice you and invite you to their discord/telegram/etc",
                    "author": "Azurecole",
                    "id": "hvpy754",
                    "parent_id": "t1_hvoqrju",
                    "score": 1,
                    "created_utc": 1644082058.0,
                    "replies": [
                        {
                            "body": "Thank you for your help :)",
                            "author": "firecherry200",
                            "id": "hvs2kcz",
                            "parent_id": "t1_hvpy754",
                            "score": 1,
                            "created_utc": 1644120419.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Thank you for putting this into words like this. Please don’t get off your soapbox. I mean, when you need to please do, we all need to eat and sleep. But, I really appreciate your presence here.",
            "author": "buttery_bees",
            "id": "grzyy37",
            "parent_id": "t1_grz1y08",
            "score": 12,
            "created_utc": 1616548645.0,
            "replies": []
        },
        {
            "body": "Great analogy, couldn’t agree more.",
            "author": null,
            "id": "grz2tms",
            "parent_id": "t1_grz1y08",
            "score": 13,
            "created_utc": 1616533185.0,
            "replies": []
        },
        {
            "body": "You are right. This forum is a great place for people with different viewpoints to discuss things together. The point isn’t what you technically  call xxxx rather that the act is wrong and makes someone feel violated. Tricking someone out of a PPM and stealthing are both behaviors that are inexcusable and should not be tolerated. We can listen and provide support if that’s what is wanted. We can, and have also, come up with guidelines. It’s helpful not to lump everyone into the same group, not consider all men to have the same views nor all women to have the same motives.",
            "author": "daddoms",
            "id": "grz3qtq",
            "parent_id": "t1_grz1y08",
            "score": 8,
            "created_utc": 1616533585.0,
            "replies": []
        },
        {
            "body": "I love this!",
            "author": "whatwouldjunedo",
            "id": "grzd965",
            "parent_id": "t1_grz1y08",
            "score": 2,
            "created_utc": 1616537791.0,
            "replies": []
        },
        {
            "body": "Lululemon offers free repairs for rips and holes.",
            "author": "uniballSD",
            "id": "grzfxoj",
            "parent_id": "t1_grz1y08",
            "score": 0,
            "created_utc": 1616539052.0,
            "replies": []
        },
        {
            "body": "I am really, almost obsessively averse to using business metaphors in the bowl.  Not just \"marketplace\" and \"supply and demand\", but \"payments\" and other business and service-oriented concepts.  \n\nSome are clearly just people not sure what words to use, and grabbing on to whatever seems closest.  But calling SDs \"clients\" (as is common on the sexworker subs), or talking about \"market rates\".  I'd prefer we kept to relationship terms and concepts when possible, I think it captures the spirit of what an SR is better",
            "author": "Azurecole",
            "id": "grzex2b",
            "parent_id": "t1_grzdysv",
            "score": 21,
            "created_utc": 1616538571.0,
            "replies": [
                {
                    "body": "I second this. Just yesterday some man referred to an SBs \"market value.\" Disgusted.",
                    "author": "viewfrom61",
                    "id": "gs01bej",
                    "parent_id": "t1_grzex2b",
                    "score": 8,
                    "created_utc": 1616549888.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Well, here goes my two cents; I think we're dealing with three issues, and yet nobody wants to discuss them.  The first is women and men are different.  We process information differently; therefore, It's bound to be some hurt feelings and misunderstandings.  Secondly, there is a generational gap, and our vocabulary has changed drastically within the last four years. It's hard to communicate without offending anyone. At the same time, we can understand what is being said.  Thirdly, some things just get lost in translation, from your brain to the paper.  Let's face it, we Americans aren't winning any high marks in English anymore.  I don't think this is the forum for expressing devasting events simply because it's not a visual medium.",
            "author": "Darknlovely38",
            "id": "h54dy18",
            "parent_id": "t1_grzdysv",
            "score": 1,
            "created_utc": 1626238436.0,
            "replies": []
        },
        {
            "body": "💯",
            "author": "peachy731",
            "id": "grzk5vb",
            "parent_id": "t1_grz0eke",
            "score": 5,
            "created_utc": 1616541113.0,
            "replies": []
        },
        {
            "body": "I constantly express boundaries and tell SDs that I am not open to sexual acts (I have a bf). I have expressed this to several SDs and still been violated. Paying a woman for her time does not mean that she is obligated to do sexual things with you and it should never be portrayed as leaning the SD on. Just because we need money doesn’t mean we are willing to fuck every dude we meet for a date.",
            "author": "puppyonshrooms",
            "id": "gs0t49g",
            "parent_id": "t1_grz0eke",
            "score": 2,
            "created_utc": 1616568263.0,
            "replies": [
                {
                    "body": "This is one of the reasons many people on this sub take a harsh view on platonic arrangements.  We all know there are a lot of bad actors (I'm not going to call them SDs) that will try to push (typically young/naïve) women into it - despite them being very clear about platonic from day 1.  I'm not saying platonic doesn't exist - but it's rare.  And many of the guys that go after platonic women have ulterior motives.  \n\nIt's a tough line between providing full support, but also trying to help the person unlearn the lies from tiktok and youtube - that are just likely to lead the person into a similar situation again.",
                    "author": "SDstartingOut",
                    "id": "gs1hboa",
                    "parent_id": "t1_gs0t49g",
                    "score": 4,
                    "created_utc": 1616589084.0,
                    "replies": [
                        {
                            "body": "It will lead her back into that situation again because she doesn't know anything about men.  One thing for sure men has definitely changed since these SB/SD websites have popped up.  I'm sure I had some creeps in my life, but my experience with men was overwhelmingly positive.  I didn't have a problem with men trying to force me to do something I didn't want to do, and I still laid in the same bed with them.",
                            "author": "Darknlovely38",
                            "id": "h54kzbw",
                            "parent_id": "t1_gs1hboa",
                            "score": 1,
                            "created_utc": 1626243836.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "I think this is because most guys, especially the young men under 50, see it as a quid pro quo, which means a favor or advantage granted or expected in return for something.  Let me ask you something, did any of your boyfriends expect a fuck after a date or two, and did you oblige? An S/D is supposed to be a boyfriend, but one who actually has money to put in your pocket!  Sweetheart, the only man who will give you money and don't want sex from you is your biological father.  By the way, your boyfriend is pimping you, if he's okay with you going out with men for money.",
                    "author": "Darknlovely38",
                    "id": "h54jowy",
                    "parent_id": "t1_gs0t49g",
                    "score": 1,
                    "created_utc": 1626242773.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "lol!",
            "author": "Azurecole",
            "id": "gryr3bi",
            "parent_id": "t1_gryqy89",
            "score": 3,
            "created_utc": 1616528086.0,
            "replies": []
        },
        {
            "body": "EA, I don't want to take us off on a tangent, if you have your friend send a Modmail, or DM me personally, I'll take a look at it.  We pretty much always reply if someone sends a respectful message to Modmail asking why they got banned.  There's also cases of bad aim by the Mod -- there's multiple ways to ban someone, and in one of the ways, it's easy to accidentally ban the thread OP rather than the person in the thread we were actually intending to ban.  We usually catch this super super fast, but sometimes we don't, so we depend on that (respectful please!) Modmail.  We'll hunt it down and reverse it if we got the wrong person",
            "author": "Azurecole",
            "id": "gryqqpz",
            "parent_id": "t1_gryq1eg",
            "score": 14,
            "created_utc": 1616527935.0,
            "replies": [
                {
                    "body": "I'll second AZs comment on questioning a mod act if you feel your post was within the letter of and spirit of the rules and culture. \n\nI'll generally go through the harvest of posts waiting for mod review late in the evening on the west coast, after the other mods have done the heavy lifting and as a result of the hour, occasionally an innocent party gets the hammer. \n\nIt may be by accident or simply patience pushed too far by those nibbling at the edge of the rules envelope.  \n\nIf you feel you have been wronged check your post, check the rules and make a good faith presentation.  If it relates to something I flagged I will correct the act if I think you are right or leave it for another mod to make the final call .",
                    "author": "pinotandsugar",
                    "id": "grz1e9u",
                    "parent_id": "t1_gryqqpz",
                    "score": 6,
                    "created_utc": 1616532570.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Lol! I think that both are true to an extent. But the OP did cover that an SB can be both and many are! But the ones who do both tend to be a bit more brazen when it comes to certain topics for sure (with good reason). Whorephobia is flat out wrong though and we shouldn’t be talking down on them either because they’re only marginally different from SB and honestly all follow under SW umbrella.",
            "author": "ashes2asscheeks",
            "id": "gryyf4d",
            "parent_id": "t1_gryr2ul",
            "score": 8,
            "created_utc": 1616531270.0,
            "replies": []
        },
        {
            "body": "This is what I think too.  The other sugar forum says slf panders to sugar babies.  The sexworker forums say the exact opposite.",
            "author": "wb19081908",
            "id": "gs050ef",
            "parent_id": "t1_gryr2ul",
            "score": 4,
            "created_utc": 1616551824.0,
            "replies": []
        },
        {
            "body": "Exactly. People are just upset that not everyone agrees with their opinion. 🙄",
            "author": "curly_spice",
            "id": "gryrszz",
            "parent_id": "t1_gryr2ul",
            "score": 3,
            "created_utc": 1616528396.0,
            "replies": []
        },
        {
            "body": "yes it does",
            "author": "LaSirene23",
            "id": "gs0gkj6",
            "parent_id": "t1_grzffwg",
            "score": 5,
            "created_utc": 1616558417.0,
            "replies": []
        },
        {
            "body": "I think it's funny how SDs accuse of me being a white knight, a woman, etc. And then call me a bully when I make fun of them\n\nImagine being bullied by a simp and whiny on reddit about it",
            "author": "RadicalSugar",
            "id": "gsh9vqh",
            "parent_id": "t1_grzffwg",
            "score": 1,
            "created_utc": 1616866173.0,
            "replies": [
                {
                    "body": "Dude this was 3 days ago. Lol",
                    "author": "uniballSD",
                    "id": "gsharu9",
                    "parent_id": "t1_gsh9vqh",
                    "score": 1,
                    "created_utc": 1616866390.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Both directions.  I do believe it happens more in one direction than the other though, if I\"m being honest.  And I'm not saying there can't be disagreement.  I -- and I think you and everyone else -- just want to build a community where a 23-year-old newbie isn't terrified of posting about a traumatic experience.  And I think this is even more important than at first glance -- I wonder whether the SBs felt they weren't free to post about these things, which left a vacuum of important women's issues which weren't being discussed, which is why non-SBs from outside the community could sweep in and take over this discussion, to the detriment of the entire sub.",
            "author": "Azurecole",
            "id": "gryv8nb",
            "parent_id": "t1_gryn8rv",
            "score": 15,
            "created_utc": 1616529888.0,
            "replies": [
                {
                    "body": ">  I do believe it happens more in one direction than the other though, if I\"m being honest\n\nI concur with this assessment.",
                    "author": "Y_4Z44",
                    "id": "grz90id",
                    "parent_id": "t1_gryv8nb",
                    "score": 2,
                    "created_utc": 1616535860.0,
                    "replies": []
                },
                {
                    "body": "I agree that someone that has experienced a traumatic event should be able to talk about it without fear of disparagement.  Which is why I don't think a sub like this is the right place for such discussion.  \n\nBy that, I mean if you want 100% support then you need to be in a place that caters to that issue, otherwise you WILL get disagreement, and with 100,000 members, some of that disagreement is going to be insensitive to the issue.\n\nMy point is that SLF, given its diverse makeup, isn't a great place for discussion of sensitive topics that can further traumatize people.  And i don't think trying to force the population of the sub to bite their tongues is going to be a fruitful endeaver... \n\nBut hey, it's your party so if that's how you want to spend your time... oh well",
                    "author": "Acrobatic_Half_6631",
                    "id": "gs0gxls",
                    "parent_id": "t1_gryv8nb",
                    "score": -2,
                    "created_utc": 1616558652.0,
                    "replies": [
                        {
                            "body": "> And i don't think trying to force the population of the sub to bite their tongues is going to be a fruitful endeaver...\n\nWhat would be so difficult about reading the post and moving the hell on **without** a comment about whether it was technically or legally rape? This isn't a law forum.",
                            "author": "LaSirene23",
                            "id": "gs0i02w",
                            "parent_id": "t1_gs0gxls",
                            "score": 12,
                            "created_utc": 1616559357.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "domperina, I'm afraid that doesn't square with what's being said.  It's quite clear from the context I read that \"sugaring is escorting at a lower rate\" (slightly different than the way I put it) was a general observation about what sugar is in general.  And if they didn't believe sugar was a variation on escorting, they wouldn't call SDs clients and johns (which they do often), refer to allowance as rates (which they do often), advocate strongly for escort protocols around nearly everything (which they do often), say things like \"I don't spend time with any men without getting paid\", express the type of seething anger at SDs, clients, and men in general that are typical of escort forums but not sugar forums (which is a constant in the escorts-pretending-to-be-SBs subs), or talk about how they should create a new version of SA where sexworkers run it (in other words, NO ONE understands sugar except for escorts?).  Most believe these are small variations on each other. This is all crystal clear and easy for anyone to go read, if they have the stomach for it.\n\nThe people getting banned here aren't getting banned for arguing that what's being promoted here isn't sugar, they're being banned for making statements like \"all SDs need therapy and are psychopaths\" (one of a zillion examples of escort sub style man hate), promoting escort values as sugar, and being generally an incredibly toxic presence in the sub.  I agree with you about terms like \"buyers market\" and \"payments\", as I've said elsewhere in this thread, but these are opportunities for discussion and correction of the SDs and SBs using these terms, versus someone who believes everyone of the opposite gender is damaged -- such a person unlikely to ever contribute positively to the sub in any way, and THAT is who gets banned.  It is very similar to the \"redpill\" (I'm using that term wrong, just as a general term for the most disrespectful and john-like SDs) view that sugar is basically escorting, too, and the disrespectful way they talk about women.\n\nAll of my SRs have been so far from escorting that I'm not sure it makes sense to compare.  The experiences are incredibly different.  \n\nThe sub has been better since we started banning them a bit more quickly.  I hope this thread will lead to it being better still.  And we'll keep trying to make changes and improvements, that's all we can do.",
            "author": "Azurecole",
            "id": "gs0tvbn",
            "parent_id": "t1_gs0jcy2",
            "score": 6,
            "created_utc": 1616568963.0,
            "replies": []
        },
        {
            "body": "Glad you're back!  I could not agree more that an SR should build up and improve the lives of both SBs and SDs.  Or leave each of us better off than when we met",
            "author": "Azurecole",
            "id": "gspbgvc",
            "parent_id": "t1_gsp8tfb",
            "score": 2,
            "created_utc": 1617035636.0,
            "replies": []
        },
        {
            "body": "upvote for the free drink :)",
            "author": "Azurecole",
            "id": "grzs5jx",
            "parent_id": "t1_grzh9d7",
            "score": 7,
            "created_utc": 1616545145.0,
            "replies": []
        },
        {
            "body": "To my knowledge, we've never formally defined this as a sub.   From what I can tell, SLF is the biggest forum to discuss sugar in the world, and I believe the way we think of it matters.   Perhaps in the future, it could be fodder for an interesting discussion thread for the entire community.  As it is, it's more of the mods putting together guidelines for ourselves as to what we view (and we think the members here view) as sugar.\n\nI do think the little rule of thumb I mentioned -- do you believe sugar is just escorting with different rates -- is a pretty quick and easy way to determine who **isn't** an SB or SD (yes, both).  This is the clear belief in many of the sexworker subs.  Not surprisingly, it is exactly the same belief among the redpillers and other toxic faux SDs who come in here.  Both groups are incredibly disruptive, divisive, and toxic here, because they're not in the right place; the main difference is we ban the redpillers faster and they leave quietly once they're gone.  But two sides of the same coin, and both fail the \"just different rates\" test.\n\nNo hard feelings for those who fail that test.  Vaya con Dios, good luck on your journey, but this isn't the right sub for you -- good news, there are a LOT of alternative subs.\n\nAnyway, just thinking out loud.",
            "author": "Azurecole",
            "id": "grzfxxf",
            "parent_id": "t1_grzdsoz",
            "score": 9,
            "created_utc": 1616539055.0,
            "replies": [
                {
                    "body": "Just seeking clarification if there was another line of delineation not readily made known.",
                    "author": "KittenReigns",
                    "id": "grzgbu5",
                    "parent_id": "t1_grzfxxf",
                    "score": 4,
                    "created_utc": 1616539239.0,
                    "replies": [
                        {
                            "body": "It's a good question.  I'd prefer lots of room for people to define sugar for themselves, with some guardrails on what it's definitely not",
                            "author": "Azurecole",
                            "id": "grznseo",
                            "parent_id": "t1_grzgbu5",
                            "score": 4,
                            "created_utc": 1616542924.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "grzjw7c",
            "parent_id": "t1_grzdsoz",
            "score": 5,
            "created_utc": 1616540980.0,
            "replies": []
        },
        {
            "body": "Confused about that too.",
            "author": "uniballSD",
            "id": "grzeuu0",
            "parent_id": "t1_grzdsoz",
            "score": 4,
            "created_utc": 1616538541.0,
            "replies": []
        },
        {
            "body": "Have you heard of Lewis's law.",
            "author": "RadicalSugar",
            "id": "gshaqxa",
            "parent_id": "t1_grysthr",
            "score": 2,
            "created_utc": 1616866384.0,
            "replies": []
        },
        {
            "body": "simplified\n\ntoxic  not   tolerated",
            "author": "pinotandsugar",
            "id": "grz1oeb",
            "parent_id": "t1_grysthr",
            "score": 0,
            "created_utc": 1616532693.0,
            "replies": [
                {
                    "body": "This is like saying all lives matter. \n\nYes, women can be toxic. But men being unempathetic about rape on r/slf is a common pattern of male behavior. Women can also be unempathetic about rape, but not in any notable way I've seen on here.",
                    "author": "RadicalSugar",
                    "id": "gshbi2n",
                    "parent_id": "t1_grz1oeb",
                    "score": 2,
                    "created_utc": 1616866567.0,
                    "replies": []
                },
                {
                    "body": "It’s okay to just leave it at toxic masculinity. \nAdd on toxic female behavior too, if you will, but it’s *really* important to call out toxic masculinity by name",
                    "author": "whatwouldjunedo",
                    "id": "grzdjdt",
                    "parent_id": "t1_grz1oeb",
                    "score": 5,
                    "created_utc": 1616537924.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "gs0e77v",
                            "parent_id": "t1_grzdjdt",
                            "score": 2,
                            "created_utc": 1616556936.0,
                            "replies": [
                                {
                                    "body": "Toxic behavior from any gender is bad.  \nWe just want it stated clearly that  \n**TOXIC MASCULINITY IS BAD**\n\nWhy is there always pushback when anyone says that??  \nYa but not all men.  \nYa but not me.  \nYa but women are toxic too sometimes!  \nYa but what about sex workers being toxic??  \n\n\nCool cool. All great points.  \nAll we want to say is that  \n**TOXIC MASCULINITY SUCKS**\n\nDon’t bury our message with your “ya but” bullshit. \n\nJust respond with something positive like “*totally! toxic masculinity does suck! And it’s terrible that it’s so pervasive and so widely accepted! I hate it when some men act like that*”. \n\nBasically any other answer makes you part of the problem.",
                                    "author": "whatwouldjunedo",
                                    "id": "gs0elqp",
                                    "parent_id": "t1_gs0e77v",
                                    "score": 5,
                                    "created_utc": 1616557183.0,
                                    "replies": [
                                        {
                                            "body": "A lot of people damage their message by demanding that other's use their terminology.    \n\nAnd NO, a person is not  automatically part of any problem just because they do not use the favored terminology of a group of people.",
                                            "author": "pinotandsugar",
                                            "id": "gs0i46b",
                                            "parent_id": "t1_gs0elqp",
                                            "score": 2,
                                            "created_utc": 1616559435.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "Is it possible for women to be toxic?",
                                            "author": "UnearthlyDinosaur",
                                            "id": "gs0lzab",
                                            "parent_id": "t1_gs0elqp",
                                            "score": 1,
                                            "created_utc": 1616562175.0,
                                            "replies": [
                                                {
                                                    "body": "Is that a repeated and common issue in the sexual assault threads?",
                                                    "author": "RadicalSugar",
                                                    "id": "gshbtb5",
                                                    "parent_id": "t1_gs0lzab",
                                                    "score": 3,
                                                    "created_utc": 1616866641.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "> Let’s just agree we don’t like toxic behavior.\n\namended \n\nLet’s just agree we will not encourage or  tolerate  toxic behavior.............  ( simplicity is the ultimate sophistication)",
                                    "author": "pinotandsugar",
                                    "id": "gs0hoeu",
                                    "parent_id": "t1_gs0e77v",
                                    "score": -1,
                                    "created_utc": 1616559138.0,
                                    "replies": [
                                        {
                                            "body": "It’s not “simplicity at its best” to try to put a gag on someone for uttering the phrase “**toxic masculinity is bad**”.\n\nWhat’s simple is to just say nothing, or if you agree, to say that.\n\nThere’s absolutely no simplicity or sophistication in trying to be suave about getting someone to stop saying that **toxic masculinity is bad**.\n \nIf i make a post saying “I think the taste of lime juice is bad” you won’t see a dozen men swooping in going “Yes lime juice is bad, but lemon juice can be bad sometimes too, you know! Why single out limes??”\n\nIf a woman wants to say that she thinks toxic masculinity is bad, why can’t men just let her make that statement without swarming all over her with the “ya but” rebuttal?\n\nIf you’re not part of the problem then you shouldn’t feel attacked in any way. The statement that “toxic masculinity is bad” is only attacking the toxic male. Those men do not need to be defended. They need to be counseled and reformed, so as to stop hurting themselves and others!",
                                            "author": "whatwouldjunedo",
                                            "id": "gs0i4bg",
                                            "parent_id": "t1_gs0hoeu",
                                            "score": 2,
                                            "created_utc": 1616559438.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gs064jm",
            "parent_id": "t1_grzv19k",
            "score": 8,
            "created_utc": 1616552415.0,
            "replies": [
                {
                    "body": "I absolutely agree and I'm preaching to most of the choir. I'm not talking about controversial topics and the mods almost never seem to ban do to topic, rather for lack of decorum. I refer to the small number of people who get so angry (repeatedly) that they can't discuss those topics without getting nasty. As was the case in this latest incident. \n\n\nI look at it this way. Among my two closest friends. One is a polar opposite from me politically, but  we have wonderful insightful debates because we can do so calmly. The other is very close to me politically, but I avoid any type of debate because he gets angry and rude. For me, the topic isn't always as important as the ability to discuss rationally.\n\n\nAs an old school SR guy. I advocate for the older, slower ways because I remember how much better and safer the bowl was and I catch some shit for it. I join you in wanting the bowl to be a better place. That's largely why I am here. I'm not even in market because my sugar situation is pretty settled in. I'm here for the love of the bowl. And to riff jokes.",
                    "author": "OldschoolSD",
                    "id": "gs0s760",
                    "parent_id": "t1_gs064jm",
                    "score": 2,
                    "created_utc": 1616567409.0,
                    "replies": []
                },
                {
                    "body": "My therapist keeps on telling me to not argue with people online.\n\nI always say, \"But then I wouldn't need to see you anymore.\"",
                    "author": "RadicalSugar",
                    "id": "gshcpoc",
                    "parent_id": "t1_gs064jm",
                    "score": 2,
                    "created_utc": 1616866862.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Your points are all true, but a SB made a good point that SLF is likely unique as a forum for people to get advice about problems or bad experiences in their sugar relationships (or even just vent!), where this kind of relationship is accepted and understood. That makes moderation and \"maintenance\" of the sub especially important.",
            "author": "highfructoseSD",
            "id": "gs32z4b",
            "parent_id": "t1_grzv19k",
            "score": 3,
            "created_utc": 1616614370.0,
            "replies": []
        },
        {
            "body": "This is the main forum about sugar dating where a lot of “innocent” new SBs come get advice. I did the same too when I got into sugar dating and I really wish I had checked “non-sugar” subs too in addition to this one looking back. \n\n“Participation is voluntary” might work as a SD when you don’t have much at stake, but for girls who’ve been in difficult situations, it’s hard to see some things promoted to other girls who don’t know any better and not want to step in.",
            "author": null,
            "id": "gs0kiwf",
            "parent_id": "t1_grzv19k",
            "score": 2,
            "created_utc": 1616561094.0,
            "replies": [
                {
                    "body": "I get that. My point is more aimed at people who come to argue.",
                    "author": "OldschoolSD",
                    "id": "gs0p00n",
                    "parent_id": "t1_gs0kiwf",
                    "score": 1,
                    "created_utc": 1616564612.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I think it's common that your perception of who is hostile to whom depends on group you're in :)  I think there's plenty of sniping to go around ... but this post is less about pointing fingers, than ensuring slf tells its own story, and addresses the most pressing issue -- that SBs don't feel free to discuss their issues here.  But that doesn't mean there aren't other issues to discuss a different day.  And yes, brigading and dogpiling is far from a single-gender behavior.\n\n> Curious about this, you mean someone who openly promotes RP philosophy here or because it's branded as misogynistic by some? \n\nI'm using the term sloppily and somewhat inaccurately for those who show disdain for women and have a \"you're getting paid just do it\" attitude, which is the most common type I come across (and end up banning).  When I look in their post histories, it's common they're active in an mgtow or redpill sub, but not always.  I'm sure I'm not using the term accurately",
            "author": "Azurecole",
            "id": "grzs4bt",
            "parent_id": "t1_grzo1ag",
            "score": 2,
            "created_utc": 1616545128.0,
            "replies": [
                {
                    "body": ">SBs don't feel free to discuss their issues here.\n\nIf that's the feedback you're getting as mods, definitely need to address this.  If you have surveyed this it would be interesting to see the results and why some SBs feel this way.  May give SDs pause with regard to how we comment.\n\nMGTOW generally identify as fervent anti-feminists who decry gynocentric laws, legal bias, blatant misandry in its many forms, promiscuity, hypergamy, demonization of masculinity etc. and promote avoidance of any form of pair bonding (cohabitation) or even socializing with women.  This hyper critical community is championed by various influencers like Sandman and have a dystopian view of the future of society. Collectively they definitely have disdain for women, especially feminists, openly express it and few would be SDs.\n\nRed Pill (using the Matrix metaphor for accepting gender dynamic realities) as a movement/community tends to be more measured in its assessment of, and in raising awareness of, the realities and associated risks of pair bonding with women but don't eschew engagement or intimate relationships with them.  Redpillars as you refer to them are definitely open to SRs and less likely to be a nuisance here. The true focus of RP philosophy is more about helping men to become better versions of themselves and not misogynistic in nature as opponents claim so as to dismiss and denigrate out of ignorance.\n\nWhile there are definite distinctions between mgtow and RP adherents, both share similar views on many topics and my descriptions are very summary of course.  As such, I don't wish engage in disputes about my characterizations of these movements here.",
                    "author": "Jeff_M3",
                    "id": "gs0ajpp",
                    "parent_id": "t1_grzs4bt",
                    "score": 1,
                    "created_utc": 1616554809.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I see you may have posted a number which is most likely an amount in relations to an arrangement. If this is the case, you are violating Rule#4 - \"No dollar amounts that are in reference to allowance/PPM are allowed.\"\n\n\nIf you are curious about Allowances reported by SLF contributors please see the [Allowance Master Thread 2020-2021](https://www.reddit.com/r/sugarlifestyleforum/comments/ja37xt/allowance_master_thread_20202021/)\n\nYour post will not be approved until you remove the amount.  Please read the sub [Rules](https://www.reddit.com/r/sugarlifestyleforum/comments/748zta/updated_and_clarified_rules_for_slf/) prior to posting anything else. \n\nIf you simply posted a number not referencing a monetary amount, please message the MODs to approve your post.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/sugarlifestyleforum) if you have any questions or concerns.*",
            "author": "AutoModerator",
            "id": "gshdbpp",
            "parent_id": "t1_gshdbmt",
            "score": 1,
            "created_utc": 1616867012.0,
            "replies": []
        },
        {
            "body": "Hi, slf doesn't sponsor any outside communities (telegram, discord, etc) and doesn't allow any to be advertised here.  There are a whole bunch of people who have formed their own communities; since they can't advertise here, they tend to find you -- you post here enough, eventually people notice you and invite you to their discord/telegram/etc",
            "author": "Azurecole",
            "id": "hvpy754",
            "parent_id": "t1_hvoqrju",
            "score": 1,
            "created_utc": 1644082058.0,
            "replies": [
                {
                    "body": "Thank you for your help :)",
                    "author": "firecherry200",
                    "id": "hvs2kcz",
                    "parent_id": "t1_hvpy754",
                    "score": 1,
                    "created_utc": 1644120419.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I second this. Just yesterday some man referred to an SBs \"market value.\" Disgusted.",
            "author": "viewfrom61",
            "id": "gs01bej",
            "parent_id": "t1_grzex2b",
            "score": 8,
            "created_utc": 1616549888.0,
            "replies": []
        },
        {
            "body": "This is one of the reasons many people on this sub take a harsh view on platonic arrangements.  We all know there are a lot of bad actors (I'm not going to call them SDs) that will try to push (typically young/naïve) women into it - despite them being very clear about platonic from day 1.  I'm not saying platonic doesn't exist - but it's rare.  And many of the guys that go after platonic women have ulterior motives.  \n\nIt's a tough line between providing full support, but also trying to help the person unlearn the lies from tiktok and youtube - that are just likely to lead the person into a similar situation again.",
            "author": "SDstartingOut",
            "id": "gs1hboa",
            "parent_id": "t1_gs0t49g",
            "score": 4,
            "created_utc": 1616589084.0,
            "replies": [
                {
                    "body": "It will lead her back into that situation again because she doesn't know anything about men.  One thing for sure men has definitely changed since these SB/SD websites have popped up.  I'm sure I had some creeps in my life, but my experience with men was overwhelmingly positive.  I didn't have a problem with men trying to force me to do something I didn't want to do, and I still laid in the same bed with them.",
                    "author": "Darknlovely38",
                    "id": "h54kzbw",
                    "parent_id": "t1_gs1hboa",
                    "score": 1,
                    "created_utc": 1626243836.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I think this is because most guys, especially the young men under 50, see it as a quid pro quo, which means a favor or advantage granted or expected in return for something.  Let me ask you something, did any of your boyfriends expect a fuck after a date or two, and did you oblige? An S/D is supposed to be a boyfriend, but one who actually has money to put in your pocket!  Sweetheart, the only man who will give you money and don't want sex from you is your biological father.  By the way, your boyfriend is pimping you, if he's okay with you going out with men for money.",
            "author": "Darknlovely38",
            "id": "h54jowy",
            "parent_id": "t1_gs0t49g",
            "score": 1,
            "created_utc": 1626242773.0,
            "replies": []
        },
        {
            "body": "I'll second AZs comment on questioning a mod act if you feel your post was within the letter of and spirit of the rules and culture. \n\nI'll generally go through the harvest of posts waiting for mod review late in the evening on the west coast, after the other mods have done the heavy lifting and as a result of the hour, occasionally an innocent party gets the hammer. \n\nIt may be by accident or simply patience pushed too far by those nibbling at the edge of the rules envelope.  \n\nIf you feel you have been wronged check your post, check the rules and make a good faith presentation.  If it relates to something I flagged I will correct the act if I think you are right or leave it for another mod to make the final call .",
            "author": "pinotandsugar",
            "id": "grz1e9u",
            "parent_id": "t1_gryqqpz",
            "score": 6,
            "created_utc": 1616532570.0,
            "replies": []
        },
        {
            "body": "Dude this was 3 days ago. Lol",
            "author": "uniballSD",
            "id": "gsharu9",
            "parent_id": "t1_gsh9vqh",
            "score": 1,
            "created_utc": 1616866390.0,
            "replies": []
        },
        {
            "body": ">  I do believe it happens more in one direction than the other though, if I\"m being honest\n\nI concur with this assessment.",
            "author": "Y_4Z44",
            "id": "grz90id",
            "parent_id": "t1_gryv8nb",
            "score": 2,
            "created_utc": 1616535860.0,
            "replies": []
        },
        {
            "body": "I agree that someone that has experienced a traumatic event should be able to talk about it without fear of disparagement.  Which is why I don't think a sub like this is the right place for such discussion.  \n\nBy that, I mean if you want 100% support then you need to be in a place that caters to that issue, otherwise you WILL get disagreement, and with 100,000 members, some of that disagreement is going to be insensitive to the issue.\n\nMy point is that SLF, given its diverse makeup, isn't a great place for discussion of sensitive topics that can further traumatize people.  And i don't think trying to force the population of the sub to bite their tongues is going to be a fruitful endeaver... \n\nBut hey, it's your party so if that's how you want to spend your time... oh well",
            "author": "Acrobatic_Half_6631",
            "id": "gs0gxls",
            "parent_id": "t1_gryv8nb",
            "score": -2,
            "created_utc": 1616558652.0,
            "replies": [
                {
                    "body": "> And i don't think trying to force the population of the sub to bite their tongues is going to be a fruitful endeaver...\n\nWhat would be so difficult about reading the post and moving the hell on **without** a comment about whether it was technically or legally rape? This isn't a law forum.",
                    "author": "LaSirene23",
                    "id": "gs0i02w",
                    "parent_id": "t1_gs0gxls",
                    "score": 12,
                    "created_utc": 1616559357.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Just seeking clarification if there was another line of delineation not readily made known.",
            "author": "KittenReigns",
            "id": "grzgbu5",
            "parent_id": "t1_grzfxxf",
            "score": 4,
            "created_utc": 1616539239.0,
            "replies": [
                {
                    "body": "It's a good question.  I'd prefer lots of room for people to define sugar for themselves, with some guardrails on what it's definitely not",
                    "author": "Azurecole",
                    "id": "grznseo",
                    "parent_id": "t1_grzgbu5",
                    "score": 4,
                    "created_utc": 1616542924.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "This is like saying all lives matter. \n\nYes, women can be toxic. But men being unempathetic about rape on r/slf is a common pattern of male behavior. Women can also be unempathetic about rape, but not in any notable way I've seen on here.",
            "author": "RadicalSugar",
            "id": "gshbi2n",
            "parent_id": "t1_grz1oeb",
            "score": 2,
            "created_utc": 1616866567.0,
            "replies": []
        },
        {
            "body": "It’s okay to just leave it at toxic masculinity. \nAdd on toxic female behavior too, if you will, but it’s *really* important to call out toxic masculinity by name",
            "author": "whatwouldjunedo",
            "id": "grzdjdt",
            "parent_id": "t1_grz1oeb",
            "score": 5,
            "created_utc": 1616537924.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "gs0e77v",
                    "parent_id": "t1_grzdjdt",
                    "score": 2,
                    "created_utc": 1616556936.0,
                    "replies": [
                        {
                            "body": "Toxic behavior from any gender is bad.  \nWe just want it stated clearly that  \n**TOXIC MASCULINITY IS BAD**\n\nWhy is there always pushback when anyone says that??  \nYa but not all men.  \nYa but not me.  \nYa but women are toxic too sometimes!  \nYa but what about sex workers being toxic??  \n\n\nCool cool. All great points.  \nAll we want to say is that  \n**TOXIC MASCULINITY SUCKS**\n\nDon’t bury our message with your “ya but” bullshit. \n\nJust respond with something positive like “*totally! toxic masculinity does suck! And it’s terrible that it’s so pervasive and so widely accepted! I hate it when some men act like that*”. \n\nBasically any other answer makes you part of the problem.",
                            "author": "whatwouldjunedo",
                            "id": "gs0elqp",
                            "parent_id": "t1_gs0e77v",
                            "score": 5,
                            "created_utc": 1616557183.0,
                            "replies": [
                                {
                                    "body": "A lot of people damage their message by demanding that other's use their terminology.    \n\nAnd NO, a person is not  automatically part of any problem just because they do not use the favored terminology of a group of people.",
                                    "author": "pinotandsugar",
                                    "id": "gs0i46b",
                                    "parent_id": "t1_gs0elqp",
                                    "score": 2,
                                    "created_utc": 1616559435.0,
                                    "replies": []
                                },
                                {
                                    "body": "Is it possible for women to be toxic?",
                                    "author": "UnearthlyDinosaur",
                                    "id": "gs0lzab",
                                    "parent_id": "t1_gs0elqp",
                                    "score": 1,
                                    "created_utc": 1616562175.0,
                                    "replies": [
                                        {
                                            "body": "Is that a repeated and common issue in the sexual assault threads?",
                                            "author": "RadicalSugar",
                                            "id": "gshbtb5",
                                            "parent_id": "t1_gs0lzab",
                                            "score": 3,
                                            "created_utc": 1616866641.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "> Let’s just agree we don’t like toxic behavior.\n\namended \n\nLet’s just agree we will not encourage or  tolerate  toxic behavior.............  ( simplicity is the ultimate sophistication)",
                            "author": "pinotandsugar",
                            "id": "gs0hoeu",
                            "parent_id": "t1_gs0e77v",
                            "score": -1,
                            "created_utc": 1616559138.0,
                            "replies": [
                                {
                                    "body": "It’s not “simplicity at its best” to try to put a gag on someone for uttering the phrase “**toxic masculinity is bad**”.\n\nWhat’s simple is to just say nothing, or if you agree, to say that.\n\nThere’s absolutely no simplicity or sophistication in trying to be suave about getting someone to stop saying that **toxic masculinity is bad**.\n \nIf i make a post saying “I think the taste of lime juice is bad” you won’t see a dozen men swooping in going “Yes lime juice is bad, but lemon juice can be bad sometimes too, you know! Why single out limes??”\n\nIf a woman wants to say that she thinks toxic masculinity is bad, why can’t men just let her make that statement without swarming all over her with the “ya but” rebuttal?\n\nIf you’re not part of the problem then you shouldn’t feel attacked in any way. The statement that “toxic masculinity is bad” is only attacking the toxic male. Those men do not need to be defended. They need to be counseled and reformed, so as to stop hurting themselves and others!",
                                    "author": "whatwouldjunedo",
                                    "id": "gs0i4bg",
                                    "parent_id": "t1_gs0hoeu",
                                    "score": 2,
                                    "created_utc": 1616559438.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I absolutely agree and I'm preaching to most of the choir. I'm not talking about controversial topics and the mods almost never seem to ban do to topic, rather for lack of decorum. I refer to the small number of people who get so angry (repeatedly) that they can't discuss those topics without getting nasty. As was the case in this latest incident. \n\n\nI look at it this way. Among my two closest friends. One is a polar opposite from me politically, but  we have wonderful insightful debates because we can do so calmly. The other is very close to me politically, but I avoid any type of debate because he gets angry and rude. For me, the topic isn't always as important as the ability to discuss rationally.\n\n\nAs an old school SR guy. I advocate for the older, slower ways because I remember how much better and safer the bowl was and I catch some shit for it. I join you in wanting the bowl to be a better place. That's largely why I am here. I'm not even in market because my sugar situation is pretty settled in. I'm here for the love of the bowl. And to riff jokes.",
            "author": "OldschoolSD",
            "id": "gs0s760",
            "parent_id": "t1_gs064jm",
            "score": 2,
            "created_utc": 1616567409.0,
            "replies": []
        },
        {
            "body": "My therapist keeps on telling me to not argue with people online.\n\nI always say, \"But then I wouldn't need to see you anymore.\"",
            "author": "RadicalSugar",
            "id": "gshcpoc",
            "parent_id": "t1_gs064jm",
            "score": 2,
            "created_utc": 1616866862.0,
            "replies": []
        },
        {
            "body": "I get that. My point is more aimed at people who come to argue.",
            "author": "OldschoolSD",
            "id": "gs0p00n",
            "parent_id": "t1_gs0kiwf",
            "score": 1,
            "created_utc": 1616564612.0,
            "replies": []
        },
        {
            "body": ">SBs don't feel free to discuss their issues here.\n\nIf that's the feedback you're getting as mods, definitely need to address this.  If you have surveyed this it would be interesting to see the results and why some SBs feel this way.  May give SDs pause with regard to how we comment.\n\nMGTOW generally identify as fervent anti-feminists who decry gynocentric laws, legal bias, blatant misandry in its many forms, promiscuity, hypergamy, demonization of masculinity etc. and promote avoidance of any form of pair bonding (cohabitation) or even socializing with women.  This hyper critical community is championed by various influencers like Sandman and have a dystopian view of the future of society. Collectively they definitely have disdain for women, especially feminists, openly express it and few would be SDs.\n\nRed Pill (using the Matrix metaphor for accepting gender dynamic realities) as a movement/community tends to be more measured in its assessment of, and in raising awareness of, the realities and associated risks of pair bonding with women but don't eschew engagement or intimate relationships with them.  Redpillars as you refer to them are definitely open to SRs and less likely to be a nuisance here. The true focus of RP philosophy is more about helping men to become better versions of themselves and not misogynistic in nature as opponents claim so as to dismiss and denigrate out of ignorance.\n\nWhile there are definite distinctions between mgtow and RP adherents, both share similar views on many topics and my descriptions are very summary of course.  As such, I don't wish engage in disputes about my characterizations of these movements here.",
            "author": "Jeff_M3",
            "id": "gs0ajpp",
            "parent_id": "t1_grzs4bt",
            "score": 1,
            "created_utc": 1616554809.0,
            "replies": []
        },
        {
            "body": "Thank you for your help :)",
            "author": "firecherry200",
            "id": "hvs2kcz",
            "parent_id": "t1_hvpy754",
            "score": 1,
            "created_utc": 1644120419.0,
            "replies": []
        },
        {
            "body": "It will lead her back into that situation again because she doesn't know anything about men.  One thing for sure men has definitely changed since these SB/SD websites have popped up.  I'm sure I had some creeps in my life, but my experience with men was overwhelmingly positive.  I didn't have a problem with men trying to force me to do something I didn't want to do, and I still laid in the same bed with them.",
            "author": "Darknlovely38",
            "id": "h54kzbw",
            "parent_id": "t1_gs1hboa",
            "score": 1,
            "created_utc": 1626243836.0,
            "replies": []
        },
        {
            "body": "> And i don't think trying to force the population of the sub to bite their tongues is going to be a fruitful endeaver...\n\nWhat would be so difficult about reading the post and moving the hell on **without** a comment about whether it was technically or legally rape? This isn't a law forum.",
            "author": "LaSirene23",
            "id": "gs0i02w",
            "parent_id": "t1_gs0gxls",
            "score": 12,
            "created_utc": 1616559357.0,
            "replies": []
        },
        {
            "body": "It's a good question.  I'd prefer lots of room for people to define sugar for themselves, with some guardrails on what it's definitely not",
            "author": "Azurecole",
            "id": "grznseo",
            "parent_id": "t1_grzgbu5",
            "score": 4,
            "created_utc": 1616542924.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gs0e77v",
            "parent_id": "t1_grzdjdt",
            "score": 2,
            "created_utc": 1616556936.0,
            "replies": [
                {
                    "body": "Toxic behavior from any gender is bad.  \nWe just want it stated clearly that  \n**TOXIC MASCULINITY IS BAD**\n\nWhy is there always pushback when anyone says that??  \nYa but not all men.  \nYa but not me.  \nYa but women are toxic too sometimes!  \nYa but what about sex workers being toxic??  \n\n\nCool cool. All great points.  \nAll we want to say is that  \n**TOXIC MASCULINITY SUCKS**\n\nDon’t bury our message with your “ya but” bullshit. \n\nJust respond with something positive like “*totally! toxic masculinity does suck! And it’s terrible that it’s so pervasive and so widely accepted! I hate it when some men act like that*”. \n\nBasically any other answer makes you part of the problem.",
                    "author": "whatwouldjunedo",
                    "id": "gs0elqp",
                    "parent_id": "t1_gs0e77v",
                    "score": 5,
                    "created_utc": 1616557183.0,
                    "replies": [
                        {
                            "body": "A lot of people damage their message by demanding that other's use their terminology.    \n\nAnd NO, a person is not  automatically part of any problem just because they do not use the favored terminology of a group of people.",
                            "author": "pinotandsugar",
                            "id": "gs0i46b",
                            "parent_id": "t1_gs0elqp",
                            "score": 2,
                            "created_utc": 1616559435.0,
                            "replies": []
                        },
                        {
                            "body": "Is it possible for women to be toxic?",
                            "author": "UnearthlyDinosaur",
                            "id": "gs0lzab",
                            "parent_id": "t1_gs0elqp",
                            "score": 1,
                            "created_utc": 1616562175.0,
                            "replies": [
                                {
                                    "body": "Is that a repeated and common issue in the sexual assault threads?",
                                    "author": "RadicalSugar",
                                    "id": "gshbtb5",
                                    "parent_id": "t1_gs0lzab",
                                    "score": 3,
                                    "created_utc": 1616866641.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "> Let’s just agree we don’t like toxic behavior.\n\namended \n\nLet’s just agree we will not encourage or  tolerate  toxic behavior.............  ( simplicity is the ultimate sophistication)",
                    "author": "pinotandsugar",
                    "id": "gs0hoeu",
                    "parent_id": "t1_gs0e77v",
                    "score": -1,
                    "created_utc": 1616559138.0,
                    "replies": [
                        {
                            "body": "It’s not “simplicity at its best” to try to put a gag on someone for uttering the phrase “**toxic masculinity is bad**”.\n\nWhat’s simple is to just say nothing, or if you agree, to say that.\n\nThere’s absolutely no simplicity or sophistication in trying to be suave about getting someone to stop saying that **toxic masculinity is bad**.\n \nIf i make a post saying “I think the taste of lime juice is bad” you won’t see a dozen men swooping in going “Yes lime juice is bad, but lemon juice can be bad sometimes too, you know! Why single out limes??”\n\nIf a woman wants to say that she thinks toxic masculinity is bad, why can’t men just let her make that statement without swarming all over her with the “ya but” rebuttal?\n\nIf you’re not part of the problem then you shouldn’t feel attacked in any way. The statement that “toxic masculinity is bad” is only attacking the toxic male. Those men do not need to be defended. They need to be counseled and reformed, so as to stop hurting themselves and others!",
                            "author": "whatwouldjunedo",
                            "id": "gs0i4bg",
                            "parent_id": "t1_gs0hoeu",
                            "score": 2,
                            "created_utc": 1616559438.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Toxic behavior from any gender is bad.  \nWe just want it stated clearly that  \n**TOXIC MASCULINITY IS BAD**\n\nWhy is there always pushback when anyone says that??  \nYa but not all men.  \nYa but not me.  \nYa but women are toxic too sometimes!  \nYa but what about sex workers being toxic??  \n\n\nCool cool. All great points.  \nAll we want to say is that  \n**TOXIC MASCULINITY SUCKS**\n\nDon’t bury our message with your “ya but” bullshit. \n\nJust respond with something positive like “*totally! toxic masculinity does suck! And it’s terrible that it’s so pervasive and so widely accepted! I hate it when some men act like that*”. \n\nBasically any other answer makes you part of the problem.",
            "author": "whatwouldjunedo",
            "id": "gs0elqp",
            "parent_id": "t1_gs0e77v",
            "score": 5,
            "created_utc": 1616557183.0,
            "replies": [
                {
                    "body": "A lot of people damage their message by demanding that other's use their terminology.    \n\nAnd NO, a person is not  automatically part of any problem just because they do not use the favored terminology of a group of people.",
                    "author": "pinotandsugar",
                    "id": "gs0i46b",
                    "parent_id": "t1_gs0elqp",
                    "score": 2,
                    "created_utc": 1616559435.0,
                    "replies": []
                },
                {
                    "body": "Is it possible for women to be toxic?",
                    "author": "UnearthlyDinosaur",
                    "id": "gs0lzab",
                    "parent_id": "t1_gs0elqp",
                    "score": 1,
                    "created_utc": 1616562175.0,
                    "replies": [
                        {
                            "body": "Is that a repeated and common issue in the sexual assault threads?",
                            "author": "RadicalSugar",
                            "id": "gshbtb5",
                            "parent_id": "t1_gs0lzab",
                            "score": 3,
                            "created_utc": 1616866641.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "> Let’s just agree we don’t like toxic behavior.\n\namended \n\nLet’s just agree we will not encourage or  tolerate  toxic behavior.............  ( simplicity is the ultimate sophistication)",
            "author": "pinotandsugar",
            "id": "gs0hoeu",
            "parent_id": "t1_gs0e77v",
            "score": -1,
            "created_utc": 1616559138.0,
            "replies": [
                {
                    "body": "It’s not “simplicity at its best” to try to put a gag on someone for uttering the phrase “**toxic masculinity is bad**”.\n\nWhat’s simple is to just say nothing, or if you agree, to say that.\n\nThere’s absolutely no simplicity or sophistication in trying to be suave about getting someone to stop saying that **toxic masculinity is bad**.\n \nIf i make a post saying “I think the taste of lime juice is bad” you won’t see a dozen men swooping in going “Yes lime juice is bad, but lemon juice can be bad sometimes too, you know! Why single out limes??”\n\nIf a woman wants to say that she thinks toxic masculinity is bad, why can’t men just let her make that statement without swarming all over her with the “ya but” rebuttal?\n\nIf you’re not part of the problem then you shouldn’t feel attacked in any way. The statement that “toxic masculinity is bad” is only attacking the toxic male. Those men do not need to be defended. They need to be counseled and reformed, so as to stop hurting themselves and others!",
                    "author": "whatwouldjunedo",
                    "id": "gs0i4bg",
                    "parent_id": "t1_gs0hoeu",
                    "score": 2,
                    "created_utc": 1616559438.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "A lot of people damage their message by demanding that other's use their terminology.    \n\nAnd NO, a person is not  automatically part of any problem just because they do not use the favored terminology of a group of people.",
            "author": "pinotandsugar",
            "id": "gs0i46b",
            "parent_id": "t1_gs0elqp",
            "score": 2,
            "created_utc": 1616559435.0,
            "replies": []
        },
        {
            "body": "Is it possible for women to be toxic?",
            "author": "UnearthlyDinosaur",
            "id": "gs0lzab",
            "parent_id": "t1_gs0elqp",
            "score": 1,
            "created_utc": 1616562175.0,
            "replies": [
                {
                    "body": "Is that a repeated and common issue in the sexual assault threads?",
                    "author": "RadicalSugar",
                    "id": "gshbtb5",
                    "parent_id": "t1_gs0lzab",
                    "score": 3,
                    "created_utc": 1616866641.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "It’s not “simplicity at its best” to try to put a gag on someone for uttering the phrase “**toxic masculinity is bad**”.\n\nWhat’s simple is to just say nothing, or if you agree, to say that.\n\nThere’s absolutely no simplicity or sophistication in trying to be suave about getting someone to stop saying that **toxic masculinity is bad**.\n \nIf i make a post saying “I think the taste of lime juice is bad” you won’t see a dozen men swooping in going “Yes lime juice is bad, but lemon juice can be bad sometimes too, you know! Why single out limes??”\n\nIf a woman wants to say that she thinks toxic masculinity is bad, why can’t men just let her make that statement without swarming all over her with the “ya but” rebuttal?\n\nIf you’re not part of the problem then you shouldn’t feel attacked in any way. The statement that “toxic masculinity is bad” is only attacking the toxic male. Those men do not need to be defended. They need to be counseled and reformed, so as to stop hurting themselves and others!",
            "author": "whatwouldjunedo",
            "id": "gs0i4bg",
            "parent_id": "t1_gs0hoeu",
            "score": 2,
            "created_utc": 1616559438.0,
            "replies": []
        },
        {
            "body": "Is that a repeated and common issue in the sexual assault threads?",
            "author": "RadicalSugar",
            "id": "gshbtb5",
            "parent_id": "t1_gs0lzab",
            "score": 3,
            "created_utc": 1616866641.0,
            "replies": []
        }
    ]
}