{
    "title": "Busting a nut",
    "post_id": "lsb75e",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/lsb75e/busting_a_nut/",
    "author": "TastySpermDispenser",
    "body": "I brought my Wii over to the W Hollywood.  I've known this SB almost a year, and she is still one of those optimistic \"mom said I can do anything\" types.  So I figured it was time to show her the truth. We live in a dystopian reality where there is only me, and inferior Mario Kart players.  It's a harsh lesson, but one that all people must learn sooner or later.  Just before the first race starts, I get up to chug the rest of my pear mojito, and then settle in to crush some electronic dreams.\n#\nThat's when I sat on my own testicle.\n#\nI kind of consider myself an expert in sitting down.  Even more so, I am a scrawny dude.  I don't even have an ass; its like a long back that just turns into some legs at some point back there.  Chairs are basically something I ride cowgirl style, so it should be mathematically impossible for me to injure myself.... but I did.  The pain was immeasurable, even in metric.  I prayed for sweet, sweet death to end my misery.\n#\nNow you guys know that I am into some kinky stuff.  But let me tell you, the weirdest sugar date ever, is hands down, a grown, old ass man sobbing loudly while almost lapping a girl on peach beach.  As a result of the fact that I was the victim of a testicular homicide, I am humiliated to say that I won only 4 out of 5 cups.\n#\nAfter that, I was able to power through sex like an absolute HERO.  I was such a champion, that they even did that thing where they throw gatorade on your head, like that super ball game that gets you guys all hot and bothered. It wasn't gatorade though, it was wine.  And it wasn't other people throwing it on me, it was me splashing wine on myself. And it was mainly because I tripped over my bag on the way to the shower. But other than that, it was exactly like a championship sports ball.\n#\nAs soon as I was out of the shower, my SB starts throwing wild, unsubstantiated accusations all over the place.  Including:\n#\nA.  It's unfair to use funky kong and baby Luigi, since they are faster than everyone else.\n#\nB. It's rude to push girls into penguins.  (Technically that's why I am not allowed within 500 feet of zoos, but if security can't get me to stop, it's only fair that a hot chick shouldn't be able to either.)\n#\nC. It's cheating to use a sweaty boost at the start of a race.  (Yeah, like LA driver's don't hold down the accelerator before the light turns green as part of normal operating procedure).\n#\nD. And worst of all - She accused me of FAKING my injury, to justify the fact that I didn't win every time.  Come on! A man can't fake being murdered from the waist down. Besides, if I was going to fake an injury to excuse my poor performance, it would have been the 30 or so times we had sex, not Mario Kart.  Hell, if that works, imma start telling girls my dick is normally bigger, when I don't have a stubbed toe.\n#\nIf you guys need me, I am going to be sitting on ice.",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/lsb75e/busting_a_nut/",
    "score": 195,
    "upvote_ratio": 0.92,
    "created_utc": 1614272407.0,
    "num_comments": 49,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "[deleted]",
            "author": null,
            "id": "goq7rz2",
            "parent_id": "t3_lsb75e",
            "score": 44,
            "created_utc": 1614274424.0,
            "replies": [
                {
                    "body": "Wow... wow. Way to blame the victim sir.",
                    "author": "TastySpermDispenser",
                    "id": "goq8wcd",
                    "parent_id": "t1_goq7rz2",
                    "score": 50,
                    "created_utc": 1614274892.0,
                    "replies": [
                        {
                            "body": "Lmao",
                            "author": "ZoloftXL",
                            "id": "gorx01g",
                            "parent_id": "t1_goq8wcd",
                            "score": 4,
                            "created_utc": 1614300208.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Have I entered Reddit premium with this eloquently written post?",
            "author": "Natsume3322",
            "id": "goqfxxb",
            "parent_id": "t3_lsb75e",
            "score": 25,
            "created_utc": 1614277562.0,
            "replies": [
                {
                    "body": "The fact that you can read two sentences and can already tell who posted it. It's definitely premium, I'll pay for this over SA any day",
                    "author": "HunHanMyBias",
                    "id": "gotjllz",
                    "parent_id": "t1_goqfxxb",
                    "score": 7,
                    "created_utc": 1614340816.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "“We live in a dystopian reality where there is only me, and inferior Mario Kart players.”\n\nThat sounds like something someone who I would absolutely crush in Mario Kart would say.",
            "author": "duderancherooni",
            "id": "goqvw4o",
            "parent_id": "t3_lsb75e",
            "score": 25,
            "created_utc": 1614283636.0,
            "replies": []
        },
        {
            "body": "I am fucking crying from laughter and I'm currently working with children so when they asked \"Miss Shae, what's so funny, can I see?\" I'm at a complete and total loss for even a feeble attempt at a lie.",
            "author": "DesertShae",
            "id": "gor5qck",
            "parent_id": "t3_lsb75e",
            "score": 8,
            "created_utc": 1614287613.0,
            "replies": []
        },
        {
            "body": "Wtf did I just read?!\nIdk why I'm living for this haha",
            "author": "Ashleycakessssss",
            "id": "goqihr2",
            "parent_id": "t3_lsb75e",
            "score": 9,
            "created_utc": 1614278478.0,
            "replies": [
                {
                    "body": "*Wtf did I*\n\n*Just read?! Idk why I'm*\n\n*Living for this haha*\n\n\\- Ashleycakessssss\n\n---\n\n^(I detect haikus. And sometimes, successfully.) ^[Learn&#32;more&#32;about&#32;me.](https://www.reddit.com/r/haikusbot/)\n\n^(Opt out of replies: \"haikusbot opt out\" | Delete my comment: \"haikusbot delete\")",
                    "author": "haikusbot",
                    "id": "goqij38",
                    "parent_id": "t1_goqihr2",
                    "score": 13,
                    "created_utc": 1614278492.0,
                    "replies": [
                        {
                            "body": "Third line is too many syllables pal",
                            "author": "ColdHeaux",
                            "id": "got5iqx",
                            "parent_id": "t1_goqij38",
                            "score": 3,
                            "created_utc": 1614327874.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I hate to break it to you, but I am the reigning Mario Kart queen. I’ve been honing my skills since I was kid and hate playing against most people since they suck (and I’m just so bomb). You, however, would be quite the worthy opponent as your utterly humiliating *defeat* would be so comforting and affirming. \n\nAlso, real dick injuries or not, champs should push through the pain! I got kicked in my kitty by my cousin on accident one day while we were playing and still won all 3 cups against my opponent. You should be ashamed of yourself.",
            "author": "sizzlepopsun",
            "id": "gor8fx0",
            "parent_id": "t3_lsb75e",
            "score": 10,
            "created_utc": 1614288747.0,
            "replies": [
                {
                    "body": "Well, I would propose a contest that doesnt involve physical injury. Not that I am afraid of a little pain, but hiring children to kick us in the junk before a mario kart tournament sounds illegal.\n#\nI have always wondered who is the second best mario kart racer ever.  :)",
                    "author": "TastySpermDispenser",
                    "id": "gorfv7i",
                    "parent_id": "t1_gor8fx0",
                    "score": 10,
                    "created_utc": 1614291974.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Old school Wii Mario Cart.  You are the Rainbow Road champ.",
            "author": "JeromeAniton",
            "id": "goq3xj1",
            "parent_id": "t3_lsb75e",
            "score": 10,
            "created_utc": 1614272822.0,
            "replies": [
                {
                    "body": "I'll have two of whatever he is having,  on the rocks",
                    "author": "pinotandsugar",
                    "id": "gor7twy",
                    "parent_id": "t1_goq3xj1",
                    "score": 2,
                    "created_utc": 1614288489.0,
                    "replies": []
                },
                {
                    "body": "Is the n64 version older school?",
                    "author": "fakemoose",
                    "id": "gosuao2",
                    "parent_id": "t1_goq3xj1",
                    "score": 1,
                    "created_utc": 1614318601.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Replace Mario Kart with Air Hockey? And the fact I never crushed my own testicle? Then we're brothers from another mother. \n\nI am a very VERY sore winner at Air Hockey. I have made even the hottest women devolve into absolute nightmare harpies losing to me and my smack talk. \n\nIt's both very enlightening *and* frightening to watch an SB practically leap across the playing field in a vain attempt to open one of my veins. \n\nOh. And yes. I *do* win every single time. Always will.",
            "author": "SDRippington",
            "id": "goq8k97",
            "parent_id": "t3_lsb75e",
            "score": 6,
            "created_utc": 1614274751.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "goqcadt",
                    "parent_id": "t1_goq8k97",
                    "score": 6,
                    "created_utc": 1614276260.0,
                    "replies": [
                        {
                            "body": "Yeah. It's a character flaw. Im an asshole when I win at Air hockey... lol",
                            "author": "SDRippington",
                            "id": "goqliuc",
                            "parent_id": "t1_goqcadt",
                            "score": 4,
                            "created_utc": 1614279553.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I have to say, the first time you sit on a testicle is a truly humbling experience. The casual arrogance of youth disappears instantly as you realise it was all hubris, your body will betray you with age in ways you never expected or could even conceive. \n\nIt fucking hurts too.",
            "author": "SD-throwaway77",
            "id": "gor78w4",
            "parent_id": "t3_lsb75e",
            "score": 3,
            "created_utc": 1614288243.0,
            "replies": [
                {
                    "body": "I'm still trying to think of how it's even possible...like, donch'y'all sit on them every day???",
                    "author": "ShaArt5",
                    "id": "gotxakd",
                    "parent_id": "t1_gor78w4",
                    "score": 2,
                    "created_utc": 1614349148.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "This is the best thing I've read in months. Sorry about your raisin.",
            "author": "Undertow83",
            "id": "gos81ho",
            "parent_id": "t3_lsb75e",
            "score": 3,
            "created_utc": 1614305783.0,
            "replies": []
        },
        {
            "body": "Sorry about your Nut.\n\nBut I took my ex sgf to a retro arcade bar.  And just whooped her senseless in every game. Worst gamer ever.\n\nShe thought she would do better at mortal combat and somehow did a 16 fighter tournament.  Was trying to let her win.  But was like baby you can't just duck down and cover your head...lol\n\nWe had fun though",
            "author": "Buckeyechamp21",
            "id": "goq9mui",
            "parent_id": "t3_lsb75e",
            "score": 6,
            "created_utc": 1614275194.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "goqeyc6",
            "parent_id": "t3_lsb75e",
            "score": 4,
            "created_utc": 1614277207.0,
            "replies": [
                {
                    "body": "Sure. As long as we play IRL on Ventura blvd, and not some weak ass video game.",
                    "author": "TastySpermDispenser",
                    "id": "goqg9d8",
                    "parent_id": "t1_goqeyc6",
                    "score": 6,
                    "created_utc": 1614277673.0,
                    "replies": [
                        {
                            "body": "The new one on Lankershim has got me like 👀",
                            "author": null,
                            "id": "goqxvzv",
                            "parent_id": "t1_goqg9d8",
                            "score": 3,
                            "created_utc": 1614284454.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "I think you may have missed the part where he said he has no butt. 🤣",
                    "author": "B1oodSugarSexMagik",
                    "id": "gospwam",
                    "parent_id": "t1_goqeyc6",
                    "score": 2,
                    "created_utc": 1614315633.0,
                    "replies": []
                },
                {
                    "body": "I am Undefeated in Galaga BTW.",
                    "author": "Buckeyechamp21",
                    "id": "goqjfl2",
                    "parent_id": "t1_goqeyc6",
                    "score": 2,
                    "created_utc": 1614278813.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Mario Kart Wii is the best Mario Kart ever.\nSuper Mario Galaxy Wii is fun/cute/ relaxing to play with someone if you’re not feeling competitive",
            "author": "sweet_ging",
            "id": "gor2vrq",
            "parent_id": "t3_lsb75e",
            "score": 2,
            "created_utc": 1614286461.0,
            "replies": []
        },
        {
            "body": "taking notes      \"stubbed toe...\"",
            "author": "KnottySexAcct",
            "id": "gorlmea",
            "parent_id": "t3_lsb75e",
            "score": 2,
            "created_utc": 1614294616.0,
            "replies": []
        },
        {
            "body": "This made my day. Excellence",
            "author": "lowyellyow",
            "id": "gortc4m",
            "parent_id": "t3_lsb75e",
            "score": 2,
            "created_utc": 1614298401.0,
            "replies": []
        },
        {
            "body": "oh my god i love you",
            "author": "sbluxx",
            "id": "gorvgqo",
            "parent_id": "t3_lsb75e",
            "score": 2,
            "created_utc": 1614299446.0,
            "replies": []
        },
        {
            "body": "what a fucking dreamy sug date 🥺🖤",
            "author": "Candid_Youth",
            "id": "gorw0gm",
            "parent_id": "t3_lsb75e",
            "score": 2,
            "created_utc": 1614299719.0,
            "replies": []
        },
        {
            "body": "Wholesome content. can you be MY sugar daddy??? lol",
            "author": "DinosauresQ",
            "id": "goryr9m",
            "parent_id": "t3_lsb75e",
            "score": 2,
            "created_utc": 1614301068.0,
            "replies": []
        },
        {
            "body": "Bahahaha- another classic one, TSD. I’m more of a MK64 battle mode man. Those were the days...",
            "author": "sdthrowaway006",
            "id": "gosim80",
            "parent_id": "t3_lsb75e",
            "score": 2,
            "created_utc": 1614311309.0,
            "replies": []
        },
        {
            "body": "Ok so which Cohen brothers moves have you written?\n\nI thought I was aces at corn hole. Then I watched a girl throw them on tiktok. Holy shit she was 🔥. And cute too",
            "author": "Diditall4thecookie",
            "id": "gositwg",
            "parent_id": "t3_lsb75e",
            "score": 2,
            "created_utc": 1614311432.0,
            "replies": []
        },
        {
            "body": "\"A man can't fake being murdered from the waist down.\".... Well, you're not wrong Lol. \n\nThe title of this post is gold!",
            "author": "littlemisstoni",
            "id": "gossu3g",
            "parent_id": "t3_lsb75e",
            "score": 2,
            "created_utc": 1614317572.0,
            "replies": []
        },
        {
            "body": "Let me know if you ever want some real competition.",
            "author": "GreatDateShitMate",
            "id": "gostf78",
            "parent_id": "t3_lsb75e",
            "score": 2,
            "created_utc": 1614317983.0,
            "replies": []
        },
        {
            "body": "I would have figured the mushrooms in Mario Kart would power and heal up the testicles...",
            "author": null,
            "id": "got1wfj",
            "parent_id": "t3_lsb75e",
            "score": 2,
            "created_utc": 1614324671.0,
            "replies": []
        },
        {
            "body": "Oh no. Oh no I am so sorry and I am NOT laughing at ALL right now, I PROMISE. I am absolutely not laughing at a grown man sitting on his own nut while trying to beat a girl at Mario Kart.   \n\n\nMy last SD couldn't beat me at Street Fighter, but we bought this board game called \"Photosynthesis\" that had more long-term strategy requirements and I. I don't know what happened. I've never played a game against someone where I couldn't win even ONCE. Yall. I never even got close to winning. It was absolutely tragic. I don't even KNOW where that strategy came from.",
            "author": "ColdHeaux",
            "id": "got5t1f",
            "parent_id": "t3_lsb75e",
            "score": 2,
            "created_utc": 1614328137.0,
            "replies": []
        },
        {
            "body": "Thank you, for this",
            "author": null,
            "id": "gotm0mj",
            "parent_id": "t3_lsb75e",
            "score": 2,
            "created_utc": 1614342555.0,
            "replies": []
        },
        {
            "body": "sat on my nut for the first time about 2 months ago. the pain radiated up my back down my leg and ached for probably 2 or 3 days.  it actually felt like a lower back injury lol",
            "author": "GeneAsBob",
            "id": "gotqrza",
            "parent_id": "t3_lsb75e",
            "score": 2,
            "created_utc": 1614345595.0,
            "replies": []
        },
        {
            "body": "OMFGGGGG!!!!\n🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣\n\n*wipes tears*\n\nPs...would happily play Mario Kart with you. Best way to learn is to play with better players...😌",
            "author": "ShaArt5",
            "id": "gotwsd1",
            "parent_id": "t3_lsb75e",
            "score": 2,
            "created_utc": 1614348893.0,
            "replies": []
        },
        {
            "body": "Don't catch feelings, don't catch feelings, don't catch feelings... shit.",
            "author": null,
            "id": "gou5tqz",
            "parent_id": "t3_lsb75e",
            "score": 2,
            "created_utc": 1614353189.0,
            "replies": []
        },
        {
            "body": "To think,  she was fuming about your cheating tactics all through sex.  lol",
            "author": "sugarquest",
            "id": "gp1jai8",
            "parent_id": "t3_lsb75e",
            "score": 2,
            "created_utc": 1614447180.0,
            "replies": [
                {
                    "body": "I suspect she thought to herself: \"I cant believe I lost to this motherfucker\" all through sex. My childless SB surely missed the irony; so I wish she had said it out loud.",
                    "author": "TastySpermDispenser",
                    "id": "gp1s4j0",
                    "parent_id": "t1_gp1jai8",
                    "score": 1,
                    "created_utc": 1614450263.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "You all old fuddy duddies need to step it up into the 21st century and get with that Super Smash brothers on Switch.",
            "author": "non_giant_panda",
            "id": "goqn3xd",
            "parent_id": "t3_lsb75e",
            "score": 2,
            "created_utc": 1614280120.0,
            "replies": []
        },
        {
            "body": "Brilliant! Just brilliant!! 👏👏🤣🤣🤗",
            "author": "LadyMorgan2018",
            "id": "goqnxui",
            "parent_id": "t3_lsb75e",
            "score": 2,
            "created_utc": 1614280437.0,
            "replies": []
        },
        {
            "body": "I'm sorry for your pain but grateful you decided to share your sad tale. That was great to read.",
            "author": "_babysnek_",
            "id": "goqsmw7",
            "parent_id": "t3_lsb75e",
            "score": 2,
            "created_utc": 1614282309.0,
            "replies": []
        },
        {
            "body": "I imagine any acute ballsack injury is akin to childbirth lol. Maybe a lot shorter. But very painful.",
            "author": "cantakeajoke",
            "id": "goq4974",
            "parent_id": "t3_lsb75e",
            "score": 2,
            "created_utc": 1614272961.0,
            "replies": []
        },
        {
            "body": "THIS WAS SO FUNNY - THE LAUGH I NEEDED TODAY",
            "author": "Ricaaaaaaaaaaaaa",
            "id": "gpt6t0t",
            "parent_id": "t3_lsb75e",
            "score": 1,
            "created_utc": 1614974519.0,
            "replies": []
        },
        {
            "body": "Sigh......",
            "author": "sdphilly",
            "id": "gor9qh4",
            "parent_id": "t3_lsb75e",
            "score": 1,
            "created_utc": 1614289295.0,
            "replies": []
        },
        {
            "body": "Have no idea what you are talking about, bro",
            "author": "baronessblockage",
            "id": "got8yjm",
            "parent_id": "t3_lsb75e",
            "score": 1,
            "created_utc": 1614331013.0,
            "replies": []
        },
        {
            "body": "Wow... wow. Way to blame the victim sir.",
            "author": "TastySpermDispenser",
            "id": "goq8wcd",
            "parent_id": "t1_goq7rz2",
            "score": 50,
            "created_utc": 1614274892.0,
            "replies": [
                {
                    "body": "Lmao",
                    "author": "ZoloftXL",
                    "id": "gorx01g",
                    "parent_id": "t1_goq8wcd",
                    "score": 4,
                    "created_utc": 1614300208.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "The fact that you can read two sentences and can already tell who posted it. It's definitely premium, I'll pay for this over SA any day",
            "author": "HunHanMyBias",
            "id": "gotjllz",
            "parent_id": "t1_goqfxxb",
            "score": 7,
            "created_utc": 1614340816.0,
            "replies": []
        },
        {
            "body": "*Wtf did I*\n\n*Just read?! Idk why I'm*\n\n*Living for this haha*\n\n\\- Ashleycakessssss\n\n---\n\n^(I detect haikus. And sometimes, successfully.) ^[Learn&#32;more&#32;about&#32;me.](https://www.reddit.com/r/haikusbot/)\n\n^(Opt out of replies: \"haikusbot opt out\" | Delete my comment: \"haikusbot delete\")",
            "author": "haikusbot",
            "id": "goqij38",
            "parent_id": "t1_goqihr2",
            "score": 13,
            "created_utc": 1614278492.0,
            "replies": [
                {
                    "body": "Third line is too many syllables pal",
                    "author": "ColdHeaux",
                    "id": "got5iqx",
                    "parent_id": "t1_goqij38",
                    "score": 3,
                    "created_utc": 1614327874.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Well, I would propose a contest that doesnt involve physical injury. Not that I am afraid of a little pain, but hiring children to kick us in the junk before a mario kart tournament sounds illegal.\n#\nI have always wondered who is the second best mario kart racer ever.  :)",
            "author": "TastySpermDispenser",
            "id": "gorfv7i",
            "parent_id": "t1_gor8fx0",
            "score": 10,
            "created_utc": 1614291974.0,
            "replies": []
        },
        {
            "body": "I'll have two of whatever he is having,  on the rocks",
            "author": "pinotandsugar",
            "id": "gor7twy",
            "parent_id": "t1_goq3xj1",
            "score": 2,
            "created_utc": 1614288489.0,
            "replies": []
        },
        {
            "body": "Is the n64 version older school?",
            "author": "fakemoose",
            "id": "gosuao2",
            "parent_id": "t1_goq3xj1",
            "score": 1,
            "created_utc": 1614318601.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "goqcadt",
            "parent_id": "t1_goq8k97",
            "score": 6,
            "created_utc": 1614276260.0,
            "replies": [
                {
                    "body": "Yeah. It's a character flaw. Im an asshole when I win at Air hockey... lol",
                    "author": "SDRippington",
                    "id": "goqliuc",
                    "parent_id": "t1_goqcadt",
                    "score": 4,
                    "created_utc": 1614279553.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I'm still trying to think of how it's even possible...like, donch'y'all sit on them every day???",
            "author": "ShaArt5",
            "id": "gotxakd",
            "parent_id": "t1_gor78w4",
            "score": 2,
            "created_utc": 1614349148.0,
            "replies": []
        },
        {
            "body": "Sure. As long as we play IRL on Ventura blvd, and not some weak ass video game.",
            "author": "TastySpermDispenser",
            "id": "goqg9d8",
            "parent_id": "t1_goqeyc6",
            "score": 6,
            "created_utc": 1614277673.0,
            "replies": [
                {
                    "body": "The new one on Lankershim has got me like 👀",
                    "author": null,
                    "id": "goqxvzv",
                    "parent_id": "t1_goqg9d8",
                    "score": 3,
                    "created_utc": 1614284454.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I think you may have missed the part where he said he has no butt. 🤣",
            "author": "B1oodSugarSexMagik",
            "id": "gospwam",
            "parent_id": "t1_goqeyc6",
            "score": 2,
            "created_utc": 1614315633.0,
            "replies": []
        },
        {
            "body": "I am Undefeated in Galaga BTW.",
            "author": "Buckeyechamp21",
            "id": "goqjfl2",
            "parent_id": "t1_goqeyc6",
            "score": 2,
            "created_utc": 1614278813.0,
            "replies": []
        },
        {
            "body": "I suspect she thought to herself: \"I cant believe I lost to this motherfucker\" all through sex. My childless SB surely missed the irony; so I wish she had said it out loud.",
            "author": "TastySpermDispenser",
            "id": "gp1s4j0",
            "parent_id": "t1_gp1jai8",
            "score": 1,
            "created_utc": 1614450263.0,
            "replies": []
        },
        {
            "body": "Lmao",
            "author": "ZoloftXL",
            "id": "gorx01g",
            "parent_id": "t1_goq8wcd",
            "score": 4,
            "created_utc": 1614300208.0,
            "replies": []
        },
        {
            "body": "Third line is too many syllables pal",
            "author": "ColdHeaux",
            "id": "got5iqx",
            "parent_id": "t1_goqij38",
            "score": 3,
            "created_utc": 1614327874.0,
            "replies": []
        },
        {
            "body": "Yeah. It's a character flaw. Im an asshole when I win at Air hockey... lol",
            "author": "SDRippington",
            "id": "goqliuc",
            "parent_id": "t1_goqcadt",
            "score": 4,
            "created_utc": 1614279553.0,
            "replies": []
        },
        {
            "body": "The new one on Lankershim has got me like 👀",
            "author": null,
            "id": "goqxvzv",
            "parent_id": "t1_goqg9d8",
            "score": 3,
            "created_utc": 1614284454.0,
            "replies": []
        }
    ]
}