{
    "title": "READ ME BEFORE POSTING",
    "post_id": "gpwqxr",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/gpwqxr/read_me_before_posting/",
    "author": "Azurecole",
    "body": "Welcome to the SugarLifestyleForum (SLF)!\n\nIf you have specific questions about the Sugar Bowl we encourage you to ask them but please first read the [wiki](https://www.reddit.com/r/sugarlifestyleforum/wiki/index); view the [glossary](https://www.reddit.com/r/sugarlifestyleforum/wiki/glossary) for unfamiliar terms like [M&G](https://www.reddit.com/r/sugarlifestyleforum/wiki/glossary#wiki_meet_.26amp.3B_greet_.28m.26amp.3Bg.29), [POT](https://www.reddit.com/r/sugarlifestyleforum/wiki/glossary#wiki_pot), and [PPM](https://www.reddit.com/r/sugarlifestyleforum/wiki/glossary#wiki_pay_per_meet_.28ppm.29); and familiarize yourself with our [rules](https://www.reddit.com/r/sugarlifestyleforum/comments/748zta/updated_and_clarified_rules_for_slf/).\n\n**This is not a redditor for redditor (r4r) sub, meaning that posts soliciting for an arrangement will be removed and earn you an immediate ban.**\n\nHere are some posts and wiki entries that address common questions. Many more useful posts can be found by **using the search bar.** Please do not ask a question without first searching for the answer. If you are not willing to apply even that small effort than you are unlikely to succeed in the Sugar Bowl. Also, please keep in mind that this is not a one-size-fits-all kind of lifestyle and what works for some may not work for others. Please take everything on this forum with a grain of salt. This is the internet after all.\n\n* [Yes, it’s a scam and this is how it works](https://www.reddit.com/r/sugarlifestyleforum/comments/au8gs5/yes_its_a_scam_and_this_is_how_it_works/)\n* [Tips for new SBs](https://www.reddit.com/r/sugarlifestyleforum/wiki/advice/new_sbs)\n* [Modern Sugar Relationship (MSR)](https://www.reddit.com/r/sugarlifestyleforum/wiki/modern-sugar-relationship-msr), a good post for beginners wondering how to find an arrangement\n* [Sugar mamas](https://www.reddit.com/r/sugarlifestyleforum/wiki/index#wiki_how_do_i_find_a_sugar_mama.3F_gay_sugar_daddy.3F_sd_for_a_transgender_person.3F) do not exist for straight men and are extremely rare for lesbian women\n* The [Allowance Master Thread 2022-2023](https://www.reddit.com/r/sugarlifestyleforum/comments/w4jdx9/updated_allowance_master_thread_20222023/) shows self-reported allowance averages by region\n* What is a [platonic](https://www.reddit.com/r/sugarlifestyleforum/wiki/index#wiki_what_is_a_platonic_sugar_relationship.3F_how_common_are_they.3F) (i.e., no sex) sugar relationship? How common are they?\nIf you ask a question that can be answered with the above links your post will be removed.\n\nPlease read a few days' worth of posts before posting yourself to get a feel for the SLF environment. By not posting repetitive questions, you can help keep this community positive and useful to all.",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/gpwqxr/read_me_before_posting/",
    "score": 222,
    "upvote_ratio": 0.98,
    "created_utc": 1590352048.0,
    "num_comments": 107,
    "links": [
        [
            "https://www.reddit.com/r/sugarlifestyleforum/wiki/index",
            "https://www.reddit.com/r/sugarlifestyleforum/wiki/glossary",
            "https://www.reddit.com/r/sugarlifestyleforum/wiki/glossary#wiki_meet_.26amp.3B_greet_.28m.26amp.3Bg.29",
            "https://www.reddit.com/r/sugarlifestyleforum/wiki/glossary#wiki_pot",
            "https://www.reddit.com/r/sugarlifestyleforum/wiki/glossary#wiki_pay_per_meet_.28ppm.29",
            "https://www.reddit.com/r/sugarlifestyleforum/comments/748zta/updated_and_clarified_rules_for_slf/",
            "https://www.reddit.com/r/sugarlifestyleforum/comments/au8gs5/yes_its_a_scam_and_this_is_how_it_works/",
            "https://www.reddit.com/r/sugarlifestyleforum/wiki/advice/new_sbs",
            "https://www.reddit.com/r/sugarlifestyleforum/wiki/modern-sugar-relationship-msr",
            "https://www.reddit.com/r/sugarlifestyleforum/wiki/index#wiki_how_do_i_find_a_sugar_mama.3F_gay_sugar_daddy.3F_sd_for_a_transgender_person.3F",
            "https://www.reddit.com/r/sugarlifestyleforum/comments/w4jdx9/updated_allowance_master_thread_20222023/",
            "https://www.reddit.com/r/sugarlifestyleforum/wiki/index#wiki_what_is_a_platonic_sugar_relationship.3F_how_common_are_they.3F"
        ]
    ],
    "comments": [
        {
            "body": "I knew there weren’t sugar mommas looking for a chubby 32yr old dude on disability but it doesn’t stop it from hurting. 😭",
            "author": "DerCatrix",
            "id": "fv6tajx",
            "parent_id": "t3_gpwqxr",
            "score": 25,
            "created_utc": 1592444842.0,
            "replies": []
        },
        {
            "body": "The bulleted list formatting got messed up, try adding another blank line right before the list.",
            "author": "SeattleLaserMeteor",
            "id": "frq4vlx",
            "parent_id": "t3_gpwqxr",
            "score": 19,
            "created_utc": 1590370131.0,
            "replies": [
                {
                    "body": "Do you mean those last couple of sentences? If so, thanks, fixed!  Is there anything else not formatted for you?  It all formats correctly for me now",
                    "author": "Azurecole",
                    "id": "frq8jpx",
                    "parent_id": "t1_frq4vlx",
                    "score": 7,
                    "created_utc": 1590372444.0,
                    "replies": [
                        {
                            "body": "Yeah, the bulleted list is still screwy. Try viewing the post in Old Reddit: https://old.reddit.com/r/sugarlifestyleforum/comments/gpwqxr/read_me_before_posting/",
                            "author": "SeattleLaserMeteor",
                            "id": "frqa5nw",
                            "parent_id": "t1_frq8jpx",
                            "score": 7,
                            "created_utc": 1590373478.0,
                            "replies": [
                                {
                                    "body": "Oh dang!  Didn't even occur to me that old and new reddit could have different formatting.  Let me add that blank line you suggested\n\nedit: that seems to have fixed it, thanks again",
                                    "author": "Azurecole",
                                    "id": "frqacsq",
                                    "parent_id": "t1_frqa5nw",
                                    "score": 6,
                                    "created_utc": 1590373606.0,
                                    "replies": [
                                        {
                                            "body": "Thanks! Yeah I've noticed a couple weird formatting differences between the two. For example this properly hyperlinks in Old Reddit, in New Reddit it's just a hyperlink to the subreddit: r/sugarlifestyleforum/comments/gpwqxr/read_me_before_posting/",
                                            "author": "SeattleLaserMeteor",
                                            "id": "frqalk5",
                                            "parent_id": "t1_frqacsq",
                                            "score": 2,
                                            "created_utc": 1590373763.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Success Story !!!!  Long time lurker who was scared to enter \"the bowl\".  I was more than  a little worried that my search for a SD would be a long and challenging one as an AA curvy woman.  But....after kissing my share of toads : ), I found my Prince Charming!!  It took exactly 7 weeks to find \"the one\" but I couldn't be happier.  We had a two platonic dates and now have had 3 intimate dates - I have to say the allowance isn't the only benefit that I'm enjoying!  Just wanted to share so others (especially woman of color) know that there are amazing SDs out there...you just have to be patient and perhaps lucky enough to find them !  Happy hunting...",
            "author": "HappyDayAlways111",
            "id": "hzlowhf",
            "parent_id": "t3_gpwqxr",
            "score": 14,
            "created_utc": 1646590153.0,
            "replies": [
                {
                    "body": "Congrats!!  Great to hear",
                    "author": "Azurecole",
                    "id": "hzlqapc",
                    "parent_id": "t1_hzlowhf",
                    "score": 3,
                    "created_utc": 1646590724.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Thank you!!! I'm a cougar and I get a lot of cubs looking for a sugar momma. I say they are extinct and they rarely believe me. Thank you for the official confirmation.",
            "author": "tgibook",
            "id": "frps6l4",
            "parent_id": "t3_gpwqxr",
            "score": 34,
            "created_utc": 1590362390.0,
            "replies": [
                {
                    "body": "😂 I've known one one straight guy that got into a sugar relationship from out of somewhere.  But c'mon... men are incredibly easy to sleep with..... it seems like wishful thinking to think they can easily find a sugar relationship like that.\n\nReminds me of all the guys who are stuck inside and lonely and horny and want to get into camming right now, but in the hopes that theyll get women wanting to watch them. Sorry out of shape unattractive dude, if you want female sexual attention out there YOU are going to be the one to pay for it. Men are the ones with higher sex drives and it's a pipe dream to think you're going to get a new flush income  just by jacking off- something you do multiple times a day anyways. If you're wanting to experiment with your gay side, since men are the majority of people paying for sexual contact and attention, I can kind of understand that, but you're also making it harder for legit sex workers to make a living. If you even get any attention. Just logging onto a cam site is not going to get you swarms of viewers with no effort.\n\n It is not hard to gain access to an erection!",
                    "author": "kimchi_Queen",
                    "id": "frqqzxj",
                    "parent_id": "t1_frps6l4",
                    "score": 13,
                    "created_utc": 1590385371.0,
                    "replies": [
                        {
                            "body": "Straight SBs for sugar mommas provide more than a dick. Sometimes not even a dick. I've provided attention and an emotional connection for someone who needed that and who showered me in sugar. \n\nBut yes, it's much more rare and doesn't really fit in with the concept of a SB lifestyle or really even fit in this sub.",
                            "author": "lickedTators",
                            "id": "fs7siqf",
                            "parent_id": "t1_frqqzxj",
                            "score": 19,
                            "created_utc": 1590770772.0,
                            "replies": [
                                {
                                    "body": "A friend of mine that found himself in a SB situation never even slept with her. It was free room and board and companionship, but of course it turned ugly eventually.",
                                    "author": "kimchi_Queen",
                                    "id": "fs7x2wp",
                                    "parent_id": "t1_fs7siqf",
                                    "score": 9,
                                    "created_utc": 1590772892.0,
                                    "replies": []
                                },
                                {
                                    "body": "Where do i find one loll that's exactly what I want to provide. Everything except sex and money. If this gives you an idea of what type of guy I am, I prefer giving head to romantic partners instead of receiving, and prefer to make others happy, pleasured, or gratified instead of asking for my own pleasure.",
                                    "author": "ashu1605",
                                    "id": "hjxdttu",
                                    "parent_id": "t1_fs7siqf",
                                    "score": 1,
                                    "created_utc": 1636460059.0,
                                    "replies": []
                                },
                                {
                                    "body": "Where would you suggest people look if they are interested in that kind of sugar relationship. I'm indifferent on whether or not a relationship is sexual and just know I have a bottomless well of charisma that would do me well if i lived somewhere that properly supported male hosts as a profession like Japan.",
                                    "author": "EdgarCrowley",
                                    "id": "j3zdk5c",
                                    "parent_id": "t1_fs7siqf",
                                    "score": 1,
                                    "created_utc": 1673490762.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Why are cis women like this",
                            "author": "TerrifiedThrowawayz",
                            "id": "g5bs6y8",
                            "parent_id": "t1_frqqzxj",
                            "score": 3,
                            "created_utc": 1600145660.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Will you buy me pokemon toys and change my poopy diapers",
                    "author": "KingBeefFrank",
                    "id": "fy8ca10",
                    "parent_id": "t1_frps6l4",
                    "score": 5,
                    "created_utc": 1594884315.0,
                    "replies": [
                        {
                            "body": "No, but the can use my degree in in psychology to get you committed.",
                            "author": "tgibook",
                            "id": "fy9dmzu",
                            "parent_id": "t1_fy8ca10",
                            "score": 13,
                            "created_utc": 1594912831.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "I don't think there can possibly be a universal \"official\" confirmation that sugar moms don't exist? Unless there are specific stats for that?",
                    "author": "TheAsianCShooter",
                    "id": "ii7vgnv",
                    "parent_id": "t1_frps6l4",
                    "score": 0,
                    "created_utc": 1659153356.0,
                    "replies": [
                        {
                            "body": "You let us know when you find one. lol",
                            "author": "NewCanadianSD",
                            "id": "ii7w7kn",
                            "parent_id": "t1_ii7vgnv",
                            "score": 3,
                            "created_utc": 1659153785.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Oh my haha, I'm just lurking on this sub for the first time (18M) and it's looking less and less hopeful for me. I don't want sex unless the relationship progresses to a romantic, nor do I seek any sexual communication like talking dirty or even unmild flirting.\n\n\nHonestly I don't have sex with anyone except for giving or receiving oral because I want to lose it to someone I genuinely love and find affection with. I enjoy pleasing people however, and making sure someone is happy and feels appreciated in turn makes me happy. Honestly I'd probably do a sugar relationship without actually getting any sugar just to bring some positive vibes to someone else's life, as it makes me feel like I had on impact and fulfills me, but money would be a plus because college is expensive *cries inside*.\n\n\nWhat do you mean by they are extinct? Women might be able to get sexual gratification easily, but not all women get emotional or romantic gratification with that level of ease. If a guy isn't looking for sex and just wants to (hopefully) make someone's day better, it doesn't make sense for them to pay right?\n\n\nHonestly I don't even know, I'm new to this stuff, but the oldest person I talked to romantically with the intent for an actual relationship and not sugar relationship was 26 when I just turned 18, unfortunately her therapist said I'm too young to talk to 😂😭 but I understand. Are there really no straight/bi/pan women looking for a friendship or intimacy without sex? Although strings attached usually refers to responsibilities and expectations (sex), for me, sex is pretty much the only string attached. I don't want it. Is that weird? I know for a fact not all guys are interested in sex and some care more about emotional gratification, similar to demisexuality.\n\n\nNo hope for a cub huh. Sad.",
                    "author": "ashu1605",
                    "id": "hjxdl8n",
                    "parent_id": "t1_frps6l4",
                    "score": 1,
                    "created_utc": 1636459902.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Hi there, all the links to wikis seem to be broken. Is it normal? Thanks in advance",
            "author": "aimee08645",
            "id": "g2avj24",
            "parent_id": "t3_gpwqxr",
            "score": 4,
            "created_utc": 1597991418.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "g2b04gt",
                    "parent_id": "t1_g2avj24",
                    "score": 4,
                    "created_utc": 1597995889.0,
                    "replies": [
                        {
                            "body": "Thanks for letting us know, u/aimee08645 and u/pacificgrowncoco.  Can you tell me if you're using new reddit (on a browser using a [reddit.com](https://reddit.com) URL), old reddit (on a browser using an [old.reddit.com](https://old.reddit.com) URL), an app (Relay or Reddit app on your phone, for example)?   I have not been able to reproduce this, but have heard that people who are using the Reddit app on their phone are having trouble.",
                            "author": "Azurecole",
                            "id": "g2c0bh7",
                            "parent_id": "t1_g2b04gt",
                            "score": 3,
                            "created_utc": 1598023606.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "g2c18gm",
                                    "parent_id": "t1_g2c0bh7",
                                    "score": 5,
                                    "created_utc": 1598024058.0,
                                    "replies": [
                                        {
                                            "body": "Okay, I'm not exactly sure whose attention to bring this to, but will do a little research, thanks.  In the meantime, all of this seems to be available if you use anything BUT the reddit app, if you want to look at the wiki right now",
                                            "author": "Azurecole",
                                            "id": "g2c6ov2",
                                            "parent_id": "t1_g2c18gm",
                                            "score": 5,
                                            "created_utc": 1598026459.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "me 34 yr who had a sugar mama \"Yeah, extremely endangered...but they're out there.\"",
            "author": "TheRunningFree1s",
            "id": "i0g89wn",
            "parent_id": "t3_gpwqxr",
            "score": 4,
            "created_utc": 1647141996.0,
            "replies": []
        },
        {
            "body": "Its terrifying how many scanners are out there.",
            "author": "xPaintedVeilx19",
            "id": "fyycus9",
            "parent_id": "t3_gpwqxr",
            "score": 3,
            "created_utc": 1595483445.0,
            "replies": []
        },
        {
            "body": "what about sugar babies looking in the sugar bowl for a sm",
            "author": "Glittering_Stress806",
            "id": "hm3acf0",
            "parent_id": "t3_gpwqxr",
            "score": 3,
            "created_utc": 1637881980.0,
            "replies": []
        },
        {
            "body": "Was the linked master thread created by a SB or SD? I’m curious about the perspective, experience, and personal value system of the author.",
            "author": "LVSugarBebe",
            "id": "frqpgkw",
            "parent_id": "t3_gpwqxr",
            "score": 2,
            "created_utc": 1590384137.0,
            "replies": [
                {
                    "body": "By linked master thread, you're not referring to the allowance master thread? Are you referring to the modern sugar relationships thread?",
                    "author": "Azurecole",
                    "id": "frqr7sa",
                    "parent_id": "t1_frqpgkw",
                    "score": 2,
                    "created_utc": 1590385546.0,
                    "replies": [
                        {
                            "body": "The platonic thread.",
                            "author": "LVSugarBebe",
                            "id": "frs2lgc",
                            "parent_id": "t1_frqr7sa",
                            "score": 1,
                            "created_utc": 1590423285.0,
                            "replies": [
                                {
                                    "body": "Ah, I'm not sure of the history, maybe a mod who has been here longer will comment.  I am pretty sure the platonic post was last re-worked by an SD, but not sure of original author or revision history.  We have (and have had) SBs who are mods and any of them might have modified it too...",
                                    "author": "Azurecole",
                                    "id": "frs40f2",
                                    "parent_id": "t1_frs2lgc",
                                    "score": 1,
                                    "created_utc": 1590424028.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Seems a moderator went through the chat rooms and started enforcing the solicitation rule (thankfully).\n\nChat was starting to become kind of an echo chamber of solicitations.  Just curious, maybe a moderator can answer, but why were the rooms created?  Considerations of eliminating them?",
            "author": "Church42",
            "id": "frrtuad",
            "parent_id": "t3_gpwqxr",
            "score": 2,
            "created_utc": 1590418548.0,
            "replies": [
                {
                    "body": "Church, We've actually been removing solicitations from the chat room every day, but doubtless miss some!  I can say that every day, every solicitation *that was reported*, was removed.  I know that for sure because I check the chat room report queue a few times a day, and see what got removed.  I'm certain we sometimes miss non-reported ones though.\n\nI don't remember why the chat rooms were created... I remember them getting created, but not the context (I wasn't a mod at the time)",
                    "author": "Azurecole",
                    "id": "frrufwi",
                    "parent_id": "t1_frrtuad",
                    "score": 1,
                    "created_utc": 1590418889.0,
                    "replies": [
                        {
                            "body": "Ah then yes, I can't imagine how much is being removed without me seeing it then!\n\nJust curious if it's becoming more hassle than its worth",
                            "author": "Church42",
                            "id": "frrus4q",
                            "parent_id": "t1_frrufwi",
                            "score": 1,
                            "created_utc": 1590419080.0,
                            "replies": []
                        },
                        {
                            "body": "make work program for unemployed mods",
                            "author": "amigodeface",
                            "id": "g7xketi",
                            "parent_id": "t1_frrufwi",
                            "score": 1,
                            "created_utc": 1602014891.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I’m taking notes. Understanding this relationship and I’m in love with this post!",
            "author": "tonyaasy",
            "id": "g2t1mog",
            "parent_id": "t3_gpwqxr",
            "score": 2,
            "created_utc": 1598367911.0,
            "replies": []
        },
        {
            "body": "Hello, we're aware that if you use the Reddit app on your phone, none of these links work, and we haven't been able to figure out why, except that it suddenly started happening in August after years of working fine.  If you'll access Reddit any other way than the Reddit app, like through a browser, or a different app such as Relay ,they will work fine.  Apologies for the inconvenience!",
            "author": "Azurecole",
            "id": "g3efepe",
            "parent_id": "t3_gpwqxr",
            "score": 2,
            "created_utc": 1598822657.0,
            "replies": []
        },
        {
            "body": "None of the links work ;-;",
            "author": "meowhart",
            "id": "ilhknet",
            "parent_id": "t3_gpwqxr",
            "score": 2,
            "created_utc": 1661278772.0,
            "replies": [
                {
                    "body": "Weird, I just went through every single link and they all worked fine for me.  Are you using old reddit, new reddit, or an app?",
                    "author": "Azurecole",
                    "id": "ilhle0t",
                    "parent_id": "t1_ilhknet",
                    "score": 2,
                    "created_utc": 1661279053.0,
                    "replies": [
                        {
                            "body": "I'm using the app. I tried clicking tips for new sbs and it came to link expired",
                            "author": "meowhart",
                            "id": "ilhqkug",
                            "parent_id": "t1_ilhle0t",
                            "score": 2,
                            "created_utc": 1661281048.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "The sidebar links to the old \"Read Me Before Posting\" post, can we update it to this one?",
            "author": "SeattleLaserMeteor",
            "id": "fs1ll3w",
            "parent_id": "t3_gpwqxr",
            "score": 1,
            "created_utc": 1590630658.0,
            "replies": [
                {
                    "body": "Good catch.  I have no idea how to do it, so I guess I have to go figure out how I edit that sidebar. thanks!",
                    "author": "Azurecole",
                    "id": "fs1ne63",
                    "parent_id": "t1_fs1ll3w",
                    "score": 2,
                    "created_utc": 1590631691.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Quick question how do we get user flair?",
            "author": "lbseida",
            "id": "fvg9nno",
            "parent_id": "t3_gpwqxr",
            "score": 1,
            "created_utc": 1592669958.0,
            "replies": [
                {
                    "body": "On the computer using new reddit, if I hover the mouse over my user name, a drop-down menu appears, and one of them is to set user flair.  Do you get that?",
                    "author": "Azurecole",
                    "id": "fvga5gz",
                    "parent_id": "t1_fvg9nno",
                    "score": 1,
                    "created_utc": 1592670230.0,
                    "replies": [
                        {
                            "body": "Damn I'm gonna have to get onto an actual computer 😂 thank you letting me know",
                            "author": "lbseida",
                            "id": "fvgaeam",
                            "parent_id": "t1_fvga5gz",
                            "score": 1,
                            "created_utc": 1592670367.0,
                            "replies": [
                                {
                                    "body": "You can do it on a phone also.  What app are you using?  Let's see if we can puzzle this one out",
                                    "author": "Azurecole",
                                    "id": "fvgb371",
                                    "parent_id": "t1_fvgaeam",
                                    "score": 2,
                                    "created_utc": 1592670746.0,
                                    "replies": [
                                        {
                                            "body": "Just the reddit app? I didn't know there were different ones to be honest 🤔",
                                            "author": "lbseida",
                                            "id": "fvgk8cb",
                                            "parent_id": "t1_fvgb371",
                                            "score": 1,
                                            "created_utc": 1592675761.0,
                                            "replies": [
                                                {
                                                    "body": "Yes, there are lots of different apps (I use Relay, for example).   What happens if you're in the slf subreddit, and then click on your name?  Do you get a menu that lets you change user flair?\n\nOtherwise, just let me know which of the standard flairs you want and I can set it for you",
                                                    "author": "Azurecole",
                                                    "id": "fvglug9",
                                                    "parent_id": "t1_fvgk8cb",
                                                    "score": 2,
                                                    "created_utc": 1592676648.0,
                                                    "replies": [
                                                        {
                                                            "body": "Haha thank you I found it you're the best azure 😍",
                                                            "author": "lbseida",
                                                            "id": "fvir91w",
                                                            "parent_id": "t1_fvglug9",
                                                            "score": 2,
                                                            "created_utc": 1592726701.0,
                                                            "replies": [
                                                                {
                                                                    "body": ":) :)",
                                                                    "author": "Azurecole",
                                                                    "id": "fvj1v45",
                                                                    "parent_id": "t1_fvir91w",
                                                                    "score": 2,
                                                                    "created_utc": 1592737764.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Hello! I have so many questions about being the perfect SB. What’s the main sites people like to use? I’m seeing SA a lot but how does that go? Is there any specific way I should be presenting myself? In my head I think I’m doing it right but then I read these comments and realize I’m not /: a little tips would be great! I don’t want to get stuck in the category of young reckless SB so please! Help educate me (:",
            "author": "bcuzugly723",
            "id": "fvv2fzm",
            "parent_id": "t3_gpwqxr",
            "score": 1,
            "created_utc": 1593014498.0,
            "replies": [
                {
                    "body": "bcuz, have you read all the links above, especially  [Tips for new SBs](https://www.reddit.com/r/sugarlifestyleforum/wiki/advice/new_sbs) and  [Modern Sugar Relationship (MSR)](https://www.reddit.com/r/sugarlifestyleforum/wiki/modern-sugar-relationship-msr) and [https://www.reddit.com/r/sugarlifestyleforum/comments/92igpx/some\\_possible\\_tips\\_for\\_new\\_sbs/](https://www.reddit.com/r/sugarlifestyleforum/comments/92igpx/some_possible_tips_for_new_sbs/)\n\nI feel like many of your questions are answered there, especially all the little tips!.  If you want to know if you're presenting yourself right, please consider doing a profile review, you'll get a lot of good feedback",
                    "author": "Azurecole",
                    "id": "fvv5bbv",
                    "parent_id": "t1_fvv2fzm",
                    "score": 2,
                    "created_utc": 1593015906.0,
                    "replies": [
                        {
                            "body": "Awesome thank you! Yeah I assumed that they were all there was just wondering if there was anymore I should be aware of! Also where would one get a profile review",
                            "author": "bcuzugly723",
                            "id": "fvv9job",
                            "parent_id": "t1_fvv5bbv",
                            "score": 2,
                            "created_utc": 1593017968.0,
                            "replies": [
                                {
                                    "body": "On the sub!  If you look through the sub, you'll find anywhere from 1-4 profile reviews EVERY DAY here, suggest you read through a few to see how they work and what the comments are like",
                                    "author": "Azurecole",
                                    "id": "fvv9rm8",
                                    "parent_id": "t1_fvv9job",
                                    "score": 2,
                                    "created_utc": 1593018074.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Why was my other account banned????",
            "author": "iBleedFromMyGenitals",
            "id": "fyaxrg5",
            "parent_id": "t3_gpwqxr",
            "score": 1,
            "created_utc": 1594940319.0,
            "replies": [
                {
                    "body": "If you log into whatever your other account was, and use modmail to contact us, we can tell you",
                    "author": "Azurecole",
                    "id": "fyb3sht",
                    "parent_id": "t1_fyaxrg5",
                    "score": 3,
                    "created_utc": 1594943656.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Sorry if this is covered somewhere but how do I get a “sugar daddy” tag on my name? 😇",
            "author": "Osead2018",
            "id": "fzns35z",
            "parent_id": "t3_gpwqxr",
            "score": 1,
            "created_utc": 1596056273.0,
            "replies": [
                {
                    "body": "It depends so much on how you are accessing Reddit, but if you are using new reddit, off to the sidebar there is a community options drop down menu that lets you set your flare. I think I can do it for you if you're still having trouble",
                    "author": "Azurecole",
                    "id": "fznu3ce",
                    "parent_id": "t1_fzns35z",
                    "score": 1,
                    "created_utc": 1596057273.0,
                    "replies": [
                        {
                            "body": "Got it, thank you!!!",
                            "author": "Osead2018",
                            "id": "fzoq358",
                            "parent_id": "t1_fznu3ce",
                            "score": 1,
                            "created_utc": 1596074303.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "The links dont work, it says that there's nothing there.",
            "author": "baklava-boy",
            "id": "g3eeu38",
            "parent_id": "t3_gpwqxr",
            "score": 1,
            "created_utc": 1598822404.0,
            "replies": [
                {
                    "body": "only if you're using the reddit app. If you access reddit any other way -- through a browser, or using the Relay for Reddit app (which is way better than the reddit app anyway :), they will work.  Not sure why this is!",
                    "author": "Azurecole",
                    "id": "g3ef84k",
                    "parent_id": "t1_g3eeu38",
                    "score": 3,
                    "created_utc": 1598822577.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "g4cln2q",
            "parent_id": "t3_gpwqxr",
            "score": 1,
            "created_utc": 1599497401.0,
            "replies": []
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "g5qaa7j",
            "parent_id": "t3_gpwqxr",
            "score": 1,
            "created_utc": 1600454870.0,
            "replies": []
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "g845yne",
            "parent_id": "t3_gpwqxr",
            "score": 1,
            "created_utc": 1602170139.0,
            "replies": []
        },
        {
            "body": "Thank you for this",
            "author": "Enolanile",
            "id": "g9xkrar",
            "parent_id": "t3_gpwqxr",
            "score": 1,
            "created_utc": 1603561571.0,
            "replies": []
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "gc9jfxa",
            "parent_id": "t3_gpwqxr",
            "score": 1,
            "created_utc": 1605372312.0,
            "replies": [
                {
                    "body": "[removed]",
                    "author": null,
                    "id": "gc9mbpa",
                    "parent_id": "t1_gc9jfxa",
                    "score": 1,
                    "created_utc": 1605373947.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Agreed.",
            "author": "Princess_Bliss",
            "id": "gcuh8bl",
            "parent_id": "t3_gpwqxr",
            "score": 1,
            "created_utc": 1605805931.0,
            "replies": []
        },
        {
            "body": "Agreed.",
            "author": "chunkyxavocado",
            "id": "hhu0vj7",
            "parent_id": "t3_gpwqxr",
            "score": 1,
            "created_utc": 1635056928.0,
            "replies": []
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "hutb1d1",
            "parent_id": "t3_gpwqxr",
            "score": 1,
            "created_utc": 1643517785.0,
            "replies": [
                {
                    "body": "If you need to communicate with the mods, send a modmail.  Don't reply on our FAQs.\n\nNo idea what you're talking about, send details (like a link to the post you think you made, it should be in your post history even if it got deleted) when you message the mods",
                    "author": "Azurecole",
                    "id": "hutbprw",
                    "parent_id": "t1_hutb1d1",
                    "score": 1,
                    "created_utc": 1643518120.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Thank yoi",
            "author": "Bitter-Breadfruit-68",
            "id": "i5yvs84",
            "parent_id": "t3_gpwqxr",
            "score": 1,
            "created_utc": 1650778692.0,
            "replies": []
        },
        {
            "body": "Nice rules",
            "author": "SharpShoota1",
            "id": "i6pqcpe",
            "parent_id": "t3_gpwqxr",
            "score": 1,
            "created_utc": 1651266673.0,
            "replies": []
        },
        {
            "body": "I tried to open the link for new SB's but it's unavailable!",
            "author": "CarmelQ95",
            "id": "im5izum",
            "parent_id": "t3_gpwqxr",
            "score": 1,
            "created_utc": 1661708644.0,
            "replies": [
                {
                    "body": "That seems to be happening only with people using the reddit app.  It works fine with old reddit, new reddit, and all other apps (from what I can tell).  Can you get to it from this link?  [https://www.reddit.com/r/sugarlifestyleforum/wiki/advice/new\\_sbs/](https://www.reddit.com/r/sugarlifestyleforum/wiki/advice/new_sbs/)While you're at it, worth checking out this: https://www.reddit.com/r/sugarlifestyleforum/comments/92igpx/some\\_possible\\_tips\\_for\\_new\\_sbs/",
                    "author": "Azurecole",
                    "id": "im5lcnk",
                    "parent_id": "t1_im5izum",
                    "score": 1,
                    "created_utc": 1661709596.0,
                    "replies": [
                        {
                            "body": "Much appreciated Azurecole! The first link doesn't work (on the app). The second does! I'll try the first link on my laptop later and see if that works.🥰",
                            "author": "CarmelQ95",
                            "id": "im5mklf",
                            "parent_id": "t1_im5lcnk",
                            "score": 1,
                            "created_utc": 1661710095.0,
                            "replies": [
                                {
                                    "body": "Well dang -- I definitely want you to see the first link.  Mind checking it through a browser?  It will work fine and has all the new-SB info!",
                                    "author": "Azurecole",
                                    "id": "im5plrl",
                                    "parent_id": "t1_im5mklf",
                                    "score": 1,
                                    "created_utc": 1661711334.0,
                                    "replies": [
                                        {
                                            "body": "I sure will! Thanks again for welcoming me and setting me up! 😁",
                                            "author": "CarmelQ95",
                                            "id": "im5pzco",
                                            "parent_id": "t1_im5plrl",
                                            "score": 1,
                                            "created_utc": 1661711492.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "I read it :).",
                                            "author": "CarmelQ95",
                                            "id": "im5vrb1",
                                            "parent_id": "t1_im5plrl",
                                            "score": 1,
                                            "created_utc": 1661713875.0,
                                            "replies": [
                                                {
                                                    "body": "Great!",
                                                    "author": "Azurecole",
                                                    "id": "im5wj7l",
                                                    "parent_id": "t1_im5vrb1",
                                                    "score": 2,
                                                    "created_utc": 1661714199.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "inq1amo",
            "parent_id": "t3_gpwqxr",
            "score": 1,
            "created_utc": 1662729284.0,
            "replies": [
                {
                    "body": "It works fine for me.  Are you using old reddit, new reddit, the reddit app, or a 3rd party app like Relay or Boost?  Oddly enough, sometimes these links stop working only for one particular way of accessing it (the reddit app seems to have the most problems)",
                    "author": "Azurecole",
                    "id": "inqduua",
                    "parent_id": "t1_inq1amo",
                    "score": 1,
                    "created_utc": 1662734757.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "So aside from paypal where can i recieve my allowance? Is venmo ok?",
            "author": "Lovelyflavia1992",
            "id": "j05s84e",
            "parent_id": "t3_gpwqxr",
            "score": 1,
            "created_utc": 1671001705.0,
            "replies": []
        },
        {
            "body": "ok i hope i get a sd",
            "author": "TheReal_Mina_Ashdio",
            "id": "j7cvqb4",
            "parent_id": "t3_gpwqxr",
            "score": 1,
            "created_utc": 1675632316.0,
            "replies": []
        },
        {
            "body": "Im trying to open a seeking account but on the email its saying its not a valid email and that i should use .edu but i dont have an .edu email. Help here",
            "author": "certifiedsugarbaby14",
            "id": "j9jq38r",
            "parent_id": "t3_gpwqxr",
            "score": 1,
            "created_utc": 1677073503.0,
            "replies": []
        },
        {
            "body": "Do you mean those last couple of sentences? If so, thanks, fixed!  Is there anything else not formatted for you?  It all formats correctly for me now",
            "author": "Azurecole",
            "id": "frq8jpx",
            "parent_id": "t1_frq4vlx",
            "score": 7,
            "created_utc": 1590372444.0,
            "replies": [
                {
                    "body": "Yeah, the bulleted list is still screwy. Try viewing the post in Old Reddit: https://old.reddit.com/r/sugarlifestyleforum/comments/gpwqxr/read_me_before_posting/",
                    "author": "SeattleLaserMeteor",
                    "id": "frqa5nw",
                    "parent_id": "t1_frq8jpx",
                    "score": 7,
                    "created_utc": 1590373478.0,
                    "replies": [
                        {
                            "body": "Oh dang!  Didn't even occur to me that old and new reddit could have different formatting.  Let me add that blank line you suggested\n\nedit: that seems to have fixed it, thanks again",
                            "author": "Azurecole",
                            "id": "frqacsq",
                            "parent_id": "t1_frqa5nw",
                            "score": 6,
                            "created_utc": 1590373606.0,
                            "replies": [
                                {
                                    "body": "Thanks! Yeah I've noticed a couple weird formatting differences between the two. For example this properly hyperlinks in Old Reddit, in New Reddit it's just a hyperlink to the subreddit: r/sugarlifestyleforum/comments/gpwqxr/read_me_before_posting/",
                                    "author": "SeattleLaserMeteor",
                                    "id": "frqalk5",
                                    "parent_id": "t1_frqacsq",
                                    "score": 2,
                                    "created_utc": 1590373763.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Congrats!!  Great to hear",
            "author": "Azurecole",
            "id": "hzlqapc",
            "parent_id": "t1_hzlowhf",
            "score": 3,
            "created_utc": 1646590724.0,
            "replies": []
        },
        {
            "body": "😂 I've known one one straight guy that got into a sugar relationship from out of somewhere.  But c'mon... men are incredibly easy to sleep with..... it seems like wishful thinking to think they can easily find a sugar relationship like that.\n\nReminds me of all the guys who are stuck inside and lonely and horny and want to get into camming right now, but in the hopes that theyll get women wanting to watch them. Sorry out of shape unattractive dude, if you want female sexual attention out there YOU are going to be the one to pay for it. Men are the ones with higher sex drives and it's a pipe dream to think you're going to get a new flush income  just by jacking off- something you do multiple times a day anyways. If you're wanting to experiment with your gay side, since men are the majority of people paying for sexual contact and attention, I can kind of understand that, but you're also making it harder for legit sex workers to make a living. If you even get any attention. Just logging onto a cam site is not going to get you swarms of viewers with no effort.\n\n It is not hard to gain access to an erection!",
            "author": "kimchi_Queen",
            "id": "frqqzxj",
            "parent_id": "t1_frps6l4",
            "score": 13,
            "created_utc": 1590385371.0,
            "replies": [
                {
                    "body": "Straight SBs for sugar mommas provide more than a dick. Sometimes not even a dick. I've provided attention and an emotional connection for someone who needed that and who showered me in sugar. \n\nBut yes, it's much more rare and doesn't really fit in with the concept of a SB lifestyle or really even fit in this sub.",
                    "author": "lickedTators",
                    "id": "fs7siqf",
                    "parent_id": "t1_frqqzxj",
                    "score": 19,
                    "created_utc": 1590770772.0,
                    "replies": [
                        {
                            "body": "A friend of mine that found himself in a SB situation never even slept with her. It was free room and board and companionship, but of course it turned ugly eventually.",
                            "author": "kimchi_Queen",
                            "id": "fs7x2wp",
                            "parent_id": "t1_fs7siqf",
                            "score": 9,
                            "created_utc": 1590772892.0,
                            "replies": []
                        },
                        {
                            "body": "Where do i find one loll that's exactly what I want to provide. Everything except sex and money. If this gives you an idea of what type of guy I am, I prefer giving head to romantic partners instead of receiving, and prefer to make others happy, pleasured, or gratified instead of asking for my own pleasure.",
                            "author": "ashu1605",
                            "id": "hjxdttu",
                            "parent_id": "t1_fs7siqf",
                            "score": 1,
                            "created_utc": 1636460059.0,
                            "replies": []
                        },
                        {
                            "body": "Where would you suggest people look if they are interested in that kind of sugar relationship. I'm indifferent on whether or not a relationship is sexual and just know I have a bottomless well of charisma that would do me well if i lived somewhere that properly supported male hosts as a profession like Japan.",
                            "author": "EdgarCrowley",
                            "id": "j3zdk5c",
                            "parent_id": "t1_fs7siqf",
                            "score": 1,
                            "created_utc": 1673490762.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Why are cis women like this",
                    "author": "TerrifiedThrowawayz",
                    "id": "g5bs6y8",
                    "parent_id": "t1_frqqzxj",
                    "score": 3,
                    "created_utc": 1600145660.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Will you buy me pokemon toys and change my poopy diapers",
            "author": "KingBeefFrank",
            "id": "fy8ca10",
            "parent_id": "t1_frps6l4",
            "score": 5,
            "created_utc": 1594884315.0,
            "replies": [
                {
                    "body": "No, but the can use my degree in in psychology to get you committed.",
                    "author": "tgibook",
                    "id": "fy9dmzu",
                    "parent_id": "t1_fy8ca10",
                    "score": 13,
                    "created_utc": 1594912831.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I don't think there can possibly be a universal \"official\" confirmation that sugar moms don't exist? Unless there are specific stats for that?",
            "author": "TheAsianCShooter",
            "id": "ii7vgnv",
            "parent_id": "t1_frps6l4",
            "score": 0,
            "created_utc": 1659153356.0,
            "replies": [
                {
                    "body": "You let us know when you find one. lol",
                    "author": "NewCanadianSD",
                    "id": "ii7w7kn",
                    "parent_id": "t1_ii7vgnv",
                    "score": 3,
                    "created_utc": 1659153785.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Oh my haha, I'm just lurking on this sub for the first time (18M) and it's looking less and less hopeful for me. I don't want sex unless the relationship progresses to a romantic, nor do I seek any sexual communication like talking dirty or even unmild flirting.\n\n\nHonestly I don't have sex with anyone except for giving or receiving oral because I want to lose it to someone I genuinely love and find affection with. I enjoy pleasing people however, and making sure someone is happy and feels appreciated in turn makes me happy. Honestly I'd probably do a sugar relationship without actually getting any sugar just to bring some positive vibes to someone else's life, as it makes me feel like I had on impact and fulfills me, but money would be a plus because college is expensive *cries inside*.\n\n\nWhat do you mean by they are extinct? Women might be able to get sexual gratification easily, but not all women get emotional or romantic gratification with that level of ease. If a guy isn't looking for sex and just wants to (hopefully) make someone's day better, it doesn't make sense for them to pay right?\n\n\nHonestly I don't even know, I'm new to this stuff, but the oldest person I talked to romantically with the intent for an actual relationship and not sugar relationship was 26 when I just turned 18, unfortunately her therapist said I'm too young to talk to 😂😭 but I understand. Are there really no straight/bi/pan women looking for a friendship or intimacy without sex? Although strings attached usually refers to responsibilities and expectations (sex), for me, sex is pretty much the only string attached. I don't want it. Is that weird? I know for a fact not all guys are interested in sex and some care more about emotional gratification, similar to demisexuality.\n\n\nNo hope for a cub huh. Sad.",
            "author": "ashu1605",
            "id": "hjxdl8n",
            "parent_id": "t1_frps6l4",
            "score": 1,
            "created_utc": 1636459902.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "g2b04gt",
            "parent_id": "t1_g2avj24",
            "score": 4,
            "created_utc": 1597995889.0,
            "replies": [
                {
                    "body": "Thanks for letting us know, u/aimee08645 and u/pacificgrowncoco.  Can you tell me if you're using new reddit (on a browser using a [reddit.com](https://reddit.com) URL), old reddit (on a browser using an [old.reddit.com](https://old.reddit.com) URL), an app (Relay or Reddit app on your phone, for example)?   I have not been able to reproduce this, but have heard that people who are using the Reddit app on their phone are having trouble.",
                    "author": "Azurecole",
                    "id": "g2c0bh7",
                    "parent_id": "t1_g2b04gt",
                    "score": 3,
                    "created_utc": 1598023606.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "g2c18gm",
                            "parent_id": "t1_g2c0bh7",
                            "score": 5,
                            "created_utc": 1598024058.0,
                            "replies": [
                                {
                                    "body": "Okay, I'm not exactly sure whose attention to bring this to, but will do a little research, thanks.  In the meantime, all of this seems to be available if you use anything BUT the reddit app, if you want to look at the wiki right now",
                                    "author": "Azurecole",
                                    "id": "g2c6ov2",
                                    "parent_id": "t1_g2c18gm",
                                    "score": 5,
                                    "created_utc": 1598026459.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "By linked master thread, you're not referring to the allowance master thread? Are you referring to the modern sugar relationships thread?",
            "author": "Azurecole",
            "id": "frqr7sa",
            "parent_id": "t1_frqpgkw",
            "score": 2,
            "created_utc": 1590385546.0,
            "replies": [
                {
                    "body": "The platonic thread.",
                    "author": "LVSugarBebe",
                    "id": "frs2lgc",
                    "parent_id": "t1_frqr7sa",
                    "score": 1,
                    "created_utc": 1590423285.0,
                    "replies": [
                        {
                            "body": "Ah, I'm not sure of the history, maybe a mod who has been here longer will comment.  I am pretty sure the platonic post was last re-worked by an SD, but not sure of original author or revision history.  We have (and have had) SBs who are mods and any of them might have modified it too...",
                            "author": "Azurecole",
                            "id": "frs40f2",
                            "parent_id": "t1_frs2lgc",
                            "score": 1,
                            "created_utc": 1590424028.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Church, We've actually been removing solicitations from the chat room every day, but doubtless miss some!  I can say that every day, every solicitation *that was reported*, was removed.  I know that for sure because I check the chat room report queue a few times a day, and see what got removed.  I'm certain we sometimes miss non-reported ones though.\n\nI don't remember why the chat rooms were created... I remember them getting created, but not the context (I wasn't a mod at the time)",
            "author": "Azurecole",
            "id": "frrufwi",
            "parent_id": "t1_frrtuad",
            "score": 1,
            "created_utc": 1590418889.0,
            "replies": [
                {
                    "body": "Ah then yes, I can't imagine how much is being removed without me seeing it then!\n\nJust curious if it's becoming more hassle than its worth",
                    "author": "Church42",
                    "id": "frrus4q",
                    "parent_id": "t1_frrufwi",
                    "score": 1,
                    "created_utc": 1590419080.0,
                    "replies": []
                },
                {
                    "body": "make work program for unemployed mods",
                    "author": "amigodeface",
                    "id": "g7xketi",
                    "parent_id": "t1_frrufwi",
                    "score": 1,
                    "created_utc": 1602014891.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Weird, I just went through every single link and they all worked fine for me.  Are you using old reddit, new reddit, or an app?",
            "author": "Azurecole",
            "id": "ilhle0t",
            "parent_id": "t1_ilhknet",
            "score": 2,
            "created_utc": 1661279053.0,
            "replies": [
                {
                    "body": "I'm using the app. I tried clicking tips for new sbs and it came to link expired",
                    "author": "meowhart",
                    "id": "ilhqkug",
                    "parent_id": "t1_ilhle0t",
                    "score": 2,
                    "created_utc": 1661281048.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Good catch.  I have no idea how to do it, so I guess I have to go figure out how I edit that sidebar. thanks!",
            "author": "Azurecole",
            "id": "fs1ne63",
            "parent_id": "t1_fs1ll3w",
            "score": 2,
            "created_utc": 1590631691.0,
            "replies": []
        },
        {
            "body": "On the computer using new reddit, if I hover the mouse over my user name, a drop-down menu appears, and one of them is to set user flair.  Do you get that?",
            "author": "Azurecole",
            "id": "fvga5gz",
            "parent_id": "t1_fvg9nno",
            "score": 1,
            "created_utc": 1592670230.0,
            "replies": [
                {
                    "body": "Damn I'm gonna have to get onto an actual computer 😂 thank you letting me know",
                    "author": "lbseida",
                    "id": "fvgaeam",
                    "parent_id": "t1_fvga5gz",
                    "score": 1,
                    "created_utc": 1592670367.0,
                    "replies": [
                        {
                            "body": "You can do it on a phone also.  What app are you using?  Let's see if we can puzzle this one out",
                            "author": "Azurecole",
                            "id": "fvgb371",
                            "parent_id": "t1_fvgaeam",
                            "score": 2,
                            "created_utc": 1592670746.0,
                            "replies": [
                                {
                                    "body": "Just the reddit app? I didn't know there were different ones to be honest 🤔",
                                    "author": "lbseida",
                                    "id": "fvgk8cb",
                                    "parent_id": "t1_fvgb371",
                                    "score": 1,
                                    "created_utc": 1592675761.0,
                                    "replies": [
                                        {
                                            "body": "Yes, there are lots of different apps (I use Relay, for example).   What happens if you're in the slf subreddit, and then click on your name?  Do you get a menu that lets you change user flair?\n\nOtherwise, just let me know which of the standard flairs you want and I can set it for you",
                                            "author": "Azurecole",
                                            "id": "fvglug9",
                                            "parent_id": "t1_fvgk8cb",
                                            "score": 2,
                                            "created_utc": 1592676648.0,
                                            "replies": [
                                                {
                                                    "body": "Haha thank you I found it you're the best azure 😍",
                                                    "author": "lbseida",
                                                    "id": "fvir91w",
                                                    "parent_id": "t1_fvglug9",
                                                    "score": 2,
                                                    "created_utc": 1592726701.0,
                                                    "replies": [
                                                        {
                                                            "body": ":) :)",
                                                            "author": "Azurecole",
                                                            "id": "fvj1v45",
                                                            "parent_id": "t1_fvir91w",
                                                            "score": 2,
                                                            "created_utc": 1592737764.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "bcuz, have you read all the links above, especially  [Tips for new SBs](https://www.reddit.com/r/sugarlifestyleforum/wiki/advice/new_sbs) and  [Modern Sugar Relationship (MSR)](https://www.reddit.com/r/sugarlifestyleforum/wiki/modern-sugar-relationship-msr) and [https://www.reddit.com/r/sugarlifestyleforum/comments/92igpx/some\\_possible\\_tips\\_for\\_new\\_sbs/](https://www.reddit.com/r/sugarlifestyleforum/comments/92igpx/some_possible_tips_for_new_sbs/)\n\nI feel like many of your questions are answered there, especially all the little tips!.  If you want to know if you're presenting yourself right, please consider doing a profile review, you'll get a lot of good feedback",
            "author": "Azurecole",
            "id": "fvv5bbv",
            "parent_id": "t1_fvv2fzm",
            "score": 2,
            "created_utc": 1593015906.0,
            "replies": [
                {
                    "body": "Awesome thank you! Yeah I assumed that they were all there was just wondering if there was anymore I should be aware of! Also where would one get a profile review",
                    "author": "bcuzugly723",
                    "id": "fvv9job",
                    "parent_id": "t1_fvv5bbv",
                    "score": 2,
                    "created_utc": 1593017968.0,
                    "replies": [
                        {
                            "body": "On the sub!  If you look through the sub, you'll find anywhere from 1-4 profile reviews EVERY DAY here, suggest you read through a few to see how they work and what the comments are like",
                            "author": "Azurecole",
                            "id": "fvv9rm8",
                            "parent_id": "t1_fvv9job",
                            "score": 2,
                            "created_utc": 1593018074.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "If you log into whatever your other account was, and use modmail to contact us, we can tell you",
            "author": "Azurecole",
            "id": "fyb3sht",
            "parent_id": "t1_fyaxrg5",
            "score": 3,
            "created_utc": 1594943656.0,
            "replies": []
        },
        {
            "body": "It depends so much on how you are accessing Reddit, but if you are using new reddit, off to the sidebar there is a community options drop down menu that lets you set your flare. I think I can do it for you if you're still having trouble",
            "author": "Azurecole",
            "id": "fznu3ce",
            "parent_id": "t1_fzns35z",
            "score": 1,
            "created_utc": 1596057273.0,
            "replies": [
                {
                    "body": "Got it, thank you!!!",
                    "author": "Osead2018",
                    "id": "fzoq358",
                    "parent_id": "t1_fznu3ce",
                    "score": 1,
                    "created_utc": 1596074303.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "only if you're using the reddit app. If you access reddit any other way -- through a browser, or using the Relay for Reddit app (which is way better than the reddit app anyway :), they will work.  Not sure why this is!",
            "author": "Azurecole",
            "id": "g3ef84k",
            "parent_id": "t1_g3eeu38",
            "score": 3,
            "created_utc": 1598822577.0,
            "replies": []
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "gc9mbpa",
            "parent_id": "t1_gc9jfxa",
            "score": 1,
            "created_utc": 1605373947.0,
            "replies": []
        },
        {
            "body": "If you need to communicate with the mods, send a modmail.  Don't reply on our FAQs.\n\nNo idea what you're talking about, send details (like a link to the post you think you made, it should be in your post history even if it got deleted) when you message the mods",
            "author": "Azurecole",
            "id": "hutbprw",
            "parent_id": "t1_hutb1d1",
            "score": 1,
            "created_utc": 1643518120.0,
            "replies": []
        },
        {
            "body": "That seems to be happening only with people using the reddit app.  It works fine with old reddit, new reddit, and all other apps (from what I can tell).  Can you get to it from this link?  [https://www.reddit.com/r/sugarlifestyleforum/wiki/advice/new\\_sbs/](https://www.reddit.com/r/sugarlifestyleforum/wiki/advice/new_sbs/)While you're at it, worth checking out this: https://www.reddit.com/r/sugarlifestyleforum/comments/92igpx/some\\_possible\\_tips\\_for\\_new\\_sbs/",
            "author": "Azurecole",
            "id": "im5lcnk",
            "parent_id": "t1_im5izum",
            "score": 1,
            "created_utc": 1661709596.0,
            "replies": [
                {
                    "body": "Much appreciated Azurecole! The first link doesn't work (on the app). The second does! I'll try the first link on my laptop later and see if that works.🥰",
                    "author": "CarmelQ95",
                    "id": "im5mklf",
                    "parent_id": "t1_im5lcnk",
                    "score": 1,
                    "created_utc": 1661710095.0,
                    "replies": [
                        {
                            "body": "Well dang -- I definitely want you to see the first link.  Mind checking it through a browser?  It will work fine and has all the new-SB info!",
                            "author": "Azurecole",
                            "id": "im5plrl",
                            "parent_id": "t1_im5mklf",
                            "score": 1,
                            "created_utc": 1661711334.0,
                            "replies": [
                                {
                                    "body": "I sure will! Thanks again for welcoming me and setting me up! 😁",
                                    "author": "CarmelQ95",
                                    "id": "im5pzco",
                                    "parent_id": "t1_im5plrl",
                                    "score": 1,
                                    "created_utc": 1661711492.0,
                                    "replies": []
                                },
                                {
                                    "body": "I read it :).",
                                    "author": "CarmelQ95",
                                    "id": "im5vrb1",
                                    "parent_id": "t1_im5plrl",
                                    "score": 1,
                                    "created_utc": 1661713875.0,
                                    "replies": [
                                        {
                                            "body": "Great!",
                                            "author": "Azurecole",
                                            "id": "im5wj7l",
                                            "parent_id": "t1_im5vrb1",
                                            "score": 2,
                                            "created_utc": 1661714199.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "It works fine for me.  Are you using old reddit, new reddit, the reddit app, or a 3rd party app like Relay or Boost?  Oddly enough, sometimes these links stop working only for one particular way of accessing it (the reddit app seems to have the most problems)",
            "author": "Azurecole",
            "id": "inqduua",
            "parent_id": "t1_inq1amo",
            "score": 1,
            "created_utc": 1662734757.0,
            "replies": []
        },
        {
            "body": "Yeah, the bulleted list is still screwy. Try viewing the post in Old Reddit: https://old.reddit.com/r/sugarlifestyleforum/comments/gpwqxr/read_me_before_posting/",
            "author": "SeattleLaserMeteor",
            "id": "frqa5nw",
            "parent_id": "t1_frq8jpx",
            "score": 7,
            "created_utc": 1590373478.0,
            "replies": [
                {
                    "body": "Oh dang!  Didn't even occur to me that old and new reddit could have different formatting.  Let me add that blank line you suggested\n\nedit: that seems to have fixed it, thanks again",
                    "author": "Azurecole",
                    "id": "frqacsq",
                    "parent_id": "t1_frqa5nw",
                    "score": 6,
                    "created_utc": 1590373606.0,
                    "replies": [
                        {
                            "body": "Thanks! Yeah I've noticed a couple weird formatting differences between the two. For example this properly hyperlinks in Old Reddit, in New Reddit it's just a hyperlink to the subreddit: r/sugarlifestyleforum/comments/gpwqxr/read_me_before_posting/",
                            "author": "SeattleLaserMeteor",
                            "id": "frqalk5",
                            "parent_id": "t1_frqacsq",
                            "score": 2,
                            "created_utc": 1590373763.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Straight SBs for sugar mommas provide more than a dick. Sometimes not even a dick. I've provided attention and an emotional connection for someone who needed that and who showered me in sugar. \n\nBut yes, it's much more rare and doesn't really fit in with the concept of a SB lifestyle or really even fit in this sub.",
            "author": "lickedTators",
            "id": "fs7siqf",
            "parent_id": "t1_frqqzxj",
            "score": 19,
            "created_utc": 1590770772.0,
            "replies": [
                {
                    "body": "A friend of mine that found himself in a SB situation never even slept with her. It was free room and board and companionship, but of course it turned ugly eventually.",
                    "author": "kimchi_Queen",
                    "id": "fs7x2wp",
                    "parent_id": "t1_fs7siqf",
                    "score": 9,
                    "created_utc": 1590772892.0,
                    "replies": []
                },
                {
                    "body": "Where do i find one loll that's exactly what I want to provide. Everything except sex and money. If this gives you an idea of what type of guy I am, I prefer giving head to romantic partners instead of receiving, and prefer to make others happy, pleasured, or gratified instead of asking for my own pleasure.",
                    "author": "ashu1605",
                    "id": "hjxdttu",
                    "parent_id": "t1_fs7siqf",
                    "score": 1,
                    "created_utc": 1636460059.0,
                    "replies": []
                },
                {
                    "body": "Where would you suggest people look if they are interested in that kind of sugar relationship. I'm indifferent on whether or not a relationship is sexual and just know I have a bottomless well of charisma that would do me well if i lived somewhere that properly supported male hosts as a profession like Japan.",
                    "author": "EdgarCrowley",
                    "id": "j3zdk5c",
                    "parent_id": "t1_fs7siqf",
                    "score": 1,
                    "created_utc": 1673490762.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Why are cis women like this",
            "author": "TerrifiedThrowawayz",
            "id": "g5bs6y8",
            "parent_id": "t1_frqqzxj",
            "score": 3,
            "created_utc": 1600145660.0,
            "replies": []
        },
        {
            "body": "No, but the can use my degree in in psychology to get you committed.",
            "author": "tgibook",
            "id": "fy9dmzu",
            "parent_id": "t1_fy8ca10",
            "score": 13,
            "created_utc": 1594912831.0,
            "replies": []
        },
        {
            "body": "You let us know when you find one. lol",
            "author": "NewCanadianSD",
            "id": "ii7w7kn",
            "parent_id": "t1_ii7vgnv",
            "score": 3,
            "created_utc": 1659153785.0,
            "replies": []
        },
        {
            "body": "Thanks for letting us know, u/aimee08645 and u/pacificgrowncoco.  Can you tell me if you're using new reddit (on a browser using a [reddit.com](https://reddit.com) URL), old reddit (on a browser using an [old.reddit.com](https://old.reddit.com) URL), an app (Relay or Reddit app on your phone, for example)?   I have not been able to reproduce this, but have heard that people who are using the Reddit app on their phone are having trouble.",
            "author": "Azurecole",
            "id": "g2c0bh7",
            "parent_id": "t1_g2b04gt",
            "score": 3,
            "created_utc": 1598023606.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "g2c18gm",
                    "parent_id": "t1_g2c0bh7",
                    "score": 5,
                    "created_utc": 1598024058.0,
                    "replies": [
                        {
                            "body": "Okay, I'm not exactly sure whose attention to bring this to, but will do a little research, thanks.  In the meantime, all of this seems to be available if you use anything BUT the reddit app, if you want to look at the wiki right now",
                            "author": "Azurecole",
                            "id": "g2c6ov2",
                            "parent_id": "t1_g2c18gm",
                            "score": 5,
                            "created_utc": 1598026459.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "The platonic thread.",
            "author": "LVSugarBebe",
            "id": "frs2lgc",
            "parent_id": "t1_frqr7sa",
            "score": 1,
            "created_utc": 1590423285.0,
            "replies": [
                {
                    "body": "Ah, I'm not sure of the history, maybe a mod who has been here longer will comment.  I am pretty sure the platonic post was last re-worked by an SD, but not sure of original author or revision history.  We have (and have had) SBs who are mods and any of them might have modified it too...",
                    "author": "Azurecole",
                    "id": "frs40f2",
                    "parent_id": "t1_frs2lgc",
                    "score": 1,
                    "created_utc": 1590424028.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Ah then yes, I can't imagine how much is being removed without me seeing it then!\n\nJust curious if it's becoming more hassle than its worth",
            "author": "Church42",
            "id": "frrus4q",
            "parent_id": "t1_frrufwi",
            "score": 1,
            "created_utc": 1590419080.0,
            "replies": []
        },
        {
            "body": "make work program for unemployed mods",
            "author": "amigodeface",
            "id": "g7xketi",
            "parent_id": "t1_frrufwi",
            "score": 1,
            "created_utc": 1602014891.0,
            "replies": []
        },
        {
            "body": "I'm using the app. I tried clicking tips for new sbs and it came to link expired",
            "author": "meowhart",
            "id": "ilhqkug",
            "parent_id": "t1_ilhle0t",
            "score": 2,
            "created_utc": 1661281048.0,
            "replies": []
        },
        {
            "body": "Damn I'm gonna have to get onto an actual computer 😂 thank you letting me know",
            "author": "lbseida",
            "id": "fvgaeam",
            "parent_id": "t1_fvga5gz",
            "score": 1,
            "created_utc": 1592670367.0,
            "replies": [
                {
                    "body": "You can do it on a phone also.  What app are you using?  Let's see if we can puzzle this one out",
                    "author": "Azurecole",
                    "id": "fvgb371",
                    "parent_id": "t1_fvgaeam",
                    "score": 2,
                    "created_utc": 1592670746.0,
                    "replies": [
                        {
                            "body": "Just the reddit app? I didn't know there were different ones to be honest 🤔",
                            "author": "lbseida",
                            "id": "fvgk8cb",
                            "parent_id": "t1_fvgb371",
                            "score": 1,
                            "created_utc": 1592675761.0,
                            "replies": [
                                {
                                    "body": "Yes, there are lots of different apps (I use Relay, for example).   What happens if you're in the slf subreddit, and then click on your name?  Do you get a menu that lets you change user flair?\n\nOtherwise, just let me know which of the standard flairs you want and I can set it for you",
                                    "author": "Azurecole",
                                    "id": "fvglug9",
                                    "parent_id": "t1_fvgk8cb",
                                    "score": 2,
                                    "created_utc": 1592676648.0,
                                    "replies": [
                                        {
                                            "body": "Haha thank you I found it you're the best azure 😍",
                                            "author": "lbseida",
                                            "id": "fvir91w",
                                            "parent_id": "t1_fvglug9",
                                            "score": 2,
                                            "created_utc": 1592726701.0,
                                            "replies": [
                                                {
                                                    "body": ":) :)",
                                                    "author": "Azurecole",
                                                    "id": "fvj1v45",
                                                    "parent_id": "t1_fvir91w",
                                                    "score": 2,
                                                    "created_utc": 1592737764.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Awesome thank you! Yeah I assumed that they were all there was just wondering if there was anymore I should be aware of! Also where would one get a profile review",
            "author": "bcuzugly723",
            "id": "fvv9job",
            "parent_id": "t1_fvv5bbv",
            "score": 2,
            "created_utc": 1593017968.0,
            "replies": [
                {
                    "body": "On the sub!  If you look through the sub, you'll find anywhere from 1-4 profile reviews EVERY DAY here, suggest you read through a few to see how they work and what the comments are like",
                    "author": "Azurecole",
                    "id": "fvv9rm8",
                    "parent_id": "t1_fvv9job",
                    "score": 2,
                    "created_utc": 1593018074.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Got it, thank you!!!",
            "author": "Osead2018",
            "id": "fzoq358",
            "parent_id": "t1_fznu3ce",
            "score": 1,
            "created_utc": 1596074303.0,
            "replies": []
        },
        {
            "body": "Much appreciated Azurecole! The first link doesn't work (on the app). The second does! I'll try the first link on my laptop later and see if that works.🥰",
            "author": "CarmelQ95",
            "id": "im5mklf",
            "parent_id": "t1_im5lcnk",
            "score": 1,
            "created_utc": 1661710095.0,
            "replies": [
                {
                    "body": "Well dang -- I definitely want you to see the first link.  Mind checking it through a browser?  It will work fine and has all the new-SB info!",
                    "author": "Azurecole",
                    "id": "im5plrl",
                    "parent_id": "t1_im5mklf",
                    "score": 1,
                    "created_utc": 1661711334.0,
                    "replies": [
                        {
                            "body": "I sure will! Thanks again for welcoming me and setting me up! 😁",
                            "author": "CarmelQ95",
                            "id": "im5pzco",
                            "parent_id": "t1_im5plrl",
                            "score": 1,
                            "created_utc": 1661711492.0,
                            "replies": []
                        },
                        {
                            "body": "I read it :).",
                            "author": "CarmelQ95",
                            "id": "im5vrb1",
                            "parent_id": "t1_im5plrl",
                            "score": 1,
                            "created_utc": 1661713875.0,
                            "replies": [
                                {
                                    "body": "Great!",
                                    "author": "Azurecole",
                                    "id": "im5wj7l",
                                    "parent_id": "t1_im5vrb1",
                                    "score": 2,
                                    "created_utc": 1661714199.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Oh dang!  Didn't even occur to me that old and new reddit could have different formatting.  Let me add that blank line you suggested\n\nedit: that seems to have fixed it, thanks again",
            "author": "Azurecole",
            "id": "frqacsq",
            "parent_id": "t1_frqa5nw",
            "score": 6,
            "created_utc": 1590373606.0,
            "replies": [
                {
                    "body": "Thanks! Yeah I've noticed a couple weird formatting differences between the two. For example this properly hyperlinks in Old Reddit, in New Reddit it's just a hyperlink to the subreddit: r/sugarlifestyleforum/comments/gpwqxr/read_me_before_posting/",
                    "author": "SeattleLaserMeteor",
                    "id": "frqalk5",
                    "parent_id": "t1_frqacsq",
                    "score": 2,
                    "created_utc": 1590373763.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "A friend of mine that found himself in a SB situation never even slept with her. It was free room and board and companionship, but of course it turned ugly eventually.",
            "author": "kimchi_Queen",
            "id": "fs7x2wp",
            "parent_id": "t1_fs7siqf",
            "score": 9,
            "created_utc": 1590772892.0,
            "replies": []
        },
        {
            "body": "Where do i find one loll that's exactly what I want to provide. Everything except sex and money. If this gives you an idea of what type of guy I am, I prefer giving head to romantic partners instead of receiving, and prefer to make others happy, pleasured, or gratified instead of asking for my own pleasure.",
            "author": "ashu1605",
            "id": "hjxdttu",
            "parent_id": "t1_fs7siqf",
            "score": 1,
            "created_utc": 1636460059.0,
            "replies": []
        },
        {
            "body": "Where would you suggest people look if they are interested in that kind of sugar relationship. I'm indifferent on whether or not a relationship is sexual and just know I have a bottomless well of charisma that would do me well if i lived somewhere that properly supported male hosts as a profession like Japan.",
            "author": "EdgarCrowley",
            "id": "j3zdk5c",
            "parent_id": "t1_fs7siqf",
            "score": 1,
            "created_utc": 1673490762.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "g2c18gm",
            "parent_id": "t1_g2c0bh7",
            "score": 5,
            "created_utc": 1598024058.0,
            "replies": [
                {
                    "body": "Okay, I'm not exactly sure whose attention to bring this to, but will do a little research, thanks.  In the meantime, all of this seems to be available if you use anything BUT the reddit app, if you want to look at the wiki right now",
                    "author": "Azurecole",
                    "id": "g2c6ov2",
                    "parent_id": "t1_g2c18gm",
                    "score": 5,
                    "created_utc": 1598026459.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Ah, I'm not sure of the history, maybe a mod who has been here longer will comment.  I am pretty sure the platonic post was last re-worked by an SD, but not sure of original author or revision history.  We have (and have had) SBs who are mods and any of them might have modified it too...",
            "author": "Azurecole",
            "id": "frs40f2",
            "parent_id": "t1_frs2lgc",
            "score": 1,
            "created_utc": 1590424028.0,
            "replies": []
        },
        {
            "body": "You can do it on a phone also.  What app are you using?  Let's see if we can puzzle this one out",
            "author": "Azurecole",
            "id": "fvgb371",
            "parent_id": "t1_fvgaeam",
            "score": 2,
            "created_utc": 1592670746.0,
            "replies": [
                {
                    "body": "Just the reddit app? I didn't know there were different ones to be honest 🤔",
                    "author": "lbseida",
                    "id": "fvgk8cb",
                    "parent_id": "t1_fvgb371",
                    "score": 1,
                    "created_utc": 1592675761.0,
                    "replies": [
                        {
                            "body": "Yes, there are lots of different apps (I use Relay, for example).   What happens if you're in the slf subreddit, and then click on your name?  Do you get a menu that lets you change user flair?\n\nOtherwise, just let me know which of the standard flairs you want and I can set it for you",
                            "author": "Azurecole",
                            "id": "fvglug9",
                            "parent_id": "t1_fvgk8cb",
                            "score": 2,
                            "created_utc": 1592676648.0,
                            "replies": [
                                {
                                    "body": "Haha thank you I found it you're the best azure 😍",
                                    "author": "lbseida",
                                    "id": "fvir91w",
                                    "parent_id": "t1_fvglug9",
                                    "score": 2,
                                    "created_utc": 1592726701.0,
                                    "replies": [
                                        {
                                            "body": ":) :)",
                                            "author": "Azurecole",
                                            "id": "fvj1v45",
                                            "parent_id": "t1_fvir91w",
                                            "score": 2,
                                            "created_utc": 1592737764.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "On the sub!  If you look through the sub, you'll find anywhere from 1-4 profile reviews EVERY DAY here, suggest you read through a few to see how they work and what the comments are like",
            "author": "Azurecole",
            "id": "fvv9rm8",
            "parent_id": "t1_fvv9job",
            "score": 2,
            "created_utc": 1593018074.0,
            "replies": []
        },
        {
            "body": "Well dang -- I definitely want you to see the first link.  Mind checking it through a browser?  It will work fine and has all the new-SB info!",
            "author": "Azurecole",
            "id": "im5plrl",
            "parent_id": "t1_im5mklf",
            "score": 1,
            "created_utc": 1661711334.0,
            "replies": [
                {
                    "body": "I sure will! Thanks again for welcoming me and setting me up! 😁",
                    "author": "CarmelQ95",
                    "id": "im5pzco",
                    "parent_id": "t1_im5plrl",
                    "score": 1,
                    "created_utc": 1661711492.0,
                    "replies": []
                },
                {
                    "body": "I read it :).",
                    "author": "CarmelQ95",
                    "id": "im5vrb1",
                    "parent_id": "t1_im5plrl",
                    "score": 1,
                    "created_utc": 1661713875.0,
                    "replies": [
                        {
                            "body": "Great!",
                            "author": "Azurecole",
                            "id": "im5wj7l",
                            "parent_id": "t1_im5vrb1",
                            "score": 2,
                            "created_utc": 1661714199.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Thanks! Yeah I've noticed a couple weird formatting differences between the two. For example this properly hyperlinks in Old Reddit, in New Reddit it's just a hyperlink to the subreddit: r/sugarlifestyleforum/comments/gpwqxr/read_me_before_posting/",
            "author": "SeattleLaserMeteor",
            "id": "frqalk5",
            "parent_id": "t1_frqacsq",
            "score": 2,
            "created_utc": 1590373763.0,
            "replies": []
        },
        {
            "body": "Okay, I'm not exactly sure whose attention to bring this to, but will do a little research, thanks.  In the meantime, all of this seems to be available if you use anything BUT the reddit app, if you want to look at the wiki right now",
            "author": "Azurecole",
            "id": "g2c6ov2",
            "parent_id": "t1_g2c18gm",
            "score": 5,
            "created_utc": 1598026459.0,
            "replies": []
        },
        {
            "body": "Just the reddit app? I didn't know there were different ones to be honest 🤔",
            "author": "lbseida",
            "id": "fvgk8cb",
            "parent_id": "t1_fvgb371",
            "score": 1,
            "created_utc": 1592675761.0,
            "replies": [
                {
                    "body": "Yes, there are lots of different apps (I use Relay, for example).   What happens if you're in the slf subreddit, and then click on your name?  Do you get a menu that lets you change user flair?\n\nOtherwise, just let me know which of the standard flairs you want and I can set it for you",
                    "author": "Azurecole",
                    "id": "fvglug9",
                    "parent_id": "t1_fvgk8cb",
                    "score": 2,
                    "created_utc": 1592676648.0,
                    "replies": [
                        {
                            "body": "Haha thank you I found it you're the best azure 😍",
                            "author": "lbseida",
                            "id": "fvir91w",
                            "parent_id": "t1_fvglug9",
                            "score": 2,
                            "created_utc": 1592726701.0,
                            "replies": [
                                {
                                    "body": ":) :)",
                                    "author": "Azurecole",
                                    "id": "fvj1v45",
                                    "parent_id": "t1_fvir91w",
                                    "score": 2,
                                    "created_utc": 1592737764.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I sure will! Thanks again for welcoming me and setting me up! 😁",
            "author": "CarmelQ95",
            "id": "im5pzco",
            "parent_id": "t1_im5plrl",
            "score": 1,
            "created_utc": 1661711492.0,
            "replies": []
        },
        {
            "body": "I read it :).",
            "author": "CarmelQ95",
            "id": "im5vrb1",
            "parent_id": "t1_im5plrl",
            "score": 1,
            "created_utc": 1661713875.0,
            "replies": [
                {
                    "body": "Great!",
                    "author": "Azurecole",
                    "id": "im5wj7l",
                    "parent_id": "t1_im5vrb1",
                    "score": 2,
                    "created_utc": 1661714199.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yes, there are lots of different apps (I use Relay, for example).   What happens if you're in the slf subreddit, and then click on your name?  Do you get a menu that lets you change user flair?\n\nOtherwise, just let me know which of the standard flairs you want and I can set it for you",
            "author": "Azurecole",
            "id": "fvglug9",
            "parent_id": "t1_fvgk8cb",
            "score": 2,
            "created_utc": 1592676648.0,
            "replies": [
                {
                    "body": "Haha thank you I found it you're the best azure 😍",
                    "author": "lbseida",
                    "id": "fvir91w",
                    "parent_id": "t1_fvglug9",
                    "score": 2,
                    "created_utc": 1592726701.0,
                    "replies": [
                        {
                            "body": ":) :)",
                            "author": "Azurecole",
                            "id": "fvj1v45",
                            "parent_id": "t1_fvir91w",
                            "score": 2,
                            "created_utc": 1592737764.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Great!",
            "author": "Azurecole",
            "id": "im5wj7l",
            "parent_id": "t1_im5vrb1",
            "score": 2,
            "created_utc": 1661714199.0,
            "replies": []
        },
        {
            "body": "Haha thank you I found it you're the best azure 😍",
            "author": "lbseida",
            "id": "fvir91w",
            "parent_id": "t1_fvglug9",
            "score": 2,
            "created_utc": 1592726701.0,
            "replies": [
                {
                    "body": ":) :)",
                    "author": "Azurecole",
                    "id": "fvj1v45",
                    "parent_id": "t1_fvir91w",
                    "score": 2,
                    "created_utc": 1592737764.0,
                    "replies": []
                }
            ]
        },
        {
            "body": ":) :)",
            "author": "Azurecole",
            "id": "fvj1v45",
            "parent_id": "t1_fvir91w",
            "score": 2,
            "created_utc": 1592737764.0,
            "replies": []
        }
    ]
}