{
    "title": "I landed an arrangement, woo!",
    "post_id": "jaf1uj",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/jaf1uj/i_landed_an_arrangement_woo/",
    "author": "selfdestruct_in321",
    "body": "I have no one to share this with in real life so I'll just post it here. I'm officially a sugar baby now, wow!\n\nBackstory: I've been curious about the sugar lifestyle for a couple years - previously joking about getting one, now I follow several sex workers and sugar babies on instagram and they've showed me both the positives and negatives of the lifestyle, so I felt well-prepared prior to diving into this. Also, I'm from a Northern-European country which doesnt really have a great sugaring market - I moved to the UK to study a couple years ago so I feel like it's time to finally take advantage of my location for that purpose. Also, I guess I'm partially writing this post to give hope to other girls out there that's a bit chubbier, I'm 5ft 5 and 11.8st/75kg. I personally thought all men searched for slim/curvy girls so I'm very happy that there was someone out there for me.\n\nNow, 3 weeks ago, I made a profile on SA. It was overwhelming and scary in the start but because of this forum (thank you guys!!) I've learnt what to filter for and see through the messages of which guys that appear scammy or salty. I was afraid of showing my face but found that using a public photo cropping out everything but my smile kept me 'hidden' but still relevant to SDs that prefer seeing their future SB's face. \n\nA week ago I messaged a 45yo man (I'm 21 for reference) and we ended up texting quite a bit - this guy was good at keeping a proper conversation! He's had a profile for a year but haven't used it since he made it (some girl stalked him and confronted him about being married and having kids, despite him disclosing that in his profile... it scared him so he didnt bother trying to find an arrangement - babies, stalk your POTs but do it quietly. When he told me about the stalker I pretended that I hadn't searched for him on Facebook lol). Very randomly he logged on over the weekend, and I looked through recently active profiles and decided to message him. And he loved that I messaged him first: (ladies, take notes!) I referred to something in his profile, introduced myself shortly, then finished off with a convo starter - so far that's been my most successful approach rather than \"hi there, (convo starter)\". \n\nWe agreed on doing a M&G and went to this bar. He bought drinks and we spent around 1.5h together rather than just 30 mins, which was lovely, I could feel that we got along well and that he's not a sketchy guy - he's separated and has 2 kids (oldest is 14), it was very apparent that he's a caring and loving person - hoping that he's like that in bed too, haha! ;) He kept complimenting me, and we actually kissed at the end. Crazily enough, this was both of our first M&Gs off of SA, and we clicked so well! \n\nHe's not from around my city but recently moved because of work, so I feel like I'm in charge of what we're doing and where we're going - I'm a student here (not from the UK) and want to be discreet because I know a lot of people, it's nice to be able to choose where we're going - and he's just happy I'm showing him around the city. We discussed when we were going to have our next meeting at the end of the M&G, and I suggested sushi - that's when I had to drop the \"I'm vegan\"-bomb, and he didn't react badly at all; in fact, he had been a veggie for years previously! Having dinner together won't be awkward at all, he might even be tempted to try the veggie options with me :D\n\nIt's been a bit awkward between us now just having that allowance-talk, going between different numbers.. I realised that my starting number was very very high (maybe not for richer SDs, but this is my first time sugaring so right now gaining SB experience itself is more important to me) - but after reading that someone suggested the ppm to not be below the weekly rent you'd pay for a nice 1 bedroom flat, we landed on a number that we're both happy with. Once the trust is there we're extending to allowance. We're meeting on thursday next week, going for sushi (veggie version, at least for me) :)\n\nThe only thing I'm worried about for the future is people I know seeing me with an older man, and going to a hotel/home with him in terms of safety-precautions; I'm sharing my location with friends and it would be a bit weird to ask them to check in on me hourly lol... anyone got tips for how I can have my friends check in on me without disclosing that I'm sugaring? \n\n\n\nEdit: If there's any other SBs in the UK I'd love to have someone to talk to and share things with! X\n\nEdit 2: He just messaged me saying he's fighting the urge to meet me before thursday next week..! Think I've got him hooked on me\n\nEdit 3: Aaand now we've scheduled a tapas date for monday, as well as the sushi for thursday. No sex yet, still he's agreed to give me (a reduced) PPM. Not trying to rinse him, just want the intimacy to come naturally and he's agreed with that because it's his first arrangement as well. \nAnyone interested in an update post next week? :)",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/jaf1uj/i_landed_an_arrangement_woo/",
    "score": 103,
    "upvote_ratio": 0.98,
    "created_utc": 1602600952.0,
    "num_comments": 42,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "So happy for you girl! I’m vegan as well so dropping that bomb is almost more awkward for me than having the allowance talk 😂",
            "author": "0000xlea",
            "id": "g8p6ckd",
            "parent_id": "t3_jaf1uj",
            "score": 25,
            "created_utc": 1602602110.0,
            "replies": [
                {
                    "body": "Hahah we had both those talks in one night! Expected it to be crazy awkward",
                    "author": "selfdestruct_in321",
                    "id": "g8qfwjz",
                    "parent_id": "t1_g8p6ckd",
                    "score": 3,
                    "created_utc": 1602624389.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Congratulations! If you cant say you are dating someone to your friends, you could say babysitting/nanny, or other gig work. (A lot of girls in my town say they do hair and makeup for studios, for example. It's odd hours, and irregular work, and it's easy to say \"I dont know the person/people I am with very well, can you check in on me? It would make me feel better\")",
            "author": "TastySpermDispenser",
            "id": "g8p6i0g",
            "parent_id": "t3_jaf1uj",
            "score": 11,
            "created_utc": 1602602190.0,
            "replies": [
                {
                    "body": "I always say I have a personal assistant gig to people I’m not comfortable with knowing what exactly I do- and with them I tell them I have an errand that I’m a little worried about and let them know where I’m going.",
                    "author": "miuxiu",
                    "id": "g8r2hul",
                    "parent_id": "t1_g8p6i0g",
                    "score": 3,
                    "created_utc": 1602636994.0,
                    "replies": []
                },
                {
                    "body": "Thank you for the suggestion! I can't really say I'm dating anyone (yes, I have a bf atm but we're on the verge of breaking up - not because of SA though. Long distance is hard). \n\nI will break up with him soon, before the intimate things start, but atm I don't have the balls to do it. At that point it would actually be okay for me to say I'm dating someone that 'lives at an hotel' lol.",
                    "author": "selfdestruct_in321",
                    "id": "g8qgwnn",
                    "parent_id": "t1_g8p6i0g",
                    "score": 2,
                    "created_utc": 1602624911.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Can I ask, what SB ig accounts do you follow?",
            "author": "chakrub",
            "id": "g8poo9r",
            "parent_id": "t3_jaf1uj",
            "score": 9,
            "created_utc": 1602611389.0,
            "replies": [
                {
                    "body": "I wanted to ask the same thing!",
                    "author": "0000xlea",
                    "id": "g8pum85",
                    "parent_id": "t1_g8poo9r",
                    "score": 6,
                    "created_utc": 1602614320.0,
                    "replies": []
                },
                {
                    "body": "Just some explaination: Some SBs on instagram refer to themselves as clowns rather than SBs because they feel like they're putting on a one-woman-show for a man, not showing who they really are, just \"being paid to act and say whatever pleases their SD\" and that it's laughable, just like a clown; I don't have enough experience to agree nor disagree with this, but these women have found unicorn daddies worth marrying. Very interesting to get an insight into their lives, particularly through their stories. Main point: find accounts using clown in the name. \n\nHere's just a few, on insta:\n\ntheclownlife\ntheclowngoddess1\nmiaishighvalue\nsugarfinancial\n\n+ some of my fave sex work positive accounts:\n\nexotic.cancer\nnot.herrealname\nswhorrorstories\nsexworkhistory\nstripper_clown\nfssw_memes\nthebabystripper",
                    "author": "selfdestruct_in321",
                    "id": "g8quoj4",
                    "parent_id": "t1_g8poo9r",
                    "score": 4,
                    "created_utc": 1602632564.0,
                    "replies": [
                        {
                            "body": "Just come across this thread \n\n@clownforcash is a pretty cool newer account",
                            "author": "Aidanxlxxx",
                            "id": "houd2ei",
                            "parent_id": "t1_g8quoj4",
                            "score": 1,
                            "created_utc": 1639695683.0,
                            "replies": []
                        },
                        {
                            "body": "What ever happened to Mia and clownie",
                            "author": "mdmafortune",
                            "id": "j7nfm87",
                            "parent_id": "t1_g8quoj4",
                            "score": 1,
                            "created_utc": 1675820014.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Also curious",
                    "author": "InnerDefinition8328",
                    "id": "g8qt1h4",
                    "parent_id": "t1_g8poo9r",
                    "score": 1,
                    "created_utc": 1602631615.0,
                    "replies": []
                },
                {
                    "body": "Same question here…",
                    "author": "DrMoTheMan",
                    "id": "g8qvicd",
                    "parent_id": "t1_g8poo9r",
                    "score": 1,
                    "created_utc": 1602633042.0,
                    "replies": [
                        {
                            "body": "I wrote it in a comment :) new to Reddit so I'm a bit unsure about how the comment section works heh",
                            "author": "selfdestruct_in321",
                            "id": "g8s31zo",
                            "parent_id": "t1_g8qvicd",
                            "score": 1,
                            "created_utc": 1602665685.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Congratulations! I can confirm two things from your post:\n\n- Northern-European countries indeed do not have a great sugar scene :(\n- There definitely are men into chubby girls, including on SA. :)\n\nI envy the SDs in the UK (and USA) sometimes!",
            "author": "SkepticalChallenge",
            "id": "g8pxl11",
            "parent_id": "t3_jaf1uj",
            "score": 8,
            "created_utc": 1602615796.0,
            "replies": [
                {
                    "body": "YES, the sugar scene is awful! Had a look on my home city to see which sugar daddies were actually available and it showed like 5 people 😂\n\nFeels amazing to finally be in a more metropolian area and actually have the opportunity!",
                    "author": "selfdestruct_in321",
                    "id": "g8qhzn5",
                    "parent_id": "t1_g8pxl11",
                    "score": 1,
                    "created_utc": 1602625485.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I am also vegan n dropping that bomb to the SDs isn’t always easy",
            "author": "TheRealWeedDiva",
            "id": "g8pb65j",
            "parent_id": "t3_jaf1uj",
            "score": 5,
            "created_utc": 1602604603.0,
            "replies": [
                {
                    "body": "Yes 👏👏 more vegans",
                    "author": "0000xlea",
                    "id": "g8puljo",
                    "parent_id": "t1_g8pb65j",
                    "score": 4,
                    "created_utc": 1602614310.0,
                    "replies": [
                        {
                            "body": "Love the amount of vegan SBs randomly seeing this thread! :D",
                            "author": "selfdestruct_in321",
                            "id": "g8qhp6q",
                            "parent_id": "t1_g8puljo",
                            "score": 4,
                            "created_utc": 1602625330.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Vegan SBs: let’s be friends! Feel free to add me! 🌱💚",
                    "author": "TheRealWeedDiva",
                    "id": "g8x6g71",
                    "parent_id": "t1_g8pb65j",
                    "score": 2,
                    "created_utc": 1602785068.0,
                    "replies": [
                        {
                            "body": "My SD was veggie for over a decade a few years ago (he eats meat now though) and just told me he's been considering going vegan for a while now because he miss how fit he felt as a veggie... I guess me coming into his life was the last little kick he needed lol. Honestly, imagine having a vegan SD! Sounds unreal!",
                            "author": "selfdestruct_in321",
                            "id": "g8y4bf1",
                            "parent_id": "t1_g8x6g71",
                            "score": 1,
                            "created_utc": 1602802672.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": " Congratulations! I wouldn’t let other people’s opinions affect you! I’m sure you have 1 best friend you can be honest with and wouldn’t judge you for sugaring. I tell my 2 best friends everything and they don’t judge. If you want someone to talk to I’m always here for you☺️x",
            "author": "Iwannabelikeu",
            "id": "g8p72dj",
            "parent_id": "t3_jaf1uj",
            "score": 3,
            "created_utc": 1602602488.0,
            "replies": [
                {
                    "body": "Thank you! I have a friend or two I could tell this to at home (different country), but it would be better to have someone locally to talk to and report me missing (knock on wood). My friends here aren't as open-minded and I feel like they would gossip and talk about me behind my back if I tell one/both of them... I'm thinking the worst atm, I know they would be supportive but they they also wouldn't be able to not gossip lol.",
                    "author": "selfdestruct_in321",
                    "id": "g8qhm8w",
                    "parent_id": "t1_g8p72dj",
                    "score": 2,
                    "created_utc": 1602625287.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Happy to chat anytime, also a foreigner living in the UK 🌸 good luck with your SD 😊",
            "author": "LunaSolMiel",
            "id": "g8qghqj",
            "parent_id": "t3_jaf1uj",
            "score": 3,
            "created_utc": 1602624696.0,
            "replies": [
                {
                    "body": "Exciting! DM me x",
                    "author": "selfdestruct_in321",
                    "id": "g8qurz3",
                    "parent_id": "t1_g8qghqj",
                    "score": 1,
                    "created_utc": 1602632620.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Congrats and hope it works out longer term for you both.   Win for the U.K. 😁👍🏻\n\nDon’t worry about being seen with an older guy - just own the room ;) \n\nTell your friends you are on a tinder / dating site date and want to stay safe - they won’t know the difference",
            "author": "OneMore97",
            "id": "g8p67uv",
            "parent_id": "t3_jaf1uj",
            "score": 5,
            "created_utc": 1602602043.0,
            "replies": [
                {
                    "body": "Thank you!\nI'm getting used to it, felt that I owned the room during the M&G yesterday (only had 2 groups of people nearby though). Weirdly enough, my SD is 45 but looks more mid/late 30s so the age difference isn't that apparent - I feel lucky! \nThanks for the advice :)",
                    "author": "selfdestruct_in321",
                    "id": "g8qj4dg",
                    "parent_id": "t1_g8p67uv",
                    "score": 2,
                    "created_utc": 1602626092.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Congratulations! Enjoy! Im from the U.K too 😘",
            "author": "SweetTamarindLondon",
            "id": "g8qe582",
            "parent_id": "t3_jaf1uj",
            "score": 2,
            "created_utc": 1602623552.0,
            "replies": [
                {
                    "body": "Oooh I'd love to get in touch! Dm me? X",
                    "author": "selfdestruct_in321",
                    "id": "g8qijrs",
                    "parent_id": "t1_g8qe582",
                    "score": 1,
                    "created_utc": 1602625782.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Congratulations! I hope to land an arrangement soon as well, but I’m from the US. :)",
            "author": "interestingteach711",
            "id": "g8qvh6s",
            "parent_id": "t3_jaf1uj",
            "score": 2,
            "created_utc": 1602633023.0,
            "replies": [
                {
                    "body": "Thank you! Isn't the market over there huge? Or are you from a smaller area? :)",
                    "author": "selfdestruct_in321",
                    "id": "g8s3c4u",
                    "parent_id": "t1_g8qvh6s",
                    "score": 1,
                    "created_utc": 1602666031.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Squueal!!!**** I hope so and live it up!",
            "author": "Stargazerdoe89",
            "id": "g8qzr3l",
            "parent_id": "t3_jaf1uj",
            "score": 2,
            "created_utc": 1602635455.0,
            "replies": [
                {
                    "body": ":D",
                    "author": "selfdestruct_in321",
                    "id": "g8ts9rm",
                    "parent_id": "t1_g8qzr3l",
                    "score": 2,
                    "created_utc": 1602704343.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Spill that tea. What else has happened since I last checked on you!?",
            "author": "Stargazerdoe89",
            "id": "g8tvf65",
            "parent_id": "t3_jaf1uj",
            "score": 2,
            "created_utc": 1602705933.0,
            "replies": [
                {
                    "body": "Check the updates in the post, I made a couple edits :D He's crazy about me haha",
                    "author": "selfdestruct_in321",
                    "id": "g8u37ez",
                    "parent_id": "t1_g8tvf65",
                    "score": 2,
                    "created_utc": 1602709832.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Congratulations! This has given me some confidence in the UK sugaring scene lol",
            "author": "minaeshi",
            "id": "g98ajqj",
            "parent_id": "t3_jaf1uj",
            "score": 2,
            "created_utc": 1603035589.0,
            "replies": [
                {
                    "body": "Dm me if you want a friend to discuss sugar with ahah, I dont feel like I could talk to any of my friends about sugaring xx had a few girls message me already, good to share experiences etc. and ask questions x",
                    "author": "selfdestruct_in321",
                    "id": "g98hqm6",
                    "parent_id": "t1_g98ajqj",
                    "score": 1,
                    "created_utc": 1603039497.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Congratulations! I'm hoping to land a similar type Arrangement over here in the States but I kind of have a process that I go through and most of the fellows nearby can't take the heat from a sit-in with me let alone any of the Heat I would produce anywhere else in their life :-(",
            "author": "Stargazerdoe89",
            "id": "g8pfigf",
            "parent_id": "t3_jaf1uj",
            "score": 2,
            "created_utc": 1602606828.0,
            "replies": [
                {
                    "body": "Aww you'll find someone! I was just lucky, messaging the right guy at the right time - as I mentioned in my post; don't be afraid to message men first, esp those without a photo (depending on what their profile text says I feel like they're more serious about finding an SB).\n\nOh, he just messaged me saying he's fighting the urge to meet me before thursday next week..! Think I've got him hooked on me",
                    "author": "selfdestruct_in321",
                    "id": "g8qiif4",
                    "parent_id": "t1_g8pfigf",
                    "score": 4,
                    "created_utc": 1602625762.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "So happy for you.",
            "author": "Accurate_Control5104",
            "id": "g8q8hhn",
            "parent_id": "t3_jaf1uj",
            "score": 1,
            "created_utc": 1602621175.0,
            "replies": [
                {
                    "body": "Thank you! X",
                    "author": "selfdestruct_in321",
                    "id": "g8qikbm",
                    "parent_id": "t1_g8q8hhn",
                    "score": 1,
                    "created_utc": 1602625790.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "On it <3",
            "author": "Stargazerdoe89",
            "id": "g8vfqga",
            "parent_id": "t3_jaf1uj",
            "score": 1,
            "created_utc": 1602739560.0,
            "replies": []
        },
        {
            "body": "Hahah we had both those talks in one night! Expected it to be crazy awkward",
            "author": "selfdestruct_in321",
            "id": "g8qfwjz",
            "parent_id": "t1_g8p6ckd",
            "score": 3,
            "created_utc": 1602624389.0,
            "replies": []
        },
        {
            "body": "I always say I have a personal assistant gig to people I’m not comfortable with knowing what exactly I do- and with them I tell them I have an errand that I’m a little worried about and let them know where I’m going.",
            "author": "miuxiu",
            "id": "g8r2hul",
            "parent_id": "t1_g8p6i0g",
            "score": 3,
            "created_utc": 1602636994.0,
            "replies": []
        },
        {
            "body": "Thank you for the suggestion! I can't really say I'm dating anyone (yes, I have a bf atm but we're on the verge of breaking up - not because of SA though. Long distance is hard). \n\nI will break up with him soon, before the intimate things start, but atm I don't have the balls to do it. At that point it would actually be okay for me to say I'm dating someone that 'lives at an hotel' lol.",
            "author": "selfdestruct_in321",
            "id": "g8qgwnn",
            "parent_id": "t1_g8p6i0g",
            "score": 2,
            "created_utc": 1602624911.0,
            "replies": []
        },
        {
            "body": "I wanted to ask the same thing!",
            "author": "0000xlea",
            "id": "g8pum85",
            "parent_id": "t1_g8poo9r",
            "score": 6,
            "created_utc": 1602614320.0,
            "replies": []
        },
        {
            "body": "Just some explaination: Some SBs on instagram refer to themselves as clowns rather than SBs because they feel like they're putting on a one-woman-show for a man, not showing who they really are, just \"being paid to act and say whatever pleases their SD\" and that it's laughable, just like a clown; I don't have enough experience to agree nor disagree with this, but these women have found unicorn daddies worth marrying. Very interesting to get an insight into their lives, particularly through their stories. Main point: find accounts using clown in the name. \n\nHere's just a few, on insta:\n\ntheclownlife\ntheclowngoddess1\nmiaishighvalue\nsugarfinancial\n\n+ some of my fave sex work positive accounts:\n\nexotic.cancer\nnot.herrealname\nswhorrorstories\nsexworkhistory\nstripper_clown\nfssw_memes\nthebabystripper",
            "author": "selfdestruct_in321",
            "id": "g8quoj4",
            "parent_id": "t1_g8poo9r",
            "score": 4,
            "created_utc": 1602632564.0,
            "replies": [
                {
                    "body": "Just come across this thread \n\n@clownforcash is a pretty cool newer account",
                    "author": "Aidanxlxxx",
                    "id": "houd2ei",
                    "parent_id": "t1_g8quoj4",
                    "score": 1,
                    "created_utc": 1639695683.0,
                    "replies": []
                },
                {
                    "body": "What ever happened to Mia and clownie",
                    "author": "mdmafortune",
                    "id": "j7nfm87",
                    "parent_id": "t1_g8quoj4",
                    "score": 1,
                    "created_utc": 1675820014.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Also curious",
            "author": "InnerDefinition8328",
            "id": "g8qt1h4",
            "parent_id": "t1_g8poo9r",
            "score": 1,
            "created_utc": 1602631615.0,
            "replies": []
        },
        {
            "body": "Same question here…",
            "author": "DrMoTheMan",
            "id": "g8qvicd",
            "parent_id": "t1_g8poo9r",
            "score": 1,
            "created_utc": 1602633042.0,
            "replies": [
                {
                    "body": "I wrote it in a comment :) new to Reddit so I'm a bit unsure about how the comment section works heh",
                    "author": "selfdestruct_in321",
                    "id": "g8s31zo",
                    "parent_id": "t1_g8qvicd",
                    "score": 1,
                    "created_utc": 1602665685.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "YES, the sugar scene is awful! Had a look on my home city to see which sugar daddies were actually available and it showed like 5 people 😂\n\nFeels amazing to finally be in a more metropolian area and actually have the opportunity!",
            "author": "selfdestruct_in321",
            "id": "g8qhzn5",
            "parent_id": "t1_g8pxl11",
            "score": 1,
            "created_utc": 1602625485.0,
            "replies": []
        },
        {
            "body": "Yes 👏👏 more vegans",
            "author": "0000xlea",
            "id": "g8puljo",
            "parent_id": "t1_g8pb65j",
            "score": 4,
            "created_utc": 1602614310.0,
            "replies": [
                {
                    "body": "Love the amount of vegan SBs randomly seeing this thread! :D",
                    "author": "selfdestruct_in321",
                    "id": "g8qhp6q",
                    "parent_id": "t1_g8puljo",
                    "score": 4,
                    "created_utc": 1602625330.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Vegan SBs: let’s be friends! Feel free to add me! 🌱💚",
            "author": "TheRealWeedDiva",
            "id": "g8x6g71",
            "parent_id": "t1_g8pb65j",
            "score": 2,
            "created_utc": 1602785068.0,
            "replies": [
                {
                    "body": "My SD was veggie for over a decade a few years ago (he eats meat now though) and just told me he's been considering going vegan for a while now because he miss how fit he felt as a veggie... I guess me coming into his life was the last little kick he needed lol. Honestly, imagine having a vegan SD! Sounds unreal!",
                    "author": "selfdestruct_in321",
                    "id": "g8y4bf1",
                    "parent_id": "t1_g8x6g71",
                    "score": 1,
                    "created_utc": 1602802672.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Thank you! I have a friend or two I could tell this to at home (different country), but it would be better to have someone locally to talk to and report me missing (knock on wood). My friends here aren't as open-minded and I feel like they would gossip and talk about me behind my back if I tell one/both of them... I'm thinking the worst atm, I know they would be supportive but they they also wouldn't be able to not gossip lol.",
            "author": "selfdestruct_in321",
            "id": "g8qhm8w",
            "parent_id": "t1_g8p72dj",
            "score": 2,
            "created_utc": 1602625287.0,
            "replies": []
        },
        {
            "body": "Exciting! DM me x",
            "author": "selfdestruct_in321",
            "id": "g8qurz3",
            "parent_id": "t1_g8qghqj",
            "score": 1,
            "created_utc": 1602632620.0,
            "replies": []
        },
        {
            "body": "Thank you!\nI'm getting used to it, felt that I owned the room during the M&G yesterday (only had 2 groups of people nearby though). Weirdly enough, my SD is 45 but looks more mid/late 30s so the age difference isn't that apparent - I feel lucky! \nThanks for the advice :)",
            "author": "selfdestruct_in321",
            "id": "g8qj4dg",
            "parent_id": "t1_g8p67uv",
            "score": 2,
            "created_utc": 1602626092.0,
            "replies": []
        },
        {
            "body": "Oooh I'd love to get in touch! Dm me? X",
            "author": "selfdestruct_in321",
            "id": "g8qijrs",
            "parent_id": "t1_g8qe582",
            "score": 1,
            "created_utc": 1602625782.0,
            "replies": []
        },
        {
            "body": "Thank you! Isn't the market over there huge? Or are you from a smaller area? :)",
            "author": "selfdestruct_in321",
            "id": "g8s3c4u",
            "parent_id": "t1_g8qvh6s",
            "score": 1,
            "created_utc": 1602666031.0,
            "replies": []
        },
        {
            "body": ":D",
            "author": "selfdestruct_in321",
            "id": "g8ts9rm",
            "parent_id": "t1_g8qzr3l",
            "score": 2,
            "created_utc": 1602704343.0,
            "replies": []
        },
        {
            "body": "Check the updates in the post, I made a couple edits :D He's crazy about me haha",
            "author": "selfdestruct_in321",
            "id": "g8u37ez",
            "parent_id": "t1_g8tvf65",
            "score": 2,
            "created_utc": 1602709832.0,
            "replies": []
        },
        {
            "body": "Dm me if you want a friend to discuss sugar with ahah, I dont feel like I could talk to any of my friends about sugaring xx had a few girls message me already, good to share experiences etc. and ask questions x",
            "author": "selfdestruct_in321",
            "id": "g98hqm6",
            "parent_id": "t1_g98ajqj",
            "score": 1,
            "created_utc": 1603039497.0,
            "replies": []
        },
        {
            "body": "Aww you'll find someone! I was just lucky, messaging the right guy at the right time - as I mentioned in my post; don't be afraid to message men first, esp those without a photo (depending on what their profile text says I feel like they're more serious about finding an SB).\n\nOh, he just messaged me saying he's fighting the urge to meet me before thursday next week..! Think I've got him hooked on me",
            "author": "selfdestruct_in321",
            "id": "g8qiif4",
            "parent_id": "t1_g8pfigf",
            "score": 4,
            "created_utc": 1602625762.0,
            "replies": []
        },
        {
            "body": "Thank you! X",
            "author": "selfdestruct_in321",
            "id": "g8qikbm",
            "parent_id": "t1_g8q8hhn",
            "score": 1,
            "created_utc": 1602625790.0,
            "replies": []
        },
        {
            "body": "Just come across this thread \n\n@clownforcash is a pretty cool newer account",
            "author": "Aidanxlxxx",
            "id": "houd2ei",
            "parent_id": "t1_g8quoj4",
            "score": 1,
            "created_utc": 1639695683.0,
            "replies": []
        },
        {
            "body": "What ever happened to Mia and clownie",
            "author": "mdmafortune",
            "id": "j7nfm87",
            "parent_id": "t1_g8quoj4",
            "score": 1,
            "created_utc": 1675820014.0,
            "replies": []
        },
        {
            "body": "I wrote it in a comment :) new to Reddit so I'm a bit unsure about how the comment section works heh",
            "author": "selfdestruct_in321",
            "id": "g8s31zo",
            "parent_id": "t1_g8qvicd",
            "score": 1,
            "created_utc": 1602665685.0,
            "replies": []
        },
        {
            "body": "Love the amount of vegan SBs randomly seeing this thread! :D",
            "author": "selfdestruct_in321",
            "id": "g8qhp6q",
            "parent_id": "t1_g8puljo",
            "score": 4,
            "created_utc": 1602625330.0,
            "replies": []
        },
        {
            "body": "My SD was veggie for over a decade a few years ago (he eats meat now though) and just told me he's been considering going vegan for a while now because he miss how fit he felt as a veggie... I guess me coming into his life was the last little kick he needed lol. Honestly, imagine having a vegan SD! Sounds unreal!",
            "author": "selfdestruct_in321",
            "id": "g8y4bf1",
            "parent_id": "t1_g8x6g71",
            "score": 1,
            "created_utc": 1602802672.0,
            "replies": []
        }
    ]
}