{
    "title": "What’s the stupidest thing you did before you truly understood unspoken rules of sugaring?",
    "post_id": "nd7aa1",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/nd7aa1/whats_the_stupidest_thing_you_did_before_you/",
    "author": "Illustrious_Ride_",
    "body": "I wish I knew this subreddit existed long before I entered the sugar bowl. I went into this thinking my wits and charm was all I needed to get a decent arrangement but I was so wrong. \n\nYou would think if a young lady is seeking financial support, people would see that as an opportunity to provide that help in a mutually beneficial SR. It makes me cringe thinking about how I propositioned myself to these men and the amount of trust I placed for them to hold up their end of the arrangement. Quite the disheartening experience but guess you live and you learn.  \n\nI’ll go first, I used to have intimacy on the first date and, therefore, was nothing more than a booty call for these guys. Also, occasionally gave out my real number and one time had a M&G at MY APARTMENT. \n\nDownvote me into oblivion, I deserve it.\n\nEDIT: You guys are SO FREAKING PRECIOUS. Thank you for not judging my mishaps and sharing your stories. I hope we all learn something from each other and continue looking out for one another 🤙🏼",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/nd7aa1/whats_the_stupidest_thing_you_did_before_you/",
    "score": 302,
    "upvote_ratio": 0.99,
    "created_utc": 1621109110.0,
    "num_comments": 116,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "Upvote for honesty. \n\nMy first time meeting someone off a sugar site I had no idea what to expect and almost salted her. We chatted about what she wanted before our first date. She mentioned financial help, along with other things (like respect, dinner out, etc), but we didn't talk about anything in specific. M&G was dinner. Over dessert I asked if she wanted to come back to my place and she said yes. We ended up having sex (great sex) and I took her home. No discussion of money at all.\n\nThe next morning I didn't really know what to do. I asked her for her venmo so I could send her something, and sent her $xxx. We saw each other a couple of times after that.\n\nSo, I ended up getting it right, but I was definitely clueless.\n\nEdit: btw, we both used our real numbers. Definitely don't do that anymore.",
            "author": "ChapterRelative",
            "id": "gy98y87",
            "parent_id": "t3_nd7aa1",
            "score": 87,
            "created_utc": 1621113684.0,
            "replies": [
                {
                    "body": "Hey, good for you. Taking initiative despite lack of communication. I feel like I put myself in a similar situation as her and assumed the guy knew what to do. I found talking about money super uncomfortable and figured we all knew why we were here.",
                    "author": "Illustrious_Ride_",
                    "id": "gy99kt5",
                    "parent_id": "t1_gy98y87",
                    "score": 36,
                    "created_utc": 1621114003.0,
                    "replies": [
                        {
                            "body": "Did it work out for you? Guessing not?",
                            "author": "ChapterRelative",
                            "id": "gy99p3q",
                            "parent_id": "t1_gy99kt5",
                            "score": 6,
                            "created_utc": 1621114065.0,
                            "replies": [
                                {
                                    "body": "Eventually, yes. I realize now that the ones who understand the arrangement will discuss the terms before we get ahead of ourselves. First few guys I met were young and had no idea what they were doing as much as I did.",
                                    "author": "Illustrious_Ride_",
                                    "id": "gy9a0cq",
                                    "parent_id": "t1_gy99p3q",
                                    "score": 14,
                                    "created_utc": 1621114228.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": ">I feel like I put myself in a similar situation as her and assumed the guy knew what to do. I found talking about money super uncomfortable and figured we all knew why we were here.\n\nThis. I was so uncomfortable talking about money my first time around.",
                            "author": "softspoken1990",
                            "id": "gy9buza",
                            "parent_id": "t1_gy99kt5",
                            "score": 5,
                            "created_utc": 1621115191.0,
                            "replies": [
                                {
                                    "body": "Ugh, right. It’s like I don’t want to ask for money but at this point if an allowance isn’t his ideal type of arrangement I just go on to the next one. No point in pushing my agenda on someone if we’re not on the same page.",
                                    "author": "Illustrious_Ride_",
                                    "id": "gy9cc2z",
                                    "parent_id": "t1_gy9buza",
                                    "score": 9,
                                    "created_utc": 1621115440.0,
                                    "replies": [
                                        {
                                            "body": "Yes, agreed!!",
                                            "author": "softspoken1990",
                                            "id": "gy9q7uc",
                                            "parent_id": "t1_gy9cc2z",
                                            "score": 2,
                                            "created_utc": 1621122921.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "You only deserve the downvotes if you've nothing learned from your experiences.\n\nI also have done many things that at the time and given my knowledge seemed okay, but would be extremely stupid today. I can laugh about most of these things today, it was not so funny then.",
            "author": "Red_Baron_17",
            "id": "gy91eah",
            "parent_id": "t3_nd7aa1",
            "score": 38,
            "created_utc": 1621109794.0,
            "replies": [
                {
                    "body": "Haha thank you. I’ve definitely come a long way.",
                    "author": "Illustrious_Ride_",
                    "id": "gy922u7",
                    "parent_id": "t1_gy91eah",
                    "score": 13,
                    "created_utc": 1621110149.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gy9fj3u",
            "parent_id": "t3_nd7aa1",
            "score": 34,
            "created_utc": 1621117153.0,
            "replies": [
                {
                    "body": "Hope it all worked out in the end!",
                    "author": "Illustrious_Ride_",
                    "id": "gy9i4hm",
                    "parent_id": "t1_gy9fj3u",
                    "score": 3,
                    "created_utc": 1621118546.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gya1men",
            "parent_id": "t3_nd7aa1",
            "score": 35,
            "created_utc": 1621129377.0,
            "replies": [
                {
                    "body": "I’m sorry to hear that about your friend and even happier you had such great judgement at such a young age! That’s absolutely terrifying and really puts things to into perspective. It really is all fun and games until somebody gets hurt. Thank you for sharing your story, I’m sure it will be a wake up call for a lot of us on here ❣️",
                    "author": "Illustrious_Ride_",
                    "id": "gya2nqd",
                    "parent_id": "t1_gya1men",
                    "score": 12,
                    "created_utc": 1621129952.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "SLF gon beat my ass for this, but getting my ppm *after* intimacy. I still do this unfortunately, but it thankfully has not backfired on me. Bro I just feel weird asking for money beforehand.",
            "author": null,
            "id": "gy9kprx",
            "parent_id": "t3_nd7aa1",
            "score": 30,
            "created_utc": 1621119933.0,
            "replies": [
                {
                    "body": "Hey, I’m right there with you. I hate being greeted with a wad of cash. My Sd pays me via venmo after I head out. I like getting paid after because if I show up and surprise him with new lingerie I’ll get wayyyyy more than what we agreed. Took a level of trust to get there though and he’s never missed a payment. I feel like guys who want something ongoing are less likely to jib you with ppm.",
                    "author": "Illustrious_Ride_",
                    "id": "gy9l7gp",
                    "parent_id": "t1_gy9kprx",
                    "score": 24,
                    "created_utc": 1621120201.0,
                    "replies": [
                        {
                            "body": "Yeah, it feels strange! All of my SDs have all done venmo, too. But wait girl, don’t block your blessings! Show up in the lingerie 🌚",
                            "author": null,
                            "id": "gy9pcgb",
                            "parent_id": "t1_gy9l7gp",
                            "score": 7,
                            "created_utc": 1621122460.0,
                            "replies": []
                        },
                        {
                            "body": "I wish my SB showed up in new lingerie. I always get it for her and she gets right to it as soon as we meet up. Don't get me wrong I like it but sometimes its nice to slow things down and enjoy it before.",
                            "author": "xWolverine21x",
                            "id": "gyc9nx6",
                            "parent_id": "t1_gy9l7gp",
                            "score": 2,
                            "created_utc": 1621183415.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "No one has ever asked me for the ppm before hand.\n\n Closest was this convo:\nHer: \"before we go any further...\"\nMe: points at an envelope sitting on a table.\nHer: \"I trust you.\"\nAnd off we went :)",
                    "author": "ChapterRelative",
                    "id": "gya4voa",
                    "parent_id": "t1_gy9kprx",
                    "score": 12,
                    "created_utc": 1621131221.0,
                    "replies": [
                        {
                            "body": "🙌🏾🙌🏾",
                            "author": null,
                            "id": "gyattng",
                            "parent_id": "t1_gya4voa",
                            "score": 2,
                            "created_utc": 1621148554.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "I think ppm after is more common than ppm before. As we found out with covid, people don’t follow guidance.",
                    "author": "BishopSD",
                    "id": "gy9xdr3",
                    "parent_id": "t1_gy9kprx",
                    "score": 9,
                    "created_utc": 1621126916.0,
                    "replies": []
                },
                {
                    "body": "I’ve always given it to the girl at the end (for\nPPM dates) because of fear of getting rinsed.  No one has pushed back on that.",
                    "author": null,
                    "id": "gybb5mp",
                    "parent_id": "t1_gy9kprx",
                    "score": 4,
                    "created_utc": 1621164197.0,
                    "replies": []
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "gybs7yl",
                    "parent_id": "t1_gy9kprx",
                    "score": 3,
                    "created_utc": 1621175038.0,
                    "replies": [
                        {
                            "body": "💀💀\nIt’s not the worst, but telling SLF the time I stepped in a gutted, filthy subaru with a fucking lunatic is a whooole other story",
                            "author": null,
                            "id": "gycfho7",
                            "parent_id": "t1_gybs7yl",
                            "score": 1,
                            "created_utc": 1621185976.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gy940ym",
            "parent_id": "t3_nd7aa1",
            "score": 54,
            "created_utc": 1621111148.0,
            "replies": [
                {
                    "body": "Damn! What a roller coaster. You must have really liked her!",
                    "author": "Illustrious_Ride_",
                    "id": "gy991g2",
                    "parent_id": "t1_gy940ym",
                    "score": 19,
                    "created_utc": 1621113728.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "gy9ocb8",
                            "parent_id": "t1_gy991g2",
                            "score": 18,
                            "created_utc": 1621121913.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "gyaavt3",
                                    "parent_id": "t1_gy9ocb8",
                                    "score": 16,
                                    "created_utc": 1621134863.0,
                                    "replies": [
                                        {
                                            "body": "Noo this is so raw I love it!",
                                            "author": "Illustrious_Ride_",
                                            "id": "gyawxh8",
                                            "parent_id": "t1_gyaavt3",
                                            "score": 5,
                                            "created_utc": 1621151383.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "I’ve done the same before... had a couple Hundred on cash app that had been sitting there for idk how long and was like screw it let’s see how this plays out... ultimately played out in me losing about a 70 bucks, but was curious",
                                            "author": "ntxstud007",
                                            "id": "gyeafrl",
                                            "parent_id": "t1_gyaavt3",
                                            "score": 1,
                                            "created_utc": 1621217785.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": ">sweet innocent girl acting bad or a bad girl acting innocent\n\nHave a name: manipulative.",
                                    "author": "your_right11",
                                    "id": "gyfj6rw",
                                    "parent_id": "t1_gy9ocb8",
                                    "score": 3,
                                    "created_utc": 1621248972.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "What’s rinsing? I’ve never heard of that term",
                    "author": "kittygirl-818",
                    "id": "gy9lp3m",
                    "parent_id": "t1_gy940ym",
                    "score": 7,
                    "created_utc": 1621120476.0,
                    "replies": [
                        {
                            "body": "When a sink is rinsed out everything is taken out, right? That happened to his wallet.",
                            "author": null,
                            "id": "gy9nqx3",
                            "parent_id": "t1_gy9lp3m",
                            "score": 9,
                            "created_utc": 1621121594.0,
                            "replies": []
                        },
                        {
                            "body": "Here is a definition that might be useful to you -\n\nIs someone who just uses someone for their money. Once they have taken all they can, they then dump the person like trash.\n\n***\"A rinser is someone who uses charm and emotions disingenuously to gain material possessions. The rinser's hidden agenda is only to receive as many monetary rewards as possible from POTs and SDs, while acting like she truly cares\"..Google***",
                            "author": "2020Traveller",
                            "id": "gydawxl",
                            "parent_id": "t1_gy9lp3m",
                            "score": 1,
                            "created_utc": 1621200098.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Out of curiosity. How much money did you lose in total?",
                    "author": "quarantine-23",
                    "id": "gybssc1",
                    "parent_id": "t1_gy940ym",
                    "score": 1,
                    "created_utc": 1621175334.0,
                    "replies": [
                        {
                            "body": "For this part of the story about 5k.  Total for her about 30k all for 4-5 indoor only dates.   Bad part is she's just dumb and makes bad decisions so needed money and not even able to enjoy it.   Like I ended up paying a deposit and first month rent for 3 different apartments.  1 she was scammed, 2 her abusive ex found out where she lived, and 3 isn't ready yet I guess because she's been trying to hit me up for more money.",
                            "author": "UseRound7488",
                            "id": "gyc5ix5",
                            "parent_id": "t1_gybssc1",
                            "score": 2,
                            "created_utc": 1621181512.0,
                            "replies": [
                                {
                                    "body": "Could 1 and 2 be her stories?",
                                    "author": "Crucial_Lessons",
                                    "id": "gyrc0dx",
                                    "parent_id": "t1_gyc5ix5",
                                    "score": 1,
                                    "created_utc": 1621466775.0,
                                    "replies": [
                                        {
                                            "body": "Sure.  But she needed a place since I was paying for hotels for her to stay.",
                                            "author": "UseRound7488",
                                            "id": "gyrkiom",
                                            "parent_id": "t1_gyrc0dx",
                                            "score": 1,
                                            "created_utc": 1621471099.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "A meet n greet IN HIS CAR! he just wanted to go for a drive! What the fuck was i thinking! It got weird quick and I asked him to turn back and he did, thankfullly. But, OMG",
            "author": "urbanhippy123",
            "id": "gy9ru6t",
            "parent_id": "t3_nd7aa1",
            "score": 26,
            "created_utc": 1621123801.0,
            "replies": [
                {
                    "body": "omg yes. rule no 2 is to never get in anyone's car. MG is always at a place full of people. i guess that's hars now coz of covid haha",
                    "author": "Muted_Bird_3890",
                    "id": "gya4b2j",
                    "parent_id": "t1_gy9ru6t",
                    "score": 8,
                    "created_utc": 1621130888.0,
                    "replies": []
                },
                {
                    "body": "Omggg I’d be so scared. At least at my house I feel a bit more in control (not that it’s at all any better) but being with a stranger at the wheel would make me so uncomfortable! How was he being weird and did you ever hear from him again?",
                    "author": "Illustrious_Ride_",
                    "id": "gy9s07q",
                    "parent_id": "t1_gy9ru6t",
                    "score": 4,
                    "created_utc": 1621123891.0,
                    "replies": [
                        {
                            "body": "If I recall Correctly he was either my 1st ever or 2nd ever meet n greet, like 7 years ago, long before I found SLF... I just think there wasn’t chemistry, and the reality that I was cruising down country roads with an old man who I didnt know at all really Hit me",
                            "author": "urbanhippy123",
                            "id": "gyagcw7",
                            "parent_id": "t1_gy9s07q",
                            "score": 5,
                            "created_utc": 1621138346.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Thanks for the tip - I definitely enjoy driving my car at night while listening some good music,  I have not invites a baby to join me bit never crossed my mind it could feel dangerous for them.",
                    "author": "k815",
                    "id": "h2gi5xy",
                    "parent_id": "t1_gy9ru6t",
                    "score": 1,
                    "created_utc": 1624216775.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I got rinsed by sending money ahead of a date to “avoid being transactional” during it date to have her ruin a night waiting and waiting for her with promises of her just a moment away.  I’m still not sure why she didn’t just block me.  We did a fairly lengthy phone call and texting ahead of time but didn’t M&G.  I was blinded by her teasing my fetish and I wasn’t thinking clearly.   Lesson learned and it’s saved me every since (12 years)",
            "author": "Alienrite",
            "id": "gy9c1ur",
            "parent_id": "t3_nd7aa1",
            "score": 15,
            "created_utc": 1621115291.0,
            "replies": [
                {
                    "body": "Oof! That’s impressive. I wouldn’t even know how to convince someone to send me money before meeting even if I wanted to.",
                    "author": "Illustrious_Ride_",
                    "id": "gy9cg6h",
                    "parent_id": "t1_gy9c1ur",
                    "score": 7,
                    "created_utc": 1621115499.0,
                    "replies": [
                        {
                            "body": "I won’t share her secret but it was casual and “helpful”.  I actually appreciate a good hustle",
                            "author": "Alienrite",
                            "id": "gy9co49",
                            "parent_id": "t1_gy9cg6h",
                            "score": 15,
                            "created_utc": 1621115616.0,
                            "replies": [
                                {
                                    "body": "I’d like to know..",
                                    "author": "MJRed1",
                                    "id": "gy9pjh0",
                                    "parent_id": "t1_gy9co49",
                                    "score": 7,
                                    "created_utc": 1621122565.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Getting rinsed I think is as bad as it has gotten for me. \n\nA bit rinsed (total stayed in the 3 figures) by someone who I still see pop up on SA from time to time.  Two platonic dates which were nice (and I found her quite attractive) but she plied cash out of me at the end of them. Then when we met at a hotel I paid for the room, we met in the room, and she did a \"I can't go through with this.\" I had not given her any cash (yet) that time so I was just out the room.  She was not new to SA then, so I'm not entirely sure what her strategy was to bail before getting more cash out of me. Maybe she just wasn't that into me??\n\nWeirdness: Met an SB while traveling. Had a nice intimate evening.  A month later I get a text saying it's her mom, she's in intensive care, OD'd on unknown drugs, she found my number in the phone and wants to know if I know who sold her the drugs. I responded that I met her a month ago, do not live in her city, and am really sorry but couldn't help. She apparently recovered as I did see her on SA again afterwards. I was *not* stupid enough to see her again the next time I was in her city.",
            "author": null,
            "id": "gy96j52",
            "parent_id": "t3_nd7aa1",
            "score": 29,
            "created_utc": 1621112440.0,
            "replies": [
                {
                    "body": "So strange the mom came after you like that! Must have been a super uncomfortable conversation. Glad she’s okay, nonetheless.",
                    "author": "Illustrious_Ride_",
                    "id": "gy99bi3",
                    "parent_id": "t1_gy96j52",
                    "score": 11,
                    "created_utc": 1621113871.0,
                    "replies": [
                        {
                            "body": "At first I was pretty sus but I think it really was her mom trying to figure out how her daughter ended up OD'ed in the ICU.  I'm glad she came out of it OK too!",
                            "author": null,
                            "id": "gy99m0g",
                            "parent_id": "t1_gy99bi3",
                            "score": 14,
                            "created_utc": 1621114021.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Girls who are willing to have sex on the first meet, usually have issues especially over the age of 22",
                    "author": "CspanSF",
                    "id": "gy9fbrk",
                    "parent_id": "t1_gy96j52",
                    "score": -36,
                    "created_utc": 1621117042.0,
                    "replies": [
                        {
                            "body": "No; women (they are \"women\" if over 22, not \"girls\") are free to decide when to have sex with with whom. I do not find your generalization accurate.\n\nAnd furthermore, I'd ask what \"issues\" you mean but I suspect it'd just go further downhill.",
                            "author": null,
                            "id": "gy9gmsl",
                            "parent_id": "t1_gy9fbrk",
                            "score": 47,
                            "created_utc": 1621117747.0,
                            "replies": [
                                {
                                    "body": "Thx Prof",
                                    "author": null,
                                    "id": "gy9j2lg",
                                    "parent_id": "t1_gy9gmsl",
                                    "score": 7,
                                    "created_utc": 1621119049.0,
                                    "replies": []
                                },
                                {
                                    "body": "I am not talking about vanilla dating, but woman on SA who are quick to hook up. Are more likely be desperate,drug addicts or have issues.  SB who are more reserved and concerned with their safety,are more likely to avoid having sex on the 1st date.",
                                    "author": "CspanSF",
                                    "id": "gy9rr5m",
                                    "parent_id": "t1_gy9gmsl",
                                    "score": -11,
                                    "created_utc": 1621123754.0,
                                    "replies": [
                                        {
                                            "body": "TIL I was a desperate, drug addict, and possibly had issues.",
                                            "author": "Illustrious_Ride_",
                                            "id": "gyce9xy",
                                            "parent_id": "t1_gy9rr5m",
                                            "score": 5,
                                            "created_utc": 1621185451.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "It’s really ok. It’s ok to have booty calls if you like it. It’s ok to date without sugar. It’s ok not to have formal arrangements.\n\nHonestly the vast majority of my relationships have been informal but reading SLF has taught me that there are many people who aren’t honest and use the promise of sugar for deceit. \n\nIn all cases people should do what they agree to whatever that is. If you enter into a formal arrangement then stick to it. If you enter into a relationship then be genuine about it.",
            "author": "daddoms",
            "id": "gy947a0",
            "parent_id": "t3_nd7aa1",
            "score": 27,
            "created_utc": 1621111239.0,
            "replies": [
                {
                    "body": "Haha sure, nothing wrong with a bootycall! However, that was not what I was looking for and for some reason expected to be compensated and enter an arrangement immediately after intimacy.",
                    "author": "Illustrious_Ride_",
                    "id": "gy99qmi",
                    "parent_id": "t1_gy947a0",
                    "score": 8,
                    "created_utc": 1621114087.0,
                    "replies": [
                        {
                            "body": "I get it. Whether arrangement or another type of relationship I’ve learned, and I am hearing from you that you’ve learned, that if the relationship starts with sex at the first meeting then it’s much more likely to be an ONS.",
                            "author": "daddoms",
                            "id": "gy9bkj5",
                            "parent_id": "t1_gy99qmi",
                            "score": 4,
                            "created_utc": 1621115041.0,
                            "replies": [
                                {
                                    "body": "Yeah was my first ONS so I can totally understand they don’t really owe me anything just because I slept with them. I definitely take blame for how it all played out due to my lack of communication on expectations.",
                                    "author": "Illustrious_Ride_",
                                    "id": "gy9kpp9",
                                    "parent_id": "t1_gy9bkj5",
                                    "score": 1,
                                    "created_utc": 1621119931.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": ">I’ll go first, I used to have intimacy on the first date and, therefore, was nothing more than a booty call for these guys. Also, occasionally gave out my real number and one time had a M&G at MY APARTMENT. \n\n\nI assume that you're an adult and capable of making adult decisions. These unspoken rules that you speak of are just general guidelines or suggestions based on best practices. Not a single person here adheres to all of them and have made judgment calls based on their trust and gut instinct. Some of them turn out to be the wrong calls but most turn out to be fine or better. I've had successful arrangements after being intimate on the first date. I hope that nothing bad happened or if it did, you learned your lesson....but no reason to downvote anyone for being an adult and making adult decisions.",
            "author": "non_giant_panda",
            "id": "gy92jca",
            "parent_id": "t3_nd7aa1",
            "score": 41,
            "created_utc": 1621110383.0,
            "replies": [
                {
                    "body": "I agree. Not necessarily looking for sympathy and fortunately I never found myself in a situation where I was at all in danger. I just thought I would poke fun at my less than perfect decisions and hopefully new SBs on here can get some insight from our mistakes.",
                    "author": "Illustrious_Ride_",
                    "id": "gy93z7d",
                    "parent_id": "t1_gy92jca",
                    "score": 19,
                    "created_utc": 1621111122.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Unrelated to the sugar bowl in just a vanilla stance I gave myself away really easily from 16-17. Not a huge time span but I didn’t love myself at all. I kind of took that knowledge with me as well as knowledge from being a cam girl into the bowl to avoid scams and being treated shittily. I can relate to this",
            "author": "babyforestfawn",
            "id": "gy9cbgm",
            "parent_id": "t3_nd7aa1",
            "score": 12,
            "created_utc": 1621115431.0,
            "replies": [
                {
                    "body": "I’ve learned so much about myself while being in the sugar bowl and interacting with men all over the spectrum. I’m so curious to see what a powerhouse of a woman I’ve become when I re-enter vanilla dating. Either that or I end up losing touch with that realm and call the guy daddy on the first date 🥲",
                    "author": "Illustrious_Ride_",
                    "id": "gy9cr1k",
                    "parent_id": "t1_gy9cbgm",
                    "score": 16,
                    "created_utc": 1621115659.0,
                    "replies": [
                        {
                            "body": "No yeah I relate to the powerhouse part vanilla men think I’m a bitch because I get mad for the right reasons (all you’re doing is using me to try to get sex no actual interest in me as a person)",
                            "author": "babyforestfawn",
                            "id": "gy9dqg5",
                            "parent_id": "t1_gy9cr1k",
                            "score": 4,
                            "created_utc": 1621116185.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "We met through a strip club and then drove to El Paso together (I won't tell you where I am but that's WELL across state lines for me) and went to strip clubs and gay bars together (long story on the gay bars lol) but our setup was just dates/strip teases/lapdances and no sex despite sharing a hotel room.  \n\n\nIt went fine for me but omg if I'd been unlucky I'd be dead right now.",
            "author": "ColdHeaux",
            "id": "gy9dmtj",
            "parent_id": "t3_nd7aa1",
            "score": 12,
            "created_utc": 1621116131.0,
            "replies": [
                {
                    "body": "Sounds like a spontaneous story that no one would believe!",
                    "author": "Illustrious_Ride_",
                    "id": "gy9dzjr",
                    "parent_id": "t1_gy9dmtj",
                    "score": 9,
                    "created_utc": 1621116319.0,
                    "replies": [
                        {
                            "body": "Lol I wish I had more opportunities to tell my fun stripper stories, but I don't share them with my friends because then they think I'm stacked and will foot the bill for everything lol. I only share them online- maybe someday I'll write a book. Nobody but other strippers will probably believe me though lol.",
                            "author": "ColdHeaux",
                            "id": "gye4c6w",
                            "parent_id": "t1_gy9dzjr",
                            "score": 1,
                            "created_utc": 1621214709.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I (thank god) had my first POT ever tell me about fake numbers… he was a dick otherwise and too possessive for me but that was an incredible piece of advice that has been invaluable over the years. \n\nThe dumbest thing I ever did was think someone I didn’t know would set up a bank account with an allowance card straight from the get. 🙈 We had a great time but I was a little weirded out when he showed me bedroom pics of other people he’d slept with and asked to take mine (to which I said absolutely not). Then as soon as his ‘mom went into the hospital’ after our third date (without any allowance follow through) and I never saw him again… I knew I had been a complete noob.",
            "author": "AndiAngelWW",
            "id": "gy9ljne",
            "parent_id": "t3_nd7aa1",
            "score": 11,
            "created_utc": 1621120390.0,
            "replies": [
                {
                    "body": "Ugh that makes me so mad. Scamming a rich guy for money is one thing, scamming an SB into intimacy when they seek financial help is just plain mean. Sorry that happened to you!",
                    "author": "Illustrious_Ride_",
                    "id": "gy9lxi2",
                    "parent_id": "t1_gy9ljne",
                    "score": 10,
                    "created_utc": 1621120604.0,
                    "replies": [
                        {
                            "body": "Agreed! Like, if you just want free sex, there are lots of places … but manipulating a very specific type of relationship to be something it’s not.. why?!?! But none the less, learned my lesson. Never again. Its been great since",
                            "author": "AndiAngelWW",
                            "id": "gy9mbyk",
                            "parent_id": "t1_gy9lxi2",
                            "score": 6,
                            "created_utc": 1621120820.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Rinsed, strung along, and rinsed some more. Made someone’s life materially better only to watch them put real work into screwing it up again. Finally learned that as wonderful as it can be when it’s good, it usually isn’t. Truer words were never spoken than that old Russian saying, “Trust, but verify.”",
            "author": "LaGriffeDuLion",
            "id": "gy9r3ap",
            "parent_id": "t3_nd7aa1",
            "score": 9,
            "created_utc": 1621123393.0,
            "replies": [
                {
                    "body": "Sorry to hear that! Some people truly don’t deserve the luxury of being in the sugar bowl. Making it difficult for the rest of us.",
                    "author": "Illustrious_Ride_",
                    "id": "gy9rk48",
                    "parent_id": "t1_gy9r3ap",
                    "score": 2,
                    "created_utc": 1621123647.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "New to being an SD.  Dating this SB - for about 3 weeks - asked if I could get her a MacBook for schoolwork. We plan a night in the city: dinner, hotel, Apple store.  Dinner she is being a bit weird, Apple store she is happy, hotel we crawl into bed and she says that she doesn’t like my body odor (in general - not that particular day) so she doesn’t want to fuck. And she decided she’s getting back together with her boyfriend.  In my head I’m wondering if she still wants the MacBook.  I realize I’ll have to go along with whatever - who knows how fucking crazy she is.  I mean…we just spent the last 4 hours together.  Maybe if I try to keep it she will try to call the police or some weird shit.  So I drop her off at home: “ok. Good luck with your boyfriend”.  She takes the MacBook.  Of course.  3 weeks later the texts begging me to go out with her again.  Uhhhh.  No.  Hard pass",
            "author": null,
            "id": "gyavjhn",
            "parent_id": "t3_nd7aa1",
            "score": 9,
            "created_utc": 1621150106.0,
            "replies": [
                {
                    "body": "Ugh noooo she’s the worst. To be frank, if I were you, I think I would have gone along with buying her a MacBook just to get rid of her, too. Bad vibes all around, I get scared pissing off the wrong people out of fear of how they would retaliate.",
                    "author": "Illustrious_Ride_",
                    "id": "gyaxm0j",
                    "parent_id": "t1_gyavjhn",
                    "score": 4,
                    "created_utc": 1621152020.0,
                    "replies": []
                },
                {
                    "body": "Good choice..",
                    "author": "your_right11",
                    "id": "gyfgvxx",
                    "parent_id": "t1_gyavjhn",
                    "score": 1,
                    "created_utc": 1621247177.0,
                    "replies": []
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "hih3fdd",
                    "parent_id": "t1_gyavjhn",
                    "score": 1,
                    "created_utc": 1635481575.0,
                    "replies": [
                        {
                            "body": "Not exactly.  We’d been seeing each other for about 6 weeks and it seemed normal until that night",
                            "author": null,
                            "id": "hii7e50",
                            "parent_id": "t1_hih3fdd",
                            "score": 1,
                            "created_utc": 1635511211.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "“Down vote me into oblivion” girl you sent me into a spiral of unstoppable laughter! And NO you do not deserve it and sorry that happened to you. Just be really careful and always put yourself first above other, that’s what I’m starting to do and I’m even nexxxxt-ing a lot",
            "author": "LovingAlwaysbaby",
            "id": "gy99u8l",
            "parent_id": "t3_nd7aa1",
            "score": 16,
            "created_utc": 1621114139.0,
            "replies": [
                {
                    "body": "Hahaha I just know what I stated is super frowned upon here. I eventually held out for my unicorn and couldn’t be happier!",
                    "author": "Illustrious_Ride_",
                    "id": "gy9a77h",
                    "parent_id": "t1_gy99u8l",
                    "score": 6,
                    "created_utc": 1621114326.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "You deserve an upvote for your honesty. Obvie you learned from your experience.",
            "author": "Darkside0127",
            "id": "gy9cgcn",
            "parent_id": "t3_nd7aa1",
            "score": 8,
            "created_utc": 1621115502.0,
            "replies": [
                {
                    "body": "Of course! Ya live and ya learn.",
                    "author": "Illustrious_Ride_",
                    "id": "gy9cw27",
                    "parent_id": "t1_gy9cgcn",
                    "score": 3,
                    "created_utc": 1621115733.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I got rinsed for about 5k by some crazy SB last year when the virus was getting started. Never again...lol.",
            "author": "Tough-Raisin1514",
            "id": "gy9ddzp",
            "parent_id": "t3_nd7aa1",
            "score": 8,
            "created_utc": 1621115998.0,
            "replies": [
                {
                    "body": "Oh man. I applaud your generosity. She missed out!",
                    "author": "Illustrious_Ride_",
                    "id": "gy9dv8z",
                    "parent_id": "t1_gy9ddzp",
                    "score": 8,
                    "created_utc": 1621116256.0,
                    "replies": []
                },
                {
                    "body": "We're dying to know what happened...",
                    "author": "Muted_Bird_3890",
                    "id": "gya420r",
                    "parent_id": "t1_gy9ddzp",
                    "score": 4,
                    "created_utc": 1621130748.0,
                    "replies": []
                },
                {
                    "body": "How? What’s the story?",
                    "author": "MJRed1",
                    "id": "gy9peu5",
                    "parent_id": "t1_gy9ddzp",
                    "score": 3,
                    "created_utc": 1621122497.0,
                    "replies": [
                        {
                            "body": "It was last year right when the virus stuff was getting started. It was a crazy time and she was just in a state of almost constant chaos. I tried to help by buying different things for her and then foolishly gave her $2500 for a new apartment. She kept the money and moved in with some guy. A \"friend\"...lol. she got me good...😆😅 live and learn.",
                            "author": "Tough-Raisin1514",
                            "id": "gyb7srm",
                            "parent_id": "t1_gy9peu5",
                            "score": 7,
                            "created_utc": 1621161353.0,
                            "replies": [
                                {
                                    "body": "Awe,.. I’m sorry.",
                                    "author": "MJRed1",
                                    "id": "gz7poq7",
                                    "parent_id": "t1_gyb7srm",
                                    "score": 1,
                                    "created_utc": 1621811007.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Sometimes you gotta kiss a few frogs....",
            "author": "OldschoolSD",
            "id": "gy9e2hr",
            "parent_id": "t3_nd7aa1",
            "score": 8,
            "created_utc": 1621116361.0,
            "replies": [
                {
                    "body": "A few frogs?? More...",
                    "author": "your_right11",
                    "id": "gyfgyr9",
                    "parent_id": "t1_gy9e2hr",
                    "score": 1,
                    "created_utc": 1621247241.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Fell in love.",
            "author": "theend1sn1gh",
            "id": "gybmoso",
            "parent_id": "t3_nd7aa1",
            "score": 6,
            "created_utc": 1621171997.0,
            "replies": []
        },
        {
            "body": "I had my M+G with my SD at my house.....😅",
            "author": "Dry-Sherbert-7424",
            "id": "gy9ponj",
            "parent_id": "t3_nd7aa1",
            "score": 5,
            "created_utc": 1621122641.0,
            "replies": [
                {
                    "body": "Haha hey I guess we’re too trusting of people in this lawless world of sugaring. Glad it worked out!",
                    "author": "Illustrious_Ride_",
                    "id": "gy9pxt8",
                    "parent_id": "t1_gy9ponj",
                    "score": 2,
                    "created_utc": 1621122775.0,
                    "replies": [
                        {
                            "body": "Yes, and after reading a bunch of horror stories here, its a good thing too!!😂",
                            "author": "Dry-Sherbert-7424",
                            "id": "gy9rdlz",
                            "parent_id": "t1_gy9pxt8",
                            "score": 5,
                            "created_utc": 1621123549.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Reading through all of these and feeling lucky...I haven’t found my SD yet (fingers crossed he’s out there!) but I’ve managed to avoid most of the safety mishaps so far",
            "author": "ozmafox",
            "id": "gy9q04x",
            "parent_id": "t3_nd7aa1",
            "score": 5,
            "created_utc": 1621122809.0,
            "replies": [
                {
                    "body": "When in doubt, follow your gut! My biggest mistake was separating sugar dating from vanilla. If you don’t feel comfortable with the interaction you’re having with someone on seeking as you would on tinder, follow your intuition and never compromise your safety/identity until you feel established. This subreddit is fantastic for people new to bowl, let our mistakes be a lesson you’ll never have to learn.",
                    "author": "Illustrious_Ride_",
                    "id": "gy9qnn0",
                    "parent_id": "t1_gy9q04x",
                    "score": 7,
                    "created_utc": 1621123158.0,
                    "replies": [
                        {
                            "body": "Thanks for the words of encouragement :)",
                            "author": "ozmafox",
                            "id": "gy9qzoh",
                            "parent_id": "t1_gy9qnn0",
                            "score": 2,
                            "created_utc": 1621123340.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I went to meet a man from another town by train (we're talking Scandinavian fares here), he paid for a coffee, and we went for a stroll.\n\nI did not get anything, and I was inexperienced enough not to ask.\nIt taught me a lesson to set boundaries and not to be ashamed to ask.\n\nSo I've passed another POT that wanted to take me skiing, and just get it covered without paying for necessary equipment or PPM/allowance \nWhich I found out because I've spoken up.\n\nI'm looking forward to finding the right SD, though...",
            "author": "WaynePrima",
            "id": "gyb35lg",
            "parent_id": "t3_nd7aa1",
            "score": 5,
            "created_utc": 1621157149.0,
            "replies": []
        },
        {
            "body": "When i started as an SD i knew nothing and i grossly overpaid. For some reason, i completely ignored the concepts of supply/demand and purchasing power parity in the bowl.\n\nI was paying a US PPM in south america, which would roughly be like 3x the money.",
            "author": "Possible_Block9598",
            "id": "gya3rn6",
            "parent_id": "t3_nd7aa1",
            "score": 3,
            "created_utc": 1621130585.0,
            "replies": [
                {
                    "body": "I’m sure you made a big difference in the girls life if that’s any consolation!!",
                    "author": "Illustrious_Ride_",
                    "id": "gya4omi",
                    "parent_id": "t1_gya3rn6",
                    "score": 7,
                    "created_utc": 1621131105.0,
                    "replies": [
                        {
                            "body": "Actually no, and that's a second lesson i got from the bowl. Paying a lot doesn't get you a better SR, it gets you a fake one because the cash is too good to walk away from.\n\nI prefer a more genuine SR when i get called out on the (few) times i might behave like an asshole. And you get those by paying roughly average.",
                            "author": "Possible_Block9598",
                            "id": "gya5f24",
                            "parent_id": "t1_gya4omi",
                            "score": 5,
                            "created_utc": 1621131539.0,
                            "replies": [
                                {
                                    "body": "Haha fair enough. Definitely a one side SR in your case and I’m sorry that happened.",
                                    "author": "Illustrious_Ride_",
                                    "id": "gya634j",
                                    "parent_id": "t1_gya5f24",
                                    "score": 2,
                                    "created_utc": 1621131936.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I still use my real number (not immediately), occasionally catch feelings, meet at my place (not for M&G’s). I have learnt though: \n* No M&Gs at my place. \n* Cash in hand only. \n* No real names.\n* Kik before number.\n* Be wary of escort styled SBs.\n\nI’ve had two really bad experiences one with an actually diagnosed NPD probable psychopath, which included the police. The other with a drugged out single mother with recent head trauma in which she was raped by another SD and then confused him with me as he had the presence of mind to delete his contact from her phone. I helped her get the treatment she needed and never saw her again.",
            "author": "DeepDishDick",
            "id": "gyamv2c",
            "parent_id": "t3_nd7aa1",
            "score": 4,
            "created_utc": 1621142807.0,
            "replies": [
                {
                    "body": "Oh my word, you’re an absolute saint. Helping her out despite the trouble she put you through takes a level of compassion I would not expect from most guys in the bowl. Good for you and great advice for navigating this beautiful chaotic world!",
                    "author": "Illustrious_Ride_",
                    "id": "gyax93n",
                    "parent_id": "t1_gyamv2c",
                    "score": 3,
                    "created_utc": 1621151685.0,
                    "replies": [
                        {
                            "body": "Appreciate it, sadly it doesn’t seem to benefit being a genuine person in the bowl. People are either suspect or seek to take advantage.",
                            "author": "DeepDishDick",
                            "id": "gzv6kmf",
                            "parent_id": "t1_gyax93n",
                            "score": 1,
                            "created_utc": 1622291889.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "gybjlgy",
                    "parent_id": "t1_gyamv2c",
                    "score": 1,
                    "created_utc": 1621170166.0,
                    "replies": [
                        {
                            "body": "There’s a certain type of SB that aren’t looking for a connection of any kind except a paycheck.",
                            "author": "DeepDishDick",
                            "id": "gybl6st",
                            "parent_id": "t1_gybjlgy",
                            "score": 1,
                            "created_utc": 1621171130.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gyentv5",
            "parent_id": "t3_nd7aa1",
            "score": 4,
            "created_utc": 1621224339.0,
            "replies": [
                {
                    "body": "Wowww, I would do something like this for sure! But what do you do in that situation? Whisper it? 😭😭😭",
                    "author": "tryingtobehappii",
                    "id": "gyvrp8r",
                    "parent_id": "t1_gyentv5",
                    "score": 3,
                    "created_utc": 1621552410.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Been rinsed probably 50 times in various ways.  Some for small amounts some for 4 figures.\n\nHeard every excuse by now.",
            "author": "wb19081908",
            "id": "gyadklv",
            "parent_id": "t3_nd7aa1",
            "score": 3,
            "created_utc": 1621136557.0,
            "replies": []
        },
        {
            "body": "Omg girllll. You are so brave 😂😂😂😂😂\n\nI would never ever ever, doing M&G at mine or give my personal number 😂",
            "author": "Zealousideal_Map8100",
            "id": "gy9anki",
            "parent_id": "t3_nd7aa1",
            "score": 7,
            "created_utc": 1621114559.0,
            "replies": [
                {
                    "body": "Literally can’t think of any other way I could jeopardize my safety worse than that. Thank god he was an absolute sweet heart.",
                    "author": "Illustrious_Ride_",
                    "id": "gy9ba8f",
                    "parent_id": "t1_gy9anki",
                    "score": 3,
                    "created_utc": 1621114890.0,
                    "replies": []
                },
                {
                    "body": "Please what’s M&G?",
                    "author": "MJRed1",
                    "id": "gy9pdl3",
                    "parent_id": "t1_gy9anki",
                    "score": 0,
                    "created_utc": 1621122478.0,
                    "replies": [
                        {
                            "body": "Meet and greet!",
                            "author": "Illustrious_Ride_",
                            "id": "gy9r1wo",
                            "parent_id": "t1_gy9pdl3",
                            "score": 2,
                            "created_utc": 1621123373.0,
                            "replies": []
                        },
                        {
                            "body": "There’s a glossary at the top of the thread x",
                            "author": "Zealousideal_Map8100",
                            "id": "gybdtm6",
                            "parent_id": "t1_gy9pdl3",
                            "score": 1,
                            "created_utc": 1621166249.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I was way too generous on the front end of the arrangement.   Almost always leading to disappointment.  Too much help too soon has the opposite effect you think it would  or should.  I eventually retired my captain-save-a-hoe cape and  my arrangement have been much longer and more meaningful.",
            "author": "LotBuilder",
            "id": "gya7yfz",
            "parent_id": "t3_nd7aa1",
            "score": 4,
            "created_utc": 1621133043.0,
            "replies": [
                {
                    "body": "not captain save a hoe lmfaoo",
                    "author": null,
                    "id": "gyatnew",
                    "parent_id": "t1_gya7yfz",
                    "score": 2,
                    "created_utc": 1621148406.0,
                    "replies": [
                        {
                            "body": "That was me... but the cape had been retired since 2009 😂",
                            "author": "LotBuilder",
                            "id": "gybvi1f",
                            "parent_id": "t1_gyatnew",
                            "score": 2,
                            "created_utc": 1621176694.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I chased a local fitness/car/promotional model on Instagram \n\nIt was very expensive and did not get back reasonable value for the amount or money and time I put in. Since then I have dated a teacher, RN, and flight attendant all of which were much better experiences. \n\nI also learned that an investment quality designer handbag just perpetuates stereotypes and encourages future outlandish requests, live and learn",
            "author": "KnocDown",
            "id": "gyaaj0o",
            "parent_id": "t3_nd7aa1",
            "score": 2,
            "created_utc": 1621134640.0,
            "replies": [
                {
                    "body": "RNs....love RNs....",
                    "author": "Worldly_Forever_9353",
                    "id": "gybadp3",
                    "parent_id": "t1_gyaaj0o",
                    "score": 3,
                    "created_utc": 1621163569.0,
                    "replies": [
                        {
                            "body": "RNs and teachers are where it’s at",
                            "author": "ntxstud007",
                            "id": "gyebgqv",
                            "parent_id": "t1_gybadp3",
                            "score": 1,
                            "created_utc": 1621218286.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gyauqp1",
            "parent_id": "t3_nd7aa1",
            "score": 2,
            "created_utc": 1621149375.0,
            "replies": []
        },
        {
            "body": "Lol I used my real age and name when I first started sugaring. Granted, I was in college and didn’t have much to hide, but still. It could have ended up really creepy obviously. \n\nAlso, not discussing allowance upfront. I wasted sooooo much time on guys looking to just waste my time.",
            "author": "goingfivehole",
            "id": "gydgigo",
            "parent_id": "t3_nd7aa1",
            "score": 2,
            "created_utc": 1621202704.0,
            "replies": []
        },
        {
            "body": "Well, this is more of an 'almost' story, but letting a guy send me an Uber to come to the city without making sure I had a ride home. It was far, 2 hours I think? My car was having problems so it was his suggestion that he send an Uber for our date  We ended up having an intimate date, gave me a ppm, but then didn't want to pay the uber to send me back home?! \n\nThis was around 5pm, an afternoon delight kind of thing and then he went for a meeting, leaving me literally outside in the cold just as it was getting dark. I had to keep calling him begging to cover the ride home. I couldn't have used the ppm to get home even if I wanted to because the app wasn't working, and anyways I needed the money to cover the babysitter, so I was absolutely relying on him. If a taxi is too expensive for you, find a girl who lives down the street please, instead of going after me when you know I am far away and transportation costs extra.\n\nThe silver lining is that he finally did get me the ride and I ended up making friends with the Uber driver, a fellow single mom, and we just bonded the whole ride back, talking about life. I still talk to her (the driver) but not to the SD, obviously. \n\nTl;dr I didn't make sure a SD arranged for my transportation to go home after a date. He left me standing on a dark street in the cold. Finally begrudgingly agreed to send me an Uber home, and I made more of a lasting connection with the driver than the SD.",
            "author": "Mysterious_Fox_8616",
            "id": "gybkjgv",
            "parent_id": "t3_nd7aa1",
            "score": 2,
            "created_utc": 1621170744.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gy9e9rr",
            "parent_id": "t3_nd7aa1",
            "score": 4,
            "created_utc": 1621116470.0,
            "replies": [
                {
                    "body": "Neat.",
                    "author": "Illustrious_Ride_",
                    "id": "gy9lh6g",
                    "parent_id": "t1_gy9e9rr",
                    "score": 3,
                    "created_utc": 1621120353.0,
                    "replies": []
                },
                {
                    "body": "Had a pot SB bring me a single rose 4 years ago. Still seeing her now.",
                    "author": "Appropriate_Law3044",
                    "id": "gycl4mp",
                    "parent_id": "t1_gy9e9rr",
                    "score": 3,
                    "created_utc": 1621188471.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Well, I did do one stupid thing. My first ever M&G I did was inside the car and so like, I could’ve been murdered for all I know, despite being in a public gas station. But like, it wasn’t as bad as your situation.",
            "author": null,
            "id": "gy9fk4m",
            "parent_id": "t3_nd7aa1",
            "score": 2,
            "created_utc": 1621117168.0,
            "replies": []
        },
        {
            "body": "During my first arrangement I might have been a little to mechanical and brash when stating I wanted to start intimacy at the same time as allowance.",
            "author": null,
            "id": "gz83915",
            "parent_id": "t3_nd7aa1",
            "score": 1,
            "created_utc": 1621818524.0,
            "replies": []
        },
        {
            "body": "Hey, good for you. Taking initiative despite lack of communication. I feel like I put myself in a similar situation as her and assumed the guy knew what to do. I found talking about money super uncomfortable and figured we all knew why we were here.",
            "author": "Illustrious_Ride_",
            "id": "gy99kt5",
            "parent_id": "t1_gy98y87",
            "score": 36,
            "created_utc": 1621114003.0,
            "replies": [
                {
                    "body": "Did it work out for you? Guessing not?",
                    "author": "ChapterRelative",
                    "id": "gy99p3q",
                    "parent_id": "t1_gy99kt5",
                    "score": 6,
                    "created_utc": 1621114065.0,
                    "replies": [
                        {
                            "body": "Eventually, yes. I realize now that the ones who understand the arrangement will discuss the terms before we get ahead of ourselves. First few guys I met were young and had no idea what they were doing as much as I did.",
                            "author": "Illustrious_Ride_",
                            "id": "gy9a0cq",
                            "parent_id": "t1_gy99p3q",
                            "score": 14,
                            "created_utc": 1621114228.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": ">I feel like I put myself in a similar situation as her and assumed the guy knew what to do. I found talking about money super uncomfortable and figured we all knew why we were here.\n\nThis. I was so uncomfortable talking about money my first time around.",
                    "author": "softspoken1990",
                    "id": "gy9buza",
                    "parent_id": "t1_gy99kt5",
                    "score": 5,
                    "created_utc": 1621115191.0,
                    "replies": [
                        {
                            "body": "Ugh, right. It’s like I don’t want to ask for money but at this point if an allowance isn’t his ideal type of arrangement I just go on to the next one. No point in pushing my agenda on someone if we’re not on the same page.",
                            "author": "Illustrious_Ride_",
                            "id": "gy9cc2z",
                            "parent_id": "t1_gy9buza",
                            "score": 9,
                            "created_utc": 1621115440.0,
                            "replies": [
                                {
                                    "body": "Yes, agreed!!",
                                    "author": "softspoken1990",
                                    "id": "gy9q7uc",
                                    "parent_id": "t1_gy9cc2z",
                                    "score": 2,
                                    "created_utc": 1621122921.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Haha thank you. I’ve definitely come a long way.",
            "author": "Illustrious_Ride_",
            "id": "gy922u7",
            "parent_id": "t1_gy91eah",
            "score": 13,
            "created_utc": 1621110149.0,
            "replies": []
        },
        {
            "body": "Hope it all worked out in the end!",
            "author": "Illustrious_Ride_",
            "id": "gy9i4hm",
            "parent_id": "t1_gy9fj3u",
            "score": 3,
            "created_utc": 1621118546.0,
            "replies": []
        },
        {
            "body": "I’m sorry to hear that about your friend and even happier you had such great judgement at such a young age! That’s absolutely terrifying and really puts things to into perspective. It really is all fun and games until somebody gets hurt. Thank you for sharing your story, I’m sure it will be a wake up call for a lot of us on here ❣️",
            "author": "Illustrious_Ride_",
            "id": "gya2nqd",
            "parent_id": "t1_gya1men",
            "score": 12,
            "created_utc": 1621129952.0,
            "replies": []
        },
        {
            "body": "Hey, I’m right there with you. I hate being greeted with a wad of cash. My Sd pays me via venmo after I head out. I like getting paid after because if I show up and surprise him with new lingerie I’ll get wayyyyy more than what we agreed. Took a level of trust to get there though and he’s never missed a payment. I feel like guys who want something ongoing are less likely to jib you with ppm.",
            "author": "Illustrious_Ride_",
            "id": "gy9l7gp",
            "parent_id": "t1_gy9kprx",
            "score": 24,
            "created_utc": 1621120201.0,
            "replies": [
                {
                    "body": "Yeah, it feels strange! All of my SDs have all done venmo, too. But wait girl, don’t block your blessings! Show up in the lingerie 🌚",
                    "author": null,
                    "id": "gy9pcgb",
                    "parent_id": "t1_gy9l7gp",
                    "score": 7,
                    "created_utc": 1621122460.0,
                    "replies": []
                },
                {
                    "body": "I wish my SB showed up in new lingerie. I always get it for her and she gets right to it as soon as we meet up. Don't get me wrong I like it but sometimes its nice to slow things down and enjoy it before.",
                    "author": "xWolverine21x",
                    "id": "gyc9nx6",
                    "parent_id": "t1_gy9l7gp",
                    "score": 2,
                    "created_utc": 1621183415.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "No one has ever asked me for the ppm before hand.\n\n Closest was this convo:\nHer: \"before we go any further...\"\nMe: points at an envelope sitting on a table.\nHer: \"I trust you.\"\nAnd off we went :)",
            "author": "ChapterRelative",
            "id": "gya4voa",
            "parent_id": "t1_gy9kprx",
            "score": 12,
            "created_utc": 1621131221.0,
            "replies": [
                {
                    "body": "🙌🏾🙌🏾",
                    "author": null,
                    "id": "gyattng",
                    "parent_id": "t1_gya4voa",
                    "score": 2,
                    "created_utc": 1621148554.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I think ppm after is more common than ppm before. As we found out with covid, people don’t follow guidance.",
            "author": "BishopSD",
            "id": "gy9xdr3",
            "parent_id": "t1_gy9kprx",
            "score": 9,
            "created_utc": 1621126916.0,
            "replies": []
        },
        {
            "body": "I’ve always given it to the girl at the end (for\nPPM dates) because of fear of getting rinsed.  No one has pushed back on that.",
            "author": null,
            "id": "gybb5mp",
            "parent_id": "t1_gy9kprx",
            "score": 4,
            "created_utc": 1621164197.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gybs7yl",
            "parent_id": "t1_gy9kprx",
            "score": 3,
            "created_utc": 1621175038.0,
            "replies": [
                {
                    "body": "💀💀\nIt’s not the worst, but telling SLF the time I stepped in a gutted, filthy subaru with a fucking lunatic is a whooole other story",
                    "author": null,
                    "id": "gycfho7",
                    "parent_id": "t1_gybs7yl",
                    "score": 1,
                    "created_utc": 1621185976.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Damn! What a roller coaster. You must have really liked her!",
            "author": "Illustrious_Ride_",
            "id": "gy991g2",
            "parent_id": "t1_gy940ym",
            "score": 19,
            "created_utc": 1621113728.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "gy9ocb8",
                    "parent_id": "t1_gy991g2",
                    "score": 18,
                    "created_utc": 1621121913.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "gyaavt3",
                            "parent_id": "t1_gy9ocb8",
                            "score": 16,
                            "created_utc": 1621134863.0,
                            "replies": [
                                {
                                    "body": "Noo this is so raw I love it!",
                                    "author": "Illustrious_Ride_",
                                    "id": "gyawxh8",
                                    "parent_id": "t1_gyaavt3",
                                    "score": 5,
                                    "created_utc": 1621151383.0,
                                    "replies": []
                                },
                                {
                                    "body": "I’ve done the same before... had a couple Hundred on cash app that had been sitting there for idk how long and was like screw it let’s see how this plays out... ultimately played out in me losing about a 70 bucks, but was curious",
                                    "author": "ntxstud007",
                                    "id": "gyeafrl",
                                    "parent_id": "t1_gyaavt3",
                                    "score": 1,
                                    "created_utc": 1621217785.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": ">sweet innocent girl acting bad or a bad girl acting innocent\n\nHave a name: manipulative.",
                            "author": "your_right11",
                            "id": "gyfj6rw",
                            "parent_id": "t1_gy9ocb8",
                            "score": 3,
                            "created_utc": 1621248972.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "What’s rinsing? I’ve never heard of that term",
            "author": "kittygirl-818",
            "id": "gy9lp3m",
            "parent_id": "t1_gy940ym",
            "score": 7,
            "created_utc": 1621120476.0,
            "replies": [
                {
                    "body": "When a sink is rinsed out everything is taken out, right? That happened to his wallet.",
                    "author": null,
                    "id": "gy9nqx3",
                    "parent_id": "t1_gy9lp3m",
                    "score": 9,
                    "created_utc": 1621121594.0,
                    "replies": []
                },
                {
                    "body": "Here is a definition that might be useful to you -\n\nIs someone who just uses someone for their money. Once they have taken all they can, they then dump the person like trash.\n\n***\"A rinser is someone who uses charm and emotions disingenuously to gain material possessions. The rinser's hidden agenda is only to receive as many monetary rewards as possible from POTs and SDs, while acting like she truly cares\"..Google***",
                    "author": "2020Traveller",
                    "id": "gydawxl",
                    "parent_id": "t1_gy9lp3m",
                    "score": 1,
                    "created_utc": 1621200098.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Out of curiosity. How much money did you lose in total?",
            "author": "quarantine-23",
            "id": "gybssc1",
            "parent_id": "t1_gy940ym",
            "score": 1,
            "created_utc": 1621175334.0,
            "replies": [
                {
                    "body": "For this part of the story about 5k.  Total for her about 30k all for 4-5 indoor only dates.   Bad part is she's just dumb and makes bad decisions so needed money and not even able to enjoy it.   Like I ended up paying a deposit and first month rent for 3 different apartments.  1 she was scammed, 2 her abusive ex found out where she lived, and 3 isn't ready yet I guess because she's been trying to hit me up for more money.",
                    "author": "UseRound7488",
                    "id": "gyc5ix5",
                    "parent_id": "t1_gybssc1",
                    "score": 2,
                    "created_utc": 1621181512.0,
                    "replies": [
                        {
                            "body": "Could 1 and 2 be her stories?",
                            "author": "Crucial_Lessons",
                            "id": "gyrc0dx",
                            "parent_id": "t1_gyc5ix5",
                            "score": 1,
                            "created_utc": 1621466775.0,
                            "replies": [
                                {
                                    "body": "Sure.  But she needed a place since I was paying for hotels for her to stay.",
                                    "author": "UseRound7488",
                                    "id": "gyrkiom",
                                    "parent_id": "t1_gyrc0dx",
                                    "score": 1,
                                    "created_utc": 1621471099.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "omg yes. rule no 2 is to never get in anyone's car. MG is always at a place full of people. i guess that's hars now coz of covid haha",
            "author": "Muted_Bird_3890",
            "id": "gya4b2j",
            "parent_id": "t1_gy9ru6t",
            "score": 8,
            "created_utc": 1621130888.0,
            "replies": []
        },
        {
            "body": "Omggg I’d be so scared. At least at my house I feel a bit more in control (not that it’s at all any better) but being with a stranger at the wheel would make me so uncomfortable! How was he being weird and did you ever hear from him again?",
            "author": "Illustrious_Ride_",
            "id": "gy9s07q",
            "parent_id": "t1_gy9ru6t",
            "score": 4,
            "created_utc": 1621123891.0,
            "replies": [
                {
                    "body": "If I recall Correctly he was either my 1st ever or 2nd ever meet n greet, like 7 years ago, long before I found SLF... I just think there wasn’t chemistry, and the reality that I was cruising down country roads with an old man who I didnt know at all really Hit me",
                    "author": "urbanhippy123",
                    "id": "gyagcw7",
                    "parent_id": "t1_gy9s07q",
                    "score": 5,
                    "created_utc": 1621138346.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Thanks for the tip - I definitely enjoy driving my car at night while listening some good music,  I have not invites a baby to join me bit never crossed my mind it could feel dangerous for them.",
            "author": "k815",
            "id": "h2gi5xy",
            "parent_id": "t1_gy9ru6t",
            "score": 1,
            "created_utc": 1624216775.0,
            "replies": []
        },
        {
            "body": "Oof! That’s impressive. I wouldn’t even know how to convince someone to send me money before meeting even if I wanted to.",
            "author": "Illustrious_Ride_",
            "id": "gy9cg6h",
            "parent_id": "t1_gy9c1ur",
            "score": 7,
            "created_utc": 1621115499.0,
            "replies": [
                {
                    "body": "I won’t share her secret but it was casual and “helpful”.  I actually appreciate a good hustle",
                    "author": "Alienrite",
                    "id": "gy9co49",
                    "parent_id": "t1_gy9cg6h",
                    "score": 15,
                    "created_utc": 1621115616.0,
                    "replies": [
                        {
                            "body": "I’d like to know..",
                            "author": "MJRed1",
                            "id": "gy9pjh0",
                            "parent_id": "t1_gy9co49",
                            "score": 7,
                            "created_utc": 1621122565.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "So strange the mom came after you like that! Must have been a super uncomfortable conversation. Glad she’s okay, nonetheless.",
            "author": "Illustrious_Ride_",
            "id": "gy99bi3",
            "parent_id": "t1_gy96j52",
            "score": 11,
            "created_utc": 1621113871.0,
            "replies": [
                {
                    "body": "At first I was pretty sus but I think it really was her mom trying to figure out how her daughter ended up OD'ed in the ICU.  I'm glad she came out of it OK too!",
                    "author": null,
                    "id": "gy99m0g",
                    "parent_id": "t1_gy99bi3",
                    "score": 14,
                    "created_utc": 1621114021.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Girls who are willing to have sex on the first meet, usually have issues especially over the age of 22",
            "author": "CspanSF",
            "id": "gy9fbrk",
            "parent_id": "t1_gy96j52",
            "score": -36,
            "created_utc": 1621117042.0,
            "replies": [
                {
                    "body": "No; women (they are \"women\" if over 22, not \"girls\") are free to decide when to have sex with with whom. I do not find your generalization accurate.\n\nAnd furthermore, I'd ask what \"issues\" you mean but I suspect it'd just go further downhill.",
                    "author": null,
                    "id": "gy9gmsl",
                    "parent_id": "t1_gy9fbrk",
                    "score": 47,
                    "created_utc": 1621117747.0,
                    "replies": [
                        {
                            "body": "Thx Prof",
                            "author": null,
                            "id": "gy9j2lg",
                            "parent_id": "t1_gy9gmsl",
                            "score": 7,
                            "created_utc": 1621119049.0,
                            "replies": []
                        },
                        {
                            "body": "I am not talking about vanilla dating, but woman on SA who are quick to hook up. Are more likely be desperate,drug addicts or have issues.  SB who are more reserved and concerned with their safety,are more likely to avoid having sex on the 1st date.",
                            "author": "CspanSF",
                            "id": "gy9rr5m",
                            "parent_id": "t1_gy9gmsl",
                            "score": -11,
                            "created_utc": 1621123754.0,
                            "replies": [
                                {
                                    "body": "TIL I was a desperate, drug addict, and possibly had issues.",
                                    "author": "Illustrious_Ride_",
                                    "id": "gyce9xy",
                                    "parent_id": "t1_gy9rr5m",
                                    "score": 5,
                                    "created_utc": 1621185451.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Haha sure, nothing wrong with a bootycall! However, that was not what I was looking for and for some reason expected to be compensated and enter an arrangement immediately after intimacy.",
            "author": "Illustrious_Ride_",
            "id": "gy99qmi",
            "parent_id": "t1_gy947a0",
            "score": 8,
            "created_utc": 1621114087.0,
            "replies": [
                {
                    "body": "I get it. Whether arrangement or another type of relationship I’ve learned, and I am hearing from you that you’ve learned, that if the relationship starts with sex at the first meeting then it’s much more likely to be an ONS.",
                    "author": "daddoms",
                    "id": "gy9bkj5",
                    "parent_id": "t1_gy99qmi",
                    "score": 4,
                    "created_utc": 1621115041.0,
                    "replies": [
                        {
                            "body": "Yeah was my first ONS so I can totally understand they don’t really owe me anything just because I slept with them. I definitely take blame for how it all played out due to my lack of communication on expectations.",
                            "author": "Illustrious_Ride_",
                            "id": "gy9kpp9",
                            "parent_id": "t1_gy9bkj5",
                            "score": 1,
                            "created_utc": 1621119931.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I agree. Not necessarily looking for sympathy and fortunately I never found myself in a situation where I was at all in danger. I just thought I would poke fun at my less than perfect decisions and hopefully new SBs on here can get some insight from our mistakes.",
            "author": "Illustrious_Ride_",
            "id": "gy93z7d",
            "parent_id": "t1_gy92jca",
            "score": 19,
            "created_utc": 1621111122.0,
            "replies": []
        },
        {
            "body": "I’ve learned so much about myself while being in the sugar bowl and interacting with men all over the spectrum. I’m so curious to see what a powerhouse of a woman I’ve become when I re-enter vanilla dating. Either that or I end up losing touch with that realm and call the guy daddy on the first date 🥲",
            "author": "Illustrious_Ride_",
            "id": "gy9cr1k",
            "parent_id": "t1_gy9cbgm",
            "score": 16,
            "created_utc": 1621115659.0,
            "replies": [
                {
                    "body": "No yeah I relate to the powerhouse part vanilla men think I’m a bitch because I get mad for the right reasons (all you’re doing is using me to try to get sex no actual interest in me as a person)",
                    "author": "babyforestfawn",
                    "id": "gy9dqg5",
                    "parent_id": "t1_gy9cr1k",
                    "score": 4,
                    "created_utc": 1621116185.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Sounds like a spontaneous story that no one would believe!",
            "author": "Illustrious_Ride_",
            "id": "gy9dzjr",
            "parent_id": "t1_gy9dmtj",
            "score": 9,
            "created_utc": 1621116319.0,
            "replies": [
                {
                    "body": "Lol I wish I had more opportunities to tell my fun stripper stories, but I don't share them with my friends because then they think I'm stacked and will foot the bill for everything lol. I only share them online- maybe someday I'll write a book. Nobody but other strippers will probably believe me though lol.",
                    "author": "ColdHeaux",
                    "id": "gye4c6w",
                    "parent_id": "t1_gy9dzjr",
                    "score": 1,
                    "created_utc": 1621214709.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Ugh that makes me so mad. Scamming a rich guy for money is one thing, scamming an SB into intimacy when they seek financial help is just plain mean. Sorry that happened to you!",
            "author": "Illustrious_Ride_",
            "id": "gy9lxi2",
            "parent_id": "t1_gy9ljne",
            "score": 10,
            "created_utc": 1621120604.0,
            "replies": [
                {
                    "body": "Agreed! Like, if you just want free sex, there are lots of places … but manipulating a very specific type of relationship to be something it’s not.. why?!?! But none the less, learned my lesson. Never again. Its been great since",
                    "author": "AndiAngelWW",
                    "id": "gy9mbyk",
                    "parent_id": "t1_gy9lxi2",
                    "score": 6,
                    "created_utc": 1621120820.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Sorry to hear that! Some people truly don’t deserve the luxury of being in the sugar bowl. Making it difficult for the rest of us.",
            "author": "Illustrious_Ride_",
            "id": "gy9rk48",
            "parent_id": "t1_gy9r3ap",
            "score": 2,
            "created_utc": 1621123647.0,
            "replies": []
        },
        {
            "body": "Ugh noooo she’s the worst. To be frank, if I were you, I think I would have gone along with buying her a MacBook just to get rid of her, too. Bad vibes all around, I get scared pissing off the wrong people out of fear of how they would retaliate.",
            "author": "Illustrious_Ride_",
            "id": "gyaxm0j",
            "parent_id": "t1_gyavjhn",
            "score": 4,
            "created_utc": 1621152020.0,
            "replies": []
        },
        {
            "body": "Good choice..",
            "author": "your_right11",
            "id": "gyfgvxx",
            "parent_id": "t1_gyavjhn",
            "score": 1,
            "created_utc": 1621247177.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "hih3fdd",
            "parent_id": "t1_gyavjhn",
            "score": 1,
            "created_utc": 1635481575.0,
            "replies": [
                {
                    "body": "Not exactly.  We’d been seeing each other for about 6 weeks and it seemed normal until that night",
                    "author": null,
                    "id": "hii7e50",
                    "parent_id": "t1_hih3fdd",
                    "score": 1,
                    "created_utc": 1635511211.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Hahaha I just know what I stated is super frowned upon here. I eventually held out for my unicorn and couldn’t be happier!",
            "author": "Illustrious_Ride_",
            "id": "gy9a77h",
            "parent_id": "t1_gy99u8l",
            "score": 6,
            "created_utc": 1621114326.0,
            "replies": []
        },
        {
            "body": "Of course! Ya live and ya learn.",
            "author": "Illustrious_Ride_",
            "id": "gy9cw27",
            "parent_id": "t1_gy9cgcn",
            "score": 3,
            "created_utc": 1621115733.0,
            "replies": []
        },
        {
            "body": "Oh man. I applaud your generosity. She missed out!",
            "author": "Illustrious_Ride_",
            "id": "gy9dv8z",
            "parent_id": "t1_gy9ddzp",
            "score": 8,
            "created_utc": 1621116256.0,
            "replies": []
        },
        {
            "body": "We're dying to know what happened...",
            "author": "Muted_Bird_3890",
            "id": "gya420r",
            "parent_id": "t1_gy9ddzp",
            "score": 4,
            "created_utc": 1621130748.0,
            "replies": []
        },
        {
            "body": "How? What’s the story?",
            "author": "MJRed1",
            "id": "gy9peu5",
            "parent_id": "t1_gy9ddzp",
            "score": 3,
            "created_utc": 1621122497.0,
            "replies": [
                {
                    "body": "It was last year right when the virus stuff was getting started. It was a crazy time and she was just in a state of almost constant chaos. I tried to help by buying different things for her and then foolishly gave her $2500 for a new apartment. She kept the money and moved in with some guy. A \"friend\"...lol. she got me good...😆😅 live and learn.",
                    "author": "Tough-Raisin1514",
                    "id": "gyb7srm",
                    "parent_id": "t1_gy9peu5",
                    "score": 7,
                    "created_utc": 1621161353.0,
                    "replies": [
                        {
                            "body": "Awe,.. I’m sorry.",
                            "author": "MJRed1",
                            "id": "gz7poq7",
                            "parent_id": "t1_gyb7srm",
                            "score": 1,
                            "created_utc": 1621811007.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "A few frogs?? More...",
            "author": "your_right11",
            "id": "gyfgyr9",
            "parent_id": "t1_gy9e2hr",
            "score": 1,
            "created_utc": 1621247241.0,
            "replies": []
        },
        {
            "body": "Haha hey I guess we’re too trusting of people in this lawless world of sugaring. Glad it worked out!",
            "author": "Illustrious_Ride_",
            "id": "gy9pxt8",
            "parent_id": "t1_gy9ponj",
            "score": 2,
            "created_utc": 1621122775.0,
            "replies": [
                {
                    "body": "Yes, and after reading a bunch of horror stories here, its a good thing too!!😂",
                    "author": "Dry-Sherbert-7424",
                    "id": "gy9rdlz",
                    "parent_id": "t1_gy9pxt8",
                    "score": 5,
                    "created_utc": 1621123549.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "When in doubt, follow your gut! My biggest mistake was separating sugar dating from vanilla. If you don’t feel comfortable with the interaction you’re having with someone on seeking as you would on tinder, follow your intuition and never compromise your safety/identity until you feel established. This subreddit is fantastic for people new to bowl, let our mistakes be a lesson you’ll never have to learn.",
            "author": "Illustrious_Ride_",
            "id": "gy9qnn0",
            "parent_id": "t1_gy9q04x",
            "score": 7,
            "created_utc": 1621123158.0,
            "replies": [
                {
                    "body": "Thanks for the words of encouragement :)",
                    "author": "ozmafox",
                    "id": "gy9qzoh",
                    "parent_id": "t1_gy9qnn0",
                    "score": 2,
                    "created_utc": 1621123340.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I’m sure you made a big difference in the girls life if that’s any consolation!!",
            "author": "Illustrious_Ride_",
            "id": "gya4omi",
            "parent_id": "t1_gya3rn6",
            "score": 7,
            "created_utc": 1621131105.0,
            "replies": [
                {
                    "body": "Actually no, and that's a second lesson i got from the bowl. Paying a lot doesn't get you a better SR, it gets you a fake one because the cash is too good to walk away from.\n\nI prefer a more genuine SR when i get called out on the (few) times i might behave like an asshole. And you get those by paying roughly average.",
                    "author": "Possible_Block9598",
                    "id": "gya5f24",
                    "parent_id": "t1_gya4omi",
                    "score": 5,
                    "created_utc": 1621131539.0,
                    "replies": [
                        {
                            "body": "Haha fair enough. Definitely a one side SR in your case and I’m sorry that happened.",
                            "author": "Illustrious_Ride_",
                            "id": "gya634j",
                            "parent_id": "t1_gya5f24",
                            "score": 2,
                            "created_utc": 1621131936.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Oh my word, you’re an absolute saint. Helping her out despite the trouble she put you through takes a level of compassion I would not expect from most guys in the bowl. Good for you and great advice for navigating this beautiful chaotic world!",
            "author": "Illustrious_Ride_",
            "id": "gyax93n",
            "parent_id": "t1_gyamv2c",
            "score": 3,
            "created_utc": 1621151685.0,
            "replies": [
                {
                    "body": "Appreciate it, sadly it doesn’t seem to benefit being a genuine person in the bowl. People are either suspect or seek to take advantage.",
                    "author": "DeepDishDick",
                    "id": "gzv6kmf",
                    "parent_id": "t1_gyax93n",
                    "score": 1,
                    "created_utc": 1622291889.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gybjlgy",
            "parent_id": "t1_gyamv2c",
            "score": 1,
            "created_utc": 1621170166.0,
            "replies": [
                {
                    "body": "There’s a certain type of SB that aren’t looking for a connection of any kind except a paycheck.",
                    "author": "DeepDishDick",
                    "id": "gybl6st",
                    "parent_id": "t1_gybjlgy",
                    "score": 1,
                    "created_utc": 1621171130.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Wowww, I would do something like this for sure! But what do you do in that situation? Whisper it? 😭😭😭",
            "author": "tryingtobehappii",
            "id": "gyvrp8r",
            "parent_id": "t1_gyentv5",
            "score": 3,
            "created_utc": 1621552410.0,
            "replies": []
        },
        {
            "body": "Literally can’t think of any other way I could jeopardize my safety worse than that. Thank god he was an absolute sweet heart.",
            "author": "Illustrious_Ride_",
            "id": "gy9ba8f",
            "parent_id": "t1_gy9anki",
            "score": 3,
            "created_utc": 1621114890.0,
            "replies": []
        },
        {
            "body": "Please what’s M&G?",
            "author": "MJRed1",
            "id": "gy9pdl3",
            "parent_id": "t1_gy9anki",
            "score": 0,
            "created_utc": 1621122478.0,
            "replies": [
                {
                    "body": "Meet and greet!",
                    "author": "Illustrious_Ride_",
                    "id": "gy9r1wo",
                    "parent_id": "t1_gy9pdl3",
                    "score": 2,
                    "created_utc": 1621123373.0,
                    "replies": []
                },
                {
                    "body": "There’s a glossary at the top of the thread x",
                    "author": "Zealousideal_Map8100",
                    "id": "gybdtm6",
                    "parent_id": "t1_gy9pdl3",
                    "score": 1,
                    "created_utc": 1621166249.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "not captain save a hoe lmfaoo",
            "author": null,
            "id": "gyatnew",
            "parent_id": "t1_gya7yfz",
            "score": 2,
            "created_utc": 1621148406.0,
            "replies": [
                {
                    "body": "That was me... but the cape had been retired since 2009 😂",
                    "author": "LotBuilder",
                    "id": "gybvi1f",
                    "parent_id": "t1_gyatnew",
                    "score": 2,
                    "created_utc": 1621176694.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "RNs....love RNs....",
            "author": "Worldly_Forever_9353",
            "id": "gybadp3",
            "parent_id": "t1_gyaaj0o",
            "score": 3,
            "created_utc": 1621163569.0,
            "replies": [
                {
                    "body": "RNs and teachers are where it’s at",
                    "author": "ntxstud007",
                    "id": "gyebgqv",
                    "parent_id": "t1_gybadp3",
                    "score": 1,
                    "created_utc": 1621218286.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Neat.",
            "author": "Illustrious_Ride_",
            "id": "gy9lh6g",
            "parent_id": "t1_gy9e9rr",
            "score": 3,
            "created_utc": 1621120353.0,
            "replies": []
        },
        {
            "body": "Had a pot SB bring me a single rose 4 years ago. Still seeing her now.",
            "author": "Appropriate_Law3044",
            "id": "gycl4mp",
            "parent_id": "t1_gy9e9rr",
            "score": 3,
            "created_utc": 1621188471.0,
            "replies": []
        },
        {
            "body": "Did it work out for you? Guessing not?",
            "author": "ChapterRelative",
            "id": "gy99p3q",
            "parent_id": "t1_gy99kt5",
            "score": 6,
            "created_utc": 1621114065.0,
            "replies": [
                {
                    "body": "Eventually, yes. I realize now that the ones who understand the arrangement will discuss the terms before we get ahead of ourselves. First few guys I met were young and had no idea what they were doing as much as I did.",
                    "author": "Illustrious_Ride_",
                    "id": "gy9a0cq",
                    "parent_id": "t1_gy99p3q",
                    "score": 14,
                    "created_utc": 1621114228.0,
                    "replies": []
                }
            ]
        },
        {
            "body": ">I feel like I put myself in a similar situation as her and assumed the guy knew what to do. I found talking about money super uncomfortable and figured we all knew why we were here.\n\nThis. I was so uncomfortable talking about money my first time around.",
            "author": "softspoken1990",
            "id": "gy9buza",
            "parent_id": "t1_gy99kt5",
            "score": 5,
            "created_utc": 1621115191.0,
            "replies": [
                {
                    "body": "Ugh, right. It’s like I don’t want to ask for money but at this point if an allowance isn’t his ideal type of arrangement I just go on to the next one. No point in pushing my agenda on someone if we’re not on the same page.",
                    "author": "Illustrious_Ride_",
                    "id": "gy9cc2z",
                    "parent_id": "t1_gy9buza",
                    "score": 9,
                    "created_utc": 1621115440.0,
                    "replies": [
                        {
                            "body": "Yes, agreed!!",
                            "author": "softspoken1990",
                            "id": "gy9q7uc",
                            "parent_id": "t1_gy9cc2z",
                            "score": 2,
                            "created_utc": 1621122921.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yeah, it feels strange! All of my SDs have all done venmo, too. But wait girl, don’t block your blessings! Show up in the lingerie 🌚",
            "author": null,
            "id": "gy9pcgb",
            "parent_id": "t1_gy9l7gp",
            "score": 7,
            "created_utc": 1621122460.0,
            "replies": []
        },
        {
            "body": "I wish my SB showed up in new lingerie. I always get it for her and she gets right to it as soon as we meet up. Don't get me wrong I like it but sometimes its nice to slow things down and enjoy it before.",
            "author": "xWolverine21x",
            "id": "gyc9nx6",
            "parent_id": "t1_gy9l7gp",
            "score": 2,
            "created_utc": 1621183415.0,
            "replies": []
        },
        {
            "body": "🙌🏾🙌🏾",
            "author": null,
            "id": "gyattng",
            "parent_id": "t1_gya4voa",
            "score": 2,
            "created_utc": 1621148554.0,
            "replies": []
        },
        {
            "body": "💀💀\nIt’s not the worst, but telling SLF the time I stepped in a gutted, filthy subaru with a fucking lunatic is a whooole other story",
            "author": null,
            "id": "gycfho7",
            "parent_id": "t1_gybs7yl",
            "score": 1,
            "created_utc": 1621185976.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gy9ocb8",
            "parent_id": "t1_gy991g2",
            "score": 18,
            "created_utc": 1621121913.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "gyaavt3",
                    "parent_id": "t1_gy9ocb8",
                    "score": 16,
                    "created_utc": 1621134863.0,
                    "replies": [
                        {
                            "body": "Noo this is so raw I love it!",
                            "author": "Illustrious_Ride_",
                            "id": "gyawxh8",
                            "parent_id": "t1_gyaavt3",
                            "score": 5,
                            "created_utc": 1621151383.0,
                            "replies": []
                        },
                        {
                            "body": "I’ve done the same before... had a couple Hundred on cash app that had been sitting there for idk how long and was like screw it let’s see how this plays out... ultimately played out in me losing about a 70 bucks, but was curious",
                            "author": "ntxstud007",
                            "id": "gyeafrl",
                            "parent_id": "t1_gyaavt3",
                            "score": 1,
                            "created_utc": 1621217785.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": ">sweet innocent girl acting bad or a bad girl acting innocent\n\nHave a name: manipulative.",
                    "author": "your_right11",
                    "id": "gyfj6rw",
                    "parent_id": "t1_gy9ocb8",
                    "score": 3,
                    "created_utc": 1621248972.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "When a sink is rinsed out everything is taken out, right? That happened to his wallet.",
            "author": null,
            "id": "gy9nqx3",
            "parent_id": "t1_gy9lp3m",
            "score": 9,
            "created_utc": 1621121594.0,
            "replies": []
        },
        {
            "body": "Here is a definition that might be useful to you -\n\nIs someone who just uses someone for their money. Once they have taken all they can, they then dump the person like trash.\n\n***\"A rinser is someone who uses charm and emotions disingenuously to gain material possessions. The rinser's hidden agenda is only to receive as many monetary rewards as possible from POTs and SDs, while acting like she truly cares\"..Google***",
            "author": "2020Traveller",
            "id": "gydawxl",
            "parent_id": "t1_gy9lp3m",
            "score": 1,
            "created_utc": 1621200098.0,
            "replies": []
        },
        {
            "body": "For this part of the story about 5k.  Total for her about 30k all for 4-5 indoor only dates.   Bad part is she's just dumb and makes bad decisions so needed money and not even able to enjoy it.   Like I ended up paying a deposit and first month rent for 3 different apartments.  1 she was scammed, 2 her abusive ex found out where she lived, and 3 isn't ready yet I guess because she's been trying to hit me up for more money.",
            "author": "UseRound7488",
            "id": "gyc5ix5",
            "parent_id": "t1_gybssc1",
            "score": 2,
            "created_utc": 1621181512.0,
            "replies": [
                {
                    "body": "Could 1 and 2 be her stories?",
                    "author": "Crucial_Lessons",
                    "id": "gyrc0dx",
                    "parent_id": "t1_gyc5ix5",
                    "score": 1,
                    "created_utc": 1621466775.0,
                    "replies": [
                        {
                            "body": "Sure.  But she needed a place since I was paying for hotels for her to stay.",
                            "author": "UseRound7488",
                            "id": "gyrkiom",
                            "parent_id": "t1_gyrc0dx",
                            "score": 1,
                            "created_utc": 1621471099.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "If I recall Correctly he was either my 1st ever or 2nd ever meet n greet, like 7 years ago, long before I found SLF... I just think there wasn’t chemistry, and the reality that I was cruising down country roads with an old man who I didnt know at all really Hit me",
            "author": "urbanhippy123",
            "id": "gyagcw7",
            "parent_id": "t1_gy9s07q",
            "score": 5,
            "created_utc": 1621138346.0,
            "replies": []
        },
        {
            "body": "I won’t share her secret but it was casual and “helpful”.  I actually appreciate a good hustle",
            "author": "Alienrite",
            "id": "gy9co49",
            "parent_id": "t1_gy9cg6h",
            "score": 15,
            "created_utc": 1621115616.0,
            "replies": [
                {
                    "body": "I’d like to know..",
                    "author": "MJRed1",
                    "id": "gy9pjh0",
                    "parent_id": "t1_gy9co49",
                    "score": 7,
                    "created_utc": 1621122565.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "At first I was pretty sus but I think it really was her mom trying to figure out how her daughter ended up OD'ed in the ICU.  I'm glad she came out of it OK too!",
            "author": null,
            "id": "gy99m0g",
            "parent_id": "t1_gy99bi3",
            "score": 14,
            "created_utc": 1621114021.0,
            "replies": []
        },
        {
            "body": "No; women (they are \"women\" if over 22, not \"girls\") are free to decide when to have sex with with whom. I do not find your generalization accurate.\n\nAnd furthermore, I'd ask what \"issues\" you mean but I suspect it'd just go further downhill.",
            "author": null,
            "id": "gy9gmsl",
            "parent_id": "t1_gy9fbrk",
            "score": 47,
            "created_utc": 1621117747.0,
            "replies": [
                {
                    "body": "Thx Prof",
                    "author": null,
                    "id": "gy9j2lg",
                    "parent_id": "t1_gy9gmsl",
                    "score": 7,
                    "created_utc": 1621119049.0,
                    "replies": []
                },
                {
                    "body": "I am not talking about vanilla dating, but woman on SA who are quick to hook up. Are more likely be desperate,drug addicts or have issues.  SB who are more reserved and concerned with their safety,are more likely to avoid having sex on the 1st date.",
                    "author": "CspanSF",
                    "id": "gy9rr5m",
                    "parent_id": "t1_gy9gmsl",
                    "score": -11,
                    "created_utc": 1621123754.0,
                    "replies": [
                        {
                            "body": "TIL I was a desperate, drug addict, and possibly had issues.",
                            "author": "Illustrious_Ride_",
                            "id": "gyce9xy",
                            "parent_id": "t1_gy9rr5m",
                            "score": 5,
                            "created_utc": 1621185451.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I get it. Whether arrangement or another type of relationship I’ve learned, and I am hearing from you that you’ve learned, that if the relationship starts with sex at the first meeting then it’s much more likely to be an ONS.",
            "author": "daddoms",
            "id": "gy9bkj5",
            "parent_id": "t1_gy99qmi",
            "score": 4,
            "created_utc": 1621115041.0,
            "replies": [
                {
                    "body": "Yeah was my first ONS so I can totally understand they don’t really owe me anything just because I slept with them. I definitely take blame for how it all played out due to my lack of communication on expectations.",
                    "author": "Illustrious_Ride_",
                    "id": "gy9kpp9",
                    "parent_id": "t1_gy9bkj5",
                    "score": 1,
                    "created_utc": 1621119931.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "No yeah I relate to the powerhouse part vanilla men think I’m a bitch because I get mad for the right reasons (all you’re doing is using me to try to get sex no actual interest in me as a person)",
            "author": "babyforestfawn",
            "id": "gy9dqg5",
            "parent_id": "t1_gy9cr1k",
            "score": 4,
            "created_utc": 1621116185.0,
            "replies": []
        },
        {
            "body": "Lol I wish I had more opportunities to tell my fun stripper stories, but I don't share them with my friends because then they think I'm stacked and will foot the bill for everything lol. I only share them online- maybe someday I'll write a book. Nobody but other strippers will probably believe me though lol.",
            "author": "ColdHeaux",
            "id": "gye4c6w",
            "parent_id": "t1_gy9dzjr",
            "score": 1,
            "created_utc": 1621214709.0,
            "replies": []
        },
        {
            "body": "Agreed! Like, if you just want free sex, there are lots of places … but manipulating a very specific type of relationship to be something it’s not.. why?!?! But none the less, learned my lesson. Never again. Its been great since",
            "author": "AndiAngelWW",
            "id": "gy9mbyk",
            "parent_id": "t1_gy9lxi2",
            "score": 6,
            "created_utc": 1621120820.0,
            "replies": []
        },
        {
            "body": "Not exactly.  We’d been seeing each other for about 6 weeks and it seemed normal until that night",
            "author": null,
            "id": "hii7e50",
            "parent_id": "t1_hih3fdd",
            "score": 1,
            "created_utc": 1635511211.0,
            "replies": []
        },
        {
            "body": "It was last year right when the virus stuff was getting started. It was a crazy time and she was just in a state of almost constant chaos. I tried to help by buying different things for her and then foolishly gave her $2500 for a new apartment. She kept the money and moved in with some guy. A \"friend\"...lol. she got me good...😆😅 live and learn.",
            "author": "Tough-Raisin1514",
            "id": "gyb7srm",
            "parent_id": "t1_gy9peu5",
            "score": 7,
            "created_utc": 1621161353.0,
            "replies": [
                {
                    "body": "Awe,.. I’m sorry.",
                    "author": "MJRed1",
                    "id": "gz7poq7",
                    "parent_id": "t1_gyb7srm",
                    "score": 1,
                    "created_utc": 1621811007.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yes, and after reading a bunch of horror stories here, its a good thing too!!😂",
            "author": "Dry-Sherbert-7424",
            "id": "gy9rdlz",
            "parent_id": "t1_gy9pxt8",
            "score": 5,
            "created_utc": 1621123549.0,
            "replies": []
        },
        {
            "body": "Thanks for the words of encouragement :)",
            "author": "ozmafox",
            "id": "gy9qzoh",
            "parent_id": "t1_gy9qnn0",
            "score": 2,
            "created_utc": 1621123340.0,
            "replies": []
        },
        {
            "body": "Actually no, and that's a second lesson i got from the bowl. Paying a lot doesn't get you a better SR, it gets you a fake one because the cash is too good to walk away from.\n\nI prefer a more genuine SR when i get called out on the (few) times i might behave like an asshole. And you get those by paying roughly average.",
            "author": "Possible_Block9598",
            "id": "gya5f24",
            "parent_id": "t1_gya4omi",
            "score": 5,
            "created_utc": 1621131539.0,
            "replies": [
                {
                    "body": "Haha fair enough. Definitely a one side SR in your case and I’m sorry that happened.",
                    "author": "Illustrious_Ride_",
                    "id": "gya634j",
                    "parent_id": "t1_gya5f24",
                    "score": 2,
                    "created_utc": 1621131936.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Appreciate it, sadly it doesn’t seem to benefit being a genuine person in the bowl. People are either suspect or seek to take advantage.",
            "author": "DeepDishDick",
            "id": "gzv6kmf",
            "parent_id": "t1_gyax93n",
            "score": 1,
            "created_utc": 1622291889.0,
            "replies": []
        },
        {
            "body": "There’s a certain type of SB that aren’t looking for a connection of any kind except a paycheck.",
            "author": "DeepDishDick",
            "id": "gybl6st",
            "parent_id": "t1_gybjlgy",
            "score": 1,
            "created_utc": 1621171130.0,
            "replies": []
        },
        {
            "body": "Meet and greet!",
            "author": "Illustrious_Ride_",
            "id": "gy9r1wo",
            "parent_id": "t1_gy9pdl3",
            "score": 2,
            "created_utc": 1621123373.0,
            "replies": []
        },
        {
            "body": "There’s a glossary at the top of the thread x",
            "author": "Zealousideal_Map8100",
            "id": "gybdtm6",
            "parent_id": "t1_gy9pdl3",
            "score": 1,
            "created_utc": 1621166249.0,
            "replies": []
        },
        {
            "body": "That was me... but the cape had been retired since 2009 😂",
            "author": "LotBuilder",
            "id": "gybvi1f",
            "parent_id": "t1_gyatnew",
            "score": 2,
            "created_utc": 1621176694.0,
            "replies": []
        },
        {
            "body": "RNs and teachers are where it’s at",
            "author": "ntxstud007",
            "id": "gyebgqv",
            "parent_id": "t1_gybadp3",
            "score": 1,
            "created_utc": 1621218286.0,
            "replies": []
        },
        {
            "body": "Eventually, yes. I realize now that the ones who understand the arrangement will discuss the terms before we get ahead of ourselves. First few guys I met were young and had no idea what they were doing as much as I did.",
            "author": "Illustrious_Ride_",
            "id": "gy9a0cq",
            "parent_id": "t1_gy99p3q",
            "score": 14,
            "created_utc": 1621114228.0,
            "replies": []
        },
        {
            "body": "Ugh, right. It’s like I don’t want to ask for money but at this point if an allowance isn’t his ideal type of arrangement I just go on to the next one. No point in pushing my agenda on someone if we’re not on the same page.",
            "author": "Illustrious_Ride_",
            "id": "gy9cc2z",
            "parent_id": "t1_gy9buza",
            "score": 9,
            "created_utc": 1621115440.0,
            "replies": [
                {
                    "body": "Yes, agreed!!",
                    "author": "softspoken1990",
                    "id": "gy9q7uc",
                    "parent_id": "t1_gy9cc2z",
                    "score": 2,
                    "created_utc": 1621122921.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gyaavt3",
            "parent_id": "t1_gy9ocb8",
            "score": 16,
            "created_utc": 1621134863.0,
            "replies": [
                {
                    "body": "Noo this is so raw I love it!",
                    "author": "Illustrious_Ride_",
                    "id": "gyawxh8",
                    "parent_id": "t1_gyaavt3",
                    "score": 5,
                    "created_utc": 1621151383.0,
                    "replies": []
                },
                {
                    "body": "I’ve done the same before... had a couple Hundred on cash app that had been sitting there for idk how long and was like screw it let’s see how this plays out... ultimately played out in me losing about a 70 bucks, but was curious",
                    "author": "ntxstud007",
                    "id": "gyeafrl",
                    "parent_id": "t1_gyaavt3",
                    "score": 1,
                    "created_utc": 1621217785.0,
                    "replies": []
                }
            ]
        },
        {
            "body": ">sweet innocent girl acting bad or a bad girl acting innocent\n\nHave a name: manipulative.",
            "author": "your_right11",
            "id": "gyfj6rw",
            "parent_id": "t1_gy9ocb8",
            "score": 3,
            "created_utc": 1621248972.0,
            "replies": []
        },
        {
            "body": "Could 1 and 2 be her stories?",
            "author": "Crucial_Lessons",
            "id": "gyrc0dx",
            "parent_id": "t1_gyc5ix5",
            "score": 1,
            "created_utc": 1621466775.0,
            "replies": [
                {
                    "body": "Sure.  But she needed a place since I was paying for hotels for her to stay.",
                    "author": "UseRound7488",
                    "id": "gyrkiom",
                    "parent_id": "t1_gyrc0dx",
                    "score": 1,
                    "created_utc": 1621471099.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I’d like to know..",
            "author": "MJRed1",
            "id": "gy9pjh0",
            "parent_id": "t1_gy9co49",
            "score": 7,
            "created_utc": 1621122565.0,
            "replies": []
        },
        {
            "body": "Thx Prof",
            "author": null,
            "id": "gy9j2lg",
            "parent_id": "t1_gy9gmsl",
            "score": 7,
            "created_utc": 1621119049.0,
            "replies": []
        },
        {
            "body": "I am not talking about vanilla dating, but woman on SA who are quick to hook up. Are more likely be desperate,drug addicts or have issues.  SB who are more reserved and concerned with their safety,are more likely to avoid having sex on the 1st date.",
            "author": "CspanSF",
            "id": "gy9rr5m",
            "parent_id": "t1_gy9gmsl",
            "score": -11,
            "created_utc": 1621123754.0,
            "replies": [
                {
                    "body": "TIL I was a desperate, drug addict, and possibly had issues.",
                    "author": "Illustrious_Ride_",
                    "id": "gyce9xy",
                    "parent_id": "t1_gy9rr5m",
                    "score": 5,
                    "created_utc": 1621185451.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yeah was my first ONS so I can totally understand they don’t really owe me anything just because I slept with them. I definitely take blame for how it all played out due to my lack of communication on expectations.",
            "author": "Illustrious_Ride_",
            "id": "gy9kpp9",
            "parent_id": "t1_gy9bkj5",
            "score": 1,
            "created_utc": 1621119931.0,
            "replies": []
        },
        {
            "body": "Awe,.. I’m sorry.",
            "author": "MJRed1",
            "id": "gz7poq7",
            "parent_id": "t1_gyb7srm",
            "score": 1,
            "created_utc": 1621811007.0,
            "replies": []
        },
        {
            "body": "Haha fair enough. Definitely a one side SR in your case and I’m sorry that happened.",
            "author": "Illustrious_Ride_",
            "id": "gya634j",
            "parent_id": "t1_gya5f24",
            "score": 2,
            "created_utc": 1621131936.0,
            "replies": []
        },
        {
            "body": "Yes, agreed!!",
            "author": "softspoken1990",
            "id": "gy9q7uc",
            "parent_id": "t1_gy9cc2z",
            "score": 2,
            "created_utc": 1621122921.0,
            "replies": []
        },
        {
            "body": "Noo this is so raw I love it!",
            "author": "Illustrious_Ride_",
            "id": "gyawxh8",
            "parent_id": "t1_gyaavt3",
            "score": 5,
            "created_utc": 1621151383.0,
            "replies": []
        },
        {
            "body": "I’ve done the same before... had a couple Hundred on cash app that had been sitting there for idk how long and was like screw it let’s see how this plays out... ultimately played out in me losing about a 70 bucks, but was curious",
            "author": "ntxstud007",
            "id": "gyeafrl",
            "parent_id": "t1_gyaavt3",
            "score": 1,
            "created_utc": 1621217785.0,
            "replies": []
        },
        {
            "body": "Sure.  But she needed a place since I was paying for hotels for her to stay.",
            "author": "UseRound7488",
            "id": "gyrkiom",
            "parent_id": "t1_gyrc0dx",
            "score": 1,
            "created_utc": 1621471099.0,
            "replies": []
        },
        {
            "body": "TIL I was a desperate, drug addict, and possibly had issues.",
            "author": "Illustrious_Ride_",
            "id": "gyce9xy",
            "parent_id": "t1_gy9rr5m",
            "score": 5,
            "created_utc": 1621185451.0,
            "replies": []
        }
    ]
}