{
    "title": "in less than a year there will be more eps with sechan + somin than there are with gary",
    "post_id": "x8xl8p",
    "post_url": "https://www.reddit.com/r/runningman/comments/x8xl8p/in_less_than_a_year_there_will_be_more_eps_with/",
    "author": "moonchildeus",
    "body": "shower thoughts… surprised me a little, gary’s stay kinda seemed to be longer.",
    "url": "https://www.reddit.com/r/runningman/comments/x8xl8p/in_less_than_a_year_there_will_be_more_eps_with/",
    "score": 215,
    "upvote_ratio": 0.98,
    "created_utc": 1662635261.0,
    "num_comments": 64,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "Fact : YSC doesn't have theme song",
            "author": "NieR_SemiAutomata",
            "id": "inloxyp",
            "parent_id": "t3_x8xl8p",
            "score": 33,
            "created_utc": 1662652120.0,
            "replies": [
                {
                    "body": "Idk if it’s just me but they seem to have been moving away from theme songs",
                    "author": "kyramaro",
                    "id": "inlwu4k",
                    "parent_id": "t1_inloxyp",
                    "score": 19,
                    "created_utc": 1662655085.0,
                    "replies": [
                        {
                            "body": "Which is sad cause hearing their theme songs was hilarious especially JSM, LKS and JSJ. Like anytime somin did something weird or cute or random, a frog sound followed and then her theme song. It was adorable. I miss hearing them. \n\nI also miss hearing and seeing the childish edits like the exclamation point with that \"oy\" sound or the dark raining cloud and the screenpause.",
                            "author": null,
                            "id": "inoncfy",
                            "parent_id": "t1_inlwu4k",
                            "score": 19,
                            "created_utc": 1662695770.0,
                            "replies": []
                        },
                        {
                            "body": "Also just bland white captions & less special on screen effect eg 🔥🔥🔥",
                            "author": "NieR_SemiAutomata",
                            "id": "inlxp10",
                            "parent_id": "t1_inlwu4k",
                            "score": 13,
                            "created_utc": 1662655409.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Hmm what do you think is his character on the show? He constantly betrays other members but I don’t know if I would consider him to be part of the betrayal line yet. JSJ has taken over from Kwang Soo as the show’s whipping boy so that character is gone as well. Sechan is one of KJK’s henchmen but haha plays that role better so he doesn’t stand out much there. I feel like the somin/sechan love line helped him out and was quite entertaining but aside from that I still feel he doesn’t have a strong character on the show yet.",
                    "author": "Algaewalgae",
                    "id": "inohdgy",
                    "parent_id": "t1_inloxyp",
                    "score": 10,
                    "created_utc": 1662692785.0,
                    "replies": [
                        {
                            "body": "I agree with this. But it's also not his fault. There were 5 strong and established and loved characters already on the show. He tried playing the little brother role but it mostly was annoying. I feel bad for him tbh for not having a strong place. Like in episode 570, where they googled their names and he lost to JSJ... And it turned out JSJ would lose to even bottled water... Not that popularity like this matters, but if he were to leave the show or be replaced not much will change or happen. \n\nI guess time helped him tho. The other dudes are now officially old(er), so ysc now has an advantage in some games. I know the RM dudes can still probably outrun young men, but the advantage is still available for the younger. He even won against KJK in a running match.\n\nEdit: typos",
                            "author": null,
                            "id": "inoo1au",
                            "parent_id": "t1_inohdgy",
                            "score": 8,
                            "created_utc": 1662696139.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "inoxx0t",
                                    "parent_id": "t1_inoo1au",
                                    "score": 6,
                                    "created_utc": 1662702195.0,
                                    "replies": [
                                        {
                                            "body": "OMG watch it. It's one of the best episodes of post-LKS era with many LOL moments throughout.",
                                            "author": null,
                                            "id": "inp4m3o",
                                            "parent_id": "t1_inoxx0t",
                                            "score": 4,
                                            "created_utc": 1662707063.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Something I feel extra bad for him about is how different his and Somin’s success was on the show (good job Somin, but sad for Sechan). She was just so naturally entertaining and that’s not even her day job! She has her acting career as her main occupation, so she has different income to fall back on. Being funny isn’t even her job (but she’s so good at it), but Sechan has nothing except being funny as a full-time job! I really felt bad for him when in that chatting episode he said there hasn’t been a single day he came to work for RM that he wasn’t anxious the night before. He vibes like he HAS to be funny or it’s all over for him. He doesn’t have another main occupation - income-wise, this is it for him. \n\nThe thing I enjoy most about his character is his goofy antics (the noises he makes when pretending to be in pain), his banter his Somin, and his occassional super sharp moments during games when he realizes the bigger picture",
                            "author": "violetkeis",
                            "id": "inpa3b8",
                            "parent_id": "t1_inohdgy",
                            "score": 7,
                            "created_utc": 1662711555.0,
                            "replies": [
                                {
                                    "body": "inb4, So Min has to pay Comedian Association fees",
                                    "author": "alvinvin00",
                                    "id": "intau1c",
                                    "parent_id": "t1_inpa3b8",
                                    "score": 5,
                                    "created_utc": 1662780354.0,
                                    "replies": []
                                },
                                {
                                    "body": "I don't think we need to compare and RM does not represent the entire variety scene. Se Chan has a well-established reputation and a number of shows. He's doing quite well in his main job. So I don't see the need to feel bad for him. SM's acting success in the past two years after her hiatus shouldn't make people forget that even when she was struggling getting acting gigs, Se Chan was steadily working. He is doing quite well in his main job considering all the competition among male entertainers. The CF that JH and SM are doing together was also done previously by SC and SH. SC won the top excellence award last year. Their journeys are different. You can be happy for SM's success without negatively comparing him to SC when he is in fact doing quite well as a comedian and entertainer. I bet his earnings are quite good too.",
                                    "author": "moonriver501",
                                    "id": "inz6fch",
                                    "parent_id": "t1_inpa3b8",
                                    "score": 2,
                                    "created_utc": 1662897796.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "He has a Kkang Kkang screen over which is disturbing enough LOL\n\nto think of it, we have : \n\n* YJS : Step by Step , Jason Bourne\n* JSJ : the house you live in (JYP)\n* SJH : Angry bird\n* KJK : Beowulf, Sparta\n* JSM : frog song\n* HH : (actually he doesn't do the Pororo theme anymore and I can't recall his current theme song )\n* LKS : That damned guitar piece by Sting and Theme of the Fake Emperor \n* Gary : Any leesang songs",
                    "author": "Kuuganism",
                    "id": "io2xgh5",
                    "parent_id": "t1_inloxyp",
                    "score": 2,
                    "created_utc": 1662953764.0,
                    "replies": [
                        {
                            "body": "HaHa - Lutricia McNeal – Perfect Love (When bad boy HaHa appears)\n\nLKS - Sting – Saint Agnes And The Burning Train\n\nYeah it's so iconic, why they don't use theme song anymore, or sound effects",
                            "author": "NieR_SemiAutomata",
                            "id": "io2y9ke",
                            "parent_id": "t1_io2xgh5",
                            "score": 2,
                            "created_utc": 1662954202.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Somin carried the show really well and that's why she has so many more opportunities coming her way in acting/variety",
            "author": "Prince_Ali_Kidnap",
            "id": "inkygv7",
            "parent_id": "t3_x8xl8p",
            "score": 153,
            "created_utc": 1662641072.0,
            "replies": [
                {
                    "body": "I didn't realize how much she carried earlier. Her crazy antics and I'm glad she got awarded for it. But i think Se Chan has finally found his niche and groove with the crew. I've been enjoying them lately",
                    "author": "darkapao",
                    "id": "innmken",
                    "parent_id": "t1_inkygv7",
                    "score": 20,
                    "created_utc": 1662679237.0,
                    "replies": []
                },
                {
                    "body": "Agreed. Somin has been a heavyweight for RM, esp in recent years. She fully deserves the recognition and opportunities she has been getting.",
                    "author": "Disastrous-Coat-4907",
                    "id": "inlc09m",
                    "parent_id": "t1_inkygv7",
                    "score": 74,
                    "created_utc": 1662647072.0,
                    "replies": []
                },
                {
                    "body": "She really did.",
                    "author": "MakarOvni",
                    "id": "inmsbok",
                    "parent_id": "t1_inkygv7",
                    "score": 10,
                    "created_utc": 1662667157.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "And both have contributed more and been on RM longer than both Lizzy and Joongki also. But they're still referred to as 'new' members as if they joined recently. 🤷🏻‍♀️",
            "author": "Mission-Loquat9290",
            "id": "inku3pm",
            "parent_id": "t3_x8xl8p",
            "score": 117,
            "created_utc": 1662638825.0,
            "replies": [
                {
                    "body": "And I still see \"jsm/ysc ou*\" comments",
                    "author": null,
                    "id": "inkuorz",
                    "parent_id": "t1_inku3pm",
                    "score": 31,
                    "created_utc": 1662639143.0,
                    "replies": [
                        {
                            "body": "right it’s the thing i can’t understand. these two saved the show.. and the members who helped them maintain a character. can’t imagine the show without these two.",
                            "author": "moonchildeus",
                            "id": "inkvecs",
                            "parent_id": "t1_inkuorz",
                            "score": 53,
                            "created_utc": 1662639521.0,
                            "replies": [
                                {
                                    "body": "What are their character? Yang Se Chan is alright for me by Jeon So min is too much. She comes off to strong, and childish, and loud, and lame. I don’t think RM should have a character like the one JSM developed. I think she should adjust her character on the show or leave if she cannot.",
                                    "author": "StringImpressive3306",
                                    "id": "inpkjcu",
                                    "parent_id": "t1_inkvecs",
                                    "score": -7,
                                    "created_utc": 1662720033.0,
                                    "replies": [
                                        {
                                            "body": "Or you could leave and never watch again. We would all appreciate it. Hater.\n\nEdit: you clearly don't even watch the show. If you call jsm loud, then you just don't know what you're talking about. Especially since Haha and YSC are on this same show. Imagine being a hater of something you don't even watch",
                                            "author": null,
                                            "id": "inpueqg",
                                            "parent_id": "t1_inpkjcu",
                                            "score": 7,
                                            "created_utc": 1662725914.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "in my opinion that’s the best \"character\" that they could have recruited back then. the outgoing girl who blends well with all the members and also gives guests so much screen time. she saved the show, let’s be real. if you don’t like her that’s fine but why leave such nasty comments online? i’m sure other members would recommend you just stop watching the show than asking her to leave.",
                                            "author": "moonchildeus",
                                            "id": "inrm449",
                                            "parent_id": "t1_inpkjcu",
                                            "score": 5,
                                            "created_utc": 1662752450.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Where?",
                            "author": "LewsThTe",
                            "id": "innbk6b",
                            "parent_id": "t1_inkuorz",
                            "score": -1,
                            "created_utc": 1662674599.0,
                            "replies": [
                                {
                                    "body": "Update; oooh there is one of those comments on this very thread now. It's like they can smell where they are unwanted and show up to get reactions. And reaction I will give cause I don't care and it's fun to mess with these idiots.",
                                    "author": null,
                                    "id": "inpuqku",
                                    "parent_id": "t1_innbk6b",
                                    "score": 4,
                                    "created_utc": 1662726084.0,
                                    "replies": []
                                },
                                {
                                    "body": "YouTube comments, SBS instagram comments and their personal instagram pages especially JSM and especially from SJH and Spartace fans. You wanna see an absolute shetshow, find posts from close to when episode 610 aired where YJS threw jsm into a love line triangle. SBS had to delete a post, but KJK's agency still had the same post up. You can also check those comments out. \n\nMan, people like to pretend it's over because it isn't so loud... But the hate never stopped and never got better. She just has more supporters now so we can at least drown some of the bs out. \n\nEdit You can also find shetty comments on Reddit and some of the free streaming websites around like.",
                                    "author": null,
                                    "id": "inojnbu",
                                    "parent_id": "t1_innbk6b",
                                    "score": 5,
                                    "created_utc": 1662693883.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Gary’s era was like the golden era of RM. It was probably one of the most famous variety show in the world at that time. One of the main contributor to spread the Hallyu wave. The concept of the games were fresh, and people loved it. That’s why the old episodes were quite memorable so we feels it’s been longer than it actually is.",
            "author": "Flyer888",
            "id": "inkvdyw",
            "parent_id": "t3_x8xl8p",
            "score": 120,
            "created_utc": 1662639515.0,
            "replies": [
                {
                    "body": "I agree with this. Not that Somin and Sechan haven't kept the show running in recent years - they play a huge role and I wouldn't go without either of them... but the golden age of RM probably won't ever be surpassed.",
                    "author": "StaringOverACliff",
                    "id": "inm329o",
                    "parent_id": "t1_inkvdyw",
                    "score": 25,
                    "created_utc": 1662657414.0,
                    "replies": []
                },
                {
                    "body": "I just watched the reincarnation ep recently and the strength of the storyline and editing were just top notch. We got so many GOAT episodes from that period.",
                    "author": "swearyirishman",
                    "id": "inlc0c2",
                    "parent_id": "t1_inkvdyw",
                    "score": 31,
                    "created_utc": 1662647073.0,
                    "replies": [
                        {
                            "body": "oh i love that one, can you please tell me what was the ep number?",
                            "author": "moonchildeus",
                            "id": "inlgpv1",
                            "parent_id": "t1_inlc0c2",
                            "score": 4,
                            "created_utc": 1662648955.0,
                            "replies": [
                                {
                                    "body": "130",
                                    "author": "zauchi",
                                    "id": "inlhlte",
                                    "parent_id": "t1_inlgpv1",
                                    "score": 6,
                                    "created_utc": 1662649304.0,
                                    "replies": []
                                },
                                {
                                    "body": "The other commenter replied alrdy but I just wanted to say the episode after that (131) with Chu Sung Hoon the mma fighter guesting is another really good episode. The fight between kjk and him was so intense.",
                                    "author": "swearyirishman",
                                    "id": "inm7gms",
                                    "parent_id": "t1_inlgpv1",
                                    "score": 8,
                                    "created_utc": 1662659020.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "yeah i agree! but somin and sechan had a lot memorable stuff too imho, overseas projects were an incredible idea to help them introduce themselves. to me their era is just as precious as gary’s.\n\nbut for some reason 2017 just doesn’t seem like \"long time ago\" bahaha, or ever 5 years ago. maybe it’s a covid thing that time stopped at the beginning of 2020…",
                    "author": "moonchildeus",
                    "id": "inkvvgs",
                    "parent_id": "t1_inkvdyw",
                    "score": 23,
                    "created_utc": 1662639766.0,
                    "replies": [
                        {
                            "body": "I am still disappointed that they didn’t do name tag ripping abroad. They used to do that during Gary time.",
                            "author": "StringImpressive3306",
                            "id": "inpku3j",
                            "parent_id": "t1_inkvvgs",
                            "score": 0,
                            "created_utc": 1662720235.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Definitely agree.\n\nGary was there when Running Man was in top of the world, nothing can replace that.\n\nAlso I think memorability plays a huge part. Since So Min & Se Chan joined, I don't think I can name 10 Episodes that were iconic, save a few:\n\n- family project\n\n- Tazza\n\n- etc.\n\nBut the golden era had so many iconic episodes that I can name two dozen easily.",
                    "author": "doubleoh72",
                    "id": "inob17x",
                    "parent_id": "t1_inkvdyw",
                    "score": 6,
                    "created_utc": 1662690002.0,
                    "replies": [
                        {
                            "body": "I can name so many iconic episodes since 2017 tho. That doesn't prove anything aside from your bias in what you like and opinion that the show was more memorable, TO YOU. It's very subjective.",
                            "author": null,
                            "id": "inoo6qy",
                            "parent_id": "t1_inob17x",
                            "score": -3,
                            "created_utc": 1662696219.0,
                            "replies": [
                                {
                                    "body": "Hey, chill bro. I'm not saying the show is bad now, I enjoy the show still, and So Min is probably my favourite member right now.\n\nI'm just saying that the themes and concepts in the early days were iconic like: super power, yoomes bond,SNSD, first love, Sherlock Holmes, Gold JiHyo, baseball, park ji sung, reincarnation, Ddakji, grasshopper hunting.... so many.\n\nBut since 2017, they were less frequent like family project, Tazza, fiery stove league.\n\nIt's not that they aren't good, but just prehaps less memorable than the golden days.",
                                    "author": "doubleoh72",
                                    "id": "inoq6ip",
                                    "parent_id": "t1_inoo6qy",
                                    "score": 5,
                                    "created_utc": 1662697349.0,
                                    "replies": [
                                        {
                                            "body": "Oh my tone was off in the first comment I didn't mean to attack. Just wanted to point out being memorable is very subjective and not indicative of anything other than what the person's likes a dislikes are. That's what I meant.",
                                            "author": null,
                                            "id": "inoqvjq",
                                            "parent_id": "t1_inoq6ip",
                                            "score": 2,
                                            "created_utc": 1662697754.0,
                                            "replies": [
                                                {
                                                    "body": "No problem dude. I get where you come from. Too many hardcore 2010-2016 fans still live in the past and refuse to acvept the show for its current state.\n\nThe golden era is gone, and running man will probably never go back to the internationally popular show it was back then.\n\nEven I reminisce it sometimes.\n\nBut i was one of those fans in 2017 that felt So Min & Se Chan were not good additions. I didn't hate them like others, but I didn't accept them till probably 2018.\n\nAnd now So Min is my favourite member, and Se Chan's skits make me laugh the hardest.",
                                                    "author": "doubleoh72",
                                                    "id": "inosmog",
                                                    "parent_id": "t1_inoqvjq",
                                                    "score": 5,
                                                    "created_utc": 1662698805.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "A pandemic runner but if i were to choose an era of runningman it will always be the 7012 era.I just enjoy it more than the episodes after that.I never got tired watching it on replays.Atleast for me,I think its allowed here to voiced out your own opinion right?\n\nGary will still be my top runner,if i were to list them.He got the romance,the laughter and was really good at games even on nametag rippings.Nevertheless,Sechan and Somin was still a good addition to the cast and will always be ♥️♥️♥️",
                    "author": "Witty_Inspection_310",
                    "id": "inol20n",
                    "parent_id": "t1_inkvdyw",
                    "score": 2,
                    "created_utc": 1662694596.0,
                    "replies": []
                },
                {
                    "body": "And random, but the crowds were pretty insane, too. Hella people would show up just to watch and/or take photos/video. It got to the point where in some episodes, I think I recall them walking around with security?",
                    "author": "FallenHarmonics",
                    "id": "innqeg4",
                    "parent_id": "t1_inkvdyw",
                    "score": 1,
                    "created_utc": 1662680958.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "RM's lucky charms <3",
            "author": "peacherparker",
            "id": "inp28fd",
            "parent_id": "t3_x8xl8p",
            "score": 6,
            "created_utc": 1662705282.0,
            "replies": []
        },
        {
            "body": "They got a long ways to go to catch up to Kwang Soo. 😂",
            "author": "bluelephantz_jj",
            "id": "inmx2sl",
            "parent_id": "t3_x8xl8p",
            "score": 9,
            "created_utc": 1662668946.0,
            "replies": [
                {
                    "body": "How old will be Ji Suk Jin then 😅",
                    "author": "AggressiveExercise38",
                    "id": "innd1pu",
                    "parent_id": "t1_inmx2sl",
                    "score": 12,
                    "created_utc": 1662675208.0,
                    "replies": []
                },
                {
                    "body": "hopefully they will!",
                    "author": "moonchildeus",
                    "id": "inmxdpj",
                    "parent_id": "t1_inmx2sl",
                    "score": 5,
                    "created_utc": 1662669060.0,
                    "replies": [
                        {
                            "body": "I can't believe this comment was downvoted. 😒 OP is literally saying he hopes the show goes on longer and y'all are downvoting them?!? Why even come to a running man sub if you hate the show?",
                            "author": null,
                            "id": "inoodwq",
                            "parent_id": "t1_inmxdpj",
                            "score": 3,
                            "created_utc": 1662696328.0,
                            "replies": [
                                {
                                    "body": "exactly what i meant :(",
                                    "author": "moonchildeus",
                                    "id": "inpiw1h",
                                    "parent_id": "t1_inoodwq",
                                    "score": 1,
                                    "created_utc": 1662718845.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Wow! Agree~ Maybe because Somin and Sechan still looks young (to me because they're the maknae line) that's why I feel like Gary has been on the show longer than them 😅 - Somin is still as cute as ever.\n\nAlthough the show indeed was more fun during the earlier years (when Gary was still in the show), I can't watch any episode without Somin and Sechan... I just love these two very much sbsndnjrnrbxu",
            "author": "AggressiveExercise38",
            "id": "inncqp8",
            "parent_id": "t3_x8xl8p",
            "score": 7,
            "created_utc": 1662675080.0,
            "replies": []
        },
        {
            "body": "am i the only who has hardly watched RM pre chanmin? save for maybe the iconic idols opening episode and SNSD. save for a few clips here and there, i thought the chanmin era included more interaction between everyone and the pre chanmin era focused more on the games and of course monday couple.",
            "author": "farmingbeast",
            "id": "inljt27",
            "parent_id": "t3_x8xl8p",
            "score": 11,
            "created_utc": 1662650172.0,
            "replies": [
                {
                    "body": ">the pre chanmin era focused more on the games and of course monday couple.\n\nYes, the focus is on the games, but the cast made it hilarious. That was the time when RM got really popular.",
                    "author": "Zarkuine",
                    "id": "inlnucb",
                    "parent_id": "t1_inljt27",
                    "score": 13,
                    "created_utc": 1662651707.0,
                    "replies": []
                },
                {
                    "body": "You are really missing out then, those episodes were so good. Although it was more game focused, the games and themes were creative, it allowed cast members to genuinely be funny and it just brought out more from the guest. Now the comedy feels more forced and not as genuine because they arent thrown into as many different situations. But if you do watch it, might make the current running man seem a bit boring.",
                    "author": "earlycomer",
                    "id": "inn76h8",
                    "parent_id": "t1_inljt27",
                    "score": 13,
                    "created_utc": 1662672834.0,
                    "replies": [
                        {
                            "body": "I've only went back to watch a few episodes pre-ysc/jsm era where a favorite actor of mine was on the show. The villainess episode was one of the most iconic episodes, but because of the guests. I think most of the episodes that I've seen were only good BECAUSE of the guests. I ofc might be biased cause my favorites were guests but not just them. Idk, the guests just did some hilarious things and the cast worked so well with them. \n\nMost guests today are not like those, but RM needs guests. So I find myself wanting RM without guests because most are boring nowadays, but also knowing guests can and will make it interesting... Just not very young idols who can only do their one choreography over and over and nobody is allowed to make fun of them. \n\nBut I started watching this show because of jsm. I even skipped the few episodes she was absent either during Covid or her hospitalization. So it's very hard to go back to when she wasn't there. As much as I like the rest of the cast, I don't care enough to watch their other appearances. I've watched anything and everything jsm has touched. Lol \n\nMany stopped watching without LKS. It doesn't make us solo stans but we all have our faves without whom the show feels empty.",
                            "author": null,
                            "id": "inop97u",
                            "parent_id": "t1_inn76h8",
                            "score": 3,
                            "created_utc": 1662696821.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "How many eps to be exact good sir?",
            "author": "Sphincterinthenose",
            "id": "inlgd9n",
            "parent_id": "t3_x8xl8p",
            "score": 4,
            "created_utc": 1662648816.0,
            "replies": [
                {
                    "body": "for gary it’s 324 + 2 he briefly guested on\nfor semin 274 + 2 for both they were guests",
                    "author": "moonchildeus",
                    "id": "inlgjso",
                    "parent_id": "t1_inlgd9n",
                    "score": 10,
                    "created_utc": 1662648888.0,
                    "replies": [
                        {
                            "body": "Damn, time flies.",
                            "author": "Sphincterinthenose",
                            "id": "inlgn0d",
                            "parent_id": "t1_inlgjso",
                            "score": 6,
                            "created_utc": 1662648923.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "oh 50 eps left i forgot to write the math",
                    "author": "moonchildeus",
                    "id": "inlgmzh",
                    "parent_id": "t1_inlgd9n",
                    "score": 2,
                    "created_utc": 1662648923.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I didn't watch much pre-ChanMin era really, but people do say it was their golden time. The question would be, was it not replicable? Success was bound to come since it was game centric and accommodating to guests. It was not a while ago when they switch to a more smooth character of being themselves.",
            "author": "francis_intano",
            "id": "ino1ntc",
            "parent_id": "t3_x8xl8p",
            "score": 2,
            "created_utc": 1662685913.0,
            "replies": [
                {
                    "body": "today's audience clearly isn't interested in game centric shows anymore, just look at all the other korean variety. All the top ones are about looking into daily life of entertainers/actors/idols/etc.",
                    "author": "MeepnBeep",
                    "id": "inodq01",
                    "parent_id": "t1_ino1ntc",
                    "score": 10,
                    "created_utc": 1662691172.0,
                    "replies": []
                },
                {
                    "body": "The casts are worn out. All of them got injuries during the show.",
                    "author": "NobleArch",
                    "id": "inpixj5",
                    "parent_id": "t1_ino1ntc",
                    "score": 4,
                    "created_utc": 1662718875.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "but nothing beats old rm",
            "author": "Royal_Requirement453",
            "id": "inn4nr4",
            "parent_id": "t3_x8xl8p",
            "score": 4,
            "created_utc": 1662671845.0,
            "replies": [
                {
                    "body": "Me and sis watching all eps of rm from the beginning, every week we're like wtf when we switch back to the new ep that came out, it's just so meh, I wonder why they changed it, I hope they can start doing action stuff again and not just eating and doing quiz all the time",
                    "author": "Outrageous-Ear-8855",
                    "id": "innbi6k",
                    "parent_id": "t1_inn4nr4",
                    "score": 3,
                    "created_utc": 1662674576.0,
                    "replies": [
                        {
                            "body": "You can only do so much of the nametag w/ some variation before it becomes bored. They mentioned in their recent Q&A ep that nametag game get worse rating than what they do now.",
                            "author": "MeepnBeep",
                            "id": "inodglz",
                            "parent_id": "t1_innbi6k",
                            "score": 6,
                            "created_utc": 1662691060.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yeah, but Gary era is always better!",
            "author": "StringImpressive3306",
            "id": "inpjq8i",
            "parent_id": "t3_x8xl8p",
            "score": 1,
            "created_utc": 1662719464.0,
            "replies": []
        },
        {
            "body": "Early RM was iconic in terms of storylines, characters and missions. They had cross overs and the episodes felt more organic because the storylines continued throughout. Post 2017 RM has had its hits and misses. The storylines are disjointed, games are repetitive, the writers are not as creative and because of many factors, episodes look very similar. \n\nIt could be because we are out of the Bo Pil era which was fun, but didn't have many iconic episodes like those with Chul Min. So when I look back post Chanmin, it feels it was shorter compared to the pre-2016 era.",
            "author": "moonriver501",
            "id": "inz7hxo",
            "parent_id": "t3_x8xl8p",
            "score": 1,
            "created_utc": 1662898409.0,
            "replies": []
        },
        {
            "body": "Idk if it’s just me but they seem to have been moving away from theme songs",
            "author": "kyramaro",
            "id": "inlwu4k",
            "parent_id": "t1_inloxyp",
            "score": 19,
            "created_utc": 1662655085.0,
            "replies": [
                {
                    "body": "Which is sad cause hearing their theme songs was hilarious especially JSM, LKS and JSJ. Like anytime somin did something weird or cute or random, a frog sound followed and then her theme song. It was adorable. I miss hearing them. \n\nI also miss hearing and seeing the childish edits like the exclamation point with that \"oy\" sound or the dark raining cloud and the screenpause.",
                    "author": null,
                    "id": "inoncfy",
                    "parent_id": "t1_inlwu4k",
                    "score": 19,
                    "created_utc": 1662695770.0,
                    "replies": []
                },
                {
                    "body": "Also just bland white captions & less special on screen effect eg 🔥🔥🔥",
                    "author": "NieR_SemiAutomata",
                    "id": "inlxp10",
                    "parent_id": "t1_inlwu4k",
                    "score": 13,
                    "created_utc": 1662655409.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Hmm what do you think is his character on the show? He constantly betrays other members but I don’t know if I would consider him to be part of the betrayal line yet. JSJ has taken over from Kwang Soo as the show’s whipping boy so that character is gone as well. Sechan is one of KJK’s henchmen but haha plays that role better so he doesn’t stand out much there. I feel like the somin/sechan love line helped him out and was quite entertaining but aside from that I still feel he doesn’t have a strong character on the show yet.",
            "author": "Algaewalgae",
            "id": "inohdgy",
            "parent_id": "t1_inloxyp",
            "score": 10,
            "created_utc": 1662692785.0,
            "replies": [
                {
                    "body": "I agree with this. But it's also not his fault. There were 5 strong and established and loved characters already on the show. He tried playing the little brother role but it mostly was annoying. I feel bad for him tbh for not having a strong place. Like in episode 570, where they googled their names and he lost to JSJ... And it turned out JSJ would lose to even bottled water... Not that popularity like this matters, but if he were to leave the show or be replaced not much will change or happen. \n\nI guess time helped him tho. The other dudes are now officially old(er), so ysc now has an advantage in some games. I know the RM dudes can still probably outrun young men, but the advantage is still available for the younger. He even won against KJK in a running match.\n\nEdit: typos",
                    "author": null,
                    "id": "inoo1au",
                    "parent_id": "t1_inohdgy",
                    "score": 8,
                    "created_utc": 1662696139.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "inoxx0t",
                            "parent_id": "t1_inoo1au",
                            "score": 6,
                            "created_utc": 1662702195.0,
                            "replies": [
                                {
                                    "body": "OMG watch it. It's one of the best episodes of post-LKS era with many LOL moments throughout.",
                                    "author": null,
                                    "id": "inp4m3o",
                                    "parent_id": "t1_inoxx0t",
                                    "score": 4,
                                    "created_utc": 1662707063.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Something I feel extra bad for him about is how different his and Somin’s success was on the show (good job Somin, but sad for Sechan). She was just so naturally entertaining and that’s not even her day job! She has her acting career as her main occupation, so she has different income to fall back on. Being funny isn’t even her job (but she’s so good at it), but Sechan has nothing except being funny as a full-time job! I really felt bad for him when in that chatting episode he said there hasn’t been a single day he came to work for RM that he wasn’t anxious the night before. He vibes like he HAS to be funny or it’s all over for him. He doesn’t have another main occupation - income-wise, this is it for him. \n\nThe thing I enjoy most about his character is his goofy antics (the noises he makes when pretending to be in pain), his banter his Somin, and his occassional super sharp moments during games when he realizes the bigger picture",
                    "author": "violetkeis",
                    "id": "inpa3b8",
                    "parent_id": "t1_inohdgy",
                    "score": 7,
                    "created_utc": 1662711555.0,
                    "replies": [
                        {
                            "body": "inb4, So Min has to pay Comedian Association fees",
                            "author": "alvinvin00",
                            "id": "intau1c",
                            "parent_id": "t1_inpa3b8",
                            "score": 5,
                            "created_utc": 1662780354.0,
                            "replies": []
                        },
                        {
                            "body": "I don't think we need to compare and RM does not represent the entire variety scene. Se Chan has a well-established reputation and a number of shows. He's doing quite well in his main job. So I don't see the need to feel bad for him. SM's acting success in the past two years after her hiatus shouldn't make people forget that even when she was struggling getting acting gigs, Se Chan was steadily working. He is doing quite well in his main job considering all the competition among male entertainers. The CF that JH and SM are doing together was also done previously by SC and SH. SC won the top excellence award last year. Their journeys are different. You can be happy for SM's success without negatively comparing him to SC when he is in fact doing quite well as a comedian and entertainer. I bet his earnings are quite good too.",
                            "author": "moonriver501",
                            "id": "inz6fch",
                            "parent_id": "t1_inpa3b8",
                            "score": 2,
                            "created_utc": 1662897796.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "He has a Kkang Kkang screen over which is disturbing enough LOL\n\nto think of it, we have : \n\n* YJS : Step by Step , Jason Bourne\n* JSJ : the house you live in (JYP)\n* SJH : Angry bird\n* KJK : Beowulf, Sparta\n* JSM : frog song\n* HH : (actually he doesn't do the Pororo theme anymore and I can't recall his current theme song )\n* LKS : That damned guitar piece by Sting and Theme of the Fake Emperor \n* Gary : Any leesang songs",
            "author": "Kuuganism",
            "id": "io2xgh5",
            "parent_id": "t1_inloxyp",
            "score": 2,
            "created_utc": 1662953764.0,
            "replies": [
                {
                    "body": "HaHa - Lutricia McNeal – Perfect Love (When bad boy HaHa appears)\n\nLKS - Sting – Saint Agnes And The Burning Train\n\nYeah it's so iconic, why they don't use theme song anymore, or sound effects",
                    "author": "NieR_SemiAutomata",
                    "id": "io2y9ke",
                    "parent_id": "t1_io2xgh5",
                    "score": 2,
                    "created_utc": 1662954202.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I didn't realize how much she carried earlier. Her crazy antics and I'm glad she got awarded for it. But i think Se Chan has finally found his niche and groove with the crew. I've been enjoying them lately",
            "author": "darkapao",
            "id": "innmken",
            "parent_id": "t1_inkygv7",
            "score": 20,
            "created_utc": 1662679237.0,
            "replies": []
        },
        {
            "body": "Agreed. Somin has been a heavyweight for RM, esp in recent years. She fully deserves the recognition and opportunities she has been getting.",
            "author": "Disastrous-Coat-4907",
            "id": "inlc09m",
            "parent_id": "t1_inkygv7",
            "score": 74,
            "created_utc": 1662647072.0,
            "replies": []
        },
        {
            "body": "She really did.",
            "author": "MakarOvni",
            "id": "inmsbok",
            "parent_id": "t1_inkygv7",
            "score": 10,
            "created_utc": 1662667157.0,
            "replies": []
        },
        {
            "body": "And I still see \"jsm/ysc ou*\" comments",
            "author": null,
            "id": "inkuorz",
            "parent_id": "t1_inku3pm",
            "score": 31,
            "created_utc": 1662639143.0,
            "replies": [
                {
                    "body": "right it’s the thing i can’t understand. these two saved the show.. and the members who helped them maintain a character. can’t imagine the show without these two.",
                    "author": "moonchildeus",
                    "id": "inkvecs",
                    "parent_id": "t1_inkuorz",
                    "score": 53,
                    "created_utc": 1662639521.0,
                    "replies": [
                        {
                            "body": "What are their character? Yang Se Chan is alright for me by Jeon So min is too much. She comes off to strong, and childish, and loud, and lame. I don’t think RM should have a character like the one JSM developed. I think she should adjust her character on the show or leave if she cannot.",
                            "author": "StringImpressive3306",
                            "id": "inpkjcu",
                            "parent_id": "t1_inkvecs",
                            "score": -7,
                            "created_utc": 1662720033.0,
                            "replies": [
                                {
                                    "body": "Or you could leave and never watch again. We would all appreciate it. Hater.\n\nEdit: you clearly don't even watch the show. If you call jsm loud, then you just don't know what you're talking about. Especially since Haha and YSC are on this same show. Imagine being a hater of something you don't even watch",
                                    "author": null,
                                    "id": "inpueqg",
                                    "parent_id": "t1_inpkjcu",
                                    "score": 7,
                                    "created_utc": 1662725914.0,
                                    "replies": []
                                },
                                {
                                    "body": "in my opinion that’s the best \"character\" that they could have recruited back then. the outgoing girl who blends well with all the members and also gives guests so much screen time. she saved the show, let’s be real. if you don’t like her that’s fine but why leave such nasty comments online? i’m sure other members would recommend you just stop watching the show than asking her to leave.",
                                    "author": "moonchildeus",
                                    "id": "inrm449",
                                    "parent_id": "t1_inpkjcu",
                                    "score": 5,
                                    "created_utc": 1662752450.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Where?",
                    "author": "LewsThTe",
                    "id": "innbk6b",
                    "parent_id": "t1_inkuorz",
                    "score": -1,
                    "created_utc": 1662674599.0,
                    "replies": [
                        {
                            "body": "Update; oooh there is one of those comments on this very thread now. It's like they can smell where they are unwanted and show up to get reactions. And reaction I will give cause I don't care and it's fun to mess with these idiots.",
                            "author": null,
                            "id": "inpuqku",
                            "parent_id": "t1_innbk6b",
                            "score": 4,
                            "created_utc": 1662726084.0,
                            "replies": []
                        },
                        {
                            "body": "YouTube comments, SBS instagram comments and their personal instagram pages especially JSM and especially from SJH and Spartace fans. You wanna see an absolute shetshow, find posts from close to when episode 610 aired where YJS threw jsm into a love line triangle. SBS had to delete a post, but KJK's agency still had the same post up. You can also check those comments out. \n\nMan, people like to pretend it's over because it isn't so loud... But the hate never stopped and never got better. She just has more supporters now so we can at least drown some of the bs out. \n\nEdit You can also find shetty comments on Reddit and some of the free streaming websites around like.",
                            "author": null,
                            "id": "inojnbu",
                            "parent_id": "t1_innbk6b",
                            "score": 5,
                            "created_utc": 1662693883.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I agree with this. Not that Somin and Sechan haven't kept the show running in recent years - they play a huge role and I wouldn't go without either of them... but the golden age of RM probably won't ever be surpassed.",
            "author": "StaringOverACliff",
            "id": "inm329o",
            "parent_id": "t1_inkvdyw",
            "score": 25,
            "created_utc": 1662657414.0,
            "replies": []
        },
        {
            "body": "I just watched the reincarnation ep recently and the strength of the storyline and editing were just top notch. We got so many GOAT episodes from that period.",
            "author": "swearyirishman",
            "id": "inlc0c2",
            "parent_id": "t1_inkvdyw",
            "score": 31,
            "created_utc": 1662647073.0,
            "replies": [
                {
                    "body": "oh i love that one, can you please tell me what was the ep number?",
                    "author": "moonchildeus",
                    "id": "inlgpv1",
                    "parent_id": "t1_inlc0c2",
                    "score": 4,
                    "created_utc": 1662648955.0,
                    "replies": [
                        {
                            "body": "130",
                            "author": "zauchi",
                            "id": "inlhlte",
                            "parent_id": "t1_inlgpv1",
                            "score": 6,
                            "created_utc": 1662649304.0,
                            "replies": []
                        },
                        {
                            "body": "The other commenter replied alrdy but I just wanted to say the episode after that (131) with Chu Sung Hoon the mma fighter guesting is another really good episode. The fight between kjk and him was so intense.",
                            "author": "swearyirishman",
                            "id": "inm7gms",
                            "parent_id": "t1_inlgpv1",
                            "score": 8,
                            "created_utc": 1662659020.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "yeah i agree! but somin and sechan had a lot memorable stuff too imho, overseas projects were an incredible idea to help them introduce themselves. to me their era is just as precious as gary’s.\n\nbut for some reason 2017 just doesn’t seem like \"long time ago\" bahaha, or ever 5 years ago. maybe it’s a covid thing that time stopped at the beginning of 2020…",
            "author": "moonchildeus",
            "id": "inkvvgs",
            "parent_id": "t1_inkvdyw",
            "score": 23,
            "created_utc": 1662639766.0,
            "replies": [
                {
                    "body": "I am still disappointed that they didn’t do name tag ripping abroad. They used to do that during Gary time.",
                    "author": "StringImpressive3306",
                    "id": "inpku3j",
                    "parent_id": "t1_inkvvgs",
                    "score": 0,
                    "created_utc": 1662720235.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Definitely agree.\n\nGary was there when Running Man was in top of the world, nothing can replace that.\n\nAlso I think memorability plays a huge part. Since So Min & Se Chan joined, I don't think I can name 10 Episodes that were iconic, save a few:\n\n- family project\n\n- Tazza\n\n- etc.\n\nBut the golden era had so many iconic episodes that I can name two dozen easily.",
            "author": "doubleoh72",
            "id": "inob17x",
            "parent_id": "t1_inkvdyw",
            "score": 6,
            "created_utc": 1662690002.0,
            "replies": [
                {
                    "body": "I can name so many iconic episodes since 2017 tho. That doesn't prove anything aside from your bias in what you like and opinion that the show was more memorable, TO YOU. It's very subjective.",
                    "author": null,
                    "id": "inoo6qy",
                    "parent_id": "t1_inob17x",
                    "score": -3,
                    "created_utc": 1662696219.0,
                    "replies": [
                        {
                            "body": "Hey, chill bro. I'm not saying the show is bad now, I enjoy the show still, and So Min is probably my favourite member right now.\n\nI'm just saying that the themes and concepts in the early days were iconic like: super power, yoomes bond,SNSD, first love, Sherlock Holmes, Gold JiHyo, baseball, park ji sung, reincarnation, Ddakji, grasshopper hunting.... so many.\n\nBut since 2017, they were less frequent like family project, Tazza, fiery stove league.\n\nIt's not that they aren't good, but just prehaps less memorable than the golden days.",
                            "author": "doubleoh72",
                            "id": "inoq6ip",
                            "parent_id": "t1_inoo6qy",
                            "score": 5,
                            "created_utc": 1662697349.0,
                            "replies": [
                                {
                                    "body": "Oh my tone was off in the first comment I didn't mean to attack. Just wanted to point out being memorable is very subjective and not indicative of anything other than what the person's likes a dislikes are. That's what I meant.",
                                    "author": null,
                                    "id": "inoqvjq",
                                    "parent_id": "t1_inoq6ip",
                                    "score": 2,
                                    "created_utc": 1662697754.0,
                                    "replies": [
                                        {
                                            "body": "No problem dude. I get where you come from. Too many hardcore 2010-2016 fans still live in the past and refuse to acvept the show for its current state.\n\nThe golden era is gone, and running man will probably never go back to the internationally popular show it was back then.\n\nEven I reminisce it sometimes.\n\nBut i was one of those fans in 2017 that felt So Min & Se Chan were not good additions. I didn't hate them like others, but I didn't accept them till probably 2018.\n\nAnd now So Min is my favourite member, and Se Chan's skits make me laugh the hardest.",
                                            "author": "doubleoh72",
                                            "id": "inosmog",
                                            "parent_id": "t1_inoqvjq",
                                            "score": 5,
                                            "created_utc": 1662698805.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "A pandemic runner but if i were to choose an era of runningman it will always be the 7012 era.I just enjoy it more than the episodes after that.I never got tired watching it on replays.Atleast for me,I think its allowed here to voiced out your own opinion right?\n\nGary will still be my top runner,if i were to list them.He got the romance,the laughter and was really good at games even on nametag rippings.Nevertheless,Sechan and Somin was still a good addition to the cast and will always be ♥️♥️♥️",
            "author": "Witty_Inspection_310",
            "id": "inol20n",
            "parent_id": "t1_inkvdyw",
            "score": 2,
            "created_utc": 1662694596.0,
            "replies": []
        },
        {
            "body": "And random, but the crowds were pretty insane, too. Hella people would show up just to watch and/or take photos/video. It got to the point where in some episodes, I think I recall them walking around with security?",
            "author": "FallenHarmonics",
            "id": "innqeg4",
            "parent_id": "t1_inkvdyw",
            "score": 1,
            "created_utc": 1662680958.0,
            "replies": []
        },
        {
            "body": "How old will be Ji Suk Jin then 😅",
            "author": "AggressiveExercise38",
            "id": "innd1pu",
            "parent_id": "t1_inmx2sl",
            "score": 12,
            "created_utc": 1662675208.0,
            "replies": []
        },
        {
            "body": "hopefully they will!",
            "author": "moonchildeus",
            "id": "inmxdpj",
            "parent_id": "t1_inmx2sl",
            "score": 5,
            "created_utc": 1662669060.0,
            "replies": [
                {
                    "body": "I can't believe this comment was downvoted. 😒 OP is literally saying he hopes the show goes on longer and y'all are downvoting them?!? Why even come to a running man sub if you hate the show?",
                    "author": null,
                    "id": "inoodwq",
                    "parent_id": "t1_inmxdpj",
                    "score": 3,
                    "created_utc": 1662696328.0,
                    "replies": [
                        {
                            "body": "exactly what i meant :(",
                            "author": "moonchildeus",
                            "id": "inpiw1h",
                            "parent_id": "t1_inoodwq",
                            "score": 1,
                            "created_utc": 1662718845.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": ">the pre chanmin era focused more on the games and of course monday couple.\n\nYes, the focus is on the games, but the cast made it hilarious. That was the time when RM got really popular.",
            "author": "Zarkuine",
            "id": "inlnucb",
            "parent_id": "t1_inljt27",
            "score": 13,
            "created_utc": 1662651707.0,
            "replies": []
        },
        {
            "body": "You are really missing out then, those episodes were so good. Although it was more game focused, the games and themes were creative, it allowed cast members to genuinely be funny and it just brought out more from the guest. Now the comedy feels more forced and not as genuine because they arent thrown into as many different situations. But if you do watch it, might make the current running man seem a bit boring.",
            "author": "earlycomer",
            "id": "inn76h8",
            "parent_id": "t1_inljt27",
            "score": 13,
            "created_utc": 1662672834.0,
            "replies": [
                {
                    "body": "I've only went back to watch a few episodes pre-ysc/jsm era where a favorite actor of mine was on the show. The villainess episode was one of the most iconic episodes, but because of the guests. I think most of the episodes that I've seen were only good BECAUSE of the guests. I ofc might be biased cause my favorites were guests but not just them. Idk, the guests just did some hilarious things and the cast worked so well with them. \n\nMost guests today are not like those, but RM needs guests. So I find myself wanting RM without guests because most are boring nowadays, but also knowing guests can and will make it interesting... Just not very young idols who can only do their one choreography over and over and nobody is allowed to make fun of them. \n\nBut I started watching this show because of jsm. I even skipped the few episodes she was absent either during Covid or her hospitalization. So it's very hard to go back to when she wasn't there. As much as I like the rest of the cast, I don't care enough to watch their other appearances. I've watched anything and everything jsm has touched. Lol \n\nMany stopped watching without LKS. It doesn't make us solo stans but we all have our faves without whom the show feels empty.",
                    "author": null,
                    "id": "inop97u",
                    "parent_id": "t1_inn76h8",
                    "score": 3,
                    "created_utc": 1662696821.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "for gary it’s 324 + 2 he briefly guested on\nfor semin 274 + 2 for both they were guests",
            "author": "moonchildeus",
            "id": "inlgjso",
            "parent_id": "t1_inlgd9n",
            "score": 10,
            "created_utc": 1662648888.0,
            "replies": [
                {
                    "body": "Damn, time flies.",
                    "author": "Sphincterinthenose",
                    "id": "inlgn0d",
                    "parent_id": "t1_inlgjso",
                    "score": 6,
                    "created_utc": 1662648923.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "oh 50 eps left i forgot to write the math",
            "author": "moonchildeus",
            "id": "inlgmzh",
            "parent_id": "t1_inlgd9n",
            "score": 2,
            "created_utc": 1662648923.0,
            "replies": []
        },
        {
            "body": "today's audience clearly isn't interested in game centric shows anymore, just look at all the other korean variety. All the top ones are about looking into daily life of entertainers/actors/idols/etc.",
            "author": "MeepnBeep",
            "id": "inodq01",
            "parent_id": "t1_ino1ntc",
            "score": 10,
            "created_utc": 1662691172.0,
            "replies": []
        },
        {
            "body": "The casts are worn out. All of them got injuries during the show.",
            "author": "NobleArch",
            "id": "inpixj5",
            "parent_id": "t1_ino1ntc",
            "score": 4,
            "created_utc": 1662718875.0,
            "replies": []
        },
        {
            "body": "Me and sis watching all eps of rm from the beginning, every week we're like wtf when we switch back to the new ep that came out, it's just so meh, I wonder why they changed it, I hope they can start doing action stuff again and not just eating and doing quiz all the time",
            "author": "Outrageous-Ear-8855",
            "id": "innbi6k",
            "parent_id": "t1_inn4nr4",
            "score": 3,
            "created_utc": 1662674576.0,
            "replies": [
                {
                    "body": "You can only do so much of the nametag w/ some variation before it becomes bored. They mentioned in their recent Q&A ep that nametag game get worse rating than what they do now.",
                    "author": "MeepnBeep",
                    "id": "inodglz",
                    "parent_id": "t1_innbi6k",
                    "score": 6,
                    "created_utc": 1662691060.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Which is sad cause hearing their theme songs was hilarious especially JSM, LKS and JSJ. Like anytime somin did something weird or cute or random, a frog sound followed and then her theme song. It was adorable. I miss hearing them. \n\nI also miss hearing and seeing the childish edits like the exclamation point with that \"oy\" sound or the dark raining cloud and the screenpause.",
            "author": null,
            "id": "inoncfy",
            "parent_id": "t1_inlwu4k",
            "score": 19,
            "created_utc": 1662695770.0,
            "replies": []
        },
        {
            "body": "Also just bland white captions & less special on screen effect eg 🔥🔥🔥",
            "author": "NieR_SemiAutomata",
            "id": "inlxp10",
            "parent_id": "t1_inlwu4k",
            "score": 13,
            "created_utc": 1662655409.0,
            "replies": []
        },
        {
            "body": "I agree with this. But it's also not his fault. There were 5 strong and established and loved characters already on the show. He tried playing the little brother role but it mostly was annoying. I feel bad for him tbh for not having a strong place. Like in episode 570, where they googled their names and he lost to JSJ... And it turned out JSJ would lose to even bottled water... Not that popularity like this matters, but if he were to leave the show or be replaced not much will change or happen. \n\nI guess time helped him tho. The other dudes are now officially old(er), so ysc now has an advantage in some games. I know the RM dudes can still probably outrun young men, but the advantage is still available for the younger. He even won against KJK in a running match.\n\nEdit: typos",
            "author": null,
            "id": "inoo1au",
            "parent_id": "t1_inohdgy",
            "score": 8,
            "created_utc": 1662696139.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "inoxx0t",
                    "parent_id": "t1_inoo1au",
                    "score": 6,
                    "created_utc": 1662702195.0,
                    "replies": [
                        {
                            "body": "OMG watch it. It's one of the best episodes of post-LKS era with many LOL moments throughout.",
                            "author": null,
                            "id": "inp4m3o",
                            "parent_id": "t1_inoxx0t",
                            "score": 4,
                            "created_utc": 1662707063.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Something I feel extra bad for him about is how different his and Somin’s success was on the show (good job Somin, but sad for Sechan). She was just so naturally entertaining and that’s not even her day job! She has her acting career as her main occupation, so she has different income to fall back on. Being funny isn’t even her job (but she’s so good at it), but Sechan has nothing except being funny as a full-time job! I really felt bad for him when in that chatting episode he said there hasn’t been a single day he came to work for RM that he wasn’t anxious the night before. He vibes like he HAS to be funny or it’s all over for him. He doesn’t have another main occupation - income-wise, this is it for him. \n\nThe thing I enjoy most about his character is his goofy antics (the noises he makes when pretending to be in pain), his banter his Somin, and his occassional super sharp moments during games when he realizes the bigger picture",
            "author": "violetkeis",
            "id": "inpa3b8",
            "parent_id": "t1_inohdgy",
            "score": 7,
            "created_utc": 1662711555.0,
            "replies": [
                {
                    "body": "inb4, So Min has to pay Comedian Association fees",
                    "author": "alvinvin00",
                    "id": "intau1c",
                    "parent_id": "t1_inpa3b8",
                    "score": 5,
                    "created_utc": 1662780354.0,
                    "replies": []
                },
                {
                    "body": "I don't think we need to compare and RM does not represent the entire variety scene. Se Chan has a well-established reputation and a number of shows. He's doing quite well in his main job. So I don't see the need to feel bad for him. SM's acting success in the past two years after her hiatus shouldn't make people forget that even when she was struggling getting acting gigs, Se Chan was steadily working. He is doing quite well in his main job considering all the competition among male entertainers. The CF that JH and SM are doing together was also done previously by SC and SH. SC won the top excellence award last year. Their journeys are different. You can be happy for SM's success without negatively comparing him to SC when he is in fact doing quite well as a comedian and entertainer. I bet his earnings are quite good too.",
                    "author": "moonriver501",
                    "id": "inz6fch",
                    "parent_id": "t1_inpa3b8",
                    "score": 2,
                    "created_utc": 1662897796.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "HaHa - Lutricia McNeal – Perfect Love (When bad boy HaHa appears)\n\nLKS - Sting – Saint Agnes And The Burning Train\n\nYeah it's so iconic, why they don't use theme song anymore, or sound effects",
            "author": "NieR_SemiAutomata",
            "id": "io2y9ke",
            "parent_id": "t1_io2xgh5",
            "score": 2,
            "created_utc": 1662954202.0,
            "replies": []
        },
        {
            "body": "right it’s the thing i can’t understand. these two saved the show.. and the members who helped them maintain a character. can’t imagine the show without these two.",
            "author": "moonchildeus",
            "id": "inkvecs",
            "parent_id": "t1_inkuorz",
            "score": 53,
            "created_utc": 1662639521.0,
            "replies": [
                {
                    "body": "What are their character? Yang Se Chan is alright for me by Jeon So min is too much. She comes off to strong, and childish, and loud, and lame. I don’t think RM should have a character like the one JSM developed. I think she should adjust her character on the show or leave if she cannot.",
                    "author": "StringImpressive3306",
                    "id": "inpkjcu",
                    "parent_id": "t1_inkvecs",
                    "score": -7,
                    "created_utc": 1662720033.0,
                    "replies": [
                        {
                            "body": "Or you could leave and never watch again. We would all appreciate it. Hater.\n\nEdit: you clearly don't even watch the show. If you call jsm loud, then you just don't know what you're talking about. Especially since Haha and YSC are on this same show. Imagine being a hater of something you don't even watch",
                            "author": null,
                            "id": "inpueqg",
                            "parent_id": "t1_inpkjcu",
                            "score": 7,
                            "created_utc": 1662725914.0,
                            "replies": []
                        },
                        {
                            "body": "in my opinion that’s the best \"character\" that they could have recruited back then. the outgoing girl who blends well with all the members and also gives guests so much screen time. she saved the show, let’s be real. if you don’t like her that’s fine but why leave such nasty comments online? i’m sure other members would recommend you just stop watching the show than asking her to leave.",
                            "author": "moonchildeus",
                            "id": "inrm449",
                            "parent_id": "t1_inpkjcu",
                            "score": 5,
                            "created_utc": 1662752450.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Where?",
            "author": "LewsThTe",
            "id": "innbk6b",
            "parent_id": "t1_inkuorz",
            "score": -1,
            "created_utc": 1662674599.0,
            "replies": [
                {
                    "body": "Update; oooh there is one of those comments on this very thread now. It's like they can smell where they are unwanted and show up to get reactions. And reaction I will give cause I don't care and it's fun to mess with these idiots.",
                    "author": null,
                    "id": "inpuqku",
                    "parent_id": "t1_innbk6b",
                    "score": 4,
                    "created_utc": 1662726084.0,
                    "replies": []
                },
                {
                    "body": "YouTube comments, SBS instagram comments and their personal instagram pages especially JSM and especially from SJH and Spartace fans. You wanna see an absolute shetshow, find posts from close to when episode 610 aired where YJS threw jsm into a love line triangle. SBS had to delete a post, but KJK's agency still had the same post up. You can also check those comments out. \n\nMan, people like to pretend it's over because it isn't so loud... But the hate never stopped and never got better. She just has more supporters now so we can at least drown some of the bs out. \n\nEdit You can also find shetty comments on Reddit and some of the free streaming websites around like.",
                    "author": null,
                    "id": "inojnbu",
                    "parent_id": "t1_innbk6b",
                    "score": 5,
                    "created_utc": 1662693883.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "oh i love that one, can you please tell me what was the ep number?",
            "author": "moonchildeus",
            "id": "inlgpv1",
            "parent_id": "t1_inlc0c2",
            "score": 4,
            "created_utc": 1662648955.0,
            "replies": [
                {
                    "body": "130",
                    "author": "zauchi",
                    "id": "inlhlte",
                    "parent_id": "t1_inlgpv1",
                    "score": 6,
                    "created_utc": 1662649304.0,
                    "replies": []
                },
                {
                    "body": "The other commenter replied alrdy but I just wanted to say the episode after that (131) with Chu Sung Hoon the mma fighter guesting is another really good episode. The fight between kjk and him was so intense.",
                    "author": "swearyirishman",
                    "id": "inm7gms",
                    "parent_id": "t1_inlgpv1",
                    "score": 8,
                    "created_utc": 1662659020.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I am still disappointed that they didn’t do name tag ripping abroad. They used to do that during Gary time.",
            "author": "StringImpressive3306",
            "id": "inpku3j",
            "parent_id": "t1_inkvvgs",
            "score": 0,
            "created_utc": 1662720235.0,
            "replies": []
        },
        {
            "body": "I can name so many iconic episodes since 2017 tho. That doesn't prove anything aside from your bias in what you like and opinion that the show was more memorable, TO YOU. It's very subjective.",
            "author": null,
            "id": "inoo6qy",
            "parent_id": "t1_inob17x",
            "score": -3,
            "created_utc": 1662696219.0,
            "replies": [
                {
                    "body": "Hey, chill bro. I'm not saying the show is bad now, I enjoy the show still, and So Min is probably my favourite member right now.\n\nI'm just saying that the themes and concepts in the early days were iconic like: super power, yoomes bond,SNSD, first love, Sherlock Holmes, Gold JiHyo, baseball, park ji sung, reincarnation, Ddakji, grasshopper hunting.... so many.\n\nBut since 2017, they were less frequent like family project, Tazza, fiery stove league.\n\nIt's not that they aren't good, but just prehaps less memorable than the golden days.",
                    "author": "doubleoh72",
                    "id": "inoq6ip",
                    "parent_id": "t1_inoo6qy",
                    "score": 5,
                    "created_utc": 1662697349.0,
                    "replies": [
                        {
                            "body": "Oh my tone was off in the first comment I didn't mean to attack. Just wanted to point out being memorable is very subjective and not indicative of anything other than what the person's likes a dislikes are. That's what I meant.",
                            "author": null,
                            "id": "inoqvjq",
                            "parent_id": "t1_inoq6ip",
                            "score": 2,
                            "created_utc": 1662697754.0,
                            "replies": [
                                {
                                    "body": "No problem dude. I get where you come from. Too many hardcore 2010-2016 fans still live in the past and refuse to acvept the show for its current state.\n\nThe golden era is gone, and running man will probably never go back to the internationally popular show it was back then.\n\nEven I reminisce it sometimes.\n\nBut i was one of those fans in 2017 that felt So Min & Se Chan were not good additions. I didn't hate them like others, but I didn't accept them till probably 2018.\n\nAnd now So Min is my favourite member, and Se Chan's skits make me laugh the hardest.",
                                    "author": "doubleoh72",
                                    "id": "inosmog",
                                    "parent_id": "t1_inoqvjq",
                                    "score": 5,
                                    "created_utc": 1662698805.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I can't believe this comment was downvoted. 😒 OP is literally saying he hopes the show goes on longer and y'all are downvoting them?!? Why even come to a running man sub if you hate the show?",
            "author": null,
            "id": "inoodwq",
            "parent_id": "t1_inmxdpj",
            "score": 3,
            "created_utc": 1662696328.0,
            "replies": [
                {
                    "body": "exactly what i meant :(",
                    "author": "moonchildeus",
                    "id": "inpiw1h",
                    "parent_id": "t1_inoodwq",
                    "score": 1,
                    "created_utc": 1662718845.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I've only went back to watch a few episodes pre-ysc/jsm era where a favorite actor of mine was on the show. The villainess episode was one of the most iconic episodes, but because of the guests. I think most of the episodes that I've seen were only good BECAUSE of the guests. I ofc might be biased cause my favorites were guests but not just them. Idk, the guests just did some hilarious things and the cast worked so well with them. \n\nMost guests today are not like those, but RM needs guests. So I find myself wanting RM without guests because most are boring nowadays, but also knowing guests can and will make it interesting... Just not very young idols who can only do their one choreography over and over and nobody is allowed to make fun of them. \n\nBut I started watching this show because of jsm. I even skipped the few episodes she was absent either during Covid or her hospitalization. So it's very hard to go back to when she wasn't there. As much as I like the rest of the cast, I don't care enough to watch their other appearances. I've watched anything and everything jsm has touched. Lol \n\nMany stopped watching without LKS. It doesn't make us solo stans but we all have our faves without whom the show feels empty.",
            "author": null,
            "id": "inop97u",
            "parent_id": "t1_inn76h8",
            "score": 3,
            "created_utc": 1662696821.0,
            "replies": []
        },
        {
            "body": "Damn, time flies.",
            "author": "Sphincterinthenose",
            "id": "inlgn0d",
            "parent_id": "t1_inlgjso",
            "score": 6,
            "created_utc": 1662648923.0,
            "replies": []
        },
        {
            "body": "You can only do so much of the nametag w/ some variation before it becomes bored. They mentioned in their recent Q&A ep that nametag game get worse rating than what they do now.",
            "author": "MeepnBeep",
            "id": "inodglz",
            "parent_id": "t1_innbi6k",
            "score": 6,
            "created_utc": 1662691060.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "inoxx0t",
            "parent_id": "t1_inoo1au",
            "score": 6,
            "created_utc": 1662702195.0,
            "replies": [
                {
                    "body": "OMG watch it. It's one of the best episodes of post-LKS era with many LOL moments throughout.",
                    "author": null,
                    "id": "inp4m3o",
                    "parent_id": "t1_inoxx0t",
                    "score": 4,
                    "created_utc": 1662707063.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "inb4, So Min has to pay Comedian Association fees",
            "author": "alvinvin00",
            "id": "intau1c",
            "parent_id": "t1_inpa3b8",
            "score": 5,
            "created_utc": 1662780354.0,
            "replies": []
        },
        {
            "body": "I don't think we need to compare and RM does not represent the entire variety scene. Se Chan has a well-established reputation and a number of shows. He's doing quite well in his main job. So I don't see the need to feel bad for him. SM's acting success in the past two years after her hiatus shouldn't make people forget that even when she was struggling getting acting gigs, Se Chan was steadily working. He is doing quite well in his main job considering all the competition among male entertainers. The CF that JH and SM are doing together was also done previously by SC and SH. SC won the top excellence award last year. Their journeys are different. You can be happy for SM's success without negatively comparing him to SC when he is in fact doing quite well as a comedian and entertainer. I bet his earnings are quite good too.",
            "author": "moonriver501",
            "id": "inz6fch",
            "parent_id": "t1_inpa3b8",
            "score": 2,
            "created_utc": 1662897796.0,
            "replies": []
        },
        {
            "body": "What are their character? Yang Se Chan is alright for me by Jeon So min is too much. She comes off to strong, and childish, and loud, and lame. I don’t think RM should have a character like the one JSM developed. I think she should adjust her character on the show or leave if she cannot.",
            "author": "StringImpressive3306",
            "id": "inpkjcu",
            "parent_id": "t1_inkvecs",
            "score": -7,
            "created_utc": 1662720033.0,
            "replies": [
                {
                    "body": "Or you could leave and never watch again. We would all appreciate it. Hater.\n\nEdit: you clearly don't even watch the show. If you call jsm loud, then you just don't know what you're talking about. Especially since Haha and YSC are on this same show. Imagine being a hater of something you don't even watch",
                    "author": null,
                    "id": "inpueqg",
                    "parent_id": "t1_inpkjcu",
                    "score": 7,
                    "created_utc": 1662725914.0,
                    "replies": []
                },
                {
                    "body": "in my opinion that’s the best \"character\" that they could have recruited back then. the outgoing girl who blends well with all the members and also gives guests so much screen time. she saved the show, let’s be real. if you don’t like her that’s fine but why leave such nasty comments online? i’m sure other members would recommend you just stop watching the show than asking her to leave.",
                    "author": "moonchildeus",
                    "id": "inrm449",
                    "parent_id": "t1_inpkjcu",
                    "score": 5,
                    "created_utc": 1662752450.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Update; oooh there is one of those comments on this very thread now. It's like they can smell where they are unwanted and show up to get reactions. And reaction I will give cause I don't care and it's fun to mess with these idiots.",
            "author": null,
            "id": "inpuqku",
            "parent_id": "t1_innbk6b",
            "score": 4,
            "created_utc": 1662726084.0,
            "replies": []
        },
        {
            "body": "YouTube comments, SBS instagram comments and their personal instagram pages especially JSM and especially from SJH and Spartace fans. You wanna see an absolute shetshow, find posts from close to when episode 610 aired where YJS threw jsm into a love line triangle. SBS had to delete a post, but KJK's agency still had the same post up. You can also check those comments out. \n\nMan, people like to pretend it's over because it isn't so loud... But the hate never stopped and never got better. She just has more supporters now so we can at least drown some of the bs out. \n\nEdit You can also find shetty comments on Reddit and some of the free streaming websites around like.",
            "author": null,
            "id": "inojnbu",
            "parent_id": "t1_innbk6b",
            "score": 5,
            "created_utc": 1662693883.0,
            "replies": []
        },
        {
            "body": "130",
            "author": "zauchi",
            "id": "inlhlte",
            "parent_id": "t1_inlgpv1",
            "score": 6,
            "created_utc": 1662649304.0,
            "replies": []
        },
        {
            "body": "The other commenter replied alrdy but I just wanted to say the episode after that (131) with Chu Sung Hoon the mma fighter guesting is another really good episode. The fight between kjk and him was so intense.",
            "author": "swearyirishman",
            "id": "inm7gms",
            "parent_id": "t1_inlgpv1",
            "score": 8,
            "created_utc": 1662659020.0,
            "replies": []
        },
        {
            "body": "Hey, chill bro. I'm not saying the show is bad now, I enjoy the show still, and So Min is probably my favourite member right now.\n\nI'm just saying that the themes and concepts in the early days were iconic like: super power, yoomes bond,SNSD, first love, Sherlock Holmes, Gold JiHyo, baseball, park ji sung, reincarnation, Ddakji, grasshopper hunting.... so many.\n\nBut since 2017, they were less frequent like family project, Tazza, fiery stove league.\n\nIt's not that they aren't good, but just prehaps less memorable than the golden days.",
            "author": "doubleoh72",
            "id": "inoq6ip",
            "parent_id": "t1_inoo6qy",
            "score": 5,
            "created_utc": 1662697349.0,
            "replies": [
                {
                    "body": "Oh my tone was off in the first comment I didn't mean to attack. Just wanted to point out being memorable is very subjective and not indicative of anything other than what the person's likes a dislikes are. That's what I meant.",
                    "author": null,
                    "id": "inoqvjq",
                    "parent_id": "t1_inoq6ip",
                    "score": 2,
                    "created_utc": 1662697754.0,
                    "replies": [
                        {
                            "body": "No problem dude. I get where you come from. Too many hardcore 2010-2016 fans still live in the past and refuse to acvept the show for its current state.\n\nThe golden era is gone, and running man will probably never go back to the internationally popular show it was back then.\n\nEven I reminisce it sometimes.\n\nBut i was one of those fans in 2017 that felt So Min & Se Chan were not good additions. I didn't hate them like others, but I didn't accept them till probably 2018.\n\nAnd now So Min is my favourite member, and Se Chan's skits make me laugh the hardest.",
                            "author": "doubleoh72",
                            "id": "inosmog",
                            "parent_id": "t1_inoqvjq",
                            "score": 5,
                            "created_utc": 1662698805.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "exactly what i meant :(",
            "author": "moonchildeus",
            "id": "inpiw1h",
            "parent_id": "t1_inoodwq",
            "score": 1,
            "created_utc": 1662718845.0,
            "replies": []
        },
        {
            "body": "OMG watch it. It's one of the best episodes of post-LKS era with many LOL moments throughout.",
            "author": null,
            "id": "inp4m3o",
            "parent_id": "t1_inoxx0t",
            "score": 4,
            "created_utc": 1662707063.0,
            "replies": []
        },
        {
            "body": "Or you could leave and never watch again. We would all appreciate it. Hater.\n\nEdit: you clearly don't even watch the show. If you call jsm loud, then you just don't know what you're talking about. Especially since Haha and YSC are on this same show. Imagine being a hater of something you don't even watch",
            "author": null,
            "id": "inpueqg",
            "parent_id": "t1_inpkjcu",
            "score": 7,
            "created_utc": 1662725914.0,
            "replies": []
        },
        {
            "body": "in my opinion that’s the best \"character\" that they could have recruited back then. the outgoing girl who blends well with all the members and also gives guests so much screen time. she saved the show, let’s be real. if you don’t like her that’s fine but why leave such nasty comments online? i’m sure other members would recommend you just stop watching the show than asking her to leave.",
            "author": "moonchildeus",
            "id": "inrm449",
            "parent_id": "t1_inpkjcu",
            "score": 5,
            "created_utc": 1662752450.0,
            "replies": []
        },
        {
            "body": "Oh my tone was off in the first comment I didn't mean to attack. Just wanted to point out being memorable is very subjective and not indicative of anything other than what the person's likes a dislikes are. That's what I meant.",
            "author": null,
            "id": "inoqvjq",
            "parent_id": "t1_inoq6ip",
            "score": 2,
            "created_utc": 1662697754.0,
            "replies": [
                {
                    "body": "No problem dude. I get where you come from. Too many hardcore 2010-2016 fans still live in the past and refuse to acvept the show for its current state.\n\nThe golden era is gone, and running man will probably never go back to the internationally popular show it was back then.\n\nEven I reminisce it sometimes.\n\nBut i was one of those fans in 2017 that felt So Min & Se Chan were not good additions. I didn't hate them like others, but I didn't accept them till probably 2018.\n\nAnd now So Min is my favourite member, and Se Chan's skits make me laugh the hardest.",
                    "author": "doubleoh72",
                    "id": "inosmog",
                    "parent_id": "t1_inoqvjq",
                    "score": 5,
                    "created_utc": 1662698805.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "No problem dude. I get where you come from. Too many hardcore 2010-2016 fans still live in the past and refuse to acvept the show for its current state.\n\nThe golden era is gone, and running man will probably never go back to the internationally popular show it was back then.\n\nEven I reminisce it sometimes.\n\nBut i was one of those fans in 2017 that felt So Min & Se Chan were not good additions. I didn't hate them like others, but I didn't accept them till probably 2018.\n\nAnd now So Min is my favourite member, and Se Chan's skits make me laugh the hardest.",
            "author": "doubleoh72",
            "id": "inosmog",
            "parent_id": "t1_inoqvjq",
            "score": 5,
            "created_utc": 1662698805.0,
            "replies": []
        }
    ]
}