{
    "title": "Stop asking “what to tell your barber to get this look (insert picture here)” and just show your barber the picture",
    "post_id": "8dr43y",
    "post_url": "https://www.reddit.com/r/malehairadvice/comments/8dr43y/stop_asking_what_to_tell_your_barber_to_get_this/",
    "author": "nave555",
    "body": "Every single post that has a picture and the question what should I tell my barber to get this cut is always answered by show the barber the picture.",
    "url": "https://www.reddit.com/r/malehairadvice/comments/8dr43y/stop_asking_what_to_tell_your_barber_to_get_this/",
    "score": 250,
    "upvote_ratio": 0.92,
    "created_utc": 1524259230.0,
    "num_comments": 31,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "Yea so I did this and my barber still fucked up my hair... some barbers are just not suited to cut hair...",
            "author": "Fapstronaught69",
            "id": "dxpd4rw",
            "parent_id": "t3_8dr43y",
            "score": 119,
            "created_utc": 1524261489.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "dxpnkdb",
                    "parent_id": "t1_dxpd4rw",
                    "score": 23,
                    "created_utc": 1524273566.0,
                    "replies": [
                        {
                            "body": "Noted. But the haircut I wanted wasn’t even too complex. Sides short but not faded or too short, just slightly shorter than top, and the top of my hair cut slightly, with bangs that come down to my eye brows. I showed the picture, and yet I came out with the back of my hair 4 inches and front under 1. ",
                            "author": "Fapstronaught69",
                            "id": "dxpo36b",
                            "parent_id": "t1_dxpnkdb",
                            "score": 3,
                            "created_utc": 1524274151.0,
                            "replies": [
                                {
                                    "body": "Ok so do you think telling that particular barber would have yielded better results? Did y’all not talk about it at all? I have a hard time imagining you walking in all silent, showing him the picture and sitting down without a word.\n\nIn order to guarantee you’ll get a good cut you need to go to a good, reputable place. Not to put a price on quality but usually these places charge $25-35 for a haircut. ",
                                    "author": "HeyJustWantedToSay",
                                    "id": "dxpyyn9",
                                    "parent_id": "t1_dxpo36b",
                                    "score": 4,
                                    "created_utc": 1524289009.0,
                                    "replies": [
                                        {
                                            "body": "I’m good with that price but how do I find a good place? What happened was I walked in showed the picture he said idk I might be able to make it look better I might not and I said I just needed it to be as good and he said I think I can do that. 40 minutes later I thought he was done I said can you cut the front a little bit? He said I’m not done. 30 minutes from then he started on the front l, but on the first cut he took 4 inches off the 4.75 inches. And at that point I said that’s too short he said you said cut it a little bit and I did, I’m like that’s way too much. Then I payed and left. He did not communicate. And I noticed he fucked up when he took off 4 inches in one cut and at that point it was too late. I’m about to just start going to salons.",
                                            "author": "Fapstronaught69",
                                            "id": "dxpzhty",
                                            "parent_id": "t1_dxpyyn9",
                                            "score": 1,
                                            "created_utc": 1524290061.0,
                                            "replies": [
                                                {
                                                    "body": "4 out of nearly 5 inches in one go? that makes me cringe just reading that holy shit I'd be so upset",
                                                    "author": "Pansy_Lad",
                                                    "id": "dxpzrwl",
                                                    "parent_id": "t1_dxpzhty",
                                                    "score": 3,
                                                    "created_utc": 1524290625.0,
                                                    "replies": [
                                                        {
                                                            "body": "Yea I should’ve left without paying. I need to find a new place that place is garbage. ",
                                                            "author": "Fapstronaught69",
                                                            "id": "dxq05cy",
                                                            "parent_id": "t1_dxpzrwl",
                                                            "score": 1,
                                                            "created_utc": 1524291410.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "body": "I feel you, I had something similar happen to me at my regular place, by my non-regular stylist. He was trimming my sides for an undercut. I closed my eyes because the hair was flying around and going in. I feel him go towards my temple. Open my eyes to see that the guy had receded my hairline in that single second. I asked him why he pushed the trimmer so far up. \"Let me finish the rest, it will look better than the picture\". Now, a month later, I have this weird line of very short hair which is my actual hairline, and longer hair (around 3 inches) behind that. I was actually happy with that place and my regular stylist. Sometimes, you can't win. ",
                                                    "author": "wulfschtagg",
                                                    "id": "dxq4j65",
                                                    "parent_id": "t1_dxpzhty",
                                                    "score": 2,
                                                    "created_utc": 1524302256.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Preferably one that serves you booze.",
                            "author": "aperture413",
                            "id": "dxq7qcx",
                            "parent_id": "t1_dxpnkdb",
                            "score": 1,
                            "created_utc": 1524310527.0,
                            "replies": []
                        },
                        {
                            "body": "So for a new style go to a salon and to maintain it go to a barber? ",
                            "author": "YouHaveToPullOutBro",
                            "id": "dxq2xbo",
                            "parent_id": "t1_dxpnkdb",
                            "score": 0,
                            "created_utc": 1524297909.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "I agree, but a lot of the time it's a more complex mixture of inexperience, unwillingness, or even impossibility.\n\nMy hair, for instance, is *brutally* thick. While a fade shows up very nicely, I'd need to get a perm and spend an hour every day styling my hair to get 4/5 haircuts on the topbar. It's just not worth it since my hair grows so fast I need to get it cut every 2 weeks.\n\nOn the other hand, I do agree with you - I've gone to stylists/barbers with pictures of my own hair (after a good cut) and they've fucked it up so bad I never went back. The desired results are absolutely possible, but they just don't have the experience, ability, or willingness to cut difficult hair yet.",
                    "author": "LeauKey",
                    "id": "dxpfgim",
                    "parent_id": "t1_dxpd4rw",
                    "score": 15,
                    "created_utc": 1524264134.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "dxpqev4",
                            "parent_id": "t1_dxpfgim",
                            "score": 3,
                            "created_utc": 1524276759.0,
                            "replies": [
                                {
                                    "body": "https://imgur.com/a/a64G8ei\nA little dated, ngl, but it's low maintenance. \n\nLong in the front (2-3 inches), shorter on top to control volume/poofiness, sides and back faded up from a 0 or 0.5. I'm about a week and a half out, so the sides are a little grown out.\n\nAs an asian with *super* thick hair, my three options realistically are\n\n1. Kim Jong Un\n\n2. Hitler Youth wannabe\n\n3. K-pop star\n\n3 requires a fuckton of work and isn't for me. As a result, I landed somewhere between 1 and 2 depending on who you talk to. Not ideal, but it is what it is.",
                                    "author": "LeauKey",
                                    "id": "dxr5t8b",
                                    "parent_id": "t1_dxpqev4",
                                    "score": 2,
                                    "created_utc": 1524353173.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Yes. There’s probably more bad barbers than good out there. And that’s coming from a barber. \n\nAn important thing is if you find a good barber - stick with the guy. Don’t change anything. When you get a good cut, book an appointment a month in advance and the second time will be even better. ",
                    "author": null,
                    "id": "dxq09tg",
                    "parent_id": "t1_dxpd4rw",
                    "score": 3,
                    "created_utc": 1524291667.0,
                    "replies": [
                        {
                            "body": "How often do people get fades? Skin fades seem to only last me 2 weeks",
                            "author": "YouHaveToPullOutBro",
                            "id": "dxq2xsw",
                            "parent_id": "t1_dxq09tg",
                            "score": 1,
                            "created_utc": 1524297944.0,
                            "replies": [
                                {
                                    "body": "Depends, really. Some people last out a month. Some people 2 weeks. I have a deal with a few of my clients (friends) that they come without fail once in two weeks and I give them a discount. ",
                                    "author": null,
                                    "id": "dxq3zw5",
                                    "parent_id": "t1_dxq2xsw",
                                    "score": 2,
                                    "created_utc": 1524300762.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "I agree. Take places like cost cutters for example: you show them a picture of a traditional fade and they won’t know shit on how cut their hair like that. You literally have to explain it to them or ask people how you should explain it. ",
                    "author": null,
                    "id": "dxpjrzs",
                    "parent_id": "t1_dxpd4rw",
                    "score": 2,
                    "created_utc": 1524269148.0,
                    "replies": []
                },
                {
                    "body": "You need to understand that a barber is only as good as 2 things:\n\n1. Visualizing the haircut onto you  headshape as everyone have different shape of the head or hair type\n2. Familiar with the clients hair and type of cut. As in the first would be alright but typically the following cuts thereafter the initial are better.\n\nWhy do I know this? I cut my own hair and friends haircuts. Even though I cut my hair and some cousins for 6 years cutting friends hair I never did in the past provided is challenges, primarily the 2 I discussed. \n\nIf you don’t like the barbers haircut and are picky like me, I suggest you just learn to cut your own hair. It’s reward, though it will take some time going form a 2hr haircut to a 20min haircut clean fade and what not. ",
                    "author": "litepotion",
                    "id": "dxq0bzh",
                    "parent_id": "t1_dxpd4rw",
                    "score": 1,
                    "created_utc": 1524291796.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Also, just because you show them the picture doesn't mean that it's exactly what you'll get. My barber gave me a tip - when you get a haircut you REALLY like, take pictures of all angles, and bring those back in so they know what they're working with and what's attainable, as well as a picture of a desired cut. \n\nMany pictures posted asking this question are of models who had stylists. Product, blow dry, hairspray, placement etc. all play a role and you probably won't have your hair looking like that all day anyways. \n\nYour own hair qualities play a role as well. If you have thin, straight hair, don't bring in a picture of someone with thick, wavy hair. It won't happen (sea salt spray will only do so much), and you'll be disappointed. \n\nDetermine your hair type and texture, and look for styles that are in line with it. Also, don't be afraid to spend a little bit more on a haircut from time to time. Not saying you can't get a great cut for $10, but it doesn't hurt to splurge now and then. \n",
            "author": "HarvardHair",
            "id": "dxpfnsy",
            "parent_id": "t3_8dr43y",
            "score": 23,
            "created_utc": 1524264366.0,
            "replies": [
                {
                    "body": "Seconding all of this. I have been with the same barber for 3 years because they know my hair type and head/face shape in terms of what looks right, and we take pictures from multiple angles after a cut to keep a record of what works and what doesn’t. I pay £18, get a free rum & coke/beer, and walk out of there feeling like a handsome prince. It’s 100% worth it to try places until you find the barber that works well with you and gets your vibe. ",
                    "author": "Mixter_Ash",
                    "id": "dxpkmtr",
                    "parent_id": "t1_dxpfnsy",
                    "score": 6,
                    "created_utc": 1524270152.0,
                    "replies": [
                        {
                            "body": "Hey I’ve been looking for a trans friendly barber in the uk, this wouldn’t happen to be in or near the West Midlands would it? I’d love a recommendation, I had a terrible experience last time.",
                            "author": "brash_hopeful",
                            "id": "dxqaa1a",
                            "parent_id": "t1_dxpkmtr",
                            "score": 1,
                            "created_utc": 1524315448.0,
                            "replies": [
                                {
                                    "body": "I’m afraid not. It’s in Dundee, Scotland. If there is a local trans support group, they might be worth contacting for recommendations. \n\nThere’s also a movement called Safe In My Chair. They want to build a directory of trans-friendly barbers, stylists and salons. Their website wasn’t working last I checked, but they have a Twitter feed. ",
                                    "author": "Mixter_Ash",
                                    "id": "dxqcqno",
                                    "parent_id": "t1_dxqaa1a",
                                    "score": 2,
                                    "created_utc": 1524319127.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Thank you for talking about hair type. It’s just not possible to get some of the cuts you want. \n\nI have thick, but not course hair. It’s wavy too. So it automatically takes some cuts and shapes out once it gets any length. Too short and it won’t look as good as some short cuts I’d like to have without using much heavier product. \n\nOnce someone admits their hair type, they’ll find they get much better cuts. ",
                    "author": "gmasterson",
                    "id": "dxpnu2w",
                    "parent_id": "t1_dxpfnsy",
                    "score": 3,
                    "created_utc": 1524273867.0,
                    "replies": []
                },
                {
                    "body": "What do you do when you don't ever get a haircut that you really like :( I know what I want and I can visualize it on my own head but I never get it. I even show pics very close to what I want but it's never exactly there. I feel like every barber I've went to (at least 6 by now) just don't think it's possible or maybe they all follow suit from the barber before :(",
                    "author": "someoneinsignificant",
                    "id": "dxq3xxx",
                    "parent_id": "t1_dxpfnsy",
                    "score": 1,
                    "created_utc": 1524300609.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "The first time I did this it was awkward, but after that I realized the person cutting my hair seemed to appreciate it. When you get a good haircut once you can just take a selfie instead of having to show them a picture of a random person which makes it even easier. Just make sure you are showing the person cutting your hair something within reason. A haircut that works for a model or brad pitt probably won't work for someone who isn't as attractive or doesn't have similar features. ",
            "author": "chacer98",
            "id": "dxpqpar",
            "parent_id": "t3_8dr43y",
            "score": 7,
            "created_utc": 1524277094.0,
            "replies": []
        },
        {
            "body": "Not the best advice. A lot of barbers hate this because it leaves an unrealistic expectation. Half the photos barbers see are the ones in the banner in this sub, which are professional shots of people who sat in a chair for hours to get their hair literally perfect, yet people expect their barber to do the same cut within their 30 minute time slot. \n\nPeople also don't understand that there are different hair types, and the likelyhood your haircut will look just as good as the one in the picture is really small simply because you may have thicker, curlier, shorter, longer, hair. Just work with what looks best with your head shape and your over all style. ALSO, do NOT get a haircut  that looks absolutely styled if you plan on putting 0 effort into your hair. People don't wake up with their shit perfect, ifyou want longer hair that looks even remotely like the guys in the photos in the banner on this sub, expect to put some effort in.",
            "author": "NJ_Mets_Fan",
            "id": "dxqegvq",
            "parent_id": "t3_8dr43y",
            "score": 4,
            "created_utc": 1524321505.0,
            "replies": []
        },
        {
            "body": "Texture of hair and professional stylist make a models hair. It’s never going to be the same.",
            "author": "cap826",
            "id": "dxpnmms",
            "parent_id": "t3_8dr43y",
            "score": 3,
            "created_utc": 1524273638.0,
            "replies": [
                {
                    "body": "Not quite, no.  But you can get 80% of the way there with a good cut, decent products, and practice. ",
                    "author": "NSA_Chatbot",
                    "id": "dxqivj0",
                    "parent_id": "t1_dxpnmms",
                    "score": 1,
                    "created_utc": 1524326932.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "It needs to change to \"i like this haircut\" for inspiration pictures ",
            "author": "Worst_Lurker",
            "id": "dxpg50c",
            "parent_id": "t3_8dr43y",
            "score": 2,
            "created_utc": 1524264910.0,
            "replies": []
        },
        {
            "body": "Hahahahah I couldn’t agree more 😂",
            "author": "thomasinaction",
            "id": "dxq0dvz",
            "parent_id": "t3_8dr43y",
            "score": 2,
            "created_utc": 1524291913.0,
            "replies": []
        },
        {
            "body": "Stop with this shitty just show a picture advice. It helps to describe it. A lot of times you just show them a picture then they just do what they want and don’t follow it. ",
            "author": "YouHaveToPullOutBro",
            "id": "dxq2vu9",
            "parent_id": "t3_8dr43y",
            "score": 0,
            "created_utc": 1524297804.0,
            "replies": [
                {
                    "body": "go to a different barber. if your barber is doing what he wants, dont pay and go somewhere else",
                    "author": "DuhSpecialWaan",
                    "id": "dxq8hl3",
                    "parent_id": "t1_dxq2vu9",
                    "score": 2,
                    "created_utc": 1524312127.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Or, you could do what I do which is to show the picture combined with some more specific instructions ... which requires knowledge of barber lingo?",
            "author": null,
            "id": "dxpgke7",
            "parent_id": "t3_8dr43y",
            "score": -2,
            "created_utc": 1524265406.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "dxpnkdb",
            "parent_id": "t1_dxpd4rw",
            "score": 23,
            "created_utc": 1524273566.0,
            "replies": [
                {
                    "body": "Noted. But the haircut I wanted wasn’t even too complex. Sides short but not faded or too short, just slightly shorter than top, and the top of my hair cut slightly, with bangs that come down to my eye brows. I showed the picture, and yet I came out with the back of my hair 4 inches and front under 1. ",
                    "author": "Fapstronaught69",
                    "id": "dxpo36b",
                    "parent_id": "t1_dxpnkdb",
                    "score": 3,
                    "created_utc": 1524274151.0,
                    "replies": [
                        {
                            "body": "Ok so do you think telling that particular barber would have yielded better results? Did y’all not talk about it at all? I have a hard time imagining you walking in all silent, showing him the picture and sitting down without a word.\n\nIn order to guarantee you’ll get a good cut you need to go to a good, reputable place. Not to put a price on quality but usually these places charge $25-35 for a haircut. ",
                            "author": "HeyJustWantedToSay",
                            "id": "dxpyyn9",
                            "parent_id": "t1_dxpo36b",
                            "score": 4,
                            "created_utc": 1524289009.0,
                            "replies": [
                                {
                                    "body": "I’m good with that price but how do I find a good place? What happened was I walked in showed the picture he said idk I might be able to make it look better I might not and I said I just needed it to be as good and he said I think I can do that. 40 minutes later I thought he was done I said can you cut the front a little bit? He said I’m not done. 30 minutes from then he started on the front l, but on the first cut he took 4 inches off the 4.75 inches. And at that point I said that’s too short he said you said cut it a little bit and I did, I’m like that’s way too much. Then I payed and left. He did not communicate. And I noticed he fucked up when he took off 4 inches in one cut and at that point it was too late. I’m about to just start going to salons.",
                                    "author": "Fapstronaught69",
                                    "id": "dxpzhty",
                                    "parent_id": "t1_dxpyyn9",
                                    "score": 1,
                                    "created_utc": 1524290061.0,
                                    "replies": [
                                        {
                                            "body": "4 out of nearly 5 inches in one go? that makes me cringe just reading that holy shit I'd be so upset",
                                            "author": "Pansy_Lad",
                                            "id": "dxpzrwl",
                                            "parent_id": "t1_dxpzhty",
                                            "score": 3,
                                            "created_utc": 1524290625.0,
                                            "replies": [
                                                {
                                                    "body": "Yea I should’ve left without paying. I need to find a new place that place is garbage. ",
                                                    "author": "Fapstronaught69",
                                                    "id": "dxq05cy",
                                                    "parent_id": "t1_dxpzrwl",
                                                    "score": 1,
                                                    "created_utc": 1524291410.0,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "body": "I feel you, I had something similar happen to me at my regular place, by my non-regular stylist. He was trimming my sides for an undercut. I closed my eyes because the hair was flying around and going in. I feel him go towards my temple. Open my eyes to see that the guy had receded my hairline in that single second. I asked him why he pushed the trimmer so far up. \"Let me finish the rest, it will look better than the picture\". Now, a month later, I have this weird line of very short hair which is my actual hairline, and longer hair (around 3 inches) behind that. I was actually happy with that place and my regular stylist. Sometimes, you can't win. ",
                                            "author": "wulfschtagg",
                                            "id": "dxq4j65",
                                            "parent_id": "t1_dxpzhty",
                                            "score": 2,
                                            "created_utc": 1524302256.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Preferably one that serves you booze.",
                    "author": "aperture413",
                    "id": "dxq7qcx",
                    "parent_id": "t1_dxpnkdb",
                    "score": 1,
                    "created_utc": 1524310527.0,
                    "replies": []
                },
                {
                    "body": "So for a new style go to a salon and to maintain it go to a barber? ",
                    "author": "YouHaveToPullOutBro",
                    "id": "dxq2xbo",
                    "parent_id": "t1_dxpnkdb",
                    "score": 0,
                    "created_utc": 1524297909.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I agree, but a lot of the time it's a more complex mixture of inexperience, unwillingness, or even impossibility.\n\nMy hair, for instance, is *brutally* thick. While a fade shows up very nicely, I'd need to get a perm and spend an hour every day styling my hair to get 4/5 haircuts on the topbar. It's just not worth it since my hair grows so fast I need to get it cut every 2 weeks.\n\nOn the other hand, I do agree with you - I've gone to stylists/barbers with pictures of my own hair (after a good cut) and they've fucked it up so bad I never went back. The desired results are absolutely possible, but they just don't have the experience, ability, or willingness to cut difficult hair yet.",
            "author": "LeauKey",
            "id": "dxpfgim",
            "parent_id": "t1_dxpd4rw",
            "score": 15,
            "created_utc": 1524264134.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "dxpqev4",
                    "parent_id": "t1_dxpfgim",
                    "score": 3,
                    "created_utc": 1524276759.0,
                    "replies": [
                        {
                            "body": "https://imgur.com/a/a64G8ei\nA little dated, ngl, but it's low maintenance. \n\nLong in the front (2-3 inches), shorter on top to control volume/poofiness, sides and back faded up from a 0 or 0.5. I'm about a week and a half out, so the sides are a little grown out.\n\nAs an asian with *super* thick hair, my three options realistically are\n\n1. Kim Jong Un\n\n2. Hitler Youth wannabe\n\n3. K-pop star\n\n3 requires a fuckton of work and isn't for me. As a result, I landed somewhere between 1 and 2 depending on who you talk to. Not ideal, but it is what it is.",
                            "author": "LeauKey",
                            "id": "dxr5t8b",
                            "parent_id": "t1_dxpqev4",
                            "score": 2,
                            "created_utc": 1524353173.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yes. There’s probably more bad barbers than good out there. And that’s coming from a barber. \n\nAn important thing is if you find a good barber - stick with the guy. Don’t change anything. When you get a good cut, book an appointment a month in advance and the second time will be even better. ",
            "author": null,
            "id": "dxq09tg",
            "parent_id": "t1_dxpd4rw",
            "score": 3,
            "created_utc": 1524291667.0,
            "replies": [
                {
                    "body": "How often do people get fades? Skin fades seem to only last me 2 weeks",
                    "author": "YouHaveToPullOutBro",
                    "id": "dxq2xsw",
                    "parent_id": "t1_dxq09tg",
                    "score": 1,
                    "created_utc": 1524297944.0,
                    "replies": [
                        {
                            "body": "Depends, really. Some people last out a month. Some people 2 weeks. I have a deal with a few of my clients (friends) that they come without fail once in two weeks and I give them a discount. ",
                            "author": null,
                            "id": "dxq3zw5",
                            "parent_id": "t1_dxq2xsw",
                            "score": 2,
                            "created_utc": 1524300762.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I agree. Take places like cost cutters for example: you show them a picture of a traditional fade and they won’t know shit on how cut their hair like that. You literally have to explain it to them or ask people how you should explain it. ",
            "author": null,
            "id": "dxpjrzs",
            "parent_id": "t1_dxpd4rw",
            "score": 2,
            "created_utc": 1524269148.0,
            "replies": []
        },
        {
            "body": "You need to understand that a barber is only as good as 2 things:\n\n1. Visualizing the haircut onto you  headshape as everyone have different shape of the head or hair type\n2. Familiar with the clients hair and type of cut. As in the first would be alright but typically the following cuts thereafter the initial are better.\n\nWhy do I know this? I cut my own hair and friends haircuts. Even though I cut my hair and some cousins for 6 years cutting friends hair I never did in the past provided is challenges, primarily the 2 I discussed. \n\nIf you don’t like the barbers haircut and are picky like me, I suggest you just learn to cut your own hair. It’s reward, though it will take some time going form a 2hr haircut to a 20min haircut clean fade and what not. ",
            "author": "litepotion",
            "id": "dxq0bzh",
            "parent_id": "t1_dxpd4rw",
            "score": 1,
            "created_utc": 1524291796.0,
            "replies": []
        },
        {
            "body": "Seconding all of this. I have been with the same barber for 3 years because they know my hair type and head/face shape in terms of what looks right, and we take pictures from multiple angles after a cut to keep a record of what works and what doesn’t. I pay £18, get a free rum & coke/beer, and walk out of there feeling like a handsome prince. It’s 100% worth it to try places until you find the barber that works well with you and gets your vibe. ",
            "author": "Mixter_Ash",
            "id": "dxpkmtr",
            "parent_id": "t1_dxpfnsy",
            "score": 6,
            "created_utc": 1524270152.0,
            "replies": [
                {
                    "body": "Hey I’ve been looking for a trans friendly barber in the uk, this wouldn’t happen to be in or near the West Midlands would it? I’d love a recommendation, I had a terrible experience last time.",
                    "author": "brash_hopeful",
                    "id": "dxqaa1a",
                    "parent_id": "t1_dxpkmtr",
                    "score": 1,
                    "created_utc": 1524315448.0,
                    "replies": [
                        {
                            "body": "I’m afraid not. It’s in Dundee, Scotland. If there is a local trans support group, they might be worth contacting for recommendations. \n\nThere’s also a movement called Safe In My Chair. They want to build a directory of trans-friendly barbers, stylists and salons. Their website wasn’t working last I checked, but they have a Twitter feed. ",
                            "author": "Mixter_Ash",
                            "id": "dxqcqno",
                            "parent_id": "t1_dxqaa1a",
                            "score": 2,
                            "created_utc": 1524319127.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Thank you for talking about hair type. It’s just not possible to get some of the cuts you want. \n\nI have thick, but not course hair. It’s wavy too. So it automatically takes some cuts and shapes out once it gets any length. Too short and it won’t look as good as some short cuts I’d like to have without using much heavier product. \n\nOnce someone admits their hair type, they’ll find they get much better cuts. ",
            "author": "gmasterson",
            "id": "dxpnu2w",
            "parent_id": "t1_dxpfnsy",
            "score": 3,
            "created_utc": 1524273867.0,
            "replies": []
        },
        {
            "body": "What do you do when you don't ever get a haircut that you really like :( I know what I want and I can visualize it on my own head but I never get it. I even show pics very close to what I want but it's never exactly there. I feel like every barber I've went to (at least 6 by now) just don't think it's possible or maybe they all follow suit from the barber before :(",
            "author": "someoneinsignificant",
            "id": "dxq3xxx",
            "parent_id": "t1_dxpfnsy",
            "score": 1,
            "created_utc": 1524300609.0,
            "replies": []
        },
        {
            "body": "Not quite, no.  But you can get 80% of the way there with a good cut, decent products, and practice. ",
            "author": "NSA_Chatbot",
            "id": "dxqivj0",
            "parent_id": "t1_dxpnmms",
            "score": 1,
            "created_utc": 1524326932.0,
            "replies": []
        },
        {
            "body": "go to a different barber. if your barber is doing what he wants, dont pay and go somewhere else",
            "author": "DuhSpecialWaan",
            "id": "dxq8hl3",
            "parent_id": "t1_dxq2vu9",
            "score": 2,
            "created_utc": 1524312127.0,
            "replies": []
        },
        {
            "body": "Noted. But the haircut I wanted wasn’t even too complex. Sides short but not faded or too short, just slightly shorter than top, and the top of my hair cut slightly, with bangs that come down to my eye brows. I showed the picture, and yet I came out with the back of my hair 4 inches and front under 1. ",
            "author": "Fapstronaught69",
            "id": "dxpo36b",
            "parent_id": "t1_dxpnkdb",
            "score": 3,
            "created_utc": 1524274151.0,
            "replies": [
                {
                    "body": "Ok so do you think telling that particular barber would have yielded better results? Did y’all not talk about it at all? I have a hard time imagining you walking in all silent, showing him the picture and sitting down without a word.\n\nIn order to guarantee you’ll get a good cut you need to go to a good, reputable place. Not to put a price on quality but usually these places charge $25-35 for a haircut. ",
                    "author": "HeyJustWantedToSay",
                    "id": "dxpyyn9",
                    "parent_id": "t1_dxpo36b",
                    "score": 4,
                    "created_utc": 1524289009.0,
                    "replies": [
                        {
                            "body": "I’m good with that price but how do I find a good place? What happened was I walked in showed the picture he said idk I might be able to make it look better I might not and I said I just needed it to be as good and he said I think I can do that. 40 minutes later I thought he was done I said can you cut the front a little bit? He said I’m not done. 30 minutes from then he started on the front l, but on the first cut he took 4 inches off the 4.75 inches. And at that point I said that’s too short he said you said cut it a little bit and I did, I’m like that’s way too much. Then I payed and left. He did not communicate. And I noticed he fucked up when he took off 4 inches in one cut and at that point it was too late. I’m about to just start going to salons.",
                            "author": "Fapstronaught69",
                            "id": "dxpzhty",
                            "parent_id": "t1_dxpyyn9",
                            "score": 1,
                            "created_utc": 1524290061.0,
                            "replies": [
                                {
                                    "body": "4 out of nearly 5 inches in one go? that makes me cringe just reading that holy shit I'd be so upset",
                                    "author": "Pansy_Lad",
                                    "id": "dxpzrwl",
                                    "parent_id": "t1_dxpzhty",
                                    "score": 3,
                                    "created_utc": 1524290625.0,
                                    "replies": [
                                        {
                                            "body": "Yea I should’ve left without paying. I need to find a new place that place is garbage. ",
                                            "author": "Fapstronaught69",
                                            "id": "dxq05cy",
                                            "parent_id": "t1_dxpzrwl",
                                            "score": 1,
                                            "created_utc": 1524291410.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "I feel you, I had something similar happen to me at my regular place, by my non-regular stylist. He was trimming my sides for an undercut. I closed my eyes because the hair was flying around and going in. I feel him go towards my temple. Open my eyes to see that the guy had receded my hairline in that single second. I asked him why he pushed the trimmer so far up. \"Let me finish the rest, it will look better than the picture\". Now, a month later, I have this weird line of very short hair which is my actual hairline, and longer hair (around 3 inches) behind that. I was actually happy with that place and my regular stylist. Sometimes, you can't win. ",
                                    "author": "wulfschtagg",
                                    "id": "dxq4j65",
                                    "parent_id": "t1_dxpzhty",
                                    "score": 2,
                                    "created_utc": 1524302256.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Preferably one that serves you booze.",
            "author": "aperture413",
            "id": "dxq7qcx",
            "parent_id": "t1_dxpnkdb",
            "score": 1,
            "created_utc": 1524310527.0,
            "replies": []
        },
        {
            "body": "So for a new style go to a salon and to maintain it go to a barber? ",
            "author": "YouHaveToPullOutBro",
            "id": "dxq2xbo",
            "parent_id": "t1_dxpnkdb",
            "score": 0,
            "created_utc": 1524297909.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "dxpqev4",
            "parent_id": "t1_dxpfgim",
            "score": 3,
            "created_utc": 1524276759.0,
            "replies": [
                {
                    "body": "https://imgur.com/a/a64G8ei\nA little dated, ngl, but it's low maintenance. \n\nLong in the front (2-3 inches), shorter on top to control volume/poofiness, sides and back faded up from a 0 or 0.5. I'm about a week and a half out, so the sides are a little grown out.\n\nAs an asian with *super* thick hair, my three options realistically are\n\n1. Kim Jong Un\n\n2. Hitler Youth wannabe\n\n3. K-pop star\n\n3 requires a fuckton of work and isn't for me. As a result, I landed somewhere between 1 and 2 depending on who you talk to. Not ideal, but it is what it is.",
                    "author": "LeauKey",
                    "id": "dxr5t8b",
                    "parent_id": "t1_dxpqev4",
                    "score": 2,
                    "created_utc": 1524353173.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "How often do people get fades? Skin fades seem to only last me 2 weeks",
            "author": "YouHaveToPullOutBro",
            "id": "dxq2xsw",
            "parent_id": "t1_dxq09tg",
            "score": 1,
            "created_utc": 1524297944.0,
            "replies": [
                {
                    "body": "Depends, really. Some people last out a month. Some people 2 weeks. I have a deal with a few of my clients (friends) that they come without fail once in two weeks and I give them a discount. ",
                    "author": null,
                    "id": "dxq3zw5",
                    "parent_id": "t1_dxq2xsw",
                    "score": 2,
                    "created_utc": 1524300762.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Hey I’ve been looking for a trans friendly barber in the uk, this wouldn’t happen to be in or near the West Midlands would it? I’d love a recommendation, I had a terrible experience last time.",
            "author": "brash_hopeful",
            "id": "dxqaa1a",
            "parent_id": "t1_dxpkmtr",
            "score": 1,
            "created_utc": 1524315448.0,
            "replies": [
                {
                    "body": "I’m afraid not. It’s in Dundee, Scotland. If there is a local trans support group, they might be worth contacting for recommendations. \n\nThere’s also a movement called Safe In My Chair. They want to build a directory of trans-friendly barbers, stylists and salons. Their website wasn’t working last I checked, but they have a Twitter feed. ",
                    "author": "Mixter_Ash",
                    "id": "dxqcqno",
                    "parent_id": "t1_dxqaa1a",
                    "score": 2,
                    "created_utc": 1524319127.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Ok so do you think telling that particular barber would have yielded better results? Did y’all not talk about it at all? I have a hard time imagining you walking in all silent, showing him the picture and sitting down without a word.\n\nIn order to guarantee you’ll get a good cut you need to go to a good, reputable place. Not to put a price on quality but usually these places charge $25-35 for a haircut. ",
            "author": "HeyJustWantedToSay",
            "id": "dxpyyn9",
            "parent_id": "t1_dxpo36b",
            "score": 4,
            "created_utc": 1524289009.0,
            "replies": [
                {
                    "body": "I’m good with that price but how do I find a good place? What happened was I walked in showed the picture he said idk I might be able to make it look better I might not and I said I just needed it to be as good and he said I think I can do that. 40 minutes later I thought he was done I said can you cut the front a little bit? He said I’m not done. 30 minutes from then he started on the front l, but on the first cut he took 4 inches off the 4.75 inches. And at that point I said that’s too short he said you said cut it a little bit and I did, I’m like that’s way too much. Then I payed and left. He did not communicate. And I noticed he fucked up when he took off 4 inches in one cut and at that point it was too late. I’m about to just start going to salons.",
                    "author": "Fapstronaught69",
                    "id": "dxpzhty",
                    "parent_id": "t1_dxpyyn9",
                    "score": 1,
                    "created_utc": 1524290061.0,
                    "replies": [
                        {
                            "body": "4 out of nearly 5 inches in one go? that makes me cringe just reading that holy shit I'd be so upset",
                            "author": "Pansy_Lad",
                            "id": "dxpzrwl",
                            "parent_id": "t1_dxpzhty",
                            "score": 3,
                            "created_utc": 1524290625.0,
                            "replies": [
                                {
                                    "body": "Yea I should’ve left without paying. I need to find a new place that place is garbage. ",
                                    "author": "Fapstronaught69",
                                    "id": "dxq05cy",
                                    "parent_id": "t1_dxpzrwl",
                                    "score": 1,
                                    "created_utc": 1524291410.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "I feel you, I had something similar happen to me at my regular place, by my non-regular stylist. He was trimming my sides for an undercut. I closed my eyes because the hair was flying around and going in. I feel him go towards my temple. Open my eyes to see that the guy had receded my hairline in that single second. I asked him why he pushed the trimmer so far up. \"Let me finish the rest, it will look better than the picture\". Now, a month later, I have this weird line of very short hair which is my actual hairline, and longer hair (around 3 inches) behind that. I was actually happy with that place and my regular stylist. Sometimes, you can't win. ",
                            "author": "wulfschtagg",
                            "id": "dxq4j65",
                            "parent_id": "t1_dxpzhty",
                            "score": 2,
                            "created_utc": 1524302256.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "https://imgur.com/a/a64G8ei\nA little dated, ngl, but it's low maintenance. \n\nLong in the front (2-3 inches), shorter on top to control volume/poofiness, sides and back faded up from a 0 or 0.5. I'm about a week and a half out, so the sides are a little grown out.\n\nAs an asian with *super* thick hair, my three options realistically are\n\n1. Kim Jong Un\n\n2. Hitler Youth wannabe\n\n3. K-pop star\n\n3 requires a fuckton of work and isn't for me. As a result, I landed somewhere between 1 and 2 depending on who you talk to. Not ideal, but it is what it is.",
            "author": "LeauKey",
            "id": "dxr5t8b",
            "parent_id": "t1_dxpqev4",
            "score": 2,
            "created_utc": 1524353173.0,
            "replies": []
        },
        {
            "body": "Depends, really. Some people last out a month. Some people 2 weeks. I have a deal with a few of my clients (friends) that they come without fail once in two weeks and I give them a discount. ",
            "author": null,
            "id": "dxq3zw5",
            "parent_id": "t1_dxq2xsw",
            "score": 2,
            "created_utc": 1524300762.0,
            "replies": []
        },
        {
            "body": "I’m afraid not. It’s in Dundee, Scotland. If there is a local trans support group, they might be worth contacting for recommendations. \n\nThere’s also a movement called Safe In My Chair. They want to build a directory of trans-friendly barbers, stylists and salons. Their website wasn’t working last I checked, but they have a Twitter feed. ",
            "author": "Mixter_Ash",
            "id": "dxqcqno",
            "parent_id": "t1_dxqaa1a",
            "score": 2,
            "created_utc": 1524319127.0,
            "replies": []
        },
        {
            "body": "I’m good with that price but how do I find a good place? What happened was I walked in showed the picture he said idk I might be able to make it look better I might not and I said I just needed it to be as good and he said I think I can do that. 40 minutes later I thought he was done I said can you cut the front a little bit? He said I’m not done. 30 minutes from then he started on the front l, but on the first cut he took 4 inches off the 4.75 inches. And at that point I said that’s too short he said you said cut it a little bit and I did, I’m like that’s way too much. Then I payed and left. He did not communicate. And I noticed he fucked up when he took off 4 inches in one cut and at that point it was too late. I’m about to just start going to salons.",
            "author": "Fapstronaught69",
            "id": "dxpzhty",
            "parent_id": "t1_dxpyyn9",
            "score": 1,
            "created_utc": 1524290061.0,
            "replies": [
                {
                    "body": "4 out of nearly 5 inches in one go? that makes me cringe just reading that holy shit I'd be so upset",
                    "author": "Pansy_Lad",
                    "id": "dxpzrwl",
                    "parent_id": "t1_dxpzhty",
                    "score": 3,
                    "created_utc": 1524290625.0,
                    "replies": [
                        {
                            "body": "Yea I should’ve left without paying. I need to find a new place that place is garbage. ",
                            "author": "Fapstronaught69",
                            "id": "dxq05cy",
                            "parent_id": "t1_dxpzrwl",
                            "score": 1,
                            "created_utc": 1524291410.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "I feel you, I had something similar happen to me at my regular place, by my non-regular stylist. He was trimming my sides for an undercut. I closed my eyes because the hair was flying around and going in. I feel him go towards my temple. Open my eyes to see that the guy had receded my hairline in that single second. I asked him why he pushed the trimmer so far up. \"Let me finish the rest, it will look better than the picture\". Now, a month later, I have this weird line of very short hair which is my actual hairline, and longer hair (around 3 inches) behind that. I was actually happy with that place and my regular stylist. Sometimes, you can't win. ",
                    "author": "wulfschtagg",
                    "id": "dxq4j65",
                    "parent_id": "t1_dxpzhty",
                    "score": 2,
                    "created_utc": 1524302256.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "4 out of nearly 5 inches in one go? that makes me cringe just reading that holy shit I'd be so upset",
            "author": "Pansy_Lad",
            "id": "dxpzrwl",
            "parent_id": "t1_dxpzhty",
            "score": 3,
            "created_utc": 1524290625.0,
            "replies": [
                {
                    "body": "Yea I should’ve left without paying. I need to find a new place that place is garbage. ",
                    "author": "Fapstronaught69",
                    "id": "dxq05cy",
                    "parent_id": "t1_dxpzrwl",
                    "score": 1,
                    "created_utc": 1524291410.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I feel you, I had something similar happen to me at my regular place, by my non-regular stylist. He was trimming my sides for an undercut. I closed my eyes because the hair was flying around and going in. I feel him go towards my temple. Open my eyes to see that the guy had receded my hairline in that single second. I asked him why he pushed the trimmer so far up. \"Let me finish the rest, it will look better than the picture\". Now, a month later, I have this weird line of very short hair which is my actual hairline, and longer hair (around 3 inches) behind that. I was actually happy with that place and my regular stylist. Sometimes, you can't win. ",
            "author": "wulfschtagg",
            "id": "dxq4j65",
            "parent_id": "t1_dxpzhty",
            "score": 2,
            "created_utc": 1524302256.0,
            "replies": []
        },
        {
            "body": "Yea I should’ve left without paying. I need to find a new place that place is garbage. ",
            "author": "Fapstronaught69",
            "id": "dxq05cy",
            "parent_id": "t1_dxpzrwl",
            "score": 1,
            "created_utc": 1524291410.0,
            "replies": []
        }
    ]
}