{
    "title": "What type of product does Chris Evans have in this hairstyle?",
    "post_id": "hti0y0",
    "post_url": "https://www.reddit.com/r/malehairadvice/comments/hti0y0/what_type_of_product_does_chris_evans_have_in/",
    "author": "kingkrool57",
    "body": "",
    "url": "https://i.redd.it/o02ncac0smb51.jpg",
    "score": 472,
    "upvote_ratio": 0.99,
    "created_utc": 1595084626.0,
    "num_comments": 79,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "There was a post in one of these subreddits about two or so months ago that talked about how pretty much every red-carpet-look is basically just Brylcreem, either original or original with protein, because it has a light hold but also oils the hair, giving a much better look than most high-hold gels and sprays.",
            "author": "Neknoh",
            "id": "fygxteo",
            "parent_id": "t3_hti0y0",
            "score": 272,
            "created_utc": 1595086815.0,
            "replies": [
                {
                    "body": "What Brylcreem exactly? I had never heard that before",
                    "author": "sheikonfleek",
                    "id": "fyh9o2o",
                    "parent_id": "t1_fygxteo",
                    "score": 90,
                    "created_utc": 1595093406.0,
                    "replies": [
                        {
                            "body": "It's one of the oldest pommades, it's basically mineral oils with beeswax and it just works wonders for the hair. They have two that are the basic ones: Original and Original with added protein, so I would pick up either one of those and try it.",
                            "author": "Neknoh",
                            "id": "fyhao5x",
                            "parent_id": "t1_fyh9o2o",
                            "score": 93,
                            "created_utc": 1595093959.0,
                            "replies": [
                                {
                                    "body": "It’s fairly affordable on Amazon, I’ll have to give it a try",
                                    "author": "sheikonfleek",
                                    "id": "fyhaslv",
                                    "parent_id": "t1_fyhao5x",
                                    "score": 37,
                                    "created_utc": 1595094026.0,
                                    "replies": [
                                        {
                                            "body": "Yeah, it's a light hold, so needs more for a slicker look, but honestly, just a little bit comped into the hair is probably the best styling I've had.",
                                            "author": "Neknoh",
                                            "id": "fyhdsgp",
                                            "parent_id": "t1_fyhaslv",
                                            "score": 27,
                                            "created_utc": 1595095632.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "Should I get the gel or the 3 in 1?",
                                    "author": "itisallgoodyouknow",
                                    "id": "fyhm519",
                                    "parent_id": "t1_fyhao5x",
                                    "score": 10,
                                    "created_utc": 1595100197.0,
                                    "replies": [
                                        {
                                            "body": "This is the one I'm using\nhttps://www.pricerunner.se/product/640x640/1684651518/Brylcreem-Original-Light-Glossy-Hold-Protein-Enriched-150ml.jpg\n\nJust classic, old-school brylcreem",
                                            "author": "Neknoh",
                                            "id": "fyhpk8t",
                                            "parent_id": "t1_fyhm519",
                                            "score": 17,
                                            "created_utc": 1595102113.0,
                                            "replies": [
                                                {
                                                    "body": "Can i see a pic of your hair? Please :)",
                                                    "author": "itisallgoodyouknow",
                                                    "id": "fyhrqm2",
                                                    "parent_id": "t1_fyhpk8t",
                                                    "score": 5,
                                                    "created_utc": 1595103309.0,
                                                    "replies": [
                                                        {
                                                            "body": "Curly and super frissy hair  \n\n\nThis is without:   [https://gyazo.com/138459375546b16dc28e9bfb6eb5e471](https://gyazo.com/138459375546b16dc28e9bfb6eb5e471) \n\nThis is with literally just a touch and no comb-work or anything:  [https://gyazo.com/0ccb0130a0b4aa989121daeb2b597914](https://gyazo.com/0ccb0130a0b4aa989121daeb2b597914) \n\nThis is the day after (again, no combing or styling):  [https://gyazo.com/1d13bc7b5d0fb70613a7105ae0a3e13f](https://gyazo.com/1d13bc7b5d0fb70613a7105ae0a3e13f) \n\n&#x200B;\n\nBasically, it gives a light hold, gathers up your hair really nicely and gives it a nice and collected look. For me, it basically kills friss for about 24 hours and that's with using only a limited amount of the stuff. I don't really have the hair for a neat and straighter style (such as the one Evans has), but I think I could absolutely achieve my equivalent of it with maybe two globs of the stuff instead of one and some proper comb-work.\n\nIt also smells so damn nice, bees-wax and mineral oils.",
                                                            "author": "Neknoh",
                                                            "id": "fyhua8w",
                                                            "parent_id": "t1_fyhrqm2",
                                                            "score": 28,
                                                            "created_utc": 1595104699.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Dude thank you so much! About to order some of this. Nice hair btw",
                                                                    "author": "itisallgoodyouknow",
                                                                    "id": "fyhufqp",
                                                                    "parent_id": "t1_fyhua8w",
                                                                    "score": 7,
                                                                    "created_utc": 1595104786.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "No worries at all mate, it's been around for so damn long! I always thought it was going to be like, a tube of super greasy stuff, but it's a really light and fluffy mousse that isn't any oilier than, say, argan oil/silk drops or whatever but works so much better and gives styling options.\n\nTry it out and see what you think, experiment and see if you need like, just a tiny ammount or more of a glob of it. No idea what your hair is like or anything and can only speak for myself.",
                                                                            "author": "Neknoh",
                                                                            "id": "fyhv0uz",
                                                                            "parent_id": "t1_fyhufqp",
                                                                            "score": 11,
                                                                            "created_utc": 1595105113.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "body": "I use 3 different Gatsby products. Granted there a knockoff type and the actual (japanese?) product. I'll send a link to the ones I've been buying for years.\n\nOrange, gray and blue. Usually on ebay or amazon for 10 bucks each and has a G in the middle. The sticker has an asian guy with localized writing on it.\n\nI use the orange one mainly as it's a loose shuffle allowing me to have a soft hold and manipulate it thru the day. \n\nI use a tiny bit of the gray stuff to have a little extra hold on the side hairs that do their own thing. \n\nAnd I use blue occasionally if I want it to have a wet look. \n\nUsually I'll do it as the hair mostly dry and then comb and use the dryer to shape. After that holds for about 10 minutes I can play with it without losing much of the style.\n\nAgain everyones hair is diff and I'm no pro but overall this has given me a lot of the looks I like, similiar to Chris, and it handles my workload. Granted when I'm active and sweating it will depend on the styling I did becuase being in the heat a lot or getting it wet will throw it off so I always keep a few hats in the car. I can typically get my hair good to go in like 5 minutes though.\n\nI will try a few of the suggestions here though since I always like having options if I'm ever in a pinch and cant order my stuff quickly.",
                                            "author": "ThisFckinGuy",
                                            "id": "fyhwgun",
                                            "parent_id": "t1_fyhm519",
                                            "score": 3,
                                            "created_utc": 1595105915.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "fyhuae9",
                                    "parent_id": "t1_fyhao5x",
                                    "score": 3,
                                    "created_utc": 1595104701.0,
                                    "replies": [
                                        {
                                            "body": "It's been super easy to get out, again, it's oil and beeswax whipped to a light cream, it isn't sticky or anything. If you use a lot, it gets that sort of oily/fatty feel, but that IS also how pretty much the entire rockabilly scene got their hair done back in the day.\n\n(https://nostalgiacentral.com/pop-culture/fashion/brylcreem/)\n\nSo basically, too much and it gets a bit greasy, but nowhere near that sticky, half-dry, tacky and stale feeling that you get from gels or sprays, it just helps with the friss. I did it daily for a weak and my hair is WAY better now, even some two weeks after having forgotten to do it daily than it was before. Think of it as argan-oil or silk-drops or something else you just put into your hair after the shower, but it gives a light hold and some styling options as well.\n\nSo I would absolutely recommend to try it at least, usually 4-9 dollars depending on where you are, but like, it's worth a try.",
                                            "author": "Neknoh",
                                            "id": "fyhuuye",
                                            "parent_id": "t1_fyhuae9",
                                            "score": 5,
                                            "created_utc": 1595105021.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "It might help with the frizz. \n\nHave you tried argan or jojoba oil? I have medium thick hair that gets thinner and frizzier the longer I grow it out. I put a pea-size of amount of paul mitchell conditioner in my palm and add ONE drop of jojoba oil, mix it in my palms and work through to the tips of my damp hair. More than a drop and my hair looks oily. But one drop and it tames the frizz and gives it a nice sheen.",
                                            "author": "billbixbyakahulk",
                                            "id": "fyi515a",
                                            "parent_id": "t1_fyhuae9",
                                            "score": 1,
                                            "created_utc": 1595110837.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "No it looks like Pacinos creme",
                            "author": "toni8479",
                            "id": "fyhr6y1",
                            "parent_id": "t1_fyh9o2o",
                            "score": 0,
                            "created_utc": 1595103024.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "I remembet when Bryl cream was the matte of its era.",
                    "author": null,
                    "id": "fyhfrw5",
                    "parent_id": "t1_fygxteo",
                    "score": 7,
                    "created_utc": 1595096707.0,
                    "replies": []
                },
                {
                    "body": "What's funny is with all these new products coming out for men, this isn't just your dad's hair product, this is your granddad's. For some of you, it's your great-granddad's.\n\nSeveral years ago for Christmas, my dad (born in '42) got a gag gift from his sister. It was his high school pic and he was all bryl'd out, along with a tube of Brylcreem. My dad didn't miss a beat and [busted out the jingle](https://www.youtube.com/watch?v=o6F4GtyRfto) \"Brylcreem - a little dab'll do ya...\"",
                    "author": "billbixbyakahulk",
                    "id": "fyi3xrz",
                    "parent_id": "t1_fygxteo",
                    "score": 4,
                    "created_utc": 1595110208.0,
                    "replies": [
                        {
                            "body": "My grandfather (born 1935) went totally grey in his twenties but always had (and still has) enough hair to style with Brylcream, and has been for years and years. I don't use it myself (I have tight Celtic curls and getting bryl'd out is not the look I go for) but sometimes, it really is the older stuff that works.",
                            "author": "thacaoimhainngeidh",
                            "id": "fyjnuts",
                            "parent_id": "t1_fyi3xrz",
                            "score": 1,
                            "created_utc": 1595152628.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "do you know if there is a difference between the hair cream (tube) or the gel?",
                    "author": "AWhimsicalBird",
                    "id": "fyhylms",
                    "parent_id": "t1_fygxteo",
                    "score": 1,
                    "created_utc": 1595107132.0,
                    "replies": [
                        {
                            "body": "No idea, I use the tub, it says original on the box, only picked it up a few weeks ago",
                            "author": "Neknoh",
                            "id": "fyi4esr",
                            "parent_id": "t1_fyhylms",
                            "score": 1,
                            "created_utc": 1595110479.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Do you have the link to that post?",
                    "author": "Slash_BringingHasher",
                    "id": "fyi1qh1",
                    "parent_id": "t1_fygxteo",
                    "score": 1,
                    "created_utc": 1595108943.0,
                    "replies": [
                        {
                            "body": "Actually been trying to find it, I THINK it was on a picture of DiCaprio, fairly certain it was in malehairadvice, but could have been malegrooming or malefashionadvice",
                            "author": "Neknoh",
                            "id": "fyi4gsh",
                            "parent_id": "t1_fyi1qh1",
                            "score": 3,
                            "created_utc": 1595110510.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Thanks lol it’s 2am and I just hit purchase on amazon. Should be here tomorrow (:",
                    "author": "brightblueskies11",
                    "id": "fyjkvyr",
                    "parent_id": "t1_fygxteo",
                    "score": 1,
                    "created_utc": 1595149348.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Handsomeness",
            "author": "Captainium",
            "id": "fygvq3h",
            "parent_id": "t3_hti0y0",
            "score": 171,
            "created_utc": 1595085593.0,
            "replies": [
                {
                    "body": "how to achieve this?",
                    "author": "Eduwien",
                    "id": "fyh31h5",
                    "parent_id": "t1_fygvq3h",
                    "score": 33,
                    "created_utc": 1595089754.0,
                    "replies": [
                        {
                            "body": "Good genetics, we are out of luck",
                            "author": "speedy117",
                            "id": "fyh9srf",
                            "parent_id": "t1_fyh31h5",
                            "score": 20,
                            "created_utc": 1595093478.0,
                            "replies": [
                                {
                                    "body": "There have been a few posts on here that show that he has had a hair transplant. His hair genetics are not good.",
                                    "author": "helpmeimprove87",
                                    "id": "fyi6srk",
                                    "parent_id": "t1_fyh9srf",
                                    "score": 5,
                                    "created_utc": 1595111848.0,
                                    "replies": [
                                        {
                                            "body": "Is there any proof? This is the first time I'm hearing this. I mean sometimes you can tell, for example Elon Musk.",
                                            "author": "speedy117",
                                            "id": "fyiditf",
                                            "parent_id": "t1_fyi6srk",
                                            "score": 2,
                                            "created_utc": 1595115768.0,
                                            "replies": [
                                                {
                                                    "body": "Umm u could tell the difference if u watch his old work he has more receding hairline in them but I don't know for sure",
                                                    "author": "vansh_khatri1",
                                                    "id": "fyihwq7",
                                                    "parent_id": "t1_fyiditf",
                                                    "score": 6,
                                                    "created_utc": 1595118515.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Do you have it? No? Then you can never achieve it 😭😭😭",
                            "author": "maybeidontknowwhy",
                            "id": "fyh3fc2",
                            "parent_id": "t1_fyh31h5",
                            "score": 20,
                            "created_utc": 1595089966.0,
                            "replies": []
                        },
                        {
                            "body": "You'll need a time machine to go back and pick better parents.",
                            "author": "ChapsWorthington",
                            "id": "fyhmyr5",
                            "parent_id": "t1_fyh31h5",
                            "score": 2,
                            "created_utc": 1595100658.0,
                            "replies": []
                        },
                        {
                            "body": "Self care and surgery",
                            "author": null,
                            "id": "fyj1n2c",
                            "parent_id": "t1_fyh31h5",
                            "score": 1,
                            "created_utc": 1595131619.0,
                            "replies": []
                        },
                        {
                            "body": "Rule 1:  Be attractive\n\nRule 2:  don’t be unattractive",
                            "author": "Thepresocratic",
                            "id": "fyjbcig",
                            "parent_id": "t1_fyh31h5",
                            "score": 1,
                            "created_utc": 1595139583.0,
                            "replies": []
                        },
                        {
                            "body": "Try reincarnation",
                            "author": null,
                            "id": "fyhkusk",
                            "parent_id": "t1_fyh31h5",
                            "score": 0,
                            "created_utc": 1595099489.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Looks like a pomade",
            "author": "Sloths_Revenge-",
            "id": "fygx4q0",
            "parent_id": "t3_hti0y0",
            "score": 54,
            "created_utc": 1595086417.0,
            "replies": [
                {
                    "body": "Could be cream too",
                    "author": "vansh_khatri1",
                    "id": "fyihn8s",
                    "parent_id": "t1_fygx4q0",
                    "score": 2,
                    "created_utc": 1595118347.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Looks like pomade or brill cream to me. Probably pomade because of the strong hold",
            "author": "TheQuema",
            "id": "fyh0msk",
            "parent_id": "t3_hti0y0",
            "score": 20,
            "created_utc": 1595088416.0,
            "replies": []
        },
        {
            "body": "Money.",
            "author": null,
            "id": "fyh5w02",
            "parent_id": "t3_hti0y0",
            "score": 33,
            "created_utc": 1595091325.0,
            "replies": []
        },
        {
            "body": "I think he just lubes his hair up with the ejaculate of all the females he bangs",
            "author": null,
            "id": "fyh5tao",
            "parent_id": "t3_hti0y0",
            "score": 57,
            "created_utc": 1595091283.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "fyh806k",
                    "parent_id": "t1_fyh5tao",
                    "score": 13,
                    "created_utc": 1595092499.0,
                    "replies": [
                        {
                            "body": "very dilute piss at least lmao",
                            "author": "jei64",
                            "id": "fyjqgol",
                            "parent_id": "t1_fyh806k",
                            "score": 1,
                            "created_utc": 1595155507.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "fyh6egt",
                    "parent_id": "t1_fyh5tao",
                    "score": 19,
                    "created_utc": 1595091609.0,
                    "replies": [
                        {
                            "body": "gotta hit the right spots 👅",
                            "author": null,
                            "id": "fyhks4o",
                            "parent_id": "t1_fyh6egt",
                            "score": 14,
                            "created_utc": 1595099449.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "fyhkwxf",
                                    "parent_id": "t1_fyhks4o",
                                    "score": -10,
                                    "created_utc": 1595099520.0,
                                    "replies": [
                                        {
                                            "body": "https://www.healthline.com/health/healthy-sex/female-ejaculation#overview",
                                            "author": null,
                                            "id": "fyhl330",
                                            "parent_id": "t1_fyhkwxf",
                                            "score": 10,
                                            "created_utc": 1595099614.0,
                                            "replies": [
                                                {
                                                    "body": "[deleted]",
                                                    "author": null,
                                                    "id": "fyhn6qy",
                                                    "parent_id": "t1_fyhl330",
                                                    "score": -20,
                                                    "created_utc": 1595100782.0,
                                                    "replies": [
                                                        {
                                                            "body": "Ejaculate just means \"thing that gets ejected\"",
                                                            "author": "Pyroven",
                                                            "id": "fyigrfb",
                                                            "parent_id": "t1_fyhn6qy",
                                                            "score": 8,
                                                            "created_utc": 1595117786.0,
                                                            "replies": []
                                                        },
                                                        {
                                                            "body": "Proof yet again that any Reddit post is exactly two degrees of comments from a semantic argument over ejaculation.",
                                                            "author": "TimFTWin",
                                                            "id": "fyi8bib",
                                                            "parent_id": "t1_fyhn6qy",
                                                            "score": 7,
                                                            "created_utc": 1595112703.0,
                                                            "replies": [
                                                                {
                                                                    "body": "I'd give ya an award if I wasn't broke bruv thanks for the laugh",
                                                                    "author": null,
                                                                    "id": "fyjarn9",
                                                                    "parent_id": "t1_fyi8bib",
                                                                    "score": 1,
                                                                    "created_utc": 1595139050.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "body": "I think that's more a product of male ignorance though, I don't want to go full-blown feminist but it's not like historically the female orgasm has been valued or even known to occur. try looking up the definition of the word squirt, words aren't bound by the dictionary, unless you have a better word for what women do when ya know what to do I don't see how ejaculate would be incorrect.",
                                                            "author": null,
                                                            "id": "fyhoxoj",
                                                            "parent_id": "t1_fyhn6qy",
                                                            "score": 1,
                                                            "created_utc": 1595101759.0,
                                                            "replies": [
                                                                {
                                                                    "body": "[deleted]",
                                                                    "author": null,
                                                                    "id": "fyhp4k1",
                                                                    "parent_id": "t1_fyhoxoj",
                                                                    "score": -5,
                                                                    "created_utc": 1595101866.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "[deleted]",
                                                                            "author": null,
                                                                            "id": "fyiixtn",
                                                                            "parent_id": "t1_fyhp4k1",
                                                                            "score": 3,
                                                                            "created_utc": 1595119177.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "[deleted]",
                                                                                    "author": null,
                                                                                    "id": "fyij1ra",
                                                                                    "parent_id": "t1_fyiixtn",
                                                                                    "score": 1,
                                                                                    "created_utc": 1595119248.0,
                                                                                    "replies": [
                                                                                        {
                                                                                            "body": "[deleted]",
                                                                                            "author": null,
                                                                                            "id": "fyij4wy",
                                                                                            "parent_id": "t1_fyij1ra",
                                                                                            "score": 1,
                                                                                            "created_utc": 1595119305.0,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Mans really just straight up said “hey guys I’m shit in bed” lmaooo",
                            "author": "immediatethor",
                            "id": "fyjbns3",
                            "parent_id": "t1_fyh6egt",
                            "score": 3,
                            "created_utc": 1595139874.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "fyjbzpm",
                                    "parent_id": "t1_fyjbns3",
                                    "score": -2,
                                    "created_utc": 1595140185.0,
                                    "replies": [
                                        {
                                            "body": "It’s not about female orgasm in general, girls can squirt if you know what you’re doing. It’s called female ejaculation.",
                                            "author": "immediatethor",
                                            "id": "fyjf60m",
                                            "parent_id": "t1_fyjbzpm",
                                            "score": 1,
                                            "created_utc": 1595143276.0,
                                            "replies": [
                                                {
                                                    "body": "It's just piss",
                                                    "author": "sandowian",
                                                    "id": "fyk0llf",
                                                    "parent_id": "t1_fyjf60m",
                                                    "score": 0,
                                                    "created_utc": 1595164647.0,
                                                    "replies": [
                                                        {
                                                            "body": "Not exactly, no. \n\n\"According to a [2011 study](https://www.jsm.jsexmed.org/article/S1743-6095(15)33346-4/fulltext), female ejaculate contains some of the same components as semen. This includes prostate specific antigen (PSA) and prostatic acid phosphatase. It also contains small amounts of creatinine and urea, urine’s primary components.\"",
                                                            "author": "immediatethor",
                                                            "id": "fyk37kw",
                                                            "parent_id": "t1_fyk0llf",
                                                            "score": 1,
                                                            "created_utc": 1595166484.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Funny how it seems to contain stuff that's only produced in the prostate... which women don't have",
                                                                    "author": "sandowian",
                                                                    "id": "fykhyhd",
                                                                    "parent_id": "t1_fyk37kw",
                                                                    "score": 0,
                                                                    "created_utc": 1595175130.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "“While women do not have prostates, they do have a series of glands and ducts at the front of the vagina called the Skene glands, which are sometimes referred to as the female prostate.\n\nResearchers have discovered that the Skene glands share some of the same properties as the male prostate. For example, both the prostate and the Skene glands contain prostate-specific antigen (PSA) and PSA phosphatase (PSAP).”",
                                                                            "author": "immediatethor",
                                                                            "id": "fykin2w",
                                                                            "parent_id": "t1_fykhyhd",
                                                                            "score": 1,
                                                                            "created_utc": 1595175500.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Does Brylcreem have a strong enough hold for people with thick straight hair? I've had to use clay for my hair styling for the past few years.",
            "author": "AWhimsicalBird",
            "id": "fyhytcs",
            "parent_id": "t3_hti0y0",
            "score": 6,
            "created_utc": 1595107254.0,
            "replies": []
        },
        {
            "body": "Something like a light scheme cream maybe.",
            "author": "NullandVoid2003",
            "id": "fygvp90",
            "parent_id": "t3_hti0y0",
            "score": 7,
            "created_utc": 1595085579.0,
            "replies": []
        },
        {
            "body": "likely hair gel.\n\nhair gel is super versatile, idk why people hate it.",
            "author": null,
            "id": "fyh7muc",
            "parent_id": "t3_hti0y0",
            "score": 10,
            "created_utc": 1595092292.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "fyhdcf7",
                    "parent_id": "t1_fyh7muc",
                    "score": 19,
                    "created_utc": 1595095408.0,
                    "replies": [
                        {
                            "body": "whaaat, spiky hair is gonna come back i guarantee it.",
                            "author": null,
                            "id": "fyhglew",
                            "parent_id": "t1_fyhdcf7",
                            "score": 8,
                            "created_utc": 1595097153.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Always causes me dandruff 😞",
                    "author": "cranky-alpha",
                    "id": "fyhhxna",
                    "parent_id": "t1_fyh7muc",
                    "score": 4,
                    "created_utc": 1595097890.0,
                    "replies": [
                        {
                            "body": "try a different one?   \nyou might be using one with a lot of drying alcohol in it.",
                            "author": null,
                            "id": "fyhi7oj",
                            "parent_id": "t1_fyhhxna",
                            "score": 4,
                            "created_utc": 1595098043.0,
                            "replies": [
                                {
                                    "body": "Huh, might actually work. Thanks man!",
                                    "author": "cranky-alpha",
                                    "id": "fyhoc1f",
                                    "parent_id": "t1_fyhi7oj",
                                    "score": 1,
                                    "created_utc": 1595101422.0,
                                    "replies": [
                                        {
                                            "body": "LA Looks Extreme sport is still around and is alcohol free.",
                                            "author": null,
                                            "id": "fyhswls",
                                            "parent_id": "t1_fyhoc1f",
                                            "score": 3,
                                            "created_utc": 1595103924.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "an oil-based pomade can probably do this",
            "author": "warpedspoon",
            "id": "fyhf7yo",
            "parent_id": "t3_hti0y0",
            "score": 3,
            "created_utc": 1595096399.0,
            "replies": []
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "fyhrflo",
            "parent_id": "t3_hti0y0",
            "score": 3,
            "created_utc": 1595103153.0,
            "replies": [
                {
                    "body": "I understood that reference",
                    "author": "xyzninja",
                    "id": "fyhuuc2",
                    "parent_id": "t1_fyhrflo",
                    "score": 2,
                    "created_utc": 1595105012.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Patriotism",
            "author": "SlippyTheFeeler",
            "id": "fyhiys8",
            "parent_id": "t3_hti0y0",
            "score": 2,
            "created_utc": 1595098463.0,
            "replies": []
        },
        {
            "body": "Its most likely pomade, what brand etc who knows..",
            "author": "Wild_Obligation",
            "id": "fyhqkjw",
            "parent_id": "t3_hti0y0",
            "score": 1,
            "created_utc": 1595102678.0,
            "replies": []
        },
        {
            "body": "Pomade, though you could always use hair clay. I've found that it gives a much stronger hold, while at the same time retaining the oils in your hair. If you want some shine to go with it, just add a little bit of water on the last combing period (you should comb, then add a bit of clay, then repeat until you see your desired hair shape; at this point, repeat the above, but alternate between water and clay every few strokes of the comb).",
            "author": "-xXx_Anonymous_xXx-",
            "id": "fyidq6q",
            "parent_id": "t3_hti0y0",
            "score": 1,
            "created_utc": 1595115894.0,
            "replies": []
        },
        {
            "body": "Adrenachrome",
            "author": null,
            "id": "fyipk86",
            "parent_id": "t3_hti0y0",
            "score": 1,
            "created_utc": 1595123458.0,
            "replies": []
        },
        {
            "body": "AAA America, thats what",
            "author": "Brynomac",
            "id": "fyirqi4",
            "parent_id": "t3_hti0y0",
            "score": 1,
            "created_utc": 1595124852.0,
            "replies": []
        },
        {
            "body": "I’m thinking pomade cuz I don’t feel like a cream would be that shiny",
            "author": "streakman0811",
            "id": "fyitpn8",
            "parent_id": "t3_hti0y0",
            "score": 1,
            "created_utc": 1595126121.0,
            "replies": []
        },
        {
            "body": "ask the barber",
            "author": "VenomSnakeronies",
            "id": "fyj22yo",
            "parent_id": "t3_hti0y0",
            "score": 1,
            "created_utc": 1595131940.0,
            "replies": []
        },
        {
            "body": "Idk how bad this but conditioner is what I sometimes use when I'm in a pinch it looks like pomade it's shiney and smells good but if I want to have a more relaxed natrual look I just rub it out",
            "author": null,
            "id": "fyjd967",
            "parent_id": "t3_hti0y0",
            "score": 1,
            "created_utc": 1595141390.0,
            "replies": []
        },
        {
            "body": "Steroids",
            "author": "rochefort369",
            "id": "fyjke4i",
            "parent_id": "t3_hti0y0",
            "score": 1,
            "created_utc": 1595148808.0,
            "replies": []
        },
        {
            "body": "Why is he so darn attractive?",
            "author": "brightblueskies11",
            "id": "fyjki9t",
            "parent_id": "t3_hti0y0",
            "score": 1,
            "created_utc": 1595148935.0,
            "replies": []
        },
        {
            "body": "Cum of all the women he drowns into.",
            "author": "Yvsh",
            "id": "fyk13y1",
            "parent_id": "t3_hti0y0",
            "score": 1,
            "created_utc": 1595165018.0,
            "replies": []
        },
        {
            "body": "gooch grease",
            "author": "NotSid",
            "id": "fyhbqnt",
            "parent_id": "t3_hti0y0",
            "score": 0,
            "created_utc": 1595094539.0,
            "replies": []
        },
        {
            "body": "Concentrated donkey jizz.",
            "author": "WearyMatter",
            "id": "fyib23k",
            "parent_id": "t3_hti0y0",
            "score": 0,
            "created_utc": 1595114294.0,
            "replies": []
        },
        {
            "body": "Looks like a young Biden",
            "author": null,
            "id": "fyhk4fj",
            "parent_id": "t3_hti0y0",
            "score": -3,
            "created_utc": 1595099096.0,
            "replies": [
                {
                    "body": "He's not a pony soldier hers a super soldier",
                    "author": "abacabbmk",
                    "id": "fyic5mt",
                    "parent_id": "t1_fyhk4fj",
                    "score": 2,
                    "created_utc": 1595114946.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "CHRiS EVAN GO WAHACK BUTT DAViD ARNOLD MCSALE GOiNG GET SPANKiNG OR PADDLE BULLWHiP TONY TOM ME RiCK LARRY BRANDAN BONNiE BOBBiE RiCHARD FRANK WHOOPiNG BUTT GET ASS OVER HERE NO GET OVER HERE NOW: TOXiC SMOKE WEEDS MARiJUANA CiGARETTE BEER ALCOHOL GET OVER HERE NOW GET PADDLE DROP PANTS GET OVER MY LAP WHiP-STiCKS BELT SLAP BUTT SLAP SLAP AND WAHACK WAHACK WAHACK  PUT SOAP iN MOUTH HiTLER GET SPANKiNG  CHRiS EVAN-COW-BOY-MAN BiG GiANT-MAN BiG-MAN-TEACHER  WHOOP SiNDY ROBERT BUTT CRYiNG",
            "author": "Useful_Chemist8988",
            "id": "j32q7m8",
            "parent_id": "t3_hti0y0",
            "score": 1,
            "created_utc": 1672940030.0,
            "replies": []
        },
        {
            "body": "What Brylcreem exactly? I had never heard that before",
            "author": "sheikonfleek",
            "id": "fyh9o2o",
            "parent_id": "t1_fygxteo",
            "score": 90,
            "created_utc": 1595093406.0,
            "replies": [
                {
                    "body": "It's one of the oldest pommades, it's basically mineral oils with beeswax and it just works wonders for the hair. They have two that are the basic ones: Original and Original with added protein, so I would pick up either one of those and try it.",
                    "author": "Neknoh",
                    "id": "fyhao5x",
                    "parent_id": "t1_fyh9o2o",
                    "score": 93,
                    "created_utc": 1595093959.0,
                    "replies": [
                        {
                            "body": "It’s fairly affordable on Amazon, I’ll have to give it a try",
                            "author": "sheikonfleek",
                            "id": "fyhaslv",
                            "parent_id": "t1_fyhao5x",
                            "score": 37,
                            "created_utc": 1595094026.0,
                            "replies": [
                                {
                                    "body": "Yeah, it's a light hold, so needs more for a slicker look, but honestly, just a little bit comped into the hair is probably the best styling I've had.",
                                    "author": "Neknoh",
                                    "id": "fyhdsgp",
                                    "parent_id": "t1_fyhaslv",
                                    "score": 27,
                                    "created_utc": 1595095632.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Should I get the gel or the 3 in 1?",
                            "author": "itisallgoodyouknow",
                            "id": "fyhm519",
                            "parent_id": "t1_fyhao5x",
                            "score": 10,
                            "created_utc": 1595100197.0,
                            "replies": [
                                {
                                    "body": "This is the one I'm using\nhttps://www.pricerunner.se/product/640x640/1684651518/Brylcreem-Original-Light-Glossy-Hold-Protein-Enriched-150ml.jpg\n\nJust classic, old-school brylcreem",
                                    "author": "Neknoh",
                                    "id": "fyhpk8t",
                                    "parent_id": "t1_fyhm519",
                                    "score": 17,
                                    "created_utc": 1595102113.0,
                                    "replies": [
                                        {
                                            "body": "Can i see a pic of your hair? Please :)",
                                            "author": "itisallgoodyouknow",
                                            "id": "fyhrqm2",
                                            "parent_id": "t1_fyhpk8t",
                                            "score": 5,
                                            "created_utc": 1595103309.0,
                                            "replies": [
                                                {
                                                    "body": "Curly and super frissy hair  \n\n\nThis is without:   [https://gyazo.com/138459375546b16dc28e9bfb6eb5e471](https://gyazo.com/138459375546b16dc28e9bfb6eb5e471) \n\nThis is with literally just a touch and no comb-work or anything:  [https://gyazo.com/0ccb0130a0b4aa989121daeb2b597914](https://gyazo.com/0ccb0130a0b4aa989121daeb2b597914) \n\nThis is the day after (again, no combing or styling):  [https://gyazo.com/1d13bc7b5d0fb70613a7105ae0a3e13f](https://gyazo.com/1d13bc7b5d0fb70613a7105ae0a3e13f) \n\n&#x200B;\n\nBasically, it gives a light hold, gathers up your hair really nicely and gives it a nice and collected look. For me, it basically kills friss for about 24 hours and that's with using only a limited amount of the stuff. I don't really have the hair for a neat and straighter style (such as the one Evans has), but I think I could absolutely achieve my equivalent of it with maybe two globs of the stuff instead of one and some proper comb-work.\n\nIt also smells so damn nice, bees-wax and mineral oils.",
                                                    "author": "Neknoh",
                                                    "id": "fyhua8w",
                                                    "parent_id": "t1_fyhrqm2",
                                                    "score": 28,
                                                    "created_utc": 1595104699.0,
                                                    "replies": [
                                                        {
                                                            "body": "Dude thank you so much! About to order some of this. Nice hair btw",
                                                            "author": "itisallgoodyouknow",
                                                            "id": "fyhufqp",
                                                            "parent_id": "t1_fyhua8w",
                                                            "score": 7,
                                                            "created_utc": 1595104786.0,
                                                            "replies": [
                                                                {
                                                                    "body": "No worries at all mate, it's been around for so damn long! I always thought it was going to be like, a tube of super greasy stuff, but it's a really light and fluffy mousse that isn't any oilier than, say, argan oil/silk drops or whatever but works so much better and gives styling options.\n\nTry it out and see what you think, experiment and see if you need like, just a tiny ammount or more of a glob of it. No idea what your hair is like or anything and can only speak for myself.",
                                                                    "author": "Neknoh",
                                                                    "id": "fyhv0uz",
                                                                    "parent_id": "t1_fyhufqp",
                                                                    "score": 11,
                                                                    "created_utc": 1595105113.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "I use 3 different Gatsby products. Granted there a knockoff type and the actual (japanese?) product. I'll send a link to the ones I've been buying for years.\n\nOrange, gray and blue. Usually on ebay or amazon for 10 bucks each and has a G in the middle. The sticker has an asian guy with localized writing on it.\n\nI use the orange one mainly as it's a loose shuffle allowing me to have a soft hold and manipulate it thru the day. \n\nI use a tiny bit of the gray stuff to have a little extra hold on the side hairs that do their own thing. \n\nAnd I use blue occasionally if I want it to have a wet look. \n\nUsually I'll do it as the hair mostly dry and then comb and use the dryer to shape. After that holds for about 10 minutes I can play with it without losing much of the style.\n\nAgain everyones hair is diff and I'm no pro but overall this has given me a lot of the looks I like, similiar to Chris, and it handles my workload. Granted when I'm active and sweating it will depend on the styling I did becuase being in the heat a lot or getting it wet will throw it off so I always keep a few hats in the car. I can typically get my hair good to go in like 5 minutes though.\n\nI will try a few of the suggestions here though since I always like having options if I'm ever in a pinch and cant order my stuff quickly.",
                                    "author": "ThisFckinGuy",
                                    "id": "fyhwgun",
                                    "parent_id": "t1_fyhm519",
                                    "score": 3,
                                    "created_utc": 1595105915.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "fyhuae9",
                            "parent_id": "t1_fyhao5x",
                            "score": 3,
                            "created_utc": 1595104701.0,
                            "replies": [
                                {
                                    "body": "It's been super easy to get out, again, it's oil and beeswax whipped to a light cream, it isn't sticky or anything. If you use a lot, it gets that sort of oily/fatty feel, but that IS also how pretty much the entire rockabilly scene got their hair done back in the day.\n\n(https://nostalgiacentral.com/pop-culture/fashion/brylcreem/)\n\nSo basically, too much and it gets a bit greasy, but nowhere near that sticky, half-dry, tacky and stale feeling that you get from gels or sprays, it just helps with the friss. I did it daily for a weak and my hair is WAY better now, even some two weeks after having forgotten to do it daily than it was before. Think of it as argan-oil or silk-drops or something else you just put into your hair after the shower, but it gives a light hold and some styling options as well.\n\nSo I would absolutely recommend to try it at least, usually 4-9 dollars depending on where you are, but like, it's worth a try.",
                                    "author": "Neknoh",
                                    "id": "fyhuuye",
                                    "parent_id": "t1_fyhuae9",
                                    "score": 5,
                                    "created_utc": 1595105021.0,
                                    "replies": []
                                },
                                {
                                    "body": "It might help with the frizz. \n\nHave you tried argan or jojoba oil? I have medium thick hair that gets thinner and frizzier the longer I grow it out. I put a pea-size of amount of paul mitchell conditioner in my palm and add ONE drop of jojoba oil, mix it in my palms and work through to the tips of my damp hair. More than a drop and my hair looks oily. But one drop and it tames the frizz and gives it a nice sheen.",
                                    "author": "billbixbyakahulk",
                                    "id": "fyi515a",
                                    "parent_id": "t1_fyhuae9",
                                    "score": 1,
                                    "created_utc": 1595110837.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "No it looks like Pacinos creme",
                    "author": "toni8479",
                    "id": "fyhr6y1",
                    "parent_id": "t1_fyh9o2o",
                    "score": 0,
                    "created_utc": 1595103024.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I remembet when Bryl cream was the matte of its era.",
            "author": null,
            "id": "fyhfrw5",
            "parent_id": "t1_fygxteo",
            "score": 7,
            "created_utc": 1595096707.0,
            "replies": []
        },
        {
            "body": "What's funny is with all these new products coming out for men, this isn't just your dad's hair product, this is your granddad's. For some of you, it's your great-granddad's.\n\nSeveral years ago for Christmas, my dad (born in '42) got a gag gift from his sister. It was his high school pic and he was all bryl'd out, along with a tube of Brylcreem. My dad didn't miss a beat and [busted out the jingle](https://www.youtube.com/watch?v=o6F4GtyRfto) \"Brylcreem - a little dab'll do ya...\"",
            "author": "billbixbyakahulk",
            "id": "fyi3xrz",
            "parent_id": "t1_fygxteo",
            "score": 4,
            "created_utc": 1595110208.0,
            "replies": [
                {
                    "body": "My grandfather (born 1935) went totally grey in his twenties but always had (and still has) enough hair to style with Brylcream, and has been for years and years. I don't use it myself (I have tight Celtic curls and getting bryl'd out is not the look I go for) but sometimes, it really is the older stuff that works.",
                    "author": "thacaoimhainngeidh",
                    "id": "fyjnuts",
                    "parent_id": "t1_fyi3xrz",
                    "score": 1,
                    "created_utc": 1595152628.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "do you know if there is a difference between the hair cream (tube) or the gel?",
            "author": "AWhimsicalBird",
            "id": "fyhylms",
            "parent_id": "t1_fygxteo",
            "score": 1,
            "created_utc": 1595107132.0,
            "replies": [
                {
                    "body": "No idea, I use the tub, it says original on the box, only picked it up a few weeks ago",
                    "author": "Neknoh",
                    "id": "fyi4esr",
                    "parent_id": "t1_fyhylms",
                    "score": 1,
                    "created_utc": 1595110479.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Do you have the link to that post?",
            "author": "Slash_BringingHasher",
            "id": "fyi1qh1",
            "parent_id": "t1_fygxteo",
            "score": 1,
            "created_utc": 1595108943.0,
            "replies": [
                {
                    "body": "Actually been trying to find it, I THINK it was on a picture of DiCaprio, fairly certain it was in malehairadvice, but could have been malegrooming or malefashionadvice",
                    "author": "Neknoh",
                    "id": "fyi4gsh",
                    "parent_id": "t1_fyi1qh1",
                    "score": 3,
                    "created_utc": 1595110510.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Thanks lol it’s 2am and I just hit purchase on amazon. Should be here tomorrow (:",
            "author": "brightblueskies11",
            "id": "fyjkvyr",
            "parent_id": "t1_fygxteo",
            "score": 1,
            "created_utc": 1595149348.0,
            "replies": []
        },
        {
            "body": "how to achieve this?",
            "author": "Eduwien",
            "id": "fyh31h5",
            "parent_id": "t1_fygvq3h",
            "score": 33,
            "created_utc": 1595089754.0,
            "replies": [
                {
                    "body": "Good genetics, we are out of luck",
                    "author": "speedy117",
                    "id": "fyh9srf",
                    "parent_id": "t1_fyh31h5",
                    "score": 20,
                    "created_utc": 1595093478.0,
                    "replies": [
                        {
                            "body": "There have been a few posts on here that show that he has had a hair transplant. His hair genetics are not good.",
                            "author": "helpmeimprove87",
                            "id": "fyi6srk",
                            "parent_id": "t1_fyh9srf",
                            "score": 5,
                            "created_utc": 1595111848.0,
                            "replies": [
                                {
                                    "body": "Is there any proof? This is the first time I'm hearing this. I mean sometimes you can tell, for example Elon Musk.",
                                    "author": "speedy117",
                                    "id": "fyiditf",
                                    "parent_id": "t1_fyi6srk",
                                    "score": 2,
                                    "created_utc": 1595115768.0,
                                    "replies": [
                                        {
                                            "body": "Umm u could tell the difference if u watch his old work he has more receding hairline in them but I don't know for sure",
                                            "author": "vansh_khatri1",
                                            "id": "fyihwq7",
                                            "parent_id": "t1_fyiditf",
                                            "score": 6,
                                            "created_utc": 1595118515.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Do you have it? No? Then you can never achieve it 😭😭😭",
                    "author": "maybeidontknowwhy",
                    "id": "fyh3fc2",
                    "parent_id": "t1_fyh31h5",
                    "score": 20,
                    "created_utc": 1595089966.0,
                    "replies": []
                },
                {
                    "body": "You'll need a time machine to go back and pick better parents.",
                    "author": "ChapsWorthington",
                    "id": "fyhmyr5",
                    "parent_id": "t1_fyh31h5",
                    "score": 2,
                    "created_utc": 1595100658.0,
                    "replies": []
                },
                {
                    "body": "Self care and surgery",
                    "author": null,
                    "id": "fyj1n2c",
                    "parent_id": "t1_fyh31h5",
                    "score": 1,
                    "created_utc": 1595131619.0,
                    "replies": []
                },
                {
                    "body": "Rule 1:  Be attractive\n\nRule 2:  don’t be unattractive",
                    "author": "Thepresocratic",
                    "id": "fyjbcig",
                    "parent_id": "t1_fyh31h5",
                    "score": 1,
                    "created_utc": 1595139583.0,
                    "replies": []
                },
                {
                    "body": "Try reincarnation",
                    "author": null,
                    "id": "fyhkusk",
                    "parent_id": "t1_fyh31h5",
                    "score": 0,
                    "created_utc": 1595099489.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Could be cream too",
            "author": "vansh_khatri1",
            "id": "fyihn8s",
            "parent_id": "t1_fygx4q0",
            "score": 2,
            "created_utc": 1595118347.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fyh806k",
            "parent_id": "t1_fyh5tao",
            "score": 13,
            "created_utc": 1595092499.0,
            "replies": [
                {
                    "body": "very dilute piss at least lmao",
                    "author": "jei64",
                    "id": "fyjqgol",
                    "parent_id": "t1_fyh806k",
                    "score": 1,
                    "created_utc": 1595155507.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fyh6egt",
            "parent_id": "t1_fyh5tao",
            "score": 19,
            "created_utc": 1595091609.0,
            "replies": [
                {
                    "body": "gotta hit the right spots 👅",
                    "author": null,
                    "id": "fyhks4o",
                    "parent_id": "t1_fyh6egt",
                    "score": 14,
                    "created_utc": 1595099449.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "fyhkwxf",
                            "parent_id": "t1_fyhks4o",
                            "score": -10,
                            "created_utc": 1595099520.0,
                            "replies": [
                                {
                                    "body": "https://www.healthline.com/health/healthy-sex/female-ejaculation#overview",
                                    "author": null,
                                    "id": "fyhl330",
                                    "parent_id": "t1_fyhkwxf",
                                    "score": 10,
                                    "created_utc": 1595099614.0,
                                    "replies": [
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "fyhn6qy",
                                            "parent_id": "t1_fyhl330",
                                            "score": -20,
                                            "created_utc": 1595100782.0,
                                            "replies": [
                                                {
                                                    "body": "Ejaculate just means \"thing that gets ejected\"",
                                                    "author": "Pyroven",
                                                    "id": "fyigrfb",
                                                    "parent_id": "t1_fyhn6qy",
                                                    "score": 8,
                                                    "created_utc": 1595117786.0,
                                                    "replies": []
                                                },
                                                {
                                                    "body": "Proof yet again that any Reddit post is exactly two degrees of comments from a semantic argument over ejaculation.",
                                                    "author": "TimFTWin",
                                                    "id": "fyi8bib",
                                                    "parent_id": "t1_fyhn6qy",
                                                    "score": 7,
                                                    "created_utc": 1595112703.0,
                                                    "replies": [
                                                        {
                                                            "body": "I'd give ya an award if I wasn't broke bruv thanks for the laugh",
                                                            "author": null,
                                                            "id": "fyjarn9",
                                                            "parent_id": "t1_fyi8bib",
                                                            "score": 1,
                                                            "created_utc": 1595139050.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "body": "I think that's more a product of male ignorance though, I don't want to go full-blown feminist but it's not like historically the female orgasm has been valued or even known to occur. try looking up the definition of the word squirt, words aren't bound by the dictionary, unless you have a better word for what women do when ya know what to do I don't see how ejaculate would be incorrect.",
                                                    "author": null,
                                                    "id": "fyhoxoj",
                                                    "parent_id": "t1_fyhn6qy",
                                                    "score": 1,
                                                    "created_utc": 1595101759.0,
                                                    "replies": [
                                                        {
                                                            "body": "[deleted]",
                                                            "author": null,
                                                            "id": "fyhp4k1",
                                                            "parent_id": "t1_fyhoxoj",
                                                            "score": -5,
                                                            "created_utc": 1595101866.0,
                                                            "replies": [
                                                                {
                                                                    "body": "[deleted]",
                                                                    "author": null,
                                                                    "id": "fyiixtn",
                                                                    "parent_id": "t1_fyhp4k1",
                                                                    "score": 3,
                                                                    "created_utc": 1595119177.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "[deleted]",
                                                                            "author": null,
                                                                            "id": "fyij1ra",
                                                                            "parent_id": "t1_fyiixtn",
                                                                            "score": 1,
                                                                            "created_utc": 1595119248.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "[deleted]",
                                                                                    "author": null,
                                                                                    "id": "fyij4wy",
                                                                                    "parent_id": "t1_fyij1ra",
                                                                                    "score": 1,
                                                                                    "created_utc": 1595119305.0,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Mans really just straight up said “hey guys I’m shit in bed” lmaooo",
                    "author": "immediatethor",
                    "id": "fyjbns3",
                    "parent_id": "t1_fyh6egt",
                    "score": 3,
                    "created_utc": 1595139874.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "fyjbzpm",
                            "parent_id": "t1_fyjbns3",
                            "score": -2,
                            "created_utc": 1595140185.0,
                            "replies": [
                                {
                                    "body": "It’s not about female orgasm in general, girls can squirt if you know what you’re doing. It’s called female ejaculation.",
                                    "author": "immediatethor",
                                    "id": "fyjf60m",
                                    "parent_id": "t1_fyjbzpm",
                                    "score": 1,
                                    "created_utc": 1595143276.0,
                                    "replies": [
                                        {
                                            "body": "It's just piss",
                                            "author": "sandowian",
                                            "id": "fyk0llf",
                                            "parent_id": "t1_fyjf60m",
                                            "score": 0,
                                            "created_utc": 1595164647.0,
                                            "replies": [
                                                {
                                                    "body": "Not exactly, no. \n\n\"According to a [2011 study](https://www.jsm.jsexmed.org/article/S1743-6095(15)33346-4/fulltext), female ejaculate contains some of the same components as semen. This includes prostate specific antigen (PSA) and prostatic acid phosphatase. It also contains small amounts of creatinine and urea, urine’s primary components.\"",
                                                    "author": "immediatethor",
                                                    "id": "fyk37kw",
                                                    "parent_id": "t1_fyk0llf",
                                                    "score": 1,
                                                    "created_utc": 1595166484.0,
                                                    "replies": [
                                                        {
                                                            "body": "Funny how it seems to contain stuff that's only produced in the prostate... which women don't have",
                                                            "author": "sandowian",
                                                            "id": "fykhyhd",
                                                            "parent_id": "t1_fyk37kw",
                                                            "score": 0,
                                                            "created_utc": 1595175130.0,
                                                            "replies": [
                                                                {
                                                                    "body": "“While women do not have prostates, they do have a series of glands and ducts at the front of the vagina called the Skene glands, which are sometimes referred to as the female prostate.\n\nResearchers have discovered that the Skene glands share some of the same properties as the male prostate. For example, both the prostate and the Skene glands contain prostate-specific antigen (PSA) and PSA phosphatase (PSAP).”",
                                                                    "author": "immediatethor",
                                                                    "id": "fykin2w",
                                                                    "parent_id": "t1_fykhyhd",
                                                                    "score": 1,
                                                                    "created_utc": 1595175500.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fyhdcf7",
            "parent_id": "t1_fyh7muc",
            "score": 19,
            "created_utc": 1595095408.0,
            "replies": [
                {
                    "body": "whaaat, spiky hair is gonna come back i guarantee it.",
                    "author": null,
                    "id": "fyhglew",
                    "parent_id": "t1_fyhdcf7",
                    "score": 8,
                    "created_utc": 1595097153.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Always causes me dandruff 😞",
            "author": "cranky-alpha",
            "id": "fyhhxna",
            "parent_id": "t1_fyh7muc",
            "score": 4,
            "created_utc": 1595097890.0,
            "replies": [
                {
                    "body": "try a different one?   \nyou might be using one with a lot of drying alcohol in it.",
                    "author": null,
                    "id": "fyhi7oj",
                    "parent_id": "t1_fyhhxna",
                    "score": 4,
                    "created_utc": 1595098043.0,
                    "replies": [
                        {
                            "body": "Huh, might actually work. Thanks man!",
                            "author": "cranky-alpha",
                            "id": "fyhoc1f",
                            "parent_id": "t1_fyhi7oj",
                            "score": 1,
                            "created_utc": 1595101422.0,
                            "replies": [
                                {
                                    "body": "LA Looks Extreme sport is still around and is alcohol free.",
                                    "author": null,
                                    "id": "fyhswls",
                                    "parent_id": "t1_fyhoc1f",
                                    "score": 3,
                                    "created_utc": 1595103924.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I understood that reference",
            "author": "xyzninja",
            "id": "fyhuuc2",
            "parent_id": "t1_fyhrflo",
            "score": 2,
            "created_utc": 1595105012.0,
            "replies": []
        },
        {
            "body": "He's not a pony soldier hers a super soldier",
            "author": "abacabbmk",
            "id": "fyic5mt",
            "parent_id": "t1_fyhk4fj",
            "score": 2,
            "created_utc": 1595114946.0,
            "replies": []
        },
        {
            "body": "It's one of the oldest pommades, it's basically mineral oils with beeswax and it just works wonders for the hair. They have two that are the basic ones: Original and Original with added protein, so I would pick up either one of those and try it.",
            "author": "Neknoh",
            "id": "fyhao5x",
            "parent_id": "t1_fyh9o2o",
            "score": 93,
            "created_utc": 1595093959.0,
            "replies": [
                {
                    "body": "It’s fairly affordable on Amazon, I’ll have to give it a try",
                    "author": "sheikonfleek",
                    "id": "fyhaslv",
                    "parent_id": "t1_fyhao5x",
                    "score": 37,
                    "created_utc": 1595094026.0,
                    "replies": [
                        {
                            "body": "Yeah, it's a light hold, so needs more for a slicker look, but honestly, just a little bit comped into the hair is probably the best styling I've had.",
                            "author": "Neknoh",
                            "id": "fyhdsgp",
                            "parent_id": "t1_fyhaslv",
                            "score": 27,
                            "created_utc": 1595095632.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Should I get the gel or the 3 in 1?",
                    "author": "itisallgoodyouknow",
                    "id": "fyhm519",
                    "parent_id": "t1_fyhao5x",
                    "score": 10,
                    "created_utc": 1595100197.0,
                    "replies": [
                        {
                            "body": "This is the one I'm using\nhttps://www.pricerunner.se/product/640x640/1684651518/Brylcreem-Original-Light-Glossy-Hold-Protein-Enriched-150ml.jpg\n\nJust classic, old-school brylcreem",
                            "author": "Neknoh",
                            "id": "fyhpk8t",
                            "parent_id": "t1_fyhm519",
                            "score": 17,
                            "created_utc": 1595102113.0,
                            "replies": [
                                {
                                    "body": "Can i see a pic of your hair? Please :)",
                                    "author": "itisallgoodyouknow",
                                    "id": "fyhrqm2",
                                    "parent_id": "t1_fyhpk8t",
                                    "score": 5,
                                    "created_utc": 1595103309.0,
                                    "replies": [
                                        {
                                            "body": "Curly and super frissy hair  \n\n\nThis is without:   [https://gyazo.com/138459375546b16dc28e9bfb6eb5e471](https://gyazo.com/138459375546b16dc28e9bfb6eb5e471) \n\nThis is with literally just a touch and no comb-work or anything:  [https://gyazo.com/0ccb0130a0b4aa989121daeb2b597914](https://gyazo.com/0ccb0130a0b4aa989121daeb2b597914) \n\nThis is the day after (again, no combing or styling):  [https://gyazo.com/1d13bc7b5d0fb70613a7105ae0a3e13f](https://gyazo.com/1d13bc7b5d0fb70613a7105ae0a3e13f) \n\n&#x200B;\n\nBasically, it gives a light hold, gathers up your hair really nicely and gives it a nice and collected look. For me, it basically kills friss for about 24 hours and that's with using only a limited amount of the stuff. I don't really have the hair for a neat and straighter style (such as the one Evans has), but I think I could absolutely achieve my equivalent of it with maybe two globs of the stuff instead of one and some proper comb-work.\n\nIt also smells so damn nice, bees-wax and mineral oils.",
                                            "author": "Neknoh",
                                            "id": "fyhua8w",
                                            "parent_id": "t1_fyhrqm2",
                                            "score": 28,
                                            "created_utc": 1595104699.0,
                                            "replies": [
                                                {
                                                    "body": "Dude thank you so much! About to order some of this. Nice hair btw",
                                                    "author": "itisallgoodyouknow",
                                                    "id": "fyhufqp",
                                                    "parent_id": "t1_fyhua8w",
                                                    "score": 7,
                                                    "created_utc": 1595104786.0,
                                                    "replies": [
                                                        {
                                                            "body": "No worries at all mate, it's been around for so damn long! I always thought it was going to be like, a tube of super greasy stuff, but it's a really light and fluffy mousse that isn't any oilier than, say, argan oil/silk drops or whatever but works so much better and gives styling options.\n\nTry it out and see what you think, experiment and see if you need like, just a tiny ammount or more of a glob of it. No idea what your hair is like or anything and can only speak for myself.",
                                                            "author": "Neknoh",
                                                            "id": "fyhv0uz",
                                                            "parent_id": "t1_fyhufqp",
                                                            "score": 11,
                                                            "created_utc": 1595105113.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "I use 3 different Gatsby products. Granted there a knockoff type and the actual (japanese?) product. I'll send a link to the ones I've been buying for years.\n\nOrange, gray and blue. Usually on ebay or amazon for 10 bucks each and has a G in the middle. The sticker has an asian guy with localized writing on it.\n\nI use the orange one mainly as it's a loose shuffle allowing me to have a soft hold and manipulate it thru the day. \n\nI use a tiny bit of the gray stuff to have a little extra hold on the side hairs that do their own thing. \n\nAnd I use blue occasionally if I want it to have a wet look. \n\nUsually I'll do it as the hair mostly dry and then comb and use the dryer to shape. After that holds for about 10 minutes I can play with it without losing much of the style.\n\nAgain everyones hair is diff and I'm no pro but overall this has given me a lot of the looks I like, similiar to Chris, and it handles my workload. Granted when I'm active and sweating it will depend on the styling I did becuase being in the heat a lot or getting it wet will throw it off so I always keep a few hats in the car. I can typically get my hair good to go in like 5 minutes though.\n\nI will try a few of the suggestions here though since I always like having options if I'm ever in a pinch and cant order my stuff quickly.",
                            "author": "ThisFckinGuy",
                            "id": "fyhwgun",
                            "parent_id": "t1_fyhm519",
                            "score": 3,
                            "created_utc": 1595105915.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "fyhuae9",
                    "parent_id": "t1_fyhao5x",
                    "score": 3,
                    "created_utc": 1595104701.0,
                    "replies": [
                        {
                            "body": "It's been super easy to get out, again, it's oil and beeswax whipped to a light cream, it isn't sticky or anything. If you use a lot, it gets that sort of oily/fatty feel, but that IS also how pretty much the entire rockabilly scene got their hair done back in the day.\n\n(https://nostalgiacentral.com/pop-culture/fashion/brylcreem/)\n\nSo basically, too much and it gets a bit greasy, but nowhere near that sticky, half-dry, tacky and stale feeling that you get from gels or sprays, it just helps with the friss. I did it daily for a weak and my hair is WAY better now, even some two weeks after having forgotten to do it daily than it was before. Think of it as argan-oil or silk-drops or something else you just put into your hair after the shower, but it gives a light hold and some styling options as well.\n\nSo I would absolutely recommend to try it at least, usually 4-9 dollars depending on where you are, but like, it's worth a try.",
                            "author": "Neknoh",
                            "id": "fyhuuye",
                            "parent_id": "t1_fyhuae9",
                            "score": 5,
                            "created_utc": 1595105021.0,
                            "replies": []
                        },
                        {
                            "body": "It might help with the frizz. \n\nHave you tried argan or jojoba oil? I have medium thick hair that gets thinner and frizzier the longer I grow it out. I put a pea-size of amount of paul mitchell conditioner in my palm and add ONE drop of jojoba oil, mix it in my palms and work through to the tips of my damp hair. More than a drop and my hair looks oily. But one drop and it tames the frizz and gives it a nice sheen.",
                            "author": "billbixbyakahulk",
                            "id": "fyi515a",
                            "parent_id": "t1_fyhuae9",
                            "score": 1,
                            "created_utc": 1595110837.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "No it looks like Pacinos creme",
            "author": "toni8479",
            "id": "fyhr6y1",
            "parent_id": "t1_fyh9o2o",
            "score": 0,
            "created_utc": 1595103024.0,
            "replies": []
        },
        {
            "body": "My grandfather (born 1935) went totally grey in his twenties but always had (and still has) enough hair to style with Brylcream, and has been for years and years. I don't use it myself (I have tight Celtic curls and getting bryl'd out is not the look I go for) but sometimes, it really is the older stuff that works.",
            "author": "thacaoimhainngeidh",
            "id": "fyjnuts",
            "parent_id": "t1_fyi3xrz",
            "score": 1,
            "created_utc": 1595152628.0,
            "replies": []
        },
        {
            "body": "No idea, I use the tub, it says original on the box, only picked it up a few weeks ago",
            "author": "Neknoh",
            "id": "fyi4esr",
            "parent_id": "t1_fyhylms",
            "score": 1,
            "created_utc": 1595110479.0,
            "replies": []
        },
        {
            "body": "Actually been trying to find it, I THINK it was on a picture of DiCaprio, fairly certain it was in malehairadvice, but could have been malegrooming or malefashionadvice",
            "author": "Neknoh",
            "id": "fyi4gsh",
            "parent_id": "t1_fyi1qh1",
            "score": 3,
            "created_utc": 1595110510.0,
            "replies": []
        },
        {
            "body": "Good genetics, we are out of luck",
            "author": "speedy117",
            "id": "fyh9srf",
            "parent_id": "t1_fyh31h5",
            "score": 20,
            "created_utc": 1595093478.0,
            "replies": [
                {
                    "body": "There have been a few posts on here that show that he has had a hair transplant. His hair genetics are not good.",
                    "author": "helpmeimprove87",
                    "id": "fyi6srk",
                    "parent_id": "t1_fyh9srf",
                    "score": 5,
                    "created_utc": 1595111848.0,
                    "replies": [
                        {
                            "body": "Is there any proof? This is the first time I'm hearing this. I mean sometimes you can tell, for example Elon Musk.",
                            "author": "speedy117",
                            "id": "fyiditf",
                            "parent_id": "t1_fyi6srk",
                            "score": 2,
                            "created_utc": 1595115768.0,
                            "replies": [
                                {
                                    "body": "Umm u could tell the difference if u watch his old work he has more receding hairline in them but I don't know for sure",
                                    "author": "vansh_khatri1",
                                    "id": "fyihwq7",
                                    "parent_id": "t1_fyiditf",
                                    "score": 6,
                                    "created_utc": 1595118515.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Do you have it? No? Then you can never achieve it 😭😭😭",
            "author": "maybeidontknowwhy",
            "id": "fyh3fc2",
            "parent_id": "t1_fyh31h5",
            "score": 20,
            "created_utc": 1595089966.0,
            "replies": []
        },
        {
            "body": "You'll need a time machine to go back and pick better parents.",
            "author": "ChapsWorthington",
            "id": "fyhmyr5",
            "parent_id": "t1_fyh31h5",
            "score": 2,
            "created_utc": 1595100658.0,
            "replies": []
        },
        {
            "body": "Self care and surgery",
            "author": null,
            "id": "fyj1n2c",
            "parent_id": "t1_fyh31h5",
            "score": 1,
            "created_utc": 1595131619.0,
            "replies": []
        },
        {
            "body": "Rule 1:  Be attractive\n\nRule 2:  don’t be unattractive",
            "author": "Thepresocratic",
            "id": "fyjbcig",
            "parent_id": "t1_fyh31h5",
            "score": 1,
            "created_utc": 1595139583.0,
            "replies": []
        },
        {
            "body": "Try reincarnation",
            "author": null,
            "id": "fyhkusk",
            "parent_id": "t1_fyh31h5",
            "score": 0,
            "created_utc": 1595099489.0,
            "replies": []
        },
        {
            "body": "very dilute piss at least lmao",
            "author": "jei64",
            "id": "fyjqgol",
            "parent_id": "t1_fyh806k",
            "score": 1,
            "created_utc": 1595155507.0,
            "replies": []
        },
        {
            "body": "gotta hit the right spots 👅",
            "author": null,
            "id": "fyhks4o",
            "parent_id": "t1_fyh6egt",
            "score": 14,
            "created_utc": 1595099449.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "fyhkwxf",
                    "parent_id": "t1_fyhks4o",
                    "score": -10,
                    "created_utc": 1595099520.0,
                    "replies": [
                        {
                            "body": "https://www.healthline.com/health/healthy-sex/female-ejaculation#overview",
                            "author": null,
                            "id": "fyhl330",
                            "parent_id": "t1_fyhkwxf",
                            "score": 10,
                            "created_utc": 1595099614.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "fyhn6qy",
                                    "parent_id": "t1_fyhl330",
                                    "score": -20,
                                    "created_utc": 1595100782.0,
                                    "replies": [
                                        {
                                            "body": "Ejaculate just means \"thing that gets ejected\"",
                                            "author": "Pyroven",
                                            "id": "fyigrfb",
                                            "parent_id": "t1_fyhn6qy",
                                            "score": 8,
                                            "created_utc": 1595117786.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "Proof yet again that any Reddit post is exactly two degrees of comments from a semantic argument over ejaculation.",
                                            "author": "TimFTWin",
                                            "id": "fyi8bib",
                                            "parent_id": "t1_fyhn6qy",
                                            "score": 7,
                                            "created_utc": 1595112703.0,
                                            "replies": [
                                                {
                                                    "body": "I'd give ya an award if I wasn't broke bruv thanks for the laugh",
                                                    "author": null,
                                                    "id": "fyjarn9",
                                                    "parent_id": "t1_fyi8bib",
                                                    "score": 1,
                                                    "created_utc": 1595139050.0,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "body": "I think that's more a product of male ignorance though, I don't want to go full-blown feminist but it's not like historically the female orgasm has been valued or even known to occur. try looking up the definition of the word squirt, words aren't bound by the dictionary, unless you have a better word for what women do when ya know what to do I don't see how ejaculate would be incorrect.",
                                            "author": null,
                                            "id": "fyhoxoj",
                                            "parent_id": "t1_fyhn6qy",
                                            "score": 1,
                                            "created_utc": 1595101759.0,
                                            "replies": [
                                                {
                                                    "body": "[deleted]",
                                                    "author": null,
                                                    "id": "fyhp4k1",
                                                    "parent_id": "t1_fyhoxoj",
                                                    "score": -5,
                                                    "created_utc": 1595101866.0,
                                                    "replies": [
                                                        {
                                                            "body": "[deleted]",
                                                            "author": null,
                                                            "id": "fyiixtn",
                                                            "parent_id": "t1_fyhp4k1",
                                                            "score": 3,
                                                            "created_utc": 1595119177.0,
                                                            "replies": [
                                                                {
                                                                    "body": "[deleted]",
                                                                    "author": null,
                                                                    "id": "fyij1ra",
                                                                    "parent_id": "t1_fyiixtn",
                                                                    "score": 1,
                                                                    "created_utc": 1595119248.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "[deleted]",
                                                                            "author": null,
                                                                            "id": "fyij4wy",
                                                                            "parent_id": "t1_fyij1ra",
                                                                            "score": 1,
                                                                            "created_utc": 1595119305.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Mans really just straight up said “hey guys I’m shit in bed” lmaooo",
            "author": "immediatethor",
            "id": "fyjbns3",
            "parent_id": "t1_fyh6egt",
            "score": 3,
            "created_utc": 1595139874.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "fyjbzpm",
                    "parent_id": "t1_fyjbns3",
                    "score": -2,
                    "created_utc": 1595140185.0,
                    "replies": [
                        {
                            "body": "It’s not about female orgasm in general, girls can squirt if you know what you’re doing. It’s called female ejaculation.",
                            "author": "immediatethor",
                            "id": "fyjf60m",
                            "parent_id": "t1_fyjbzpm",
                            "score": 1,
                            "created_utc": 1595143276.0,
                            "replies": [
                                {
                                    "body": "It's just piss",
                                    "author": "sandowian",
                                    "id": "fyk0llf",
                                    "parent_id": "t1_fyjf60m",
                                    "score": 0,
                                    "created_utc": 1595164647.0,
                                    "replies": [
                                        {
                                            "body": "Not exactly, no. \n\n\"According to a [2011 study](https://www.jsm.jsexmed.org/article/S1743-6095(15)33346-4/fulltext), female ejaculate contains some of the same components as semen. This includes prostate specific antigen (PSA) and prostatic acid phosphatase. It also contains small amounts of creatinine and urea, urine’s primary components.\"",
                                            "author": "immediatethor",
                                            "id": "fyk37kw",
                                            "parent_id": "t1_fyk0llf",
                                            "score": 1,
                                            "created_utc": 1595166484.0,
                                            "replies": [
                                                {
                                                    "body": "Funny how it seems to contain stuff that's only produced in the prostate... which women don't have",
                                                    "author": "sandowian",
                                                    "id": "fykhyhd",
                                                    "parent_id": "t1_fyk37kw",
                                                    "score": 0,
                                                    "created_utc": 1595175130.0,
                                                    "replies": [
                                                        {
                                                            "body": "“While women do not have prostates, they do have a series of glands and ducts at the front of the vagina called the Skene glands, which are sometimes referred to as the female prostate.\n\nResearchers have discovered that the Skene glands share some of the same properties as the male prostate. For example, both the prostate and the Skene glands contain prostate-specific antigen (PSA) and PSA phosphatase (PSAP).”",
                                                            "author": "immediatethor",
                                                            "id": "fykin2w",
                                                            "parent_id": "t1_fykhyhd",
                                                            "score": 1,
                                                            "created_utc": 1595175500.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "whaaat, spiky hair is gonna come back i guarantee it.",
            "author": null,
            "id": "fyhglew",
            "parent_id": "t1_fyhdcf7",
            "score": 8,
            "created_utc": 1595097153.0,
            "replies": []
        },
        {
            "body": "try a different one?   \nyou might be using one with a lot of drying alcohol in it.",
            "author": null,
            "id": "fyhi7oj",
            "parent_id": "t1_fyhhxna",
            "score": 4,
            "created_utc": 1595098043.0,
            "replies": [
                {
                    "body": "Huh, might actually work. Thanks man!",
                    "author": "cranky-alpha",
                    "id": "fyhoc1f",
                    "parent_id": "t1_fyhi7oj",
                    "score": 1,
                    "created_utc": 1595101422.0,
                    "replies": [
                        {
                            "body": "LA Looks Extreme sport is still around and is alcohol free.",
                            "author": null,
                            "id": "fyhswls",
                            "parent_id": "t1_fyhoc1f",
                            "score": 3,
                            "created_utc": 1595103924.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "It’s fairly affordable on Amazon, I’ll have to give it a try",
            "author": "sheikonfleek",
            "id": "fyhaslv",
            "parent_id": "t1_fyhao5x",
            "score": 37,
            "created_utc": 1595094026.0,
            "replies": [
                {
                    "body": "Yeah, it's a light hold, so needs more for a slicker look, but honestly, just a little bit comped into the hair is probably the best styling I've had.",
                    "author": "Neknoh",
                    "id": "fyhdsgp",
                    "parent_id": "t1_fyhaslv",
                    "score": 27,
                    "created_utc": 1595095632.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Should I get the gel or the 3 in 1?",
            "author": "itisallgoodyouknow",
            "id": "fyhm519",
            "parent_id": "t1_fyhao5x",
            "score": 10,
            "created_utc": 1595100197.0,
            "replies": [
                {
                    "body": "This is the one I'm using\nhttps://www.pricerunner.se/product/640x640/1684651518/Brylcreem-Original-Light-Glossy-Hold-Protein-Enriched-150ml.jpg\n\nJust classic, old-school brylcreem",
                    "author": "Neknoh",
                    "id": "fyhpk8t",
                    "parent_id": "t1_fyhm519",
                    "score": 17,
                    "created_utc": 1595102113.0,
                    "replies": [
                        {
                            "body": "Can i see a pic of your hair? Please :)",
                            "author": "itisallgoodyouknow",
                            "id": "fyhrqm2",
                            "parent_id": "t1_fyhpk8t",
                            "score": 5,
                            "created_utc": 1595103309.0,
                            "replies": [
                                {
                                    "body": "Curly and super frissy hair  \n\n\nThis is without:   [https://gyazo.com/138459375546b16dc28e9bfb6eb5e471](https://gyazo.com/138459375546b16dc28e9bfb6eb5e471) \n\nThis is with literally just a touch and no comb-work or anything:  [https://gyazo.com/0ccb0130a0b4aa989121daeb2b597914](https://gyazo.com/0ccb0130a0b4aa989121daeb2b597914) \n\nThis is the day after (again, no combing or styling):  [https://gyazo.com/1d13bc7b5d0fb70613a7105ae0a3e13f](https://gyazo.com/1d13bc7b5d0fb70613a7105ae0a3e13f) \n\n&#x200B;\n\nBasically, it gives a light hold, gathers up your hair really nicely and gives it a nice and collected look. For me, it basically kills friss for about 24 hours and that's with using only a limited amount of the stuff. I don't really have the hair for a neat and straighter style (such as the one Evans has), but I think I could absolutely achieve my equivalent of it with maybe two globs of the stuff instead of one and some proper comb-work.\n\nIt also smells so damn nice, bees-wax and mineral oils.",
                                    "author": "Neknoh",
                                    "id": "fyhua8w",
                                    "parent_id": "t1_fyhrqm2",
                                    "score": 28,
                                    "created_utc": 1595104699.0,
                                    "replies": [
                                        {
                                            "body": "Dude thank you so much! About to order some of this. Nice hair btw",
                                            "author": "itisallgoodyouknow",
                                            "id": "fyhufqp",
                                            "parent_id": "t1_fyhua8w",
                                            "score": 7,
                                            "created_utc": 1595104786.0,
                                            "replies": [
                                                {
                                                    "body": "No worries at all mate, it's been around for so damn long! I always thought it was going to be like, a tube of super greasy stuff, but it's a really light and fluffy mousse that isn't any oilier than, say, argan oil/silk drops or whatever but works so much better and gives styling options.\n\nTry it out and see what you think, experiment and see if you need like, just a tiny ammount or more of a glob of it. No idea what your hair is like or anything and can only speak for myself.",
                                                    "author": "Neknoh",
                                                    "id": "fyhv0uz",
                                                    "parent_id": "t1_fyhufqp",
                                                    "score": 11,
                                                    "created_utc": 1595105113.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "I use 3 different Gatsby products. Granted there a knockoff type and the actual (japanese?) product. I'll send a link to the ones I've been buying for years.\n\nOrange, gray and blue. Usually on ebay or amazon for 10 bucks each and has a G in the middle. The sticker has an asian guy with localized writing on it.\n\nI use the orange one mainly as it's a loose shuffle allowing me to have a soft hold and manipulate it thru the day. \n\nI use a tiny bit of the gray stuff to have a little extra hold on the side hairs that do their own thing. \n\nAnd I use blue occasionally if I want it to have a wet look. \n\nUsually I'll do it as the hair mostly dry and then comb and use the dryer to shape. After that holds for about 10 minutes I can play with it without losing much of the style.\n\nAgain everyones hair is diff and I'm no pro but overall this has given me a lot of the looks I like, similiar to Chris, and it handles my workload. Granted when I'm active and sweating it will depend on the styling I did becuase being in the heat a lot or getting it wet will throw it off so I always keep a few hats in the car. I can typically get my hair good to go in like 5 minutes though.\n\nI will try a few of the suggestions here though since I always like having options if I'm ever in a pinch and cant order my stuff quickly.",
                    "author": "ThisFckinGuy",
                    "id": "fyhwgun",
                    "parent_id": "t1_fyhm519",
                    "score": 3,
                    "created_utc": 1595105915.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fyhuae9",
            "parent_id": "t1_fyhao5x",
            "score": 3,
            "created_utc": 1595104701.0,
            "replies": [
                {
                    "body": "It's been super easy to get out, again, it's oil and beeswax whipped to a light cream, it isn't sticky or anything. If you use a lot, it gets that sort of oily/fatty feel, but that IS also how pretty much the entire rockabilly scene got their hair done back in the day.\n\n(https://nostalgiacentral.com/pop-culture/fashion/brylcreem/)\n\nSo basically, too much and it gets a bit greasy, but nowhere near that sticky, half-dry, tacky and stale feeling that you get from gels or sprays, it just helps with the friss. I did it daily for a weak and my hair is WAY better now, even some two weeks after having forgotten to do it daily than it was before. Think of it as argan-oil or silk-drops or something else you just put into your hair after the shower, but it gives a light hold and some styling options as well.\n\nSo I would absolutely recommend to try it at least, usually 4-9 dollars depending on where you are, but like, it's worth a try.",
                    "author": "Neknoh",
                    "id": "fyhuuye",
                    "parent_id": "t1_fyhuae9",
                    "score": 5,
                    "created_utc": 1595105021.0,
                    "replies": []
                },
                {
                    "body": "It might help with the frizz. \n\nHave you tried argan or jojoba oil? I have medium thick hair that gets thinner and frizzier the longer I grow it out. I put a pea-size of amount of paul mitchell conditioner in my palm and add ONE drop of jojoba oil, mix it in my palms and work through to the tips of my damp hair. More than a drop and my hair looks oily. But one drop and it tames the frizz and gives it a nice sheen.",
                    "author": "billbixbyakahulk",
                    "id": "fyi515a",
                    "parent_id": "t1_fyhuae9",
                    "score": 1,
                    "created_utc": 1595110837.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "There have been a few posts on here that show that he has had a hair transplant. His hair genetics are not good.",
            "author": "helpmeimprove87",
            "id": "fyi6srk",
            "parent_id": "t1_fyh9srf",
            "score": 5,
            "created_utc": 1595111848.0,
            "replies": [
                {
                    "body": "Is there any proof? This is the first time I'm hearing this. I mean sometimes you can tell, for example Elon Musk.",
                    "author": "speedy117",
                    "id": "fyiditf",
                    "parent_id": "t1_fyi6srk",
                    "score": 2,
                    "created_utc": 1595115768.0,
                    "replies": [
                        {
                            "body": "Umm u could tell the difference if u watch his old work he has more receding hairline in them but I don't know for sure",
                            "author": "vansh_khatri1",
                            "id": "fyihwq7",
                            "parent_id": "t1_fyiditf",
                            "score": 6,
                            "created_utc": 1595118515.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fyhkwxf",
            "parent_id": "t1_fyhks4o",
            "score": -10,
            "created_utc": 1595099520.0,
            "replies": [
                {
                    "body": "https://www.healthline.com/health/healthy-sex/female-ejaculation#overview",
                    "author": null,
                    "id": "fyhl330",
                    "parent_id": "t1_fyhkwxf",
                    "score": 10,
                    "created_utc": 1595099614.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "fyhn6qy",
                            "parent_id": "t1_fyhl330",
                            "score": -20,
                            "created_utc": 1595100782.0,
                            "replies": [
                                {
                                    "body": "Ejaculate just means \"thing that gets ejected\"",
                                    "author": "Pyroven",
                                    "id": "fyigrfb",
                                    "parent_id": "t1_fyhn6qy",
                                    "score": 8,
                                    "created_utc": 1595117786.0,
                                    "replies": []
                                },
                                {
                                    "body": "Proof yet again that any Reddit post is exactly two degrees of comments from a semantic argument over ejaculation.",
                                    "author": "TimFTWin",
                                    "id": "fyi8bib",
                                    "parent_id": "t1_fyhn6qy",
                                    "score": 7,
                                    "created_utc": 1595112703.0,
                                    "replies": [
                                        {
                                            "body": "I'd give ya an award if I wasn't broke bruv thanks for the laugh",
                                            "author": null,
                                            "id": "fyjarn9",
                                            "parent_id": "t1_fyi8bib",
                                            "score": 1,
                                            "created_utc": 1595139050.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "I think that's more a product of male ignorance though, I don't want to go full-blown feminist but it's not like historically the female orgasm has been valued or even known to occur. try looking up the definition of the word squirt, words aren't bound by the dictionary, unless you have a better word for what women do when ya know what to do I don't see how ejaculate would be incorrect.",
                                    "author": null,
                                    "id": "fyhoxoj",
                                    "parent_id": "t1_fyhn6qy",
                                    "score": 1,
                                    "created_utc": 1595101759.0,
                                    "replies": [
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "fyhp4k1",
                                            "parent_id": "t1_fyhoxoj",
                                            "score": -5,
                                            "created_utc": 1595101866.0,
                                            "replies": [
                                                {
                                                    "body": "[deleted]",
                                                    "author": null,
                                                    "id": "fyiixtn",
                                                    "parent_id": "t1_fyhp4k1",
                                                    "score": 3,
                                                    "created_utc": 1595119177.0,
                                                    "replies": [
                                                        {
                                                            "body": "[deleted]",
                                                            "author": null,
                                                            "id": "fyij1ra",
                                                            "parent_id": "t1_fyiixtn",
                                                            "score": 1,
                                                            "created_utc": 1595119248.0,
                                                            "replies": [
                                                                {
                                                                    "body": "[deleted]",
                                                                    "author": null,
                                                                    "id": "fyij4wy",
                                                                    "parent_id": "t1_fyij1ra",
                                                                    "score": 1,
                                                                    "created_utc": 1595119305.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fyjbzpm",
            "parent_id": "t1_fyjbns3",
            "score": -2,
            "created_utc": 1595140185.0,
            "replies": [
                {
                    "body": "It’s not about female orgasm in general, girls can squirt if you know what you’re doing. It’s called female ejaculation.",
                    "author": "immediatethor",
                    "id": "fyjf60m",
                    "parent_id": "t1_fyjbzpm",
                    "score": 1,
                    "created_utc": 1595143276.0,
                    "replies": [
                        {
                            "body": "It's just piss",
                            "author": "sandowian",
                            "id": "fyk0llf",
                            "parent_id": "t1_fyjf60m",
                            "score": 0,
                            "created_utc": 1595164647.0,
                            "replies": [
                                {
                                    "body": "Not exactly, no. \n\n\"According to a [2011 study](https://www.jsm.jsexmed.org/article/S1743-6095(15)33346-4/fulltext), female ejaculate contains some of the same components as semen. This includes prostate specific antigen (PSA) and prostatic acid phosphatase. It also contains small amounts of creatinine and urea, urine’s primary components.\"",
                                    "author": "immediatethor",
                                    "id": "fyk37kw",
                                    "parent_id": "t1_fyk0llf",
                                    "score": 1,
                                    "created_utc": 1595166484.0,
                                    "replies": [
                                        {
                                            "body": "Funny how it seems to contain stuff that's only produced in the prostate... which women don't have",
                                            "author": "sandowian",
                                            "id": "fykhyhd",
                                            "parent_id": "t1_fyk37kw",
                                            "score": 0,
                                            "created_utc": 1595175130.0,
                                            "replies": [
                                                {
                                                    "body": "“While women do not have prostates, they do have a series of glands and ducts at the front of the vagina called the Skene glands, which are sometimes referred to as the female prostate.\n\nResearchers have discovered that the Skene glands share some of the same properties as the male prostate. For example, both the prostate and the Skene glands contain prostate-specific antigen (PSA) and PSA phosphatase (PSAP).”",
                                                    "author": "immediatethor",
                                                    "id": "fykin2w",
                                                    "parent_id": "t1_fykhyhd",
                                                    "score": 1,
                                                    "created_utc": 1595175500.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Huh, might actually work. Thanks man!",
            "author": "cranky-alpha",
            "id": "fyhoc1f",
            "parent_id": "t1_fyhi7oj",
            "score": 1,
            "created_utc": 1595101422.0,
            "replies": [
                {
                    "body": "LA Looks Extreme sport is still around and is alcohol free.",
                    "author": null,
                    "id": "fyhswls",
                    "parent_id": "t1_fyhoc1f",
                    "score": 3,
                    "created_utc": 1595103924.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yeah, it's a light hold, so needs more for a slicker look, but honestly, just a little bit comped into the hair is probably the best styling I've had.",
            "author": "Neknoh",
            "id": "fyhdsgp",
            "parent_id": "t1_fyhaslv",
            "score": 27,
            "created_utc": 1595095632.0,
            "replies": []
        },
        {
            "body": "This is the one I'm using\nhttps://www.pricerunner.se/product/640x640/1684651518/Brylcreem-Original-Light-Glossy-Hold-Protein-Enriched-150ml.jpg\n\nJust classic, old-school brylcreem",
            "author": "Neknoh",
            "id": "fyhpk8t",
            "parent_id": "t1_fyhm519",
            "score": 17,
            "created_utc": 1595102113.0,
            "replies": [
                {
                    "body": "Can i see a pic of your hair? Please :)",
                    "author": "itisallgoodyouknow",
                    "id": "fyhrqm2",
                    "parent_id": "t1_fyhpk8t",
                    "score": 5,
                    "created_utc": 1595103309.0,
                    "replies": [
                        {
                            "body": "Curly and super frissy hair  \n\n\nThis is without:   [https://gyazo.com/138459375546b16dc28e9bfb6eb5e471](https://gyazo.com/138459375546b16dc28e9bfb6eb5e471) \n\nThis is with literally just a touch and no comb-work or anything:  [https://gyazo.com/0ccb0130a0b4aa989121daeb2b597914](https://gyazo.com/0ccb0130a0b4aa989121daeb2b597914) \n\nThis is the day after (again, no combing or styling):  [https://gyazo.com/1d13bc7b5d0fb70613a7105ae0a3e13f](https://gyazo.com/1d13bc7b5d0fb70613a7105ae0a3e13f) \n\n&#x200B;\n\nBasically, it gives a light hold, gathers up your hair really nicely and gives it a nice and collected look. For me, it basically kills friss for about 24 hours and that's with using only a limited amount of the stuff. I don't really have the hair for a neat and straighter style (such as the one Evans has), but I think I could absolutely achieve my equivalent of it with maybe two globs of the stuff instead of one and some proper comb-work.\n\nIt also smells so damn nice, bees-wax and mineral oils.",
                            "author": "Neknoh",
                            "id": "fyhua8w",
                            "parent_id": "t1_fyhrqm2",
                            "score": 28,
                            "created_utc": 1595104699.0,
                            "replies": [
                                {
                                    "body": "Dude thank you so much! About to order some of this. Nice hair btw",
                                    "author": "itisallgoodyouknow",
                                    "id": "fyhufqp",
                                    "parent_id": "t1_fyhua8w",
                                    "score": 7,
                                    "created_utc": 1595104786.0,
                                    "replies": [
                                        {
                                            "body": "No worries at all mate, it's been around for so damn long! I always thought it was going to be like, a tube of super greasy stuff, but it's a really light and fluffy mousse that isn't any oilier than, say, argan oil/silk drops or whatever but works so much better and gives styling options.\n\nTry it out and see what you think, experiment and see if you need like, just a tiny ammount or more of a glob of it. No idea what your hair is like or anything and can only speak for myself.",
                                            "author": "Neknoh",
                                            "id": "fyhv0uz",
                                            "parent_id": "t1_fyhufqp",
                                            "score": 11,
                                            "created_utc": 1595105113.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I use 3 different Gatsby products. Granted there a knockoff type and the actual (japanese?) product. I'll send a link to the ones I've been buying for years.\n\nOrange, gray and blue. Usually on ebay or amazon for 10 bucks each and has a G in the middle. The sticker has an asian guy with localized writing on it.\n\nI use the orange one mainly as it's a loose shuffle allowing me to have a soft hold and manipulate it thru the day. \n\nI use a tiny bit of the gray stuff to have a little extra hold on the side hairs that do their own thing. \n\nAnd I use blue occasionally if I want it to have a wet look. \n\nUsually I'll do it as the hair mostly dry and then comb and use the dryer to shape. After that holds for about 10 minutes I can play with it without losing much of the style.\n\nAgain everyones hair is diff and I'm no pro but overall this has given me a lot of the looks I like, similiar to Chris, and it handles my workload. Granted when I'm active and sweating it will depend on the styling I did becuase being in the heat a lot or getting it wet will throw it off so I always keep a few hats in the car. I can typically get my hair good to go in like 5 minutes though.\n\nI will try a few of the suggestions here though since I always like having options if I'm ever in a pinch and cant order my stuff quickly.",
            "author": "ThisFckinGuy",
            "id": "fyhwgun",
            "parent_id": "t1_fyhm519",
            "score": 3,
            "created_utc": 1595105915.0,
            "replies": []
        },
        {
            "body": "It's been super easy to get out, again, it's oil and beeswax whipped to a light cream, it isn't sticky or anything. If you use a lot, it gets that sort of oily/fatty feel, but that IS also how pretty much the entire rockabilly scene got their hair done back in the day.\n\n(https://nostalgiacentral.com/pop-culture/fashion/brylcreem/)\n\nSo basically, too much and it gets a bit greasy, but nowhere near that sticky, half-dry, tacky and stale feeling that you get from gels or sprays, it just helps with the friss. I did it daily for a weak and my hair is WAY better now, even some two weeks after having forgotten to do it daily than it was before. Think of it as argan-oil or silk-drops or something else you just put into your hair after the shower, but it gives a light hold and some styling options as well.\n\nSo I would absolutely recommend to try it at least, usually 4-9 dollars depending on where you are, but like, it's worth a try.",
            "author": "Neknoh",
            "id": "fyhuuye",
            "parent_id": "t1_fyhuae9",
            "score": 5,
            "created_utc": 1595105021.0,
            "replies": []
        },
        {
            "body": "It might help with the frizz. \n\nHave you tried argan or jojoba oil? I have medium thick hair that gets thinner and frizzier the longer I grow it out. I put a pea-size of amount of paul mitchell conditioner in my palm and add ONE drop of jojoba oil, mix it in my palms and work through to the tips of my damp hair. More than a drop and my hair looks oily. But one drop and it tames the frizz and gives it a nice sheen.",
            "author": "billbixbyakahulk",
            "id": "fyi515a",
            "parent_id": "t1_fyhuae9",
            "score": 1,
            "created_utc": 1595110837.0,
            "replies": []
        },
        {
            "body": "Is there any proof? This is the first time I'm hearing this. I mean sometimes you can tell, for example Elon Musk.",
            "author": "speedy117",
            "id": "fyiditf",
            "parent_id": "t1_fyi6srk",
            "score": 2,
            "created_utc": 1595115768.0,
            "replies": [
                {
                    "body": "Umm u could tell the difference if u watch his old work he has more receding hairline in them but I don't know for sure",
                    "author": "vansh_khatri1",
                    "id": "fyihwq7",
                    "parent_id": "t1_fyiditf",
                    "score": 6,
                    "created_utc": 1595118515.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "https://www.healthline.com/health/healthy-sex/female-ejaculation#overview",
            "author": null,
            "id": "fyhl330",
            "parent_id": "t1_fyhkwxf",
            "score": 10,
            "created_utc": 1595099614.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "fyhn6qy",
                    "parent_id": "t1_fyhl330",
                    "score": -20,
                    "created_utc": 1595100782.0,
                    "replies": [
                        {
                            "body": "Ejaculate just means \"thing that gets ejected\"",
                            "author": "Pyroven",
                            "id": "fyigrfb",
                            "parent_id": "t1_fyhn6qy",
                            "score": 8,
                            "created_utc": 1595117786.0,
                            "replies": []
                        },
                        {
                            "body": "Proof yet again that any Reddit post is exactly two degrees of comments from a semantic argument over ejaculation.",
                            "author": "TimFTWin",
                            "id": "fyi8bib",
                            "parent_id": "t1_fyhn6qy",
                            "score": 7,
                            "created_utc": 1595112703.0,
                            "replies": [
                                {
                                    "body": "I'd give ya an award if I wasn't broke bruv thanks for the laugh",
                                    "author": null,
                                    "id": "fyjarn9",
                                    "parent_id": "t1_fyi8bib",
                                    "score": 1,
                                    "created_utc": 1595139050.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "I think that's more a product of male ignorance though, I don't want to go full-blown feminist but it's not like historically the female orgasm has been valued or even known to occur. try looking up the definition of the word squirt, words aren't bound by the dictionary, unless you have a better word for what women do when ya know what to do I don't see how ejaculate would be incorrect.",
                            "author": null,
                            "id": "fyhoxoj",
                            "parent_id": "t1_fyhn6qy",
                            "score": 1,
                            "created_utc": 1595101759.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "fyhp4k1",
                                    "parent_id": "t1_fyhoxoj",
                                    "score": -5,
                                    "created_utc": 1595101866.0,
                                    "replies": [
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "fyiixtn",
                                            "parent_id": "t1_fyhp4k1",
                                            "score": 3,
                                            "created_utc": 1595119177.0,
                                            "replies": [
                                                {
                                                    "body": "[deleted]",
                                                    "author": null,
                                                    "id": "fyij1ra",
                                                    "parent_id": "t1_fyiixtn",
                                                    "score": 1,
                                                    "created_utc": 1595119248.0,
                                                    "replies": [
                                                        {
                                                            "body": "[deleted]",
                                                            "author": null,
                                                            "id": "fyij4wy",
                                                            "parent_id": "t1_fyij1ra",
                                                            "score": 1,
                                                            "created_utc": 1595119305.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "It’s not about female orgasm in general, girls can squirt if you know what you’re doing. It’s called female ejaculation.",
            "author": "immediatethor",
            "id": "fyjf60m",
            "parent_id": "t1_fyjbzpm",
            "score": 1,
            "created_utc": 1595143276.0,
            "replies": [
                {
                    "body": "It's just piss",
                    "author": "sandowian",
                    "id": "fyk0llf",
                    "parent_id": "t1_fyjf60m",
                    "score": 0,
                    "created_utc": 1595164647.0,
                    "replies": [
                        {
                            "body": "Not exactly, no. \n\n\"According to a [2011 study](https://www.jsm.jsexmed.org/article/S1743-6095(15)33346-4/fulltext), female ejaculate contains some of the same components as semen. This includes prostate specific antigen (PSA) and prostatic acid phosphatase. It also contains small amounts of creatinine and urea, urine’s primary components.\"",
                            "author": "immediatethor",
                            "id": "fyk37kw",
                            "parent_id": "t1_fyk0llf",
                            "score": 1,
                            "created_utc": 1595166484.0,
                            "replies": [
                                {
                                    "body": "Funny how it seems to contain stuff that's only produced in the prostate... which women don't have",
                                    "author": "sandowian",
                                    "id": "fykhyhd",
                                    "parent_id": "t1_fyk37kw",
                                    "score": 0,
                                    "created_utc": 1595175130.0,
                                    "replies": [
                                        {
                                            "body": "“While women do not have prostates, they do have a series of glands and ducts at the front of the vagina called the Skene glands, which are sometimes referred to as the female prostate.\n\nResearchers have discovered that the Skene glands share some of the same properties as the male prostate. For example, both the prostate and the Skene glands contain prostate-specific antigen (PSA) and PSA phosphatase (PSAP).”",
                                            "author": "immediatethor",
                                            "id": "fykin2w",
                                            "parent_id": "t1_fykhyhd",
                                            "score": 1,
                                            "created_utc": 1595175500.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "LA Looks Extreme sport is still around and is alcohol free.",
            "author": null,
            "id": "fyhswls",
            "parent_id": "t1_fyhoc1f",
            "score": 3,
            "created_utc": 1595103924.0,
            "replies": []
        },
        {
            "body": "Can i see a pic of your hair? Please :)",
            "author": "itisallgoodyouknow",
            "id": "fyhrqm2",
            "parent_id": "t1_fyhpk8t",
            "score": 5,
            "created_utc": 1595103309.0,
            "replies": [
                {
                    "body": "Curly and super frissy hair  \n\n\nThis is without:   [https://gyazo.com/138459375546b16dc28e9bfb6eb5e471](https://gyazo.com/138459375546b16dc28e9bfb6eb5e471) \n\nThis is with literally just a touch and no comb-work or anything:  [https://gyazo.com/0ccb0130a0b4aa989121daeb2b597914](https://gyazo.com/0ccb0130a0b4aa989121daeb2b597914) \n\nThis is the day after (again, no combing or styling):  [https://gyazo.com/1d13bc7b5d0fb70613a7105ae0a3e13f](https://gyazo.com/1d13bc7b5d0fb70613a7105ae0a3e13f) \n\n&#x200B;\n\nBasically, it gives a light hold, gathers up your hair really nicely and gives it a nice and collected look. For me, it basically kills friss for about 24 hours and that's with using only a limited amount of the stuff. I don't really have the hair for a neat and straighter style (such as the one Evans has), but I think I could absolutely achieve my equivalent of it with maybe two globs of the stuff instead of one and some proper comb-work.\n\nIt also smells so damn nice, bees-wax and mineral oils.",
                    "author": "Neknoh",
                    "id": "fyhua8w",
                    "parent_id": "t1_fyhrqm2",
                    "score": 28,
                    "created_utc": 1595104699.0,
                    "replies": [
                        {
                            "body": "Dude thank you so much! About to order some of this. Nice hair btw",
                            "author": "itisallgoodyouknow",
                            "id": "fyhufqp",
                            "parent_id": "t1_fyhua8w",
                            "score": 7,
                            "created_utc": 1595104786.0,
                            "replies": [
                                {
                                    "body": "No worries at all mate, it's been around for so damn long! I always thought it was going to be like, a tube of super greasy stuff, but it's a really light and fluffy mousse that isn't any oilier than, say, argan oil/silk drops or whatever but works so much better and gives styling options.\n\nTry it out and see what you think, experiment and see if you need like, just a tiny ammount or more of a glob of it. No idea what your hair is like or anything and can only speak for myself.",
                                    "author": "Neknoh",
                                    "id": "fyhv0uz",
                                    "parent_id": "t1_fyhufqp",
                                    "score": 11,
                                    "created_utc": 1595105113.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Umm u could tell the difference if u watch his old work he has more receding hairline in them but I don't know for sure",
            "author": "vansh_khatri1",
            "id": "fyihwq7",
            "parent_id": "t1_fyiditf",
            "score": 6,
            "created_utc": 1595118515.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fyhn6qy",
            "parent_id": "t1_fyhl330",
            "score": -20,
            "created_utc": 1595100782.0,
            "replies": [
                {
                    "body": "Ejaculate just means \"thing that gets ejected\"",
                    "author": "Pyroven",
                    "id": "fyigrfb",
                    "parent_id": "t1_fyhn6qy",
                    "score": 8,
                    "created_utc": 1595117786.0,
                    "replies": []
                },
                {
                    "body": "Proof yet again that any Reddit post is exactly two degrees of comments from a semantic argument over ejaculation.",
                    "author": "TimFTWin",
                    "id": "fyi8bib",
                    "parent_id": "t1_fyhn6qy",
                    "score": 7,
                    "created_utc": 1595112703.0,
                    "replies": [
                        {
                            "body": "I'd give ya an award if I wasn't broke bruv thanks for the laugh",
                            "author": null,
                            "id": "fyjarn9",
                            "parent_id": "t1_fyi8bib",
                            "score": 1,
                            "created_utc": 1595139050.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "I think that's more a product of male ignorance though, I don't want to go full-blown feminist but it's not like historically the female orgasm has been valued or even known to occur. try looking up the definition of the word squirt, words aren't bound by the dictionary, unless you have a better word for what women do when ya know what to do I don't see how ejaculate would be incorrect.",
                    "author": null,
                    "id": "fyhoxoj",
                    "parent_id": "t1_fyhn6qy",
                    "score": 1,
                    "created_utc": 1595101759.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "fyhp4k1",
                            "parent_id": "t1_fyhoxoj",
                            "score": -5,
                            "created_utc": 1595101866.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "fyiixtn",
                                    "parent_id": "t1_fyhp4k1",
                                    "score": 3,
                                    "created_utc": 1595119177.0,
                                    "replies": [
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "fyij1ra",
                                            "parent_id": "t1_fyiixtn",
                                            "score": 1,
                                            "created_utc": 1595119248.0,
                                            "replies": [
                                                {
                                                    "body": "[deleted]",
                                                    "author": null,
                                                    "id": "fyij4wy",
                                                    "parent_id": "t1_fyij1ra",
                                                    "score": 1,
                                                    "created_utc": 1595119305.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "It's just piss",
            "author": "sandowian",
            "id": "fyk0llf",
            "parent_id": "t1_fyjf60m",
            "score": 0,
            "created_utc": 1595164647.0,
            "replies": [
                {
                    "body": "Not exactly, no. \n\n\"According to a [2011 study](https://www.jsm.jsexmed.org/article/S1743-6095(15)33346-4/fulltext), female ejaculate contains some of the same components as semen. This includes prostate specific antigen (PSA) and prostatic acid phosphatase. It also contains small amounts of creatinine and urea, urine’s primary components.\"",
                    "author": "immediatethor",
                    "id": "fyk37kw",
                    "parent_id": "t1_fyk0llf",
                    "score": 1,
                    "created_utc": 1595166484.0,
                    "replies": [
                        {
                            "body": "Funny how it seems to contain stuff that's only produced in the prostate... which women don't have",
                            "author": "sandowian",
                            "id": "fykhyhd",
                            "parent_id": "t1_fyk37kw",
                            "score": 0,
                            "created_utc": 1595175130.0,
                            "replies": [
                                {
                                    "body": "“While women do not have prostates, they do have a series of glands and ducts at the front of the vagina called the Skene glands, which are sometimes referred to as the female prostate.\n\nResearchers have discovered that the Skene glands share some of the same properties as the male prostate. For example, both the prostate and the Skene glands contain prostate-specific antigen (PSA) and PSA phosphatase (PSAP).”",
                                    "author": "immediatethor",
                                    "id": "fykin2w",
                                    "parent_id": "t1_fykhyhd",
                                    "score": 1,
                                    "created_utc": 1595175500.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Curly and super frissy hair  \n\n\nThis is without:   [https://gyazo.com/138459375546b16dc28e9bfb6eb5e471](https://gyazo.com/138459375546b16dc28e9bfb6eb5e471) \n\nThis is with literally just a touch and no comb-work or anything:  [https://gyazo.com/0ccb0130a0b4aa989121daeb2b597914](https://gyazo.com/0ccb0130a0b4aa989121daeb2b597914) \n\nThis is the day after (again, no combing or styling):  [https://gyazo.com/1d13bc7b5d0fb70613a7105ae0a3e13f](https://gyazo.com/1d13bc7b5d0fb70613a7105ae0a3e13f) \n\n&#x200B;\n\nBasically, it gives a light hold, gathers up your hair really nicely and gives it a nice and collected look. For me, it basically kills friss for about 24 hours and that's with using only a limited amount of the stuff. I don't really have the hair for a neat and straighter style (such as the one Evans has), but I think I could absolutely achieve my equivalent of it with maybe two globs of the stuff instead of one and some proper comb-work.\n\nIt also smells so damn nice, bees-wax and mineral oils.",
            "author": "Neknoh",
            "id": "fyhua8w",
            "parent_id": "t1_fyhrqm2",
            "score": 28,
            "created_utc": 1595104699.0,
            "replies": [
                {
                    "body": "Dude thank you so much! About to order some of this. Nice hair btw",
                    "author": "itisallgoodyouknow",
                    "id": "fyhufqp",
                    "parent_id": "t1_fyhua8w",
                    "score": 7,
                    "created_utc": 1595104786.0,
                    "replies": [
                        {
                            "body": "No worries at all mate, it's been around for so damn long! I always thought it was going to be like, a tube of super greasy stuff, but it's a really light and fluffy mousse that isn't any oilier than, say, argan oil/silk drops or whatever but works so much better and gives styling options.\n\nTry it out and see what you think, experiment and see if you need like, just a tiny ammount or more of a glob of it. No idea what your hair is like or anything and can only speak for myself.",
                            "author": "Neknoh",
                            "id": "fyhv0uz",
                            "parent_id": "t1_fyhufqp",
                            "score": 11,
                            "created_utc": 1595105113.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Ejaculate just means \"thing that gets ejected\"",
            "author": "Pyroven",
            "id": "fyigrfb",
            "parent_id": "t1_fyhn6qy",
            "score": 8,
            "created_utc": 1595117786.0,
            "replies": []
        },
        {
            "body": "Proof yet again that any Reddit post is exactly two degrees of comments from a semantic argument over ejaculation.",
            "author": "TimFTWin",
            "id": "fyi8bib",
            "parent_id": "t1_fyhn6qy",
            "score": 7,
            "created_utc": 1595112703.0,
            "replies": [
                {
                    "body": "I'd give ya an award if I wasn't broke bruv thanks for the laugh",
                    "author": null,
                    "id": "fyjarn9",
                    "parent_id": "t1_fyi8bib",
                    "score": 1,
                    "created_utc": 1595139050.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I think that's more a product of male ignorance though, I don't want to go full-blown feminist but it's not like historically the female orgasm has been valued or even known to occur. try looking up the definition of the word squirt, words aren't bound by the dictionary, unless you have a better word for what women do when ya know what to do I don't see how ejaculate would be incorrect.",
            "author": null,
            "id": "fyhoxoj",
            "parent_id": "t1_fyhn6qy",
            "score": 1,
            "created_utc": 1595101759.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "fyhp4k1",
                    "parent_id": "t1_fyhoxoj",
                    "score": -5,
                    "created_utc": 1595101866.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "fyiixtn",
                            "parent_id": "t1_fyhp4k1",
                            "score": 3,
                            "created_utc": 1595119177.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "fyij1ra",
                                    "parent_id": "t1_fyiixtn",
                                    "score": 1,
                                    "created_utc": 1595119248.0,
                                    "replies": [
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "fyij4wy",
                                            "parent_id": "t1_fyij1ra",
                                            "score": 1,
                                            "created_utc": 1595119305.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Not exactly, no. \n\n\"According to a [2011 study](https://www.jsm.jsexmed.org/article/S1743-6095(15)33346-4/fulltext), female ejaculate contains some of the same components as semen. This includes prostate specific antigen (PSA) and prostatic acid phosphatase. It also contains small amounts of creatinine and urea, urine’s primary components.\"",
            "author": "immediatethor",
            "id": "fyk37kw",
            "parent_id": "t1_fyk0llf",
            "score": 1,
            "created_utc": 1595166484.0,
            "replies": [
                {
                    "body": "Funny how it seems to contain stuff that's only produced in the prostate... which women don't have",
                    "author": "sandowian",
                    "id": "fykhyhd",
                    "parent_id": "t1_fyk37kw",
                    "score": 0,
                    "created_utc": 1595175130.0,
                    "replies": [
                        {
                            "body": "“While women do not have prostates, they do have a series of glands and ducts at the front of the vagina called the Skene glands, which are sometimes referred to as the female prostate.\n\nResearchers have discovered that the Skene glands share some of the same properties as the male prostate. For example, both the prostate and the Skene glands contain prostate-specific antigen (PSA) and PSA phosphatase (PSAP).”",
                            "author": "immediatethor",
                            "id": "fykin2w",
                            "parent_id": "t1_fykhyhd",
                            "score": 1,
                            "created_utc": 1595175500.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Dude thank you so much! About to order some of this. Nice hair btw",
            "author": "itisallgoodyouknow",
            "id": "fyhufqp",
            "parent_id": "t1_fyhua8w",
            "score": 7,
            "created_utc": 1595104786.0,
            "replies": [
                {
                    "body": "No worries at all mate, it's been around for so damn long! I always thought it was going to be like, a tube of super greasy stuff, but it's a really light and fluffy mousse that isn't any oilier than, say, argan oil/silk drops or whatever but works so much better and gives styling options.\n\nTry it out and see what you think, experiment and see if you need like, just a tiny ammount or more of a glob of it. No idea what your hair is like or anything and can only speak for myself.",
                    "author": "Neknoh",
                    "id": "fyhv0uz",
                    "parent_id": "t1_fyhufqp",
                    "score": 11,
                    "created_utc": 1595105113.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I'd give ya an award if I wasn't broke bruv thanks for the laugh",
            "author": null,
            "id": "fyjarn9",
            "parent_id": "t1_fyi8bib",
            "score": 1,
            "created_utc": 1595139050.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fyhp4k1",
            "parent_id": "t1_fyhoxoj",
            "score": -5,
            "created_utc": 1595101866.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "fyiixtn",
                    "parent_id": "t1_fyhp4k1",
                    "score": 3,
                    "created_utc": 1595119177.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "fyij1ra",
                            "parent_id": "t1_fyiixtn",
                            "score": 1,
                            "created_utc": 1595119248.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "fyij4wy",
                                    "parent_id": "t1_fyij1ra",
                                    "score": 1,
                                    "created_utc": 1595119305.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Funny how it seems to contain stuff that's only produced in the prostate... which women don't have",
            "author": "sandowian",
            "id": "fykhyhd",
            "parent_id": "t1_fyk37kw",
            "score": 0,
            "created_utc": 1595175130.0,
            "replies": [
                {
                    "body": "“While women do not have prostates, they do have a series of glands and ducts at the front of the vagina called the Skene glands, which are sometimes referred to as the female prostate.\n\nResearchers have discovered that the Skene glands share some of the same properties as the male prostate. For example, both the prostate and the Skene glands contain prostate-specific antigen (PSA) and PSA phosphatase (PSAP).”",
                    "author": "immediatethor",
                    "id": "fykin2w",
                    "parent_id": "t1_fykhyhd",
                    "score": 1,
                    "created_utc": 1595175500.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "No worries at all mate, it's been around for so damn long! I always thought it was going to be like, a tube of super greasy stuff, but it's a really light and fluffy mousse that isn't any oilier than, say, argan oil/silk drops or whatever but works so much better and gives styling options.\n\nTry it out and see what you think, experiment and see if you need like, just a tiny ammount or more of a glob of it. No idea what your hair is like or anything and can only speak for myself.",
            "author": "Neknoh",
            "id": "fyhv0uz",
            "parent_id": "t1_fyhufqp",
            "score": 11,
            "created_utc": 1595105113.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fyiixtn",
            "parent_id": "t1_fyhp4k1",
            "score": 3,
            "created_utc": 1595119177.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "fyij1ra",
                    "parent_id": "t1_fyiixtn",
                    "score": 1,
                    "created_utc": 1595119248.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "fyij4wy",
                            "parent_id": "t1_fyij1ra",
                            "score": 1,
                            "created_utc": 1595119305.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "“While women do not have prostates, they do have a series of glands and ducts at the front of the vagina called the Skene glands, which are sometimes referred to as the female prostate.\n\nResearchers have discovered that the Skene glands share some of the same properties as the male prostate. For example, both the prostate and the Skene glands contain prostate-specific antigen (PSA) and PSA phosphatase (PSAP).”",
            "author": "immediatethor",
            "id": "fykin2w",
            "parent_id": "t1_fykhyhd",
            "score": 1,
            "created_utc": 1595175500.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fyij1ra",
            "parent_id": "t1_fyiixtn",
            "score": 1,
            "created_utc": 1595119248.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "fyij4wy",
                    "parent_id": "t1_fyij1ra",
                    "score": 1,
                    "created_utc": 1595119305.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "fyij4wy",
            "parent_id": "t1_fyij1ra",
            "score": 1,
            "created_utc": 1595119305.0,
            "replies": []
        }
    ]
}