{
    "title": "🤣🤣",
    "post_id": "oerzyg",
    "post_url": "https://www.reddit.com/r/dankruto/comments/oerzyg/_/",
    "author": "KindheartednessNo434",
    "body": "",
    "url": "https://i.redd.it/7n1u2xeahk971.jpg",
    "score": 5020,
    "upvote_ratio": 0.99,
    "created_utc": 1625566168.0,
    "num_comments": 33,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "Just imagine the next conversation they have with the Third Hokage: “What the hell Kakashi? For fuck sake you’re supposed to be training, not fingering the poor boy! If only the Fourth Hokage could see you now” 😂",
            "author": "Cobra-Kai-Never-Dies",
            "id": "h484z5d",
            "parent_id": "t3_oerzyg",
            "score": 226,
            "created_utc": 1625570010.0,
            "replies": [
                {
                    "body": "I mean the next thing kakashi knows when he enters heaven is being fisted by kushina",
                    "author": "xHADES734x",
                    "id": "h48yy2s",
                    "parent_id": "t1_h484z5d",
                    "score": 131,
                    "created_utc": 1625586772.0,
                    "replies": [
                        {
                            "body": "😳",
                            "author": "glez_fdezdavila_",
                            "id": "h492atp",
                            "parent_id": "t1_h48yy2s",
                            "score": 48,
                            "created_utc": 1625588278.0,
                            "replies": [
                                {
                                    "body": "The fact that you have a pfp with Sasori makes it even funnier",
                                    "author": "DoggoManWasTaken",
                                    "id": "h4a10rm",
                                    "parent_id": "t1_h492atp",
                                    "score": 26,
                                    "created_utc": 1625603726.0,
                                    "replies": [
                                        {
                                            "body": "If only I got here 7hours earlier",
                                            "author": "KinkyGCM",
                                            "id": "h4amwwd",
                                            "parent_id": "t1_h4a10rm",
                                            "score": 6,
                                            "created_utc": 1625614298.0,
                                            "replies": [
                                                {
                                                    "body": "r/usernamechecksout",
                                                    "author": "xHADES734x",
                                                    "id": "h4b8g8i",
                                                    "parent_id": "t1_h4amwwd",
                                                    "score": 5,
                                                    "created_utc": 1625625692.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "That's rather some bullshit coming from you Mr third, i do infact wonder how the fourth homage will react if he saw how his son was fucking mistreated by the entire village after entrusting him to you",
                    "author": "proto_shane",
                    "id": "h48x3ou",
                    "parent_id": "t1_h484z5d",
                    "score": 61,
                    "created_utc": 1625585942.0,
                    "replies": [
                        {
                            "body": "Naruto was barely mistreated. They glared at him and didn’t like him. The fuck is Hiruzen meant to do about that?",
                            "author": "Lancaster1719",
                            "id": "h4909lt",
                            "parent_id": "t1_h48x3ou",
                            "score": -35,
                            "created_utc": 1625587367.0,
                            "replies": [
                                {
                                    "body": "Did you see the state hiruzen put him in?",
                                    "author": "proto_shane",
                                    "id": "h490udk",
                                    "parent_id": "t1_h4909lt",
                                    "score": 32,
                                    "created_utc": 1625587628.0,
                                    "replies": [
                                        {
                                            "body": "You mean where Hiruzen made sure his every need that can realistically be provided by a government is provided by said government, and even tried to help him get friends in the academy by personally taking time out of his extremely busy day to try and make people see that Naruto was a good person, which he succeeded in doing with Iruka?\n\nHiruzen did literally everything possible outside of outright adopting him, and that would’ve given the secret away back when they were trying to hide Naruto’s Jinchuuriki status, and then after that was revealed he was *way* too busy with the fallout of Orochimaru’s defection and the Uchiha Incident to try raising an extra kid as a 60+ single father who is also the sole dictator of a military junta.\n\nFuck, Naruto casually throws around hundreds of clones and he’s barely got time for his own kids and *he’s* supernaturally vital, which Hiruzen definitely isn’t",
                                            "author": "Lancaster1719",
                                            "id": "h491ds3",
                                            "parent_id": "t1_h490udk",
                                            "score": 20,
                                            "created_utc": 1625587870.0,
                                            "replies": [
                                                {
                                                    "body": ">Fuck, Naruto casually throws around hundreds of clones and he’s barely got time for his own kids and he’s supernaturally vital, which Hiruzen definitely isn’t\n\nAll of your points are fair but this comparison is a bit off.\n\nWe could see from when Tsunade became Hokage that it comes with a lot of work, but this is nothing compared to the village Naruto is running, it's at the very least 10x bigger now, with much more advanced technology, and a shitton more work to do.\n\nThe difference was clearly shown, or at least hinted at, in the sheer difference in paperwork. Tsunade would get a large pile of paperwork, Naruto gets an entire room full of piles.\n\nTsunade also had way more free time, and didn't have to resort to clones even if she could. She still had time to do shit like leading the medical division, doing major surgeries&procedures like she did on Lee, Sasuke & Kakashi (Still wondering how the fuck she got them out of the Tsukyomi when nobody else could), and she'd often go off into battle or join missions during emergencies when she was needed (though half of that was filler).\n\nAnyways Idk why I wrote all this when I still agreed with your main point. I also think people were too harsh on old man Hiruzen. I think people are forgetting that he also needed to build Naruto up to become tough and independent, Naruto had to become capable by himself and experience hardships to become strong for the challenges that he would definitely face in the future as the Kyuubi's jinchuriki, especially since he knew about the Akatsuki.",
                                                    "author": "PassdatAss91",
                                                    "id": "h495bpw",
                                                    "parent_id": "t1_h491ds3",
                                                    "score": 15,
                                                    "created_utc": 1625589609.0,
                                                    "replies": [
                                                        {
                                                            "body": "Yes Naruto has more work by a good margin, but also remember that he also has a force multiplier in his clones. None of the other Kage can spam SC the way he does to do all his work.\n\nHiruzen had the same issue with Konohamaru and Asuma. Other than that though, it’s hard to say. The only other Hokage with kids was Hashirama, and he was Hokage for not even half a decade.",
                                                            "author": "Lancaster1719",
                                                            "id": "h495p9q",
                                                            "parent_id": "t1_h495bpw",
                                                            "score": 5,
                                                            "created_utc": 1625589778.0,
                                                            "replies": [
                                                                {
                                                                    "body": ">>also remember that he also has a force multiplier in his clones. None of the other Kage can spam SC the way he does to do all his work.\n\nMaybe in Naruto or Naruto Shippuden he did. In Boruto, he can't sustain clones for a long time even when the no. of clones used is not that high. Before he could spam thousands of them. Now, he gets tired after a big ball Rasengan and stuff.\nIt's pretty bad how nerfed he and Sasuke are.",
                                                                    "author": "Aweguy1998",
                                                                    "id": "h498e6n",
                                                                    "parent_id": "t1_h495p9q",
                                                                    "score": 0,
                                                                    "created_utc": 1625590969.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "Which is ridiculous. He’s gotten *stronger*, not weaker. He should be now be able to field clone armies comparable in population to the village itself. \n\nHell, in the Boruto movie they didn’t have this. He had clones everywhere.",
                                                                            "author": "Lancaster1719",
                                                                            "id": "h498n8c",
                                                                            "parent_id": "t1_h498e6n",
                                                                            "score": 10,
                                                                            "created_utc": 1625591079.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "Being in pretty much peace time made him use less clones, having a family made him less lonely an even more reason of him being wack and having a fucking stressful dip shit as a child made him even worse. Allthough it is ironic that in actual fights he can use a crap ton of clones, idfk why the animators made so many shitty fillers in Boruto",
                                                                                    "author": "DoggoManWasTaken",
                                                                                    "id": "h4a21uz",
                                                                                    "parent_id": "t1_h498n8c",
                                                                                    "score": 4,
                                                                                    "created_utc": 1625604151.0,
                                                                                    "replies": [
                                                                                        {
                                                                                            "body": "I think it makes just enough sense with the shared possibly multiplied fatigue that comes from the shared experience\n\nSo in fights the clones get hit fast enough that the fatigue hardly hits but using clones to do paperwork and serious work (not errand runs and apperances)  \nwould break his brain\n\nidk I'm bullshitin",
                                                                                            "author": "whitey-ofwgkta",
                                                                                            "id": "h4asqo7",
                                                                                            "parent_id": "t1_h4a21uz",
                                                                                            "score": 2,
                                                                                            "created_utc": 1625617415.0,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "body": "Haha, I get exhausted faster when my head hurts than from fights",
                                                                                                    "author": "DoggoManWasTaken",
                                                                                                    "id": "h4aulnc",
                                                                                                    "parent_id": "t1_h4asqo7",
                                                                                                    "score": 3,
                                                                                                    "created_utc": 1625618401.0,
                                                                                                    "replies": []
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                },
                                                                                {
                                                                                    "body": "Mental fatigue is a thing for shadow clones though, it's not just about raw strength",
                                                                                    "author": "Shrenade514",
                                                                                    "id": "h49rxu3",
                                                                                    "parent_id": "t1_h498n8c",
                                                                                    "score": 6,
                                                                                    "created_utc": 1625599766.0,
                                                                                    "replies": [
                                                                                        {
                                                                                            "body": "Bruh Naruto was able to send out multiple shadow clones to different battlefields during war arc and was able to sustain them for long periods of times, even battling one of the deadliest Kage, the 3rd Raikage with one of his clones. \n\nYou telling me Naruto doesn’t have the mental strength to send out 20 shadow clones to help him work, work around the house and patrol the village? Ffs the excuses her worse and worse",
                                                                                            "author": "Captainprice101",
                                                                                            "id": "h4big6k",
                                                                                            "parent_id": "t1_h49rxu3",
                                                                                            "score": 2,
                                                                                            "created_utc": 1625631276.0,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "body": "Paperwork, he's not very smart...\n\nPhysical fatigue he can handle, because he's strong.",
                                                                                                    "author": "Shrenade514",
                                                                                                    "id": "h4c01dn",
                                                                                                    "parent_id": "t1_h4big6k",
                                                                                                    "score": 1,
                                                                                                    "created_utc": 1625645451.0,
                                                                                                    "replies": []
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                },
                                                                                {
                                                                                    "body": "Yep, but gotta have conflict somehow I guess.\n\nHeck, they could've even used the whole chakra disease thingy from the novels, atleast that would've somewhat justified him getting weaker but they just went forward hoping people won't care or notice....Smh.",
                                                                                    "author": "Aweguy1998",
                                                                                    "id": "h4991xf",
                                                                                    "parent_id": "t1_h498n8c",
                                                                                    "score": 2,
                                                                                    "created_utc": 1625591262.0,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "body": "Which is entirely plot. Naruto should not have gotten weaker. Dude could make 2,000 clones at the age of 12. He was able to literally send out multiple shadow clones to different battlefields during war arc.",
                                                                            "author": "Captainprice101",
                                                                            "id": "h4bi7jw",
                                                                            "parent_id": "t1_h498e6n",
                                                                            "score": 2,
                                                                            "created_utc": 1625631121.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "body": "You do know Danzo leaked the secret right?? If it weren’t for Hiruzen, Naruto would have been locked up or raised in the root (like sai) like many other jinchuriki. Hiruzen not only gave Naruto freedom, but he made Kakashi his team leader and also put Sasuke in the same team as him, Naruto’s greatest bond.\n\nHiruzen also talk no jutsu’d Iruka into befriending Naruto. Minato would be happy with what Hiruzen accomplished. It’s like y’all wanted Hiruzen to personally raise Naruto and breastfeed him or something. Naruto even tells Minato he respected the Third a lot and even takes his words and makes it his own in Boruto. \n\nThird Hokage circlejerk is lame imo, not to mention that Naruto has a Godfather in Jiraiya",
                                            "author": "Captainprice101",
                                            "id": "h4aem2t",
                                            "parent_id": "t1_h490udk",
                                            "score": 4,
                                            "created_utc": 1625610113.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Bruh imagine if Minato found out Kakashi fingered his son",
                    "author": "Eyeofgaga",
                    "id": "h4akg0d",
                    "parent_id": "t1_h484z5d",
                    "score": 5,
                    "created_utc": 1625613010.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "You dont get it! Fingering a kid was his training!",
            "author": "wvgz",
            "id": "h48z9dr",
            "parent_id": "t3_oerzyg",
            "score": 44,
            "created_utc": 1625586914.0,
            "replies": [
                {
                    "body": "Yeah, he must understand how it feels to get his ass kicked sometimes. \n\n\n\nIt's ironic that he became so strong just to avoid that lmao",
                    "author": "DoggoManWasTaken",
                    "id": "h4a2b8u",
                    "parent_id": "t1_h48z9dr",
                    "score": 15,
                    "created_utc": 1625604268.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Hey- it's character building!",
            "author": "AshyDay",
            "id": "h48yxz9",
            "parent_id": "t3_oerzyg",
            "score": 28,
            "created_utc": 1625586770.0,
            "replies": [
                {
                    "body": "Body building lol, 5+ points if ur actually pregnant",
                    "author": "DoggoManWasTaken",
                    "id": "h4a25v6",
                    "parent_id": "t1_h48yxz9",
                    "score": 6,
                    "created_utc": 1625604201.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yo that's kakashi😂",
            "author": "Efficient_Parsnip_48",
            "id": "h482zn5",
            "parent_id": "t3_oerzyg",
            "score": 26,
            "created_utc": 1625568289.0,
            "replies": []
        },
        {
            "body": "Kanye West is off to the hidden leaf to become a ninja",
            "author": "TempusCavus",
            "id": "h4aw1d8",
            "parent_id": "t3_oerzyg",
            "score": 2,
            "created_utc": 1625619161.0,
            "replies": []
        },
        {
            "body": "Twitter screenshots aren't memes, cropped or not",
            "author": "DerReudenboy",
            "id": "h49ys4k",
            "parent_id": "t3_oerzyg",
            "score": -8,
            "created_utc": 1625602774.0,
            "replies": [
                {
                    "body": "I dont use Twitter 🙂",
                    "author": "KindheartednessNo434",
                    "id": "h4a0g12",
                    "parent_id": "t1_h49ys4k",
                    "score": 5,
                    "created_utc": 1625603481.0,
                    "replies": []
                },
                {
                    "body": "U are to dumb to understand this but there are memes that use a Twitter layout",
                    "author": "noneeduselesss",
                    "id": "h4bsg7z",
                    "parent_id": "t1_h49ys4k",
                    "score": 1,
                    "created_utc": 1625638534.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I mean the next thing kakashi knows when he enters heaven is being fisted by kushina",
            "author": "xHADES734x",
            "id": "h48yy2s",
            "parent_id": "t1_h484z5d",
            "score": 131,
            "created_utc": 1625586772.0,
            "replies": [
                {
                    "body": "😳",
                    "author": "glez_fdezdavila_",
                    "id": "h492atp",
                    "parent_id": "t1_h48yy2s",
                    "score": 48,
                    "created_utc": 1625588278.0,
                    "replies": [
                        {
                            "body": "The fact that you have a pfp with Sasori makes it even funnier",
                            "author": "DoggoManWasTaken",
                            "id": "h4a10rm",
                            "parent_id": "t1_h492atp",
                            "score": 26,
                            "created_utc": 1625603726.0,
                            "replies": [
                                {
                                    "body": "If only I got here 7hours earlier",
                                    "author": "KinkyGCM",
                                    "id": "h4amwwd",
                                    "parent_id": "t1_h4a10rm",
                                    "score": 6,
                                    "created_utc": 1625614298.0,
                                    "replies": [
                                        {
                                            "body": "r/usernamechecksout",
                                            "author": "xHADES734x",
                                            "id": "h4b8g8i",
                                            "parent_id": "t1_h4amwwd",
                                            "score": 5,
                                            "created_utc": 1625625692.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "That's rather some bullshit coming from you Mr third, i do infact wonder how the fourth homage will react if he saw how his son was fucking mistreated by the entire village after entrusting him to you",
            "author": "proto_shane",
            "id": "h48x3ou",
            "parent_id": "t1_h484z5d",
            "score": 61,
            "created_utc": 1625585942.0,
            "replies": [
                {
                    "body": "Naruto was barely mistreated. They glared at him and didn’t like him. The fuck is Hiruzen meant to do about that?",
                    "author": "Lancaster1719",
                    "id": "h4909lt",
                    "parent_id": "t1_h48x3ou",
                    "score": -35,
                    "created_utc": 1625587367.0,
                    "replies": [
                        {
                            "body": "Did you see the state hiruzen put him in?",
                            "author": "proto_shane",
                            "id": "h490udk",
                            "parent_id": "t1_h4909lt",
                            "score": 32,
                            "created_utc": 1625587628.0,
                            "replies": [
                                {
                                    "body": "You mean where Hiruzen made sure his every need that can realistically be provided by a government is provided by said government, and even tried to help him get friends in the academy by personally taking time out of his extremely busy day to try and make people see that Naruto was a good person, which he succeeded in doing with Iruka?\n\nHiruzen did literally everything possible outside of outright adopting him, and that would’ve given the secret away back when they were trying to hide Naruto’s Jinchuuriki status, and then after that was revealed he was *way* too busy with the fallout of Orochimaru’s defection and the Uchiha Incident to try raising an extra kid as a 60+ single father who is also the sole dictator of a military junta.\n\nFuck, Naruto casually throws around hundreds of clones and he’s barely got time for his own kids and *he’s* supernaturally vital, which Hiruzen definitely isn’t",
                                    "author": "Lancaster1719",
                                    "id": "h491ds3",
                                    "parent_id": "t1_h490udk",
                                    "score": 20,
                                    "created_utc": 1625587870.0,
                                    "replies": [
                                        {
                                            "body": ">Fuck, Naruto casually throws around hundreds of clones and he’s barely got time for his own kids and he’s supernaturally vital, which Hiruzen definitely isn’t\n\nAll of your points are fair but this comparison is a bit off.\n\nWe could see from when Tsunade became Hokage that it comes with a lot of work, but this is nothing compared to the village Naruto is running, it's at the very least 10x bigger now, with much more advanced technology, and a shitton more work to do.\n\nThe difference was clearly shown, or at least hinted at, in the sheer difference in paperwork. Tsunade would get a large pile of paperwork, Naruto gets an entire room full of piles.\n\nTsunade also had way more free time, and didn't have to resort to clones even if she could. She still had time to do shit like leading the medical division, doing major surgeries&procedures like she did on Lee, Sasuke & Kakashi (Still wondering how the fuck she got them out of the Tsukyomi when nobody else could), and she'd often go off into battle or join missions during emergencies when she was needed (though half of that was filler).\n\nAnyways Idk why I wrote all this when I still agreed with your main point. I also think people were too harsh on old man Hiruzen. I think people are forgetting that he also needed to build Naruto up to become tough and independent, Naruto had to become capable by himself and experience hardships to become strong for the challenges that he would definitely face in the future as the Kyuubi's jinchuriki, especially since he knew about the Akatsuki.",
                                            "author": "PassdatAss91",
                                            "id": "h495bpw",
                                            "parent_id": "t1_h491ds3",
                                            "score": 15,
                                            "created_utc": 1625589609.0,
                                            "replies": [
                                                {
                                                    "body": "Yes Naruto has more work by a good margin, but also remember that he also has a force multiplier in his clones. None of the other Kage can spam SC the way he does to do all his work.\n\nHiruzen had the same issue with Konohamaru and Asuma. Other than that though, it’s hard to say. The only other Hokage with kids was Hashirama, and he was Hokage for not even half a decade.",
                                                    "author": "Lancaster1719",
                                                    "id": "h495p9q",
                                                    "parent_id": "t1_h495bpw",
                                                    "score": 5,
                                                    "created_utc": 1625589778.0,
                                                    "replies": [
                                                        {
                                                            "body": ">>also remember that he also has a force multiplier in his clones. None of the other Kage can spam SC the way he does to do all his work.\n\nMaybe in Naruto or Naruto Shippuden he did. In Boruto, he can't sustain clones for a long time even when the no. of clones used is not that high. Before he could spam thousands of them. Now, he gets tired after a big ball Rasengan and stuff.\nIt's pretty bad how nerfed he and Sasuke are.",
                                                            "author": "Aweguy1998",
                                                            "id": "h498e6n",
                                                            "parent_id": "t1_h495p9q",
                                                            "score": 0,
                                                            "created_utc": 1625590969.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Which is ridiculous. He’s gotten *stronger*, not weaker. He should be now be able to field clone armies comparable in population to the village itself. \n\nHell, in the Boruto movie they didn’t have this. He had clones everywhere.",
                                                                    "author": "Lancaster1719",
                                                                    "id": "h498n8c",
                                                                    "parent_id": "t1_h498e6n",
                                                                    "score": 10,
                                                                    "created_utc": 1625591079.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "Being in pretty much peace time made him use less clones, having a family made him less lonely an even more reason of him being wack and having a fucking stressful dip shit as a child made him even worse. Allthough it is ironic that in actual fights he can use a crap ton of clones, idfk why the animators made so many shitty fillers in Boruto",
                                                                            "author": "DoggoManWasTaken",
                                                                            "id": "h4a21uz",
                                                                            "parent_id": "t1_h498n8c",
                                                                            "score": 4,
                                                                            "created_utc": 1625604151.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "I think it makes just enough sense with the shared possibly multiplied fatigue that comes from the shared experience\n\nSo in fights the clones get hit fast enough that the fatigue hardly hits but using clones to do paperwork and serious work (not errand runs and apperances)  \nwould break his brain\n\nidk I'm bullshitin",
                                                                                    "author": "whitey-ofwgkta",
                                                                                    "id": "h4asqo7",
                                                                                    "parent_id": "t1_h4a21uz",
                                                                                    "score": 2,
                                                                                    "created_utc": 1625617415.0,
                                                                                    "replies": [
                                                                                        {
                                                                                            "body": "Haha, I get exhausted faster when my head hurts than from fights",
                                                                                            "author": "DoggoManWasTaken",
                                                                                            "id": "h4aulnc",
                                                                                            "parent_id": "t1_h4asqo7",
                                                                                            "score": 3,
                                                                                            "created_utc": 1625618401.0,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "body": "Mental fatigue is a thing for shadow clones though, it's not just about raw strength",
                                                                            "author": "Shrenade514",
                                                                            "id": "h49rxu3",
                                                                            "parent_id": "t1_h498n8c",
                                                                            "score": 6,
                                                                            "created_utc": 1625599766.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "Bruh Naruto was able to send out multiple shadow clones to different battlefields during war arc and was able to sustain them for long periods of times, even battling one of the deadliest Kage, the 3rd Raikage with one of his clones. \n\nYou telling me Naruto doesn’t have the mental strength to send out 20 shadow clones to help him work, work around the house and patrol the village? Ffs the excuses her worse and worse",
                                                                                    "author": "Captainprice101",
                                                                                    "id": "h4big6k",
                                                                                    "parent_id": "t1_h49rxu3",
                                                                                    "score": 2,
                                                                                    "created_utc": 1625631276.0,
                                                                                    "replies": [
                                                                                        {
                                                                                            "body": "Paperwork, he's not very smart...\n\nPhysical fatigue he can handle, because he's strong.",
                                                                                            "author": "Shrenade514",
                                                                                            "id": "h4c01dn",
                                                                                            "parent_id": "t1_h4big6k",
                                                                                            "score": 1,
                                                                                            "created_utc": 1625645451.0,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "body": "Yep, but gotta have conflict somehow I guess.\n\nHeck, they could've even used the whole chakra disease thingy from the novels, atleast that would've somewhat justified him getting weaker but they just went forward hoping people won't care or notice....Smh.",
                                                                            "author": "Aweguy1998",
                                                                            "id": "h4991xf",
                                                                            "parent_id": "t1_h498n8c",
                                                                            "score": 2,
                                                                            "created_utc": 1625591262.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "body": "Which is entirely plot. Naruto should not have gotten weaker. Dude could make 2,000 clones at the age of 12. He was able to literally send out multiple shadow clones to different battlefields during war arc.",
                                                                    "author": "Captainprice101",
                                                                    "id": "h4bi7jw",
                                                                    "parent_id": "t1_h498e6n",
                                                                    "score": 2,
                                                                    "created_utc": 1625631121.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "You do know Danzo leaked the secret right?? If it weren’t for Hiruzen, Naruto would have been locked up or raised in the root (like sai) like many other jinchuriki. Hiruzen not only gave Naruto freedom, but he made Kakashi his team leader and also put Sasuke in the same team as him, Naruto’s greatest bond.\n\nHiruzen also talk no jutsu’d Iruka into befriending Naruto. Minato would be happy with what Hiruzen accomplished. It’s like y’all wanted Hiruzen to personally raise Naruto and breastfeed him or something. Naruto even tells Minato he respected the Third a lot and even takes his words and makes it his own in Boruto. \n\nThird Hokage circlejerk is lame imo, not to mention that Naruto has a Godfather in Jiraiya",
                                    "author": "Captainprice101",
                                    "id": "h4aem2t",
                                    "parent_id": "t1_h490udk",
                                    "score": 4,
                                    "created_utc": 1625610113.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Bruh imagine if Minato found out Kakashi fingered his son",
            "author": "Eyeofgaga",
            "id": "h4akg0d",
            "parent_id": "t1_h484z5d",
            "score": 5,
            "created_utc": 1625613010.0,
            "replies": []
        },
        {
            "body": "Yeah, he must understand how it feels to get his ass kicked sometimes. \n\n\n\nIt's ironic that he became so strong just to avoid that lmao",
            "author": "DoggoManWasTaken",
            "id": "h4a2b8u",
            "parent_id": "t1_h48z9dr",
            "score": 15,
            "created_utc": 1625604268.0,
            "replies": []
        },
        {
            "body": "Body building lol, 5+ points if ur actually pregnant",
            "author": "DoggoManWasTaken",
            "id": "h4a25v6",
            "parent_id": "t1_h48yxz9",
            "score": 6,
            "created_utc": 1625604201.0,
            "replies": []
        },
        {
            "body": "I dont use Twitter 🙂",
            "author": "KindheartednessNo434",
            "id": "h4a0g12",
            "parent_id": "t1_h49ys4k",
            "score": 5,
            "created_utc": 1625603481.0,
            "replies": []
        },
        {
            "body": "U are to dumb to understand this but there are memes that use a Twitter layout",
            "author": "noneeduselesss",
            "id": "h4bsg7z",
            "parent_id": "t1_h49ys4k",
            "score": 1,
            "created_utc": 1625638534.0,
            "replies": []
        },
        {
            "body": "😳",
            "author": "glez_fdezdavila_",
            "id": "h492atp",
            "parent_id": "t1_h48yy2s",
            "score": 48,
            "created_utc": 1625588278.0,
            "replies": [
                {
                    "body": "The fact that you have a pfp with Sasori makes it even funnier",
                    "author": "DoggoManWasTaken",
                    "id": "h4a10rm",
                    "parent_id": "t1_h492atp",
                    "score": 26,
                    "created_utc": 1625603726.0,
                    "replies": [
                        {
                            "body": "If only I got here 7hours earlier",
                            "author": "KinkyGCM",
                            "id": "h4amwwd",
                            "parent_id": "t1_h4a10rm",
                            "score": 6,
                            "created_utc": 1625614298.0,
                            "replies": [
                                {
                                    "body": "r/usernamechecksout",
                                    "author": "xHADES734x",
                                    "id": "h4b8g8i",
                                    "parent_id": "t1_h4amwwd",
                                    "score": 5,
                                    "created_utc": 1625625692.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Naruto was barely mistreated. They glared at him and didn’t like him. The fuck is Hiruzen meant to do about that?",
            "author": "Lancaster1719",
            "id": "h4909lt",
            "parent_id": "t1_h48x3ou",
            "score": -35,
            "created_utc": 1625587367.0,
            "replies": [
                {
                    "body": "Did you see the state hiruzen put him in?",
                    "author": "proto_shane",
                    "id": "h490udk",
                    "parent_id": "t1_h4909lt",
                    "score": 32,
                    "created_utc": 1625587628.0,
                    "replies": [
                        {
                            "body": "You mean where Hiruzen made sure his every need that can realistically be provided by a government is provided by said government, and even tried to help him get friends in the academy by personally taking time out of his extremely busy day to try and make people see that Naruto was a good person, which he succeeded in doing with Iruka?\n\nHiruzen did literally everything possible outside of outright adopting him, and that would’ve given the secret away back when they were trying to hide Naruto’s Jinchuuriki status, and then after that was revealed he was *way* too busy with the fallout of Orochimaru’s defection and the Uchiha Incident to try raising an extra kid as a 60+ single father who is also the sole dictator of a military junta.\n\nFuck, Naruto casually throws around hundreds of clones and he’s barely got time for his own kids and *he’s* supernaturally vital, which Hiruzen definitely isn’t",
                            "author": "Lancaster1719",
                            "id": "h491ds3",
                            "parent_id": "t1_h490udk",
                            "score": 20,
                            "created_utc": 1625587870.0,
                            "replies": [
                                {
                                    "body": ">Fuck, Naruto casually throws around hundreds of clones and he’s barely got time for his own kids and he’s supernaturally vital, which Hiruzen definitely isn’t\n\nAll of your points are fair but this comparison is a bit off.\n\nWe could see from when Tsunade became Hokage that it comes with a lot of work, but this is nothing compared to the village Naruto is running, it's at the very least 10x bigger now, with much more advanced technology, and a shitton more work to do.\n\nThe difference was clearly shown, or at least hinted at, in the sheer difference in paperwork. Tsunade would get a large pile of paperwork, Naruto gets an entire room full of piles.\n\nTsunade also had way more free time, and didn't have to resort to clones even if she could. She still had time to do shit like leading the medical division, doing major surgeries&procedures like she did on Lee, Sasuke & Kakashi (Still wondering how the fuck she got them out of the Tsukyomi when nobody else could), and she'd often go off into battle or join missions during emergencies when she was needed (though half of that was filler).\n\nAnyways Idk why I wrote all this when I still agreed with your main point. I also think people were too harsh on old man Hiruzen. I think people are forgetting that he also needed to build Naruto up to become tough and independent, Naruto had to become capable by himself and experience hardships to become strong for the challenges that he would definitely face in the future as the Kyuubi's jinchuriki, especially since he knew about the Akatsuki.",
                                    "author": "PassdatAss91",
                                    "id": "h495bpw",
                                    "parent_id": "t1_h491ds3",
                                    "score": 15,
                                    "created_utc": 1625589609.0,
                                    "replies": [
                                        {
                                            "body": "Yes Naruto has more work by a good margin, but also remember that he also has a force multiplier in his clones. None of the other Kage can spam SC the way he does to do all his work.\n\nHiruzen had the same issue with Konohamaru and Asuma. Other than that though, it’s hard to say. The only other Hokage with kids was Hashirama, and he was Hokage for not even half a decade.",
                                            "author": "Lancaster1719",
                                            "id": "h495p9q",
                                            "parent_id": "t1_h495bpw",
                                            "score": 5,
                                            "created_utc": 1625589778.0,
                                            "replies": [
                                                {
                                                    "body": ">>also remember that he also has a force multiplier in his clones. None of the other Kage can spam SC the way he does to do all his work.\n\nMaybe in Naruto or Naruto Shippuden he did. In Boruto, he can't sustain clones for a long time even when the no. of clones used is not that high. Before he could spam thousands of them. Now, he gets tired after a big ball Rasengan and stuff.\nIt's pretty bad how nerfed he and Sasuke are.",
                                                    "author": "Aweguy1998",
                                                    "id": "h498e6n",
                                                    "parent_id": "t1_h495p9q",
                                                    "score": 0,
                                                    "created_utc": 1625590969.0,
                                                    "replies": [
                                                        {
                                                            "body": "Which is ridiculous. He’s gotten *stronger*, not weaker. He should be now be able to field clone armies comparable in population to the village itself. \n\nHell, in the Boruto movie they didn’t have this. He had clones everywhere.",
                                                            "author": "Lancaster1719",
                                                            "id": "h498n8c",
                                                            "parent_id": "t1_h498e6n",
                                                            "score": 10,
                                                            "created_utc": 1625591079.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Being in pretty much peace time made him use less clones, having a family made him less lonely an even more reason of him being wack and having a fucking stressful dip shit as a child made him even worse. Allthough it is ironic that in actual fights he can use a crap ton of clones, idfk why the animators made so many shitty fillers in Boruto",
                                                                    "author": "DoggoManWasTaken",
                                                                    "id": "h4a21uz",
                                                                    "parent_id": "t1_h498n8c",
                                                                    "score": 4,
                                                                    "created_utc": 1625604151.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "I think it makes just enough sense with the shared possibly multiplied fatigue that comes from the shared experience\n\nSo in fights the clones get hit fast enough that the fatigue hardly hits but using clones to do paperwork and serious work (not errand runs and apperances)  \nwould break his brain\n\nidk I'm bullshitin",
                                                                            "author": "whitey-ofwgkta",
                                                                            "id": "h4asqo7",
                                                                            "parent_id": "t1_h4a21uz",
                                                                            "score": 2,
                                                                            "created_utc": 1625617415.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "Haha, I get exhausted faster when my head hurts than from fights",
                                                                                    "author": "DoggoManWasTaken",
                                                                                    "id": "h4aulnc",
                                                                                    "parent_id": "t1_h4asqo7",
                                                                                    "score": 3,
                                                                                    "created_utc": 1625618401.0,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "body": "Mental fatigue is a thing for shadow clones though, it's not just about raw strength",
                                                                    "author": "Shrenade514",
                                                                    "id": "h49rxu3",
                                                                    "parent_id": "t1_h498n8c",
                                                                    "score": 6,
                                                                    "created_utc": 1625599766.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "Bruh Naruto was able to send out multiple shadow clones to different battlefields during war arc and was able to sustain them for long periods of times, even battling one of the deadliest Kage, the 3rd Raikage with one of his clones. \n\nYou telling me Naruto doesn’t have the mental strength to send out 20 shadow clones to help him work, work around the house and patrol the village? Ffs the excuses her worse and worse",
                                                                            "author": "Captainprice101",
                                                                            "id": "h4big6k",
                                                                            "parent_id": "t1_h49rxu3",
                                                                            "score": 2,
                                                                            "created_utc": 1625631276.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "Paperwork, he's not very smart...\n\nPhysical fatigue he can handle, because he's strong.",
                                                                                    "author": "Shrenade514",
                                                                                    "id": "h4c01dn",
                                                                                    "parent_id": "t1_h4big6k",
                                                                                    "score": 1,
                                                                                    "created_utc": 1625645451.0,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "body": "Yep, but gotta have conflict somehow I guess.\n\nHeck, they could've even used the whole chakra disease thingy from the novels, atleast that would've somewhat justified him getting weaker but they just went forward hoping people won't care or notice....Smh.",
                                                                    "author": "Aweguy1998",
                                                                    "id": "h4991xf",
                                                                    "parent_id": "t1_h498n8c",
                                                                    "score": 2,
                                                                    "created_utc": 1625591262.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "body": "Which is entirely plot. Naruto should not have gotten weaker. Dude could make 2,000 clones at the age of 12. He was able to literally send out multiple shadow clones to different battlefields during war arc.",
                                                            "author": "Captainprice101",
                                                            "id": "h4bi7jw",
                                                            "parent_id": "t1_h498e6n",
                                                            "score": 2,
                                                            "created_utc": 1625631121.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "You do know Danzo leaked the secret right?? If it weren’t for Hiruzen, Naruto would have been locked up or raised in the root (like sai) like many other jinchuriki. Hiruzen not only gave Naruto freedom, but he made Kakashi his team leader and also put Sasuke in the same team as him, Naruto’s greatest bond.\n\nHiruzen also talk no jutsu’d Iruka into befriending Naruto. Minato would be happy with what Hiruzen accomplished. It’s like y’all wanted Hiruzen to personally raise Naruto and breastfeed him or something. Naruto even tells Minato he respected the Third a lot and even takes his words and makes it his own in Boruto. \n\nThird Hokage circlejerk is lame imo, not to mention that Naruto has a Godfather in Jiraiya",
                            "author": "Captainprice101",
                            "id": "h4aem2t",
                            "parent_id": "t1_h490udk",
                            "score": 4,
                            "created_utc": 1625610113.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "The fact that you have a pfp with Sasori makes it even funnier",
            "author": "DoggoManWasTaken",
            "id": "h4a10rm",
            "parent_id": "t1_h492atp",
            "score": 26,
            "created_utc": 1625603726.0,
            "replies": [
                {
                    "body": "If only I got here 7hours earlier",
                    "author": "KinkyGCM",
                    "id": "h4amwwd",
                    "parent_id": "t1_h4a10rm",
                    "score": 6,
                    "created_utc": 1625614298.0,
                    "replies": [
                        {
                            "body": "r/usernamechecksout",
                            "author": "xHADES734x",
                            "id": "h4b8g8i",
                            "parent_id": "t1_h4amwwd",
                            "score": 5,
                            "created_utc": 1625625692.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Did you see the state hiruzen put him in?",
            "author": "proto_shane",
            "id": "h490udk",
            "parent_id": "t1_h4909lt",
            "score": 32,
            "created_utc": 1625587628.0,
            "replies": [
                {
                    "body": "You mean where Hiruzen made sure his every need that can realistically be provided by a government is provided by said government, and even tried to help him get friends in the academy by personally taking time out of his extremely busy day to try and make people see that Naruto was a good person, which he succeeded in doing with Iruka?\n\nHiruzen did literally everything possible outside of outright adopting him, and that would’ve given the secret away back when they were trying to hide Naruto’s Jinchuuriki status, and then after that was revealed he was *way* too busy with the fallout of Orochimaru’s defection and the Uchiha Incident to try raising an extra kid as a 60+ single father who is also the sole dictator of a military junta.\n\nFuck, Naruto casually throws around hundreds of clones and he’s barely got time for his own kids and *he’s* supernaturally vital, which Hiruzen definitely isn’t",
                    "author": "Lancaster1719",
                    "id": "h491ds3",
                    "parent_id": "t1_h490udk",
                    "score": 20,
                    "created_utc": 1625587870.0,
                    "replies": [
                        {
                            "body": ">Fuck, Naruto casually throws around hundreds of clones and he’s barely got time for his own kids and he’s supernaturally vital, which Hiruzen definitely isn’t\n\nAll of your points are fair but this comparison is a bit off.\n\nWe could see from when Tsunade became Hokage that it comes with a lot of work, but this is nothing compared to the village Naruto is running, it's at the very least 10x bigger now, with much more advanced technology, and a shitton more work to do.\n\nThe difference was clearly shown, or at least hinted at, in the sheer difference in paperwork. Tsunade would get a large pile of paperwork, Naruto gets an entire room full of piles.\n\nTsunade also had way more free time, and didn't have to resort to clones even if she could. She still had time to do shit like leading the medical division, doing major surgeries&procedures like she did on Lee, Sasuke & Kakashi (Still wondering how the fuck she got them out of the Tsukyomi when nobody else could), and she'd often go off into battle or join missions during emergencies when she was needed (though half of that was filler).\n\nAnyways Idk why I wrote all this when I still agreed with your main point. I also think people were too harsh on old man Hiruzen. I think people are forgetting that he also needed to build Naruto up to become tough and independent, Naruto had to become capable by himself and experience hardships to become strong for the challenges that he would definitely face in the future as the Kyuubi's jinchuriki, especially since he knew about the Akatsuki.",
                            "author": "PassdatAss91",
                            "id": "h495bpw",
                            "parent_id": "t1_h491ds3",
                            "score": 15,
                            "created_utc": 1625589609.0,
                            "replies": [
                                {
                                    "body": "Yes Naruto has more work by a good margin, but also remember that he also has a force multiplier in his clones. None of the other Kage can spam SC the way he does to do all his work.\n\nHiruzen had the same issue with Konohamaru and Asuma. Other than that though, it’s hard to say. The only other Hokage with kids was Hashirama, and he was Hokage for not even half a decade.",
                                    "author": "Lancaster1719",
                                    "id": "h495p9q",
                                    "parent_id": "t1_h495bpw",
                                    "score": 5,
                                    "created_utc": 1625589778.0,
                                    "replies": [
                                        {
                                            "body": ">>also remember that he also has a force multiplier in his clones. None of the other Kage can spam SC the way he does to do all his work.\n\nMaybe in Naruto or Naruto Shippuden he did. In Boruto, he can't sustain clones for a long time even when the no. of clones used is not that high. Before he could spam thousands of them. Now, he gets tired after a big ball Rasengan and stuff.\nIt's pretty bad how nerfed he and Sasuke are.",
                                            "author": "Aweguy1998",
                                            "id": "h498e6n",
                                            "parent_id": "t1_h495p9q",
                                            "score": 0,
                                            "created_utc": 1625590969.0,
                                            "replies": [
                                                {
                                                    "body": "Which is ridiculous. He’s gotten *stronger*, not weaker. He should be now be able to field clone armies comparable in population to the village itself. \n\nHell, in the Boruto movie they didn’t have this. He had clones everywhere.",
                                                    "author": "Lancaster1719",
                                                    "id": "h498n8c",
                                                    "parent_id": "t1_h498e6n",
                                                    "score": 10,
                                                    "created_utc": 1625591079.0,
                                                    "replies": [
                                                        {
                                                            "body": "Being in pretty much peace time made him use less clones, having a family made him less lonely an even more reason of him being wack and having a fucking stressful dip shit as a child made him even worse. Allthough it is ironic that in actual fights he can use a crap ton of clones, idfk why the animators made so many shitty fillers in Boruto",
                                                            "author": "DoggoManWasTaken",
                                                            "id": "h4a21uz",
                                                            "parent_id": "t1_h498n8c",
                                                            "score": 4,
                                                            "created_utc": 1625604151.0,
                                                            "replies": [
                                                                {
                                                                    "body": "I think it makes just enough sense with the shared possibly multiplied fatigue that comes from the shared experience\n\nSo in fights the clones get hit fast enough that the fatigue hardly hits but using clones to do paperwork and serious work (not errand runs and apperances)  \nwould break his brain\n\nidk I'm bullshitin",
                                                                    "author": "whitey-ofwgkta",
                                                                    "id": "h4asqo7",
                                                                    "parent_id": "t1_h4a21uz",
                                                                    "score": 2,
                                                                    "created_utc": 1625617415.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "Haha, I get exhausted faster when my head hurts than from fights",
                                                                            "author": "DoggoManWasTaken",
                                                                            "id": "h4aulnc",
                                                                            "parent_id": "t1_h4asqo7",
                                                                            "score": 3,
                                                                            "created_utc": 1625618401.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "body": "Mental fatigue is a thing for shadow clones though, it's not just about raw strength",
                                                            "author": "Shrenade514",
                                                            "id": "h49rxu3",
                                                            "parent_id": "t1_h498n8c",
                                                            "score": 6,
                                                            "created_utc": 1625599766.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Bruh Naruto was able to send out multiple shadow clones to different battlefields during war arc and was able to sustain them for long periods of times, even battling one of the deadliest Kage, the 3rd Raikage with one of his clones. \n\nYou telling me Naruto doesn’t have the mental strength to send out 20 shadow clones to help him work, work around the house and patrol the village? Ffs the excuses her worse and worse",
                                                                    "author": "Captainprice101",
                                                                    "id": "h4big6k",
                                                                    "parent_id": "t1_h49rxu3",
                                                                    "score": 2,
                                                                    "created_utc": 1625631276.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "Paperwork, he's not very smart...\n\nPhysical fatigue he can handle, because he's strong.",
                                                                            "author": "Shrenade514",
                                                                            "id": "h4c01dn",
                                                                            "parent_id": "t1_h4big6k",
                                                                            "score": 1,
                                                                            "created_utc": 1625645451.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "body": "Yep, but gotta have conflict somehow I guess.\n\nHeck, they could've even used the whole chakra disease thingy from the novels, atleast that would've somewhat justified him getting weaker but they just went forward hoping people won't care or notice....Smh.",
                                                            "author": "Aweguy1998",
                                                            "id": "h4991xf",
                                                            "parent_id": "t1_h498n8c",
                                                            "score": 2,
                                                            "created_utc": 1625591262.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "body": "Which is entirely plot. Naruto should not have gotten weaker. Dude could make 2,000 clones at the age of 12. He was able to literally send out multiple shadow clones to different battlefields during war arc.",
                                                    "author": "Captainprice101",
                                                    "id": "h4bi7jw",
                                                    "parent_id": "t1_h498e6n",
                                                    "score": 2,
                                                    "created_utc": 1625631121.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "You do know Danzo leaked the secret right?? If it weren’t for Hiruzen, Naruto would have been locked up or raised in the root (like sai) like many other jinchuriki. Hiruzen not only gave Naruto freedom, but he made Kakashi his team leader and also put Sasuke in the same team as him, Naruto’s greatest bond.\n\nHiruzen also talk no jutsu’d Iruka into befriending Naruto. Minato would be happy with what Hiruzen accomplished. It’s like y’all wanted Hiruzen to personally raise Naruto and breastfeed him or something. Naruto even tells Minato he respected the Third a lot and even takes his words and makes it his own in Boruto. \n\nThird Hokage circlejerk is lame imo, not to mention that Naruto has a Godfather in Jiraiya",
                    "author": "Captainprice101",
                    "id": "h4aem2t",
                    "parent_id": "t1_h490udk",
                    "score": 4,
                    "created_utc": 1625610113.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "If only I got here 7hours earlier",
            "author": "KinkyGCM",
            "id": "h4amwwd",
            "parent_id": "t1_h4a10rm",
            "score": 6,
            "created_utc": 1625614298.0,
            "replies": [
                {
                    "body": "r/usernamechecksout",
                    "author": "xHADES734x",
                    "id": "h4b8g8i",
                    "parent_id": "t1_h4amwwd",
                    "score": 5,
                    "created_utc": 1625625692.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "You mean where Hiruzen made sure his every need that can realistically be provided by a government is provided by said government, and even tried to help him get friends in the academy by personally taking time out of his extremely busy day to try and make people see that Naruto was a good person, which he succeeded in doing with Iruka?\n\nHiruzen did literally everything possible outside of outright adopting him, and that would’ve given the secret away back when they were trying to hide Naruto’s Jinchuuriki status, and then after that was revealed he was *way* too busy with the fallout of Orochimaru’s defection and the Uchiha Incident to try raising an extra kid as a 60+ single father who is also the sole dictator of a military junta.\n\nFuck, Naruto casually throws around hundreds of clones and he’s barely got time for his own kids and *he’s* supernaturally vital, which Hiruzen definitely isn’t",
            "author": "Lancaster1719",
            "id": "h491ds3",
            "parent_id": "t1_h490udk",
            "score": 20,
            "created_utc": 1625587870.0,
            "replies": [
                {
                    "body": ">Fuck, Naruto casually throws around hundreds of clones and he’s barely got time for his own kids and he’s supernaturally vital, which Hiruzen definitely isn’t\n\nAll of your points are fair but this comparison is a bit off.\n\nWe could see from when Tsunade became Hokage that it comes with a lot of work, but this is nothing compared to the village Naruto is running, it's at the very least 10x bigger now, with much more advanced technology, and a shitton more work to do.\n\nThe difference was clearly shown, or at least hinted at, in the sheer difference in paperwork. Tsunade would get a large pile of paperwork, Naruto gets an entire room full of piles.\n\nTsunade also had way more free time, and didn't have to resort to clones even if she could. She still had time to do shit like leading the medical division, doing major surgeries&procedures like she did on Lee, Sasuke & Kakashi (Still wondering how the fuck she got them out of the Tsukyomi when nobody else could), and she'd often go off into battle or join missions during emergencies when she was needed (though half of that was filler).\n\nAnyways Idk why I wrote all this when I still agreed with your main point. I also think people were too harsh on old man Hiruzen. I think people are forgetting that he also needed to build Naruto up to become tough and independent, Naruto had to become capable by himself and experience hardships to become strong for the challenges that he would definitely face in the future as the Kyuubi's jinchuriki, especially since he knew about the Akatsuki.",
                    "author": "PassdatAss91",
                    "id": "h495bpw",
                    "parent_id": "t1_h491ds3",
                    "score": 15,
                    "created_utc": 1625589609.0,
                    "replies": [
                        {
                            "body": "Yes Naruto has more work by a good margin, but also remember that he also has a force multiplier in his clones. None of the other Kage can spam SC the way he does to do all his work.\n\nHiruzen had the same issue with Konohamaru and Asuma. Other than that though, it’s hard to say. The only other Hokage with kids was Hashirama, and he was Hokage for not even half a decade.",
                            "author": "Lancaster1719",
                            "id": "h495p9q",
                            "parent_id": "t1_h495bpw",
                            "score": 5,
                            "created_utc": 1625589778.0,
                            "replies": [
                                {
                                    "body": ">>also remember that he also has a force multiplier in his clones. None of the other Kage can spam SC the way he does to do all his work.\n\nMaybe in Naruto or Naruto Shippuden he did. In Boruto, he can't sustain clones for a long time even when the no. of clones used is not that high. Before he could spam thousands of them. Now, he gets tired after a big ball Rasengan and stuff.\nIt's pretty bad how nerfed he and Sasuke are.",
                                    "author": "Aweguy1998",
                                    "id": "h498e6n",
                                    "parent_id": "t1_h495p9q",
                                    "score": 0,
                                    "created_utc": 1625590969.0,
                                    "replies": [
                                        {
                                            "body": "Which is ridiculous. He’s gotten *stronger*, not weaker. He should be now be able to field clone armies comparable in population to the village itself. \n\nHell, in the Boruto movie they didn’t have this. He had clones everywhere.",
                                            "author": "Lancaster1719",
                                            "id": "h498n8c",
                                            "parent_id": "t1_h498e6n",
                                            "score": 10,
                                            "created_utc": 1625591079.0,
                                            "replies": [
                                                {
                                                    "body": "Being in pretty much peace time made him use less clones, having a family made him less lonely an even more reason of him being wack and having a fucking stressful dip shit as a child made him even worse. Allthough it is ironic that in actual fights he can use a crap ton of clones, idfk why the animators made so many shitty fillers in Boruto",
                                                    "author": "DoggoManWasTaken",
                                                    "id": "h4a21uz",
                                                    "parent_id": "t1_h498n8c",
                                                    "score": 4,
                                                    "created_utc": 1625604151.0,
                                                    "replies": [
                                                        {
                                                            "body": "I think it makes just enough sense with the shared possibly multiplied fatigue that comes from the shared experience\n\nSo in fights the clones get hit fast enough that the fatigue hardly hits but using clones to do paperwork and serious work (not errand runs and apperances)  \nwould break his brain\n\nidk I'm bullshitin",
                                                            "author": "whitey-ofwgkta",
                                                            "id": "h4asqo7",
                                                            "parent_id": "t1_h4a21uz",
                                                            "score": 2,
                                                            "created_utc": 1625617415.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Haha, I get exhausted faster when my head hurts than from fights",
                                                                    "author": "DoggoManWasTaken",
                                                                    "id": "h4aulnc",
                                                                    "parent_id": "t1_h4asqo7",
                                                                    "score": 3,
                                                                    "created_utc": 1625618401.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "body": "Mental fatigue is a thing for shadow clones though, it's not just about raw strength",
                                                    "author": "Shrenade514",
                                                    "id": "h49rxu3",
                                                    "parent_id": "t1_h498n8c",
                                                    "score": 6,
                                                    "created_utc": 1625599766.0,
                                                    "replies": [
                                                        {
                                                            "body": "Bruh Naruto was able to send out multiple shadow clones to different battlefields during war arc and was able to sustain them for long periods of times, even battling one of the deadliest Kage, the 3rd Raikage with one of his clones. \n\nYou telling me Naruto doesn’t have the mental strength to send out 20 shadow clones to help him work, work around the house and patrol the village? Ffs the excuses her worse and worse",
                                                            "author": "Captainprice101",
                                                            "id": "h4big6k",
                                                            "parent_id": "t1_h49rxu3",
                                                            "score": 2,
                                                            "created_utc": 1625631276.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Paperwork, he's not very smart...\n\nPhysical fatigue he can handle, because he's strong.",
                                                                    "author": "Shrenade514",
                                                                    "id": "h4c01dn",
                                                                    "parent_id": "t1_h4big6k",
                                                                    "score": 1,
                                                                    "created_utc": 1625645451.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "body": "Yep, but gotta have conflict somehow I guess.\n\nHeck, they could've even used the whole chakra disease thingy from the novels, atleast that would've somewhat justified him getting weaker but they just went forward hoping people won't care or notice....Smh.",
                                                    "author": "Aweguy1998",
                                                    "id": "h4991xf",
                                                    "parent_id": "t1_h498n8c",
                                                    "score": 2,
                                                    "created_utc": 1625591262.0,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "body": "Which is entirely plot. Naruto should not have gotten weaker. Dude could make 2,000 clones at the age of 12. He was able to literally send out multiple shadow clones to different battlefields during war arc.",
                                            "author": "Captainprice101",
                                            "id": "h4bi7jw",
                                            "parent_id": "t1_h498e6n",
                                            "score": 2,
                                            "created_utc": 1625631121.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "You do know Danzo leaked the secret right?? If it weren’t for Hiruzen, Naruto would have been locked up or raised in the root (like sai) like many other jinchuriki. Hiruzen not only gave Naruto freedom, but he made Kakashi his team leader and also put Sasuke in the same team as him, Naruto’s greatest bond.\n\nHiruzen also talk no jutsu’d Iruka into befriending Naruto. Minato would be happy with what Hiruzen accomplished. It’s like y’all wanted Hiruzen to personally raise Naruto and breastfeed him or something. Naruto even tells Minato he respected the Third a lot and even takes his words and makes it his own in Boruto. \n\nThird Hokage circlejerk is lame imo, not to mention that Naruto has a Godfather in Jiraiya",
            "author": "Captainprice101",
            "id": "h4aem2t",
            "parent_id": "t1_h490udk",
            "score": 4,
            "created_utc": 1625610113.0,
            "replies": []
        },
        {
            "body": "r/usernamechecksout",
            "author": "xHADES734x",
            "id": "h4b8g8i",
            "parent_id": "t1_h4amwwd",
            "score": 5,
            "created_utc": 1625625692.0,
            "replies": []
        },
        {
            "body": ">Fuck, Naruto casually throws around hundreds of clones and he’s barely got time for his own kids and he’s supernaturally vital, which Hiruzen definitely isn’t\n\nAll of your points are fair but this comparison is a bit off.\n\nWe could see from when Tsunade became Hokage that it comes with a lot of work, but this is nothing compared to the village Naruto is running, it's at the very least 10x bigger now, with much more advanced technology, and a shitton more work to do.\n\nThe difference was clearly shown, or at least hinted at, in the sheer difference in paperwork. Tsunade would get a large pile of paperwork, Naruto gets an entire room full of piles.\n\nTsunade also had way more free time, and didn't have to resort to clones even if she could. She still had time to do shit like leading the medical division, doing major surgeries&procedures like she did on Lee, Sasuke & Kakashi (Still wondering how the fuck she got them out of the Tsukyomi when nobody else could), and she'd often go off into battle or join missions during emergencies when she was needed (though half of that was filler).\n\nAnyways Idk why I wrote all this when I still agreed with your main point. I also think people were too harsh on old man Hiruzen. I think people are forgetting that he also needed to build Naruto up to become tough and independent, Naruto had to become capable by himself and experience hardships to become strong for the challenges that he would definitely face in the future as the Kyuubi's jinchuriki, especially since he knew about the Akatsuki.",
            "author": "PassdatAss91",
            "id": "h495bpw",
            "parent_id": "t1_h491ds3",
            "score": 15,
            "created_utc": 1625589609.0,
            "replies": [
                {
                    "body": "Yes Naruto has more work by a good margin, but also remember that he also has a force multiplier in his clones. None of the other Kage can spam SC the way he does to do all his work.\n\nHiruzen had the same issue with Konohamaru and Asuma. Other than that though, it’s hard to say. The only other Hokage with kids was Hashirama, and he was Hokage for not even half a decade.",
                    "author": "Lancaster1719",
                    "id": "h495p9q",
                    "parent_id": "t1_h495bpw",
                    "score": 5,
                    "created_utc": 1625589778.0,
                    "replies": [
                        {
                            "body": ">>also remember that he also has a force multiplier in his clones. None of the other Kage can spam SC the way he does to do all his work.\n\nMaybe in Naruto or Naruto Shippuden he did. In Boruto, he can't sustain clones for a long time even when the no. of clones used is not that high. Before he could spam thousands of them. Now, he gets tired after a big ball Rasengan and stuff.\nIt's pretty bad how nerfed he and Sasuke are.",
                            "author": "Aweguy1998",
                            "id": "h498e6n",
                            "parent_id": "t1_h495p9q",
                            "score": 0,
                            "created_utc": 1625590969.0,
                            "replies": [
                                {
                                    "body": "Which is ridiculous. He’s gotten *stronger*, not weaker. He should be now be able to field clone armies comparable in population to the village itself. \n\nHell, in the Boruto movie they didn’t have this. He had clones everywhere.",
                                    "author": "Lancaster1719",
                                    "id": "h498n8c",
                                    "parent_id": "t1_h498e6n",
                                    "score": 10,
                                    "created_utc": 1625591079.0,
                                    "replies": [
                                        {
                                            "body": "Being in pretty much peace time made him use less clones, having a family made him less lonely an even more reason of him being wack and having a fucking stressful dip shit as a child made him even worse. Allthough it is ironic that in actual fights he can use a crap ton of clones, idfk why the animators made so many shitty fillers in Boruto",
                                            "author": "DoggoManWasTaken",
                                            "id": "h4a21uz",
                                            "parent_id": "t1_h498n8c",
                                            "score": 4,
                                            "created_utc": 1625604151.0,
                                            "replies": [
                                                {
                                                    "body": "I think it makes just enough sense with the shared possibly multiplied fatigue that comes from the shared experience\n\nSo in fights the clones get hit fast enough that the fatigue hardly hits but using clones to do paperwork and serious work (not errand runs and apperances)  \nwould break his brain\n\nidk I'm bullshitin",
                                                    "author": "whitey-ofwgkta",
                                                    "id": "h4asqo7",
                                                    "parent_id": "t1_h4a21uz",
                                                    "score": 2,
                                                    "created_utc": 1625617415.0,
                                                    "replies": [
                                                        {
                                                            "body": "Haha, I get exhausted faster when my head hurts than from fights",
                                                            "author": "DoggoManWasTaken",
                                                            "id": "h4aulnc",
                                                            "parent_id": "t1_h4asqo7",
                                                            "score": 3,
                                                            "created_utc": 1625618401.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "body": "Mental fatigue is a thing for shadow clones though, it's not just about raw strength",
                                            "author": "Shrenade514",
                                            "id": "h49rxu3",
                                            "parent_id": "t1_h498n8c",
                                            "score": 6,
                                            "created_utc": 1625599766.0,
                                            "replies": [
                                                {
                                                    "body": "Bruh Naruto was able to send out multiple shadow clones to different battlefields during war arc and was able to sustain them for long periods of times, even battling one of the deadliest Kage, the 3rd Raikage with one of his clones. \n\nYou telling me Naruto doesn’t have the mental strength to send out 20 shadow clones to help him work, work around the house and patrol the village? Ffs the excuses her worse and worse",
                                                    "author": "Captainprice101",
                                                    "id": "h4big6k",
                                                    "parent_id": "t1_h49rxu3",
                                                    "score": 2,
                                                    "created_utc": 1625631276.0,
                                                    "replies": [
                                                        {
                                                            "body": "Paperwork, he's not very smart...\n\nPhysical fatigue he can handle, because he's strong.",
                                                            "author": "Shrenade514",
                                                            "id": "h4c01dn",
                                                            "parent_id": "t1_h4big6k",
                                                            "score": 1,
                                                            "created_utc": 1625645451.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "body": "Yep, but gotta have conflict somehow I guess.\n\nHeck, they could've even used the whole chakra disease thingy from the novels, atleast that would've somewhat justified him getting weaker but they just went forward hoping people won't care or notice....Smh.",
                                            "author": "Aweguy1998",
                                            "id": "h4991xf",
                                            "parent_id": "t1_h498n8c",
                                            "score": 2,
                                            "created_utc": 1625591262.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "Which is entirely plot. Naruto should not have gotten weaker. Dude could make 2,000 clones at the age of 12. He was able to literally send out multiple shadow clones to different battlefields during war arc.",
                                    "author": "Captainprice101",
                                    "id": "h4bi7jw",
                                    "parent_id": "t1_h498e6n",
                                    "score": 2,
                                    "created_utc": 1625631121.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yes Naruto has more work by a good margin, but also remember that he also has a force multiplier in his clones. None of the other Kage can spam SC the way he does to do all his work.\n\nHiruzen had the same issue with Konohamaru and Asuma. Other than that though, it’s hard to say. The only other Hokage with kids was Hashirama, and he was Hokage for not even half a decade.",
            "author": "Lancaster1719",
            "id": "h495p9q",
            "parent_id": "t1_h495bpw",
            "score": 5,
            "created_utc": 1625589778.0,
            "replies": [
                {
                    "body": ">>also remember that he also has a force multiplier in his clones. None of the other Kage can spam SC the way he does to do all his work.\n\nMaybe in Naruto or Naruto Shippuden he did. In Boruto, he can't sustain clones for a long time even when the no. of clones used is not that high. Before he could spam thousands of them. Now, he gets tired after a big ball Rasengan and stuff.\nIt's pretty bad how nerfed he and Sasuke are.",
                    "author": "Aweguy1998",
                    "id": "h498e6n",
                    "parent_id": "t1_h495p9q",
                    "score": 0,
                    "created_utc": 1625590969.0,
                    "replies": [
                        {
                            "body": "Which is ridiculous. He’s gotten *stronger*, not weaker. He should be now be able to field clone armies comparable in population to the village itself. \n\nHell, in the Boruto movie they didn’t have this. He had clones everywhere.",
                            "author": "Lancaster1719",
                            "id": "h498n8c",
                            "parent_id": "t1_h498e6n",
                            "score": 10,
                            "created_utc": 1625591079.0,
                            "replies": [
                                {
                                    "body": "Being in pretty much peace time made him use less clones, having a family made him less lonely an even more reason of him being wack and having a fucking stressful dip shit as a child made him even worse. Allthough it is ironic that in actual fights he can use a crap ton of clones, idfk why the animators made so many shitty fillers in Boruto",
                                    "author": "DoggoManWasTaken",
                                    "id": "h4a21uz",
                                    "parent_id": "t1_h498n8c",
                                    "score": 4,
                                    "created_utc": 1625604151.0,
                                    "replies": [
                                        {
                                            "body": "I think it makes just enough sense with the shared possibly multiplied fatigue that comes from the shared experience\n\nSo in fights the clones get hit fast enough that the fatigue hardly hits but using clones to do paperwork and serious work (not errand runs and apperances)  \nwould break his brain\n\nidk I'm bullshitin",
                                            "author": "whitey-ofwgkta",
                                            "id": "h4asqo7",
                                            "parent_id": "t1_h4a21uz",
                                            "score": 2,
                                            "created_utc": 1625617415.0,
                                            "replies": [
                                                {
                                                    "body": "Haha, I get exhausted faster when my head hurts than from fights",
                                                    "author": "DoggoManWasTaken",
                                                    "id": "h4aulnc",
                                                    "parent_id": "t1_h4asqo7",
                                                    "score": 3,
                                                    "created_utc": 1625618401.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "Mental fatigue is a thing for shadow clones though, it's not just about raw strength",
                                    "author": "Shrenade514",
                                    "id": "h49rxu3",
                                    "parent_id": "t1_h498n8c",
                                    "score": 6,
                                    "created_utc": 1625599766.0,
                                    "replies": [
                                        {
                                            "body": "Bruh Naruto was able to send out multiple shadow clones to different battlefields during war arc and was able to sustain them for long periods of times, even battling one of the deadliest Kage, the 3rd Raikage with one of his clones. \n\nYou telling me Naruto doesn’t have the mental strength to send out 20 shadow clones to help him work, work around the house and patrol the village? Ffs the excuses her worse and worse",
                                            "author": "Captainprice101",
                                            "id": "h4big6k",
                                            "parent_id": "t1_h49rxu3",
                                            "score": 2,
                                            "created_utc": 1625631276.0,
                                            "replies": [
                                                {
                                                    "body": "Paperwork, he's not very smart...\n\nPhysical fatigue he can handle, because he's strong.",
                                                    "author": "Shrenade514",
                                                    "id": "h4c01dn",
                                                    "parent_id": "t1_h4big6k",
                                                    "score": 1,
                                                    "created_utc": 1625645451.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "Yep, but gotta have conflict somehow I guess.\n\nHeck, they could've even used the whole chakra disease thingy from the novels, atleast that would've somewhat justified him getting weaker but they just went forward hoping people won't care or notice....Smh.",
                                    "author": "Aweguy1998",
                                    "id": "h4991xf",
                                    "parent_id": "t1_h498n8c",
                                    "score": 2,
                                    "created_utc": 1625591262.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Which is entirely plot. Naruto should not have gotten weaker. Dude could make 2,000 clones at the age of 12. He was able to literally send out multiple shadow clones to different battlefields during war arc.",
                            "author": "Captainprice101",
                            "id": "h4bi7jw",
                            "parent_id": "t1_h498e6n",
                            "score": 2,
                            "created_utc": 1625631121.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": ">>also remember that he also has a force multiplier in his clones. None of the other Kage can spam SC the way he does to do all his work.\n\nMaybe in Naruto or Naruto Shippuden he did. In Boruto, he can't sustain clones for a long time even when the no. of clones used is not that high. Before he could spam thousands of them. Now, he gets tired after a big ball Rasengan and stuff.\nIt's pretty bad how nerfed he and Sasuke are.",
            "author": "Aweguy1998",
            "id": "h498e6n",
            "parent_id": "t1_h495p9q",
            "score": 0,
            "created_utc": 1625590969.0,
            "replies": [
                {
                    "body": "Which is ridiculous. He’s gotten *stronger*, not weaker. He should be now be able to field clone armies comparable in population to the village itself. \n\nHell, in the Boruto movie they didn’t have this. He had clones everywhere.",
                    "author": "Lancaster1719",
                    "id": "h498n8c",
                    "parent_id": "t1_h498e6n",
                    "score": 10,
                    "created_utc": 1625591079.0,
                    "replies": [
                        {
                            "body": "Being in pretty much peace time made him use less clones, having a family made him less lonely an even more reason of him being wack and having a fucking stressful dip shit as a child made him even worse. Allthough it is ironic that in actual fights he can use a crap ton of clones, idfk why the animators made so many shitty fillers in Boruto",
                            "author": "DoggoManWasTaken",
                            "id": "h4a21uz",
                            "parent_id": "t1_h498n8c",
                            "score": 4,
                            "created_utc": 1625604151.0,
                            "replies": [
                                {
                                    "body": "I think it makes just enough sense with the shared possibly multiplied fatigue that comes from the shared experience\n\nSo in fights the clones get hit fast enough that the fatigue hardly hits but using clones to do paperwork and serious work (not errand runs and apperances)  \nwould break his brain\n\nidk I'm bullshitin",
                                    "author": "whitey-ofwgkta",
                                    "id": "h4asqo7",
                                    "parent_id": "t1_h4a21uz",
                                    "score": 2,
                                    "created_utc": 1625617415.0,
                                    "replies": [
                                        {
                                            "body": "Haha, I get exhausted faster when my head hurts than from fights",
                                            "author": "DoggoManWasTaken",
                                            "id": "h4aulnc",
                                            "parent_id": "t1_h4asqo7",
                                            "score": 3,
                                            "created_utc": 1625618401.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Mental fatigue is a thing for shadow clones though, it's not just about raw strength",
                            "author": "Shrenade514",
                            "id": "h49rxu3",
                            "parent_id": "t1_h498n8c",
                            "score": 6,
                            "created_utc": 1625599766.0,
                            "replies": [
                                {
                                    "body": "Bruh Naruto was able to send out multiple shadow clones to different battlefields during war arc and was able to sustain them for long periods of times, even battling one of the deadliest Kage, the 3rd Raikage with one of his clones. \n\nYou telling me Naruto doesn’t have the mental strength to send out 20 shadow clones to help him work, work around the house and patrol the village? Ffs the excuses her worse and worse",
                                    "author": "Captainprice101",
                                    "id": "h4big6k",
                                    "parent_id": "t1_h49rxu3",
                                    "score": 2,
                                    "created_utc": 1625631276.0,
                                    "replies": [
                                        {
                                            "body": "Paperwork, he's not very smart...\n\nPhysical fatigue he can handle, because he's strong.",
                                            "author": "Shrenade514",
                                            "id": "h4c01dn",
                                            "parent_id": "t1_h4big6k",
                                            "score": 1,
                                            "created_utc": 1625645451.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Yep, but gotta have conflict somehow I guess.\n\nHeck, they could've even used the whole chakra disease thingy from the novels, atleast that would've somewhat justified him getting weaker but they just went forward hoping people won't care or notice....Smh.",
                            "author": "Aweguy1998",
                            "id": "h4991xf",
                            "parent_id": "t1_h498n8c",
                            "score": 2,
                            "created_utc": 1625591262.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Which is entirely plot. Naruto should not have gotten weaker. Dude could make 2,000 clones at the age of 12. He was able to literally send out multiple shadow clones to different battlefields during war arc.",
                    "author": "Captainprice101",
                    "id": "h4bi7jw",
                    "parent_id": "t1_h498e6n",
                    "score": 2,
                    "created_utc": 1625631121.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Which is ridiculous. He’s gotten *stronger*, not weaker. He should be now be able to field clone armies comparable in population to the village itself. \n\nHell, in the Boruto movie they didn’t have this. He had clones everywhere.",
            "author": "Lancaster1719",
            "id": "h498n8c",
            "parent_id": "t1_h498e6n",
            "score": 10,
            "created_utc": 1625591079.0,
            "replies": [
                {
                    "body": "Being in pretty much peace time made him use less clones, having a family made him less lonely an even more reason of him being wack and having a fucking stressful dip shit as a child made him even worse. Allthough it is ironic that in actual fights he can use a crap ton of clones, idfk why the animators made so many shitty fillers in Boruto",
                    "author": "DoggoManWasTaken",
                    "id": "h4a21uz",
                    "parent_id": "t1_h498n8c",
                    "score": 4,
                    "created_utc": 1625604151.0,
                    "replies": [
                        {
                            "body": "I think it makes just enough sense with the shared possibly multiplied fatigue that comes from the shared experience\n\nSo in fights the clones get hit fast enough that the fatigue hardly hits but using clones to do paperwork and serious work (not errand runs and apperances)  \nwould break his brain\n\nidk I'm bullshitin",
                            "author": "whitey-ofwgkta",
                            "id": "h4asqo7",
                            "parent_id": "t1_h4a21uz",
                            "score": 2,
                            "created_utc": 1625617415.0,
                            "replies": [
                                {
                                    "body": "Haha, I get exhausted faster when my head hurts than from fights",
                                    "author": "DoggoManWasTaken",
                                    "id": "h4aulnc",
                                    "parent_id": "t1_h4asqo7",
                                    "score": 3,
                                    "created_utc": 1625618401.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Mental fatigue is a thing for shadow clones though, it's not just about raw strength",
                    "author": "Shrenade514",
                    "id": "h49rxu3",
                    "parent_id": "t1_h498n8c",
                    "score": 6,
                    "created_utc": 1625599766.0,
                    "replies": [
                        {
                            "body": "Bruh Naruto was able to send out multiple shadow clones to different battlefields during war arc and was able to sustain them for long periods of times, even battling one of the deadliest Kage, the 3rd Raikage with one of his clones. \n\nYou telling me Naruto doesn’t have the mental strength to send out 20 shadow clones to help him work, work around the house and patrol the village? Ffs the excuses her worse and worse",
                            "author": "Captainprice101",
                            "id": "h4big6k",
                            "parent_id": "t1_h49rxu3",
                            "score": 2,
                            "created_utc": 1625631276.0,
                            "replies": [
                                {
                                    "body": "Paperwork, he's not very smart...\n\nPhysical fatigue he can handle, because he's strong.",
                                    "author": "Shrenade514",
                                    "id": "h4c01dn",
                                    "parent_id": "t1_h4big6k",
                                    "score": 1,
                                    "created_utc": 1625645451.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Yep, but gotta have conflict somehow I guess.\n\nHeck, they could've even used the whole chakra disease thingy from the novels, atleast that would've somewhat justified him getting weaker but they just went forward hoping people won't care or notice....Smh.",
                    "author": "Aweguy1998",
                    "id": "h4991xf",
                    "parent_id": "t1_h498n8c",
                    "score": 2,
                    "created_utc": 1625591262.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Which is entirely plot. Naruto should not have gotten weaker. Dude could make 2,000 clones at the age of 12. He was able to literally send out multiple shadow clones to different battlefields during war arc.",
            "author": "Captainprice101",
            "id": "h4bi7jw",
            "parent_id": "t1_h498e6n",
            "score": 2,
            "created_utc": 1625631121.0,
            "replies": []
        },
        {
            "body": "Being in pretty much peace time made him use less clones, having a family made him less lonely an even more reason of him being wack and having a fucking stressful dip shit as a child made him even worse. Allthough it is ironic that in actual fights he can use a crap ton of clones, idfk why the animators made so many shitty fillers in Boruto",
            "author": "DoggoManWasTaken",
            "id": "h4a21uz",
            "parent_id": "t1_h498n8c",
            "score": 4,
            "created_utc": 1625604151.0,
            "replies": [
                {
                    "body": "I think it makes just enough sense with the shared possibly multiplied fatigue that comes from the shared experience\n\nSo in fights the clones get hit fast enough that the fatigue hardly hits but using clones to do paperwork and serious work (not errand runs and apperances)  \nwould break his brain\n\nidk I'm bullshitin",
                    "author": "whitey-ofwgkta",
                    "id": "h4asqo7",
                    "parent_id": "t1_h4a21uz",
                    "score": 2,
                    "created_utc": 1625617415.0,
                    "replies": [
                        {
                            "body": "Haha, I get exhausted faster when my head hurts than from fights",
                            "author": "DoggoManWasTaken",
                            "id": "h4aulnc",
                            "parent_id": "t1_h4asqo7",
                            "score": 3,
                            "created_utc": 1625618401.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Mental fatigue is a thing for shadow clones though, it's not just about raw strength",
            "author": "Shrenade514",
            "id": "h49rxu3",
            "parent_id": "t1_h498n8c",
            "score": 6,
            "created_utc": 1625599766.0,
            "replies": [
                {
                    "body": "Bruh Naruto was able to send out multiple shadow clones to different battlefields during war arc and was able to sustain them for long periods of times, even battling one of the deadliest Kage, the 3rd Raikage with one of his clones. \n\nYou telling me Naruto doesn’t have the mental strength to send out 20 shadow clones to help him work, work around the house and patrol the village? Ffs the excuses her worse and worse",
                    "author": "Captainprice101",
                    "id": "h4big6k",
                    "parent_id": "t1_h49rxu3",
                    "score": 2,
                    "created_utc": 1625631276.0,
                    "replies": [
                        {
                            "body": "Paperwork, he's not very smart...\n\nPhysical fatigue he can handle, because he's strong.",
                            "author": "Shrenade514",
                            "id": "h4c01dn",
                            "parent_id": "t1_h4big6k",
                            "score": 1,
                            "created_utc": 1625645451.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yep, but gotta have conflict somehow I guess.\n\nHeck, they could've even used the whole chakra disease thingy from the novels, atleast that would've somewhat justified him getting weaker but they just went forward hoping people won't care or notice....Smh.",
            "author": "Aweguy1998",
            "id": "h4991xf",
            "parent_id": "t1_h498n8c",
            "score": 2,
            "created_utc": 1625591262.0,
            "replies": []
        },
        {
            "body": "I think it makes just enough sense with the shared possibly multiplied fatigue that comes from the shared experience\n\nSo in fights the clones get hit fast enough that the fatigue hardly hits but using clones to do paperwork and serious work (not errand runs and apperances)  \nwould break his brain\n\nidk I'm bullshitin",
            "author": "whitey-ofwgkta",
            "id": "h4asqo7",
            "parent_id": "t1_h4a21uz",
            "score": 2,
            "created_utc": 1625617415.0,
            "replies": [
                {
                    "body": "Haha, I get exhausted faster when my head hurts than from fights",
                    "author": "DoggoManWasTaken",
                    "id": "h4aulnc",
                    "parent_id": "t1_h4asqo7",
                    "score": 3,
                    "created_utc": 1625618401.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Bruh Naruto was able to send out multiple shadow clones to different battlefields during war arc and was able to sustain them for long periods of times, even battling one of the deadliest Kage, the 3rd Raikage with one of his clones. \n\nYou telling me Naruto doesn’t have the mental strength to send out 20 shadow clones to help him work, work around the house and patrol the village? Ffs the excuses her worse and worse",
            "author": "Captainprice101",
            "id": "h4big6k",
            "parent_id": "t1_h49rxu3",
            "score": 2,
            "created_utc": 1625631276.0,
            "replies": [
                {
                    "body": "Paperwork, he's not very smart...\n\nPhysical fatigue he can handle, because he's strong.",
                    "author": "Shrenade514",
                    "id": "h4c01dn",
                    "parent_id": "t1_h4big6k",
                    "score": 1,
                    "created_utc": 1625645451.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Haha, I get exhausted faster when my head hurts than from fights",
            "author": "DoggoManWasTaken",
            "id": "h4aulnc",
            "parent_id": "t1_h4asqo7",
            "score": 3,
            "created_utc": 1625618401.0,
            "replies": []
        },
        {
            "body": "Paperwork, he's not very smart...\n\nPhysical fatigue he can handle, because he's strong.",
            "author": "Shrenade514",
            "id": "h4c01dn",
            "parent_id": "t1_h4big6k",
            "score": 1,
            "created_utc": 1625645451.0,
            "replies": []
        }
    ]
}