{
    "title": "My boy made some good points",
    "post_id": "rptxj8",
    "post_url": "https://www.reddit.com/r/dankruto/comments/rptxj8/my_boy_made_some_good_points/",
    "author": "K_Cobalt",
    "body": "",
    "url": "https://i.redd.it/xgctdb5tp4881.jpg",
    "score": 4721,
    "upvote_ratio": 0.99,
    "created_utc": 1640630004.0,
    "num_comments": 81,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "We are but men, drawn to act in the name of revenge we deem to be \"justice\".",
            "author": "Regal_The_King",
            "id": "hq6ony4",
            "parent_id": "t3_rptxj8",
            "score": 242,
            "created_utc": 1640635180.0,
            "replies": []
        },
        {
            "body": "Pain is the GOAT as much of a badass Madara was, Pain still hits different. My favourite villain in all of anime.",
            "author": "Affectionate_Fuel_60",
            "id": "hq6rnf3",
            "parent_id": "t3_rptxj8",
            "score": 342,
            "created_utc": 1640636403.0,
            "replies": [
                {
                    "body": "Madara was so much overpowered that it made fight less enjoyable compare to pain  ..pain and Naruto fight was peak moment of shippuden in my opn.",
                    "author": "priyashu",
                    "id": "hq78o7l",
                    "parent_id": "t1_hq6rnf3",
                    "score": 213,
                    "created_utc": 1640643441.0,
                    "replies": [
                        {
                            "body": "Pain was one of the last and best fights in the series that showed powerful combatants but also implemented a lot of strategy.\n\nI LOVE seeing characters get OP abilities and launch them at each other so unlike much of the fan base I don't hate the series for that.\n\nBut, Naruto v Pain was just dope because they were really strong but Pain's weaknesses just couldn't be beaten by \"hurl nuke and wait\". Which was nice.",
                            "author": "ThaRealSunGod",
                            "id": "hq8vs0y",
                            "parent_id": "t1_hq78o7l",
                            "score": 51,
                            "created_utc": 1640671007.0,
                            "replies": []
                        },
                        {
                            "body": "Yea",
                            "author": "XXVI_F",
                            "id": "hq7kyea",
                            "parent_id": "t1_hq78o7l",
                            "score": 27,
                            "created_utc": 1640648741.0,
                            "replies": []
                        },
                        {
                            "body": "Yup. I would've loved to see a regular Madara vs Naruto, not rinnegan, reanimated or 10 tails Madara. Just good old EMS Madara that hashirama fought at the valley of the end.",
                            "author": "Andrew109",
                            "id": "hq93xv9",
                            "parent_id": "t1_hq78o7l",
                            "score": 17,
                            "created_utc": 1640676574.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Pain wasn’t Kaguya’s little bitch and actually killed off an important character in Naruto's life (sorry Neji), moreover he made some really good points throughout his dialogues with Naruto, Tsunade and Jiraya. And he’s swag. He was OP but had his limitations (cooldown), and that made him really interesting to watch. \n\nAs for Madara, he is awesome despite being overpowered. But, eh, he is Kaguya’s (Kishimito’s) bitch and has lost all the appeal after being stabbed by Black Zetsu. Gosh, such an asspull it still hurts after all these years as if this chapter was released yesterday.",
                    "author": "Labranth",
                    "id": "hq9aqzv",
                    "parent_id": "t1_hq6rnf3",
                    "score": 21,
                    "created_utc": 1640681940.0,
                    "replies": []
                },
                {
                    "body": "Madara was certainly a good villain. But Pain isn't good, he is God.",
                    "author": "Late-Ad155",
                    "id": "hq8nhf3",
                    "parent_id": "t1_hq6rnf3",
                    "score": 15,
                    "created_utc": 1640666346.0,
                    "replies": []
                },
                {
                    "body": "Pain got screwed over because \"what a twist\" syndrome.",
                    "author": "DisneyPrincessDVorah",
                    "id": "hq96e7b",
                    "parent_id": "t1_hq6rnf3",
                    "score": 4,
                    "created_utc": 1640678444.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Lmao you think Konoha cares?\n\nJust like any big powerful nation, they can do whatever the F they want and there will be no consequences. Naruto is the only one kind enough to listen to his story. The fact that the show portrays Pain as the villain is proof enough, in his own story, HE'S the hero.",
            "author": "Agatha27",
            "id": "hq796m6",
            "parent_id": "t3_rptxj8",
            "score": 147,
            "created_utc": 1640643657.0,
            "replies": [
                {
                    "body": "Akatsuki was heroes until Obito taking over.",
                    "author": "nhansieu1",
                    "id": "hq8vfv7",
                    "parent_id": "t1_hq796m6",
                    "score": 10,
                    "created_utc": 1640670800.0,
                    "replies": [
                        {
                            "body": "Akatsuki was heroes until Danzo killed Yahiko.",
                            "author": "Agatha27",
                            "id": "hq8vt58",
                            "parent_id": "t1_hq8vfv7",
                            "score": 36,
                            "created_utc": 1640671027.0,
                            "replies": [
                                {
                                    "body": "🤝",
                                    "author": "Mackenzie_Sparks",
                                    "id": "hq9a5x3",
                                    "parent_id": "t1_hq8vt58",
                                    "score": 7,
                                    "created_utc": 1640681454.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "🤢Obito🤮",
                            "author": "vedat07taskiran",
                            "id": "hqbtfti",
                            "parent_id": "t1_hq8vfv7",
                            "score": 3,
                            "created_utc": 1640727072.0,
                            "replies": [
                                {
                                    "body": "🤮 🤮",
                                    "author": "nhansieu1",
                                    "id": "hqckwu0",
                                    "parent_id": "t1_hqbtfti",
                                    "score": 1,
                                    "created_utc": 1640738797.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Which is like one of the few examples of good writing in the series, but it was a dang good character",
                    "author": "TyrannoROARus",
                    "id": "hq7dhwp",
                    "parent_id": "t1_hq796m6",
                    "score": 60,
                    "created_utc": 1640645492.0,
                    "replies": [
                        {
                            "body": "FEW examples?  C'mon dude, there were plot holes and not enough depth with the female characters but 90% of the series is top tier",
                            "author": "uglynerdishere",
                            "id": "hq959hf",
                            "parent_id": "t1_hq7dhwp",
                            "score": 7,
                            "created_utc": 1640677579.0,
                            "replies": [
                                {
                                    "body": "Idk man, everyone agrees it lost the plot after naruto and Sasuke became reincarnated jesus babies and aliens got involved (granted that is EOS).\n\nAnd like, naruto is hated, but is also the top Shinobi and nobody told him about his dad because reasons and itachi wanted Sasuke to develop \"hate\" I mean there is a lot of plot that just sounds like a 14 year old wrote it lmao",
                                    "author": "TyrannoROARus",
                                    "id": "hqba4oc",
                                    "parent_id": "t1_hq959hf",
                                    "score": -1,
                                    "created_utc": 1640719249.0,
                                    "replies": [
                                        {
                                            "body": "You're just oversimplified it to make it sound stupid now, there's way more to than Naruto is hated but also top shinobi or Itachi wanting Sasuke to hate him. Anything cam sound stupid when you word it certain",
                                            "author": "uglynerdishere",
                                            "id": "hqblfnj",
                                            "parent_id": "t1_hqba4oc",
                                            "score": 2,
                                            "created_utc": 1640723782.0,
                                            "replies": [
                                                {
                                                    "body": "Okay well agree to disagree 🙂",
                                                    "author": "TyrannoROARus",
                                                    "id": "hqc0ql5",
                                                    "parent_id": "t1_hqblfnj",
                                                    "score": 1,
                                                    "created_utc": 1640730079.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Neji was right and Pain was right",
            "author": "iridi69",
            "id": "hq6tns6",
            "parent_id": "t3_rptxj8",
            "score": 88,
            "created_utc": 1640637235.0,
            "replies": [
                {
                    "body": "Neji was half right. Genetics and fate determine most of a shinobi's potential in the Naruto world. It's true that no amount of grit and hard work will allow an average shinobi to compete with the likes of Madara, Hashirama, Naruto, or Sasuke. \n\n\nBut Neji wasn't looking at those peaks of power when he made his argument; he was just upset because he and his father were expected from birth to serve the main branch of the Hyuga family. Neji was never permanently stuck in this position, not truly. \n\nIf he wanted, Neji could have arranged the assassination of the members of the main Hyuga branch. He might have needed time to plan, prepare, or arrange the incident; but he could have done it. The Akatsuki would have probably taken the job and probably could have succeeded. The other Hidden Villages would have probably helped him if he agreed to give up one or more of his Byakugan as payment (assuming they found a way to defeat the seal on his eyes). Ultimately, Neji was trapped by his own defeatism rather than any real impossibility of changing his situation.\n\nThough, of course, Naruto's counterargument to Neji was malarkey. Naruto put all his eggs in the \"you can become strong if you try\" basket, but Naruto only beat Neji because of Kurama's strength, something Naruto didn't have to earn on his own.",
                    "author": "Justicar-terrae",
                    "id": "hq7ihmg",
                    "parent_id": "t1_hq6tns6",
                    "score": 73,
                    "created_utc": 1640647656.0,
                    "replies": [
                        {
                            "body": "Well Naruto wasn't arguing about strength he was arguing about forging your own destiny rather than being a slave to it which is something Naruto has always been consistent with. \n\nAnd while Naruto loses without Kurama he beat Neji with shadow clones and he tells Neji that it was something that he used to suck at and it wasn't a natural talent like Neji had assumed.",
                            "author": "sonfoa",
                            "id": "hq80jnn",
                            "parent_id": "t1_hq7ihmg",
                            "score": 40,
                            "created_utc": 1640655680.0,
                            "replies": [
                                {
                                    "body": "It doesn't even make sense, Naruto learned shadow clones, a Jounin rank jutsu that most people can't use in like 2 hours",
                                    "author": "Late-Ad155",
                                    "id": "hq8nmtq",
                                    "parent_id": "t1_hq80jnn",
                                    "score": 14,
                                    "created_utc": 1640666426.0,
                                    "replies": [
                                        {
                                            "body": "Well, that shows that Naruto's issues before the beginning of the series had to do with a lack of self-confidence rather than laziness or being talentless. People forget that Naruto had been working hard to practice the clone technique for a long time prior to him jumping to a thousand shadow clones. But when Iruka displayed confidence in Naruto all of a sudden found it within himself to make a thousand shadow clones when before he couldn't even do a single regular clone.\n\nThat was what Naruto was telling Neji. To stop bemoaning an alleged fate and have the confidence to make your own path even calling him a genius unlike him (Naruto). And that sticks with Neji to the point that it's something he says before he finishes off Kidomaru.",
                                            "author": "sonfoa",
                                            "id": "hq90qex",
                                            "parent_id": "t1_hq8nmtq",
                                            "score": 9,
                                            "created_utc": 1640674240.0,
                                            "replies": [
                                                {
                                                    "body": "Nooo ! Shadow clones and clones are completely different jutsu, Naruto couldn't use clones because he had too much chakra, no because he was \"bad at it\"",
                                                    "author": "Late-Ad155",
                                                    "id": "hqar82d",
                                                    "parent_id": "t1_hq90qex",
                                                    "score": 1,
                                                    "created_utc": 1640711772.0,
                                                    "replies": []
                                                },
                                                {
                                                    "body": "it was probably actually that for Naruto molding miniscule chakras like he'd need to for intangible clones is harder than it is for solid clones",
                                                    "author": "saiyanfang10",
                                                    "id": "hq9yx5q",
                                                    "parent_id": "t1_hq90qex",
                                                    "score": 1,
                                                    "created_utc": 1640699427.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "People always forget that Naruto literally broke the cycle of Indra and Asura. He literally broke his own destiny.",
                                    "author": "FullMoon_Escapade",
                                    "id": "hq8yieh",
                                    "parent_id": "t1_hq80jnn",
                                    "score": 11,
                                    "created_utc": 1640672730.0,
                                    "replies": [
                                        {
                                            "body": "I know. It kind of gets tiring to say all the time though.",
                                            "author": "sonfoa",
                                            "id": "hq91jbq",
                                            "parent_id": "t1_hq8yieh",
                                            "score": 3,
                                            "created_utc": 1640674810.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "So Naruto was indeed destined to be special... Neji's point.",
                                            "author": "frenin",
                                            "id": "hq9gnqz",
                                            "parent_id": "t1_hq8yieh",
                                            "score": 2,
                                            "created_utc": 1640686836.0,
                                            "replies": [
                                                {
                                                    "body": "No. He was destined to kill Sasuke, continuing the reincarnation of the two brothers. He broke that by bringing Sasuke to the good side instead of killing him. How did you not get that?\n\nBesides, didn't Neji say he was destined to be a failure???",
                                                    "author": "FullMoon_Escapade",
                                                    "id": "hqa023m",
                                                    "parent_id": "t1_hq9gnqz",
                                                    "score": 0,
                                                    "created_utc": 1640700025.0,
                                                    "replies": [
                                                        {
                                                            "body": "I did get that, in fact I have said that a lot of times. I say that Naruto was indeed destined to be special and only special people do get the chance to become Hokage.\n\n\n>Besides, didn't Neji say he was destined to be a failure???\n\nYou can only forgive him there, he didn't know he was dealing with the MC.",
                                                            "author": "frenin",
                                                            "id": "hqa0bj1",
                                                            "parent_id": "t1_hqa023m",
                                                            "score": 2,
                                                            "created_utc": 1640700160.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Ok, I guess? I don't get how that rebuttals my earlier point, or adds to the point that Neji was somehow right despite Naruto breaking a generational destiny of his.",
                                                                    "author": "FullMoon_Escapade",
                                                                    "id": "hqa0k9s",
                                                                    "parent_id": "t1_hqa0bj1",
                                                                    "score": 1,
                                                                    "created_utc": 1640700283.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "Because Neji talked about two things.\n\n* People have their fate sealed since birth and no matter what they do, they can't escape it.\n\nHe was wrong in this.\n\n\n* No matter how much you try, only those special enough become Hokage. \n\nHe was right in this.",
                                                                            "author": "frenin",
                                                                            "id": "hqa1ug8",
                                                                            "parent_id": "t1_hqa0k9s",
                                                                            "score": 2,
                                                                            "created_utc": 1640700930.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "That's too vague to even be considered a prophesy. \n\nObviously only special people become Hokage. It wouldn't be as coveted as it is if regular ass ninja got it. That was something that existed long before Neji even existed. Besides, he never directed that to Naruto. In fact, he used it to say that Naruto was not special and would not become Hokage, so i seriously fail to see why you would even bring that up.",
                                                                                    "author": "FullMoon_Escapade",
                                                                                    "id": "hqavrtm",
                                                                                    "parent_id": "t1_hqa1ug8",
                                                                                    "score": 1,
                                                                                    "created_utc": 1640713570.0,
                                                                                    "replies": [
                                                                                        {
                                                                                            "body": "That was Neji's point, what Neji failed to understand was that Naruto **was special**.\nHence the meme.",
                                                                                            "author": "frenin",
                                                                                            "id": "hqb0399",
                                                                                            "parent_id": "t1_hqavrtm",
                                                                                            "score": 1,
                                                                                            "created_utc": 1640715279.0,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "body": "Goodnight dude",
                                                                                                    "author": "FullMoon_Escapade",
                                                                                                    "id": "hqbrq3h",
                                                                                                    "parent_id": "t1_hqb0399",
                                                                                                    "score": 1,
                                                                                                    "created_utc": 1640726368.0,
                                                                                                    "replies": []
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "body": "Or was it his destiny to break the cycle? ahah...gotcha!",
                                            "author": "empecabel",
                                            "id": "hq9tllc",
                                            "parent_id": "t1_hq8yieh",
                                            "score": 1,
                                            "created_utc": 1640696372.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "Neji was indeed talking about strength and how that ties to your destiny however.\nHe made a point in remarking that Hokages are not made but are born.\nWhich turned out to be incredibly true.",
                                    "author": "frenin",
                                    "id": "hq8z3b4",
                                    "parent_id": "t1_hq80jnn",
                                    "score": 2,
                                    "created_utc": 1640673118.0,
                                    "replies": []
                                },
                                {
                                    "body": "Except he wasnt though\n\nDid everyone forget the plot of Naruto was meant to save the world?\nThis destiny overrides the reincarnation one \n\nAnd guess what\nIt's a self fulfilling prophecy he was always bound to do this task \nEvery action he took was towards this task \n\nNaruto was a slave to his destiny the whole time \nThe funny thing is people are just as disillusioned as he was to think he broke his destiny when In reality he just fulfilled his biggest one",
                                    "author": "SnooComics7583",
                                    "id": "hq8pr4v",
                                    "parent_id": "t1_hq80jnn",
                                    "score": 2,
                                    "created_utc": 1640667544.0,
                                    "replies": [
                                        {
                                            "body": "How is he a slave to his destiny when he chose what he wanted? \n\nThe whole point of Naruto is that he forges his own destiny. He's the subject of prophecies but he doesn't even know about them much less care (very similar to Luffy in that regard). Heck, the one time Naruto is told by someone that is his destiny is the Indra/Asura stuff and he straight up rejects that because he doesn't like it and then makes a point to refute that \"destiny\".\n\nWhen Naruto starts thinking big picture in the story and trying to find a solution for peace his driving force is to be the ideal shinobi Jiraiya wrote about not some prophecy.",
                                            "author": "sonfoa",
                                            "id": "hq91ggs",
                                            "parent_id": "t1_hq8pr4v",
                                            "score": 9,
                                            "created_utc": 1640674751.0,
                                            "replies": [
                                                {
                                                    "body": "Becuase he didnt choose\nLike I said\n\nEvery single action he ever took wasnt his \nThey all work towards his destiny\n\nIn fact even if he knew he couldn't change it becuase it would change who he is\nHe never had a choice hence disillusioned \n\nThe destiny of indra/ashura as I mentioned is smaller and also part of the bigger destiny he fulfills \nThe fact that he breaks the smaller destiny is part of the bigger destiny he fulfills\n\nWhich again is part of that prophecy \nHis ideal shinobi for peace is exactly what grants him being the worlds savior which is again part of that prophecy \nThis is all what a self fulfilling prophecy is\n\n\nIf I sound like a broken record at this point \nGood because hopefully that hammers in the point",
                                                    "author": "SnooComics7583",
                                                    "id": "hq91ywz",
                                                    "parent_id": "t1_hq91ggs",
                                                    "score": -1,
                                                    "created_utc": 1640675122.0,
                                                    "replies": [
                                                        {
                                                            "body": "Just for a second think how ridiculous you sound. By your logic, nobody's choices are their own because some dude might have mentioned it unbeknownst to you and that means everything in your life is predetermined and out of your control. \n\nAnd did you say Naruto never had a choice to become disillusioned? How can you read a series where there are half a dozen diverging paths that the author gives to characters similar to Naruto and makes it a point to show that Naruto could have very well gone that path something that the titular character remarks numerous times throughout the story.\n\nRead the story again because clearly you're talking about a different one.",
                                                            "author": "sonfoa",
                                                            "id": "hq93wld",
                                                            "parent_id": "t1_hq91ywz",
                                                            "score": 3,
                                                            "created_utc": 1640676547.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Neji was dead right.",
                            "author": "Itsy_Bitsy_Horny",
                            "id": "hq96ekd",
                            "parent_id": "t1_hq7ihmg",
                            "score": 5,
                            "created_utc": 1640678451.0,
                            "replies": []
                        },
                        {
                            "body": ">Though, of course, Naruto's counterargument to Neji was malarkey. Naruto put all his eggs in the \"you can become strong if you try\" basket, but Naruto only beat Neji because of Kurama's strength, something Naruto didn't have to earn on his own\n\nExcept he did naruto forced kuramas power out also kurama at that point fucking hated him kurama also ruined his fucking life kurama is the sole reason narutos entire existence was shit for the first like 12 to 16 years also the idea that any of narutos genetics actually helped him is dumb what did being the fourth hokages son do for him what did being ashuras reincarnation do for him hell think where naruto would have been had he had his parents instead of losing them both jiraiya and kakashi did a whole Lotta fucking nothing to help him in the first place",
                            "author": "Helrend",
                            "id": "hq7z9so",
                            "parent_id": "t1_hq7ihmg",
                            "score": 4,
                            "created_utc": 1640655106.0,
                            "replies": [
                                {
                                    "body": "Did Naruto have a shitty childhood? Yes. Could Naruto have accomplished any of his goals without kickass genetics and personal connections to important people? No. \n\nNaruto forcing Kurama's power out in the Neji fight doesn't change the fact that it's not his own power. And it's not like this is something Naruto does consciously anyway, the power shows up pre-Shippuden whenever Naruto gets emotionally charged while backed into a corner. It showed up against Orochimaru's snake in the forest, against Haku in the Zabuza fight, and against Neji in the tournament. \n\nAs for what being the son of the 4th and Kushina got him: \n\nNaruto inherited the Uzamaki stamina and ability to heal from wounds really quickly. He also had naturally deep chakra reserves even without Kurama. This allowed him to make tons of shadow clones, almost guaranteeing more efficient training once someone showed him the clone trick.\n\nNaruto got personal tutelage from Jiriya because of the connection between Jiriya and the 4th, though Naruto didn't know it at the time. Jiriya taught Naruto basic chakra control, the summoning jutsu, and the rasengan.\n\nBecause of Jiriya, Naruto also formed a connection with the Toad Sages. This led to Naruto getting the opportunity to learn Senjutsu. Yes Naruto worked really hard to master Sage Mode, but few Shinobi ever get the chance to attempt it. And Naruto benefitted from Jiriya's longtime friend/teacher dedicating himself to Naruto's sage training after Jiriya died. \n\nBecause of Jiriya, Naruto also developed a personal relationship with Pain during their fight. This connection allowed Naruto the opportunity to negotiate with Nagato, which allowed for the resurrection of the dead Leaf Shinobi. Was this also the result of Naruto's choices? Yes. Could anyone else have pulled this off? Almost certainly not. Nagato only cared about Naruto's philosophy because they had the same teacher.\n\nNaruto also benefitted from Kakashi, who was assigned to team 7 partly because of the connection Kakashi shared with both Naruto and Sasuke. Kakashi, though not until mid Shippuden, taught Naruto how to harness shadow clones for training. Kakashi also leveraged his own connections to recruit Yamato for the sole purpose of sitting still all day to assist Naruto with training by suppressing Kurama's chakra. \n\nAnd being an Ashura incarnate led directly to Naruto receiving the Six Paths abilities which: amplified Naruto's healing abilities to the point he could regenerate even other people's body parts, greatly improved his stamina and strength, gave him truth seeking orbs, and let him naturally fly.",
                                    "author": "Justicar-terrae",
                                    "id": "hq828am",
                                    "parent_id": "t1_hq7z9so",
                                    "score": 19,
                                    "created_utc": 1640656439.0,
                                    "replies": [
                                        {
                                            "body": "Well if the 4th and kushina alived and no kurama mean he would be able to learn from the best teacher ie his father. \n\nNaruto is a pretty f*cking genius, along with his hardwork, uzumaki chakra and proper teachher he would kick the shit out of every single genins there.",
                                            "author": "Kaiser_Imperius",
                                            "id": "hq8f6qr",
                                            "parent_id": "t1_hq828am",
                                            "score": 1,
                                            "created_utc": 1640662349.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "....................,,,,,,,,,,,,,,,,,,,,,,,\n\n Take those and fucking use them",
                                    "author": "PrimusFucks",
                                    "id": "hq8l8co",
                                    "parent_id": "t1_hq7z9so",
                                    "score": 6,
                                    "created_utc": 1640665213.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "'Neji was right circlejerk' needs to die",
                    "author": "vedat07taskiran",
                    "id": "hqbtj7g",
                    "parent_id": "t1_hq6tns6",
                    "score": 1,
                    "created_utc": 1640727112.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Pain makes some pretty solid points about how fucked up the Shinobi world is but his plans for how to fix it are like the equivalent of dumping water on a grease fire and whenever anyone tries to point out that he’s just going to make things worse by doing that his response is to turn around and say “Well do you have a better idea?”",
            "author": "HollyTheMage",
            "id": "hq8s7wx",
            "parent_id": "t3_rptxj8",
            "score": 22,
            "created_utc": 1640668907.0,
            "replies": [
                {
                    "body": "It's funny that even tho Pain's plan was very dumb, no one had in fact a better idea lol.",
                    "author": "frenin",
                    "id": "hq8zbi8",
                    "parent_id": "t1_hq8s7wx",
                    "score": 20,
                    "created_utc": 1640673268.0,
                    "replies": [
                        {
                            "body": "The crazy part is without the Akatsuki none of the great nations would have ever had peace amongst themselves.  I'm not even sure if the Leaf and Sand would have been great allies either without the Akatsuki.   Sure Naruto and Gaara were on good terms, but both nations seemed to just tolerate the other at that point.\n\nThe threat of a mutually assured destruction seems a lot more plausible to me than anything else in the shinobi world in regards to peace.  The only reason there was peace at the end was because there was a world ending threat that forced the great nations to work together and a lot of strong bonds were forged.  Without that threat, I really don't know if peace would have been possible in the story.\n\nSure Pain's plan may have been dumping water on a grease fire, and as dumb as it was, do you think there could have been a better plan?  Especially since most of the great nations hated each other due to past skirmishes/wars.  \n\nIt's all interesting to think about though.  Idk it just seems like no one would have come up with an answer for peace without the 4th great ninja war happening. Sorry for rambling haha.",
                            "author": "TheAllSparx",
                            "id": "hq9knhn",
                            "parent_id": "t1_hq8zbi8",
                            "score": 6,
                            "created_utc": 1640690053.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "More or less it was the equivalent of nuclear weapons",
                    "author": "bilbo_swagginz_boi",
                    "id": "hu3vh2r",
                    "parent_id": "t1_hq8s7wx",
                    "score": 3,
                    "created_utc": 1643081397.0,
                    "replies": [
                        {
                            "body": "Exactly. It's kind of hilarious because the Tailed Beasts were already essentially being treated as weapons of mass destruction by the Shinobi Nations, and yet that never seemed to stop the wars from occurring, so I'm not sure what the hell Pain is expecting to happen other than just making everything worse.",
                            "author": "HollyTheMage",
                            "id": "hu40eka",
                            "parent_id": "t1_hu3vh2r",
                            "score": 1,
                            "created_utc": 1643083798.0,
                            "replies": [
                                {
                                    "body": "Most biju weren’t really a big enough threat to scare off all major war. Some of Akatsuki could take many out individually. Most outside of 9 tails were manageable. Lot of individual ninjas were much bigger threats.\n\nBut a nuke would be instant vaporization of a whole village. Much harder to defend against",
                                    "author": "bilbo_swagginz_boi",
                                    "id": "hu6f7vk",
                                    "parent_id": "t1_hu40eka",
                                    "score": 3,
                                    "created_utc": 1643132062.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Pain is easily top 3 in shonen villains for me, but the down side is every body swears he's a good guy in his own story which shows that a lot of people fail to understand his character completely.",
            "author": "JadedF20",
            "id": "hq83g31",
            "parent_id": "t3_rptxj8",
            "score": 27,
            "created_utc": 1640656982.0,
            "replies": [
                {
                    "body": "who's your other top 2?",
                    "author": "curiousmetapod",
                    "id": "hq8luy9",
                    "parent_id": "t1_hq83g31",
                    "score": 7,
                    "created_utc": 1640665526.0,
                    "replies": [
                        {
                            "body": "King Bradley: FMA\n\nGriffith: Beserk\n\nHonorable mentions\n\nAizen: Bleach\n\nLight: Death Note",
                            "author": "JadedF20",
                            "id": "hq8oaem",
                            "parent_id": "t1_hq8luy9",
                            "score": 17,
                            "created_utc": 1640666764.0,
                            "replies": [
                                {
                                    "body": "Oh nice. My favorite is the mastermind of the Danganronpa series (can't say who they are because spoilers)",
                                    "author": "HollyTheMage",
                                    "id": "hq8sjns",
                                    "parent_id": "t1_hq8oaem",
                                    "score": 5,
                                    "created_utc": 1640669096.0,
                                    "replies": [
                                        {
                                            "body": "Thanks, will add Danganronpa to my watchlist!",
                                            "author": "JadedF20",
                                            "id": "hq8tec7",
                                            "parent_id": "t1_hq8sjns",
                                            "score": 2,
                                            "created_utc": 1640669590.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "Please allow me to add honorable mention Hero Killer: Stain",
                                    "author": "mattfolio",
                                    "id": "hq8tuuy",
                                    "parent_id": "t1_hq8oaem",
                                    "score": 2,
                                    "created_utc": 1640669855.0,
                                    "replies": []
                                },
                                {
                                    "body": "Berserk isn't Shounen...",
                                    "author": "Fantastic_Nobody_772",
                                    "id": "hq95fxf",
                                    "parent_id": "t1_hq8oaem",
                                    "score": 2,
                                    "created_utc": 1640677716.0,
                                    "replies": [
                                        {
                                            "body": "Lemme have it man, I know its aimed at seinen, just a personal fav.",
                                            "author": "JadedF20",
                                            "id": "hq95ure",
                                            "parent_id": "t1_hq95fxf",
                                            "score": 3,
                                            "created_utc": 1640678029.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Sex with Fred bear",
            "author": "Ok_Inspection_3894",
            "id": "hq7at11",
            "parent_id": "t3_rptxj8",
            "score": 26,
            "created_utc": 1640644354.0,
            "replies": [
                {
                    "body": "amen",
                    "author": "TrexarSC",
                    "id": "hq7g504",
                    "parent_id": "t1_hq7at11",
                    "score": 5,
                    "created_utc": 1640646625.0,
                    "replies": []
                },
                {
                    "body": "💯",
                    "author": "A1steaksaussie",
                    "id": "hq8au45",
                    "parent_id": "t1_hq7at11",
                    "score": 5,
                    "created_utc": 1640660349.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Pain used talk no jutsu and it was super effective.",
            "author": "MannyDaWolf",
            "id": "hq8t43h",
            "parent_id": "t3_rptxj8",
            "score": 9,
            "created_utc": 1640669423.0,
            "replies": []
        },
        {
            "body": "Finally a good meme on this sub",
            "author": "RaideNGoDxD",
            "id": "hq88cj3",
            "parent_id": "t3_rptxj8",
            "score": 9,
            "created_utc": 1640659211.0,
            "replies": [
                {
                    "body": "You people really annoy me. This is the first comment I see on almost every post here. We get it, you mostly see reposted Facebook memes from 2015 when you pull up this sub",
                    "author": "Ok_Soil_231",
                    "id": "hq8njoi",
                    "parent_id": "t1_hq88cj3",
                    "score": -4,
                    "created_utc": 1640666379.0,
                    "replies": [
                        {
                            "body": "Finally a good meme on this sub",
                            "author": "Adminscantkeepmedown",
                            "id": "hq8pyx9",
                            "parent_id": "t1_hq8njoi",
                            "score": 14,
                            "created_utc": 1640667662.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Pain vs naruto was such a good battle,balanced and you could see narutos battle IQ being absolutely necessary to win the fight.I loved every bit of it",
            "author": "DxrknessDv",
            "id": "hq9illn",
            "parent_id": "t3_rptxj8",
            "score": 2,
            "created_utc": 1640688426.0,
            "replies": []
        },
        {
            "body": "WTF are you an actual sociopath or is this satire? I really hope it's satire and I'm just missing the joke.",
            "author": "Howtheginchstolexmas",
            "id": "hq7h46y",
            "parent_id": "t3_rptxj8",
            "score": -26,
            "created_utc": 1640647055.0,
            "replies": [
                {
                    "body": "The only thing I hope is satire is your comment",
                    "author": "K_Cobalt",
                    "id": "hq7jp87",
                    "parent_id": "t1_hq7h46y",
                    "score": 24,
                    "created_utc": 1640648188.0,
                    "replies": [
                        {
                            "body": "You do realise that torture and murder of innocents and children for fundamentally flawed ideals that you are trying to force onto others by violence and force is extremely wrong and in fact evil right?",
                            "author": "Howtheginchstolexmas",
                            "id": "hq7kaq4",
                            "parent_id": "t1_hq7jp87",
                            "score": -16,
                            "created_utc": 1640648451.0,
                            "replies": [
                                {
                                    "body": "My man you need to chill. You can reason with one's ideals without necessarily agreeing with the way they apply them in the world (which is by killing many and affecting pain on others in this case)",
                                    "author": "__REDJOHN_",
                                    "id": "hq7l3cl",
                                    "parent_id": "t1_hq7kaq4",
                                    "score": 16,
                                    "created_utc": 1640648803.0,
                                    "replies": []
                                },
                                {
                                    "body": "I think you forget this is a meme subreddit…",
                                    "author": "K_Cobalt",
                                    "id": "hq7ksav",
                                    "parent_id": "t1_hq7kaq4",
                                    "score": 9,
                                    "created_utc": 1640648667.0,
                                    "replies": []
                                },
                                {
                                    "body": "[Yes](https://www.youtube.com/watch?v=Ux5cQbO_ybw)",
                                    "author": "CaptainDogeSparrow",
                                    "id": "hq7ri1x",
                                    "parent_id": "t1_hq7kaq4",
                                    "score": 6,
                                    "created_utc": 1640651621.0,
                                    "replies": []
                                },
                                {
                                    "body": "And I hope you realize Pains philosophy and ways to do what he did we’re in the context of the (FICTIONAL) Ninja world of Naruto",
                                    "author": "Not-a-kirby-main",
                                    "id": "hq86kfh",
                                    "parent_id": "t1_hq7kaq4",
                                    "score": 5,
                                    "created_utc": 1640658402.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "L + ratio + dont care + you fell off",
            "author": "ryantv1324",
            "id": "hq9hkyh",
            "parent_id": "t3_rptxj8",
            "score": 1,
            "created_utc": 1640687590.0,
            "replies": []
        },
        {
            "body": "Madara was so much overpowered that it made fight less enjoyable compare to pain  ..pain and Naruto fight was peak moment of shippuden in my opn.",
            "author": "priyashu",
            "id": "hq78o7l",
            "parent_id": "t1_hq6rnf3",
            "score": 213,
            "created_utc": 1640643441.0,
            "replies": [
                {
                    "body": "Pain was one of the last and best fights in the series that showed powerful combatants but also implemented a lot of strategy.\n\nI LOVE seeing characters get OP abilities and launch them at each other so unlike much of the fan base I don't hate the series for that.\n\nBut, Naruto v Pain was just dope because they were really strong but Pain's weaknesses just couldn't be beaten by \"hurl nuke and wait\". Which was nice.",
                    "author": "ThaRealSunGod",
                    "id": "hq8vs0y",
                    "parent_id": "t1_hq78o7l",
                    "score": 51,
                    "created_utc": 1640671007.0,
                    "replies": []
                },
                {
                    "body": "Yea",
                    "author": "XXVI_F",
                    "id": "hq7kyea",
                    "parent_id": "t1_hq78o7l",
                    "score": 27,
                    "created_utc": 1640648741.0,
                    "replies": []
                },
                {
                    "body": "Yup. I would've loved to see a regular Madara vs Naruto, not rinnegan, reanimated or 10 tails Madara. Just good old EMS Madara that hashirama fought at the valley of the end.",
                    "author": "Andrew109",
                    "id": "hq93xv9",
                    "parent_id": "t1_hq78o7l",
                    "score": 17,
                    "created_utc": 1640676574.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Pain wasn’t Kaguya’s little bitch and actually killed off an important character in Naruto's life (sorry Neji), moreover he made some really good points throughout his dialogues with Naruto, Tsunade and Jiraya. And he’s swag. He was OP but had his limitations (cooldown), and that made him really interesting to watch. \n\nAs for Madara, he is awesome despite being overpowered. But, eh, he is Kaguya’s (Kishimito’s) bitch and has lost all the appeal after being stabbed by Black Zetsu. Gosh, such an asspull it still hurts after all these years as if this chapter was released yesterday.",
            "author": "Labranth",
            "id": "hq9aqzv",
            "parent_id": "t1_hq6rnf3",
            "score": 21,
            "created_utc": 1640681940.0,
            "replies": []
        },
        {
            "body": "Madara was certainly a good villain. But Pain isn't good, he is God.",
            "author": "Late-Ad155",
            "id": "hq8nhf3",
            "parent_id": "t1_hq6rnf3",
            "score": 15,
            "created_utc": 1640666346.0,
            "replies": []
        },
        {
            "body": "Pain got screwed over because \"what a twist\" syndrome.",
            "author": "DisneyPrincessDVorah",
            "id": "hq96e7b",
            "parent_id": "t1_hq6rnf3",
            "score": 4,
            "created_utc": 1640678444.0,
            "replies": []
        },
        {
            "body": "Akatsuki was heroes until Obito taking over.",
            "author": "nhansieu1",
            "id": "hq8vfv7",
            "parent_id": "t1_hq796m6",
            "score": 10,
            "created_utc": 1640670800.0,
            "replies": [
                {
                    "body": "Akatsuki was heroes until Danzo killed Yahiko.",
                    "author": "Agatha27",
                    "id": "hq8vt58",
                    "parent_id": "t1_hq8vfv7",
                    "score": 36,
                    "created_utc": 1640671027.0,
                    "replies": [
                        {
                            "body": "🤝",
                            "author": "Mackenzie_Sparks",
                            "id": "hq9a5x3",
                            "parent_id": "t1_hq8vt58",
                            "score": 7,
                            "created_utc": 1640681454.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "🤢Obito🤮",
                    "author": "vedat07taskiran",
                    "id": "hqbtfti",
                    "parent_id": "t1_hq8vfv7",
                    "score": 3,
                    "created_utc": 1640727072.0,
                    "replies": [
                        {
                            "body": "🤮 🤮",
                            "author": "nhansieu1",
                            "id": "hqckwu0",
                            "parent_id": "t1_hqbtfti",
                            "score": 1,
                            "created_utc": 1640738797.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Which is like one of the few examples of good writing in the series, but it was a dang good character",
            "author": "TyrannoROARus",
            "id": "hq7dhwp",
            "parent_id": "t1_hq796m6",
            "score": 60,
            "created_utc": 1640645492.0,
            "replies": [
                {
                    "body": "FEW examples?  C'mon dude, there were plot holes and not enough depth with the female characters but 90% of the series is top tier",
                    "author": "uglynerdishere",
                    "id": "hq959hf",
                    "parent_id": "t1_hq7dhwp",
                    "score": 7,
                    "created_utc": 1640677579.0,
                    "replies": [
                        {
                            "body": "Idk man, everyone agrees it lost the plot after naruto and Sasuke became reincarnated jesus babies and aliens got involved (granted that is EOS).\n\nAnd like, naruto is hated, but is also the top Shinobi and nobody told him about his dad because reasons and itachi wanted Sasuke to develop \"hate\" I mean there is a lot of plot that just sounds like a 14 year old wrote it lmao",
                            "author": "TyrannoROARus",
                            "id": "hqba4oc",
                            "parent_id": "t1_hq959hf",
                            "score": -1,
                            "created_utc": 1640719249.0,
                            "replies": [
                                {
                                    "body": "You're just oversimplified it to make it sound stupid now, there's way more to than Naruto is hated but also top shinobi or Itachi wanting Sasuke to hate him. Anything cam sound stupid when you word it certain",
                                    "author": "uglynerdishere",
                                    "id": "hqblfnj",
                                    "parent_id": "t1_hqba4oc",
                                    "score": 2,
                                    "created_utc": 1640723782.0,
                                    "replies": [
                                        {
                                            "body": "Okay well agree to disagree 🙂",
                                            "author": "TyrannoROARus",
                                            "id": "hqc0ql5",
                                            "parent_id": "t1_hqblfnj",
                                            "score": 1,
                                            "created_utc": 1640730079.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Neji was half right. Genetics and fate determine most of a shinobi's potential in the Naruto world. It's true that no amount of grit and hard work will allow an average shinobi to compete with the likes of Madara, Hashirama, Naruto, or Sasuke. \n\n\nBut Neji wasn't looking at those peaks of power when he made his argument; he was just upset because he and his father were expected from birth to serve the main branch of the Hyuga family. Neji was never permanently stuck in this position, not truly. \n\nIf he wanted, Neji could have arranged the assassination of the members of the main Hyuga branch. He might have needed time to plan, prepare, or arrange the incident; but he could have done it. The Akatsuki would have probably taken the job and probably could have succeeded. The other Hidden Villages would have probably helped him if he agreed to give up one or more of his Byakugan as payment (assuming they found a way to defeat the seal on his eyes). Ultimately, Neji was trapped by his own defeatism rather than any real impossibility of changing his situation.\n\nThough, of course, Naruto's counterargument to Neji was malarkey. Naruto put all his eggs in the \"you can become strong if you try\" basket, but Naruto only beat Neji because of Kurama's strength, something Naruto didn't have to earn on his own.",
            "author": "Justicar-terrae",
            "id": "hq7ihmg",
            "parent_id": "t1_hq6tns6",
            "score": 73,
            "created_utc": 1640647656.0,
            "replies": [
                {
                    "body": "Well Naruto wasn't arguing about strength he was arguing about forging your own destiny rather than being a slave to it which is something Naruto has always been consistent with. \n\nAnd while Naruto loses without Kurama he beat Neji with shadow clones and he tells Neji that it was something that he used to suck at and it wasn't a natural talent like Neji had assumed.",
                    "author": "sonfoa",
                    "id": "hq80jnn",
                    "parent_id": "t1_hq7ihmg",
                    "score": 40,
                    "created_utc": 1640655680.0,
                    "replies": [
                        {
                            "body": "It doesn't even make sense, Naruto learned shadow clones, a Jounin rank jutsu that most people can't use in like 2 hours",
                            "author": "Late-Ad155",
                            "id": "hq8nmtq",
                            "parent_id": "t1_hq80jnn",
                            "score": 14,
                            "created_utc": 1640666426.0,
                            "replies": [
                                {
                                    "body": "Well, that shows that Naruto's issues before the beginning of the series had to do with a lack of self-confidence rather than laziness or being talentless. People forget that Naruto had been working hard to practice the clone technique for a long time prior to him jumping to a thousand shadow clones. But when Iruka displayed confidence in Naruto all of a sudden found it within himself to make a thousand shadow clones when before he couldn't even do a single regular clone.\n\nThat was what Naruto was telling Neji. To stop bemoaning an alleged fate and have the confidence to make your own path even calling him a genius unlike him (Naruto). And that sticks with Neji to the point that it's something he says before he finishes off Kidomaru.",
                                    "author": "sonfoa",
                                    "id": "hq90qex",
                                    "parent_id": "t1_hq8nmtq",
                                    "score": 9,
                                    "created_utc": 1640674240.0,
                                    "replies": [
                                        {
                                            "body": "Nooo ! Shadow clones and clones are completely different jutsu, Naruto couldn't use clones because he had too much chakra, no because he was \"bad at it\"",
                                            "author": "Late-Ad155",
                                            "id": "hqar82d",
                                            "parent_id": "t1_hq90qex",
                                            "score": 1,
                                            "created_utc": 1640711772.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "it was probably actually that for Naruto molding miniscule chakras like he'd need to for intangible clones is harder than it is for solid clones",
                                            "author": "saiyanfang10",
                                            "id": "hq9yx5q",
                                            "parent_id": "t1_hq90qex",
                                            "score": 1,
                                            "created_utc": 1640699427.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "People always forget that Naruto literally broke the cycle of Indra and Asura. He literally broke his own destiny.",
                            "author": "FullMoon_Escapade",
                            "id": "hq8yieh",
                            "parent_id": "t1_hq80jnn",
                            "score": 11,
                            "created_utc": 1640672730.0,
                            "replies": [
                                {
                                    "body": "I know. It kind of gets tiring to say all the time though.",
                                    "author": "sonfoa",
                                    "id": "hq91jbq",
                                    "parent_id": "t1_hq8yieh",
                                    "score": 3,
                                    "created_utc": 1640674810.0,
                                    "replies": []
                                },
                                {
                                    "body": "So Naruto was indeed destined to be special... Neji's point.",
                                    "author": "frenin",
                                    "id": "hq9gnqz",
                                    "parent_id": "t1_hq8yieh",
                                    "score": 2,
                                    "created_utc": 1640686836.0,
                                    "replies": [
                                        {
                                            "body": "No. He was destined to kill Sasuke, continuing the reincarnation of the two brothers. He broke that by bringing Sasuke to the good side instead of killing him. How did you not get that?\n\nBesides, didn't Neji say he was destined to be a failure???",
                                            "author": "FullMoon_Escapade",
                                            "id": "hqa023m",
                                            "parent_id": "t1_hq9gnqz",
                                            "score": 0,
                                            "created_utc": 1640700025.0,
                                            "replies": [
                                                {
                                                    "body": "I did get that, in fact I have said that a lot of times. I say that Naruto was indeed destined to be special and only special people do get the chance to become Hokage.\n\n\n>Besides, didn't Neji say he was destined to be a failure???\n\nYou can only forgive him there, he didn't know he was dealing with the MC.",
                                                    "author": "frenin",
                                                    "id": "hqa0bj1",
                                                    "parent_id": "t1_hqa023m",
                                                    "score": 2,
                                                    "created_utc": 1640700160.0,
                                                    "replies": [
                                                        {
                                                            "body": "Ok, I guess? I don't get how that rebuttals my earlier point, or adds to the point that Neji was somehow right despite Naruto breaking a generational destiny of his.",
                                                            "author": "FullMoon_Escapade",
                                                            "id": "hqa0k9s",
                                                            "parent_id": "t1_hqa0bj1",
                                                            "score": 1,
                                                            "created_utc": 1640700283.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Because Neji talked about two things.\n\n* People have their fate sealed since birth and no matter what they do, they can't escape it.\n\nHe was wrong in this.\n\n\n* No matter how much you try, only those special enough become Hokage. \n\nHe was right in this.",
                                                                    "author": "frenin",
                                                                    "id": "hqa1ug8",
                                                                    "parent_id": "t1_hqa0k9s",
                                                                    "score": 2,
                                                                    "created_utc": 1640700930.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "That's too vague to even be considered a prophesy. \n\nObviously only special people become Hokage. It wouldn't be as coveted as it is if regular ass ninja got it. That was something that existed long before Neji even existed. Besides, he never directed that to Naruto. In fact, he used it to say that Naruto was not special and would not become Hokage, so i seriously fail to see why you would even bring that up.",
                                                                            "author": "FullMoon_Escapade",
                                                                            "id": "hqavrtm",
                                                                            "parent_id": "t1_hqa1ug8",
                                                                            "score": 1,
                                                                            "created_utc": 1640713570.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "That was Neji's point, what Neji failed to understand was that Naruto **was special**.\nHence the meme.",
                                                                                    "author": "frenin",
                                                                                    "id": "hqb0399",
                                                                                    "parent_id": "t1_hqavrtm",
                                                                                    "score": 1,
                                                                                    "created_utc": 1640715279.0,
                                                                                    "replies": [
                                                                                        {
                                                                                            "body": "Goodnight dude",
                                                                                            "author": "FullMoon_Escapade",
                                                                                            "id": "hqbrq3h",
                                                                                            "parent_id": "t1_hqb0399",
                                                                                            "score": 1,
                                                                                            "created_utc": 1640726368.0,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "Or was it his destiny to break the cycle? ahah...gotcha!",
                                    "author": "empecabel",
                                    "id": "hq9tllc",
                                    "parent_id": "t1_hq8yieh",
                                    "score": 1,
                                    "created_utc": 1640696372.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Neji was indeed talking about strength and how that ties to your destiny however.\nHe made a point in remarking that Hokages are not made but are born.\nWhich turned out to be incredibly true.",
                            "author": "frenin",
                            "id": "hq8z3b4",
                            "parent_id": "t1_hq80jnn",
                            "score": 2,
                            "created_utc": 1640673118.0,
                            "replies": []
                        },
                        {
                            "body": "Except he wasnt though\n\nDid everyone forget the plot of Naruto was meant to save the world?\nThis destiny overrides the reincarnation one \n\nAnd guess what\nIt's a self fulfilling prophecy he was always bound to do this task \nEvery action he took was towards this task \n\nNaruto was a slave to his destiny the whole time \nThe funny thing is people are just as disillusioned as he was to think he broke his destiny when In reality he just fulfilled his biggest one",
                            "author": "SnooComics7583",
                            "id": "hq8pr4v",
                            "parent_id": "t1_hq80jnn",
                            "score": 2,
                            "created_utc": 1640667544.0,
                            "replies": [
                                {
                                    "body": "How is he a slave to his destiny when he chose what he wanted? \n\nThe whole point of Naruto is that he forges his own destiny. He's the subject of prophecies but he doesn't even know about them much less care (very similar to Luffy in that regard). Heck, the one time Naruto is told by someone that is his destiny is the Indra/Asura stuff and he straight up rejects that because he doesn't like it and then makes a point to refute that \"destiny\".\n\nWhen Naruto starts thinking big picture in the story and trying to find a solution for peace his driving force is to be the ideal shinobi Jiraiya wrote about not some prophecy.",
                                    "author": "sonfoa",
                                    "id": "hq91ggs",
                                    "parent_id": "t1_hq8pr4v",
                                    "score": 9,
                                    "created_utc": 1640674751.0,
                                    "replies": [
                                        {
                                            "body": "Becuase he didnt choose\nLike I said\n\nEvery single action he ever took wasnt his \nThey all work towards his destiny\n\nIn fact even if he knew he couldn't change it becuase it would change who he is\nHe never had a choice hence disillusioned \n\nThe destiny of indra/ashura as I mentioned is smaller and also part of the bigger destiny he fulfills \nThe fact that he breaks the smaller destiny is part of the bigger destiny he fulfills\n\nWhich again is part of that prophecy \nHis ideal shinobi for peace is exactly what grants him being the worlds savior which is again part of that prophecy \nThis is all what a self fulfilling prophecy is\n\n\nIf I sound like a broken record at this point \nGood because hopefully that hammers in the point",
                                            "author": "SnooComics7583",
                                            "id": "hq91ywz",
                                            "parent_id": "t1_hq91ggs",
                                            "score": -1,
                                            "created_utc": 1640675122.0,
                                            "replies": [
                                                {
                                                    "body": "Just for a second think how ridiculous you sound. By your logic, nobody's choices are their own because some dude might have mentioned it unbeknownst to you and that means everything in your life is predetermined and out of your control. \n\nAnd did you say Naruto never had a choice to become disillusioned? How can you read a series where there are half a dozen diverging paths that the author gives to characters similar to Naruto and makes it a point to show that Naruto could have very well gone that path something that the titular character remarks numerous times throughout the story.\n\nRead the story again because clearly you're talking about a different one.",
                                                    "author": "sonfoa",
                                                    "id": "hq93wld",
                                                    "parent_id": "t1_hq91ywz",
                                                    "score": 3,
                                                    "created_utc": 1640676547.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Neji was dead right.",
                    "author": "Itsy_Bitsy_Horny",
                    "id": "hq96ekd",
                    "parent_id": "t1_hq7ihmg",
                    "score": 5,
                    "created_utc": 1640678451.0,
                    "replies": []
                },
                {
                    "body": ">Though, of course, Naruto's counterargument to Neji was malarkey. Naruto put all his eggs in the \"you can become strong if you try\" basket, but Naruto only beat Neji because of Kurama's strength, something Naruto didn't have to earn on his own\n\nExcept he did naruto forced kuramas power out also kurama at that point fucking hated him kurama also ruined his fucking life kurama is the sole reason narutos entire existence was shit for the first like 12 to 16 years also the idea that any of narutos genetics actually helped him is dumb what did being the fourth hokages son do for him what did being ashuras reincarnation do for him hell think where naruto would have been had he had his parents instead of losing them both jiraiya and kakashi did a whole Lotta fucking nothing to help him in the first place",
                    "author": "Helrend",
                    "id": "hq7z9so",
                    "parent_id": "t1_hq7ihmg",
                    "score": 4,
                    "created_utc": 1640655106.0,
                    "replies": [
                        {
                            "body": "Did Naruto have a shitty childhood? Yes. Could Naruto have accomplished any of his goals without kickass genetics and personal connections to important people? No. \n\nNaruto forcing Kurama's power out in the Neji fight doesn't change the fact that it's not his own power. And it's not like this is something Naruto does consciously anyway, the power shows up pre-Shippuden whenever Naruto gets emotionally charged while backed into a corner. It showed up against Orochimaru's snake in the forest, against Haku in the Zabuza fight, and against Neji in the tournament. \n\nAs for what being the son of the 4th and Kushina got him: \n\nNaruto inherited the Uzamaki stamina and ability to heal from wounds really quickly. He also had naturally deep chakra reserves even without Kurama. This allowed him to make tons of shadow clones, almost guaranteeing more efficient training once someone showed him the clone trick.\n\nNaruto got personal tutelage from Jiriya because of the connection between Jiriya and the 4th, though Naruto didn't know it at the time. Jiriya taught Naruto basic chakra control, the summoning jutsu, and the rasengan.\n\nBecause of Jiriya, Naruto also formed a connection with the Toad Sages. This led to Naruto getting the opportunity to learn Senjutsu. Yes Naruto worked really hard to master Sage Mode, but few Shinobi ever get the chance to attempt it. And Naruto benefitted from Jiriya's longtime friend/teacher dedicating himself to Naruto's sage training after Jiriya died. \n\nBecause of Jiriya, Naruto also developed a personal relationship with Pain during their fight. This connection allowed Naruto the opportunity to negotiate with Nagato, which allowed for the resurrection of the dead Leaf Shinobi. Was this also the result of Naruto's choices? Yes. Could anyone else have pulled this off? Almost certainly not. Nagato only cared about Naruto's philosophy because they had the same teacher.\n\nNaruto also benefitted from Kakashi, who was assigned to team 7 partly because of the connection Kakashi shared with both Naruto and Sasuke. Kakashi, though not until mid Shippuden, taught Naruto how to harness shadow clones for training. Kakashi also leveraged his own connections to recruit Yamato for the sole purpose of sitting still all day to assist Naruto with training by suppressing Kurama's chakra. \n\nAnd being an Ashura incarnate led directly to Naruto receiving the Six Paths abilities which: amplified Naruto's healing abilities to the point he could regenerate even other people's body parts, greatly improved his stamina and strength, gave him truth seeking orbs, and let him naturally fly.",
                            "author": "Justicar-terrae",
                            "id": "hq828am",
                            "parent_id": "t1_hq7z9so",
                            "score": 19,
                            "created_utc": 1640656439.0,
                            "replies": [
                                {
                                    "body": "Well if the 4th and kushina alived and no kurama mean he would be able to learn from the best teacher ie his father. \n\nNaruto is a pretty f*cking genius, along with his hardwork, uzumaki chakra and proper teachher he would kick the shit out of every single genins there.",
                                    "author": "Kaiser_Imperius",
                                    "id": "hq8f6qr",
                                    "parent_id": "t1_hq828am",
                                    "score": 1,
                                    "created_utc": 1640662349.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "....................,,,,,,,,,,,,,,,,,,,,,,,\n\n Take those and fucking use them",
                            "author": "PrimusFucks",
                            "id": "hq8l8co",
                            "parent_id": "t1_hq7z9so",
                            "score": 6,
                            "created_utc": 1640665213.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "'Neji was right circlejerk' needs to die",
            "author": "vedat07taskiran",
            "id": "hqbtj7g",
            "parent_id": "t1_hq6tns6",
            "score": 1,
            "created_utc": 1640727112.0,
            "replies": []
        },
        {
            "body": "It's funny that even tho Pain's plan was very dumb, no one had in fact a better idea lol.",
            "author": "frenin",
            "id": "hq8zbi8",
            "parent_id": "t1_hq8s7wx",
            "score": 20,
            "created_utc": 1640673268.0,
            "replies": [
                {
                    "body": "The crazy part is without the Akatsuki none of the great nations would have ever had peace amongst themselves.  I'm not even sure if the Leaf and Sand would have been great allies either without the Akatsuki.   Sure Naruto and Gaara were on good terms, but both nations seemed to just tolerate the other at that point.\n\nThe threat of a mutually assured destruction seems a lot more plausible to me than anything else in the shinobi world in regards to peace.  The only reason there was peace at the end was because there was a world ending threat that forced the great nations to work together and a lot of strong bonds were forged.  Without that threat, I really don't know if peace would have been possible in the story.\n\nSure Pain's plan may have been dumping water on a grease fire, and as dumb as it was, do you think there could have been a better plan?  Especially since most of the great nations hated each other due to past skirmishes/wars.  \n\nIt's all interesting to think about though.  Idk it just seems like no one would have come up with an answer for peace without the 4th great ninja war happening. Sorry for rambling haha.",
                    "author": "TheAllSparx",
                    "id": "hq9knhn",
                    "parent_id": "t1_hq8zbi8",
                    "score": 6,
                    "created_utc": 1640690053.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "More or less it was the equivalent of nuclear weapons",
            "author": "bilbo_swagginz_boi",
            "id": "hu3vh2r",
            "parent_id": "t1_hq8s7wx",
            "score": 3,
            "created_utc": 1643081397.0,
            "replies": [
                {
                    "body": "Exactly. It's kind of hilarious because the Tailed Beasts were already essentially being treated as weapons of mass destruction by the Shinobi Nations, and yet that never seemed to stop the wars from occurring, so I'm not sure what the hell Pain is expecting to happen other than just making everything worse.",
                    "author": "HollyTheMage",
                    "id": "hu40eka",
                    "parent_id": "t1_hu3vh2r",
                    "score": 1,
                    "created_utc": 1643083798.0,
                    "replies": [
                        {
                            "body": "Most biju weren’t really a big enough threat to scare off all major war. Some of Akatsuki could take many out individually. Most outside of 9 tails were manageable. Lot of individual ninjas were much bigger threats.\n\nBut a nuke would be instant vaporization of a whole village. Much harder to defend against",
                            "author": "bilbo_swagginz_boi",
                            "id": "hu6f7vk",
                            "parent_id": "t1_hu40eka",
                            "score": 3,
                            "created_utc": 1643132062.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "who's your other top 2?",
            "author": "curiousmetapod",
            "id": "hq8luy9",
            "parent_id": "t1_hq83g31",
            "score": 7,
            "created_utc": 1640665526.0,
            "replies": [
                {
                    "body": "King Bradley: FMA\n\nGriffith: Beserk\n\nHonorable mentions\n\nAizen: Bleach\n\nLight: Death Note",
                    "author": "JadedF20",
                    "id": "hq8oaem",
                    "parent_id": "t1_hq8luy9",
                    "score": 17,
                    "created_utc": 1640666764.0,
                    "replies": [
                        {
                            "body": "Oh nice. My favorite is the mastermind of the Danganronpa series (can't say who they are because spoilers)",
                            "author": "HollyTheMage",
                            "id": "hq8sjns",
                            "parent_id": "t1_hq8oaem",
                            "score": 5,
                            "created_utc": 1640669096.0,
                            "replies": [
                                {
                                    "body": "Thanks, will add Danganronpa to my watchlist!",
                                    "author": "JadedF20",
                                    "id": "hq8tec7",
                                    "parent_id": "t1_hq8sjns",
                                    "score": 2,
                                    "created_utc": 1640669590.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Please allow me to add honorable mention Hero Killer: Stain",
                            "author": "mattfolio",
                            "id": "hq8tuuy",
                            "parent_id": "t1_hq8oaem",
                            "score": 2,
                            "created_utc": 1640669855.0,
                            "replies": []
                        },
                        {
                            "body": "Berserk isn't Shounen...",
                            "author": "Fantastic_Nobody_772",
                            "id": "hq95fxf",
                            "parent_id": "t1_hq8oaem",
                            "score": 2,
                            "created_utc": 1640677716.0,
                            "replies": [
                                {
                                    "body": "Lemme have it man, I know its aimed at seinen, just a personal fav.",
                                    "author": "JadedF20",
                                    "id": "hq95ure",
                                    "parent_id": "t1_hq95fxf",
                                    "score": 3,
                                    "created_utc": 1640678029.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "amen",
            "author": "TrexarSC",
            "id": "hq7g504",
            "parent_id": "t1_hq7at11",
            "score": 5,
            "created_utc": 1640646625.0,
            "replies": []
        },
        {
            "body": "💯",
            "author": "A1steaksaussie",
            "id": "hq8au45",
            "parent_id": "t1_hq7at11",
            "score": 5,
            "created_utc": 1640660349.0,
            "replies": []
        },
        {
            "body": "You people really annoy me. This is the first comment I see on almost every post here. We get it, you mostly see reposted Facebook memes from 2015 when you pull up this sub",
            "author": "Ok_Soil_231",
            "id": "hq8njoi",
            "parent_id": "t1_hq88cj3",
            "score": -4,
            "created_utc": 1640666379.0,
            "replies": [
                {
                    "body": "Finally a good meme on this sub",
                    "author": "Adminscantkeepmedown",
                    "id": "hq8pyx9",
                    "parent_id": "t1_hq8njoi",
                    "score": 14,
                    "created_utc": 1640667662.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "The only thing I hope is satire is your comment",
            "author": "K_Cobalt",
            "id": "hq7jp87",
            "parent_id": "t1_hq7h46y",
            "score": 24,
            "created_utc": 1640648188.0,
            "replies": [
                {
                    "body": "You do realise that torture and murder of innocents and children for fundamentally flawed ideals that you are trying to force onto others by violence and force is extremely wrong and in fact evil right?",
                    "author": "Howtheginchstolexmas",
                    "id": "hq7kaq4",
                    "parent_id": "t1_hq7jp87",
                    "score": -16,
                    "created_utc": 1640648451.0,
                    "replies": [
                        {
                            "body": "My man you need to chill. You can reason with one's ideals without necessarily agreeing with the way they apply them in the world (which is by killing many and affecting pain on others in this case)",
                            "author": "__REDJOHN_",
                            "id": "hq7l3cl",
                            "parent_id": "t1_hq7kaq4",
                            "score": 16,
                            "created_utc": 1640648803.0,
                            "replies": []
                        },
                        {
                            "body": "I think you forget this is a meme subreddit…",
                            "author": "K_Cobalt",
                            "id": "hq7ksav",
                            "parent_id": "t1_hq7kaq4",
                            "score": 9,
                            "created_utc": 1640648667.0,
                            "replies": []
                        },
                        {
                            "body": "[Yes](https://www.youtube.com/watch?v=Ux5cQbO_ybw)",
                            "author": "CaptainDogeSparrow",
                            "id": "hq7ri1x",
                            "parent_id": "t1_hq7kaq4",
                            "score": 6,
                            "created_utc": 1640651621.0,
                            "replies": []
                        },
                        {
                            "body": "And I hope you realize Pains philosophy and ways to do what he did we’re in the context of the (FICTIONAL) Ninja world of Naruto",
                            "author": "Not-a-kirby-main",
                            "id": "hq86kfh",
                            "parent_id": "t1_hq7kaq4",
                            "score": 5,
                            "created_utc": 1640658402.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Pain was one of the last and best fights in the series that showed powerful combatants but also implemented a lot of strategy.\n\nI LOVE seeing characters get OP abilities and launch them at each other so unlike much of the fan base I don't hate the series for that.\n\nBut, Naruto v Pain was just dope because they were really strong but Pain's weaknesses just couldn't be beaten by \"hurl nuke and wait\". Which was nice.",
            "author": "ThaRealSunGod",
            "id": "hq8vs0y",
            "parent_id": "t1_hq78o7l",
            "score": 51,
            "created_utc": 1640671007.0,
            "replies": []
        },
        {
            "body": "Yea",
            "author": "XXVI_F",
            "id": "hq7kyea",
            "parent_id": "t1_hq78o7l",
            "score": 27,
            "created_utc": 1640648741.0,
            "replies": []
        },
        {
            "body": "Yup. I would've loved to see a regular Madara vs Naruto, not rinnegan, reanimated or 10 tails Madara. Just good old EMS Madara that hashirama fought at the valley of the end.",
            "author": "Andrew109",
            "id": "hq93xv9",
            "parent_id": "t1_hq78o7l",
            "score": 17,
            "created_utc": 1640676574.0,
            "replies": []
        },
        {
            "body": "Akatsuki was heroes until Danzo killed Yahiko.",
            "author": "Agatha27",
            "id": "hq8vt58",
            "parent_id": "t1_hq8vfv7",
            "score": 36,
            "created_utc": 1640671027.0,
            "replies": [
                {
                    "body": "🤝",
                    "author": "Mackenzie_Sparks",
                    "id": "hq9a5x3",
                    "parent_id": "t1_hq8vt58",
                    "score": 7,
                    "created_utc": 1640681454.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "🤢Obito🤮",
            "author": "vedat07taskiran",
            "id": "hqbtfti",
            "parent_id": "t1_hq8vfv7",
            "score": 3,
            "created_utc": 1640727072.0,
            "replies": [
                {
                    "body": "🤮 🤮",
                    "author": "nhansieu1",
                    "id": "hqckwu0",
                    "parent_id": "t1_hqbtfti",
                    "score": 1,
                    "created_utc": 1640738797.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "FEW examples?  C'mon dude, there were plot holes and not enough depth with the female characters but 90% of the series is top tier",
            "author": "uglynerdishere",
            "id": "hq959hf",
            "parent_id": "t1_hq7dhwp",
            "score": 7,
            "created_utc": 1640677579.0,
            "replies": [
                {
                    "body": "Idk man, everyone agrees it lost the plot after naruto and Sasuke became reincarnated jesus babies and aliens got involved (granted that is EOS).\n\nAnd like, naruto is hated, but is also the top Shinobi and nobody told him about his dad because reasons and itachi wanted Sasuke to develop \"hate\" I mean there is a lot of plot that just sounds like a 14 year old wrote it lmao",
                    "author": "TyrannoROARus",
                    "id": "hqba4oc",
                    "parent_id": "t1_hq959hf",
                    "score": -1,
                    "created_utc": 1640719249.0,
                    "replies": [
                        {
                            "body": "You're just oversimplified it to make it sound stupid now, there's way more to than Naruto is hated but also top shinobi or Itachi wanting Sasuke to hate him. Anything cam sound stupid when you word it certain",
                            "author": "uglynerdishere",
                            "id": "hqblfnj",
                            "parent_id": "t1_hqba4oc",
                            "score": 2,
                            "created_utc": 1640723782.0,
                            "replies": [
                                {
                                    "body": "Okay well agree to disagree 🙂",
                                    "author": "TyrannoROARus",
                                    "id": "hqc0ql5",
                                    "parent_id": "t1_hqblfnj",
                                    "score": 1,
                                    "created_utc": 1640730079.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Well Naruto wasn't arguing about strength he was arguing about forging your own destiny rather than being a slave to it which is something Naruto has always been consistent with. \n\nAnd while Naruto loses without Kurama he beat Neji with shadow clones and he tells Neji that it was something that he used to suck at and it wasn't a natural talent like Neji had assumed.",
            "author": "sonfoa",
            "id": "hq80jnn",
            "parent_id": "t1_hq7ihmg",
            "score": 40,
            "created_utc": 1640655680.0,
            "replies": [
                {
                    "body": "It doesn't even make sense, Naruto learned shadow clones, a Jounin rank jutsu that most people can't use in like 2 hours",
                    "author": "Late-Ad155",
                    "id": "hq8nmtq",
                    "parent_id": "t1_hq80jnn",
                    "score": 14,
                    "created_utc": 1640666426.0,
                    "replies": [
                        {
                            "body": "Well, that shows that Naruto's issues before the beginning of the series had to do with a lack of self-confidence rather than laziness or being talentless. People forget that Naruto had been working hard to practice the clone technique for a long time prior to him jumping to a thousand shadow clones. But when Iruka displayed confidence in Naruto all of a sudden found it within himself to make a thousand shadow clones when before he couldn't even do a single regular clone.\n\nThat was what Naruto was telling Neji. To stop bemoaning an alleged fate and have the confidence to make your own path even calling him a genius unlike him (Naruto). And that sticks with Neji to the point that it's something he says before he finishes off Kidomaru.",
                            "author": "sonfoa",
                            "id": "hq90qex",
                            "parent_id": "t1_hq8nmtq",
                            "score": 9,
                            "created_utc": 1640674240.0,
                            "replies": [
                                {
                                    "body": "Nooo ! Shadow clones and clones are completely different jutsu, Naruto couldn't use clones because he had too much chakra, no because he was \"bad at it\"",
                                    "author": "Late-Ad155",
                                    "id": "hqar82d",
                                    "parent_id": "t1_hq90qex",
                                    "score": 1,
                                    "created_utc": 1640711772.0,
                                    "replies": []
                                },
                                {
                                    "body": "it was probably actually that for Naruto molding miniscule chakras like he'd need to for intangible clones is harder than it is for solid clones",
                                    "author": "saiyanfang10",
                                    "id": "hq9yx5q",
                                    "parent_id": "t1_hq90qex",
                                    "score": 1,
                                    "created_utc": 1640699427.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "People always forget that Naruto literally broke the cycle of Indra and Asura. He literally broke his own destiny.",
                    "author": "FullMoon_Escapade",
                    "id": "hq8yieh",
                    "parent_id": "t1_hq80jnn",
                    "score": 11,
                    "created_utc": 1640672730.0,
                    "replies": [
                        {
                            "body": "I know. It kind of gets tiring to say all the time though.",
                            "author": "sonfoa",
                            "id": "hq91jbq",
                            "parent_id": "t1_hq8yieh",
                            "score": 3,
                            "created_utc": 1640674810.0,
                            "replies": []
                        },
                        {
                            "body": "So Naruto was indeed destined to be special... Neji's point.",
                            "author": "frenin",
                            "id": "hq9gnqz",
                            "parent_id": "t1_hq8yieh",
                            "score": 2,
                            "created_utc": 1640686836.0,
                            "replies": [
                                {
                                    "body": "No. He was destined to kill Sasuke, continuing the reincarnation of the two brothers. He broke that by bringing Sasuke to the good side instead of killing him. How did you not get that?\n\nBesides, didn't Neji say he was destined to be a failure???",
                                    "author": "FullMoon_Escapade",
                                    "id": "hqa023m",
                                    "parent_id": "t1_hq9gnqz",
                                    "score": 0,
                                    "created_utc": 1640700025.0,
                                    "replies": [
                                        {
                                            "body": "I did get that, in fact I have said that a lot of times. I say that Naruto was indeed destined to be special and only special people do get the chance to become Hokage.\n\n\n>Besides, didn't Neji say he was destined to be a failure???\n\nYou can only forgive him there, he didn't know he was dealing with the MC.",
                                            "author": "frenin",
                                            "id": "hqa0bj1",
                                            "parent_id": "t1_hqa023m",
                                            "score": 2,
                                            "created_utc": 1640700160.0,
                                            "replies": [
                                                {
                                                    "body": "Ok, I guess? I don't get how that rebuttals my earlier point, or adds to the point that Neji was somehow right despite Naruto breaking a generational destiny of his.",
                                                    "author": "FullMoon_Escapade",
                                                    "id": "hqa0k9s",
                                                    "parent_id": "t1_hqa0bj1",
                                                    "score": 1,
                                                    "created_utc": 1640700283.0,
                                                    "replies": [
                                                        {
                                                            "body": "Because Neji talked about two things.\n\n* People have their fate sealed since birth and no matter what they do, they can't escape it.\n\nHe was wrong in this.\n\n\n* No matter how much you try, only those special enough become Hokage. \n\nHe was right in this.",
                                                            "author": "frenin",
                                                            "id": "hqa1ug8",
                                                            "parent_id": "t1_hqa0k9s",
                                                            "score": 2,
                                                            "created_utc": 1640700930.0,
                                                            "replies": [
                                                                {
                                                                    "body": "That's too vague to even be considered a prophesy. \n\nObviously only special people become Hokage. It wouldn't be as coveted as it is if regular ass ninja got it. That was something that existed long before Neji even existed. Besides, he never directed that to Naruto. In fact, he used it to say that Naruto was not special and would not become Hokage, so i seriously fail to see why you would even bring that up.",
                                                                    "author": "FullMoon_Escapade",
                                                                    "id": "hqavrtm",
                                                                    "parent_id": "t1_hqa1ug8",
                                                                    "score": 1,
                                                                    "created_utc": 1640713570.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "That was Neji's point, what Neji failed to understand was that Naruto **was special**.\nHence the meme.",
                                                                            "author": "frenin",
                                                                            "id": "hqb0399",
                                                                            "parent_id": "t1_hqavrtm",
                                                                            "score": 1,
                                                                            "created_utc": 1640715279.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "Goodnight dude",
                                                                                    "author": "FullMoon_Escapade",
                                                                                    "id": "hqbrq3h",
                                                                                    "parent_id": "t1_hqb0399",
                                                                                    "score": 1,
                                                                                    "created_utc": 1640726368.0,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Or was it his destiny to break the cycle? ahah...gotcha!",
                            "author": "empecabel",
                            "id": "hq9tllc",
                            "parent_id": "t1_hq8yieh",
                            "score": 1,
                            "created_utc": 1640696372.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Neji was indeed talking about strength and how that ties to your destiny however.\nHe made a point in remarking that Hokages are not made but are born.\nWhich turned out to be incredibly true.",
                    "author": "frenin",
                    "id": "hq8z3b4",
                    "parent_id": "t1_hq80jnn",
                    "score": 2,
                    "created_utc": 1640673118.0,
                    "replies": []
                },
                {
                    "body": "Except he wasnt though\n\nDid everyone forget the plot of Naruto was meant to save the world?\nThis destiny overrides the reincarnation one \n\nAnd guess what\nIt's a self fulfilling prophecy he was always bound to do this task \nEvery action he took was towards this task \n\nNaruto was a slave to his destiny the whole time \nThe funny thing is people are just as disillusioned as he was to think he broke his destiny when In reality he just fulfilled his biggest one",
                    "author": "SnooComics7583",
                    "id": "hq8pr4v",
                    "parent_id": "t1_hq80jnn",
                    "score": 2,
                    "created_utc": 1640667544.0,
                    "replies": [
                        {
                            "body": "How is he a slave to his destiny when he chose what he wanted? \n\nThe whole point of Naruto is that he forges his own destiny. He's the subject of prophecies but he doesn't even know about them much less care (very similar to Luffy in that regard). Heck, the one time Naruto is told by someone that is his destiny is the Indra/Asura stuff and he straight up rejects that because he doesn't like it and then makes a point to refute that \"destiny\".\n\nWhen Naruto starts thinking big picture in the story and trying to find a solution for peace his driving force is to be the ideal shinobi Jiraiya wrote about not some prophecy.",
                            "author": "sonfoa",
                            "id": "hq91ggs",
                            "parent_id": "t1_hq8pr4v",
                            "score": 9,
                            "created_utc": 1640674751.0,
                            "replies": [
                                {
                                    "body": "Becuase he didnt choose\nLike I said\n\nEvery single action he ever took wasnt his \nThey all work towards his destiny\n\nIn fact even if he knew he couldn't change it becuase it would change who he is\nHe never had a choice hence disillusioned \n\nThe destiny of indra/ashura as I mentioned is smaller and also part of the bigger destiny he fulfills \nThe fact that he breaks the smaller destiny is part of the bigger destiny he fulfills\n\nWhich again is part of that prophecy \nHis ideal shinobi for peace is exactly what grants him being the worlds savior which is again part of that prophecy \nThis is all what a self fulfilling prophecy is\n\n\nIf I sound like a broken record at this point \nGood because hopefully that hammers in the point",
                                    "author": "SnooComics7583",
                                    "id": "hq91ywz",
                                    "parent_id": "t1_hq91ggs",
                                    "score": -1,
                                    "created_utc": 1640675122.0,
                                    "replies": [
                                        {
                                            "body": "Just for a second think how ridiculous you sound. By your logic, nobody's choices are their own because some dude might have mentioned it unbeknownst to you and that means everything in your life is predetermined and out of your control. \n\nAnd did you say Naruto never had a choice to become disillusioned? How can you read a series where there are half a dozen diverging paths that the author gives to characters similar to Naruto and makes it a point to show that Naruto could have very well gone that path something that the titular character remarks numerous times throughout the story.\n\nRead the story again because clearly you're talking about a different one.",
                                            "author": "sonfoa",
                                            "id": "hq93wld",
                                            "parent_id": "t1_hq91ywz",
                                            "score": 3,
                                            "created_utc": 1640676547.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Neji was dead right.",
            "author": "Itsy_Bitsy_Horny",
            "id": "hq96ekd",
            "parent_id": "t1_hq7ihmg",
            "score": 5,
            "created_utc": 1640678451.0,
            "replies": []
        },
        {
            "body": ">Though, of course, Naruto's counterargument to Neji was malarkey. Naruto put all his eggs in the \"you can become strong if you try\" basket, but Naruto only beat Neji because of Kurama's strength, something Naruto didn't have to earn on his own\n\nExcept he did naruto forced kuramas power out also kurama at that point fucking hated him kurama also ruined his fucking life kurama is the sole reason narutos entire existence was shit for the first like 12 to 16 years also the idea that any of narutos genetics actually helped him is dumb what did being the fourth hokages son do for him what did being ashuras reincarnation do for him hell think where naruto would have been had he had his parents instead of losing them both jiraiya and kakashi did a whole Lotta fucking nothing to help him in the first place",
            "author": "Helrend",
            "id": "hq7z9so",
            "parent_id": "t1_hq7ihmg",
            "score": 4,
            "created_utc": 1640655106.0,
            "replies": [
                {
                    "body": "Did Naruto have a shitty childhood? Yes. Could Naruto have accomplished any of his goals without kickass genetics and personal connections to important people? No. \n\nNaruto forcing Kurama's power out in the Neji fight doesn't change the fact that it's not his own power. And it's not like this is something Naruto does consciously anyway, the power shows up pre-Shippuden whenever Naruto gets emotionally charged while backed into a corner. It showed up against Orochimaru's snake in the forest, against Haku in the Zabuza fight, and against Neji in the tournament. \n\nAs for what being the son of the 4th and Kushina got him: \n\nNaruto inherited the Uzamaki stamina and ability to heal from wounds really quickly. He also had naturally deep chakra reserves even without Kurama. This allowed him to make tons of shadow clones, almost guaranteeing more efficient training once someone showed him the clone trick.\n\nNaruto got personal tutelage from Jiriya because of the connection between Jiriya and the 4th, though Naruto didn't know it at the time. Jiriya taught Naruto basic chakra control, the summoning jutsu, and the rasengan.\n\nBecause of Jiriya, Naruto also formed a connection with the Toad Sages. This led to Naruto getting the opportunity to learn Senjutsu. Yes Naruto worked really hard to master Sage Mode, but few Shinobi ever get the chance to attempt it. And Naruto benefitted from Jiriya's longtime friend/teacher dedicating himself to Naruto's sage training after Jiriya died. \n\nBecause of Jiriya, Naruto also developed a personal relationship with Pain during their fight. This connection allowed Naruto the opportunity to negotiate with Nagato, which allowed for the resurrection of the dead Leaf Shinobi. Was this also the result of Naruto's choices? Yes. Could anyone else have pulled this off? Almost certainly not. Nagato only cared about Naruto's philosophy because they had the same teacher.\n\nNaruto also benefitted from Kakashi, who was assigned to team 7 partly because of the connection Kakashi shared with both Naruto and Sasuke. Kakashi, though not until mid Shippuden, taught Naruto how to harness shadow clones for training. Kakashi also leveraged his own connections to recruit Yamato for the sole purpose of sitting still all day to assist Naruto with training by suppressing Kurama's chakra. \n\nAnd being an Ashura incarnate led directly to Naruto receiving the Six Paths abilities which: amplified Naruto's healing abilities to the point he could regenerate even other people's body parts, greatly improved his stamina and strength, gave him truth seeking orbs, and let him naturally fly.",
                    "author": "Justicar-terrae",
                    "id": "hq828am",
                    "parent_id": "t1_hq7z9so",
                    "score": 19,
                    "created_utc": 1640656439.0,
                    "replies": [
                        {
                            "body": "Well if the 4th and kushina alived and no kurama mean he would be able to learn from the best teacher ie his father. \n\nNaruto is a pretty f*cking genius, along with his hardwork, uzumaki chakra and proper teachher he would kick the shit out of every single genins there.",
                            "author": "Kaiser_Imperius",
                            "id": "hq8f6qr",
                            "parent_id": "t1_hq828am",
                            "score": 1,
                            "created_utc": 1640662349.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "....................,,,,,,,,,,,,,,,,,,,,,,,\n\n Take those and fucking use them",
                    "author": "PrimusFucks",
                    "id": "hq8l8co",
                    "parent_id": "t1_hq7z9so",
                    "score": 6,
                    "created_utc": 1640665213.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "The crazy part is without the Akatsuki none of the great nations would have ever had peace amongst themselves.  I'm not even sure if the Leaf and Sand would have been great allies either without the Akatsuki.   Sure Naruto and Gaara were on good terms, but both nations seemed to just tolerate the other at that point.\n\nThe threat of a mutually assured destruction seems a lot more plausible to me than anything else in the shinobi world in regards to peace.  The only reason there was peace at the end was because there was a world ending threat that forced the great nations to work together and a lot of strong bonds were forged.  Without that threat, I really don't know if peace would have been possible in the story.\n\nSure Pain's plan may have been dumping water on a grease fire, and as dumb as it was, do you think there could have been a better plan?  Especially since most of the great nations hated each other due to past skirmishes/wars.  \n\nIt's all interesting to think about though.  Idk it just seems like no one would have come up with an answer for peace without the 4th great ninja war happening. Sorry for rambling haha.",
            "author": "TheAllSparx",
            "id": "hq9knhn",
            "parent_id": "t1_hq8zbi8",
            "score": 6,
            "created_utc": 1640690053.0,
            "replies": []
        },
        {
            "body": "Exactly. It's kind of hilarious because the Tailed Beasts were already essentially being treated as weapons of mass destruction by the Shinobi Nations, and yet that never seemed to stop the wars from occurring, so I'm not sure what the hell Pain is expecting to happen other than just making everything worse.",
            "author": "HollyTheMage",
            "id": "hu40eka",
            "parent_id": "t1_hu3vh2r",
            "score": 1,
            "created_utc": 1643083798.0,
            "replies": [
                {
                    "body": "Most biju weren’t really a big enough threat to scare off all major war. Some of Akatsuki could take many out individually. Most outside of 9 tails were manageable. Lot of individual ninjas were much bigger threats.\n\nBut a nuke would be instant vaporization of a whole village. Much harder to defend against",
                    "author": "bilbo_swagginz_boi",
                    "id": "hu6f7vk",
                    "parent_id": "t1_hu40eka",
                    "score": 3,
                    "created_utc": 1643132062.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "King Bradley: FMA\n\nGriffith: Beserk\n\nHonorable mentions\n\nAizen: Bleach\n\nLight: Death Note",
            "author": "JadedF20",
            "id": "hq8oaem",
            "parent_id": "t1_hq8luy9",
            "score": 17,
            "created_utc": 1640666764.0,
            "replies": [
                {
                    "body": "Oh nice. My favorite is the mastermind of the Danganronpa series (can't say who they are because spoilers)",
                    "author": "HollyTheMage",
                    "id": "hq8sjns",
                    "parent_id": "t1_hq8oaem",
                    "score": 5,
                    "created_utc": 1640669096.0,
                    "replies": [
                        {
                            "body": "Thanks, will add Danganronpa to my watchlist!",
                            "author": "JadedF20",
                            "id": "hq8tec7",
                            "parent_id": "t1_hq8sjns",
                            "score": 2,
                            "created_utc": 1640669590.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Please allow me to add honorable mention Hero Killer: Stain",
                    "author": "mattfolio",
                    "id": "hq8tuuy",
                    "parent_id": "t1_hq8oaem",
                    "score": 2,
                    "created_utc": 1640669855.0,
                    "replies": []
                },
                {
                    "body": "Berserk isn't Shounen...",
                    "author": "Fantastic_Nobody_772",
                    "id": "hq95fxf",
                    "parent_id": "t1_hq8oaem",
                    "score": 2,
                    "created_utc": 1640677716.0,
                    "replies": [
                        {
                            "body": "Lemme have it man, I know its aimed at seinen, just a personal fav.",
                            "author": "JadedF20",
                            "id": "hq95ure",
                            "parent_id": "t1_hq95fxf",
                            "score": 3,
                            "created_utc": 1640678029.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Finally a good meme on this sub",
            "author": "Adminscantkeepmedown",
            "id": "hq8pyx9",
            "parent_id": "t1_hq8njoi",
            "score": 14,
            "created_utc": 1640667662.0,
            "replies": []
        },
        {
            "body": "You do realise that torture and murder of innocents and children for fundamentally flawed ideals that you are trying to force onto others by violence and force is extremely wrong and in fact evil right?",
            "author": "Howtheginchstolexmas",
            "id": "hq7kaq4",
            "parent_id": "t1_hq7jp87",
            "score": -16,
            "created_utc": 1640648451.0,
            "replies": [
                {
                    "body": "My man you need to chill. You can reason with one's ideals without necessarily agreeing with the way they apply them in the world (which is by killing many and affecting pain on others in this case)",
                    "author": "__REDJOHN_",
                    "id": "hq7l3cl",
                    "parent_id": "t1_hq7kaq4",
                    "score": 16,
                    "created_utc": 1640648803.0,
                    "replies": []
                },
                {
                    "body": "I think you forget this is a meme subreddit…",
                    "author": "K_Cobalt",
                    "id": "hq7ksav",
                    "parent_id": "t1_hq7kaq4",
                    "score": 9,
                    "created_utc": 1640648667.0,
                    "replies": []
                },
                {
                    "body": "[Yes](https://www.youtube.com/watch?v=Ux5cQbO_ybw)",
                    "author": "CaptainDogeSparrow",
                    "id": "hq7ri1x",
                    "parent_id": "t1_hq7kaq4",
                    "score": 6,
                    "created_utc": 1640651621.0,
                    "replies": []
                },
                {
                    "body": "And I hope you realize Pains philosophy and ways to do what he did we’re in the context of the (FICTIONAL) Ninja world of Naruto",
                    "author": "Not-a-kirby-main",
                    "id": "hq86kfh",
                    "parent_id": "t1_hq7kaq4",
                    "score": 5,
                    "created_utc": 1640658402.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "🤝",
            "author": "Mackenzie_Sparks",
            "id": "hq9a5x3",
            "parent_id": "t1_hq8vt58",
            "score": 7,
            "created_utc": 1640681454.0,
            "replies": []
        },
        {
            "body": "🤮 🤮",
            "author": "nhansieu1",
            "id": "hqckwu0",
            "parent_id": "t1_hqbtfti",
            "score": 1,
            "created_utc": 1640738797.0,
            "replies": []
        },
        {
            "body": "Idk man, everyone agrees it lost the plot after naruto and Sasuke became reincarnated jesus babies and aliens got involved (granted that is EOS).\n\nAnd like, naruto is hated, but is also the top Shinobi and nobody told him about his dad because reasons and itachi wanted Sasuke to develop \"hate\" I mean there is a lot of plot that just sounds like a 14 year old wrote it lmao",
            "author": "TyrannoROARus",
            "id": "hqba4oc",
            "parent_id": "t1_hq959hf",
            "score": -1,
            "created_utc": 1640719249.0,
            "replies": [
                {
                    "body": "You're just oversimplified it to make it sound stupid now, there's way more to than Naruto is hated but also top shinobi or Itachi wanting Sasuke to hate him. Anything cam sound stupid when you word it certain",
                    "author": "uglynerdishere",
                    "id": "hqblfnj",
                    "parent_id": "t1_hqba4oc",
                    "score": 2,
                    "created_utc": 1640723782.0,
                    "replies": [
                        {
                            "body": "Okay well agree to disagree 🙂",
                            "author": "TyrannoROARus",
                            "id": "hqc0ql5",
                            "parent_id": "t1_hqblfnj",
                            "score": 1,
                            "created_utc": 1640730079.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "It doesn't even make sense, Naruto learned shadow clones, a Jounin rank jutsu that most people can't use in like 2 hours",
            "author": "Late-Ad155",
            "id": "hq8nmtq",
            "parent_id": "t1_hq80jnn",
            "score": 14,
            "created_utc": 1640666426.0,
            "replies": [
                {
                    "body": "Well, that shows that Naruto's issues before the beginning of the series had to do with a lack of self-confidence rather than laziness or being talentless. People forget that Naruto had been working hard to practice the clone technique for a long time prior to him jumping to a thousand shadow clones. But when Iruka displayed confidence in Naruto all of a sudden found it within himself to make a thousand shadow clones when before he couldn't even do a single regular clone.\n\nThat was what Naruto was telling Neji. To stop bemoaning an alleged fate and have the confidence to make your own path even calling him a genius unlike him (Naruto). And that sticks with Neji to the point that it's something he says before he finishes off Kidomaru.",
                    "author": "sonfoa",
                    "id": "hq90qex",
                    "parent_id": "t1_hq8nmtq",
                    "score": 9,
                    "created_utc": 1640674240.0,
                    "replies": [
                        {
                            "body": "Nooo ! Shadow clones and clones are completely different jutsu, Naruto couldn't use clones because he had too much chakra, no because he was \"bad at it\"",
                            "author": "Late-Ad155",
                            "id": "hqar82d",
                            "parent_id": "t1_hq90qex",
                            "score": 1,
                            "created_utc": 1640711772.0,
                            "replies": []
                        },
                        {
                            "body": "it was probably actually that for Naruto molding miniscule chakras like he'd need to for intangible clones is harder than it is for solid clones",
                            "author": "saiyanfang10",
                            "id": "hq9yx5q",
                            "parent_id": "t1_hq90qex",
                            "score": 1,
                            "created_utc": 1640699427.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "People always forget that Naruto literally broke the cycle of Indra and Asura. He literally broke his own destiny.",
            "author": "FullMoon_Escapade",
            "id": "hq8yieh",
            "parent_id": "t1_hq80jnn",
            "score": 11,
            "created_utc": 1640672730.0,
            "replies": [
                {
                    "body": "I know. It kind of gets tiring to say all the time though.",
                    "author": "sonfoa",
                    "id": "hq91jbq",
                    "parent_id": "t1_hq8yieh",
                    "score": 3,
                    "created_utc": 1640674810.0,
                    "replies": []
                },
                {
                    "body": "So Naruto was indeed destined to be special... Neji's point.",
                    "author": "frenin",
                    "id": "hq9gnqz",
                    "parent_id": "t1_hq8yieh",
                    "score": 2,
                    "created_utc": 1640686836.0,
                    "replies": [
                        {
                            "body": "No. He was destined to kill Sasuke, continuing the reincarnation of the two brothers. He broke that by bringing Sasuke to the good side instead of killing him. How did you not get that?\n\nBesides, didn't Neji say he was destined to be a failure???",
                            "author": "FullMoon_Escapade",
                            "id": "hqa023m",
                            "parent_id": "t1_hq9gnqz",
                            "score": 0,
                            "created_utc": 1640700025.0,
                            "replies": [
                                {
                                    "body": "I did get that, in fact I have said that a lot of times. I say that Naruto was indeed destined to be special and only special people do get the chance to become Hokage.\n\n\n>Besides, didn't Neji say he was destined to be a failure???\n\nYou can only forgive him there, he didn't know he was dealing with the MC.",
                                    "author": "frenin",
                                    "id": "hqa0bj1",
                                    "parent_id": "t1_hqa023m",
                                    "score": 2,
                                    "created_utc": 1640700160.0,
                                    "replies": [
                                        {
                                            "body": "Ok, I guess? I don't get how that rebuttals my earlier point, or adds to the point that Neji was somehow right despite Naruto breaking a generational destiny of his.",
                                            "author": "FullMoon_Escapade",
                                            "id": "hqa0k9s",
                                            "parent_id": "t1_hqa0bj1",
                                            "score": 1,
                                            "created_utc": 1640700283.0,
                                            "replies": [
                                                {
                                                    "body": "Because Neji talked about two things.\n\n* People have their fate sealed since birth and no matter what they do, they can't escape it.\n\nHe was wrong in this.\n\n\n* No matter how much you try, only those special enough become Hokage. \n\nHe was right in this.",
                                                    "author": "frenin",
                                                    "id": "hqa1ug8",
                                                    "parent_id": "t1_hqa0k9s",
                                                    "score": 2,
                                                    "created_utc": 1640700930.0,
                                                    "replies": [
                                                        {
                                                            "body": "That's too vague to even be considered a prophesy. \n\nObviously only special people become Hokage. It wouldn't be as coveted as it is if regular ass ninja got it. That was something that existed long before Neji even existed. Besides, he never directed that to Naruto. In fact, he used it to say that Naruto was not special and would not become Hokage, so i seriously fail to see why you would even bring that up.",
                                                            "author": "FullMoon_Escapade",
                                                            "id": "hqavrtm",
                                                            "parent_id": "t1_hqa1ug8",
                                                            "score": 1,
                                                            "created_utc": 1640713570.0,
                                                            "replies": [
                                                                {
                                                                    "body": "That was Neji's point, what Neji failed to understand was that Naruto **was special**.\nHence the meme.",
                                                                    "author": "frenin",
                                                                    "id": "hqb0399",
                                                                    "parent_id": "t1_hqavrtm",
                                                                    "score": 1,
                                                                    "created_utc": 1640715279.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "Goodnight dude",
                                                                            "author": "FullMoon_Escapade",
                                                                            "id": "hqbrq3h",
                                                                            "parent_id": "t1_hqb0399",
                                                                            "score": 1,
                                                                            "created_utc": 1640726368.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Or was it his destiny to break the cycle? ahah...gotcha!",
                    "author": "empecabel",
                    "id": "hq9tllc",
                    "parent_id": "t1_hq8yieh",
                    "score": 1,
                    "created_utc": 1640696372.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Neji was indeed talking about strength and how that ties to your destiny however.\nHe made a point in remarking that Hokages are not made but are born.\nWhich turned out to be incredibly true.",
            "author": "frenin",
            "id": "hq8z3b4",
            "parent_id": "t1_hq80jnn",
            "score": 2,
            "created_utc": 1640673118.0,
            "replies": []
        },
        {
            "body": "Except he wasnt though\n\nDid everyone forget the plot of Naruto was meant to save the world?\nThis destiny overrides the reincarnation one \n\nAnd guess what\nIt's a self fulfilling prophecy he was always bound to do this task \nEvery action he took was towards this task \n\nNaruto was a slave to his destiny the whole time \nThe funny thing is people are just as disillusioned as he was to think he broke his destiny when In reality he just fulfilled his biggest one",
            "author": "SnooComics7583",
            "id": "hq8pr4v",
            "parent_id": "t1_hq80jnn",
            "score": 2,
            "created_utc": 1640667544.0,
            "replies": [
                {
                    "body": "How is he a slave to his destiny when he chose what he wanted? \n\nThe whole point of Naruto is that he forges his own destiny. He's the subject of prophecies but he doesn't even know about them much less care (very similar to Luffy in that regard). Heck, the one time Naruto is told by someone that is his destiny is the Indra/Asura stuff and he straight up rejects that because he doesn't like it and then makes a point to refute that \"destiny\".\n\nWhen Naruto starts thinking big picture in the story and trying to find a solution for peace his driving force is to be the ideal shinobi Jiraiya wrote about not some prophecy.",
                    "author": "sonfoa",
                    "id": "hq91ggs",
                    "parent_id": "t1_hq8pr4v",
                    "score": 9,
                    "created_utc": 1640674751.0,
                    "replies": [
                        {
                            "body": "Becuase he didnt choose\nLike I said\n\nEvery single action he ever took wasnt his \nThey all work towards his destiny\n\nIn fact even if he knew he couldn't change it becuase it would change who he is\nHe never had a choice hence disillusioned \n\nThe destiny of indra/ashura as I mentioned is smaller and also part of the bigger destiny he fulfills \nThe fact that he breaks the smaller destiny is part of the bigger destiny he fulfills\n\nWhich again is part of that prophecy \nHis ideal shinobi for peace is exactly what grants him being the worlds savior which is again part of that prophecy \nThis is all what a self fulfilling prophecy is\n\n\nIf I sound like a broken record at this point \nGood because hopefully that hammers in the point",
                            "author": "SnooComics7583",
                            "id": "hq91ywz",
                            "parent_id": "t1_hq91ggs",
                            "score": -1,
                            "created_utc": 1640675122.0,
                            "replies": [
                                {
                                    "body": "Just for a second think how ridiculous you sound. By your logic, nobody's choices are their own because some dude might have mentioned it unbeknownst to you and that means everything in your life is predetermined and out of your control. \n\nAnd did you say Naruto never had a choice to become disillusioned? How can you read a series where there are half a dozen diverging paths that the author gives to characters similar to Naruto and makes it a point to show that Naruto could have very well gone that path something that the titular character remarks numerous times throughout the story.\n\nRead the story again because clearly you're talking about a different one.",
                                    "author": "sonfoa",
                                    "id": "hq93wld",
                                    "parent_id": "t1_hq91ywz",
                                    "score": 3,
                                    "created_utc": 1640676547.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Did Naruto have a shitty childhood? Yes. Could Naruto have accomplished any of his goals without kickass genetics and personal connections to important people? No. \n\nNaruto forcing Kurama's power out in the Neji fight doesn't change the fact that it's not his own power. And it's not like this is something Naruto does consciously anyway, the power shows up pre-Shippuden whenever Naruto gets emotionally charged while backed into a corner. It showed up against Orochimaru's snake in the forest, against Haku in the Zabuza fight, and against Neji in the tournament. \n\nAs for what being the son of the 4th and Kushina got him: \n\nNaruto inherited the Uzamaki stamina and ability to heal from wounds really quickly. He also had naturally deep chakra reserves even without Kurama. This allowed him to make tons of shadow clones, almost guaranteeing more efficient training once someone showed him the clone trick.\n\nNaruto got personal tutelage from Jiriya because of the connection between Jiriya and the 4th, though Naruto didn't know it at the time. Jiriya taught Naruto basic chakra control, the summoning jutsu, and the rasengan.\n\nBecause of Jiriya, Naruto also formed a connection with the Toad Sages. This led to Naruto getting the opportunity to learn Senjutsu. Yes Naruto worked really hard to master Sage Mode, but few Shinobi ever get the chance to attempt it. And Naruto benefitted from Jiriya's longtime friend/teacher dedicating himself to Naruto's sage training after Jiriya died. \n\nBecause of Jiriya, Naruto also developed a personal relationship with Pain during their fight. This connection allowed Naruto the opportunity to negotiate with Nagato, which allowed for the resurrection of the dead Leaf Shinobi. Was this also the result of Naruto's choices? Yes. Could anyone else have pulled this off? Almost certainly not. Nagato only cared about Naruto's philosophy because they had the same teacher.\n\nNaruto also benefitted from Kakashi, who was assigned to team 7 partly because of the connection Kakashi shared with both Naruto and Sasuke. Kakashi, though not until mid Shippuden, taught Naruto how to harness shadow clones for training. Kakashi also leveraged his own connections to recruit Yamato for the sole purpose of sitting still all day to assist Naruto with training by suppressing Kurama's chakra. \n\nAnd being an Ashura incarnate led directly to Naruto receiving the Six Paths abilities which: amplified Naruto's healing abilities to the point he could regenerate even other people's body parts, greatly improved his stamina and strength, gave him truth seeking orbs, and let him naturally fly.",
            "author": "Justicar-terrae",
            "id": "hq828am",
            "parent_id": "t1_hq7z9so",
            "score": 19,
            "created_utc": 1640656439.0,
            "replies": [
                {
                    "body": "Well if the 4th and kushina alived and no kurama mean he would be able to learn from the best teacher ie his father. \n\nNaruto is a pretty f*cking genius, along with his hardwork, uzumaki chakra and proper teachher he would kick the shit out of every single genins there.",
                    "author": "Kaiser_Imperius",
                    "id": "hq8f6qr",
                    "parent_id": "t1_hq828am",
                    "score": 1,
                    "created_utc": 1640662349.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "....................,,,,,,,,,,,,,,,,,,,,,,,\n\n Take those and fucking use them",
            "author": "PrimusFucks",
            "id": "hq8l8co",
            "parent_id": "t1_hq7z9so",
            "score": 6,
            "created_utc": 1640665213.0,
            "replies": []
        },
        {
            "body": "Most biju weren’t really a big enough threat to scare off all major war. Some of Akatsuki could take many out individually. Most outside of 9 tails were manageable. Lot of individual ninjas were much bigger threats.\n\nBut a nuke would be instant vaporization of a whole village. Much harder to defend against",
            "author": "bilbo_swagginz_boi",
            "id": "hu6f7vk",
            "parent_id": "t1_hu40eka",
            "score": 3,
            "created_utc": 1643132062.0,
            "replies": []
        },
        {
            "body": "Oh nice. My favorite is the mastermind of the Danganronpa series (can't say who they are because spoilers)",
            "author": "HollyTheMage",
            "id": "hq8sjns",
            "parent_id": "t1_hq8oaem",
            "score": 5,
            "created_utc": 1640669096.0,
            "replies": [
                {
                    "body": "Thanks, will add Danganronpa to my watchlist!",
                    "author": "JadedF20",
                    "id": "hq8tec7",
                    "parent_id": "t1_hq8sjns",
                    "score": 2,
                    "created_utc": 1640669590.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Please allow me to add honorable mention Hero Killer: Stain",
            "author": "mattfolio",
            "id": "hq8tuuy",
            "parent_id": "t1_hq8oaem",
            "score": 2,
            "created_utc": 1640669855.0,
            "replies": []
        },
        {
            "body": "Berserk isn't Shounen...",
            "author": "Fantastic_Nobody_772",
            "id": "hq95fxf",
            "parent_id": "t1_hq8oaem",
            "score": 2,
            "created_utc": 1640677716.0,
            "replies": [
                {
                    "body": "Lemme have it man, I know its aimed at seinen, just a personal fav.",
                    "author": "JadedF20",
                    "id": "hq95ure",
                    "parent_id": "t1_hq95fxf",
                    "score": 3,
                    "created_utc": 1640678029.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "My man you need to chill. You can reason with one's ideals without necessarily agreeing with the way they apply them in the world (which is by killing many and affecting pain on others in this case)",
            "author": "__REDJOHN_",
            "id": "hq7l3cl",
            "parent_id": "t1_hq7kaq4",
            "score": 16,
            "created_utc": 1640648803.0,
            "replies": []
        },
        {
            "body": "I think you forget this is a meme subreddit…",
            "author": "K_Cobalt",
            "id": "hq7ksav",
            "parent_id": "t1_hq7kaq4",
            "score": 9,
            "created_utc": 1640648667.0,
            "replies": []
        },
        {
            "body": "[Yes](https://www.youtube.com/watch?v=Ux5cQbO_ybw)",
            "author": "CaptainDogeSparrow",
            "id": "hq7ri1x",
            "parent_id": "t1_hq7kaq4",
            "score": 6,
            "created_utc": 1640651621.0,
            "replies": []
        },
        {
            "body": "And I hope you realize Pains philosophy and ways to do what he did we’re in the context of the (FICTIONAL) Ninja world of Naruto",
            "author": "Not-a-kirby-main",
            "id": "hq86kfh",
            "parent_id": "t1_hq7kaq4",
            "score": 5,
            "created_utc": 1640658402.0,
            "replies": []
        },
        {
            "body": "You're just oversimplified it to make it sound stupid now, there's way more to than Naruto is hated but also top shinobi or Itachi wanting Sasuke to hate him. Anything cam sound stupid when you word it certain",
            "author": "uglynerdishere",
            "id": "hqblfnj",
            "parent_id": "t1_hqba4oc",
            "score": 2,
            "created_utc": 1640723782.0,
            "replies": [
                {
                    "body": "Okay well agree to disagree 🙂",
                    "author": "TyrannoROARus",
                    "id": "hqc0ql5",
                    "parent_id": "t1_hqblfnj",
                    "score": 1,
                    "created_utc": 1640730079.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Well, that shows that Naruto's issues before the beginning of the series had to do with a lack of self-confidence rather than laziness or being talentless. People forget that Naruto had been working hard to practice the clone technique for a long time prior to him jumping to a thousand shadow clones. But when Iruka displayed confidence in Naruto all of a sudden found it within himself to make a thousand shadow clones when before he couldn't even do a single regular clone.\n\nThat was what Naruto was telling Neji. To stop bemoaning an alleged fate and have the confidence to make your own path even calling him a genius unlike him (Naruto). And that sticks with Neji to the point that it's something he says before he finishes off Kidomaru.",
            "author": "sonfoa",
            "id": "hq90qex",
            "parent_id": "t1_hq8nmtq",
            "score": 9,
            "created_utc": 1640674240.0,
            "replies": [
                {
                    "body": "Nooo ! Shadow clones and clones are completely different jutsu, Naruto couldn't use clones because he had too much chakra, no because he was \"bad at it\"",
                    "author": "Late-Ad155",
                    "id": "hqar82d",
                    "parent_id": "t1_hq90qex",
                    "score": 1,
                    "created_utc": 1640711772.0,
                    "replies": []
                },
                {
                    "body": "it was probably actually that for Naruto molding miniscule chakras like he'd need to for intangible clones is harder than it is for solid clones",
                    "author": "saiyanfang10",
                    "id": "hq9yx5q",
                    "parent_id": "t1_hq90qex",
                    "score": 1,
                    "created_utc": 1640699427.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I know. It kind of gets tiring to say all the time though.",
            "author": "sonfoa",
            "id": "hq91jbq",
            "parent_id": "t1_hq8yieh",
            "score": 3,
            "created_utc": 1640674810.0,
            "replies": []
        },
        {
            "body": "So Naruto was indeed destined to be special... Neji's point.",
            "author": "frenin",
            "id": "hq9gnqz",
            "parent_id": "t1_hq8yieh",
            "score": 2,
            "created_utc": 1640686836.0,
            "replies": [
                {
                    "body": "No. He was destined to kill Sasuke, continuing the reincarnation of the two brothers. He broke that by bringing Sasuke to the good side instead of killing him. How did you not get that?\n\nBesides, didn't Neji say he was destined to be a failure???",
                    "author": "FullMoon_Escapade",
                    "id": "hqa023m",
                    "parent_id": "t1_hq9gnqz",
                    "score": 0,
                    "created_utc": 1640700025.0,
                    "replies": [
                        {
                            "body": "I did get that, in fact I have said that a lot of times. I say that Naruto was indeed destined to be special and only special people do get the chance to become Hokage.\n\n\n>Besides, didn't Neji say he was destined to be a failure???\n\nYou can only forgive him there, he didn't know he was dealing with the MC.",
                            "author": "frenin",
                            "id": "hqa0bj1",
                            "parent_id": "t1_hqa023m",
                            "score": 2,
                            "created_utc": 1640700160.0,
                            "replies": [
                                {
                                    "body": "Ok, I guess? I don't get how that rebuttals my earlier point, or adds to the point that Neji was somehow right despite Naruto breaking a generational destiny of his.",
                                    "author": "FullMoon_Escapade",
                                    "id": "hqa0k9s",
                                    "parent_id": "t1_hqa0bj1",
                                    "score": 1,
                                    "created_utc": 1640700283.0,
                                    "replies": [
                                        {
                                            "body": "Because Neji talked about two things.\n\n* People have their fate sealed since birth and no matter what they do, they can't escape it.\n\nHe was wrong in this.\n\n\n* No matter how much you try, only those special enough become Hokage. \n\nHe was right in this.",
                                            "author": "frenin",
                                            "id": "hqa1ug8",
                                            "parent_id": "t1_hqa0k9s",
                                            "score": 2,
                                            "created_utc": 1640700930.0,
                                            "replies": [
                                                {
                                                    "body": "That's too vague to even be considered a prophesy. \n\nObviously only special people become Hokage. It wouldn't be as coveted as it is if regular ass ninja got it. That was something that existed long before Neji even existed. Besides, he never directed that to Naruto. In fact, he used it to say that Naruto was not special and would not become Hokage, so i seriously fail to see why you would even bring that up.",
                                                    "author": "FullMoon_Escapade",
                                                    "id": "hqavrtm",
                                                    "parent_id": "t1_hqa1ug8",
                                                    "score": 1,
                                                    "created_utc": 1640713570.0,
                                                    "replies": [
                                                        {
                                                            "body": "That was Neji's point, what Neji failed to understand was that Naruto **was special**.\nHence the meme.",
                                                            "author": "frenin",
                                                            "id": "hqb0399",
                                                            "parent_id": "t1_hqavrtm",
                                                            "score": 1,
                                                            "created_utc": 1640715279.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Goodnight dude",
                                                                    "author": "FullMoon_Escapade",
                                                                    "id": "hqbrq3h",
                                                                    "parent_id": "t1_hqb0399",
                                                                    "score": 1,
                                                                    "created_utc": 1640726368.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Or was it his destiny to break the cycle? ahah...gotcha!",
            "author": "empecabel",
            "id": "hq9tllc",
            "parent_id": "t1_hq8yieh",
            "score": 1,
            "created_utc": 1640696372.0,
            "replies": []
        },
        {
            "body": "How is he a slave to his destiny when he chose what he wanted? \n\nThe whole point of Naruto is that he forges his own destiny. He's the subject of prophecies but he doesn't even know about them much less care (very similar to Luffy in that regard). Heck, the one time Naruto is told by someone that is his destiny is the Indra/Asura stuff and he straight up rejects that because he doesn't like it and then makes a point to refute that \"destiny\".\n\nWhen Naruto starts thinking big picture in the story and trying to find a solution for peace his driving force is to be the ideal shinobi Jiraiya wrote about not some prophecy.",
            "author": "sonfoa",
            "id": "hq91ggs",
            "parent_id": "t1_hq8pr4v",
            "score": 9,
            "created_utc": 1640674751.0,
            "replies": [
                {
                    "body": "Becuase he didnt choose\nLike I said\n\nEvery single action he ever took wasnt his \nThey all work towards his destiny\n\nIn fact even if he knew he couldn't change it becuase it would change who he is\nHe never had a choice hence disillusioned \n\nThe destiny of indra/ashura as I mentioned is smaller and also part of the bigger destiny he fulfills \nThe fact that he breaks the smaller destiny is part of the bigger destiny he fulfills\n\nWhich again is part of that prophecy \nHis ideal shinobi for peace is exactly what grants him being the worlds savior which is again part of that prophecy \nThis is all what a self fulfilling prophecy is\n\n\nIf I sound like a broken record at this point \nGood because hopefully that hammers in the point",
                    "author": "SnooComics7583",
                    "id": "hq91ywz",
                    "parent_id": "t1_hq91ggs",
                    "score": -1,
                    "created_utc": 1640675122.0,
                    "replies": [
                        {
                            "body": "Just for a second think how ridiculous you sound. By your logic, nobody's choices are their own because some dude might have mentioned it unbeknownst to you and that means everything in your life is predetermined and out of your control. \n\nAnd did you say Naruto never had a choice to become disillusioned? How can you read a series where there are half a dozen diverging paths that the author gives to characters similar to Naruto and makes it a point to show that Naruto could have very well gone that path something that the titular character remarks numerous times throughout the story.\n\nRead the story again because clearly you're talking about a different one.",
                            "author": "sonfoa",
                            "id": "hq93wld",
                            "parent_id": "t1_hq91ywz",
                            "score": 3,
                            "created_utc": 1640676547.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Well if the 4th and kushina alived and no kurama mean he would be able to learn from the best teacher ie his father. \n\nNaruto is a pretty f*cking genius, along with his hardwork, uzumaki chakra and proper teachher he would kick the shit out of every single genins there.",
            "author": "Kaiser_Imperius",
            "id": "hq8f6qr",
            "parent_id": "t1_hq828am",
            "score": 1,
            "created_utc": 1640662349.0,
            "replies": []
        },
        {
            "body": "Thanks, will add Danganronpa to my watchlist!",
            "author": "JadedF20",
            "id": "hq8tec7",
            "parent_id": "t1_hq8sjns",
            "score": 2,
            "created_utc": 1640669590.0,
            "replies": []
        },
        {
            "body": "Lemme have it man, I know its aimed at seinen, just a personal fav.",
            "author": "JadedF20",
            "id": "hq95ure",
            "parent_id": "t1_hq95fxf",
            "score": 3,
            "created_utc": 1640678029.0,
            "replies": []
        },
        {
            "body": "Okay well agree to disagree 🙂",
            "author": "TyrannoROARus",
            "id": "hqc0ql5",
            "parent_id": "t1_hqblfnj",
            "score": 1,
            "created_utc": 1640730079.0,
            "replies": []
        },
        {
            "body": "Nooo ! Shadow clones and clones are completely different jutsu, Naruto couldn't use clones because he had too much chakra, no because he was \"bad at it\"",
            "author": "Late-Ad155",
            "id": "hqar82d",
            "parent_id": "t1_hq90qex",
            "score": 1,
            "created_utc": 1640711772.0,
            "replies": []
        },
        {
            "body": "it was probably actually that for Naruto molding miniscule chakras like he'd need to for intangible clones is harder than it is for solid clones",
            "author": "saiyanfang10",
            "id": "hq9yx5q",
            "parent_id": "t1_hq90qex",
            "score": 1,
            "created_utc": 1640699427.0,
            "replies": []
        },
        {
            "body": "No. He was destined to kill Sasuke, continuing the reincarnation of the two brothers. He broke that by bringing Sasuke to the good side instead of killing him. How did you not get that?\n\nBesides, didn't Neji say he was destined to be a failure???",
            "author": "FullMoon_Escapade",
            "id": "hqa023m",
            "parent_id": "t1_hq9gnqz",
            "score": 0,
            "created_utc": 1640700025.0,
            "replies": [
                {
                    "body": "I did get that, in fact I have said that a lot of times. I say that Naruto was indeed destined to be special and only special people do get the chance to become Hokage.\n\n\n>Besides, didn't Neji say he was destined to be a failure???\n\nYou can only forgive him there, he didn't know he was dealing with the MC.",
                    "author": "frenin",
                    "id": "hqa0bj1",
                    "parent_id": "t1_hqa023m",
                    "score": 2,
                    "created_utc": 1640700160.0,
                    "replies": [
                        {
                            "body": "Ok, I guess? I don't get how that rebuttals my earlier point, or adds to the point that Neji was somehow right despite Naruto breaking a generational destiny of his.",
                            "author": "FullMoon_Escapade",
                            "id": "hqa0k9s",
                            "parent_id": "t1_hqa0bj1",
                            "score": 1,
                            "created_utc": 1640700283.0,
                            "replies": [
                                {
                                    "body": "Because Neji talked about two things.\n\n* People have their fate sealed since birth and no matter what they do, they can't escape it.\n\nHe was wrong in this.\n\n\n* No matter how much you try, only those special enough become Hokage. \n\nHe was right in this.",
                                    "author": "frenin",
                                    "id": "hqa1ug8",
                                    "parent_id": "t1_hqa0k9s",
                                    "score": 2,
                                    "created_utc": 1640700930.0,
                                    "replies": [
                                        {
                                            "body": "That's too vague to even be considered a prophesy. \n\nObviously only special people become Hokage. It wouldn't be as coveted as it is if regular ass ninja got it. That was something that existed long before Neji even existed. Besides, he never directed that to Naruto. In fact, he used it to say that Naruto was not special and would not become Hokage, so i seriously fail to see why you would even bring that up.",
                                            "author": "FullMoon_Escapade",
                                            "id": "hqavrtm",
                                            "parent_id": "t1_hqa1ug8",
                                            "score": 1,
                                            "created_utc": 1640713570.0,
                                            "replies": [
                                                {
                                                    "body": "That was Neji's point, what Neji failed to understand was that Naruto **was special**.\nHence the meme.",
                                                    "author": "frenin",
                                                    "id": "hqb0399",
                                                    "parent_id": "t1_hqavrtm",
                                                    "score": 1,
                                                    "created_utc": 1640715279.0,
                                                    "replies": [
                                                        {
                                                            "body": "Goodnight dude",
                                                            "author": "FullMoon_Escapade",
                                                            "id": "hqbrq3h",
                                                            "parent_id": "t1_hqb0399",
                                                            "score": 1,
                                                            "created_utc": 1640726368.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Becuase he didnt choose\nLike I said\n\nEvery single action he ever took wasnt his \nThey all work towards his destiny\n\nIn fact even if he knew he couldn't change it becuase it would change who he is\nHe never had a choice hence disillusioned \n\nThe destiny of indra/ashura as I mentioned is smaller and also part of the bigger destiny he fulfills \nThe fact that he breaks the smaller destiny is part of the bigger destiny he fulfills\n\nWhich again is part of that prophecy \nHis ideal shinobi for peace is exactly what grants him being the worlds savior which is again part of that prophecy \nThis is all what a self fulfilling prophecy is\n\n\nIf I sound like a broken record at this point \nGood because hopefully that hammers in the point",
            "author": "SnooComics7583",
            "id": "hq91ywz",
            "parent_id": "t1_hq91ggs",
            "score": -1,
            "created_utc": 1640675122.0,
            "replies": [
                {
                    "body": "Just for a second think how ridiculous you sound. By your logic, nobody's choices are their own because some dude might have mentioned it unbeknownst to you and that means everything in your life is predetermined and out of your control. \n\nAnd did you say Naruto never had a choice to become disillusioned? How can you read a series where there are half a dozen diverging paths that the author gives to characters similar to Naruto and makes it a point to show that Naruto could have very well gone that path something that the titular character remarks numerous times throughout the story.\n\nRead the story again because clearly you're talking about a different one.",
                    "author": "sonfoa",
                    "id": "hq93wld",
                    "parent_id": "t1_hq91ywz",
                    "score": 3,
                    "created_utc": 1640676547.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I did get that, in fact I have said that a lot of times. I say that Naruto was indeed destined to be special and only special people do get the chance to become Hokage.\n\n\n>Besides, didn't Neji say he was destined to be a failure???\n\nYou can only forgive him there, he didn't know he was dealing with the MC.",
            "author": "frenin",
            "id": "hqa0bj1",
            "parent_id": "t1_hqa023m",
            "score": 2,
            "created_utc": 1640700160.0,
            "replies": [
                {
                    "body": "Ok, I guess? I don't get how that rebuttals my earlier point, or adds to the point that Neji was somehow right despite Naruto breaking a generational destiny of his.",
                    "author": "FullMoon_Escapade",
                    "id": "hqa0k9s",
                    "parent_id": "t1_hqa0bj1",
                    "score": 1,
                    "created_utc": 1640700283.0,
                    "replies": [
                        {
                            "body": "Because Neji talked about two things.\n\n* People have their fate sealed since birth and no matter what they do, they can't escape it.\n\nHe was wrong in this.\n\n\n* No matter how much you try, only those special enough become Hokage. \n\nHe was right in this.",
                            "author": "frenin",
                            "id": "hqa1ug8",
                            "parent_id": "t1_hqa0k9s",
                            "score": 2,
                            "created_utc": 1640700930.0,
                            "replies": [
                                {
                                    "body": "That's too vague to even be considered a prophesy. \n\nObviously only special people become Hokage. It wouldn't be as coveted as it is if regular ass ninja got it. That was something that existed long before Neji even existed. Besides, he never directed that to Naruto. In fact, he used it to say that Naruto was not special and would not become Hokage, so i seriously fail to see why you would even bring that up.",
                                    "author": "FullMoon_Escapade",
                                    "id": "hqavrtm",
                                    "parent_id": "t1_hqa1ug8",
                                    "score": 1,
                                    "created_utc": 1640713570.0,
                                    "replies": [
                                        {
                                            "body": "That was Neji's point, what Neji failed to understand was that Naruto **was special**.\nHence the meme.",
                                            "author": "frenin",
                                            "id": "hqb0399",
                                            "parent_id": "t1_hqavrtm",
                                            "score": 1,
                                            "created_utc": 1640715279.0,
                                            "replies": [
                                                {
                                                    "body": "Goodnight dude",
                                                    "author": "FullMoon_Escapade",
                                                    "id": "hqbrq3h",
                                                    "parent_id": "t1_hqb0399",
                                                    "score": 1,
                                                    "created_utc": 1640726368.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Just for a second think how ridiculous you sound. By your logic, nobody's choices are their own because some dude might have mentioned it unbeknownst to you and that means everything in your life is predetermined and out of your control. \n\nAnd did you say Naruto never had a choice to become disillusioned? How can you read a series where there are half a dozen diverging paths that the author gives to characters similar to Naruto and makes it a point to show that Naruto could have very well gone that path something that the titular character remarks numerous times throughout the story.\n\nRead the story again because clearly you're talking about a different one.",
            "author": "sonfoa",
            "id": "hq93wld",
            "parent_id": "t1_hq91ywz",
            "score": 3,
            "created_utc": 1640676547.0,
            "replies": []
        },
        {
            "body": "Ok, I guess? I don't get how that rebuttals my earlier point, or adds to the point that Neji was somehow right despite Naruto breaking a generational destiny of his.",
            "author": "FullMoon_Escapade",
            "id": "hqa0k9s",
            "parent_id": "t1_hqa0bj1",
            "score": 1,
            "created_utc": 1640700283.0,
            "replies": [
                {
                    "body": "Because Neji talked about two things.\n\n* People have their fate sealed since birth and no matter what they do, they can't escape it.\n\nHe was wrong in this.\n\n\n* No matter how much you try, only those special enough become Hokage. \n\nHe was right in this.",
                    "author": "frenin",
                    "id": "hqa1ug8",
                    "parent_id": "t1_hqa0k9s",
                    "score": 2,
                    "created_utc": 1640700930.0,
                    "replies": [
                        {
                            "body": "That's too vague to even be considered a prophesy. \n\nObviously only special people become Hokage. It wouldn't be as coveted as it is if regular ass ninja got it. That was something that existed long before Neji even existed. Besides, he never directed that to Naruto. In fact, he used it to say that Naruto was not special and would not become Hokage, so i seriously fail to see why you would even bring that up.",
                            "author": "FullMoon_Escapade",
                            "id": "hqavrtm",
                            "parent_id": "t1_hqa1ug8",
                            "score": 1,
                            "created_utc": 1640713570.0,
                            "replies": [
                                {
                                    "body": "That was Neji's point, what Neji failed to understand was that Naruto **was special**.\nHence the meme.",
                                    "author": "frenin",
                                    "id": "hqb0399",
                                    "parent_id": "t1_hqavrtm",
                                    "score": 1,
                                    "created_utc": 1640715279.0,
                                    "replies": [
                                        {
                                            "body": "Goodnight dude",
                                            "author": "FullMoon_Escapade",
                                            "id": "hqbrq3h",
                                            "parent_id": "t1_hqb0399",
                                            "score": 1,
                                            "created_utc": 1640726368.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Because Neji talked about two things.\n\n* People have their fate sealed since birth and no matter what they do, they can't escape it.\n\nHe was wrong in this.\n\n\n* No matter how much you try, only those special enough become Hokage. \n\nHe was right in this.",
            "author": "frenin",
            "id": "hqa1ug8",
            "parent_id": "t1_hqa0k9s",
            "score": 2,
            "created_utc": 1640700930.0,
            "replies": [
                {
                    "body": "That's too vague to even be considered a prophesy. \n\nObviously only special people become Hokage. It wouldn't be as coveted as it is if regular ass ninja got it. That was something that existed long before Neji even existed. Besides, he never directed that to Naruto. In fact, he used it to say that Naruto was not special and would not become Hokage, so i seriously fail to see why you would even bring that up.",
                    "author": "FullMoon_Escapade",
                    "id": "hqavrtm",
                    "parent_id": "t1_hqa1ug8",
                    "score": 1,
                    "created_utc": 1640713570.0,
                    "replies": [
                        {
                            "body": "That was Neji's point, what Neji failed to understand was that Naruto **was special**.\nHence the meme.",
                            "author": "frenin",
                            "id": "hqb0399",
                            "parent_id": "t1_hqavrtm",
                            "score": 1,
                            "created_utc": 1640715279.0,
                            "replies": [
                                {
                                    "body": "Goodnight dude",
                                    "author": "FullMoon_Escapade",
                                    "id": "hqbrq3h",
                                    "parent_id": "t1_hqb0399",
                                    "score": 1,
                                    "created_utc": 1640726368.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "That's too vague to even be considered a prophesy. \n\nObviously only special people become Hokage. It wouldn't be as coveted as it is if regular ass ninja got it. That was something that existed long before Neji even existed. Besides, he never directed that to Naruto. In fact, he used it to say that Naruto was not special and would not become Hokage, so i seriously fail to see why you would even bring that up.",
            "author": "FullMoon_Escapade",
            "id": "hqavrtm",
            "parent_id": "t1_hqa1ug8",
            "score": 1,
            "created_utc": 1640713570.0,
            "replies": [
                {
                    "body": "That was Neji's point, what Neji failed to understand was that Naruto **was special**.\nHence the meme.",
                    "author": "frenin",
                    "id": "hqb0399",
                    "parent_id": "t1_hqavrtm",
                    "score": 1,
                    "created_utc": 1640715279.0,
                    "replies": [
                        {
                            "body": "Goodnight dude",
                            "author": "FullMoon_Escapade",
                            "id": "hqbrq3h",
                            "parent_id": "t1_hqb0399",
                            "score": 1,
                            "created_utc": 1640726368.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "That was Neji's point, what Neji failed to understand was that Naruto **was special**.\nHence the meme.",
            "author": "frenin",
            "id": "hqb0399",
            "parent_id": "t1_hqavrtm",
            "score": 1,
            "created_utc": 1640715279.0,
            "replies": [
                {
                    "body": "Goodnight dude",
                    "author": "FullMoon_Escapade",
                    "id": "hqbrq3h",
                    "parent_id": "t1_hqb0399",
                    "score": 1,
                    "created_utc": 1640726368.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Goodnight dude",
            "author": "FullMoon_Escapade",
            "id": "hqbrq3h",
            "parent_id": "t1_hqb0399",
            "score": 1,
            "created_utc": 1640726368.0,
            "replies": []
        }
    ]
}