{
    "title": "Suggestions that would look good, attractive and professional",
    "post_id": "8dgymf",
    "post_url": "https://www.reddit.com/r/malehairadvice/comments/8dgymf/suggestions_that_would_look_good_attractive_and/",
    "author": "BrutalWarPig",
    "body": "",
    "url": "https://imgur.com/pBNvksB",
    "score": 260,
    "upvote_ratio": 0.92,
    "created_utc": 1524162898.0,
    "num_comments": 47,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "Length on top is fine, just push it to the side. Go to a BARBER and get the sides cut short. A different style of glasses would help you a lot too. Thicker rims would be my suggestion. Best of luck my friend",
            "author": "Anon______",
            "id": "dxndgws",
            "parent_id": "t3_8dgymf",
            "score": 246,
            "created_utc": 1524174186.0,
            "replies": [
                {
                    "body": "I know it's not the advice you're here for OP, but I second the thicker rimmed glasses. Feel  free to play around a little while glasses shopping with other shapes/sizes of frames as well. I think a new set of glasses could really look good on you. ",
                    "author": "Dodapdado",
                    "id": "dxni234",
                    "parent_id": "t1_dxndgws",
                    "score": 135,
                    "created_utc": 1524178913.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "dxni52m",
            "parent_id": "t3_8dgymf",
            "score": 199,
            "created_utc": 1524179004.0,
            "replies": [
                {
                    "body": "> 1) Looking into minoxidil beards. If you don't have heart problems, this can give you a great, full beard in 6 months - year. It's a big commitment, but it 100% works. You're someone who would benefit greatly from a beard. It would really balance your face out and that alone would increase your attractiveness. It also works on eyebrows if that's something that bothers you, but I don't think you really need it.\n\nCareful. Some people can't properly grow a beard and will take this advice to heart and will still attempt to grow said beard; however it'll look terrible. (i.e. neckbeards)",
                    "author": "Finally_Smiled",
                    "id": "dxnodxx",
                    "parent_id": "t1_dxni52m",
                    "score": 58,
                    "created_utc": 1524185590.0,
                    "replies": []
                },
                {
                    "body": "I second the minoxidil beard thing I use it to hide my baby face and now I've got better beard coverage than people with natural beards.",
                    "author": "lowmechanics",
                    "id": "dxo40u5",
                    "parent_id": "t1_dxni52m",
                    "score": 8,
                    "created_utc": 1524206996.0,
                    "replies": [
                        {
                            "body": "I can’t grow hair on the side of my face at all. Will something like this promote hair growth even if you’ve never grown hair there before?",
                            "author": "Reading_is_Cool",
                            "id": "dxo68ep",
                            "parent_id": "t1_dxo40u5",
                            "score": 2,
                            "created_utc": 1524211754.0,
                            "replies": [
                                {
                                    "body": "Yeah bro I got face cancer on one side and never had hair there for 7 years. Minox has been helping slowly but surely",
                                    "author": "Youareaharrywizard",
                                    "id": "dxohdaw",
                                    "parent_id": "t1_dxo68ep",
                                    "score": 2,
                                    "created_utc": 1524231234.0,
                                    "replies": []
                                },
                                {
                                    "body": "Yes I started off with nothing on my cheeks (well if you looked closely you could see tiny thin white hairs at a certain angle but that doesn't count). There's a facebook group called 'minox beard spot' check it out.",
                                    "author": "lowmechanics",
                                    "id": "dxo7av9",
                                    "parent_id": "t1_dxo68ep",
                                    "score": 1,
                                    "created_utc": 1524214339.0,
                                    "replies": []
                                },
                                {
                                    "body": "The other comment is misinforming. First of all if you're under like 22 don't use minoxidil. \n\nYou do grow facial hair, just not on the cheeks yeah? Minoxidil will help existing follicles thicken and grow. Some hairs are super thin and unnoticeable (and I'm not sure about this but I'd assume since balding causes hair to thin to the point it can't penetrate skin, there may be cheek hairs that are too thin to surface that will become thick enough to grow). These are the hairs that will become thicker and grow. \n\nTake a close look, if you're mid 20s andand you've got a lot of empty patches of skin in the beard region, there is nothing there for minoxidil to work on. Hairs will not just appear so don't get your hopes up.\n\nThat said, I had patches and very little growth and a few months in I have noticeable growth on the cheeks and I can see more tiny hairs that should probably start thickening up in a few months",
                                    "author": "JustMyRegularAccount",
                                    "id": "dymfya9",
                                    "parent_id": "t1_dxo68ep",
                                    "score": 1,
                                    "created_utc": 1525749132.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "You need to grow it out more before you can really do much with it.",
            "author": "imsrrybby",
            "id": "dxn1rev",
            "parent_id": "t3_8dgymf",
            "score": 116,
            "created_utc": 1524163663.0,
            "replies": []
        },
        {
            "body": "1) glasses are bad /r/malefashionadvice can possibly help with that. or too I can edit later with an idea if you like\n\n2) shave the beard off entirely. if you can grow a full or almost full beard, you can maybe try that, but it doesn't seem like you can. it's all or nothing for the most part.\n\n3) \"short on the sides, long on top\" your current length on top might be good, but part it. shove it over to one side or the other. get the length of your hair on the sides of your head shorter. not like buzzed or \"fade\"d but at least 1/2 or 1/3 of the length it is now from what I can tell from the pic\n\nI'm really not an advocate of shaving one's head if they're losing hair. it's not inherently necessary, and like you say with the shunt, meh, I think you can definitely do fine without buzzing.\n\nwill add more in a while",
            "author": "BenFoldsFourLoko",
            "id": "dxni633",
            "parent_id": "t3_8dgymf",
            "score": 39,
            "created_utc": 1524179034.0,
            "replies": []
        },
        {
            "body": "Looks like your hairline is receding man, I can't tell how bad from the image, I would reccomend a basic crew cut. ",
            "author": "Thesmuz",
            "id": "dxn1f6g",
            "parent_id": "t3_8dgymf",
            "score": 69,
            "created_utc": 1524163361.0,
            "replies": []
        },
        {
            "body": "Looking to improve my apperance usually just keep my hair short and pretty much just comb it. Looking for something that is easy and manageable but attractive.\n\nAlso should I be taking biotin or anything, is my hair healthy looking?\n\nEdit thank you for all our responses. I honestly expected to just be totally roasted and not get anything out of this but for most part yall had some pretty sound and varying advice. \n\n1. I m going to keep at going to gym and working on improving my diet.\n\n2. Going to look at different glasses once my next insurance cycle kicks in and I can afford it.\n\n3. Funny enough hair is the one thing I really came in for but I m not sure what advice to take on that as it has varied. I think I may just let it grow some more and maybe come back for some more advice.\n\n4. Skin going to go to skincare reddit and see what they can do to me. May also consider a dermatologist. \n\n5. Tanning should that be a thing I do? Would it benefit me?\n\n",
            "author": "BrutalWarPig",
            "id": "dxn0x1r",
            "parent_id": "t3_8dgymf",
            "score": 34,
            "created_utc": 1524162914.0,
            "replies": [
                {
                    "body": "I’d recommend maybe some stronger frame glasses to define your face a bit more. They’re not bad or anything its just  the rimless look isn’t that stylish anymore either. \n\nAs for hair I think definitely take the sides way shorter, ask your barber to use clippers. Keep the top and try maybe some textured product to style it a bit more. ",
                    "author": "darth_attila",
                    "id": "dxnd553",
                    "parent_id": "t1_dxn0x1r",
                    "score": 7,
                    "created_utc": 1524173868.0,
                    "replies": []
                },
                {
                    "body": "1. Keep it up!\n2. My best advice is Warby Parker home try on! I’m too shy to try on frames in person. Plus, you can do 5 frames at a time over and over with no commitments. They have some really stylish half frames you might like based on your current pick. \n3. Get the sides cleaned up and part it to the side. It’s a classic look. Play with the length on top at your discretion. Ask your hairdresser to tell you info about the products they chose to style it with, too! If you don’t feel comfortable with salon prices (I sure don’t) just buy cheap drugstore dupes. Consider a shampoo that specifically mentions volumizing on it. Typically you’ll have to buy shampoo marketed towards females and smells like flowers and that’s okay. \n4. Cetaphil face wash and Cetaphil lotion! My nose has the same dryness around it like that.\n5. Embrace your pallor! Tanning is costly and damaging to your skin. \n\nBonus 6. Well-fitting, fresh clothing makes all the difference! If you look at people that tend to be super stylish and conventionally attractive, they’re oftentimes wearing simple t-shirts and jeans, but well-fitting. Not too baggy, not too tight. Look at the size guides for brands and measure yourself. Keep it you. I like muted colors and navy tends to look awesome with your skin tone.\n\nJust have fun and don’t take it all too seriously. Enjoy yourself. :)",
                    "author": "Zeldatron",
                    "id": "dxp25hs",
                    "parent_id": "t1_dxn0x1r",
                    "score": 5,
                    "created_utc": 1524250448.0,
                    "replies": [
                        {
                            "body": "> Cetaphil face wash\n\nIs this what you are referring to for the Cetaphil? https://www.amazon.com/Cetaphil-Men-Daily-Face-Ounce/dp/B00UHNZZ4G/ref=sr_1_18_s_it?s=beauty&ie=UTF8&qid=1524341652&sr=1-18&keywords=Cetaphil+face+wash\n\nor\n\nhttps://www.amazon.com/Cetaphil-Daily-Facial-Cleanser-Normal/dp/B001ET73JM/ref=sr_1_11_s_it?s=beauty&ie=UTF8&qid=1524341652&sr=1-11&keywords=Cetaphil+face+wash\n\n",
                            "author": "BrutalWarPig",
                            "id": "dxqw4aa",
                            "parent_id": "t1_dxp25hs",
                            "score": 2,
                            "created_utc": 1524341827.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Probably grow out the top and keep the sides short? Or get a very short cut. Coming from somebody that's also had issues with hair loss:\n\n\n* Biotin is a bit of a meme, I've been on it and the thing I notice most is how oily it's made my skin\n* Look at your options on /r/tressless (ignore the Brotzu hype)\n* Consider putting back money for treatment\n* The longer your hair, the more apparent it is there's less of it (especially on the sides) but sometimes you can grow the top long enough to sweep to the side while looking good.\n",
            "author": "flappingseal",
            "id": "dxn3ht5",
            "parent_id": "t3_8dgymf",
            "score": 8,
            "created_utc": 1524165184.0,
            "replies": []
        },
        {
            "body": "I would consider shaving it off. Also consider getting either a new style of glasses or contacts.",
            "author": null,
            "id": "dxn9jcl",
            "parent_id": "t3_8dgymf",
            "score": 28,
            "created_utc": 1524170483.0,
            "replies": [
                {
                    "body": "Unfortuabtly I have a shunt not sure how I would look, bald. I know it would for sure show.\n\nAny recommendations on glasses? I cant really do contacts ",
                    "author": "BrutalWarPig",
                    "id": "dxna010",
                    "parent_id": "t1_dxn9jcl",
                    "score": 25,
                    "created_utc": 1524170891.0,
                    "replies": [
                        {
                            "body": "I recently shaved my head and it looked alright afterwards. It was only a week or two of having real short hair. Now it looks pretty normal. If you don't like the look, just wear a hat until it grows back.\n\nIt's hard to say what glasses would look good. I would suggest finding someone (with a decent sense of style) that you trust to give you honest feedback, and try on several pairs. ",
                            "author": null,
                            "id": "dxnb16p",
                            "parent_id": "t1_dxna010",
                            "score": 12,
                            "created_utc": 1524171825.0,
                            "replies": [
                                {
                                    "body": "When u say shaved do you mean buzzed so there is still stubble or shaved so its smooth? ",
                                    "author": "BrutalWarPig",
                                    "id": "dxnb5re",
                                    "parent_id": "t1_dxnb16p",
                                    "score": 9,
                                    "created_utc": 1524171947.0,
                                    "replies": [
                                        {
                                            "body": "Just buzzed so there's stubble left. ",
                                            "author": null,
                                            "id": "dxnbe3y",
                                            "parent_id": "t1_dxnb5re",
                                            "score": 6,
                                            "created_utc": 1524172170.0,
                                            "replies": [
                                                {
                                                    "body": "Okay ty.",
                                                    "author": "BrutalWarPig",
                                                    "id": "dxncrr1",
                                                    "parent_id": "t1_dxnbe3y",
                                                    "score": 11,
                                                    "created_utc": 1524173508.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "You ignored the part about the shunt, which OP seems to not want visible",
                                    "author": "connormxy",
                                    "id": "dxnsnd7",
                                    "parent_id": "t1_dxnb16p",
                                    "score": 3,
                                    "created_utc": 1524190807.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Since you have rounded features I'd say you would rock some more angular glasses. I know they're expensive, but my doctor has a wall of frames to try on. If you have a friend with a good fashion sense maybe they could help? Or, if, like me, you don't have friends that want to go to the eye doctor with you (like, what?!), you can easily find pointers on the interthing.",
                            "author": "_cedarwood_",
                            "id": "dxnczlc",
                            "parent_id": "t1_dxna010",
                            "score": 4,
                            "created_utc": 1524173718.0,
                            "replies": [
                                {
                                    "body": "Eyebuydirect.com\n\nCheap as hell compared to LensCrafters and good quality ",
                                    "author": null,
                                    "id": "dxnd32c",
                                    "parent_id": "t1_dxnczlc",
                                    "score": 5,
                                    "created_utc": 1524173812.0,
                                    "replies": [
                                        {
                                            "body": "Unless you're like me and have a realtively high prescription, and have to pay for the ultra thin lenses. \n\nStill fantastic quality though, but not much cheaper than anywhere else. ",
                                            "author": "waaarg",
                                            "id": "dxnusfo",
                                            "parent_id": "t1_dxnd32c",
                                            "score": 1,
                                            "created_utc": 1524193343.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Maybe some trendy ray ban club masters in like a turtle? ",
                            "author": "Ssgogo1",
                            "id": "dxncvor",
                            "parent_id": "t1_dxna010",
                            "score": 8,
                            "created_utc": 1524173613.0,
                            "replies": [
                                {
                                    "body": "Yes! Club masters are such a great style and look great in virtually anyone. ",
                                    "author": "FamousLastName",
                                    "id": "dxnfjqc",
                                    "parent_id": "t1_dxncvor",
                                    "score": 4,
                                    "created_utc": 1524176276.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Try Warby Parker. You can do at home try on for free. They send you 5 pairs you pick out and you have a week before you put them in the return box they send and keep doing that until you find a pair you like. You can either give them your prescription or give them your optometrists’s info and they’ll get your prescription from them. ",
                            "author": "JessStation",
                            "id": "dxni2d6",
                            "parent_id": "t1_dxna010",
                            "score": 3,
                            "created_utc": 1524178920.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Also shave the facial hair too",
                    "author": "Matrillik",
                    "id": "dxngir4",
                    "parent_id": "t1_dxn9jcl",
                    "score": 5,
                    "created_utc": 1524177286.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Looked at your profile. Looks like you're already  seeing some gains, nice! Honestly, I liked your haircut from your before picture. I would say go with something around that length. Between that, your exercise plan, and some thick rimmed square glasses, I think you'd be in really good shape.",
            "author": null,
            "id": "dxo30wy",
            "parent_id": "t3_8dgymf",
            "score": 4,
            "created_utc": 1524205072.0,
            "replies": []
        },
        {
            "body": "You should also consider shaving your face, it would look better ",
            "author": "erobertt3",
            "id": "dxnfsc0",
            "parent_id": "t3_8dgymf",
            "score": 8,
            "created_utc": 1524176523.0,
            "replies": []
        },
        {
            "body": "I would shave more regularly and try different glasses. \n\nGet rid of the bangs and maybe push your hair back. Need better pictures ",
            "author": null,
            "id": "dxnd5cj",
            "parent_id": "t3_8dgymf",
            "score": 3,
            "created_utc": 1524173874.0,
            "replies": []
        },
        {
            "body": "You need to grow it out on the top it'll look good trust me(Tip greater the nose size the more the volume should be at the top)and \nChange the type of glasses [Take some time to pick it out, it'll be worth it].\n\nExtra: But if you start losing weight you'll look really good not just your body, but your jawline will also start to appear.\n\nExtra 2: Grow facial hair that suits you, research on this.",
            "author": "Q_Q-Reddit",
            "id": "dxo2z06",
            "parent_id": "t3_8dgymf",
            "score": 3,
            "created_utc": 1524204974.0,
            "replies": []
        },
        {
            "body": "Grow your hair out longer until you can get a nice classic side part. Get a volumizing shampoo. Shave your face. That beard is doing you no favors. Get new glasses. Something with plastic frames. Get a good face wash and use it daily.",
            "author": null,
            "id": "dxnfhpu",
            "parent_id": "t3_8dgymf",
            "score": 2,
            "created_utc": 1524176218.0,
            "replies": []
        },
        {
            "body": "Get some new glasses, a wayfairer or horn-rimmed style is a good go to. \n\nStay clean shaven and adopt a skincare routine. \n\nDitch your polos for some oxford button downs, blue and white are must haves for a professional look with some well fitting slacks and some good dress shoes (no square toes).\n\nGo with a classic men's haircut (short on the sides and in the back, left long enough on top to part). If that doesn't work for your go with a buzz cut or and clean shaven head. ",
            "author": null,
            "id": "dxntbb4",
            "parent_id": "t3_8dgymf",
            "score": 2,
            "created_utc": 1524191582.0,
            "replies": []
        },
        {
            "body": "I’d say shorter hAir like a buzz and thicker rectangular shaped glasses with thick legs ",
            "author": "Young_migos",
            "id": "dxnx0de",
            "parent_id": "t3_8dgymf",
            "score": 2,
            "created_utc": 1524196030.0,
            "replies": []
        },
        {
            "body": "Push it up or to the side, wait 4-5 weeks and find a better hairdresser.\n\nWash your face twice a day, avoid sugar and grease and your skin will get a lot better.",
            "author": "astrange",
            "id": "dxo027u",
            "parent_id": "t3_8dgymf",
            "score": 2,
            "created_utc": 1524200143.0,
            "replies": []
        },
        {
            "body": "I wonder what shaving it all off would look like but that option is usually a hit or miss.",
            "author": null,
            "id": "dxna1vy",
            "parent_id": "t3_8dgymf",
            "score": 2,
            "created_utc": 1524170936.0,
            "replies": []
        },
        {
            "body": "Dont shave your head, thats the worst advice imo! Grow it out and then ask a few barbers for good advice and dont let them cut it too short. Some simple to the side style will look timeless. Also a big beard would look great as long as you can dedicate the time to grow it out! \nAnd a lesser known skin tip is to drink lemon water, it makes your skin tone perfect and glowy.",
            "author": "chille9",
            "id": "dxnnvh8",
            "parent_id": "t3_8dgymf",
            "score": 2,
            "created_utc": 1524185056.0,
            "replies": []
        },
        {
            "body": "You need more length on top. I'd say grow it out a bit and try some different styling. If you don't like the results it might be worth shaving/buzzing it down.\n\nAlso, ditch the facial hair. Not everyone can grow enough for it to look good.",
            "author": "Richard__Rahl",
            "id": "dxognbx",
            "parent_id": "t3_8dgymf",
            "score": 1,
            "created_utc": 1524230444.0,
            "replies": []
        },
        {
            "body": "Update?",
            "author": "Hsjak500",
            "id": "e1zt3lm",
            "parent_id": "t3_8dgymf",
            "score": 1,
            "created_utc": 1531037695.0,
            "replies": []
        },
        {
            "body": "Wait another 2 months and then come back. We'll have you covered then. ",
            "author": "fogoticus",
            "id": "dxnmxtw",
            "parent_id": "t3_8dgymf",
            "score": -4,
            "created_utc": 1524184080.0,
            "replies": []
        },
        {
            "body": "Get rejected which i assume you always have. Get your emotional muscle be stronger than your appearance, then you can focus on fixing your outward self.\n\nYou look like a geek who always scare people when you talk to them, or that dude who never came to a bar or a club for fear of humiliation.\n\nGet out of your comfort zone. No one told you you can never be in places that cool people hang out, its you yourself who told you're not allowed. Stop listening to your conditioned self. Be Aware. Awareness will play a big role if you want to change.\n\nRead books. New Input inspire you to do something on the superficial and developmental level.",
            "author": "vitcoin",
            "id": "dxolug6",
            "parent_id": "t3_8dgymf",
            "score": -7,
            "created_utc": 1524235675.0,
            "replies": [
                {
                    "body": "This is malehairadvice not life advice ",
                    "author": "Krerzer1",
                    "id": "dxonv45",
                    "parent_id": "t1_dxolug6",
                    "score": 10,
                    "created_utc": 1524237516.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I know it's not the advice you're here for OP, but I second the thicker rimmed glasses. Feel  free to play around a little while glasses shopping with other shapes/sizes of frames as well. I think a new set of glasses could really look good on you. ",
            "author": "Dodapdado",
            "id": "dxni234",
            "parent_id": "t1_dxndgws",
            "score": 135,
            "created_utc": 1524178913.0,
            "replies": []
        },
        {
            "body": "> 1) Looking into minoxidil beards. If you don't have heart problems, this can give you a great, full beard in 6 months - year. It's a big commitment, but it 100% works. You're someone who would benefit greatly from a beard. It would really balance your face out and that alone would increase your attractiveness. It also works on eyebrows if that's something that bothers you, but I don't think you really need it.\n\nCareful. Some people can't properly grow a beard and will take this advice to heart and will still attempt to grow said beard; however it'll look terrible. (i.e. neckbeards)",
            "author": "Finally_Smiled",
            "id": "dxnodxx",
            "parent_id": "t1_dxni52m",
            "score": 58,
            "created_utc": 1524185590.0,
            "replies": []
        },
        {
            "body": "I second the minoxidil beard thing I use it to hide my baby face and now I've got better beard coverage than people with natural beards.",
            "author": "lowmechanics",
            "id": "dxo40u5",
            "parent_id": "t1_dxni52m",
            "score": 8,
            "created_utc": 1524206996.0,
            "replies": [
                {
                    "body": "I can’t grow hair on the side of my face at all. Will something like this promote hair growth even if you’ve never grown hair there before?",
                    "author": "Reading_is_Cool",
                    "id": "dxo68ep",
                    "parent_id": "t1_dxo40u5",
                    "score": 2,
                    "created_utc": 1524211754.0,
                    "replies": [
                        {
                            "body": "Yeah bro I got face cancer on one side and never had hair there for 7 years. Minox has been helping slowly but surely",
                            "author": "Youareaharrywizard",
                            "id": "dxohdaw",
                            "parent_id": "t1_dxo68ep",
                            "score": 2,
                            "created_utc": 1524231234.0,
                            "replies": []
                        },
                        {
                            "body": "Yes I started off with nothing on my cheeks (well if you looked closely you could see tiny thin white hairs at a certain angle but that doesn't count). There's a facebook group called 'minox beard spot' check it out.",
                            "author": "lowmechanics",
                            "id": "dxo7av9",
                            "parent_id": "t1_dxo68ep",
                            "score": 1,
                            "created_utc": 1524214339.0,
                            "replies": []
                        },
                        {
                            "body": "The other comment is misinforming. First of all if you're under like 22 don't use minoxidil. \n\nYou do grow facial hair, just not on the cheeks yeah? Minoxidil will help existing follicles thicken and grow. Some hairs are super thin and unnoticeable (and I'm not sure about this but I'd assume since balding causes hair to thin to the point it can't penetrate skin, there may be cheek hairs that are too thin to surface that will become thick enough to grow). These are the hairs that will become thicker and grow. \n\nTake a close look, if you're mid 20s andand you've got a lot of empty patches of skin in the beard region, there is nothing there for minoxidil to work on. Hairs will not just appear so don't get your hopes up.\n\nThat said, I had patches and very little growth and a few months in I have noticeable growth on the cheeks and I can see more tiny hairs that should probably start thickening up in a few months",
                            "author": "JustMyRegularAccount",
                            "id": "dymfya9",
                            "parent_id": "t1_dxo68ep",
                            "score": 1,
                            "created_utc": 1525749132.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I’d recommend maybe some stronger frame glasses to define your face a bit more. They’re not bad or anything its just  the rimless look isn’t that stylish anymore either. \n\nAs for hair I think definitely take the sides way shorter, ask your barber to use clippers. Keep the top and try maybe some textured product to style it a bit more. ",
            "author": "darth_attila",
            "id": "dxnd553",
            "parent_id": "t1_dxn0x1r",
            "score": 7,
            "created_utc": 1524173868.0,
            "replies": []
        },
        {
            "body": "1. Keep it up!\n2. My best advice is Warby Parker home try on! I’m too shy to try on frames in person. Plus, you can do 5 frames at a time over and over with no commitments. They have some really stylish half frames you might like based on your current pick. \n3. Get the sides cleaned up and part it to the side. It’s a classic look. Play with the length on top at your discretion. Ask your hairdresser to tell you info about the products they chose to style it with, too! If you don’t feel comfortable with salon prices (I sure don’t) just buy cheap drugstore dupes. Consider a shampoo that specifically mentions volumizing on it. Typically you’ll have to buy shampoo marketed towards females and smells like flowers and that’s okay. \n4. Cetaphil face wash and Cetaphil lotion! My nose has the same dryness around it like that.\n5. Embrace your pallor! Tanning is costly and damaging to your skin. \n\nBonus 6. Well-fitting, fresh clothing makes all the difference! If you look at people that tend to be super stylish and conventionally attractive, they’re oftentimes wearing simple t-shirts and jeans, but well-fitting. Not too baggy, not too tight. Look at the size guides for brands and measure yourself. Keep it you. I like muted colors and navy tends to look awesome with your skin tone.\n\nJust have fun and don’t take it all too seriously. Enjoy yourself. :)",
            "author": "Zeldatron",
            "id": "dxp25hs",
            "parent_id": "t1_dxn0x1r",
            "score": 5,
            "created_utc": 1524250448.0,
            "replies": [
                {
                    "body": "> Cetaphil face wash\n\nIs this what you are referring to for the Cetaphil? https://www.amazon.com/Cetaphil-Men-Daily-Face-Ounce/dp/B00UHNZZ4G/ref=sr_1_18_s_it?s=beauty&ie=UTF8&qid=1524341652&sr=1-18&keywords=Cetaphil+face+wash\n\nor\n\nhttps://www.amazon.com/Cetaphil-Daily-Facial-Cleanser-Normal/dp/B001ET73JM/ref=sr_1_11_s_it?s=beauty&ie=UTF8&qid=1524341652&sr=1-11&keywords=Cetaphil+face+wash\n\n",
                    "author": "BrutalWarPig",
                    "id": "dxqw4aa",
                    "parent_id": "t1_dxp25hs",
                    "score": 2,
                    "created_utc": 1524341827.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Unfortuabtly I have a shunt not sure how I would look, bald. I know it would for sure show.\n\nAny recommendations on glasses? I cant really do contacts ",
            "author": "BrutalWarPig",
            "id": "dxna010",
            "parent_id": "t1_dxn9jcl",
            "score": 25,
            "created_utc": 1524170891.0,
            "replies": [
                {
                    "body": "I recently shaved my head and it looked alright afterwards. It was only a week or two of having real short hair. Now it looks pretty normal. If you don't like the look, just wear a hat until it grows back.\n\nIt's hard to say what glasses would look good. I would suggest finding someone (with a decent sense of style) that you trust to give you honest feedback, and try on several pairs. ",
                    "author": null,
                    "id": "dxnb16p",
                    "parent_id": "t1_dxna010",
                    "score": 12,
                    "created_utc": 1524171825.0,
                    "replies": [
                        {
                            "body": "When u say shaved do you mean buzzed so there is still stubble or shaved so its smooth? ",
                            "author": "BrutalWarPig",
                            "id": "dxnb5re",
                            "parent_id": "t1_dxnb16p",
                            "score": 9,
                            "created_utc": 1524171947.0,
                            "replies": [
                                {
                                    "body": "Just buzzed so there's stubble left. ",
                                    "author": null,
                                    "id": "dxnbe3y",
                                    "parent_id": "t1_dxnb5re",
                                    "score": 6,
                                    "created_utc": 1524172170.0,
                                    "replies": [
                                        {
                                            "body": "Okay ty.",
                                            "author": "BrutalWarPig",
                                            "id": "dxncrr1",
                                            "parent_id": "t1_dxnbe3y",
                                            "score": 11,
                                            "created_utc": 1524173508.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "You ignored the part about the shunt, which OP seems to not want visible",
                            "author": "connormxy",
                            "id": "dxnsnd7",
                            "parent_id": "t1_dxnb16p",
                            "score": 3,
                            "created_utc": 1524190807.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Since you have rounded features I'd say you would rock some more angular glasses. I know they're expensive, but my doctor has a wall of frames to try on. If you have a friend with a good fashion sense maybe they could help? Or, if, like me, you don't have friends that want to go to the eye doctor with you (like, what?!), you can easily find pointers on the interthing.",
                    "author": "_cedarwood_",
                    "id": "dxnczlc",
                    "parent_id": "t1_dxna010",
                    "score": 4,
                    "created_utc": 1524173718.0,
                    "replies": [
                        {
                            "body": "Eyebuydirect.com\n\nCheap as hell compared to LensCrafters and good quality ",
                            "author": null,
                            "id": "dxnd32c",
                            "parent_id": "t1_dxnczlc",
                            "score": 5,
                            "created_utc": 1524173812.0,
                            "replies": [
                                {
                                    "body": "Unless you're like me and have a realtively high prescription, and have to pay for the ultra thin lenses. \n\nStill fantastic quality though, but not much cheaper than anywhere else. ",
                                    "author": "waaarg",
                                    "id": "dxnusfo",
                                    "parent_id": "t1_dxnd32c",
                                    "score": 1,
                                    "created_utc": 1524193343.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Maybe some trendy ray ban club masters in like a turtle? ",
                    "author": "Ssgogo1",
                    "id": "dxncvor",
                    "parent_id": "t1_dxna010",
                    "score": 8,
                    "created_utc": 1524173613.0,
                    "replies": [
                        {
                            "body": "Yes! Club masters are such a great style and look great in virtually anyone. ",
                            "author": "FamousLastName",
                            "id": "dxnfjqc",
                            "parent_id": "t1_dxncvor",
                            "score": 4,
                            "created_utc": 1524176276.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Try Warby Parker. You can do at home try on for free. They send you 5 pairs you pick out and you have a week before you put them in the return box they send and keep doing that until you find a pair you like. You can either give them your prescription or give them your optometrists’s info and they’ll get your prescription from them. ",
                    "author": "JessStation",
                    "id": "dxni2d6",
                    "parent_id": "t1_dxna010",
                    "score": 3,
                    "created_utc": 1524178920.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Also shave the facial hair too",
            "author": "Matrillik",
            "id": "dxngir4",
            "parent_id": "t1_dxn9jcl",
            "score": 5,
            "created_utc": 1524177286.0,
            "replies": []
        },
        {
            "body": "This is malehairadvice not life advice ",
            "author": "Krerzer1",
            "id": "dxonv45",
            "parent_id": "t1_dxolug6",
            "score": 10,
            "created_utc": 1524237516.0,
            "replies": []
        },
        {
            "body": "I can’t grow hair on the side of my face at all. Will something like this promote hair growth even if you’ve never grown hair there before?",
            "author": "Reading_is_Cool",
            "id": "dxo68ep",
            "parent_id": "t1_dxo40u5",
            "score": 2,
            "created_utc": 1524211754.0,
            "replies": [
                {
                    "body": "Yeah bro I got face cancer on one side and never had hair there for 7 years. Minox has been helping slowly but surely",
                    "author": "Youareaharrywizard",
                    "id": "dxohdaw",
                    "parent_id": "t1_dxo68ep",
                    "score": 2,
                    "created_utc": 1524231234.0,
                    "replies": []
                },
                {
                    "body": "Yes I started off with nothing on my cheeks (well if you looked closely you could see tiny thin white hairs at a certain angle but that doesn't count). There's a facebook group called 'minox beard spot' check it out.",
                    "author": "lowmechanics",
                    "id": "dxo7av9",
                    "parent_id": "t1_dxo68ep",
                    "score": 1,
                    "created_utc": 1524214339.0,
                    "replies": []
                },
                {
                    "body": "The other comment is misinforming. First of all if you're under like 22 don't use minoxidil. \n\nYou do grow facial hair, just not on the cheeks yeah? Minoxidil will help existing follicles thicken and grow. Some hairs are super thin and unnoticeable (and I'm not sure about this but I'd assume since balding causes hair to thin to the point it can't penetrate skin, there may be cheek hairs that are too thin to surface that will become thick enough to grow). These are the hairs that will become thicker and grow. \n\nTake a close look, if you're mid 20s andand you've got a lot of empty patches of skin in the beard region, there is nothing there for minoxidil to work on. Hairs will not just appear so don't get your hopes up.\n\nThat said, I had patches and very little growth and a few months in I have noticeable growth on the cheeks and I can see more tiny hairs that should probably start thickening up in a few months",
                    "author": "JustMyRegularAccount",
                    "id": "dymfya9",
                    "parent_id": "t1_dxo68ep",
                    "score": 1,
                    "created_utc": 1525749132.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "> Cetaphil face wash\n\nIs this what you are referring to for the Cetaphil? https://www.amazon.com/Cetaphil-Men-Daily-Face-Ounce/dp/B00UHNZZ4G/ref=sr_1_18_s_it?s=beauty&ie=UTF8&qid=1524341652&sr=1-18&keywords=Cetaphil+face+wash\n\nor\n\nhttps://www.amazon.com/Cetaphil-Daily-Facial-Cleanser-Normal/dp/B001ET73JM/ref=sr_1_11_s_it?s=beauty&ie=UTF8&qid=1524341652&sr=1-11&keywords=Cetaphil+face+wash\n\n",
            "author": "BrutalWarPig",
            "id": "dxqw4aa",
            "parent_id": "t1_dxp25hs",
            "score": 2,
            "created_utc": 1524341827.0,
            "replies": []
        },
        {
            "body": "I recently shaved my head and it looked alright afterwards. It was only a week or two of having real short hair. Now it looks pretty normal. If you don't like the look, just wear a hat until it grows back.\n\nIt's hard to say what glasses would look good. I would suggest finding someone (with a decent sense of style) that you trust to give you honest feedback, and try on several pairs. ",
            "author": null,
            "id": "dxnb16p",
            "parent_id": "t1_dxna010",
            "score": 12,
            "created_utc": 1524171825.0,
            "replies": [
                {
                    "body": "When u say shaved do you mean buzzed so there is still stubble or shaved so its smooth? ",
                    "author": "BrutalWarPig",
                    "id": "dxnb5re",
                    "parent_id": "t1_dxnb16p",
                    "score": 9,
                    "created_utc": 1524171947.0,
                    "replies": [
                        {
                            "body": "Just buzzed so there's stubble left. ",
                            "author": null,
                            "id": "dxnbe3y",
                            "parent_id": "t1_dxnb5re",
                            "score": 6,
                            "created_utc": 1524172170.0,
                            "replies": [
                                {
                                    "body": "Okay ty.",
                                    "author": "BrutalWarPig",
                                    "id": "dxncrr1",
                                    "parent_id": "t1_dxnbe3y",
                                    "score": 11,
                                    "created_utc": 1524173508.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "You ignored the part about the shunt, which OP seems to not want visible",
                    "author": "connormxy",
                    "id": "dxnsnd7",
                    "parent_id": "t1_dxnb16p",
                    "score": 3,
                    "created_utc": 1524190807.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Since you have rounded features I'd say you would rock some more angular glasses. I know they're expensive, but my doctor has a wall of frames to try on. If you have a friend with a good fashion sense maybe they could help? Or, if, like me, you don't have friends that want to go to the eye doctor with you (like, what?!), you can easily find pointers on the interthing.",
            "author": "_cedarwood_",
            "id": "dxnczlc",
            "parent_id": "t1_dxna010",
            "score": 4,
            "created_utc": 1524173718.0,
            "replies": [
                {
                    "body": "Eyebuydirect.com\n\nCheap as hell compared to LensCrafters and good quality ",
                    "author": null,
                    "id": "dxnd32c",
                    "parent_id": "t1_dxnczlc",
                    "score": 5,
                    "created_utc": 1524173812.0,
                    "replies": [
                        {
                            "body": "Unless you're like me and have a realtively high prescription, and have to pay for the ultra thin lenses. \n\nStill fantastic quality though, but not much cheaper than anywhere else. ",
                            "author": "waaarg",
                            "id": "dxnusfo",
                            "parent_id": "t1_dxnd32c",
                            "score": 1,
                            "created_utc": 1524193343.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Maybe some trendy ray ban club masters in like a turtle? ",
            "author": "Ssgogo1",
            "id": "dxncvor",
            "parent_id": "t1_dxna010",
            "score": 8,
            "created_utc": 1524173613.0,
            "replies": [
                {
                    "body": "Yes! Club masters are such a great style and look great in virtually anyone. ",
                    "author": "FamousLastName",
                    "id": "dxnfjqc",
                    "parent_id": "t1_dxncvor",
                    "score": 4,
                    "created_utc": 1524176276.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Try Warby Parker. You can do at home try on for free. They send you 5 pairs you pick out and you have a week before you put them in the return box they send and keep doing that until you find a pair you like. You can either give them your prescription or give them your optometrists’s info and they’ll get your prescription from them. ",
            "author": "JessStation",
            "id": "dxni2d6",
            "parent_id": "t1_dxna010",
            "score": 3,
            "created_utc": 1524178920.0,
            "replies": []
        },
        {
            "body": "Yeah bro I got face cancer on one side and never had hair there for 7 years. Minox has been helping slowly but surely",
            "author": "Youareaharrywizard",
            "id": "dxohdaw",
            "parent_id": "t1_dxo68ep",
            "score": 2,
            "created_utc": 1524231234.0,
            "replies": []
        },
        {
            "body": "Yes I started off with nothing on my cheeks (well if you looked closely you could see tiny thin white hairs at a certain angle but that doesn't count). There's a facebook group called 'minox beard spot' check it out.",
            "author": "lowmechanics",
            "id": "dxo7av9",
            "parent_id": "t1_dxo68ep",
            "score": 1,
            "created_utc": 1524214339.0,
            "replies": []
        },
        {
            "body": "The other comment is misinforming. First of all if you're under like 22 don't use minoxidil. \n\nYou do grow facial hair, just not on the cheeks yeah? Minoxidil will help existing follicles thicken and grow. Some hairs are super thin and unnoticeable (and I'm not sure about this but I'd assume since balding causes hair to thin to the point it can't penetrate skin, there may be cheek hairs that are too thin to surface that will become thick enough to grow). These are the hairs that will become thicker and grow. \n\nTake a close look, if you're mid 20s andand you've got a lot of empty patches of skin in the beard region, there is nothing there for minoxidil to work on. Hairs will not just appear so don't get your hopes up.\n\nThat said, I had patches and very little growth and a few months in I have noticeable growth on the cheeks and I can see more tiny hairs that should probably start thickening up in a few months",
            "author": "JustMyRegularAccount",
            "id": "dymfya9",
            "parent_id": "t1_dxo68ep",
            "score": 1,
            "created_utc": 1525749132.0,
            "replies": []
        },
        {
            "body": "When u say shaved do you mean buzzed so there is still stubble or shaved so its smooth? ",
            "author": "BrutalWarPig",
            "id": "dxnb5re",
            "parent_id": "t1_dxnb16p",
            "score": 9,
            "created_utc": 1524171947.0,
            "replies": [
                {
                    "body": "Just buzzed so there's stubble left. ",
                    "author": null,
                    "id": "dxnbe3y",
                    "parent_id": "t1_dxnb5re",
                    "score": 6,
                    "created_utc": 1524172170.0,
                    "replies": [
                        {
                            "body": "Okay ty.",
                            "author": "BrutalWarPig",
                            "id": "dxncrr1",
                            "parent_id": "t1_dxnbe3y",
                            "score": 11,
                            "created_utc": 1524173508.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "You ignored the part about the shunt, which OP seems to not want visible",
            "author": "connormxy",
            "id": "dxnsnd7",
            "parent_id": "t1_dxnb16p",
            "score": 3,
            "created_utc": 1524190807.0,
            "replies": []
        },
        {
            "body": "Eyebuydirect.com\n\nCheap as hell compared to LensCrafters and good quality ",
            "author": null,
            "id": "dxnd32c",
            "parent_id": "t1_dxnczlc",
            "score": 5,
            "created_utc": 1524173812.0,
            "replies": [
                {
                    "body": "Unless you're like me and have a realtively high prescription, and have to pay for the ultra thin lenses. \n\nStill fantastic quality though, but not much cheaper than anywhere else. ",
                    "author": "waaarg",
                    "id": "dxnusfo",
                    "parent_id": "t1_dxnd32c",
                    "score": 1,
                    "created_utc": 1524193343.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yes! Club masters are such a great style and look great in virtually anyone. ",
            "author": "FamousLastName",
            "id": "dxnfjqc",
            "parent_id": "t1_dxncvor",
            "score": 4,
            "created_utc": 1524176276.0,
            "replies": []
        },
        {
            "body": "Just buzzed so there's stubble left. ",
            "author": null,
            "id": "dxnbe3y",
            "parent_id": "t1_dxnb5re",
            "score": 6,
            "created_utc": 1524172170.0,
            "replies": [
                {
                    "body": "Okay ty.",
                    "author": "BrutalWarPig",
                    "id": "dxncrr1",
                    "parent_id": "t1_dxnbe3y",
                    "score": 11,
                    "created_utc": 1524173508.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Unless you're like me and have a realtively high prescription, and have to pay for the ultra thin lenses. \n\nStill fantastic quality though, but not much cheaper than anywhere else. ",
            "author": "waaarg",
            "id": "dxnusfo",
            "parent_id": "t1_dxnd32c",
            "score": 1,
            "created_utc": 1524193343.0,
            "replies": []
        },
        {
            "body": "Okay ty.",
            "author": "BrutalWarPig",
            "id": "dxncrr1",
            "parent_id": "t1_dxnbe3y",
            "score": 11,
            "created_utc": 1524173508.0,
            "replies": []
        }
    ]
}