{
    "title": "Nobody Ever Believes Me",
    "post_id": "e5aj70",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/e5aj70/nobody_ever_believes_me/",
    "author": "sbluxx",
    "body": "I cannot tell you how many times I've been in conversations where a girl says \"my friend goes on dates with an old guy & he gives her $500 just to have dinner with them\".\n\nI try to respectfully say that maybe there's more to that arrangement her friend just doesn't want to tell her about because most men want more than just good looks, and I'm met with \"well why would she lie? She said she doesn't do anything and I believe her\" and \"well paypigs exist so can platonic sugar daddies\" \"men are just lonely and want the ego boost, not sex\".\n\nGod forbid I try to be realistic with people... ok rant over haha Happy Monday everyone!\n\nEDIT: here's my point, as put so eloquently by u/mr_sugarman : \"I think her point is more \"Everyone who says they are doing platonic only\" can't be telling the truth. Versus \"Everyone who says they are doing platonic is lying.\" Two different implications.\"",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/e5aj70/nobody_ever_believes_me/",
    "score": 116,
    "upvote_ratio": 0.93,
    "created_utc": 1575342229.0,
    "num_comments": 129,
    "links": [
        [
            "/u/mr_sugarman"
        ]
    ],
    "comments": [
        {
            "body": "So here's my story. I'm the old guy. We went on a couple of trust-building dates and sort of got stuck in the friend zone. I was okay with it. For me there was an openness, availability, and a connection. I also genuinely appreciated helping this girl. So 300 500 for a dinner/date became the norm for about a year. But after a while two things happened.\n\nAs is human nature, my SB started to take the relationship for granted. She flaked on some dates, started to pull away, catered to her schedule and not mine, and my personal pet peeve, texted during the date. When she want some money, company or a good meal, she'd call, but things were clearly going in the wrong direction.\n\nOn my part, I began feeling used. I know that she was meeting other men for sex and a lot less money. Began to feel my self-esteem drop a bit.\n\nSo yes, there are Daddys out there who will provide generously for company, conversation, connection, without sex. But the relationship still has to be mutual have some level. We're not stupid, pathetically lonely, or otherwise deficient. We have our own needs, and if they're not met, we will move on. Trust me, there is no shortage of charming, beautiful, intelligent women who do appreciate a nice time and a true demonstration of our appreciation monetarily, given without expectation or condition.",
            "author": "skydog561",
            "id": "f9jv9aj",
            "parent_id": "t3_e5aj70",
            "score": 22,
            "created_utc": 1575386607.0,
            "replies": [
                {
                    "body": "I never said that these types of relationships didn't exist, the idea behind it when girls brag about those relationships is that they're one sided when in actuality, you just proved that they're not. There has to be a mutual effort. I'm sorry you got taken advantage of :( Have you met anyone else since?",
                    "author": "sbluxx",
                    "id": "f9jvwgc",
                    "parent_id": "t1_f9jv9aj",
                    "score": 1,
                    "created_utc": 1575387045.0,
                    "replies": [
                        {
                            "body": "I really don't feel that I was taking advantage of. I enjoyed the time we spent together and still have warm thoughts about the past. However, I have now taken to avoiding the friend zone from the get-go. The funny part is after the initial and early intimacy, I anticipate going to the type of relationship I enjoy best. Somewhat counterintuitive, but many things in the relationship world are counterintuitive.",
                            "author": "skydog561",
                            "id": "f9jx30v",
                            "parent_id": "t1_f9jvwgc",
                            "score": 7,
                            "created_utc": 1575387842.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Some women like to see how little they can do and how much they can take from you.\nShe friend zoned you because you allowed her to do that....\n\nI have had this EXACT SAME THING HAPPEN.... my \"sb\" was a straight up scam artist..... \n\nI put my \"sb\" to an ultimatum.... hump or move on.... she tried to play up \"we work so well together\" we dont need sex if we love ine another....\n.., blah blah blah ..\n\nYou dont need my money either since we work so well together\" (this was my answer) \n\nDont feel bad, she was a rinser, someone who tries to get as much from you by doing as little as possible..\n.",
                    "author": "SpaceGuy1968",
                    "id": "f9k0v6y",
                    "parent_id": "t1_f9jv9aj",
                    "score": -1,
                    "created_utc": 1575390330.0,
                    "replies": [
                        {
                            "body": "Yes, women will happily go on dates for money without intimacy because they dont want to sleep with you. Maybe you weren't paying enough to warrant her sleeping with you. The fact you gave her an ultimatum to sleep with you for money is illegal.",
                            "author": "throwaway109w",
                            "id": "f9l8im4",
                            "parent_id": "t1_f9k0v6y",
                            "score": 6,
                            "created_utc": 1575416966.0,
                            "replies": [
                                {
                                    "body": "I knew she was playing me, u are right about it being illegal and i was being an asshole because she was doing crazy stuff with me beyond the pale. She was trying to get as much from me FOR AS LITTLE AS SHE COULD.... SHE BARELY COMMUNICATED. asked me for ALOT  and i believed she was just a con artist \n\nThat was put all wrong above and am sorry... we had met a few times, im not cheap at all and always ask if im \"doing right\" if its a pure SB M&G\n\ni sound like a total ass above, but, there is more than one M&G \n\nI totally accept these beautiful younger SBs are out of my league Looks wise and thats what i pay for many times.  Im 100% ok with all that\n\nI am sorry, that comment was dickish",
                                    "author": "SpaceGuy1968",
                                    "id": "f9l99x3",
                                    "parent_id": "t1_f9l8im4",
                                    "score": -1,
                                    "created_utc": 1575417493.0,
                                    "replies": [
                                        {
                                            "body": "She didn't play you. She spent time with you and you paid her for it. You should be more explicit about what you want and what you want to happen in a date if you dont want it to happen again. This is an agreement that two parties go into and both have to make it clear what is expected of the other.",
                                            "author": "throwaway109w",
                                            "id": "f9l9mxn",
                                            "parent_id": "t1_f9l99x3",
                                            "score": 5,
                                            "created_utc": 1575417745.0,
                                            "replies": [
                                                {
                                                    "body": "I deleted those last two u are totally correct \nI didn't see it that way until u said it that way, i was younger and i didn't know what i was doing honestly.\n\nIts funny how u can look at a situation differently at different stages of your life \n\nI didn't explicitly state what i wanted/expected",
                                                    "author": "SpaceGuy1968",
                                                    "id": "f9laufw",
                                                    "parent_id": "t1_f9l9mxn",
                                                    "score": 1,
                                                    "created_utc": 1575418589.0,
                                                    "replies": [
                                                        {
                                                            "body": "That's fair, but remember time is time intimacy or not. It's not wrong to expect intimacy but next time say what you expect and if the other party doesnt want that then you can decide not to go ahead. Backing people into a corner and suddenly demanding sex isnt going to get you anywhere.",
                                                            "author": "throwaway109w",
                                                            "id": "f9lb7vi",
                                                            "parent_id": "t1_f9laufw",
                                                            "score": 5,
                                                            "created_utc": 1575418849.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "body": "Your retraction was the dick-ish part. Your comment was real and heartfelt.",
                                            "author": "yalbazzaz",
                                            "id": "f9nc7ra",
                                            "parent_id": "t1_f9l99x3",
                                            "score": 0,
                                            "created_utc": 1575481514.0,
                                            "replies": [
                                                {
                                                    "body": "I cant win can i?",
                                                    "author": "SpaceGuy1968",
                                                    "id": "f9ndkl4",
                                                    "parent_id": "t1_f9nc7ra",
                                                    "score": 2,
                                                    "created_utc": 1575482311.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Had a meet n greet with a girl that turned out to be an OG sugar baby.  She looked at posted as 24 but was 31 and had been in the game since 18.   We didn’t click but had nice dinner talking about our experiences.    She said the ones that don’t want to have sex are the worst because they are usually needy and controlling and weird.   Bottom line,  there is no free lunch.   You may luck into a newby or some guy that gets cold feet and gives you a nice allowance without sex but it’s rare.  Not something to bank on.",
            "author": "LotBuilder",
            "id": "f9j50rf",
            "parent_id": "t3_e5aj70",
            "score": 10,
            "created_utc": 1575356406.0,
            "replies": [
                {
                    "body": "I concur with her experience. The few times I’ve had just companionship arrangements soooo needy to the point it wasn’t even fun. When sex is involved there is an end game, it’s called climax. No sex involved it’s blurred and they seem to need constant attention. Where as normally there is a build up to a date, sex and then both parties are ok for a bit then repeat. \n\nI would never seek out companionship only ever again.",
                    "author": "knowswhatiwant",
                    "id": "f9jtvco",
                    "parent_id": "t1_f9j50rf",
                    "score": 7,
                    "created_utc": 1575385641.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "3% of the women account for 90% of the stories because it is the dream come true. Someone will rain money on me for just being me.",
            "author": "SDforreal",
            "id": "f9ir61o",
            "parent_id": "t3_e5aj70",
            "score": 41,
            "created_utc": 1575344002.0,
            "replies": [
                {
                    "body": "I HATE IT. then girls go into this expecting some fantasy that’s never going to happen, and when someone tries to get them to see the reality of it you’re “raining on their parade”",
                    "author": "sbluxx",
                    "id": "f9itm0e",
                    "parent_id": "t1_f9ir61o",
                    "score": 17,
                    "created_utc": 1575345683.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "f9j6ycq",
                            "parent_id": "t1_f9itm0e",
                            "score": 5,
                            "created_utc": 1575358869.0,
                            "replies": [
                                {
                                    "body": "do you enjoy your relationship with him? as long as you both are getting something out of it, that's what matters. & are you asking why I'm a sugar baby?",
                                    "author": "sbluxx",
                                    "id": "f9ju6zl",
                                    "parent_id": "t1_f9j6ycq",
                                    "score": 1,
                                    "created_utc": 1575385872.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "They literally set themselves up to be scammed or pump and dumped.",
                            "author": null,
                            "id": "f9j5bhy",
                            "parent_id": "t1_f9itm0e",
                            "score": 6,
                            "created_utc": 1575356764.0,
                            "replies": []
                        },
                        {
                            "body": "I agree.",
                            "author": "SDforreal",
                            "id": "f9iu927",
                            "parent_id": "t1_f9itm0e",
                            "score": 0,
                            "created_utc": 1575346141.0,
                            "replies": [
                                {
                                    "body": "Nothin to be annoyed about.\n\nCertainly a percentage coming in under false pretenses figure out what’s up and join the regular SB pool.",
                                    "author": "King_of_SDs",
                                    "id": "f9izua8",
                                    "parent_id": "t1_f9iu927",
                                    "score": 3,
                                    "created_utc": 1575350802.0,
                                    "replies": [
                                        {
                                            "body": "my annoyance only comes from me wanting to protect them lol it's for their own good!",
                                            "author": "sbluxx",
                                            "id": "f9jtsr9",
                                            "parent_id": "t1_f9izua8",
                                            "score": 2,
                                            "created_utc": 1575385591.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Not to worry. They will have failure after failure trying to achieve this and will quit the bowl or change their perspective.",
                            "author": "sortasapien",
                            "id": "f9jxp5p",
                            "parent_id": "t1_f9itm0e",
                            "score": 0,
                            "created_utc": 1575388252.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Someone on this thread once said “you aren’t gonna find captain save-a-hoe” and that stuck with me",
                    "author": null,
                    "id": "f9jhsrd",
                    "parent_id": "t1_f9ir61o",
                    "score": 2,
                    "created_utc": 1575374928.0,
                    "replies": [
                        {
                            "body": "hahahahahaha you never know, some do!",
                            "author": "sbluxx",
                            "id": "f9ju8cj",
                            "parent_id": "t1_f9jhsrd",
                            "score": 2,
                            "created_utc": 1575385898.0,
                            "replies": []
                        },
                        {
                            "body": "Captain save a hoe is far and few between.... the \"capt\" has been scammed a few times and he is bitter and lookin to make sure he/she isnt getting scammed again",
                            "author": "SpaceGuy1968",
                            "id": "f9jys73",
                            "parent_id": "t1_f9jhsrd",
                            "score": -1,
                            "created_utc": 1575388971.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "I think it is why there are so many SBs who wind up lying or being flat out con artists",
                    "author": "SpaceGuy1968",
                    "id": "f9jyifq",
                    "parent_id": "t1_f9ir61o",
                    "score": -1,
                    "created_utc": 1575388789.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I had a guy that would give me close to that to go out. I felt bad though bc he was super annoying and also very lonely. He was happy to just have company. Would see broadway shows and plays. I helped him look for apartments. I met someone and moved on. Only happened one other time. Had a few very generous meet and greets. Had an impotent guy that just wanted company and treated me 5 figure shopping spree first date but omg he was controlling and manipulative had to end that just wanted a yes girl to control and show off. Oh and he was an alcoholic.",
            "author": "knowswhatiwant",
            "id": "f9iqgmb",
            "parent_id": "t3_e5aj70",
            "score": 30,
            "created_utc": 1575343512.0,
            "replies": [
                {
                    "body": "Even if it’s not sex there’s almost always a catch in these situations. It’s not all unicorns and rainbows!!!",
                    "author": "sbluxx",
                    "id": "f9ito2p",
                    "parent_id": "t1_f9iqgmb",
                    "score": 16,
                    "created_utc": 1575345725.0,
                    "replies": [
                        {
                            "body": "EXACTLY! The two times it actually happened omg was not all that fun. Cool I got what I wanted with so many strings.",
                            "author": "knowswhatiwant",
                            "id": "f9its3f",
                            "parent_id": "t1_f9ito2p",
                            "score": 11,
                            "created_utc": 1575345809.0,
                            "replies": [
                                {
                                    "body": "I can tell you are ridiculously hot just by the way you write. I'm talking 10/10 head turning, drop dead gorgeous attractive. \n\nHow you ask?\n\nBecause that's the only explanation for why a SD hasn't pressed charges against for you murdering the English language. /s  \n\n\nIn all seriousness, sounds like you've had some amazing experiences.",
                                    "author": "TexasSD",
                                    "id": "f9ive6f",
                                    "parent_id": "t1_f9its3f",
                                    "score": -12,
                                    "created_utc": 1575347000.0,
                                    "replies": [
                                        {
                                            "body": "Well at least I’m hot 🥵",
                                            "author": "knowswhatiwant",
                                            "id": "f9ivjd0",
                                            "parent_id": "t1_f9ive6f",
                                            "score": 7,
                                            "created_utc": 1575347110.0,
                                            "replies": [
                                                {
                                                    "body": ">ridiculously hot \n\nDon't sell yourself short.",
                                                    "author": "TexasSD",
                                                    "id": "f9iwc0n",
                                                    "parent_id": "t1_f9ivjd0",
                                                    "score": 1,
                                                    "created_utc": 1575347721.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "A catch?\n\nhttps://m.youtube.com/watch?v=fEUHC8plVbs",
                            "author": "King_of_SDs",
                            "id": "f9izxkv",
                            "parent_id": "t1_f9ito2p",
                            "score": 3,
                            "created_utc": 1575350891.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Things you should never talk about with friends: Politics, Race, Religion, and Reality.",
            "author": "Zero2Tiger",
            "id": "f9j1k0g",
            "parent_id": "t3_e5aj70",
            "score": 22,
            "created_utc": 1575352521.0,
            "replies": [
                {
                    "body": "Acceptable topics of discussion: the weather, sports, and celebrity dating.",
                    "author": null,
                    "id": "f9j5sgo",
                    "parent_id": "t1_f9j1k0g",
                    "score": 7,
                    "created_utc": 1575357357.0,
                    "replies": [
                        {
                            "body": "Routes to work",
                            "author": null,
                            "id": "f9lrrb4",
                            "parent_id": "t1_f9j5sgo",
                            "score": 2,
                            "created_utc": 1575430328.0,
                            "replies": []
                        },
                        {
                            "body": "Right on",
                            "author": "Zero2Tiger",
                            "id": "f9khkot",
                            "parent_id": "t1_f9j5sgo",
                            "score": 1,
                            "created_utc": 1575400603.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "So basically, be boring and have boring friends.",
                    "author": null,
                    "id": "f9jynsz",
                    "parent_id": "t1_f9j1k0g",
                    "score": 6,
                    "created_utc": 1575388890.0,
                    "replies": [
                        {
                            "body": "No have varied friends of different backgrounds where other more important things matter.",
                            "author": "Zero2Tiger",
                            "id": "f9khd6v",
                            "parent_id": "t1_f9jynsz",
                            "score": -1,
                            "created_utc": 1575400477.0,
                            "replies": [
                                {
                                    "body": "There’s nothing more important than philosophy, religion, politics, etc. An unexamined life is not worth living for a human being. If a person is unable or unwilling to talk about those things, then they’re not worth talking to.",
                                    "author": null,
                                    "id": "f9ksp2x",
                                    "parent_id": "t1_f9khd6v",
                                    "score": 2,
                                    "created_utc": 1575407098.0,
                                    "replies": [
                                        {
                                            "body": "Thanks for sharing your opinion. I just don't share it.",
                                            "author": "Zero2Tiger",
                                            "id": "f9lrv45",
                                            "parent_id": "t1_f9ksp2x",
                                            "score": 0,
                                            "created_utc": 1575430404.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "These are the best things to talk about with friends - if you can remain civil and open-minded. I've talked a lot about this sort of shit on M&Gs and first dates in general and have found it makes things click and work. I am open and honest. I want to talk about some deep shit, not just small talk. I hate small talk.",
                    "author": "BigBearSD",
                    "id": "f9kcf0j",
                    "parent_id": "t1_f9j1k0g",
                    "score": 3,
                    "created_utc": 1575397513.0,
                    "replies": [
                        {
                            "body": "I like to have friends and know people of different background than me so that doesn't work out for me.",
                            "author": "Zero2Tiger",
                            "id": "f9khbig",
                            "parent_id": "t1_f9kcf0j",
                            "score": 0,
                            "created_utc": 1575400448.0,
                            "replies": [
                                {
                                    "body": "I have friends from completely different backgrounds and all over the political spectrum... Doesn't bother me / us at all. Then again I am able to play devils advocate for a lot of things, and can discuss things civilly without getting butthurt. I believe everyone is entitled to their opinions, and that their views on things may be different to mine.",
                                    "author": "BigBearSD",
                                    "id": "f9khobq",
                                    "parent_id": "t1_f9khbig",
                                    "score": 0,
                                    "created_utc": 1575400663.0,
                                    "replies": [
                                        {
                                            "body": "I believe the same but most people don't so it goes insane. I like things to go smoothly instead.",
                                            "author": "Zero2Tiger",
                                            "id": "f9ki08y",
                                            "parent_id": "t1_f9khobq",
                                            "score": 0,
                                            "created_utc": 1575400861.0,
                                            "replies": [
                                                {
                                                    "body": "Ahhh I don't mind a touch of drama. Too much yes, but too little is boring. \n\nThen again I never really have any with my friends. The most heated debates still don't devolve in to name calling and things like that.",
                                                    "author": "BigBearSD",
                                                    "id": "f9kii0h",
                                                    "parent_id": "t1_f9ki08y",
                                                    "score": -1,
                                                    "created_utc": 1575401154.0,
                                                    "replies": [
                                                        {
                                                            "body": "Mine have people are quick to fire. I don't like drama. Too old for drama.",
                                                            "author": "Zero2Tiger",
                                                            "id": "f9kirqq",
                                                            "parent_id": "t1_f9kii0h",
                                                            "score": 1,
                                                            "created_utc": 1575401309.0,
                                                            "replies": [
                                                                {
                                                                    "body": "I am too old for drama too, but a light dusting can keep things interesting.",
                                                                    "author": "BigBearSD",
                                                                    "id": "f9kj9xa",
                                                                    "parent_id": "t1_f9kirqq",
                                                                    "score": -1,
                                                                    "created_utc": 1575401607.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "I don't like that kind of interesting. I'll just stick with my boring relationships haha.",
                                                                            "author": "Zero2Tiger",
                                                                            "id": "f9kjoqy",
                                                                            "parent_id": "t1_f9kj9xa",
                                                                            "score": 2,
                                                                            "created_utc": 1575401850.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "That's white people logic. That's what all other races talk about hence the wars in their countries\n😂",
                    "author": "flylittleman",
                    "id": "f9jjbq4",
                    "parent_id": "t1_f9j1k0g",
                    "score": -3,
                    "created_utc": 1575376669.0,
                    "replies": [
                        {
                            "body": "This started out anti white then went anti everyone else haha don't know what to think of it but I read you.",
                            "author": "Zero2Tiger",
                            "id": "f9khjpl",
                            "parent_id": "t1_f9jjbq4",
                            "score": 1,
                            "created_utc": 1575400586.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I have a friend who sends me money anytime I need it. If I were to add everything up . . . I would probably owe him a house from this year alone. (I use Ppal so I very much have proof) and I have only met him 2 times. Neither times we had sex (he met my girlfriend the first time and then my husband and daughter the second time).",
            "author": "AtmnThrntn",
            "id": "f9jn99z",
            "parent_id": "t3_e5aj70",
            "score": 7,
            "created_utc": 1575380483.0,
            "replies": [
                {
                    "body": "I had a guy like that invested in my business, paid my rent for like 4 months and we went on 2 dates and some sexy FaceTimes. He had his reasons for helping me, but he helps a lot of girls. It’s like his thing.",
                    "author": "knowswhatiwant",
                    "id": "f9ju3cf",
                    "parent_id": "t1_f9jn99z",
                    "score": 6,
                    "created_utc": 1575385799.0,
                    "replies": [
                        {
                            "body": "...",
                            "author": "Jabaggs",
                            "id": "f9k5kid",
                            "parent_id": "t1_f9ju3cf",
                            "score": -1,
                            "created_utc": 1575393303.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "f9jkyrn",
            "parent_id": "t3_e5aj70",
            "score": 8,
            "created_utc": 1575378370.0,
            "replies": [
                {
                    "body": "This! Back before SA got crazy most guys would gift a couple hundred. I was pretty surprised as it was when I first joined the site. I’ve accepted that’s not really how it is anymore and don’t ask but nice when it happens.",
                    "author": "knowswhatiwant",
                    "id": "f9ju9d5",
                    "parent_id": "t1_f9jkyrn",
                    "score": 4,
                    "created_utc": 1575385918.0,
                    "replies": [
                        {
                            "body": "oh how I miss those days :(",
                            "author": "sbluxx",
                            "id": "f9jxapq",
                            "parent_id": "t1_f9ju9d5",
                            "score": 4,
                            "created_utc": 1575387985.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "👏👏👏",
                    "author": null,
                    "id": "f9krmrt",
                    "parent_id": "t1_f9jkyrn",
                    "score": 3,
                    "created_utc": 1575406484.0,
                    "replies": []
                },
                {
                    "body": "What? How much do you think a man should pay for intimacy then?",
                    "author": "Jabaggs",
                    "id": "f9k6jae",
                    "parent_id": "t1_f9jkyrn",
                    "score": -3,
                    "created_utc": 1575393901.0,
                    "replies": [
                        {
                            "body": "I don’t know if answering that will be against the rules. Just think a higher amount.",
                            "author": "thehottubistoohawt",
                            "id": "f9k6wgw",
                            "parent_id": "t1_f9k6jae",
                            "score": 4,
                            "created_utc": 1575394127.0,
                            "replies": [
                                {
                                    "body": "Well can you tell me where the money tree is at? Because every job I had it takes me a week to make 500 bucks",
                                    "author": "Jabaggs",
                                    "id": "f9k7hx4",
                                    "parent_id": "t1_f9k6wgw",
                                    "score": -2,
                                    "created_utc": 1575394498.0,
                                    "replies": [
                                        {
                                            "body": "You’re a SB?? \n\nIf you’re a SD, well, then you really aren’t if you are making 500 in a week at a job. \n\nI need more context to your situation to properly answer your money tree question. This will be different for everyone.",
                                            "author": "thehottubistoohawt",
                                            "id": "f9k7us4",
                                            "parent_id": "t1_f9k7hx4",
                                            "score": 5,
                                            "created_utc": 1575394721.0,
                                            "replies": [
                                                {
                                                    "body": "I’m a guy not a SB",
                                                    "author": "Jabaggs",
                                                    "id": "f9k8jqk",
                                                    "parent_id": "t1_f9k7us4",
                                                    "score": 0,
                                                    "created_utc": 1575395149.0,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "body": "You can ask the SDs who give their SBs over $2k a month.",
                                            "author": "bsbdfw",
                                            "id": "f9m098o",
                                            "parent_id": "t1_f9k7hx4",
                                            "score": 3,
                                            "created_utc": 1575437070.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "Then you’re not a sd. Which is fine. Goon tinder or pray for a hot girl to fall in. Love",
                                            "author": "Lilipuss25",
                                            "id": "f9mtvtg",
                                            "parent_id": "t1_f9k7hx4",
                                            "score": 3,
                                            "created_utc": 1575470173.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I mean, they will. I’ve been on dinner dates and got hundreds... not again tho lol usually if there’s no sex eventually they will drift off...",
            "author": "godsgirli",
            "id": "f9kb0nu",
            "parent_id": "t3_e5aj70",
            "score": 3,
            "created_utc": 1575396671.0,
            "replies": []
        },
        {
            "body": "It's definitely possible. I was given $xxxx by two different men after a simple dinner last month. They both insisted to pay my full PPM for a couple platonic dates of their own volition, and it was a refreshing surprise.",
            "author": null,
            "id": "f9krewp",
            "parent_id": "t3_e5aj70",
            "score": 3,
            "created_utc": 1575406359.0,
            "replies": [
                {
                    "body": "I wish it happened more often tbh, I think we'd all be happier in the bowl haha",
                    "author": "sbluxx",
                    "id": "f9ksgah",
                    "parent_id": "t1_f9krewp",
                    "score": 3,
                    "created_utc": 1575406954.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "It may seem unlikely, but it does happen... it has happened to me too, a few times.",
            "author": "RealEarthAngel",
            "id": "f9la9av",
            "parent_id": "t3_e5aj70",
            "score": 3,
            "created_utc": 1575418179.0,
            "replies": []
        },
        {
            "body": "I had a very nice SD at one point back in New York who would give me the amount  the OP mentioned just to go out dancing with him and make his ex-girlfriend jealous! I always looked forward to our dates.",
            "author": "RealEarthAngel",
            "id": "f9laspq",
            "parent_id": "t3_e5aj70",
            "score": 3,
            "created_utc": 1575418556.0,
            "replies": []
        },
        {
            "body": "I always have a real hard time believing that anyone would pay that kind of money just for some companionship, nothing physical.  Most super rich men, don’t need to pay.  My guess is there is some sexy involved, she just does not want to admit it. Just my 2 cents",
            "author": null,
            "id": "f9ipu1t",
            "parent_id": "t3_e5aj70",
            "score": 12,
            "created_utc": 1575343067.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "f9jld21",
                    "parent_id": "t1_f9ipu1t",
                    "score": 10,
                    "created_utc": 1575378761.0,
                    "replies": [
                        {
                            "body": "Well. If they go to a stripper club..... they know they are spending money for nothing. \"The fantasy\" is nothing and some men like to show \"other men\" they have money to burn\n\nI hate giving my money away for nothing, i grew up poor but have made a great life for myself. Im self made you know?\n\nAt 20 years old... strippers happened to be fun, at 40 i am like..... why do i have to pay for the privilege of you shaking your stuff.... and i sugar date for years.... strippers are the ultimate scam artists.....\n\nThose men are probably showing off to other guys stating \"i have burn able cash\"",
                            "author": "SpaceGuy1968",
                            "id": "f9k07io",
                            "parent_id": "t1_f9jld21",
                            "score": -2,
                            "created_utc": 1575389908.0,
                            "replies": [
                                {
                                    "body": "?\nWhat is the logic of calling strippers scam artists when they aren't forcing you to pay nor selling anything under false pretenses?",
                                    "author": "bsbdfw",
                                    "id": "f9m0uej",
                                    "parent_id": "t1_f9k07io",
                                    "score": 4,
                                    "created_utc": 1575437599.0,
                                    "replies": [
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "f9mfvhw",
                                            "parent_id": "t1_f9m0uej",
                                            "score": 3,
                                            "created_utc": 1575456875.0,
                                            "replies": [
                                                {
                                                    "body": "I grew up poor so maybe that is it",
                                                    "author": "SpaceGuy1968",
                                                    "id": "f9mm51z",
                                                    "parent_id": "t1_f9mfvhw",
                                                    "score": 0,
                                                    "created_utc": 1575464345.0,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "body": "Well thats how i see it sorry if u dont like it \n\nIts like paying for friendship, u must like to pay for friendship? Or are u the one being paid for your time.... prostitutes and strippers always say \"my time is valuable\" when really anyone who earns hourly wages never gets rich \n\nI can afford to do whatever at this point, and i do pay for the company of beautiful young women... because i can afford it .... \n\nBut paying for nothing? So i can show off to other guys and other people i have money to burn... yes maybe im not that rich \n\n\nI grew up poor as hell. Strippers are stupid waste of time and money.... thats how i feel",
                                            "author": "SpaceGuy1968",
                                            "id": "f9mmkvg",
                                            "parent_id": "t1_f9m0uej",
                                            "score": 0,
                                            "created_utc": 1575464762.0,
                                            "replies": [
                                                {
                                                    "body": ">Well thats how i see it sorry if u dont like it\n\nI don't need an apology, my personal feelings are irrelevant nor were they shared with you. I see what you're saying but that doesn't equal to \"strippers are scammers\" just because *you* don't care for their services. It's like me saying a casino is a scam, just because I don't gamble. Clearly other people do, enjoy it & win off of it. So me calling it a scam because it doesn't suit my particular taste is **senseless**.\n\nThat is my point.",
                                                    "author": "bsbdfw",
                                                    "id": "f9oci50",
                                                    "parent_id": "t1_f9mmkvg",
                                                    "score": 2,
                                                    "created_utc": 1575501310.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "If they are unattractive or have awful personalities then yes they have to pay unless they are like billionaires.",
                    "author": "knowswhatiwant",
                    "id": "f9iqkq8",
                    "parent_id": "t1_f9ipu1t",
                    "score": 10,
                    "created_utc": 1575343593.0,
                    "replies": [
                        {
                            "body": "Very few wealthy people cannot be completely charming for a few hours.",
                            "author": "SDforreal",
                            "id": "f9iqzls",
                            "parent_id": "t1_f9iqkq8",
                            "score": 11,
                            "created_utc": 1575343881.0,
                            "replies": [
                                {
                                    "body": "At what point in wealth is it expected that someone will automatically have women falling all over him....that’s what I don’t get. I’ve known many rich not what I would consider wealthy men who don’t exactly have loads of friends, recognition or social awareness that could spend a few hundred for arm candy and conversation. I’m by no means saying it’s the norm I’ve only encountered it a couple times and really by accident.",
                                    "author": "knowswhatiwant",
                                    "id": "f9isfdl",
                                    "parent_id": "t1_f9iqzls",
                                    "score": 4,
                                    "created_utc": 1575344856.0,
                                    "replies": []
                                },
                                {
                                    "body": "Most very wealthy people are not self made, so they can get away without having to be very charming.",
                                    "author": null,
                                    "id": "f9j9m1s",
                                    "parent_id": "t1_f9iqzls",
                                    "score": -2,
                                    "created_utc": 1575362612.0,
                                    "replies": [
                                        {
                                            "body": "You believe the #1 myth about millionaires.\n\nhttps://money.usnews.com/money/blogs/on-retirement/articles/7-myths-about-millionaires",
                                            "author": "SDforreal",
                                            "id": "f9jg5nf",
                                            "parent_id": "t1_f9j9m1s",
                                            "score": 2,
                                            "created_utc": 1575372795.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Actually it does happen I can vouch for that",
                    "author": "Babywish",
                    "id": "f9iq3pf",
                    "parent_id": "t1_f9ipu1t",
                    "score": 4,
                    "created_utc": 1575343256.0,
                    "replies": [
                        {
                            "body": "the point is that it’s rare and shouldn’t be the expectation. Also people lie a lot and will do anything for clout so 🤷🏽‍♀️",
                            "author": "sbluxx",
                            "id": "f9itq60",
                            "parent_id": "t1_f9iq3pf",
                            "score": 9,
                            "created_utc": 1575345770.0,
                            "replies": []
                        },
                        {
                            "body": "People also survive plane crashes.",
                            "author": null,
                            "id": "f9j5q9l",
                            "parent_id": "t1_f9iq3pf",
                            "score": 4,
                            "created_utc": 1575357278.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "To be fair, I don't think these things are as impossible as some people think. Multiple times I've gone on just-dinner dates with men, sometimes M&G, and they've given me a pretty nice amount of cash. \n\n\nOne of my best first dates, he got me a suite at a waterfront Fairmont, took me to a 5 star restaurant, we drove round the city chatting, and then he took me back to my hotel and left. Didn't expect anything else, and left me $500 cash in the suite. \n\n\nNot saying it's something these women should be taking to mean they can do it easily too, because for sure they have unrealistic expectations very often, but it DOES happen",
            "author": "spoiledbratcat",
            "id": "f9iy67q",
            "parent_id": "t3_e5aj70",
            "score": 8,
            "created_utc": 1575349288.0,
            "replies": [
                {
                    "body": "But I don't think OP was saying it isn't possible. She's just saying that its far more likely that a girl who is being paid to go on sugar dates is also having sex. Both are possibilities but it doesn't help anyone to act like a platonic SD is the ONLY possibility.",
                    "author": null,
                    "id": "f9j5g9c",
                    "parent_id": "t1_f9iy67q",
                    "score": 0,
                    "created_utc": 1575356926.0,
                    "replies": [
                        {
                            "body": "For sure, I just don't think it's fair to say anyone who says they were paid for platonic dates is lying",
                            "author": "spoiledbratcat",
                            "id": "f9j6rw8",
                            "parent_id": "t1_f9j5g9c",
                            "score": 5,
                            "created_utc": 1575358628.0,
                            "replies": [
                                {
                                    "body": "I think her point is more \"Everyone who says they are doing platonic only\" can't be telling the truth. Versus \"Everyone who says they are doing platonic is lying.\" Two different implications.",
                                    "author": null,
                                    "id": "f9j71zg",
                                    "parent_id": "t1_f9j6rw8",
                                    "score": 0,
                                    "created_utc": 1575359004.0,
                                    "replies": [
                                        {
                                            "body": "Fair enough! I just know I'd be frustrated if I told someone about a platonic date and they came back saying \"WELL MY FRIEND SAID YOU'RE A LIAR AND Y'ALL FUCKED\" 🤣",
                                            "author": "spoiledbratcat",
                                            "id": "f9j74d3",
                                            "parent_id": "t1_f9j71zg",
                                            "score": 5,
                                            "created_utc": 1575359091.0,
                                            "replies": [
                                                {
                                                    "body": "Haha. The funny thing about sugaring is that the girls who aren't fucking get viewed by non-sugar people as if they are fucking anyways.",
                                                    "author": null,
                                                    "id": "f9j7d3d",
                                                    "parent_id": "t1_f9j74d3",
                                                    "score": 1,
                                                    "created_utc": 1575359418.0,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "body": "thank you for making my point easier to understand! I think people were misunderstanding me lol",
                                            "author": "sbluxx",
                                            "id": "f9juinu",
                                            "parent_id": "t1_f9j71zg",
                                            "score": 1,
                                            "created_utc": 1575386096.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "It’s NOT unheard of. My SD would pay me $300 for lunch dates",
            "author": "cornycatlady",
            "id": "f9jw01n",
            "parent_id": "t3_e5aj70",
            "score": 4,
            "created_utc": 1575387111.0,
            "replies": [
                {
                    "body": "i never said it WASN'T",
                    "author": "sbluxx",
                    "id": "f9jw2ev",
                    "parent_id": "t1_f9jw01n",
                    "score": 0,
                    "created_utc": 1575387155.0,
                    "replies": [
                        {
                            "body": "Don’t see where you clarified that in your post lol",
                            "author": "cornycatlady",
                            "id": "f9jw54z",
                            "parent_id": "t1_f9jw2ev",
                            "score": 4,
                            "created_utc": 1575387205.0,
                            "replies": [
                                {
                                    "body": "I just edited my post since I think it's being misconstrued lol",
                                    "author": "sbluxx",
                                    "id": "f9jwbai",
                                    "parent_id": "t1_f9jw54z",
                                    "score": 1,
                                    "created_utc": 1575387319.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "I don’t like the idea of gulags but I can see why someone would want these types of people in them (dating younger girls) Not that this is right or correct way to deal with this behavior of course",
                    "author": "BrownAsian12",
                    "id": "f9w9onv",
                    "parent_id": "t1_f9jw01n",
                    "score": 0,
                    "created_utc": 1575689244.0,
                    "replies": [
                        {
                            "body": "What",
                            "author": "cornycatlady",
                            "id": "f9wbyx5",
                            "parent_id": "t1_f9w9onv",
                            "score": 1,
                            "created_utc": 1575690246.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I hear this so much, and I’ve had actual arrangements like this. I even have an online one right now who has already sent me $5,000 over the past few weeks in exchange only for regular, non-sexual yet sort of flirty conversations. After my first experience like this, I used to think these arrangements were only extremely rare and very few people found them, so I felt lucky. However, after my fourth platonic SR I think it’s just something that I, personally, am able to do. My reality may just be slightly different from those who believe it is not possible. I know it is, from experience, but it may just not be possible for certain/most SBs and while most SDs know they could never be that giving, there are men out there who are insanely wealthy and NOT insanely stingy.",
            "author": "ilikeshoweroranges",
            "id": "f9ke5g4",
            "parent_id": "t3_e5aj70",
            "score": 4,
            "created_utc": 1575398552.0,
            "replies": [
                {
                    "body": "👏🏼👏🏼👏🏼",
                    "author": "RealEarthAngel",
                    "id": "f9lay7m",
                    "parent_id": "t1_f9ke5g4",
                    "score": 3,
                    "created_utc": 1575418663.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "All of my sbs that wanted to keep me a secret said it was platonic only to their friends. My dumb ass advice was that no one would believe that. I should just open a business selling sugar mamas to suckers.",
            "author": "TastySpermDispenser",
            "id": "f9iudkb",
            "parent_id": "t3_e5aj70",
            "score": 7,
            "created_utc": 1575346237.0,
            "replies": [
                {
                    "body": "One sugar mama please",
                    "author": "antonivs",
                    "id": "f9iybl7",
                    "parent_id": "t1_f9iudkb",
                    "score": 4,
                    "created_utc": 1575349417.0,
                    "replies": [
                        {
                            "body": "That'll be $2,675 please. Thank you, come again.",
                            "author": "TastySpermDispenser",
                            "id": "f9j02o2",
                            "parent_id": "t1_f9iybl7",
                            "score": 1,
                            "created_utc": 1575351025.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I was P&Ded by an SB I had hoped would be a recurring travel arrangement for me, in a city a few hours from where I live and work. We made plans for a date to a cultural event (they still call me asking for donations because I bought nice seats), a Michelin stared restaurant, and back to my hotel afterwards. She was new and was super impressed that the very first thing I did was to pay her. Afterwards when we were cuddling in my bed she told me that I was the third SD who she had had a first date with, and the other two had paid her $1000 each to take her to the aquarium, and she hadn't done anything with either one. I bought her a chromebook after the date (my idea, she needed a computer) and she ghosted me as soon as I gave her the amazon locker code. I hadn't told her what was in the locker I just told her that I sent her something.\n\nMy actual date doing something expensive that she likes with actual alone time afterwards maybe didn't live up to her experience of getting paid to walk around in public for a couple hours.",
            "author": "Sugarbeggar",
            "id": "f9j0t6b",
            "parent_id": "t3_e5aj70",
            "score": 2,
            "created_utc": 1575351749.0,
            "replies": [
                {
                    "body": "Maybe if it had been a MacBook she might still be around? \n\nJokes...\nSorry she flaked. How old was she?",
                    "author": "thehottubistoohawt",
                    "id": "f9jlkqk",
                    "parent_id": "t1_f9j0t6b",
                    "score": 4,
                    "created_utc": 1575378969.0,
                    "replies": [
                        {
                            "body": "21\n\nEdit: our pillow talk had consisted of her saying that she wanted to save up for a new gaming laptop, and me suggesting a chrome book might be more prudent (filling out job applications and what not). She had downplayed the idea, then I went ahead and sent her one anyways. A gaming computer was not in the budget, but still I didn't buy the absolute cheapest one.",
                            "author": "Sugarbeggar",
                            "id": "f9l741m",
                            "parent_id": "t1_f9jlkqk",
                            "score": 1,
                            "created_utc": 1575416010.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Man that sucks. But I'm guessing she wasn't actually new to the bowl and knew exactly what she was doing. A decent person would not have ghosted after receiving such a nice gift. A decent person would feel probably pretty guilty. At least I would. But I'm not hardened/bitter about this lifestyle and I have a conscience and would never treat someone like that.",
                    "author": "MidwestSB",
                    "id": "f9kgq4p",
                    "parent_id": "t1_f9j0t6b",
                    "score": 1,
                    "created_utc": 1575400096.0,
                    "replies": [
                        {
                            "body": "I think that she was (for a variety of reasons that I'm not going to go into too deeply).",
                            "author": "Sugarbeggar",
                            "id": "f9l7s9n",
                            "parent_id": "t1_f9kgq4p",
                            "score": 1,
                            "created_utc": 1575416464.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Never underestimate the ability for people to believe the stupidest and least likely possibility. Its why scamming, pump and dumping, rinsing and all the other bullshit works. Most people are just Olympic levels of ignorant, naive, or delusional.",
            "author": null,
            "id": "f9j5kjn",
            "parent_id": "t3_e5aj70",
            "score": 4,
            "created_utc": 1575357074.0,
            "replies": []
        },
        {
            "body": "I’ve had at least a dozen platonic dates from WYP at $200-$300 ea.  And my current pot SD has provided $600 cash unprovoked after 1lunch, 1happy hr, 1coffee date (Platonic less than 2 hrs).  He has finally asked me to do an overnight next week though so I’m planning on that with a new arrangement.   It may not be likely in majority of sr’s but it does happen ... I doubt I’d proceed with a sd if they didn’t show some generosity from the beginning.  But that’s also what I’m most attracted to / more generous to me the more attractive you become to me and I’m def planning to reciprocate with fun times :-)",
            "author": "cukierdziecko",
            "id": "f9iwncc",
            "parent_id": "t3_e5aj70",
            "score": 5,
            "created_utc": 1575347977.0,
            "replies": [
                {
                    "body": "I think there's a difference between M&G's (which I would expect to be platonic) and the actual arrangement itself being platonic. One is way more feasible than the other.",
                    "author": "sbluxx",
                    "id": "f9jxedp",
                    "parent_id": "t1_f9iwncc",
                    "score": 2,
                    "created_utc": 1575388052.0,
                    "replies": []
                },
                {
                    "body": "I was just reading here about an SD who met a woman on SA who he now has a $$$-free FWB deal with. \n\nAnd that she calls him all of the time to hook up. It's a weird ol' world on this site.",
                    "author": "RinsersWTF",
                    "id": "f9ixc9j",
                    "parent_id": "t1_f9iwncc",
                    "score": 3,
                    "created_utc": 1575348566.0,
                    "replies": [
                        {
                            "body": "Well that’s every relationship I’ve had before SA ... lol",
                            "author": "cukierdziecko",
                            "id": "f9ixepb",
                            "parent_id": "t1_f9ixc9j",
                            "score": 4,
                            "created_utc": 1575348624.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "They do exist, maybe they got lucky. No use in setting anyone straight or prying.",
            "author": "dade_murphy1",
            "id": "f9j86t3",
            "parent_id": "t3_e5aj70",
            "score": 2,
            "created_utc": 1575360554.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "f9ipnk3",
            "parent_id": "t3_e5aj70",
            "score": 2,
            "created_utc": 1575342942.0,
            "replies": [
                {
                    "body": "I would assume by her username she is an sb 😂",
                    "author": "rareandplentiful11",
                    "id": "f9iqs2q",
                    "parent_id": "t1_f9ipnk3",
                    "score": 7,
                    "created_utc": 1575343739.0,
                    "replies": [
                        {
                            "body": "we have a winner!!!",
                            "author": "sbluxx",
                            "id": "f9itjef",
                            "parent_id": "t1_f9iqs2q",
                            "score": 2,
                            "created_utc": 1575345630.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Everyone is different <3 some SDs are really generous and secure... cheers to them both!",
            "author": null,
            "id": "f9ixpq6",
            "parent_id": "t3_e5aj70",
            "score": 2,
            "created_utc": 1575348887.0,
            "replies": [
                {
                    "body": "definitely! I'm happy for them either way, just want people to remain realistic about the bowl",
                    "author": "sbluxx",
                    "id": "f9juogg",
                    "parent_id": "t1_f9ixpq6",
                    "score": 1,
                    "created_utc": 1575386206.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Nothing is free and every thing comes with a cost 🤣",
            "author": "hearbaby",
            "id": "f9jdbk7",
            "parent_id": "t3_e5aj70",
            "score": 0,
            "created_utc": 1575368503.0,
            "replies": []
        },
        {
            "body": "No one ever wants to admit whats really going on. Let them live their lie, wouldnt you want the same courtesy?",
            "author": "VladTheFootballStar",
            "id": "f9iqdof",
            "parent_id": "t3_e5aj70",
            "score": -1,
            "created_utc": 1575343456.0,
            "replies": [
                {
                    "body": "I wouldn't go around telling half-truths to save face, I either say something or don't!",
                    "author": "sbluxx",
                    "id": "f9jump5",
                    "parent_id": "t1_f9iqdof",
                    "score": 2,
                    "created_utc": 1575386172.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "f9jz7u4",
            "parent_id": "t3_e5aj70",
            "score": 0,
            "created_utc": 1575389260.0,
            "replies": [
                {
                    "body": "if anything she'd be a cam girl not an online sb. I wonder if they're of age!!",
                    "author": "sbluxx",
                    "id": "f9jzrtu",
                    "parent_id": "t1_f9jz7u4",
                    "score": 1,
                    "created_utc": 1575389625.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Then you aren’t a sugar daddy either. Time for you to become a sugar baby... \n\nThere is your money tree.\n\nWhy are you on this forum?",
            "author": "thehottubistoohawt",
            "id": "f9k8o1o",
            "parent_id": "t3_e5aj70",
            "score": 0,
            "created_utc": 1575395222.0,
            "replies": []
        },
        {
            "body": "Yes\nI started vanilla dating a younger woman who was 15 years younger than me.....she told me she was seeing men who paid her for lunch dates, dinner dates, weekends away and so forth....without sex...\n\n\nI tried to just ignore it because i really liked her and wanted a regular relationship with her.... then after we started dating/seeing each other regularly.... she wanted to earn extra money by \"lunch and dinner dates without sex\"\n\nShe and i fought about this because i know how men are, i had a hard time believing they would give her 3 to 500 for being pretty.... sorry she wasn't highly educated or worldly\n\nOur \"vanilla\" relationship ended soon afterwards because i couldn't date her seeing other men like that",
            "author": "SpaceGuy1968",
            "id": "f9jy3t8",
            "parent_id": "t3_e5aj70",
            "score": -1,
            "created_utc": 1575388522.0,
            "replies": [
                {
                    "body": ":(",
                    "author": "sbluxx",
                    "id": "f9jzvbj",
                    "parent_id": "t1_f9jy3t8",
                    "score": 1,
                    "created_utc": 1575389688.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I've been in conversations where a girl says ----\n\nOr they read about it on Tumblr ,etc. Just say \" lovely, I'm sure she is, but for my money she is fucking the dude and doesn't want her friends to know\" That is a good reason to lie. she doesn't want to be perceived as a prostitute.",
            "author": "GSSD",
            "id": "f9jp3ne",
            "parent_id": "t3_e5aj70",
            "score": -2,
            "created_utc": 1575382041.0,
            "replies": [
                {
                    "body": "and that I completely understand! I guess I should just continue to nod & smile when I hear these stories lol",
                    "author": "sbluxx",
                    "id": "f9jxmn4",
                    "parent_id": "t1_f9jp3ne",
                    "score": 1,
                    "created_utc": 1575388205.0,
                    "replies": [
                        {
                            "body": "Yepp! You can have comfort knowing the truth.",
                            "author": "GSSD",
                            "id": "f9jxukg",
                            "parent_id": "t1_f9jxmn4",
                            "score": 0,
                            "created_utc": 1575388354.0,
                            "replies": [
                                {
                                    "body": "Just because some people choose not to believe it doesn’t mean it isn’t true for some of us. I know there are a lot of people who really want to believe that an arrangement could never happen without intimacy, but it does, a lot more than you think.",
                                    "author": "RealEarthAngel",
                                    "id": "f9lba8n",
                                    "parent_id": "t1_f9jxukg",
                                    "score": 4,
                                    "created_utc": 1575418894.0,
                                    "replies": [
                                        {
                                            "body": "The standard deviation curve has a tail on either end -the outliers. They do exist. But the majority of the sugar world operates in the 75%-ile.",
                                            "author": "GSSD",
                                            "id": "f9lbsok",
                                            "parent_id": "t1_f9lba8n",
                                            "score": 0,
                                            "created_utc": 1575419249.0,
                                            "replies": [
                                                {
                                                    "body": "Well, I don’t know about all that… I’d like to believe I’m special, but I have a feeling that there are more than just a few of us👍🏼",
                                                    "author": "RealEarthAngel",
                                                    "id": "f9lbw6t",
                                                    "parent_id": "t1_f9lbsok",
                                                    "score": 3,
                                                    "created_utc": 1575419316.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I never said that these types of relationships didn't exist, the idea behind it when girls brag about those relationships is that they're one sided when in actuality, you just proved that they're not. There has to be a mutual effort. I'm sorry you got taken advantage of :( Have you met anyone else since?",
            "author": "sbluxx",
            "id": "f9jvwgc",
            "parent_id": "t1_f9jv9aj",
            "score": 1,
            "created_utc": 1575387045.0,
            "replies": [
                {
                    "body": "I really don't feel that I was taking advantage of. I enjoyed the time we spent together and still have warm thoughts about the past. However, I have now taken to avoiding the friend zone from the get-go. The funny part is after the initial and early intimacy, I anticipate going to the type of relationship I enjoy best. Somewhat counterintuitive, but many things in the relationship world are counterintuitive.",
                    "author": "skydog561",
                    "id": "f9jx30v",
                    "parent_id": "t1_f9jvwgc",
                    "score": 7,
                    "created_utc": 1575387842.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Some women like to see how little they can do and how much they can take from you.\nShe friend zoned you because you allowed her to do that....\n\nI have had this EXACT SAME THING HAPPEN.... my \"sb\" was a straight up scam artist..... \n\nI put my \"sb\" to an ultimatum.... hump or move on.... she tried to play up \"we work so well together\" we dont need sex if we love ine another....\n.., blah blah blah ..\n\nYou dont need my money either since we work so well together\" (this was my answer) \n\nDont feel bad, she was a rinser, someone who tries to get as much from you by doing as little as possible..\n.",
            "author": "SpaceGuy1968",
            "id": "f9k0v6y",
            "parent_id": "t1_f9jv9aj",
            "score": -1,
            "created_utc": 1575390330.0,
            "replies": [
                {
                    "body": "Yes, women will happily go on dates for money without intimacy because they dont want to sleep with you. Maybe you weren't paying enough to warrant her sleeping with you. The fact you gave her an ultimatum to sleep with you for money is illegal.",
                    "author": "throwaway109w",
                    "id": "f9l8im4",
                    "parent_id": "t1_f9k0v6y",
                    "score": 6,
                    "created_utc": 1575416966.0,
                    "replies": [
                        {
                            "body": "I knew she was playing me, u are right about it being illegal and i was being an asshole because she was doing crazy stuff with me beyond the pale. She was trying to get as much from me FOR AS LITTLE AS SHE COULD.... SHE BARELY COMMUNICATED. asked me for ALOT  and i believed she was just a con artist \n\nThat was put all wrong above and am sorry... we had met a few times, im not cheap at all and always ask if im \"doing right\" if its a pure SB M&G\n\ni sound like a total ass above, but, there is more than one M&G \n\nI totally accept these beautiful younger SBs are out of my league Looks wise and thats what i pay for many times.  Im 100% ok with all that\n\nI am sorry, that comment was dickish",
                            "author": "SpaceGuy1968",
                            "id": "f9l99x3",
                            "parent_id": "t1_f9l8im4",
                            "score": -1,
                            "created_utc": 1575417493.0,
                            "replies": [
                                {
                                    "body": "She didn't play you. She spent time with you and you paid her for it. You should be more explicit about what you want and what you want to happen in a date if you dont want it to happen again. This is an agreement that two parties go into and both have to make it clear what is expected of the other.",
                                    "author": "throwaway109w",
                                    "id": "f9l9mxn",
                                    "parent_id": "t1_f9l99x3",
                                    "score": 5,
                                    "created_utc": 1575417745.0,
                                    "replies": [
                                        {
                                            "body": "I deleted those last two u are totally correct \nI didn't see it that way until u said it that way, i was younger and i didn't know what i was doing honestly.\n\nIts funny how u can look at a situation differently at different stages of your life \n\nI didn't explicitly state what i wanted/expected",
                                            "author": "SpaceGuy1968",
                                            "id": "f9laufw",
                                            "parent_id": "t1_f9l9mxn",
                                            "score": 1,
                                            "created_utc": 1575418589.0,
                                            "replies": [
                                                {
                                                    "body": "That's fair, but remember time is time intimacy or not. It's not wrong to expect intimacy but next time say what you expect and if the other party doesnt want that then you can decide not to go ahead. Backing people into a corner and suddenly demanding sex isnt going to get you anywhere.",
                                                    "author": "throwaway109w",
                                                    "id": "f9lb7vi",
                                                    "parent_id": "t1_f9laufw",
                                                    "score": 5,
                                                    "created_utc": 1575418849.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "Your retraction was the dick-ish part. Your comment was real and heartfelt.",
                                    "author": "yalbazzaz",
                                    "id": "f9nc7ra",
                                    "parent_id": "t1_f9l99x3",
                                    "score": 0,
                                    "created_utc": 1575481514.0,
                                    "replies": [
                                        {
                                            "body": "I cant win can i?",
                                            "author": "SpaceGuy1968",
                                            "id": "f9ndkl4",
                                            "parent_id": "t1_f9nc7ra",
                                            "score": 2,
                                            "created_utc": 1575482311.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I concur with her experience. The few times I’ve had just companionship arrangements soooo needy to the point it wasn’t even fun. When sex is involved there is an end game, it’s called climax. No sex involved it’s blurred and they seem to need constant attention. Where as normally there is a build up to a date, sex and then both parties are ok for a bit then repeat. \n\nI would never seek out companionship only ever again.",
            "author": "knowswhatiwant",
            "id": "f9jtvco",
            "parent_id": "t1_f9j50rf",
            "score": 7,
            "created_utc": 1575385641.0,
            "replies": []
        },
        {
            "body": "I HATE IT. then girls go into this expecting some fantasy that’s never going to happen, and when someone tries to get them to see the reality of it you’re “raining on their parade”",
            "author": "sbluxx",
            "id": "f9itm0e",
            "parent_id": "t1_f9ir61o",
            "score": 17,
            "created_utc": 1575345683.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "f9j6ycq",
                    "parent_id": "t1_f9itm0e",
                    "score": 5,
                    "created_utc": 1575358869.0,
                    "replies": [
                        {
                            "body": "do you enjoy your relationship with him? as long as you both are getting something out of it, that's what matters. & are you asking why I'm a sugar baby?",
                            "author": "sbluxx",
                            "id": "f9ju6zl",
                            "parent_id": "t1_f9j6ycq",
                            "score": 1,
                            "created_utc": 1575385872.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "They literally set themselves up to be scammed or pump and dumped.",
                    "author": null,
                    "id": "f9j5bhy",
                    "parent_id": "t1_f9itm0e",
                    "score": 6,
                    "created_utc": 1575356764.0,
                    "replies": []
                },
                {
                    "body": "I agree.",
                    "author": "SDforreal",
                    "id": "f9iu927",
                    "parent_id": "t1_f9itm0e",
                    "score": 0,
                    "created_utc": 1575346141.0,
                    "replies": [
                        {
                            "body": "Nothin to be annoyed about.\n\nCertainly a percentage coming in under false pretenses figure out what’s up and join the regular SB pool.",
                            "author": "King_of_SDs",
                            "id": "f9izua8",
                            "parent_id": "t1_f9iu927",
                            "score": 3,
                            "created_utc": 1575350802.0,
                            "replies": [
                                {
                                    "body": "my annoyance only comes from me wanting to protect them lol it's for their own good!",
                                    "author": "sbluxx",
                                    "id": "f9jtsr9",
                                    "parent_id": "t1_f9izua8",
                                    "score": 2,
                                    "created_utc": 1575385591.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Not to worry. They will have failure after failure trying to achieve this and will quit the bowl or change their perspective.",
                    "author": "sortasapien",
                    "id": "f9jxp5p",
                    "parent_id": "t1_f9itm0e",
                    "score": 0,
                    "created_utc": 1575388252.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Someone on this thread once said “you aren’t gonna find captain save-a-hoe” and that stuck with me",
            "author": null,
            "id": "f9jhsrd",
            "parent_id": "t1_f9ir61o",
            "score": 2,
            "created_utc": 1575374928.0,
            "replies": [
                {
                    "body": "hahahahahaha you never know, some do!",
                    "author": "sbluxx",
                    "id": "f9ju8cj",
                    "parent_id": "t1_f9jhsrd",
                    "score": 2,
                    "created_utc": 1575385898.0,
                    "replies": []
                },
                {
                    "body": "Captain save a hoe is far and few between.... the \"capt\" has been scammed a few times and he is bitter and lookin to make sure he/she isnt getting scammed again",
                    "author": "SpaceGuy1968",
                    "id": "f9jys73",
                    "parent_id": "t1_f9jhsrd",
                    "score": -1,
                    "created_utc": 1575388971.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I think it is why there are so many SBs who wind up lying or being flat out con artists",
            "author": "SpaceGuy1968",
            "id": "f9jyifq",
            "parent_id": "t1_f9ir61o",
            "score": -1,
            "created_utc": 1575388789.0,
            "replies": []
        },
        {
            "body": "Even if it’s not sex there’s almost always a catch in these situations. It’s not all unicorns and rainbows!!!",
            "author": "sbluxx",
            "id": "f9ito2p",
            "parent_id": "t1_f9iqgmb",
            "score": 16,
            "created_utc": 1575345725.0,
            "replies": [
                {
                    "body": "EXACTLY! The two times it actually happened omg was not all that fun. Cool I got what I wanted with so many strings.",
                    "author": "knowswhatiwant",
                    "id": "f9its3f",
                    "parent_id": "t1_f9ito2p",
                    "score": 11,
                    "created_utc": 1575345809.0,
                    "replies": [
                        {
                            "body": "I can tell you are ridiculously hot just by the way you write. I'm talking 10/10 head turning, drop dead gorgeous attractive. \n\nHow you ask?\n\nBecause that's the only explanation for why a SD hasn't pressed charges against for you murdering the English language. /s  \n\n\nIn all seriousness, sounds like you've had some amazing experiences.",
                            "author": "TexasSD",
                            "id": "f9ive6f",
                            "parent_id": "t1_f9its3f",
                            "score": -12,
                            "created_utc": 1575347000.0,
                            "replies": [
                                {
                                    "body": "Well at least I’m hot 🥵",
                                    "author": "knowswhatiwant",
                                    "id": "f9ivjd0",
                                    "parent_id": "t1_f9ive6f",
                                    "score": 7,
                                    "created_utc": 1575347110.0,
                                    "replies": [
                                        {
                                            "body": ">ridiculously hot \n\nDon't sell yourself short.",
                                            "author": "TexasSD",
                                            "id": "f9iwc0n",
                                            "parent_id": "t1_f9ivjd0",
                                            "score": 1,
                                            "created_utc": 1575347721.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "A catch?\n\nhttps://m.youtube.com/watch?v=fEUHC8plVbs",
                    "author": "King_of_SDs",
                    "id": "f9izxkv",
                    "parent_id": "t1_f9ito2p",
                    "score": 3,
                    "created_utc": 1575350891.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Acceptable topics of discussion: the weather, sports, and celebrity dating.",
            "author": null,
            "id": "f9j5sgo",
            "parent_id": "t1_f9j1k0g",
            "score": 7,
            "created_utc": 1575357357.0,
            "replies": [
                {
                    "body": "Routes to work",
                    "author": null,
                    "id": "f9lrrb4",
                    "parent_id": "t1_f9j5sgo",
                    "score": 2,
                    "created_utc": 1575430328.0,
                    "replies": []
                },
                {
                    "body": "Right on",
                    "author": "Zero2Tiger",
                    "id": "f9khkot",
                    "parent_id": "t1_f9j5sgo",
                    "score": 1,
                    "created_utc": 1575400603.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "So basically, be boring and have boring friends.",
            "author": null,
            "id": "f9jynsz",
            "parent_id": "t1_f9j1k0g",
            "score": 6,
            "created_utc": 1575388890.0,
            "replies": [
                {
                    "body": "No have varied friends of different backgrounds where other more important things matter.",
                    "author": "Zero2Tiger",
                    "id": "f9khd6v",
                    "parent_id": "t1_f9jynsz",
                    "score": -1,
                    "created_utc": 1575400477.0,
                    "replies": [
                        {
                            "body": "There’s nothing more important than philosophy, religion, politics, etc. An unexamined life is not worth living for a human being. If a person is unable or unwilling to talk about those things, then they’re not worth talking to.",
                            "author": null,
                            "id": "f9ksp2x",
                            "parent_id": "t1_f9khd6v",
                            "score": 2,
                            "created_utc": 1575407098.0,
                            "replies": [
                                {
                                    "body": "Thanks for sharing your opinion. I just don't share it.",
                                    "author": "Zero2Tiger",
                                    "id": "f9lrv45",
                                    "parent_id": "t1_f9ksp2x",
                                    "score": 0,
                                    "created_utc": 1575430404.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "These are the best things to talk about with friends - if you can remain civil and open-minded. I've talked a lot about this sort of shit on M&Gs and first dates in general and have found it makes things click and work. I am open and honest. I want to talk about some deep shit, not just small talk. I hate small talk.",
            "author": "BigBearSD",
            "id": "f9kcf0j",
            "parent_id": "t1_f9j1k0g",
            "score": 3,
            "created_utc": 1575397513.0,
            "replies": [
                {
                    "body": "I like to have friends and know people of different background than me so that doesn't work out for me.",
                    "author": "Zero2Tiger",
                    "id": "f9khbig",
                    "parent_id": "t1_f9kcf0j",
                    "score": 0,
                    "created_utc": 1575400448.0,
                    "replies": [
                        {
                            "body": "I have friends from completely different backgrounds and all over the political spectrum... Doesn't bother me / us at all. Then again I am able to play devils advocate for a lot of things, and can discuss things civilly without getting butthurt. I believe everyone is entitled to their opinions, and that their views on things may be different to mine.",
                            "author": "BigBearSD",
                            "id": "f9khobq",
                            "parent_id": "t1_f9khbig",
                            "score": 0,
                            "created_utc": 1575400663.0,
                            "replies": [
                                {
                                    "body": "I believe the same but most people don't so it goes insane. I like things to go smoothly instead.",
                                    "author": "Zero2Tiger",
                                    "id": "f9ki08y",
                                    "parent_id": "t1_f9khobq",
                                    "score": 0,
                                    "created_utc": 1575400861.0,
                                    "replies": [
                                        {
                                            "body": "Ahhh I don't mind a touch of drama. Too much yes, but too little is boring. \n\nThen again I never really have any with my friends. The most heated debates still don't devolve in to name calling and things like that.",
                                            "author": "BigBearSD",
                                            "id": "f9kii0h",
                                            "parent_id": "t1_f9ki08y",
                                            "score": -1,
                                            "created_utc": 1575401154.0,
                                            "replies": [
                                                {
                                                    "body": "Mine have people are quick to fire. I don't like drama. Too old for drama.",
                                                    "author": "Zero2Tiger",
                                                    "id": "f9kirqq",
                                                    "parent_id": "t1_f9kii0h",
                                                    "score": 1,
                                                    "created_utc": 1575401309.0,
                                                    "replies": [
                                                        {
                                                            "body": "I am too old for drama too, but a light dusting can keep things interesting.",
                                                            "author": "BigBearSD",
                                                            "id": "f9kj9xa",
                                                            "parent_id": "t1_f9kirqq",
                                                            "score": -1,
                                                            "created_utc": 1575401607.0,
                                                            "replies": [
                                                                {
                                                                    "body": "I don't like that kind of interesting. I'll just stick with my boring relationships haha.",
                                                                    "author": "Zero2Tiger",
                                                                    "id": "f9kjoqy",
                                                                    "parent_id": "t1_f9kj9xa",
                                                                    "score": 2,
                                                                    "created_utc": 1575401850.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "That's white people logic. That's what all other races talk about hence the wars in their countries\n😂",
            "author": "flylittleman",
            "id": "f9jjbq4",
            "parent_id": "t1_f9j1k0g",
            "score": -3,
            "created_utc": 1575376669.0,
            "replies": [
                {
                    "body": "This started out anti white then went anti everyone else haha don't know what to think of it but I read you.",
                    "author": "Zero2Tiger",
                    "id": "f9khjpl",
                    "parent_id": "t1_f9jjbq4",
                    "score": 1,
                    "created_utc": 1575400586.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I had a guy like that invested in my business, paid my rent for like 4 months and we went on 2 dates and some sexy FaceTimes. He had his reasons for helping me, but he helps a lot of girls. It’s like his thing.",
            "author": "knowswhatiwant",
            "id": "f9ju3cf",
            "parent_id": "t1_f9jn99z",
            "score": 6,
            "created_utc": 1575385799.0,
            "replies": [
                {
                    "body": "...",
                    "author": "Jabaggs",
                    "id": "f9k5kid",
                    "parent_id": "t1_f9ju3cf",
                    "score": -1,
                    "created_utc": 1575393303.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "This! Back before SA got crazy most guys would gift a couple hundred. I was pretty surprised as it was when I first joined the site. I’ve accepted that’s not really how it is anymore and don’t ask but nice when it happens.",
            "author": "knowswhatiwant",
            "id": "f9ju9d5",
            "parent_id": "t1_f9jkyrn",
            "score": 4,
            "created_utc": 1575385918.0,
            "replies": [
                {
                    "body": "oh how I miss those days :(",
                    "author": "sbluxx",
                    "id": "f9jxapq",
                    "parent_id": "t1_f9ju9d5",
                    "score": 4,
                    "created_utc": 1575387985.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "👏👏👏",
            "author": null,
            "id": "f9krmrt",
            "parent_id": "t1_f9jkyrn",
            "score": 3,
            "created_utc": 1575406484.0,
            "replies": []
        },
        {
            "body": "What? How much do you think a man should pay for intimacy then?",
            "author": "Jabaggs",
            "id": "f9k6jae",
            "parent_id": "t1_f9jkyrn",
            "score": -3,
            "created_utc": 1575393901.0,
            "replies": [
                {
                    "body": "I don’t know if answering that will be against the rules. Just think a higher amount.",
                    "author": "thehottubistoohawt",
                    "id": "f9k6wgw",
                    "parent_id": "t1_f9k6jae",
                    "score": 4,
                    "created_utc": 1575394127.0,
                    "replies": [
                        {
                            "body": "Well can you tell me where the money tree is at? Because every job I had it takes me a week to make 500 bucks",
                            "author": "Jabaggs",
                            "id": "f9k7hx4",
                            "parent_id": "t1_f9k6wgw",
                            "score": -2,
                            "created_utc": 1575394498.0,
                            "replies": [
                                {
                                    "body": "You’re a SB?? \n\nIf you’re a SD, well, then you really aren’t if you are making 500 in a week at a job. \n\nI need more context to your situation to properly answer your money tree question. This will be different for everyone.",
                                    "author": "thehottubistoohawt",
                                    "id": "f9k7us4",
                                    "parent_id": "t1_f9k7hx4",
                                    "score": 5,
                                    "created_utc": 1575394721.0,
                                    "replies": [
                                        {
                                            "body": "I’m a guy not a SB",
                                            "author": "Jabaggs",
                                            "id": "f9k8jqk",
                                            "parent_id": "t1_f9k7us4",
                                            "score": 0,
                                            "created_utc": 1575395149.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "You can ask the SDs who give their SBs over $2k a month.",
                                    "author": "bsbdfw",
                                    "id": "f9m098o",
                                    "parent_id": "t1_f9k7hx4",
                                    "score": 3,
                                    "created_utc": 1575437070.0,
                                    "replies": []
                                },
                                {
                                    "body": "Then you’re not a sd. Which is fine. Goon tinder or pray for a hot girl to fall in. Love",
                                    "author": "Lilipuss25",
                                    "id": "f9mtvtg",
                                    "parent_id": "t1_f9k7hx4",
                                    "score": 3,
                                    "created_utc": 1575470173.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I wish it happened more often tbh, I think we'd all be happier in the bowl haha",
            "author": "sbluxx",
            "id": "f9ksgah",
            "parent_id": "t1_f9krewp",
            "score": 3,
            "created_utc": 1575406954.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "f9jld21",
            "parent_id": "t1_f9ipu1t",
            "score": 10,
            "created_utc": 1575378761.0,
            "replies": [
                {
                    "body": "Well. If they go to a stripper club..... they know they are spending money for nothing. \"The fantasy\" is nothing and some men like to show \"other men\" they have money to burn\n\nI hate giving my money away for nothing, i grew up poor but have made a great life for myself. Im self made you know?\n\nAt 20 years old... strippers happened to be fun, at 40 i am like..... why do i have to pay for the privilege of you shaking your stuff.... and i sugar date for years.... strippers are the ultimate scam artists.....\n\nThose men are probably showing off to other guys stating \"i have burn able cash\"",
                    "author": "SpaceGuy1968",
                    "id": "f9k07io",
                    "parent_id": "t1_f9jld21",
                    "score": -2,
                    "created_utc": 1575389908.0,
                    "replies": [
                        {
                            "body": "?\nWhat is the logic of calling strippers scam artists when they aren't forcing you to pay nor selling anything under false pretenses?",
                            "author": "bsbdfw",
                            "id": "f9m0uej",
                            "parent_id": "t1_f9k07io",
                            "score": 4,
                            "created_utc": 1575437599.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "f9mfvhw",
                                    "parent_id": "t1_f9m0uej",
                                    "score": 3,
                                    "created_utc": 1575456875.0,
                                    "replies": [
                                        {
                                            "body": "I grew up poor so maybe that is it",
                                            "author": "SpaceGuy1968",
                                            "id": "f9mm51z",
                                            "parent_id": "t1_f9mfvhw",
                                            "score": 0,
                                            "created_utc": 1575464345.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "Well thats how i see it sorry if u dont like it \n\nIts like paying for friendship, u must like to pay for friendship? Or are u the one being paid for your time.... prostitutes and strippers always say \"my time is valuable\" when really anyone who earns hourly wages never gets rich \n\nI can afford to do whatever at this point, and i do pay for the company of beautiful young women... because i can afford it .... \n\nBut paying for nothing? So i can show off to other guys and other people i have money to burn... yes maybe im not that rich \n\n\nI grew up poor as hell. Strippers are stupid waste of time and money.... thats how i feel",
                                    "author": "SpaceGuy1968",
                                    "id": "f9mmkvg",
                                    "parent_id": "t1_f9m0uej",
                                    "score": 0,
                                    "created_utc": 1575464762.0,
                                    "replies": [
                                        {
                                            "body": ">Well thats how i see it sorry if u dont like it\n\nI don't need an apology, my personal feelings are irrelevant nor were they shared with you. I see what you're saying but that doesn't equal to \"strippers are scammers\" just because *you* don't care for their services. It's like me saying a casino is a scam, just because I don't gamble. Clearly other people do, enjoy it & win off of it. So me calling it a scam because it doesn't suit my particular taste is **senseless**.\n\nThat is my point.",
                                            "author": "bsbdfw",
                                            "id": "f9oci50",
                                            "parent_id": "t1_f9mmkvg",
                                            "score": 2,
                                            "created_utc": 1575501310.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "If they are unattractive or have awful personalities then yes they have to pay unless they are like billionaires.",
            "author": "knowswhatiwant",
            "id": "f9iqkq8",
            "parent_id": "t1_f9ipu1t",
            "score": 10,
            "created_utc": 1575343593.0,
            "replies": [
                {
                    "body": "Very few wealthy people cannot be completely charming for a few hours.",
                    "author": "SDforreal",
                    "id": "f9iqzls",
                    "parent_id": "t1_f9iqkq8",
                    "score": 11,
                    "created_utc": 1575343881.0,
                    "replies": [
                        {
                            "body": "At what point in wealth is it expected that someone will automatically have women falling all over him....that’s what I don’t get. I’ve known many rich not what I would consider wealthy men who don’t exactly have loads of friends, recognition or social awareness that could spend a few hundred for arm candy and conversation. I’m by no means saying it’s the norm I’ve only encountered it a couple times and really by accident.",
                            "author": "knowswhatiwant",
                            "id": "f9isfdl",
                            "parent_id": "t1_f9iqzls",
                            "score": 4,
                            "created_utc": 1575344856.0,
                            "replies": []
                        },
                        {
                            "body": "Most very wealthy people are not self made, so they can get away without having to be very charming.",
                            "author": null,
                            "id": "f9j9m1s",
                            "parent_id": "t1_f9iqzls",
                            "score": -2,
                            "created_utc": 1575362612.0,
                            "replies": [
                                {
                                    "body": "You believe the #1 myth about millionaires.\n\nhttps://money.usnews.com/money/blogs/on-retirement/articles/7-myths-about-millionaires",
                                    "author": "SDforreal",
                                    "id": "f9jg5nf",
                                    "parent_id": "t1_f9j9m1s",
                                    "score": 2,
                                    "created_utc": 1575372795.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Actually it does happen I can vouch for that",
            "author": "Babywish",
            "id": "f9iq3pf",
            "parent_id": "t1_f9ipu1t",
            "score": 4,
            "created_utc": 1575343256.0,
            "replies": [
                {
                    "body": "the point is that it’s rare and shouldn’t be the expectation. Also people lie a lot and will do anything for clout so 🤷🏽‍♀️",
                    "author": "sbluxx",
                    "id": "f9itq60",
                    "parent_id": "t1_f9iq3pf",
                    "score": 9,
                    "created_utc": 1575345770.0,
                    "replies": []
                },
                {
                    "body": "People also survive plane crashes.",
                    "author": null,
                    "id": "f9j5q9l",
                    "parent_id": "t1_f9iq3pf",
                    "score": 4,
                    "created_utc": 1575357278.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "But I don't think OP was saying it isn't possible. She's just saying that its far more likely that a girl who is being paid to go on sugar dates is also having sex. Both are possibilities but it doesn't help anyone to act like a platonic SD is the ONLY possibility.",
            "author": null,
            "id": "f9j5g9c",
            "parent_id": "t1_f9iy67q",
            "score": 0,
            "created_utc": 1575356926.0,
            "replies": [
                {
                    "body": "For sure, I just don't think it's fair to say anyone who says they were paid for platonic dates is lying",
                    "author": "spoiledbratcat",
                    "id": "f9j6rw8",
                    "parent_id": "t1_f9j5g9c",
                    "score": 5,
                    "created_utc": 1575358628.0,
                    "replies": [
                        {
                            "body": "I think her point is more \"Everyone who says they are doing platonic only\" can't be telling the truth. Versus \"Everyone who says they are doing platonic is lying.\" Two different implications.",
                            "author": null,
                            "id": "f9j71zg",
                            "parent_id": "t1_f9j6rw8",
                            "score": 0,
                            "created_utc": 1575359004.0,
                            "replies": [
                                {
                                    "body": "Fair enough! I just know I'd be frustrated if I told someone about a platonic date and they came back saying \"WELL MY FRIEND SAID YOU'RE A LIAR AND Y'ALL FUCKED\" 🤣",
                                    "author": "spoiledbratcat",
                                    "id": "f9j74d3",
                                    "parent_id": "t1_f9j71zg",
                                    "score": 5,
                                    "created_utc": 1575359091.0,
                                    "replies": [
                                        {
                                            "body": "Haha. The funny thing about sugaring is that the girls who aren't fucking get viewed by non-sugar people as if they are fucking anyways.",
                                            "author": null,
                                            "id": "f9j7d3d",
                                            "parent_id": "t1_f9j74d3",
                                            "score": 1,
                                            "created_utc": 1575359418.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "thank you for making my point easier to understand! I think people were misunderstanding me lol",
                                    "author": "sbluxx",
                                    "id": "f9juinu",
                                    "parent_id": "t1_f9j71zg",
                                    "score": 1,
                                    "created_utc": 1575386096.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "i never said it WASN'T",
            "author": "sbluxx",
            "id": "f9jw2ev",
            "parent_id": "t1_f9jw01n",
            "score": 0,
            "created_utc": 1575387155.0,
            "replies": [
                {
                    "body": "Don’t see where you clarified that in your post lol",
                    "author": "cornycatlady",
                    "id": "f9jw54z",
                    "parent_id": "t1_f9jw2ev",
                    "score": 4,
                    "created_utc": 1575387205.0,
                    "replies": [
                        {
                            "body": "I just edited my post since I think it's being misconstrued lol",
                            "author": "sbluxx",
                            "id": "f9jwbai",
                            "parent_id": "t1_f9jw54z",
                            "score": 1,
                            "created_utc": 1575387319.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I don’t like the idea of gulags but I can see why someone would want these types of people in them (dating younger girls) Not that this is right or correct way to deal with this behavior of course",
            "author": "BrownAsian12",
            "id": "f9w9onv",
            "parent_id": "t1_f9jw01n",
            "score": 0,
            "created_utc": 1575689244.0,
            "replies": [
                {
                    "body": "What",
                    "author": "cornycatlady",
                    "id": "f9wbyx5",
                    "parent_id": "t1_f9w9onv",
                    "score": 1,
                    "created_utc": 1575690246.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "👏🏼👏🏼👏🏼",
            "author": "RealEarthAngel",
            "id": "f9lay7m",
            "parent_id": "t1_f9ke5g4",
            "score": 3,
            "created_utc": 1575418663.0,
            "replies": []
        },
        {
            "body": "One sugar mama please",
            "author": "antonivs",
            "id": "f9iybl7",
            "parent_id": "t1_f9iudkb",
            "score": 4,
            "created_utc": 1575349417.0,
            "replies": [
                {
                    "body": "That'll be $2,675 please. Thank you, come again.",
                    "author": "TastySpermDispenser",
                    "id": "f9j02o2",
                    "parent_id": "t1_f9iybl7",
                    "score": 1,
                    "created_utc": 1575351025.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Maybe if it had been a MacBook she might still be around? \n\nJokes...\nSorry she flaked. How old was she?",
            "author": "thehottubistoohawt",
            "id": "f9jlkqk",
            "parent_id": "t1_f9j0t6b",
            "score": 4,
            "created_utc": 1575378969.0,
            "replies": [
                {
                    "body": "21\n\nEdit: our pillow talk had consisted of her saying that she wanted to save up for a new gaming laptop, and me suggesting a chrome book might be more prudent (filling out job applications and what not). She had downplayed the idea, then I went ahead and sent her one anyways. A gaming computer was not in the budget, but still I didn't buy the absolute cheapest one.",
                    "author": "Sugarbeggar",
                    "id": "f9l741m",
                    "parent_id": "t1_f9jlkqk",
                    "score": 1,
                    "created_utc": 1575416010.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Man that sucks. But I'm guessing she wasn't actually new to the bowl and knew exactly what she was doing. A decent person would not have ghosted after receiving such a nice gift. A decent person would feel probably pretty guilty. At least I would. But I'm not hardened/bitter about this lifestyle and I have a conscience and would never treat someone like that.",
            "author": "MidwestSB",
            "id": "f9kgq4p",
            "parent_id": "t1_f9j0t6b",
            "score": 1,
            "created_utc": 1575400096.0,
            "replies": [
                {
                    "body": "I think that she was (for a variety of reasons that I'm not going to go into too deeply).",
                    "author": "Sugarbeggar",
                    "id": "f9l7s9n",
                    "parent_id": "t1_f9kgq4p",
                    "score": 1,
                    "created_utc": 1575416464.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I think there's a difference between M&G's (which I would expect to be platonic) and the actual arrangement itself being platonic. One is way more feasible than the other.",
            "author": "sbluxx",
            "id": "f9jxedp",
            "parent_id": "t1_f9iwncc",
            "score": 2,
            "created_utc": 1575388052.0,
            "replies": []
        },
        {
            "body": "I was just reading here about an SD who met a woman on SA who he now has a $$$-free FWB deal with. \n\nAnd that she calls him all of the time to hook up. It's a weird ol' world on this site.",
            "author": "RinsersWTF",
            "id": "f9ixc9j",
            "parent_id": "t1_f9iwncc",
            "score": 3,
            "created_utc": 1575348566.0,
            "replies": [
                {
                    "body": "Well that’s every relationship I’ve had before SA ... lol",
                    "author": "cukierdziecko",
                    "id": "f9ixepb",
                    "parent_id": "t1_f9ixc9j",
                    "score": 4,
                    "created_utc": 1575348624.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I would assume by her username she is an sb 😂",
            "author": "rareandplentiful11",
            "id": "f9iqs2q",
            "parent_id": "t1_f9ipnk3",
            "score": 7,
            "created_utc": 1575343739.0,
            "replies": [
                {
                    "body": "we have a winner!!!",
                    "author": "sbluxx",
                    "id": "f9itjef",
                    "parent_id": "t1_f9iqs2q",
                    "score": 2,
                    "created_utc": 1575345630.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "definitely! I'm happy for them either way, just want people to remain realistic about the bowl",
            "author": "sbluxx",
            "id": "f9juogg",
            "parent_id": "t1_f9ixpq6",
            "score": 1,
            "created_utc": 1575386206.0,
            "replies": []
        },
        {
            "body": "I wouldn't go around telling half-truths to save face, I either say something or don't!",
            "author": "sbluxx",
            "id": "f9jump5",
            "parent_id": "t1_f9iqdof",
            "score": 2,
            "created_utc": 1575386172.0,
            "replies": []
        },
        {
            "body": "if anything she'd be a cam girl not an online sb. I wonder if they're of age!!",
            "author": "sbluxx",
            "id": "f9jzrtu",
            "parent_id": "t1_f9jz7u4",
            "score": 1,
            "created_utc": 1575389625.0,
            "replies": []
        },
        {
            "body": ":(",
            "author": "sbluxx",
            "id": "f9jzvbj",
            "parent_id": "t1_f9jy3t8",
            "score": 1,
            "created_utc": 1575389688.0,
            "replies": []
        },
        {
            "body": "and that I completely understand! I guess I should just continue to nod & smile when I hear these stories lol",
            "author": "sbluxx",
            "id": "f9jxmn4",
            "parent_id": "t1_f9jp3ne",
            "score": 1,
            "created_utc": 1575388205.0,
            "replies": [
                {
                    "body": "Yepp! You can have comfort knowing the truth.",
                    "author": "GSSD",
                    "id": "f9jxukg",
                    "parent_id": "t1_f9jxmn4",
                    "score": 0,
                    "created_utc": 1575388354.0,
                    "replies": [
                        {
                            "body": "Just because some people choose not to believe it doesn’t mean it isn’t true for some of us. I know there are a lot of people who really want to believe that an arrangement could never happen without intimacy, but it does, a lot more than you think.",
                            "author": "RealEarthAngel",
                            "id": "f9lba8n",
                            "parent_id": "t1_f9jxukg",
                            "score": 4,
                            "created_utc": 1575418894.0,
                            "replies": [
                                {
                                    "body": "The standard deviation curve has a tail on either end -the outliers. They do exist. But the majority of the sugar world operates in the 75%-ile.",
                                    "author": "GSSD",
                                    "id": "f9lbsok",
                                    "parent_id": "t1_f9lba8n",
                                    "score": 0,
                                    "created_utc": 1575419249.0,
                                    "replies": [
                                        {
                                            "body": "Well, I don’t know about all that… I’d like to believe I’m special, but I have a feeling that there are more than just a few of us👍🏼",
                                            "author": "RealEarthAngel",
                                            "id": "f9lbw6t",
                                            "parent_id": "t1_f9lbsok",
                                            "score": 3,
                                            "created_utc": 1575419316.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I really don't feel that I was taking advantage of. I enjoyed the time we spent together and still have warm thoughts about the past. However, I have now taken to avoiding the friend zone from the get-go. The funny part is after the initial and early intimacy, I anticipate going to the type of relationship I enjoy best. Somewhat counterintuitive, but many things in the relationship world are counterintuitive.",
            "author": "skydog561",
            "id": "f9jx30v",
            "parent_id": "t1_f9jvwgc",
            "score": 7,
            "created_utc": 1575387842.0,
            "replies": []
        },
        {
            "body": "Yes, women will happily go on dates for money without intimacy because they dont want to sleep with you. Maybe you weren't paying enough to warrant her sleeping with you. The fact you gave her an ultimatum to sleep with you for money is illegal.",
            "author": "throwaway109w",
            "id": "f9l8im4",
            "parent_id": "t1_f9k0v6y",
            "score": 6,
            "created_utc": 1575416966.0,
            "replies": [
                {
                    "body": "I knew she was playing me, u are right about it being illegal and i was being an asshole because she was doing crazy stuff with me beyond the pale. She was trying to get as much from me FOR AS LITTLE AS SHE COULD.... SHE BARELY COMMUNICATED. asked me for ALOT  and i believed she was just a con artist \n\nThat was put all wrong above and am sorry... we had met a few times, im not cheap at all and always ask if im \"doing right\" if its a pure SB M&G\n\ni sound like a total ass above, but, there is more than one M&G \n\nI totally accept these beautiful younger SBs are out of my league Looks wise and thats what i pay for many times.  Im 100% ok with all that\n\nI am sorry, that comment was dickish",
                    "author": "SpaceGuy1968",
                    "id": "f9l99x3",
                    "parent_id": "t1_f9l8im4",
                    "score": -1,
                    "created_utc": 1575417493.0,
                    "replies": [
                        {
                            "body": "She didn't play you. She spent time with you and you paid her for it. You should be more explicit about what you want and what you want to happen in a date if you dont want it to happen again. This is an agreement that two parties go into and both have to make it clear what is expected of the other.",
                            "author": "throwaway109w",
                            "id": "f9l9mxn",
                            "parent_id": "t1_f9l99x3",
                            "score": 5,
                            "created_utc": 1575417745.0,
                            "replies": [
                                {
                                    "body": "I deleted those last two u are totally correct \nI didn't see it that way until u said it that way, i was younger and i didn't know what i was doing honestly.\n\nIts funny how u can look at a situation differently at different stages of your life \n\nI didn't explicitly state what i wanted/expected",
                                    "author": "SpaceGuy1968",
                                    "id": "f9laufw",
                                    "parent_id": "t1_f9l9mxn",
                                    "score": 1,
                                    "created_utc": 1575418589.0,
                                    "replies": [
                                        {
                                            "body": "That's fair, but remember time is time intimacy or not. It's not wrong to expect intimacy but next time say what you expect and if the other party doesnt want that then you can decide not to go ahead. Backing people into a corner and suddenly demanding sex isnt going to get you anywhere.",
                                            "author": "throwaway109w",
                                            "id": "f9lb7vi",
                                            "parent_id": "t1_f9laufw",
                                            "score": 5,
                                            "created_utc": 1575418849.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Your retraction was the dick-ish part. Your comment was real and heartfelt.",
                            "author": "yalbazzaz",
                            "id": "f9nc7ra",
                            "parent_id": "t1_f9l99x3",
                            "score": 0,
                            "created_utc": 1575481514.0,
                            "replies": [
                                {
                                    "body": "I cant win can i?",
                                    "author": "SpaceGuy1968",
                                    "id": "f9ndkl4",
                                    "parent_id": "t1_f9nc7ra",
                                    "score": 2,
                                    "created_utc": 1575482311.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "f9j6ycq",
            "parent_id": "t1_f9itm0e",
            "score": 5,
            "created_utc": 1575358869.0,
            "replies": [
                {
                    "body": "do you enjoy your relationship with him? as long as you both are getting something out of it, that's what matters. & are you asking why I'm a sugar baby?",
                    "author": "sbluxx",
                    "id": "f9ju6zl",
                    "parent_id": "t1_f9j6ycq",
                    "score": 1,
                    "created_utc": 1575385872.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "They literally set themselves up to be scammed or pump and dumped.",
            "author": null,
            "id": "f9j5bhy",
            "parent_id": "t1_f9itm0e",
            "score": 6,
            "created_utc": 1575356764.0,
            "replies": []
        },
        {
            "body": "I agree.",
            "author": "SDforreal",
            "id": "f9iu927",
            "parent_id": "t1_f9itm0e",
            "score": 0,
            "created_utc": 1575346141.0,
            "replies": [
                {
                    "body": "Nothin to be annoyed about.\n\nCertainly a percentage coming in under false pretenses figure out what’s up and join the regular SB pool.",
                    "author": "King_of_SDs",
                    "id": "f9izua8",
                    "parent_id": "t1_f9iu927",
                    "score": 3,
                    "created_utc": 1575350802.0,
                    "replies": [
                        {
                            "body": "my annoyance only comes from me wanting to protect them lol it's for their own good!",
                            "author": "sbluxx",
                            "id": "f9jtsr9",
                            "parent_id": "t1_f9izua8",
                            "score": 2,
                            "created_utc": 1575385591.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Not to worry. They will have failure after failure trying to achieve this and will quit the bowl or change their perspective.",
            "author": "sortasapien",
            "id": "f9jxp5p",
            "parent_id": "t1_f9itm0e",
            "score": 0,
            "created_utc": 1575388252.0,
            "replies": []
        },
        {
            "body": "hahahahahaha you never know, some do!",
            "author": "sbluxx",
            "id": "f9ju8cj",
            "parent_id": "t1_f9jhsrd",
            "score": 2,
            "created_utc": 1575385898.0,
            "replies": []
        },
        {
            "body": "Captain save a hoe is far and few between.... the \"capt\" has been scammed a few times and he is bitter and lookin to make sure he/she isnt getting scammed again",
            "author": "SpaceGuy1968",
            "id": "f9jys73",
            "parent_id": "t1_f9jhsrd",
            "score": -1,
            "created_utc": 1575388971.0,
            "replies": []
        },
        {
            "body": "EXACTLY! The two times it actually happened omg was not all that fun. Cool I got what I wanted with so many strings.",
            "author": "knowswhatiwant",
            "id": "f9its3f",
            "parent_id": "t1_f9ito2p",
            "score": 11,
            "created_utc": 1575345809.0,
            "replies": [
                {
                    "body": "I can tell you are ridiculously hot just by the way you write. I'm talking 10/10 head turning, drop dead gorgeous attractive. \n\nHow you ask?\n\nBecause that's the only explanation for why a SD hasn't pressed charges against for you murdering the English language. /s  \n\n\nIn all seriousness, sounds like you've had some amazing experiences.",
                    "author": "TexasSD",
                    "id": "f9ive6f",
                    "parent_id": "t1_f9its3f",
                    "score": -12,
                    "created_utc": 1575347000.0,
                    "replies": [
                        {
                            "body": "Well at least I’m hot 🥵",
                            "author": "knowswhatiwant",
                            "id": "f9ivjd0",
                            "parent_id": "t1_f9ive6f",
                            "score": 7,
                            "created_utc": 1575347110.0,
                            "replies": [
                                {
                                    "body": ">ridiculously hot \n\nDon't sell yourself short.",
                                    "author": "TexasSD",
                                    "id": "f9iwc0n",
                                    "parent_id": "t1_f9ivjd0",
                                    "score": 1,
                                    "created_utc": 1575347721.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "A catch?\n\nhttps://m.youtube.com/watch?v=fEUHC8plVbs",
            "author": "King_of_SDs",
            "id": "f9izxkv",
            "parent_id": "t1_f9ito2p",
            "score": 3,
            "created_utc": 1575350891.0,
            "replies": []
        },
        {
            "body": "Routes to work",
            "author": null,
            "id": "f9lrrb4",
            "parent_id": "t1_f9j5sgo",
            "score": 2,
            "created_utc": 1575430328.0,
            "replies": []
        },
        {
            "body": "Right on",
            "author": "Zero2Tiger",
            "id": "f9khkot",
            "parent_id": "t1_f9j5sgo",
            "score": 1,
            "created_utc": 1575400603.0,
            "replies": []
        },
        {
            "body": "No have varied friends of different backgrounds where other more important things matter.",
            "author": "Zero2Tiger",
            "id": "f9khd6v",
            "parent_id": "t1_f9jynsz",
            "score": -1,
            "created_utc": 1575400477.0,
            "replies": [
                {
                    "body": "There’s nothing more important than philosophy, religion, politics, etc. An unexamined life is not worth living for a human being. If a person is unable or unwilling to talk about those things, then they’re not worth talking to.",
                    "author": null,
                    "id": "f9ksp2x",
                    "parent_id": "t1_f9khd6v",
                    "score": 2,
                    "created_utc": 1575407098.0,
                    "replies": [
                        {
                            "body": "Thanks for sharing your opinion. I just don't share it.",
                            "author": "Zero2Tiger",
                            "id": "f9lrv45",
                            "parent_id": "t1_f9ksp2x",
                            "score": 0,
                            "created_utc": 1575430404.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I like to have friends and know people of different background than me so that doesn't work out for me.",
            "author": "Zero2Tiger",
            "id": "f9khbig",
            "parent_id": "t1_f9kcf0j",
            "score": 0,
            "created_utc": 1575400448.0,
            "replies": [
                {
                    "body": "I have friends from completely different backgrounds and all over the political spectrum... Doesn't bother me / us at all. Then again I am able to play devils advocate for a lot of things, and can discuss things civilly without getting butthurt. I believe everyone is entitled to their opinions, and that their views on things may be different to mine.",
                    "author": "BigBearSD",
                    "id": "f9khobq",
                    "parent_id": "t1_f9khbig",
                    "score": 0,
                    "created_utc": 1575400663.0,
                    "replies": [
                        {
                            "body": "I believe the same but most people don't so it goes insane. I like things to go smoothly instead.",
                            "author": "Zero2Tiger",
                            "id": "f9ki08y",
                            "parent_id": "t1_f9khobq",
                            "score": 0,
                            "created_utc": 1575400861.0,
                            "replies": [
                                {
                                    "body": "Ahhh I don't mind a touch of drama. Too much yes, but too little is boring. \n\nThen again I never really have any with my friends. The most heated debates still don't devolve in to name calling and things like that.",
                                    "author": "BigBearSD",
                                    "id": "f9kii0h",
                                    "parent_id": "t1_f9ki08y",
                                    "score": -1,
                                    "created_utc": 1575401154.0,
                                    "replies": [
                                        {
                                            "body": "Mine have people are quick to fire. I don't like drama. Too old for drama.",
                                            "author": "Zero2Tiger",
                                            "id": "f9kirqq",
                                            "parent_id": "t1_f9kii0h",
                                            "score": 1,
                                            "created_utc": 1575401309.0,
                                            "replies": [
                                                {
                                                    "body": "I am too old for drama too, but a light dusting can keep things interesting.",
                                                    "author": "BigBearSD",
                                                    "id": "f9kj9xa",
                                                    "parent_id": "t1_f9kirqq",
                                                    "score": -1,
                                                    "created_utc": 1575401607.0,
                                                    "replies": [
                                                        {
                                                            "body": "I don't like that kind of interesting. I'll just stick with my boring relationships haha.",
                                                            "author": "Zero2Tiger",
                                                            "id": "f9kjoqy",
                                                            "parent_id": "t1_f9kj9xa",
                                                            "score": 2,
                                                            "created_utc": 1575401850.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "This started out anti white then went anti everyone else haha don't know what to think of it but I read you.",
            "author": "Zero2Tiger",
            "id": "f9khjpl",
            "parent_id": "t1_f9jjbq4",
            "score": 1,
            "created_utc": 1575400586.0,
            "replies": []
        },
        {
            "body": "...",
            "author": "Jabaggs",
            "id": "f9k5kid",
            "parent_id": "t1_f9ju3cf",
            "score": -1,
            "created_utc": 1575393303.0,
            "replies": []
        },
        {
            "body": "oh how I miss those days :(",
            "author": "sbluxx",
            "id": "f9jxapq",
            "parent_id": "t1_f9ju9d5",
            "score": 4,
            "created_utc": 1575387985.0,
            "replies": []
        },
        {
            "body": "I don’t know if answering that will be against the rules. Just think a higher amount.",
            "author": "thehottubistoohawt",
            "id": "f9k6wgw",
            "parent_id": "t1_f9k6jae",
            "score": 4,
            "created_utc": 1575394127.0,
            "replies": [
                {
                    "body": "Well can you tell me where the money tree is at? Because every job I had it takes me a week to make 500 bucks",
                    "author": "Jabaggs",
                    "id": "f9k7hx4",
                    "parent_id": "t1_f9k6wgw",
                    "score": -2,
                    "created_utc": 1575394498.0,
                    "replies": [
                        {
                            "body": "You’re a SB?? \n\nIf you’re a SD, well, then you really aren’t if you are making 500 in a week at a job. \n\nI need more context to your situation to properly answer your money tree question. This will be different for everyone.",
                            "author": "thehottubistoohawt",
                            "id": "f9k7us4",
                            "parent_id": "t1_f9k7hx4",
                            "score": 5,
                            "created_utc": 1575394721.0,
                            "replies": [
                                {
                                    "body": "I’m a guy not a SB",
                                    "author": "Jabaggs",
                                    "id": "f9k8jqk",
                                    "parent_id": "t1_f9k7us4",
                                    "score": 0,
                                    "created_utc": 1575395149.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "You can ask the SDs who give their SBs over $2k a month.",
                            "author": "bsbdfw",
                            "id": "f9m098o",
                            "parent_id": "t1_f9k7hx4",
                            "score": 3,
                            "created_utc": 1575437070.0,
                            "replies": []
                        },
                        {
                            "body": "Then you’re not a sd. Which is fine. Goon tinder or pray for a hot girl to fall in. Love",
                            "author": "Lilipuss25",
                            "id": "f9mtvtg",
                            "parent_id": "t1_f9k7hx4",
                            "score": 3,
                            "created_utc": 1575470173.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Well. If they go to a stripper club..... they know they are spending money for nothing. \"The fantasy\" is nothing and some men like to show \"other men\" they have money to burn\n\nI hate giving my money away for nothing, i grew up poor but have made a great life for myself. Im self made you know?\n\nAt 20 years old... strippers happened to be fun, at 40 i am like..... why do i have to pay for the privilege of you shaking your stuff.... and i sugar date for years.... strippers are the ultimate scam artists.....\n\nThose men are probably showing off to other guys stating \"i have burn able cash\"",
            "author": "SpaceGuy1968",
            "id": "f9k07io",
            "parent_id": "t1_f9jld21",
            "score": -2,
            "created_utc": 1575389908.0,
            "replies": [
                {
                    "body": "?\nWhat is the logic of calling strippers scam artists when they aren't forcing you to pay nor selling anything under false pretenses?",
                    "author": "bsbdfw",
                    "id": "f9m0uej",
                    "parent_id": "t1_f9k07io",
                    "score": 4,
                    "created_utc": 1575437599.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "f9mfvhw",
                            "parent_id": "t1_f9m0uej",
                            "score": 3,
                            "created_utc": 1575456875.0,
                            "replies": [
                                {
                                    "body": "I grew up poor so maybe that is it",
                                    "author": "SpaceGuy1968",
                                    "id": "f9mm51z",
                                    "parent_id": "t1_f9mfvhw",
                                    "score": 0,
                                    "created_utc": 1575464345.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Well thats how i see it sorry if u dont like it \n\nIts like paying for friendship, u must like to pay for friendship? Or are u the one being paid for your time.... prostitutes and strippers always say \"my time is valuable\" when really anyone who earns hourly wages never gets rich \n\nI can afford to do whatever at this point, and i do pay for the company of beautiful young women... because i can afford it .... \n\nBut paying for nothing? So i can show off to other guys and other people i have money to burn... yes maybe im not that rich \n\n\nI grew up poor as hell. Strippers are stupid waste of time and money.... thats how i feel",
                            "author": "SpaceGuy1968",
                            "id": "f9mmkvg",
                            "parent_id": "t1_f9m0uej",
                            "score": 0,
                            "created_utc": 1575464762.0,
                            "replies": [
                                {
                                    "body": ">Well thats how i see it sorry if u dont like it\n\nI don't need an apology, my personal feelings are irrelevant nor were they shared with you. I see what you're saying but that doesn't equal to \"strippers are scammers\" just because *you* don't care for their services. It's like me saying a casino is a scam, just because I don't gamble. Clearly other people do, enjoy it & win off of it. So me calling it a scam because it doesn't suit my particular taste is **senseless**.\n\nThat is my point.",
                                    "author": "bsbdfw",
                                    "id": "f9oci50",
                                    "parent_id": "t1_f9mmkvg",
                                    "score": 2,
                                    "created_utc": 1575501310.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Very few wealthy people cannot be completely charming for a few hours.",
            "author": "SDforreal",
            "id": "f9iqzls",
            "parent_id": "t1_f9iqkq8",
            "score": 11,
            "created_utc": 1575343881.0,
            "replies": [
                {
                    "body": "At what point in wealth is it expected that someone will automatically have women falling all over him....that’s what I don’t get. I’ve known many rich not what I would consider wealthy men who don’t exactly have loads of friends, recognition or social awareness that could spend a few hundred for arm candy and conversation. I’m by no means saying it’s the norm I’ve only encountered it a couple times and really by accident.",
                    "author": "knowswhatiwant",
                    "id": "f9isfdl",
                    "parent_id": "t1_f9iqzls",
                    "score": 4,
                    "created_utc": 1575344856.0,
                    "replies": []
                },
                {
                    "body": "Most very wealthy people are not self made, so they can get away without having to be very charming.",
                    "author": null,
                    "id": "f9j9m1s",
                    "parent_id": "t1_f9iqzls",
                    "score": -2,
                    "created_utc": 1575362612.0,
                    "replies": [
                        {
                            "body": "You believe the #1 myth about millionaires.\n\nhttps://money.usnews.com/money/blogs/on-retirement/articles/7-myths-about-millionaires",
                            "author": "SDforreal",
                            "id": "f9jg5nf",
                            "parent_id": "t1_f9j9m1s",
                            "score": 2,
                            "created_utc": 1575372795.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "the point is that it’s rare and shouldn’t be the expectation. Also people lie a lot and will do anything for clout so 🤷🏽‍♀️",
            "author": "sbluxx",
            "id": "f9itq60",
            "parent_id": "t1_f9iq3pf",
            "score": 9,
            "created_utc": 1575345770.0,
            "replies": []
        },
        {
            "body": "People also survive plane crashes.",
            "author": null,
            "id": "f9j5q9l",
            "parent_id": "t1_f9iq3pf",
            "score": 4,
            "created_utc": 1575357278.0,
            "replies": []
        },
        {
            "body": "For sure, I just don't think it's fair to say anyone who says they were paid for platonic dates is lying",
            "author": "spoiledbratcat",
            "id": "f9j6rw8",
            "parent_id": "t1_f9j5g9c",
            "score": 5,
            "created_utc": 1575358628.0,
            "replies": [
                {
                    "body": "I think her point is more \"Everyone who says they are doing platonic only\" can't be telling the truth. Versus \"Everyone who says they are doing platonic is lying.\" Two different implications.",
                    "author": null,
                    "id": "f9j71zg",
                    "parent_id": "t1_f9j6rw8",
                    "score": 0,
                    "created_utc": 1575359004.0,
                    "replies": [
                        {
                            "body": "Fair enough! I just know I'd be frustrated if I told someone about a platonic date and they came back saying \"WELL MY FRIEND SAID YOU'RE A LIAR AND Y'ALL FUCKED\" 🤣",
                            "author": "spoiledbratcat",
                            "id": "f9j74d3",
                            "parent_id": "t1_f9j71zg",
                            "score": 5,
                            "created_utc": 1575359091.0,
                            "replies": [
                                {
                                    "body": "Haha. The funny thing about sugaring is that the girls who aren't fucking get viewed by non-sugar people as if they are fucking anyways.",
                                    "author": null,
                                    "id": "f9j7d3d",
                                    "parent_id": "t1_f9j74d3",
                                    "score": 1,
                                    "created_utc": 1575359418.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "thank you for making my point easier to understand! I think people were misunderstanding me lol",
                            "author": "sbluxx",
                            "id": "f9juinu",
                            "parent_id": "t1_f9j71zg",
                            "score": 1,
                            "created_utc": 1575386096.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Don’t see where you clarified that in your post lol",
            "author": "cornycatlady",
            "id": "f9jw54z",
            "parent_id": "t1_f9jw2ev",
            "score": 4,
            "created_utc": 1575387205.0,
            "replies": [
                {
                    "body": "I just edited my post since I think it's being misconstrued lol",
                    "author": "sbluxx",
                    "id": "f9jwbai",
                    "parent_id": "t1_f9jw54z",
                    "score": 1,
                    "created_utc": 1575387319.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "What",
            "author": "cornycatlady",
            "id": "f9wbyx5",
            "parent_id": "t1_f9w9onv",
            "score": 1,
            "created_utc": 1575690246.0,
            "replies": []
        },
        {
            "body": "That'll be $2,675 please. Thank you, come again.",
            "author": "TastySpermDispenser",
            "id": "f9j02o2",
            "parent_id": "t1_f9iybl7",
            "score": 1,
            "created_utc": 1575351025.0,
            "replies": []
        },
        {
            "body": "21\n\nEdit: our pillow talk had consisted of her saying that she wanted to save up for a new gaming laptop, and me suggesting a chrome book might be more prudent (filling out job applications and what not). She had downplayed the idea, then I went ahead and sent her one anyways. A gaming computer was not in the budget, but still I didn't buy the absolute cheapest one.",
            "author": "Sugarbeggar",
            "id": "f9l741m",
            "parent_id": "t1_f9jlkqk",
            "score": 1,
            "created_utc": 1575416010.0,
            "replies": []
        },
        {
            "body": "I think that she was (for a variety of reasons that I'm not going to go into too deeply).",
            "author": "Sugarbeggar",
            "id": "f9l7s9n",
            "parent_id": "t1_f9kgq4p",
            "score": 1,
            "created_utc": 1575416464.0,
            "replies": []
        },
        {
            "body": "Well that’s every relationship I’ve had before SA ... lol",
            "author": "cukierdziecko",
            "id": "f9ixepb",
            "parent_id": "t1_f9ixc9j",
            "score": 4,
            "created_utc": 1575348624.0,
            "replies": []
        },
        {
            "body": "we have a winner!!!",
            "author": "sbluxx",
            "id": "f9itjef",
            "parent_id": "t1_f9iqs2q",
            "score": 2,
            "created_utc": 1575345630.0,
            "replies": []
        },
        {
            "body": "Yepp! You can have comfort knowing the truth.",
            "author": "GSSD",
            "id": "f9jxukg",
            "parent_id": "t1_f9jxmn4",
            "score": 0,
            "created_utc": 1575388354.0,
            "replies": [
                {
                    "body": "Just because some people choose not to believe it doesn’t mean it isn’t true for some of us. I know there are a lot of people who really want to believe that an arrangement could never happen without intimacy, but it does, a lot more than you think.",
                    "author": "RealEarthAngel",
                    "id": "f9lba8n",
                    "parent_id": "t1_f9jxukg",
                    "score": 4,
                    "created_utc": 1575418894.0,
                    "replies": [
                        {
                            "body": "The standard deviation curve has a tail on either end -the outliers. They do exist. But the majority of the sugar world operates in the 75%-ile.",
                            "author": "GSSD",
                            "id": "f9lbsok",
                            "parent_id": "t1_f9lba8n",
                            "score": 0,
                            "created_utc": 1575419249.0,
                            "replies": [
                                {
                                    "body": "Well, I don’t know about all that… I’d like to believe I’m special, but I have a feeling that there are more than just a few of us👍🏼",
                                    "author": "RealEarthAngel",
                                    "id": "f9lbw6t",
                                    "parent_id": "t1_f9lbsok",
                                    "score": 3,
                                    "created_utc": 1575419316.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I knew she was playing me, u are right about it being illegal and i was being an asshole because she was doing crazy stuff with me beyond the pale. She was trying to get as much from me FOR AS LITTLE AS SHE COULD.... SHE BARELY COMMUNICATED. asked me for ALOT  and i believed she was just a con artist \n\nThat was put all wrong above and am sorry... we had met a few times, im not cheap at all and always ask if im \"doing right\" if its a pure SB M&G\n\ni sound like a total ass above, but, there is more than one M&G \n\nI totally accept these beautiful younger SBs are out of my league Looks wise and thats what i pay for many times.  Im 100% ok with all that\n\nI am sorry, that comment was dickish",
            "author": "SpaceGuy1968",
            "id": "f9l99x3",
            "parent_id": "t1_f9l8im4",
            "score": -1,
            "created_utc": 1575417493.0,
            "replies": [
                {
                    "body": "She didn't play you. She spent time with you and you paid her for it. You should be more explicit about what you want and what you want to happen in a date if you dont want it to happen again. This is an agreement that two parties go into and both have to make it clear what is expected of the other.",
                    "author": "throwaway109w",
                    "id": "f9l9mxn",
                    "parent_id": "t1_f9l99x3",
                    "score": 5,
                    "created_utc": 1575417745.0,
                    "replies": [
                        {
                            "body": "I deleted those last two u are totally correct \nI didn't see it that way until u said it that way, i was younger and i didn't know what i was doing honestly.\n\nIts funny how u can look at a situation differently at different stages of your life \n\nI didn't explicitly state what i wanted/expected",
                            "author": "SpaceGuy1968",
                            "id": "f9laufw",
                            "parent_id": "t1_f9l9mxn",
                            "score": 1,
                            "created_utc": 1575418589.0,
                            "replies": [
                                {
                                    "body": "That's fair, but remember time is time intimacy or not. It's not wrong to expect intimacy but next time say what you expect and if the other party doesnt want that then you can decide not to go ahead. Backing people into a corner and suddenly demanding sex isnt going to get you anywhere.",
                                    "author": "throwaway109w",
                                    "id": "f9lb7vi",
                                    "parent_id": "t1_f9laufw",
                                    "score": 5,
                                    "created_utc": 1575418849.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Your retraction was the dick-ish part. Your comment was real and heartfelt.",
                    "author": "yalbazzaz",
                    "id": "f9nc7ra",
                    "parent_id": "t1_f9l99x3",
                    "score": 0,
                    "created_utc": 1575481514.0,
                    "replies": [
                        {
                            "body": "I cant win can i?",
                            "author": "SpaceGuy1968",
                            "id": "f9ndkl4",
                            "parent_id": "t1_f9nc7ra",
                            "score": 2,
                            "created_utc": 1575482311.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "do you enjoy your relationship with him? as long as you both are getting something out of it, that's what matters. & are you asking why I'm a sugar baby?",
            "author": "sbluxx",
            "id": "f9ju6zl",
            "parent_id": "t1_f9j6ycq",
            "score": 1,
            "created_utc": 1575385872.0,
            "replies": []
        },
        {
            "body": "Nothin to be annoyed about.\n\nCertainly a percentage coming in under false pretenses figure out what’s up and join the regular SB pool.",
            "author": "King_of_SDs",
            "id": "f9izua8",
            "parent_id": "t1_f9iu927",
            "score": 3,
            "created_utc": 1575350802.0,
            "replies": [
                {
                    "body": "my annoyance only comes from me wanting to protect them lol it's for their own good!",
                    "author": "sbluxx",
                    "id": "f9jtsr9",
                    "parent_id": "t1_f9izua8",
                    "score": 2,
                    "created_utc": 1575385591.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I can tell you are ridiculously hot just by the way you write. I'm talking 10/10 head turning, drop dead gorgeous attractive. \n\nHow you ask?\n\nBecause that's the only explanation for why a SD hasn't pressed charges against for you murdering the English language. /s  \n\n\nIn all seriousness, sounds like you've had some amazing experiences.",
            "author": "TexasSD",
            "id": "f9ive6f",
            "parent_id": "t1_f9its3f",
            "score": -12,
            "created_utc": 1575347000.0,
            "replies": [
                {
                    "body": "Well at least I’m hot 🥵",
                    "author": "knowswhatiwant",
                    "id": "f9ivjd0",
                    "parent_id": "t1_f9ive6f",
                    "score": 7,
                    "created_utc": 1575347110.0,
                    "replies": [
                        {
                            "body": ">ridiculously hot \n\nDon't sell yourself short.",
                            "author": "TexasSD",
                            "id": "f9iwc0n",
                            "parent_id": "t1_f9ivjd0",
                            "score": 1,
                            "created_utc": 1575347721.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "There’s nothing more important than philosophy, religion, politics, etc. An unexamined life is not worth living for a human being. If a person is unable or unwilling to talk about those things, then they’re not worth talking to.",
            "author": null,
            "id": "f9ksp2x",
            "parent_id": "t1_f9khd6v",
            "score": 2,
            "created_utc": 1575407098.0,
            "replies": [
                {
                    "body": "Thanks for sharing your opinion. I just don't share it.",
                    "author": "Zero2Tiger",
                    "id": "f9lrv45",
                    "parent_id": "t1_f9ksp2x",
                    "score": 0,
                    "created_utc": 1575430404.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I have friends from completely different backgrounds and all over the political spectrum... Doesn't bother me / us at all. Then again I am able to play devils advocate for a lot of things, and can discuss things civilly without getting butthurt. I believe everyone is entitled to their opinions, and that their views on things may be different to mine.",
            "author": "BigBearSD",
            "id": "f9khobq",
            "parent_id": "t1_f9khbig",
            "score": 0,
            "created_utc": 1575400663.0,
            "replies": [
                {
                    "body": "I believe the same but most people don't so it goes insane. I like things to go smoothly instead.",
                    "author": "Zero2Tiger",
                    "id": "f9ki08y",
                    "parent_id": "t1_f9khobq",
                    "score": 0,
                    "created_utc": 1575400861.0,
                    "replies": [
                        {
                            "body": "Ahhh I don't mind a touch of drama. Too much yes, but too little is boring. \n\nThen again I never really have any with my friends. The most heated debates still don't devolve in to name calling and things like that.",
                            "author": "BigBearSD",
                            "id": "f9kii0h",
                            "parent_id": "t1_f9ki08y",
                            "score": -1,
                            "created_utc": 1575401154.0,
                            "replies": [
                                {
                                    "body": "Mine have people are quick to fire. I don't like drama. Too old for drama.",
                                    "author": "Zero2Tiger",
                                    "id": "f9kirqq",
                                    "parent_id": "t1_f9kii0h",
                                    "score": 1,
                                    "created_utc": 1575401309.0,
                                    "replies": [
                                        {
                                            "body": "I am too old for drama too, but a light dusting can keep things interesting.",
                                            "author": "BigBearSD",
                                            "id": "f9kj9xa",
                                            "parent_id": "t1_f9kirqq",
                                            "score": -1,
                                            "created_utc": 1575401607.0,
                                            "replies": [
                                                {
                                                    "body": "I don't like that kind of interesting. I'll just stick with my boring relationships haha.",
                                                    "author": "Zero2Tiger",
                                                    "id": "f9kjoqy",
                                                    "parent_id": "t1_f9kj9xa",
                                                    "score": 2,
                                                    "created_utc": 1575401850.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Well can you tell me where the money tree is at? Because every job I had it takes me a week to make 500 bucks",
            "author": "Jabaggs",
            "id": "f9k7hx4",
            "parent_id": "t1_f9k6wgw",
            "score": -2,
            "created_utc": 1575394498.0,
            "replies": [
                {
                    "body": "You’re a SB?? \n\nIf you’re a SD, well, then you really aren’t if you are making 500 in a week at a job. \n\nI need more context to your situation to properly answer your money tree question. This will be different for everyone.",
                    "author": "thehottubistoohawt",
                    "id": "f9k7us4",
                    "parent_id": "t1_f9k7hx4",
                    "score": 5,
                    "created_utc": 1575394721.0,
                    "replies": [
                        {
                            "body": "I’m a guy not a SB",
                            "author": "Jabaggs",
                            "id": "f9k8jqk",
                            "parent_id": "t1_f9k7us4",
                            "score": 0,
                            "created_utc": 1575395149.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "You can ask the SDs who give their SBs over $2k a month.",
                    "author": "bsbdfw",
                    "id": "f9m098o",
                    "parent_id": "t1_f9k7hx4",
                    "score": 3,
                    "created_utc": 1575437070.0,
                    "replies": []
                },
                {
                    "body": "Then you’re not a sd. Which is fine. Goon tinder or pray for a hot girl to fall in. Love",
                    "author": "Lilipuss25",
                    "id": "f9mtvtg",
                    "parent_id": "t1_f9k7hx4",
                    "score": 3,
                    "created_utc": 1575470173.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "?\nWhat is the logic of calling strippers scam artists when they aren't forcing you to pay nor selling anything under false pretenses?",
            "author": "bsbdfw",
            "id": "f9m0uej",
            "parent_id": "t1_f9k07io",
            "score": 4,
            "created_utc": 1575437599.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "f9mfvhw",
                    "parent_id": "t1_f9m0uej",
                    "score": 3,
                    "created_utc": 1575456875.0,
                    "replies": [
                        {
                            "body": "I grew up poor so maybe that is it",
                            "author": "SpaceGuy1968",
                            "id": "f9mm51z",
                            "parent_id": "t1_f9mfvhw",
                            "score": 0,
                            "created_utc": 1575464345.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Well thats how i see it sorry if u dont like it \n\nIts like paying for friendship, u must like to pay for friendship? Or are u the one being paid for your time.... prostitutes and strippers always say \"my time is valuable\" when really anyone who earns hourly wages never gets rich \n\nI can afford to do whatever at this point, and i do pay for the company of beautiful young women... because i can afford it .... \n\nBut paying for nothing? So i can show off to other guys and other people i have money to burn... yes maybe im not that rich \n\n\nI grew up poor as hell. Strippers are stupid waste of time and money.... thats how i feel",
                    "author": "SpaceGuy1968",
                    "id": "f9mmkvg",
                    "parent_id": "t1_f9m0uej",
                    "score": 0,
                    "created_utc": 1575464762.0,
                    "replies": [
                        {
                            "body": ">Well thats how i see it sorry if u dont like it\n\nI don't need an apology, my personal feelings are irrelevant nor were they shared with you. I see what you're saying but that doesn't equal to \"strippers are scammers\" just because *you* don't care for their services. It's like me saying a casino is a scam, just because I don't gamble. Clearly other people do, enjoy it & win off of it. So me calling it a scam because it doesn't suit my particular taste is **senseless**.\n\nThat is my point.",
                            "author": "bsbdfw",
                            "id": "f9oci50",
                            "parent_id": "t1_f9mmkvg",
                            "score": 2,
                            "created_utc": 1575501310.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "At what point in wealth is it expected that someone will automatically have women falling all over him....that’s what I don’t get. I’ve known many rich not what I would consider wealthy men who don’t exactly have loads of friends, recognition or social awareness that could spend a few hundred for arm candy and conversation. I’m by no means saying it’s the norm I’ve only encountered it a couple times and really by accident.",
            "author": "knowswhatiwant",
            "id": "f9isfdl",
            "parent_id": "t1_f9iqzls",
            "score": 4,
            "created_utc": 1575344856.0,
            "replies": []
        },
        {
            "body": "Most very wealthy people are not self made, so they can get away without having to be very charming.",
            "author": null,
            "id": "f9j9m1s",
            "parent_id": "t1_f9iqzls",
            "score": -2,
            "created_utc": 1575362612.0,
            "replies": [
                {
                    "body": "You believe the #1 myth about millionaires.\n\nhttps://money.usnews.com/money/blogs/on-retirement/articles/7-myths-about-millionaires",
                    "author": "SDforreal",
                    "id": "f9jg5nf",
                    "parent_id": "t1_f9j9m1s",
                    "score": 2,
                    "created_utc": 1575372795.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I think her point is more \"Everyone who says they are doing platonic only\" can't be telling the truth. Versus \"Everyone who says they are doing platonic is lying.\" Two different implications.",
            "author": null,
            "id": "f9j71zg",
            "parent_id": "t1_f9j6rw8",
            "score": 0,
            "created_utc": 1575359004.0,
            "replies": [
                {
                    "body": "Fair enough! I just know I'd be frustrated if I told someone about a platonic date and they came back saying \"WELL MY FRIEND SAID YOU'RE A LIAR AND Y'ALL FUCKED\" 🤣",
                    "author": "spoiledbratcat",
                    "id": "f9j74d3",
                    "parent_id": "t1_f9j71zg",
                    "score": 5,
                    "created_utc": 1575359091.0,
                    "replies": [
                        {
                            "body": "Haha. The funny thing about sugaring is that the girls who aren't fucking get viewed by non-sugar people as if they are fucking anyways.",
                            "author": null,
                            "id": "f9j7d3d",
                            "parent_id": "t1_f9j74d3",
                            "score": 1,
                            "created_utc": 1575359418.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "thank you for making my point easier to understand! I think people were misunderstanding me lol",
                    "author": "sbluxx",
                    "id": "f9juinu",
                    "parent_id": "t1_f9j71zg",
                    "score": 1,
                    "created_utc": 1575386096.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I just edited my post since I think it's being misconstrued lol",
            "author": "sbluxx",
            "id": "f9jwbai",
            "parent_id": "t1_f9jw54z",
            "score": 1,
            "created_utc": 1575387319.0,
            "replies": []
        },
        {
            "body": "Just because some people choose not to believe it doesn’t mean it isn’t true for some of us. I know there are a lot of people who really want to believe that an arrangement could never happen without intimacy, but it does, a lot more than you think.",
            "author": "RealEarthAngel",
            "id": "f9lba8n",
            "parent_id": "t1_f9jxukg",
            "score": 4,
            "created_utc": 1575418894.0,
            "replies": [
                {
                    "body": "The standard deviation curve has a tail on either end -the outliers. They do exist. But the majority of the sugar world operates in the 75%-ile.",
                    "author": "GSSD",
                    "id": "f9lbsok",
                    "parent_id": "t1_f9lba8n",
                    "score": 0,
                    "created_utc": 1575419249.0,
                    "replies": [
                        {
                            "body": "Well, I don’t know about all that… I’d like to believe I’m special, but I have a feeling that there are more than just a few of us👍🏼",
                            "author": "RealEarthAngel",
                            "id": "f9lbw6t",
                            "parent_id": "t1_f9lbsok",
                            "score": 3,
                            "created_utc": 1575419316.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "She didn't play you. She spent time with you and you paid her for it. You should be more explicit about what you want and what you want to happen in a date if you dont want it to happen again. This is an agreement that two parties go into and both have to make it clear what is expected of the other.",
            "author": "throwaway109w",
            "id": "f9l9mxn",
            "parent_id": "t1_f9l99x3",
            "score": 5,
            "created_utc": 1575417745.0,
            "replies": [
                {
                    "body": "I deleted those last two u are totally correct \nI didn't see it that way until u said it that way, i was younger and i didn't know what i was doing honestly.\n\nIts funny how u can look at a situation differently at different stages of your life \n\nI didn't explicitly state what i wanted/expected",
                    "author": "SpaceGuy1968",
                    "id": "f9laufw",
                    "parent_id": "t1_f9l9mxn",
                    "score": 1,
                    "created_utc": 1575418589.0,
                    "replies": [
                        {
                            "body": "That's fair, but remember time is time intimacy or not. It's not wrong to expect intimacy but next time say what you expect and if the other party doesnt want that then you can decide not to go ahead. Backing people into a corner and suddenly demanding sex isnt going to get you anywhere.",
                            "author": "throwaway109w",
                            "id": "f9lb7vi",
                            "parent_id": "t1_f9laufw",
                            "score": 5,
                            "created_utc": 1575418849.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Your retraction was the dick-ish part. Your comment was real and heartfelt.",
            "author": "yalbazzaz",
            "id": "f9nc7ra",
            "parent_id": "t1_f9l99x3",
            "score": 0,
            "created_utc": 1575481514.0,
            "replies": [
                {
                    "body": "I cant win can i?",
                    "author": "SpaceGuy1968",
                    "id": "f9ndkl4",
                    "parent_id": "t1_f9nc7ra",
                    "score": 2,
                    "created_utc": 1575482311.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "my annoyance only comes from me wanting to protect them lol it's for their own good!",
            "author": "sbluxx",
            "id": "f9jtsr9",
            "parent_id": "t1_f9izua8",
            "score": 2,
            "created_utc": 1575385591.0,
            "replies": []
        },
        {
            "body": "Well at least I’m hot 🥵",
            "author": "knowswhatiwant",
            "id": "f9ivjd0",
            "parent_id": "t1_f9ive6f",
            "score": 7,
            "created_utc": 1575347110.0,
            "replies": [
                {
                    "body": ">ridiculously hot \n\nDon't sell yourself short.",
                    "author": "TexasSD",
                    "id": "f9iwc0n",
                    "parent_id": "t1_f9ivjd0",
                    "score": 1,
                    "created_utc": 1575347721.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Thanks for sharing your opinion. I just don't share it.",
            "author": "Zero2Tiger",
            "id": "f9lrv45",
            "parent_id": "t1_f9ksp2x",
            "score": 0,
            "created_utc": 1575430404.0,
            "replies": []
        },
        {
            "body": "I believe the same but most people don't so it goes insane. I like things to go smoothly instead.",
            "author": "Zero2Tiger",
            "id": "f9ki08y",
            "parent_id": "t1_f9khobq",
            "score": 0,
            "created_utc": 1575400861.0,
            "replies": [
                {
                    "body": "Ahhh I don't mind a touch of drama. Too much yes, but too little is boring. \n\nThen again I never really have any with my friends. The most heated debates still don't devolve in to name calling and things like that.",
                    "author": "BigBearSD",
                    "id": "f9kii0h",
                    "parent_id": "t1_f9ki08y",
                    "score": -1,
                    "created_utc": 1575401154.0,
                    "replies": [
                        {
                            "body": "Mine have people are quick to fire. I don't like drama. Too old for drama.",
                            "author": "Zero2Tiger",
                            "id": "f9kirqq",
                            "parent_id": "t1_f9kii0h",
                            "score": 1,
                            "created_utc": 1575401309.0,
                            "replies": [
                                {
                                    "body": "I am too old for drama too, but a light dusting can keep things interesting.",
                                    "author": "BigBearSD",
                                    "id": "f9kj9xa",
                                    "parent_id": "t1_f9kirqq",
                                    "score": -1,
                                    "created_utc": 1575401607.0,
                                    "replies": [
                                        {
                                            "body": "I don't like that kind of interesting. I'll just stick with my boring relationships haha.",
                                            "author": "Zero2Tiger",
                                            "id": "f9kjoqy",
                                            "parent_id": "t1_f9kj9xa",
                                            "score": 2,
                                            "created_utc": 1575401850.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "You’re a SB?? \n\nIf you’re a SD, well, then you really aren’t if you are making 500 in a week at a job. \n\nI need more context to your situation to properly answer your money tree question. This will be different for everyone.",
            "author": "thehottubistoohawt",
            "id": "f9k7us4",
            "parent_id": "t1_f9k7hx4",
            "score": 5,
            "created_utc": 1575394721.0,
            "replies": [
                {
                    "body": "I’m a guy not a SB",
                    "author": "Jabaggs",
                    "id": "f9k8jqk",
                    "parent_id": "t1_f9k7us4",
                    "score": 0,
                    "created_utc": 1575395149.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "You can ask the SDs who give their SBs over $2k a month.",
            "author": "bsbdfw",
            "id": "f9m098o",
            "parent_id": "t1_f9k7hx4",
            "score": 3,
            "created_utc": 1575437070.0,
            "replies": []
        },
        {
            "body": "Then you’re not a sd. Which is fine. Goon tinder or pray for a hot girl to fall in. Love",
            "author": "Lilipuss25",
            "id": "f9mtvtg",
            "parent_id": "t1_f9k7hx4",
            "score": 3,
            "created_utc": 1575470173.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "f9mfvhw",
            "parent_id": "t1_f9m0uej",
            "score": 3,
            "created_utc": 1575456875.0,
            "replies": [
                {
                    "body": "I grew up poor so maybe that is it",
                    "author": "SpaceGuy1968",
                    "id": "f9mm51z",
                    "parent_id": "t1_f9mfvhw",
                    "score": 0,
                    "created_utc": 1575464345.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Well thats how i see it sorry if u dont like it \n\nIts like paying for friendship, u must like to pay for friendship? Or are u the one being paid for your time.... prostitutes and strippers always say \"my time is valuable\" when really anyone who earns hourly wages never gets rich \n\nI can afford to do whatever at this point, and i do pay for the company of beautiful young women... because i can afford it .... \n\nBut paying for nothing? So i can show off to other guys and other people i have money to burn... yes maybe im not that rich \n\n\nI grew up poor as hell. Strippers are stupid waste of time and money.... thats how i feel",
            "author": "SpaceGuy1968",
            "id": "f9mmkvg",
            "parent_id": "t1_f9m0uej",
            "score": 0,
            "created_utc": 1575464762.0,
            "replies": [
                {
                    "body": ">Well thats how i see it sorry if u dont like it\n\nI don't need an apology, my personal feelings are irrelevant nor were they shared with you. I see what you're saying but that doesn't equal to \"strippers are scammers\" just because *you* don't care for their services. It's like me saying a casino is a scam, just because I don't gamble. Clearly other people do, enjoy it & win off of it. So me calling it a scam because it doesn't suit my particular taste is **senseless**.\n\nThat is my point.",
                    "author": "bsbdfw",
                    "id": "f9oci50",
                    "parent_id": "t1_f9mmkvg",
                    "score": 2,
                    "created_utc": 1575501310.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "You believe the #1 myth about millionaires.\n\nhttps://money.usnews.com/money/blogs/on-retirement/articles/7-myths-about-millionaires",
            "author": "SDforreal",
            "id": "f9jg5nf",
            "parent_id": "t1_f9j9m1s",
            "score": 2,
            "created_utc": 1575372795.0,
            "replies": []
        },
        {
            "body": "Fair enough! I just know I'd be frustrated if I told someone about a platonic date and they came back saying \"WELL MY FRIEND SAID YOU'RE A LIAR AND Y'ALL FUCKED\" 🤣",
            "author": "spoiledbratcat",
            "id": "f9j74d3",
            "parent_id": "t1_f9j71zg",
            "score": 5,
            "created_utc": 1575359091.0,
            "replies": [
                {
                    "body": "Haha. The funny thing about sugaring is that the girls who aren't fucking get viewed by non-sugar people as if they are fucking anyways.",
                    "author": null,
                    "id": "f9j7d3d",
                    "parent_id": "t1_f9j74d3",
                    "score": 1,
                    "created_utc": 1575359418.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "thank you for making my point easier to understand! I think people were misunderstanding me lol",
            "author": "sbluxx",
            "id": "f9juinu",
            "parent_id": "t1_f9j71zg",
            "score": 1,
            "created_utc": 1575386096.0,
            "replies": []
        },
        {
            "body": "The standard deviation curve has a tail on either end -the outliers. They do exist. But the majority of the sugar world operates in the 75%-ile.",
            "author": "GSSD",
            "id": "f9lbsok",
            "parent_id": "t1_f9lba8n",
            "score": 0,
            "created_utc": 1575419249.0,
            "replies": [
                {
                    "body": "Well, I don’t know about all that… I’d like to believe I’m special, but I have a feeling that there are more than just a few of us👍🏼",
                    "author": "RealEarthAngel",
                    "id": "f9lbw6t",
                    "parent_id": "t1_f9lbsok",
                    "score": 3,
                    "created_utc": 1575419316.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I deleted those last two u are totally correct \nI didn't see it that way until u said it that way, i was younger and i didn't know what i was doing honestly.\n\nIts funny how u can look at a situation differently at different stages of your life \n\nI didn't explicitly state what i wanted/expected",
            "author": "SpaceGuy1968",
            "id": "f9laufw",
            "parent_id": "t1_f9l9mxn",
            "score": 1,
            "created_utc": 1575418589.0,
            "replies": [
                {
                    "body": "That's fair, but remember time is time intimacy or not. It's not wrong to expect intimacy but next time say what you expect and if the other party doesnt want that then you can decide not to go ahead. Backing people into a corner and suddenly demanding sex isnt going to get you anywhere.",
                    "author": "throwaway109w",
                    "id": "f9lb7vi",
                    "parent_id": "t1_f9laufw",
                    "score": 5,
                    "created_utc": 1575418849.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I cant win can i?",
            "author": "SpaceGuy1968",
            "id": "f9ndkl4",
            "parent_id": "t1_f9nc7ra",
            "score": 2,
            "created_utc": 1575482311.0,
            "replies": []
        },
        {
            "body": ">ridiculously hot \n\nDon't sell yourself short.",
            "author": "TexasSD",
            "id": "f9iwc0n",
            "parent_id": "t1_f9ivjd0",
            "score": 1,
            "created_utc": 1575347721.0,
            "replies": []
        },
        {
            "body": "Ahhh I don't mind a touch of drama. Too much yes, but too little is boring. \n\nThen again I never really have any with my friends. The most heated debates still don't devolve in to name calling and things like that.",
            "author": "BigBearSD",
            "id": "f9kii0h",
            "parent_id": "t1_f9ki08y",
            "score": -1,
            "created_utc": 1575401154.0,
            "replies": [
                {
                    "body": "Mine have people are quick to fire. I don't like drama. Too old for drama.",
                    "author": "Zero2Tiger",
                    "id": "f9kirqq",
                    "parent_id": "t1_f9kii0h",
                    "score": 1,
                    "created_utc": 1575401309.0,
                    "replies": [
                        {
                            "body": "I am too old for drama too, but a light dusting can keep things interesting.",
                            "author": "BigBearSD",
                            "id": "f9kj9xa",
                            "parent_id": "t1_f9kirqq",
                            "score": -1,
                            "created_utc": 1575401607.0,
                            "replies": [
                                {
                                    "body": "I don't like that kind of interesting. I'll just stick with my boring relationships haha.",
                                    "author": "Zero2Tiger",
                                    "id": "f9kjoqy",
                                    "parent_id": "t1_f9kj9xa",
                                    "score": 2,
                                    "created_utc": 1575401850.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I’m a guy not a SB",
            "author": "Jabaggs",
            "id": "f9k8jqk",
            "parent_id": "t1_f9k7us4",
            "score": 0,
            "created_utc": 1575395149.0,
            "replies": []
        },
        {
            "body": "I grew up poor so maybe that is it",
            "author": "SpaceGuy1968",
            "id": "f9mm51z",
            "parent_id": "t1_f9mfvhw",
            "score": 0,
            "created_utc": 1575464345.0,
            "replies": []
        },
        {
            "body": ">Well thats how i see it sorry if u dont like it\n\nI don't need an apology, my personal feelings are irrelevant nor were they shared with you. I see what you're saying but that doesn't equal to \"strippers are scammers\" just because *you* don't care for their services. It's like me saying a casino is a scam, just because I don't gamble. Clearly other people do, enjoy it & win off of it. So me calling it a scam because it doesn't suit my particular taste is **senseless**.\n\nThat is my point.",
            "author": "bsbdfw",
            "id": "f9oci50",
            "parent_id": "t1_f9mmkvg",
            "score": 2,
            "created_utc": 1575501310.0,
            "replies": []
        },
        {
            "body": "Haha. The funny thing about sugaring is that the girls who aren't fucking get viewed by non-sugar people as if they are fucking anyways.",
            "author": null,
            "id": "f9j7d3d",
            "parent_id": "t1_f9j74d3",
            "score": 1,
            "created_utc": 1575359418.0,
            "replies": []
        },
        {
            "body": "Well, I don’t know about all that… I’d like to believe I’m special, but I have a feeling that there are more than just a few of us👍🏼",
            "author": "RealEarthAngel",
            "id": "f9lbw6t",
            "parent_id": "t1_f9lbsok",
            "score": 3,
            "created_utc": 1575419316.0,
            "replies": []
        },
        {
            "body": "That's fair, but remember time is time intimacy or not. It's not wrong to expect intimacy but next time say what you expect and if the other party doesnt want that then you can decide not to go ahead. Backing people into a corner and suddenly demanding sex isnt going to get you anywhere.",
            "author": "throwaway109w",
            "id": "f9lb7vi",
            "parent_id": "t1_f9laufw",
            "score": 5,
            "created_utc": 1575418849.0,
            "replies": []
        },
        {
            "body": "Mine have people are quick to fire. I don't like drama. Too old for drama.",
            "author": "Zero2Tiger",
            "id": "f9kirqq",
            "parent_id": "t1_f9kii0h",
            "score": 1,
            "created_utc": 1575401309.0,
            "replies": [
                {
                    "body": "I am too old for drama too, but a light dusting can keep things interesting.",
                    "author": "BigBearSD",
                    "id": "f9kj9xa",
                    "parent_id": "t1_f9kirqq",
                    "score": -1,
                    "created_utc": 1575401607.0,
                    "replies": [
                        {
                            "body": "I don't like that kind of interesting. I'll just stick with my boring relationships haha.",
                            "author": "Zero2Tiger",
                            "id": "f9kjoqy",
                            "parent_id": "t1_f9kj9xa",
                            "score": 2,
                            "created_utc": 1575401850.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I am too old for drama too, but a light dusting can keep things interesting.",
            "author": "BigBearSD",
            "id": "f9kj9xa",
            "parent_id": "t1_f9kirqq",
            "score": -1,
            "created_utc": 1575401607.0,
            "replies": [
                {
                    "body": "I don't like that kind of interesting. I'll just stick with my boring relationships haha.",
                    "author": "Zero2Tiger",
                    "id": "f9kjoqy",
                    "parent_id": "t1_f9kj9xa",
                    "score": 2,
                    "created_utc": 1575401850.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I don't like that kind of interesting. I'll just stick with my boring relationships haha.",
            "author": "Zero2Tiger",
            "id": "f9kjoqy",
            "parent_id": "t1_f9kj9xa",
            "score": 2,
            "created_utc": 1575401850.0,
            "replies": []
        }
    ]
}