{
    "title": "Kim Jong Kook to sue Greg Doucette, rumour mongers and hate commenters",
    "post_id": "qwmv98",
    "post_url": "https://www.reddit.com/r/runningman/comments/qwmv98/kim_jong_kook_to_sue_greg_doucette_rumour_mongers/",
    "author": "kukumarq",
    "body": "",
    "url": "https://youtu.be/a4YnAL42BCQ",
    "score": 254,
    "upvote_ratio": 0.97,
    "created_utc": 1637231204.0,
    "num_comments": 50,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "Well this has escalated in a slightly unexpected way",
            "author": "chromelogan",
            "id": "hl3u8gu",
            "parent_id": "t3_qwmv98",
            "score": 77,
            "created_utc": 1637232505.0,
            "replies": []
        },
        {
            "body": "Why is Greg even complaining about KJK? Has he never seen The Rock's body?\n\nOr he's just doing this for clout?",
            "author": "PotatoBulletGun",
            "id": "hl3tonw",
            "parent_id": "t3_qwmv98",
            "score": 83,
            "created_utc": 1637232057.0,
            "replies": [
                {
                    "body": "This is Greg Doucette's gimmick. Controversy garners views. It's such a parasitic way to gain money and clout when he could create content focused on uplifting members of the fitness community instead of creating content aligned with the discourse controversial in many fitness circles: whether they take PEDs or not. Man picks the low hanging fruit every time.",
                    "author": "yungdocph",
                    "id": "hl3ua3m",
                    "parent_id": "t1_hl3tonw",
                    "score": 90,
                    "created_utc": 1637232542.0,
                    "replies": [
                        {
                            "body": "So he's known for doing this kind of tactic",
                            "author": "PotatoBulletGun",
                            "id": "hl3v1fk",
                            "parent_id": "t1_hl3ua3m",
                            "score": 25,
                            "created_utc": 1637233144.0,
                            "replies": [
                                {
                                    "body": "Absolutely. It's his full-time job to create and advertise his content. Man does spread awareness about the usage and safety of PEDs - he is a known user and supporter of it, which is one of the positive things about Greg. But he is more concerned with proving his view-points than respecting the autonomy of other people.\n\nThe main argument, the thread with which this controversy lives on is kinda ridiculous. KJK has been completely transparent and inviting but Greg continues to insist that he could not achieve that physique unless A. PEDs or B. He is extremely lucky. One is testable and can interpreted by a medical professional, the other is... how does he plan to scientifically prove that KJK is a 'one in a million freak'?\n\nI should note there is nothing inherently wrong with PED use. An individual sets their own physique/performance goals and may use whatever ethical AND safe means to achieve it.\n\nIf a person wants to be out about his PED use, they will do it themselves. If a person says they don't use PEDs and goes to great lengths to prove it with KJK's level of transparency, it is more mature for Greg to, if he must, err on the side of believing KJK. Greg is an advocate for safety which I respect but these sorts of things sow greater disunity for health and fitness advocacy than not.\n\nIf he changed his approach, both he and KJK could have been two fitness influencers having a fantastic discussion on safe pursuit of better health and fitness\\*, and that's what their interaction could have been remembered for. Instead, he went for the low hanging fruit: \"natty or not?\" lol.\n\n\\*Edit: rephrased, spelling, grammar",
                                    "author": "yungdocph",
                                    "id": "hl45zuc",
                                    "parent_id": "t1_hl3v1fk",
                                    "score": 57,
                                    "created_utc": 1637240406.0,
                                    "replies": [
                                        {
                                            "body": "So, If I'm understanding this correctly, he is still insisting that KJK has used/is using steroids or some medicine(sorry, I'm not familiar with the terms) even though KJK doesnt?\n\nEdit: added a mew sentence",
                                            "author": "PotatoBulletGun",
                                            "id": "hl4cj4m",
                                            "parent_id": "t1_hl45zuc",
                                            "score": 14,
                                            "created_utc": 1637243796.0,
                                            "replies": [
                                                {
                                                    "body": "Oh sorry I should have elaborated! [Yes, he is.](https://www.youtube.com/watch?v=fFgsJBiM6vs)\n\n\\*I'll break down some terms and simplify the science that is being tossed around in this issue:\n\n**Steroids are important/necessary hormones** that naturally occur in all our bodies. There are different types of steroids, but the steroids here refer to \"anabolic\" steroids, and the effect particular to anabolic steroids is muscle building.\n\nThere are different types of [exogenous (or, from outside the body)](https://www.medicalnewstoday.com/articles/246373) steroids and different ways to administer it.\n\nPED stands for \"***performance enhancing*** drug\". In the fitness (and greater sports) community, **PEDs refer to the use of exogenous steroids for the objective of better results after exercise**: what this looks like is increased muscle gain in a short period of time, decreased recovery time after a session, etc.\n\nThe type of PED Coach Greg is accusing Kim Jong Kook of using is hormone/testosterone replacement therapy, or HRT/TRT. **Testosterone is a naturally occuring steroid in our bodies, but as we get older, males naturally produce less testosterone**. [In more extreme cases, a doctor may prescribe this therapy to their patient.](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC6406807/)\n\nIn this case, Greg's claims are that KJK's physique is due either to TRT, or that KJK is just a one-in-a-million genetic 'freak of nature'. I don't know where Greg gets his \"this physique is one-in-a-million rare\" statistic from, however. Seems anecdotal and scientifically unfounded.\n\nGreg does continue to insist KJK is on this \"HRT/TRT\" due to KJK's test results which indicate that his testosterone levels are on the higher end. This is the piece of evidence that Greg uses to argue that KJK is in fact using HRT. **Central to Greg's argument is that it's either due to HRT, or it's 'one-in-a-million' that any person would have a testosterone reading that high.** (again, is his source anecdotal or scientific? Or is it a fixation on his belief?). That's the single thread.\n\nHope that clears things up!\n\nFor more information and numbers, [here is a nice article from the Korea Herald that describes what is the usual testosterone range of a man and what KJK tested.](http://www.koreaherald.com/view.php?ud=20211115000342)\n\nI'll report it here:\n\nThe average figure is 2.7 - 10.7 nanograms per milliliter; KJK tested recently for 8.38 nanograms per milliliter at the age of 45.\n\n\\*Edit: Elaborated",
                                                    "author": "yungdocph",
                                                    "id": "hl4kvqd",
                                                    "parent_id": "t1_hl4cj4m",
                                                    "score": 30,
                                                    "created_utc": 1637247591.0,
                                                    "replies": [
                                                        {
                                                            "body": "So does his \"insisted views\" about KJK have proof? Like medical records that KJK actually underwent such therapy",
                                                            "author": "PotatoBulletGun",
                                                            "id": "hl4ljll",
                                                            "parent_id": "t1_hl4kvqd",
                                                            "score": 6,
                                                            "created_utc": 1637247874.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Nah. Greg can't produce that, so he can't prove it. This is why the results from KJK's testosterone test is the evidence he's using to continue pushing. \n\nBecause from the test results Greg can make claims like \"it's 99% TRT and 1% luck\". This claim is just a claim and stays a claim. On the other hand, Greg himself says it's impossible to test whether it's just genetic luck: an argument that is safe and convenient for Greg. \n\nIt's really better that KJK ends this ridiculous controversy than to feed into that ridiculousness haha.",
                                                                    "author": "yungdocph",
                                                                    "id": "hl4mjiy",
                                                                    "parent_id": "t1_hl4ljll",
                                                                    "score": 22,
                                                                    "created_utc": 1637248295.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "What else do you expect out of a convicted drug smuggler? Easy money over integrity -- actions already proven in a Nova Scotia court.",
                                    "author": "SuddenBag",
                                    "id": "hl5pwnb",
                                    "parent_id": "t1_hl3v1fk",
                                    "score": 5,
                                    "created_utc": 1637263881.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "This KJK issue aside, people like Greg who call out fake naturals are actually doing some good. The fitness industry is full of fake nattys who sell people on a dream that you can look like them with just hard work and the right supplements that they of course shill. Fitness enthusiasts are slowly waking up to this, that obviously they'll never look like their favorite bodybuilder or The Rock without juice. These Natty or Not videos educate people on what's achievable naturally and what's not.",
                            "author": "merchseller",
                            "id": "hl4q9sn",
                            "parent_id": "t1_hl3ua3m",
                            "score": 9,
                            "created_utc": 1637249843.0,
                            "replies": [
                                {
                                    "body": "In that sense, yes 100% it's a good thing to prevent false expectations especially for newbies starting out. In this niche, it's also good to educate for those who are interested in using, which Greg does from time to time.\n\nBut the glaring problem with the \"natty or not\"; \"is this person using or not\" approach reveals itself in the KJK issue. Sure, people within the fitness community may have generally more accepting attitudes towards the use of PEDs but outside it's still rather stigmatized.\n\nThe natty/not videos can be said to educate those who are primed for it. But the niche is the fitness community. Outside of it, it looks as if one is taking aim at the other with the objective of diminishing the other's achievments.\n\nOne thing I wish Greg does instead of 'call-outs' is to dive deeper towards the people he calls out. Form genuine connections with these people and learn their stories instead of firing claims like mortar shells and if one hits, then great. Maybe he can understand why people say they do/don't do steroids instead of speculation. And if someone is a PED user, he might be able to highlight their reasons behind PED use to achieve their goals, with a reduced possibility of stigmatizing them. But that's not his format. \n\nI stopped watching Greg because I felt that his videos sometimes boundaried on tabloidism. It's quick and easy to speculate. A deeper investigation is more challenging but more rewarding. Everyone is free to educate, but it's difficult to be an effective educator.\n\nBut this is now off topic. Sorry mods!",
                                    "author": "yungdocph",
                                    "id": "hl54gsc",
                                    "parent_id": "t1_hl4q9sn",
                                    "score": 23,
                                    "created_utc": 1637255469.0,
                                    "replies": [
                                        {
                                            "body": "just have to say your comments on this post are excellent and informative",
                                            "author": "Denethorsmukbang",
                                            "id": "hl610o0",
                                            "parent_id": "t1_hl54gsc",
                                            "score": 6,
                                            "created_utc": 1637268251.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "He literally has a series of videos called Natty or Not, full of Western celebrities and gym personalities.\n\nYou seriously think he knew beforehand this would cause such a shit storm?",
                    "author": "MeSmeshFruit",
                    "id": "hl48t0o",
                    "parent_id": "t1_hl3tonw",
                    "score": 15,
                    "created_utc": 1637241905.0,
                    "replies": []
                },
                {
                    "body": "Wait wtf are you saying the rock is natural?",
                    "author": "BK_317",
                    "id": "hlhg7yj",
                    "parent_id": "t1_hl3tonw",
                    "score": 1,
                    "created_utc": 1637479612.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I would have sued Greg long ago if I were KJK. The dude is just building up so much toxicity and really pushing it.",
            "author": "rubricksx",
            "id": "hl3whni",
            "parent_id": "t3_qwmv98",
            "score": 91,
            "created_utc": 1637234255.0,
            "replies": [
                {
                    "body": "Why not sue the media company’s that twisted Greg’s word as well and made this into a really big issue??",
                    "author": "boombampopop",
                    "id": "hl4vsmp",
                    "parent_id": "t1_hl3whni",
                    "score": 19,
                    "created_utc": 1637252047.0,
                    "replies": []
                },
                {
                    "body": "The media companies are in the wrong. Greg simply shared his opinions.",
                    "author": "universityofpreme",
                    "id": "hl5imwc",
                    "parent_id": "t1_hl3whni",
                    "score": -1,
                    "created_utc": 1637260997.0,
                    "replies": [
                        {
                            "body": "Perhaps, but Greg is constantly trying to discredit KJK by breaking down his videos and 'debunking' his claims, heck he even 'debunked' the doctor's claims. Sure, he might be right, but the way he is pushing his opinion is so damn bad. He is literally just shoving his opinion down your throat and basically telling people: \"I AM RIGHT\". He always says he is just stating his opinion but if that's the case is there a need to discredit KJK?",
                            "author": "rubricksx",
                            "id": "hl8eiei",
                            "parent_id": "t1_hl5imwc",
                            "score": 7,
                            "created_utc": 1637310999.0,
                            "replies": []
                        },
                        {
                            "body": "Maybe the first time he could get away with the media taking his words out of context but he still refused to and insists KJK was taking HRT even when KJK shut him off with his doping test. If Greg is so confident, then why back down and delete his videos now. I think its more interesting how he claim KJK has a 'one in a million body' when he probably doesn't even have any statistics to back that up from the start.",
                            "author": "joant07012",
                            "id": "hlj6wfk",
                            "parent_id": "t1_hl5imwc",
                            "score": 1,
                            "created_utc": 1637516298.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I think KJK is an anomaly at his age but I also believe he's natural.\n\nThis a guy who drinks chicken breast protein shakes and has been transparent about not eating crap food over the years including ramen. He's obviously eased up over time and has given into eating more junk food but that's because he's spent YEARS eating clean.\n\nI am a firm believer that if I ever saw KJK in real life - he would be a regular sized gym-bro, maybe even smaller. Last year he went swimming with YSC and JSJ on My Little Old Boy and his body was about what you'd expect from a regular gym goer who takes cares of himself.",
            "author": "kbx24",
            "id": "hl4ot6c",
            "parent_id": "t3_qwmv98",
            "score": 51,
            "created_utc": 1637249247.0,
            "replies": [
                {
                    "body": "And of course build over 20 years of working out and eating clean.\n\nIt is not like he gain all the muscle within 2 years or something.",
                    "author": "MoreThenAverage",
                    "id": "hl696o9",
                    "parent_id": "t1_hl4ot6c",
                    "score": 23,
                    "created_utc": 1637271517.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Jesus,  \n\nEverybody here knows KJK is good at literally everything. The man about to win at lawsuits lmfao",
            "author": "SpoonAtAGunFight",
            "id": "hl4c40r",
            "parent_id": "t3_qwmv98",
            "score": 48,
            "created_utc": 1637243587.0,
            "replies": []
        },
        {
            "body": "Heheheheh KJK about time",
            "author": "sapphirestrong",
            "id": "hl3vq5b",
            "parent_id": "t3_qwmv98",
            "score": 26,
            "created_utc": 1637233681.0,
            "replies": []
        },
        {
            "body": "Strange because KJK is honestly not THAT big.. like I’ve never even thought that he might be using something",
            "author": "rhks92",
            "id": "hl7s1lt",
            "parent_id": "t3_qwmv98",
            "score": 10,
            "created_utc": 1637296237.0,
            "replies": []
        },
        {
            "body": "Wow. So how will this proceed? Different country and all.",
            "author": "NobleArch",
            "id": "hl3xtkb",
            "parent_id": "t3_qwmv98",
            "score": 24,
            "created_utc": 1637235251.0,
            "replies": [
                {
                    "body": "They explained it in the video.",
                    "author": "kukumarq",
                    "id": "hl4167y",
                    "parent_id": "t1_hl3xtkb",
                    "score": 19,
                    "created_utc": 1637237542.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Nice! good to hear",
            "author": "plus_ultra_9090",
            "id": "hl44tfe",
            "parent_id": "t3_qwmv98",
            "score": 12,
            "created_utc": 1637239745.0,
            "replies": []
        },
        {
            "body": "I read like 2 comments on this, barely grasp the situation, but i'm already tired of it. How people have energy to accuse someone based on nothing is beyond me...",
            "author": "LasDen",
            "id": "hl4y59d",
            "parent_id": "t3_qwmv98",
            "score": 12,
            "created_utc": 1637252990.0,
            "replies": []
        },
        {
            "body": "I truly wonder why a lot of Westerners are ignorances in this types of issue.\n\nI don't care if the accuser is a professional or whatever.You yourself took steroids to enhanced yourself,so how is it that someone so called professional can easily make a claim 'oh he took steroids'.\n\nYou are not a doctor,so you can't make a blind judgement without knowing KJK background.Yes the doctor that KJK visited was shocked by KJK high testosterone,but that doesn't mean that KJK took illegal substances.It is very complex,so you can't just make a blind judgement.\n\nAlso different cultures.What is accepted in US may not be accepted in Asian countries.Even my country don't allow to take illegal substances.You can get banned from any competition.So he need to understand the cultural differences.\n\nI don't know how to judged body size,but even from his FO days,KJK was already huge.\n\nI just disliked when so called western influencers & their so called 'fans' are ignorances & think whatever these people said are right.i don't care if he is world champion of whatever.You have to understand KJK in depth before you make an accusation.",
            "author": null,
            "id": "hl4m0xh",
            "parent_id": "t3_qwmv98",
            "score": 16,
            "created_utc": 1637248079.0,
            "replies": []
        },
        {
            "body": "Good and we know he’ll win it.",
            "author": "real_highlight_reel",
            "id": "hl5w3ay",
            "parent_id": "t3_qwmv98",
            "score": 3,
            "created_utc": 1637266303.0,
            "replies": []
        },
        {
            "body": "Due to the contentious nature of this topic or high activity/interest in this thread, we would like to remind everyone to remain calm & civil in their responses and to refrain from rule-breaking behavior. This subreddit heavily regulates against toxicity. As Rule 5 states,\n\n> Users must not engage in toxicity, flaming, toxic-baiting, and drama-baiting. E.g., discriminating against or disparaging any RM member or staff, fan wars of any kind, and referring to opposing fan bases in a negative light to elicit a negative response.\n\nPlease review our subreddit's rules found on the sidebar or [on our rules page](https://www.reddit.com/r/runningman/wiki/rules).\n\nThis notice does **not** indicate that the moderator performed a punitive function. However, violations of our subreddit's rules are subject to the appropriate disciplinary process at the moderator's discretion.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/runningman) if you have any questions or concerns.*",
            "author": "AutoModerator",
            "id": "hl4dby9",
            "parent_id": "t3_qwmv98",
            "score": 5,
            "created_utc": 1637244189.0,
            "replies": []
        },
        {
            "body": "Can someone explain what this is about? I don't really watch his videos so I'm a bit out of the loop.",
            "author": "JoJoDeath",
            "id": "hl3t6dp",
            "parent_id": "t3_qwmv98",
            "score": 3,
            "created_utc": 1637231641.0,
            "replies": [
                {
                    "body": "I personally follow both Greg and KJK so heres my take on what happened: Greg did his usual thing where he shares his opinion on whether high profile individuals (this time it was KJK) have ever taken PEDs or not. It's his whole schtick, preaching realistic expectations to his viewers in their pursuit of fitness/bodybuilding.\n\nIMO the reason this situation has blown up is because of cultural differences. Korea is of course not as progressive as the US/Canada when it comes to their opinion of PED's, steroids, drugs etc and because of this the Korean media/public has perceived Gregs opinion (that KJK has likely taken PED's at some point in his life) as an attack against KJK's character and this is pretty much where the controversy comes from, the level of response from the media/public/KJK himself pretty much says it all.\n\nGreg has done tons of these kind of videos on other famous public figures (Hollywood, famous social media influencers and so on) and none of those videos have garnered a response quite like the one we're seeing now lol",
                    "author": "Jellyking12",
                    "id": "hl3vbx8",
                    "parent_id": "t1_hl3t6dp",
                    "score": 47,
                    "created_utc": 1637233375.0,
                    "replies": [
                        {
                            "body": "i’d agree, its more of cultural differences. I see those kinds of videos usually and i would say it was nothing new. Though i think where Greg can be at fault is when after the initial statement by KJK, he continued to double down on his accusations and pushed it even further. I believe that’s when it pushed KJk in a corner to take this response. Remember that korean media is not kind to controversies surrounding their celebrities. If just left unaddressed, these rumors/accusations could grow and lead to KJK losing sponsorships and shows. And that’s where i understand KJK was responding the way he is now with the videos and tests to clear his name of all this. If he don’t respond properly to these allegations, he’ll be the one who gets crucified in korean media.",
                            "author": "maxxstone",
                            "id": "hl456in",
                            "parent_id": "t1_hl3vbx8",
                            "score": 49,
                            "created_utc": 1637239949.0,
                            "replies": []
                        },
                        {
                            "body": "Thanks for providing a level-headed and non-biased summary of the situation. \n\nAnd yeah my first thought when this blew up was the cultural differences. It reminded me of when Epik High’s Tablo was accused of fraud for lying about graduating from Stanford and it became a HUGE thing in Korea and even people in the U.S knew about it. I’d hate for this to get to that lv",
                            "author": "DookiesNCream",
                            "id": "hl3zgk5",
                            "parent_id": "t1_hl3vbx8",
                            "score": 17,
                            "created_utc": 1637236392.0,
                            "replies": []
                        },
                        {
                            "body": "> Korea is of course not as progressive as the US/Canada when it comes to their opinion of PED's\n\nI'm not Korean so I don't have a reason to defend their \"not as progressive-ness\" when it comes to PEDs, but the USA is hypocritical when it comes to it. The MLB is practically the only big league that actively cracks down on it, the rest of the big leagues like the NBA, NFL, boxing, etc. have their athletes regularly taking them. So I don't think it's progressiveness, but USA turning a blind eye in the name of competition and entertainment. Otherwise the fans would be rioting against the MLB for their crackdown on PEDs. Progressiveness is if it's accepted out in the open.\n\nI don't know much about the NHL to be saying stuff, but I wouldn't be surprised either. I don't think they're taking stuff though, just 3 years ago or something an accountant subbed in for a goalie and stopped several field goals by a top team.",
                            "author": "lolminna",
                            "id": "hl46gfa",
                            "parent_id": "t1_hl3vbx8",
                            "score": 12,
                            "created_utc": 1637240659.0,
                            "replies": []
                        },
                        {
                            "body": "Greg just lack of information and culture IMO. Like you can do \"opinion\" whatever you want but you can't expect people to follow your \"opinion\". He def not knowing that Jong Kook is dedicate his body health since his younger age. Instead that bitching his opinion more hoping he apologize for not knowing culture diff and Jong Kook background that the only way to end this but nope he will defend himself more.  \nTbh not hating him for lack knowledge but more to he say \"They also claimed that I’m potentially cancelling him or ruining his career but the opposite is happening he’s getting more attention more views on social media more followers on YouTube and so they’re trying to use his career being in jeopardy against me when in fact I’ve quite literally helped him to gain more popularity.\"",
                            "author": "jail_is_just_a_room",
                            "id": "hl40mdl",
                            "parent_id": "t1_hl3vbx8",
                            "score": 2,
                            "created_utc": 1637237186.0,
                            "replies": []
                        },
                        {
                            "body": "He also did one on the famous S.Korean Olympic boxer and health trainer - Hwang Chul-soon- he deleted that one too :3",
                            "author": "the_neverending_rain",
                            "id": "hl8bops",
                            "parent_id": "t1_hl3vbx8",
                            "score": 1,
                            "created_utc": 1637308792.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "I don't watch his videos too. Lol gym videos are not just for me but from what I know, this man accused KJK of taking steriods for years \"because no natural  can maintain a figure like that\", as the accuser said.",
                    "author": "glassesinglamour",
                    "id": "hl3tjxs",
                    "parent_id": "t1_hl3t6dp",
                    "score": 12,
                    "created_utc": 1637231947.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Haha better find a good rich to hide under. He can share it with Kwang Soo and Se Chan 🤣🤣\n\nThat lawyer was unexpectedly funny. The guilty will go to the promised place and find new friends lol. \n\nOn another note, why would you get in trouble for saying subverting true? Can divertir explain better?",
            "author": "OneWandToSaveThemAll",
            "id": "hl6rb8n",
            "parent_id": "t3_qwmv98",
            "score": -1,
            "created_utc": 1637279188.0,
            "replies": []
        },
        {
            "body": "So after researching this controversy, this is what I think:\n\n\\- Greg has no animosity towards KJK  \n\\- Greg sounds very knowledgeable about fitness and steroids  \n\\- KJK's doctor probably wasn't a specialized doctor  \n\\- I don't believe Greg is jealous  \n\\- However, as a Youtuber he should be used to getting hate comments. It's a sad reality. He's getting too wound up over this.  \n\\- I don't believe KJK uses drugs  \n\\- Clearly Korea doesn't believe it either  \n\\- So I think he shouldn't make a big deal out of this. Suing Greg is going too far.  \n\\- Greg says the blood results doesn't prove a thing. And that makes sense. But it suggests that KJK *could* be taking something. Do I think he does? Of course not. But this could damage his image. Not Greg's analysis, but KJK's response",
            "author": null,
            "id": "hl44mkk",
            "parent_id": "t3_qwmv98",
            "score": -32,
            "created_utc": 1637239635.0,
            "replies": [
                {
                    "body": "The hate comments aren't just from YouTube though? As a long time fan, let me break this down.\n\n\\- When Jong Kook did his army service, there were a ton of celebrities who were accused of trying to evade service and unfortunately Jong Kook happened to be swept up into it. Bad timing.\n\n\\- At the time, his doctor appeared on tv and tried to clear it up and say \"this person's x-ray should be used in medical books\" to try and emphasise how bad his back injury is.\n\n\\- Throughout the years, he's tried to explain his side of things on shows, through social media and through various statements. But his haters have always shut their eyes and ears and will always spam \"go to the army!\"\n\nIn today's video, he emphasised that he will stop going easy on those people now.\n\nHe's just finally doing what his fans have been begging him to do for years.",
                    "author": "kukumarq",
                    "id": "hl4ancf",
                    "parent_id": "t1_hl44mkk",
                    "score": 33,
                    "created_utc": 1637242855.0,
                    "replies": [
                        {
                            "body": ">The hate comments aren't just from YouTube though?\n\nI mean the hate comments Greg is getting. If he can't handle it he should quit Youtubing",
                            "author": null,
                            "id": "hl4bazw",
                            "parent_id": "t1_hl4ancf",
                            "score": -12,
                            "created_utc": 1637243187.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Hello, r/runningman I am a huge fan of both Running Man and bodybuilding. I couldn't help but notice that many of you have been misinformed by the media about the steroid accusation against KJK. Greg Doucette, a well-known bodybuilder/YouTuber made a video on KJK stating his opinion on whether KJK is \"natural\" or not. Many of you seem to be under the impression that Greg bet one million dollars that KJK abuses steroids. This is simply not true. In this video, Greg points out that KJK has a very good physique, especially for his age. He concludes that if he had to take a GUESS and his life or a million dollars was on the line, he would say that KJK takes HRT. HRT stands for hormone replacement therapy and can be prescribed by doctors to reduce the risk of hearts disease, diabetes, etc in older men as their testosterone levels decline. Greg never once CLAIMED KJK \"abuses\" steroids or that KJK is on steroids at all. It was just his opinion. This opinion is not shocking or disrespectful at all as KJK's physique is very hard to achieve at such an age. In the bodybuilding world steroids are common and someone who looks as good as KJK is often not natural. With all this in mind, it makes sense why one might think KJK may have taken steroids. Greg never bet a million dollars nor did Greg dismiss the hard training and dieting that KJK does. People on steroids actually tend to work harder as they are that committed to that lifestyle.",
            "author": "universityofpreme",
            "id": "hl5ihm4",
            "parent_id": "t3_qwmv98",
            "score": -18,
            "created_utc": 1637260939.0,
            "replies": [
                {
                    "body": "Yet in his video DID say he'd bet a million pounds that KJK is on HRT. That made it cross from an 'opinion' to an outright challenge whether he was being serious or not. He can't cry now if KJK is responding, especially as he seems to be doubling down on his stance instead of withdrawing his claims.",
                    "author": "Hanabi1993",
                    "id": "hl5sor8",
                    "parent_id": "t1_hl5ihm4",
                    "score": 14,
                    "created_utc": 1637264976.0,
                    "replies": []
                },
                {
                    "body": "An opinion that is proved wrong, is not an opinion, it is a lie. In court, it is defamation if it can be proved the lie is harmful to the person. Greg lied",
                    "author": "netgames2000",
                    "id": "hl5n51l",
                    "parent_id": "t1_hl5ihm4",
                    "score": 15,
                    "created_utc": 1637262783.0,
                    "replies": [
                        {
                            "body": "1. Greg mentioned it is extremely difficult for a person the same age as KJK to continue building muscle at the rate KJK does. This is a fact. \"Testosterone levels reach their peak around age 18 or 19 before declining throughout the remainder of adulthood.\" (Healthline).\n\nTherefore Greg BELIEVES it is highly likely that KJK has used or uses HRT. \n\n2. The test results cannot be seen as hard \"proof\"  that KJK is a lifetime natural. There are too many factors and one test during one specific time does not prove much. Please watch this video. https://youtu.be/TTpPwH1y5F0?t=945",
                            "author": "universityofpreme",
                            "id": "hl5pswt",
                            "parent_id": "t1_hl5n51l",
                            "score": -5,
                            "created_utc": 1637263840.0,
                            "replies": [
                                {
                                    "body": "\"Is Kim Jong Kook Natural? Of course he's not natural\"\n\nThis is not an opinion. This is a statement of fact with no proof. If all you want is more proof than what KJK already provided, I'm sure KJK will provide more. However, it is a lie and defamation if the court rules as such.\n\nhttps://www.youtube.com/watch?v=FxcKSIqCJmQ",
                                    "author": "netgames2000",
                                    "id": "hl5qkre",
                                    "parent_id": "t1_hl5pswt",
                                    "score": 22,
                                    "created_utc": 1637264145.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Good on him. I don’t know this Greg guy until now. Even if he had legit suspicions he should shut up after seeing the evidence.",
            "author": "shell2020",
            "id": "hlv4qeh",
            "parent_id": "t3_qwmv98",
            "score": 1,
            "created_utc": 1637729942.0,
            "replies": []
        },
        {
            "body": "This is Greg Doucette's gimmick. Controversy garners views. It's such a parasitic way to gain money and clout when he could create content focused on uplifting members of the fitness community instead of creating content aligned with the discourse controversial in many fitness circles: whether they take PEDs or not. Man picks the low hanging fruit every time.",
            "author": "yungdocph",
            "id": "hl3ua3m",
            "parent_id": "t1_hl3tonw",
            "score": 90,
            "created_utc": 1637232542.0,
            "replies": [
                {
                    "body": "So he's known for doing this kind of tactic",
                    "author": "PotatoBulletGun",
                    "id": "hl3v1fk",
                    "parent_id": "t1_hl3ua3m",
                    "score": 25,
                    "created_utc": 1637233144.0,
                    "replies": [
                        {
                            "body": "Absolutely. It's his full-time job to create and advertise his content. Man does spread awareness about the usage and safety of PEDs - he is a known user and supporter of it, which is one of the positive things about Greg. But he is more concerned with proving his view-points than respecting the autonomy of other people.\n\nThe main argument, the thread with which this controversy lives on is kinda ridiculous. KJK has been completely transparent and inviting but Greg continues to insist that he could not achieve that physique unless A. PEDs or B. He is extremely lucky. One is testable and can interpreted by a medical professional, the other is... how does he plan to scientifically prove that KJK is a 'one in a million freak'?\n\nI should note there is nothing inherently wrong with PED use. An individual sets their own physique/performance goals and may use whatever ethical AND safe means to achieve it.\n\nIf a person wants to be out about his PED use, they will do it themselves. If a person says they don't use PEDs and goes to great lengths to prove it with KJK's level of transparency, it is more mature for Greg to, if he must, err on the side of believing KJK. Greg is an advocate for safety which I respect but these sorts of things sow greater disunity for health and fitness advocacy than not.\n\nIf he changed his approach, both he and KJK could have been two fitness influencers having a fantastic discussion on safe pursuit of better health and fitness\\*, and that's what their interaction could have been remembered for. Instead, he went for the low hanging fruit: \"natty or not?\" lol.\n\n\\*Edit: rephrased, spelling, grammar",
                            "author": "yungdocph",
                            "id": "hl45zuc",
                            "parent_id": "t1_hl3v1fk",
                            "score": 57,
                            "created_utc": 1637240406.0,
                            "replies": [
                                {
                                    "body": "So, If I'm understanding this correctly, he is still insisting that KJK has used/is using steroids or some medicine(sorry, I'm not familiar with the terms) even though KJK doesnt?\n\nEdit: added a mew sentence",
                                    "author": "PotatoBulletGun",
                                    "id": "hl4cj4m",
                                    "parent_id": "t1_hl45zuc",
                                    "score": 14,
                                    "created_utc": 1637243796.0,
                                    "replies": [
                                        {
                                            "body": "Oh sorry I should have elaborated! [Yes, he is.](https://www.youtube.com/watch?v=fFgsJBiM6vs)\n\n\\*I'll break down some terms and simplify the science that is being tossed around in this issue:\n\n**Steroids are important/necessary hormones** that naturally occur in all our bodies. There are different types of steroids, but the steroids here refer to \"anabolic\" steroids, and the effect particular to anabolic steroids is muscle building.\n\nThere are different types of [exogenous (or, from outside the body)](https://www.medicalnewstoday.com/articles/246373) steroids and different ways to administer it.\n\nPED stands for \"***performance enhancing*** drug\". In the fitness (and greater sports) community, **PEDs refer to the use of exogenous steroids for the objective of better results after exercise**: what this looks like is increased muscle gain in a short period of time, decreased recovery time after a session, etc.\n\nThe type of PED Coach Greg is accusing Kim Jong Kook of using is hormone/testosterone replacement therapy, or HRT/TRT. **Testosterone is a naturally occuring steroid in our bodies, but as we get older, males naturally produce less testosterone**. [In more extreme cases, a doctor may prescribe this therapy to their patient.](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC6406807/)\n\nIn this case, Greg's claims are that KJK's physique is due either to TRT, or that KJK is just a one-in-a-million genetic 'freak of nature'. I don't know where Greg gets his \"this physique is one-in-a-million rare\" statistic from, however. Seems anecdotal and scientifically unfounded.\n\nGreg does continue to insist KJK is on this \"HRT/TRT\" due to KJK's test results which indicate that his testosterone levels are on the higher end. This is the piece of evidence that Greg uses to argue that KJK is in fact using HRT. **Central to Greg's argument is that it's either due to HRT, or it's 'one-in-a-million' that any person would have a testosterone reading that high.** (again, is his source anecdotal or scientific? Or is it a fixation on his belief?). That's the single thread.\n\nHope that clears things up!\n\nFor more information and numbers, [here is a nice article from the Korea Herald that describes what is the usual testosterone range of a man and what KJK tested.](http://www.koreaherald.com/view.php?ud=20211115000342)\n\nI'll report it here:\n\nThe average figure is 2.7 - 10.7 nanograms per milliliter; KJK tested recently for 8.38 nanograms per milliliter at the age of 45.\n\n\\*Edit: Elaborated",
                                            "author": "yungdocph",
                                            "id": "hl4kvqd",
                                            "parent_id": "t1_hl4cj4m",
                                            "score": 30,
                                            "created_utc": 1637247591.0,
                                            "replies": [
                                                {
                                                    "body": "So does his \"insisted views\" about KJK have proof? Like medical records that KJK actually underwent such therapy",
                                                    "author": "PotatoBulletGun",
                                                    "id": "hl4ljll",
                                                    "parent_id": "t1_hl4kvqd",
                                                    "score": 6,
                                                    "created_utc": 1637247874.0,
                                                    "replies": [
                                                        {
                                                            "body": "Nah. Greg can't produce that, so he can't prove it. This is why the results from KJK's testosterone test is the evidence he's using to continue pushing. \n\nBecause from the test results Greg can make claims like \"it's 99% TRT and 1% luck\". This claim is just a claim and stays a claim. On the other hand, Greg himself says it's impossible to test whether it's just genetic luck: an argument that is safe and convenient for Greg. \n\nIt's really better that KJK ends this ridiculous controversy than to feed into that ridiculousness haha.",
                                                            "author": "yungdocph",
                                                            "id": "hl4mjiy",
                                                            "parent_id": "t1_hl4ljll",
                                                            "score": 22,
                                                            "created_utc": 1637248295.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "What else do you expect out of a convicted drug smuggler? Easy money over integrity -- actions already proven in a Nova Scotia court.",
                            "author": "SuddenBag",
                            "id": "hl5pwnb",
                            "parent_id": "t1_hl3v1fk",
                            "score": 5,
                            "created_utc": 1637263881.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "This KJK issue aside, people like Greg who call out fake naturals are actually doing some good. The fitness industry is full of fake nattys who sell people on a dream that you can look like them with just hard work and the right supplements that they of course shill. Fitness enthusiasts are slowly waking up to this, that obviously they'll never look like their favorite bodybuilder or The Rock without juice. These Natty or Not videos educate people on what's achievable naturally and what's not.",
                    "author": "merchseller",
                    "id": "hl4q9sn",
                    "parent_id": "t1_hl3ua3m",
                    "score": 9,
                    "created_utc": 1637249843.0,
                    "replies": [
                        {
                            "body": "In that sense, yes 100% it's a good thing to prevent false expectations especially for newbies starting out. In this niche, it's also good to educate for those who are interested in using, which Greg does from time to time.\n\nBut the glaring problem with the \"natty or not\"; \"is this person using or not\" approach reveals itself in the KJK issue. Sure, people within the fitness community may have generally more accepting attitudes towards the use of PEDs but outside it's still rather stigmatized.\n\nThe natty/not videos can be said to educate those who are primed for it. But the niche is the fitness community. Outside of it, it looks as if one is taking aim at the other with the objective of diminishing the other's achievments.\n\nOne thing I wish Greg does instead of 'call-outs' is to dive deeper towards the people he calls out. Form genuine connections with these people and learn their stories instead of firing claims like mortar shells and if one hits, then great. Maybe he can understand why people say they do/don't do steroids instead of speculation. And if someone is a PED user, he might be able to highlight their reasons behind PED use to achieve their goals, with a reduced possibility of stigmatizing them. But that's not his format. \n\nI stopped watching Greg because I felt that his videos sometimes boundaried on tabloidism. It's quick and easy to speculate. A deeper investigation is more challenging but more rewarding. Everyone is free to educate, but it's difficult to be an effective educator.\n\nBut this is now off topic. Sorry mods!",
                            "author": "yungdocph",
                            "id": "hl54gsc",
                            "parent_id": "t1_hl4q9sn",
                            "score": 23,
                            "created_utc": 1637255469.0,
                            "replies": [
                                {
                                    "body": "just have to say your comments on this post are excellent and informative",
                                    "author": "Denethorsmukbang",
                                    "id": "hl610o0",
                                    "parent_id": "t1_hl54gsc",
                                    "score": 6,
                                    "created_utc": 1637268251.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "He literally has a series of videos called Natty or Not, full of Western celebrities and gym personalities.\n\nYou seriously think he knew beforehand this would cause such a shit storm?",
            "author": "MeSmeshFruit",
            "id": "hl48t0o",
            "parent_id": "t1_hl3tonw",
            "score": 15,
            "created_utc": 1637241905.0,
            "replies": []
        },
        {
            "body": "Wait wtf are you saying the rock is natural?",
            "author": "BK_317",
            "id": "hlhg7yj",
            "parent_id": "t1_hl3tonw",
            "score": 1,
            "created_utc": 1637479612.0,
            "replies": []
        },
        {
            "body": "Why not sue the media company’s that twisted Greg’s word as well and made this into a really big issue??",
            "author": "boombampopop",
            "id": "hl4vsmp",
            "parent_id": "t1_hl3whni",
            "score": 19,
            "created_utc": 1637252047.0,
            "replies": []
        },
        {
            "body": "The media companies are in the wrong. Greg simply shared his opinions.",
            "author": "universityofpreme",
            "id": "hl5imwc",
            "parent_id": "t1_hl3whni",
            "score": -1,
            "created_utc": 1637260997.0,
            "replies": [
                {
                    "body": "Perhaps, but Greg is constantly trying to discredit KJK by breaking down his videos and 'debunking' his claims, heck he even 'debunked' the doctor's claims. Sure, he might be right, but the way he is pushing his opinion is so damn bad. He is literally just shoving his opinion down your throat and basically telling people: \"I AM RIGHT\". He always says he is just stating his opinion but if that's the case is there a need to discredit KJK?",
                    "author": "rubricksx",
                    "id": "hl8eiei",
                    "parent_id": "t1_hl5imwc",
                    "score": 7,
                    "created_utc": 1637310999.0,
                    "replies": []
                },
                {
                    "body": "Maybe the first time he could get away with the media taking his words out of context but he still refused to and insists KJK was taking HRT even when KJK shut him off with his doping test. If Greg is so confident, then why back down and delete his videos now. I think its more interesting how he claim KJK has a 'one in a million body' when he probably doesn't even have any statistics to back that up from the start.",
                    "author": "joant07012",
                    "id": "hlj6wfk",
                    "parent_id": "t1_hl5imwc",
                    "score": 1,
                    "created_utc": 1637516298.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "And of course build over 20 years of working out and eating clean.\n\nIt is not like he gain all the muscle within 2 years or something.",
            "author": "MoreThenAverage",
            "id": "hl696o9",
            "parent_id": "t1_hl4ot6c",
            "score": 23,
            "created_utc": 1637271517.0,
            "replies": []
        },
        {
            "body": "They explained it in the video.",
            "author": "kukumarq",
            "id": "hl4167y",
            "parent_id": "t1_hl3xtkb",
            "score": 19,
            "created_utc": 1637237542.0,
            "replies": []
        },
        {
            "body": "I personally follow both Greg and KJK so heres my take on what happened: Greg did his usual thing where he shares his opinion on whether high profile individuals (this time it was KJK) have ever taken PEDs or not. It's his whole schtick, preaching realistic expectations to his viewers in their pursuit of fitness/bodybuilding.\n\nIMO the reason this situation has blown up is because of cultural differences. Korea is of course not as progressive as the US/Canada when it comes to their opinion of PED's, steroids, drugs etc and because of this the Korean media/public has perceived Gregs opinion (that KJK has likely taken PED's at some point in his life) as an attack against KJK's character and this is pretty much where the controversy comes from, the level of response from the media/public/KJK himself pretty much says it all.\n\nGreg has done tons of these kind of videos on other famous public figures (Hollywood, famous social media influencers and so on) and none of those videos have garnered a response quite like the one we're seeing now lol",
            "author": "Jellyking12",
            "id": "hl3vbx8",
            "parent_id": "t1_hl3t6dp",
            "score": 47,
            "created_utc": 1637233375.0,
            "replies": [
                {
                    "body": "i’d agree, its more of cultural differences. I see those kinds of videos usually and i would say it was nothing new. Though i think where Greg can be at fault is when after the initial statement by KJK, he continued to double down on his accusations and pushed it even further. I believe that’s when it pushed KJk in a corner to take this response. Remember that korean media is not kind to controversies surrounding their celebrities. If just left unaddressed, these rumors/accusations could grow and lead to KJK losing sponsorships and shows. And that’s where i understand KJK was responding the way he is now with the videos and tests to clear his name of all this. If he don’t respond properly to these allegations, he’ll be the one who gets crucified in korean media.",
                    "author": "maxxstone",
                    "id": "hl456in",
                    "parent_id": "t1_hl3vbx8",
                    "score": 49,
                    "created_utc": 1637239949.0,
                    "replies": []
                },
                {
                    "body": "Thanks for providing a level-headed and non-biased summary of the situation. \n\nAnd yeah my first thought when this blew up was the cultural differences. It reminded me of when Epik High’s Tablo was accused of fraud for lying about graduating from Stanford and it became a HUGE thing in Korea and even people in the U.S knew about it. I’d hate for this to get to that lv",
                    "author": "DookiesNCream",
                    "id": "hl3zgk5",
                    "parent_id": "t1_hl3vbx8",
                    "score": 17,
                    "created_utc": 1637236392.0,
                    "replies": []
                },
                {
                    "body": "> Korea is of course not as progressive as the US/Canada when it comes to their opinion of PED's\n\nI'm not Korean so I don't have a reason to defend their \"not as progressive-ness\" when it comes to PEDs, but the USA is hypocritical when it comes to it. The MLB is practically the only big league that actively cracks down on it, the rest of the big leagues like the NBA, NFL, boxing, etc. have their athletes regularly taking them. So I don't think it's progressiveness, but USA turning a blind eye in the name of competition and entertainment. Otherwise the fans would be rioting against the MLB for their crackdown on PEDs. Progressiveness is if it's accepted out in the open.\n\nI don't know much about the NHL to be saying stuff, but I wouldn't be surprised either. I don't think they're taking stuff though, just 3 years ago or something an accountant subbed in for a goalie and stopped several field goals by a top team.",
                    "author": "lolminna",
                    "id": "hl46gfa",
                    "parent_id": "t1_hl3vbx8",
                    "score": 12,
                    "created_utc": 1637240659.0,
                    "replies": []
                },
                {
                    "body": "Greg just lack of information and culture IMO. Like you can do \"opinion\" whatever you want but you can't expect people to follow your \"opinion\". He def not knowing that Jong Kook is dedicate his body health since his younger age. Instead that bitching his opinion more hoping he apologize for not knowing culture diff and Jong Kook background that the only way to end this but nope he will defend himself more.  \nTbh not hating him for lack knowledge but more to he say \"They also claimed that I’m potentially cancelling him or ruining his career but the opposite is happening he’s getting more attention more views on social media more followers on YouTube and so they’re trying to use his career being in jeopardy against me when in fact I’ve quite literally helped him to gain more popularity.\"",
                    "author": "jail_is_just_a_room",
                    "id": "hl40mdl",
                    "parent_id": "t1_hl3vbx8",
                    "score": 2,
                    "created_utc": 1637237186.0,
                    "replies": []
                },
                {
                    "body": "He also did one on the famous S.Korean Olympic boxer and health trainer - Hwang Chul-soon- he deleted that one too :3",
                    "author": "the_neverending_rain",
                    "id": "hl8bops",
                    "parent_id": "t1_hl3vbx8",
                    "score": 1,
                    "created_utc": 1637308792.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I don't watch his videos too. Lol gym videos are not just for me but from what I know, this man accused KJK of taking steriods for years \"because no natural  can maintain a figure like that\", as the accuser said.",
            "author": "glassesinglamour",
            "id": "hl3tjxs",
            "parent_id": "t1_hl3t6dp",
            "score": 12,
            "created_utc": 1637231947.0,
            "replies": []
        },
        {
            "body": "The hate comments aren't just from YouTube though? As a long time fan, let me break this down.\n\n\\- When Jong Kook did his army service, there were a ton of celebrities who were accused of trying to evade service and unfortunately Jong Kook happened to be swept up into it. Bad timing.\n\n\\- At the time, his doctor appeared on tv and tried to clear it up and say \"this person's x-ray should be used in medical books\" to try and emphasise how bad his back injury is.\n\n\\- Throughout the years, he's tried to explain his side of things on shows, through social media and through various statements. But his haters have always shut their eyes and ears and will always spam \"go to the army!\"\n\nIn today's video, he emphasised that he will stop going easy on those people now.\n\nHe's just finally doing what his fans have been begging him to do for years.",
            "author": "kukumarq",
            "id": "hl4ancf",
            "parent_id": "t1_hl44mkk",
            "score": 33,
            "created_utc": 1637242855.0,
            "replies": [
                {
                    "body": ">The hate comments aren't just from YouTube though?\n\nI mean the hate comments Greg is getting. If he can't handle it he should quit Youtubing",
                    "author": null,
                    "id": "hl4bazw",
                    "parent_id": "t1_hl4ancf",
                    "score": -12,
                    "created_utc": 1637243187.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yet in his video DID say he'd bet a million pounds that KJK is on HRT. That made it cross from an 'opinion' to an outright challenge whether he was being serious or not. He can't cry now if KJK is responding, especially as he seems to be doubling down on his stance instead of withdrawing his claims.",
            "author": "Hanabi1993",
            "id": "hl5sor8",
            "parent_id": "t1_hl5ihm4",
            "score": 14,
            "created_utc": 1637264976.0,
            "replies": []
        },
        {
            "body": "An opinion that is proved wrong, is not an opinion, it is a lie. In court, it is defamation if it can be proved the lie is harmful to the person. Greg lied",
            "author": "netgames2000",
            "id": "hl5n51l",
            "parent_id": "t1_hl5ihm4",
            "score": 15,
            "created_utc": 1637262783.0,
            "replies": [
                {
                    "body": "1. Greg mentioned it is extremely difficult for a person the same age as KJK to continue building muscle at the rate KJK does. This is a fact. \"Testosterone levels reach their peak around age 18 or 19 before declining throughout the remainder of adulthood.\" (Healthline).\n\nTherefore Greg BELIEVES it is highly likely that KJK has used or uses HRT. \n\n2. The test results cannot be seen as hard \"proof\"  that KJK is a lifetime natural. There are too many factors and one test during one specific time does not prove much. Please watch this video. https://youtu.be/TTpPwH1y5F0?t=945",
                    "author": "universityofpreme",
                    "id": "hl5pswt",
                    "parent_id": "t1_hl5n51l",
                    "score": -5,
                    "created_utc": 1637263840.0,
                    "replies": [
                        {
                            "body": "\"Is Kim Jong Kook Natural? Of course he's not natural\"\n\nThis is not an opinion. This is a statement of fact with no proof. If all you want is more proof than what KJK already provided, I'm sure KJK will provide more. However, it is a lie and defamation if the court rules as such.\n\nhttps://www.youtube.com/watch?v=FxcKSIqCJmQ",
                            "author": "netgames2000",
                            "id": "hl5qkre",
                            "parent_id": "t1_hl5pswt",
                            "score": 22,
                            "created_utc": 1637264145.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "So he's known for doing this kind of tactic",
            "author": "PotatoBulletGun",
            "id": "hl3v1fk",
            "parent_id": "t1_hl3ua3m",
            "score": 25,
            "created_utc": 1637233144.0,
            "replies": [
                {
                    "body": "Absolutely. It's his full-time job to create and advertise his content. Man does spread awareness about the usage and safety of PEDs - he is a known user and supporter of it, which is one of the positive things about Greg. But he is more concerned with proving his view-points than respecting the autonomy of other people.\n\nThe main argument, the thread with which this controversy lives on is kinda ridiculous. KJK has been completely transparent and inviting but Greg continues to insist that he could not achieve that physique unless A. PEDs or B. He is extremely lucky. One is testable and can interpreted by a medical professional, the other is... how does he plan to scientifically prove that KJK is a 'one in a million freak'?\n\nI should note there is nothing inherently wrong with PED use. An individual sets their own physique/performance goals and may use whatever ethical AND safe means to achieve it.\n\nIf a person wants to be out about his PED use, they will do it themselves. If a person says they don't use PEDs and goes to great lengths to prove it with KJK's level of transparency, it is more mature for Greg to, if he must, err on the side of believing KJK. Greg is an advocate for safety which I respect but these sorts of things sow greater disunity for health and fitness advocacy than not.\n\nIf he changed his approach, both he and KJK could have been two fitness influencers having a fantastic discussion on safe pursuit of better health and fitness\\*, and that's what their interaction could have been remembered for. Instead, he went for the low hanging fruit: \"natty or not?\" lol.\n\n\\*Edit: rephrased, spelling, grammar",
                    "author": "yungdocph",
                    "id": "hl45zuc",
                    "parent_id": "t1_hl3v1fk",
                    "score": 57,
                    "created_utc": 1637240406.0,
                    "replies": [
                        {
                            "body": "So, If I'm understanding this correctly, he is still insisting that KJK has used/is using steroids or some medicine(sorry, I'm not familiar with the terms) even though KJK doesnt?\n\nEdit: added a mew sentence",
                            "author": "PotatoBulletGun",
                            "id": "hl4cj4m",
                            "parent_id": "t1_hl45zuc",
                            "score": 14,
                            "created_utc": 1637243796.0,
                            "replies": [
                                {
                                    "body": "Oh sorry I should have elaborated! [Yes, he is.](https://www.youtube.com/watch?v=fFgsJBiM6vs)\n\n\\*I'll break down some terms and simplify the science that is being tossed around in this issue:\n\n**Steroids are important/necessary hormones** that naturally occur in all our bodies. There are different types of steroids, but the steroids here refer to \"anabolic\" steroids, and the effect particular to anabolic steroids is muscle building.\n\nThere are different types of [exogenous (or, from outside the body)](https://www.medicalnewstoday.com/articles/246373) steroids and different ways to administer it.\n\nPED stands for \"***performance enhancing*** drug\". In the fitness (and greater sports) community, **PEDs refer to the use of exogenous steroids for the objective of better results after exercise**: what this looks like is increased muscle gain in a short period of time, decreased recovery time after a session, etc.\n\nThe type of PED Coach Greg is accusing Kim Jong Kook of using is hormone/testosterone replacement therapy, or HRT/TRT. **Testosterone is a naturally occuring steroid in our bodies, but as we get older, males naturally produce less testosterone**. [In more extreme cases, a doctor may prescribe this therapy to their patient.](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC6406807/)\n\nIn this case, Greg's claims are that KJK's physique is due either to TRT, or that KJK is just a one-in-a-million genetic 'freak of nature'. I don't know where Greg gets his \"this physique is one-in-a-million rare\" statistic from, however. Seems anecdotal and scientifically unfounded.\n\nGreg does continue to insist KJK is on this \"HRT/TRT\" due to KJK's test results which indicate that his testosterone levels are on the higher end. This is the piece of evidence that Greg uses to argue that KJK is in fact using HRT. **Central to Greg's argument is that it's either due to HRT, or it's 'one-in-a-million' that any person would have a testosterone reading that high.** (again, is his source anecdotal or scientific? Or is it a fixation on his belief?). That's the single thread.\n\nHope that clears things up!\n\nFor more information and numbers, [here is a nice article from the Korea Herald that describes what is the usual testosterone range of a man and what KJK tested.](http://www.koreaherald.com/view.php?ud=20211115000342)\n\nI'll report it here:\n\nThe average figure is 2.7 - 10.7 nanograms per milliliter; KJK tested recently for 8.38 nanograms per milliliter at the age of 45.\n\n\\*Edit: Elaborated",
                                    "author": "yungdocph",
                                    "id": "hl4kvqd",
                                    "parent_id": "t1_hl4cj4m",
                                    "score": 30,
                                    "created_utc": 1637247591.0,
                                    "replies": [
                                        {
                                            "body": "So does his \"insisted views\" about KJK have proof? Like medical records that KJK actually underwent such therapy",
                                            "author": "PotatoBulletGun",
                                            "id": "hl4ljll",
                                            "parent_id": "t1_hl4kvqd",
                                            "score": 6,
                                            "created_utc": 1637247874.0,
                                            "replies": [
                                                {
                                                    "body": "Nah. Greg can't produce that, so he can't prove it. This is why the results from KJK's testosterone test is the evidence he's using to continue pushing. \n\nBecause from the test results Greg can make claims like \"it's 99% TRT and 1% luck\". This claim is just a claim and stays a claim. On the other hand, Greg himself says it's impossible to test whether it's just genetic luck: an argument that is safe and convenient for Greg. \n\nIt's really better that KJK ends this ridiculous controversy than to feed into that ridiculousness haha.",
                                                    "author": "yungdocph",
                                                    "id": "hl4mjiy",
                                                    "parent_id": "t1_hl4ljll",
                                                    "score": 22,
                                                    "created_utc": 1637248295.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "What else do you expect out of a convicted drug smuggler? Easy money over integrity -- actions already proven in a Nova Scotia court.",
                    "author": "SuddenBag",
                    "id": "hl5pwnb",
                    "parent_id": "t1_hl3v1fk",
                    "score": 5,
                    "created_utc": 1637263881.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "This KJK issue aside, people like Greg who call out fake naturals are actually doing some good. The fitness industry is full of fake nattys who sell people on a dream that you can look like them with just hard work and the right supplements that they of course shill. Fitness enthusiasts are slowly waking up to this, that obviously they'll never look like their favorite bodybuilder or The Rock without juice. These Natty or Not videos educate people on what's achievable naturally and what's not.",
            "author": "merchseller",
            "id": "hl4q9sn",
            "parent_id": "t1_hl3ua3m",
            "score": 9,
            "created_utc": 1637249843.0,
            "replies": [
                {
                    "body": "In that sense, yes 100% it's a good thing to prevent false expectations especially for newbies starting out. In this niche, it's also good to educate for those who are interested in using, which Greg does from time to time.\n\nBut the glaring problem with the \"natty or not\"; \"is this person using or not\" approach reveals itself in the KJK issue. Sure, people within the fitness community may have generally more accepting attitudes towards the use of PEDs but outside it's still rather stigmatized.\n\nThe natty/not videos can be said to educate those who are primed for it. But the niche is the fitness community. Outside of it, it looks as if one is taking aim at the other with the objective of diminishing the other's achievments.\n\nOne thing I wish Greg does instead of 'call-outs' is to dive deeper towards the people he calls out. Form genuine connections with these people and learn their stories instead of firing claims like mortar shells and if one hits, then great. Maybe he can understand why people say they do/don't do steroids instead of speculation. And if someone is a PED user, he might be able to highlight their reasons behind PED use to achieve their goals, with a reduced possibility of stigmatizing them. But that's not his format. \n\nI stopped watching Greg because I felt that his videos sometimes boundaried on tabloidism. It's quick and easy to speculate. A deeper investigation is more challenging but more rewarding. Everyone is free to educate, but it's difficult to be an effective educator.\n\nBut this is now off topic. Sorry mods!",
                    "author": "yungdocph",
                    "id": "hl54gsc",
                    "parent_id": "t1_hl4q9sn",
                    "score": 23,
                    "created_utc": 1637255469.0,
                    "replies": [
                        {
                            "body": "just have to say your comments on this post are excellent and informative",
                            "author": "Denethorsmukbang",
                            "id": "hl610o0",
                            "parent_id": "t1_hl54gsc",
                            "score": 6,
                            "created_utc": 1637268251.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Perhaps, but Greg is constantly trying to discredit KJK by breaking down his videos and 'debunking' his claims, heck he even 'debunked' the doctor's claims. Sure, he might be right, but the way he is pushing his opinion is so damn bad. He is literally just shoving his opinion down your throat and basically telling people: \"I AM RIGHT\". He always says he is just stating his opinion but if that's the case is there a need to discredit KJK?",
            "author": "rubricksx",
            "id": "hl8eiei",
            "parent_id": "t1_hl5imwc",
            "score": 7,
            "created_utc": 1637310999.0,
            "replies": []
        },
        {
            "body": "Maybe the first time he could get away with the media taking his words out of context but he still refused to and insists KJK was taking HRT even when KJK shut him off with his doping test. If Greg is so confident, then why back down and delete his videos now. I think its more interesting how he claim KJK has a 'one in a million body' when he probably doesn't even have any statistics to back that up from the start.",
            "author": "joant07012",
            "id": "hlj6wfk",
            "parent_id": "t1_hl5imwc",
            "score": 1,
            "created_utc": 1637516298.0,
            "replies": []
        },
        {
            "body": "i’d agree, its more of cultural differences. I see those kinds of videos usually and i would say it was nothing new. Though i think where Greg can be at fault is when after the initial statement by KJK, he continued to double down on his accusations and pushed it even further. I believe that’s when it pushed KJk in a corner to take this response. Remember that korean media is not kind to controversies surrounding their celebrities. If just left unaddressed, these rumors/accusations could grow and lead to KJK losing sponsorships and shows. And that’s where i understand KJK was responding the way he is now with the videos and tests to clear his name of all this. If he don’t respond properly to these allegations, he’ll be the one who gets crucified in korean media.",
            "author": "maxxstone",
            "id": "hl456in",
            "parent_id": "t1_hl3vbx8",
            "score": 49,
            "created_utc": 1637239949.0,
            "replies": []
        },
        {
            "body": "Thanks for providing a level-headed and non-biased summary of the situation. \n\nAnd yeah my first thought when this blew up was the cultural differences. It reminded me of when Epik High’s Tablo was accused of fraud for lying about graduating from Stanford and it became a HUGE thing in Korea and even people in the U.S knew about it. I’d hate for this to get to that lv",
            "author": "DookiesNCream",
            "id": "hl3zgk5",
            "parent_id": "t1_hl3vbx8",
            "score": 17,
            "created_utc": 1637236392.0,
            "replies": []
        },
        {
            "body": "> Korea is of course not as progressive as the US/Canada when it comes to their opinion of PED's\n\nI'm not Korean so I don't have a reason to defend their \"not as progressive-ness\" when it comes to PEDs, but the USA is hypocritical when it comes to it. The MLB is practically the only big league that actively cracks down on it, the rest of the big leagues like the NBA, NFL, boxing, etc. have their athletes regularly taking them. So I don't think it's progressiveness, but USA turning a blind eye in the name of competition and entertainment. Otherwise the fans would be rioting against the MLB for their crackdown on PEDs. Progressiveness is if it's accepted out in the open.\n\nI don't know much about the NHL to be saying stuff, but I wouldn't be surprised either. I don't think they're taking stuff though, just 3 years ago or something an accountant subbed in for a goalie and stopped several field goals by a top team.",
            "author": "lolminna",
            "id": "hl46gfa",
            "parent_id": "t1_hl3vbx8",
            "score": 12,
            "created_utc": 1637240659.0,
            "replies": []
        },
        {
            "body": "Greg just lack of information and culture IMO. Like you can do \"opinion\" whatever you want but you can't expect people to follow your \"opinion\". He def not knowing that Jong Kook is dedicate his body health since his younger age. Instead that bitching his opinion more hoping he apologize for not knowing culture diff and Jong Kook background that the only way to end this but nope he will defend himself more.  \nTbh not hating him for lack knowledge but more to he say \"They also claimed that I’m potentially cancelling him or ruining his career but the opposite is happening he’s getting more attention more views on social media more followers on YouTube and so they’re trying to use his career being in jeopardy against me when in fact I’ve quite literally helped him to gain more popularity.\"",
            "author": "jail_is_just_a_room",
            "id": "hl40mdl",
            "parent_id": "t1_hl3vbx8",
            "score": 2,
            "created_utc": 1637237186.0,
            "replies": []
        },
        {
            "body": "He also did one on the famous S.Korean Olympic boxer and health trainer - Hwang Chul-soon- he deleted that one too :3",
            "author": "the_neverending_rain",
            "id": "hl8bops",
            "parent_id": "t1_hl3vbx8",
            "score": 1,
            "created_utc": 1637308792.0,
            "replies": []
        },
        {
            "body": ">The hate comments aren't just from YouTube though?\n\nI mean the hate comments Greg is getting. If he can't handle it he should quit Youtubing",
            "author": null,
            "id": "hl4bazw",
            "parent_id": "t1_hl4ancf",
            "score": -12,
            "created_utc": 1637243187.0,
            "replies": []
        },
        {
            "body": "1. Greg mentioned it is extremely difficult for a person the same age as KJK to continue building muscle at the rate KJK does. This is a fact. \"Testosterone levels reach their peak around age 18 or 19 before declining throughout the remainder of adulthood.\" (Healthline).\n\nTherefore Greg BELIEVES it is highly likely that KJK has used or uses HRT. \n\n2. The test results cannot be seen as hard \"proof\"  that KJK is a lifetime natural. There are too many factors and one test during one specific time does not prove much. Please watch this video. https://youtu.be/TTpPwH1y5F0?t=945",
            "author": "universityofpreme",
            "id": "hl5pswt",
            "parent_id": "t1_hl5n51l",
            "score": -5,
            "created_utc": 1637263840.0,
            "replies": [
                {
                    "body": "\"Is Kim Jong Kook Natural? Of course he's not natural\"\n\nThis is not an opinion. This is a statement of fact with no proof. If all you want is more proof than what KJK already provided, I'm sure KJK will provide more. However, it is a lie and defamation if the court rules as such.\n\nhttps://www.youtube.com/watch?v=FxcKSIqCJmQ",
                    "author": "netgames2000",
                    "id": "hl5qkre",
                    "parent_id": "t1_hl5pswt",
                    "score": 22,
                    "created_utc": 1637264145.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Absolutely. It's his full-time job to create and advertise his content. Man does spread awareness about the usage and safety of PEDs - he is a known user and supporter of it, which is one of the positive things about Greg. But he is more concerned with proving his view-points than respecting the autonomy of other people.\n\nThe main argument, the thread with which this controversy lives on is kinda ridiculous. KJK has been completely transparent and inviting but Greg continues to insist that he could not achieve that physique unless A. PEDs or B. He is extremely lucky. One is testable and can interpreted by a medical professional, the other is... how does he plan to scientifically prove that KJK is a 'one in a million freak'?\n\nI should note there is nothing inherently wrong with PED use. An individual sets their own physique/performance goals and may use whatever ethical AND safe means to achieve it.\n\nIf a person wants to be out about his PED use, they will do it themselves. If a person says they don't use PEDs and goes to great lengths to prove it with KJK's level of transparency, it is more mature for Greg to, if he must, err on the side of believing KJK. Greg is an advocate for safety which I respect but these sorts of things sow greater disunity for health and fitness advocacy than not.\n\nIf he changed his approach, both he and KJK could have been two fitness influencers having a fantastic discussion on safe pursuit of better health and fitness\\*, and that's what their interaction could have been remembered for. Instead, he went for the low hanging fruit: \"natty or not?\" lol.\n\n\\*Edit: rephrased, spelling, grammar",
            "author": "yungdocph",
            "id": "hl45zuc",
            "parent_id": "t1_hl3v1fk",
            "score": 57,
            "created_utc": 1637240406.0,
            "replies": [
                {
                    "body": "So, If I'm understanding this correctly, he is still insisting that KJK has used/is using steroids or some medicine(sorry, I'm not familiar with the terms) even though KJK doesnt?\n\nEdit: added a mew sentence",
                    "author": "PotatoBulletGun",
                    "id": "hl4cj4m",
                    "parent_id": "t1_hl45zuc",
                    "score": 14,
                    "created_utc": 1637243796.0,
                    "replies": [
                        {
                            "body": "Oh sorry I should have elaborated! [Yes, he is.](https://www.youtube.com/watch?v=fFgsJBiM6vs)\n\n\\*I'll break down some terms and simplify the science that is being tossed around in this issue:\n\n**Steroids are important/necessary hormones** that naturally occur in all our bodies. There are different types of steroids, but the steroids here refer to \"anabolic\" steroids, and the effect particular to anabolic steroids is muscle building.\n\nThere are different types of [exogenous (or, from outside the body)](https://www.medicalnewstoday.com/articles/246373) steroids and different ways to administer it.\n\nPED stands for \"***performance enhancing*** drug\". In the fitness (and greater sports) community, **PEDs refer to the use of exogenous steroids for the objective of better results after exercise**: what this looks like is increased muscle gain in a short period of time, decreased recovery time after a session, etc.\n\nThe type of PED Coach Greg is accusing Kim Jong Kook of using is hormone/testosterone replacement therapy, or HRT/TRT. **Testosterone is a naturally occuring steroid in our bodies, but as we get older, males naturally produce less testosterone**. [In more extreme cases, a doctor may prescribe this therapy to their patient.](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC6406807/)\n\nIn this case, Greg's claims are that KJK's physique is due either to TRT, or that KJK is just a one-in-a-million genetic 'freak of nature'. I don't know where Greg gets his \"this physique is one-in-a-million rare\" statistic from, however. Seems anecdotal and scientifically unfounded.\n\nGreg does continue to insist KJK is on this \"HRT/TRT\" due to KJK's test results which indicate that his testosterone levels are on the higher end. This is the piece of evidence that Greg uses to argue that KJK is in fact using HRT. **Central to Greg's argument is that it's either due to HRT, or it's 'one-in-a-million' that any person would have a testosterone reading that high.** (again, is his source anecdotal or scientific? Or is it a fixation on his belief?). That's the single thread.\n\nHope that clears things up!\n\nFor more information and numbers, [here is a nice article from the Korea Herald that describes what is the usual testosterone range of a man and what KJK tested.](http://www.koreaherald.com/view.php?ud=20211115000342)\n\nI'll report it here:\n\nThe average figure is 2.7 - 10.7 nanograms per milliliter; KJK tested recently for 8.38 nanograms per milliliter at the age of 45.\n\n\\*Edit: Elaborated",
                            "author": "yungdocph",
                            "id": "hl4kvqd",
                            "parent_id": "t1_hl4cj4m",
                            "score": 30,
                            "created_utc": 1637247591.0,
                            "replies": [
                                {
                                    "body": "So does his \"insisted views\" about KJK have proof? Like medical records that KJK actually underwent such therapy",
                                    "author": "PotatoBulletGun",
                                    "id": "hl4ljll",
                                    "parent_id": "t1_hl4kvqd",
                                    "score": 6,
                                    "created_utc": 1637247874.0,
                                    "replies": [
                                        {
                                            "body": "Nah. Greg can't produce that, so he can't prove it. This is why the results from KJK's testosterone test is the evidence he's using to continue pushing. \n\nBecause from the test results Greg can make claims like \"it's 99% TRT and 1% luck\". This claim is just a claim and stays a claim. On the other hand, Greg himself says it's impossible to test whether it's just genetic luck: an argument that is safe and convenient for Greg. \n\nIt's really better that KJK ends this ridiculous controversy than to feed into that ridiculousness haha.",
                                            "author": "yungdocph",
                                            "id": "hl4mjiy",
                                            "parent_id": "t1_hl4ljll",
                                            "score": 22,
                                            "created_utc": 1637248295.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "What else do you expect out of a convicted drug smuggler? Easy money over integrity -- actions already proven in a Nova Scotia court.",
            "author": "SuddenBag",
            "id": "hl5pwnb",
            "parent_id": "t1_hl3v1fk",
            "score": 5,
            "created_utc": 1637263881.0,
            "replies": []
        },
        {
            "body": "In that sense, yes 100% it's a good thing to prevent false expectations especially for newbies starting out. In this niche, it's also good to educate for those who are interested in using, which Greg does from time to time.\n\nBut the glaring problem with the \"natty or not\"; \"is this person using or not\" approach reveals itself in the KJK issue. Sure, people within the fitness community may have generally more accepting attitudes towards the use of PEDs but outside it's still rather stigmatized.\n\nThe natty/not videos can be said to educate those who are primed for it. But the niche is the fitness community. Outside of it, it looks as if one is taking aim at the other with the objective of diminishing the other's achievments.\n\nOne thing I wish Greg does instead of 'call-outs' is to dive deeper towards the people he calls out. Form genuine connections with these people and learn their stories instead of firing claims like mortar shells and if one hits, then great. Maybe he can understand why people say they do/don't do steroids instead of speculation. And if someone is a PED user, he might be able to highlight their reasons behind PED use to achieve their goals, with a reduced possibility of stigmatizing them. But that's not his format. \n\nI stopped watching Greg because I felt that his videos sometimes boundaried on tabloidism. It's quick and easy to speculate. A deeper investigation is more challenging but more rewarding. Everyone is free to educate, but it's difficult to be an effective educator.\n\nBut this is now off topic. Sorry mods!",
            "author": "yungdocph",
            "id": "hl54gsc",
            "parent_id": "t1_hl4q9sn",
            "score": 23,
            "created_utc": 1637255469.0,
            "replies": [
                {
                    "body": "just have to say your comments on this post are excellent and informative",
                    "author": "Denethorsmukbang",
                    "id": "hl610o0",
                    "parent_id": "t1_hl54gsc",
                    "score": 6,
                    "created_utc": 1637268251.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "\"Is Kim Jong Kook Natural? Of course he's not natural\"\n\nThis is not an opinion. This is a statement of fact with no proof. If all you want is more proof than what KJK already provided, I'm sure KJK will provide more. However, it is a lie and defamation if the court rules as such.\n\nhttps://www.youtube.com/watch?v=FxcKSIqCJmQ",
            "author": "netgames2000",
            "id": "hl5qkre",
            "parent_id": "t1_hl5pswt",
            "score": 22,
            "created_utc": 1637264145.0,
            "replies": []
        },
        {
            "body": "So, If I'm understanding this correctly, he is still insisting that KJK has used/is using steroids or some medicine(sorry, I'm not familiar with the terms) even though KJK doesnt?\n\nEdit: added a mew sentence",
            "author": "PotatoBulletGun",
            "id": "hl4cj4m",
            "parent_id": "t1_hl45zuc",
            "score": 14,
            "created_utc": 1637243796.0,
            "replies": [
                {
                    "body": "Oh sorry I should have elaborated! [Yes, he is.](https://www.youtube.com/watch?v=fFgsJBiM6vs)\n\n\\*I'll break down some terms and simplify the science that is being tossed around in this issue:\n\n**Steroids are important/necessary hormones** that naturally occur in all our bodies. There are different types of steroids, but the steroids here refer to \"anabolic\" steroids, and the effect particular to anabolic steroids is muscle building.\n\nThere are different types of [exogenous (or, from outside the body)](https://www.medicalnewstoday.com/articles/246373) steroids and different ways to administer it.\n\nPED stands for \"***performance enhancing*** drug\". In the fitness (and greater sports) community, **PEDs refer to the use of exogenous steroids for the objective of better results after exercise**: what this looks like is increased muscle gain in a short period of time, decreased recovery time after a session, etc.\n\nThe type of PED Coach Greg is accusing Kim Jong Kook of using is hormone/testosterone replacement therapy, or HRT/TRT. **Testosterone is a naturally occuring steroid in our bodies, but as we get older, males naturally produce less testosterone**. [In more extreme cases, a doctor may prescribe this therapy to their patient.](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC6406807/)\n\nIn this case, Greg's claims are that KJK's physique is due either to TRT, or that KJK is just a one-in-a-million genetic 'freak of nature'. I don't know where Greg gets his \"this physique is one-in-a-million rare\" statistic from, however. Seems anecdotal and scientifically unfounded.\n\nGreg does continue to insist KJK is on this \"HRT/TRT\" due to KJK's test results which indicate that his testosterone levels are on the higher end. This is the piece of evidence that Greg uses to argue that KJK is in fact using HRT. **Central to Greg's argument is that it's either due to HRT, or it's 'one-in-a-million' that any person would have a testosterone reading that high.** (again, is his source anecdotal or scientific? Or is it a fixation on his belief?). That's the single thread.\n\nHope that clears things up!\n\nFor more information and numbers, [here is a nice article from the Korea Herald that describes what is the usual testosterone range of a man and what KJK tested.](http://www.koreaherald.com/view.php?ud=20211115000342)\n\nI'll report it here:\n\nThe average figure is 2.7 - 10.7 nanograms per milliliter; KJK tested recently for 8.38 nanograms per milliliter at the age of 45.\n\n\\*Edit: Elaborated",
                    "author": "yungdocph",
                    "id": "hl4kvqd",
                    "parent_id": "t1_hl4cj4m",
                    "score": 30,
                    "created_utc": 1637247591.0,
                    "replies": [
                        {
                            "body": "So does his \"insisted views\" about KJK have proof? Like medical records that KJK actually underwent such therapy",
                            "author": "PotatoBulletGun",
                            "id": "hl4ljll",
                            "parent_id": "t1_hl4kvqd",
                            "score": 6,
                            "created_utc": 1637247874.0,
                            "replies": [
                                {
                                    "body": "Nah. Greg can't produce that, so he can't prove it. This is why the results from KJK's testosterone test is the evidence he's using to continue pushing. \n\nBecause from the test results Greg can make claims like \"it's 99% TRT and 1% luck\". This claim is just a claim and stays a claim. On the other hand, Greg himself says it's impossible to test whether it's just genetic luck: an argument that is safe and convenient for Greg. \n\nIt's really better that KJK ends this ridiculous controversy than to feed into that ridiculousness haha.",
                                    "author": "yungdocph",
                                    "id": "hl4mjiy",
                                    "parent_id": "t1_hl4ljll",
                                    "score": 22,
                                    "created_utc": 1637248295.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "just have to say your comments on this post are excellent and informative",
            "author": "Denethorsmukbang",
            "id": "hl610o0",
            "parent_id": "t1_hl54gsc",
            "score": 6,
            "created_utc": 1637268251.0,
            "replies": []
        },
        {
            "body": "Oh sorry I should have elaborated! [Yes, he is.](https://www.youtube.com/watch?v=fFgsJBiM6vs)\n\n\\*I'll break down some terms and simplify the science that is being tossed around in this issue:\n\n**Steroids are important/necessary hormones** that naturally occur in all our bodies. There are different types of steroids, but the steroids here refer to \"anabolic\" steroids, and the effect particular to anabolic steroids is muscle building.\n\nThere are different types of [exogenous (or, from outside the body)](https://www.medicalnewstoday.com/articles/246373) steroids and different ways to administer it.\n\nPED stands for \"***performance enhancing*** drug\". In the fitness (and greater sports) community, **PEDs refer to the use of exogenous steroids for the objective of better results after exercise**: what this looks like is increased muscle gain in a short period of time, decreased recovery time after a session, etc.\n\nThe type of PED Coach Greg is accusing Kim Jong Kook of using is hormone/testosterone replacement therapy, or HRT/TRT. **Testosterone is a naturally occuring steroid in our bodies, but as we get older, males naturally produce less testosterone**. [In more extreme cases, a doctor may prescribe this therapy to their patient.](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC6406807/)\n\nIn this case, Greg's claims are that KJK's physique is due either to TRT, or that KJK is just a one-in-a-million genetic 'freak of nature'. I don't know where Greg gets his \"this physique is one-in-a-million rare\" statistic from, however. Seems anecdotal and scientifically unfounded.\n\nGreg does continue to insist KJK is on this \"HRT/TRT\" due to KJK's test results which indicate that his testosterone levels are on the higher end. This is the piece of evidence that Greg uses to argue that KJK is in fact using HRT. **Central to Greg's argument is that it's either due to HRT, or it's 'one-in-a-million' that any person would have a testosterone reading that high.** (again, is his source anecdotal or scientific? Or is it a fixation on his belief?). That's the single thread.\n\nHope that clears things up!\n\nFor more information and numbers, [here is a nice article from the Korea Herald that describes what is the usual testosterone range of a man and what KJK tested.](http://www.koreaherald.com/view.php?ud=20211115000342)\n\nI'll report it here:\n\nThe average figure is 2.7 - 10.7 nanograms per milliliter; KJK tested recently for 8.38 nanograms per milliliter at the age of 45.\n\n\\*Edit: Elaborated",
            "author": "yungdocph",
            "id": "hl4kvqd",
            "parent_id": "t1_hl4cj4m",
            "score": 30,
            "created_utc": 1637247591.0,
            "replies": [
                {
                    "body": "So does his \"insisted views\" about KJK have proof? Like medical records that KJK actually underwent such therapy",
                    "author": "PotatoBulletGun",
                    "id": "hl4ljll",
                    "parent_id": "t1_hl4kvqd",
                    "score": 6,
                    "created_utc": 1637247874.0,
                    "replies": [
                        {
                            "body": "Nah. Greg can't produce that, so he can't prove it. This is why the results from KJK's testosterone test is the evidence he's using to continue pushing. \n\nBecause from the test results Greg can make claims like \"it's 99% TRT and 1% luck\". This claim is just a claim and stays a claim. On the other hand, Greg himself says it's impossible to test whether it's just genetic luck: an argument that is safe and convenient for Greg. \n\nIt's really better that KJK ends this ridiculous controversy than to feed into that ridiculousness haha.",
                            "author": "yungdocph",
                            "id": "hl4mjiy",
                            "parent_id": "t1_hl4ljll",
                            "score": 22,
                            "created_utc": 1637248295.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "So does his \"insisted views\" about KJK have proof? Like medical records that KJK actually underwent such therapy",
            "author": "PotatoBulletGun",
            "id": "hl4ljll",
            "parent_id": "t1_hl4kvqd",
            "score": 6,
            "created_utc": 1637247874.0,
            "replies": [
                {
                    "body": "Nah. Greg can't produce that, so he can't prove it. This is why the results from KJK's testosterone test is the evidence he's using to continue pushing. \n\nBecause from the test results Greg can make claims like \"it's 99% TRT and 1% luck\". This claim is just a claim and stays a claim. On the other hand, Greg himself says it's impossible to test whether it's just genetic luck: an argument that is safe and convenient for Greg. \n\nIt's really better that KJK ends this ridiculous controversy than to feed into that ridiculousness haha.",
                    "author": "yungdocph",
                    "id": "hl4mjiy",
                    "parent_id": "t1_hl4ljll",
                    "score": 22,
                    "created_utc": 1637248295.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Nah. Greg can't produce that, so he can't prove it. This is why the results from KJK's testosterone test is the evidence he's using to continue pushing. \n\nBecause from the test results Greg can make claims like \"it's 99% TRT and 1% luck\". This claim is just a claim and stays a claim. On the other hand, Greg himself says it's impossible to test whether it's just genetic luck: an argument that is safe and convenient for Greg. \n\nIt's really better that KJK ends this ridiculous controversy than to feed into that ridiculousness haha.",
            "author": "yungdocph",
            "id": "hl4mjiy",
            "parent_id": "t1_hl4ljll",
            "score": 22,
            "created_utc": 1637248295.0,
            "replies": []
        }
    ]
}