{
    "title": "Team Mighty Guy really skipped the whole thing",
    "post_id": "t0h4co",
    "post_url": "https://www.reddit.com/r/dankruto/comments/t0h4co/team_mighty_guy_really_skipped_the_whole_thing/",
    "author": "Upbeat_Ad_4094",
    "body": "",
    "url": "https://v.redd.it/qar2s9z8ltj81",
    "score": 3945,
    "upvote_ratio": 0.99,
    "created_utc": 1645725495.0,
    "num_comments": 76,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "Because if gai was there he would’ve had to open th 8th gets to defeat pain or atleast the 7th but they were saving 8 gate gai for madara",
            "author": "sub2technobladeordie",
            "id": "hya0zlq",
            "parent_id": "t3_t0h4co",
            "score": 292,
            "created_utc": 1645729765.0,
            "replies": [
                {
                    "body": "Definitely the 8th. 7th he would have still lost",
                    "author": "jonhak28",
                    "id": "hya3k3q",
                    "parent_id": "t1_hya0zlq",
                    "score": 110,
                    "created_utc": 1645730727.0,
                    "replies": [
                        {
                            "body": "I think he could a win with the 7th, considering he one-shot Kisame while the Akatsuki member was in his renowned element, and Guy was holding back to interrogate him. He could a held his own if he was going all out in 7 gates imo.",
                            "author": "Prestigious-Bunch153",
                            "id": "hyaisoi",
                            "parent_id": "t1_hya3k3q",
                            "score": 112,
                            "created_utc": 1645736400.0,
                            "replies": [
                                {
                                    "body": "There’s nothing 7th Gate Guy could do to Kisame that Pain couldn’t do as well. The Rinnegan is obscenely broken, Guy would *need* to open the 8th Gate to take him down because 7 just wouldn’t be enough to secure the win",
                                    "author": "Adminscantkeepmedown",
                                    "id": "hyalvgg",
                                    "parent_id": "t1_hyaisoi",
                                    "score": 57,
                                    "created_utc": 1645737536.0,
                                    "replies": [
                                        {
                                            "body": "The rinnagan is broken but the Pain bodies have low durability. The main thing he has to watch out for is chibaku tensai.",
                                            "author": "infamusforever223",
                                            "id": "hyawvr1",
                                            "parent_id": "t1_hyalvgg",
                                            "score": 47,
                                            "created_utc": 1645741646.0,
                                            "replies": [
                                                {
                                                    "body": "Low durability you sure ? Cloaked Naruto was literally looney tuning Pain across the map, including trying to bash his head in with a giant boulder, but all it did was rip his outfit.",
                                                    "author": "omkar529",
                                                    "id": "hybrka4",
                                                    "parent_id": "t1_hyawvr1",
                                                    "score": 21,
                                                    "created_utc": 1645754712.0,
                                                    "replies": [
                                                        {
                                                            "body": "The Deva path is the only one that didn't get dispatched in a couple of hits. Konahamaru even downed one with a single rasengan(keep in mind that he needed a shadow clone to hold it together) and had to be restored by the naraka path.",
                                                            "author": "infamusforever223",
                                                            "id": "hyc4jjv",
                                                            "parent_id": "t1_hybrka4",
                                                            "score": 11,
                                                            "created_utc": 1645760657.0,
                                                            "replies": []
                                                        },
                                                        {
                                                            "body": "Yeah and then he beat him with a single rasengan. That entire fight got really dumb once Naruto cloaked.",
                                                            "author": "evangelism2",
                                                            "id": "hycg95b",
                                                            "parent_id": "t1_hybrka4",
                                                            "score": 14,
                                                            "created_utc": 1645766722.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "body": "30% 7th gate = kills transformed kisame in ideal conditions \n8th gate= Beats Juubi madara\nPain = Juubi madara level????",
                                            "author": "SHAGGY198",
                                            "id": "hycqrhd",
                                            "parent_id": "t1_hyalvgg",
                                            "score": 8,
                                            "created_utc": 1645773564.0,
                                            "replies": [
                                                {
                                                    "body": "You got to remember that Madara was more or less *allowing* Guy to land some of those hits, he wanted the exhilaration of a proper fight. And even with him going easy so to speak, Minato and Kakashi were both there backing Guy up",
                                                    "author": "RedShankyMan",
                                                    "id": "hycu7t7",
                                                    "parent_id": "t1_hycqrhd",
                                                    "score": 10,
                                                    "created_utc": 1645776106.0,
                                                    "replies": [
                                                        {
                                                            "body": "He also didn't want to be hit by some of those. He tried to shield himself off when he dealt with the force of Sekizo, and then was surprised when Night Guy bends space and hits him. \n\nBut yeah Madara wasn't taking it very seriously. It's clear he was having a good time and Guy wouldn't have been able to hit Madara at all if it wasn't for Gaara, Lee, Minato and Kakashi.",
                                                            "author": "Prestigious-Bunch153",
                                                            "id": "hyf9ufv",
                                                            "parent_id": "t1_hycu7t7",
                                                            "score": 2,
                                                            "created_utc": 1645819719.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "body": "The jump between 7 gates and 8 gates is massive. 7 is, maybe, an S class technique that matches up well with Kisame because he can’t absorb chakra from it. 7 \n\nKisame is a 32.5 in the data books. But Sasori, Sanin, Itachi, Hirizun, etc. are all much higher.\n\nSo you are waay overhyping Kisame.",
                                                    "author": "gcz77",
                                                    "id": "hyk67o4",
                                                    "parent_id": "t1_hycqrhd",
                                                    "score": 1,
                                                    "created_utc": 1645909181.0,
                                                    "replies": [
                                                        {
                                                            "body": ">using data books lol\n\nAnyways that’s unfused kisame let alone full power 7th gate guy even though he stated he wasn’t going all out.",
                                                            "author": "SHAGGY198",
                                                            "id": "hykw3zg",
                                                            "parent_id": "t1_hyk67o4",
                                                            "score": 1,
                                                            "created_utc": 1645920351.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "Kisame ain’t that strong in the data books. Just a bit stronger than Hiashi Hyuga. So there is no comparison between Kisame and Pein.\n\nGuy could kill all the paths assuming that he can find the path that reincarnates the other paths. \n\nBut EVEN IF guy killed all the paths, he still didn’t have nature chakra to sense and find Peins REAL body. He wouldn’t even know that these weren’t really bodies, let alone how to find Pein.\n\n So Guy would save the day, kill all the paths and the. Die. Meanwhile Pein goes back to Rain, gets new bodies and comes back. \n\nIt doesn’t cost Pein very much. He would just loose some replaceable bodies.",
                                    "author": "gcz77",
                                    "id": "hyk4k52",
                                    "parent_id": "t1_hyaisoi",
                                    "score": 0,
                                    "created_utc": 1645908480.0,
                                    "replies": []
                                },
                                {
                                    "body": "He only won cuz kisane used like ninjutsu or chakra absorbing jutsu. If he didn’t use that specific ability he could’ve won. It took guy all the way to 7 gates to barely beat kisame lol 7 gates r not doing shit to pain",
                                    "author": "jonhak28",
                                    "id": "hyak2ov",
                                    "parent_id": "t1_hyaisoi",
                                    "score": -20,
                                    "created_utc": 1645736870.0,
                                    "replies": [
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "hyao445",
                                            "parent_id": "t1_hyak2ov",
                                            "score": 26,
                                            "created_utc": 1645738366.0,
                                            "replies": [
                                                {
                                                    "body": "I’ll admit I haven’t watched the fight recently so maybe my memory is a little hazy but he really just won cuz kisame simply used the wrong attack unknowingly. There is no shot 7th gate is beating pain. 8th gate sure",
                                                    "author": "jonhak28",
                                                    "id": "hyapd5h",
                                                    "parent_id": "t1_hyao445",
                                                    "score": -9,
                                                    "created_utc": 1645738830.0,
                                                    "replies": [
                                                        {
                                                            "body": "I think 7th gate no problem. The reason why it's so hard to get close to him is because physical attacks are the only thing that could really hurt him, and most long ranged physical attacks are visible. Guy can throw a punch in 7th gate form Meters away and still make contact with pain. And with that type of force I don't think almighty push could defend it. Guy also is really good at breaking down his opponents and what they are capable of. I do think he would need 7 gates, I do not think he would need the 8th gate though. It would be cool if some one could animate this though haha",
                                                            "author": null,
                                                            "id": "hyaqf0e",
                                                            "parent_id": "t1_hyapd5h",
                                                            "score": 12,
                                                            "created_utc": 1645739205.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Fan made stuff is always very impressive. It would be a dope fight to watch",
                                                                    "author": "jonhak28",
                                                                    "id": "hyaqx5n",
                                                                    "parent_id": "t1_hyaqf0e",
                                                                    "score": 2,
                                                                    "created_utc": 1645739389.0,
                                                                    "replies": []
                                                                },
                                                                {
                                                                    "body": "Not commenting on who’d win, but there’s no way his long range punch breaks through almighty push.",
                                                                    "author": "Oopake",
                                                                    "id": "hyb8nt1",
                                                                    "parent_id": "t1_hyaqf0e",
                                                                    "score": 3,
                                                                    "created_utc": 1645746438.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "Why? All we have seen is almighty push reflect physical items and attacks?",
                                                                            "author": null,
                                                                            "id": "hybset7",
                                                                            "parent_id": "t1_hyb8nt1",
                                                                            "score": 1,
                                                                            "created_utc": 1645755099.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "It took like 6 tailed Naruto to break through the almighty push Might guy was going to die against the bijuu of Naruto didn't save him I think pain claps anything but 8th gaye",
                                                                                    "author": "PikaYoshl",
                                                                                    "id": "hyburo8",
                                                                                    "parent_id": "t1_hybset7",
                                                                                    "score": 1,
                                                                                    "created_utc": 1645756160.0,
                                                                                    "replies": [
                                                                                        {
                                                                                            "body": "We seem to forget all of these characters have different arsenals, different abilities, different personalities. This means different weaknesses. Guys 7 gates is so fast, Let alone powerful, he would be the perfect counter to pain. They just didn't leave him out of this rc just because lol",
                                                                                            "author": null,
                                                                                            "id": "hyc55a9",
                                                                                            "parent_id": "t1_hyburo8",
                                                                                            "score": 2,
                                                                                            "created_utc": 1645760946.0,
                                                                                            "replies": []
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "guy is literally the worst opponent for kisame. he is like the anti kisame. kisame gets stronger by taking Chakra. guy doesn't use Chakra...",
                                    "author": "DartinBlaze448",
                                    "id": "ijjljf6",
                                    "parent_id": "t1_hyaisoi",
                                    "score": 1,
                                    "created_utc": 1660022729.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Bullshit",
                            "author": "Uzanto_Retejo",
                            "id": "hyekqh2",
                            "parent_id": "t1_hya3k3q",
                            "score": 0,
                            "created_utc": 1645810142.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "People like to claim Gai would dust the Pain if he was in village.\n\nBut last time there was invasion on village, Gai's feats in defending Konoha were no greater than someone like Asuma's.",
                    "author": "DrunkSaruman",
                    "id": "hyfk6f3",
                    "parent_id": "t1_hya0zlq",
                    "score": 2,
                    "created_utc": 1645823791.0,
                    "replies": [
                        {
                            "body": "Ya, because Guy only breaks out 8 gates in worst case. Literally only breaks it out at when his Taijutsu is the only thing that can beat ninja god.\n\nHe didn’t break out 8 gates until he was one of the last guys fighting Madara, and even then he only broke out the 8 gates when Taisjutsu was the only thing that would work. He almost went through the biggest battle ever without using 8 gates, of course he was saving it for something huge.",
                            "author": "gcz77",
                            "id": "hyk6w36",
                            "parent_id": "t1_hyfk6f3",
                            "score": 1,
                            "created_utc": 1645909465.0,
                            "replies": [
                                {
                                    "body": "Invasion of your home and your leader fighting to death would be considered the worst case and the time when people of village should give their 100% in fight.",
                                    "author": "DrunkSaruman",
                                    "id": "hykbu64",
                                    "parent_id": "t1_hyk6w36",
                                    "score": 1,
                                    "created_utc": 1645911569.0,
                                    "replies": [
                                        {
                                            "body": "It’s obviously not the worst case given that Pein was waaay worse, and that Madara was way worse. Unless you think that sound invasion was worse than all that. Do you think so? It seemed bad, sure, but nothing like a full blown war where Kage and Elite Shinobi die.\n\nI mean there were more major deaths in Tobirama’s last battle.\n\nPut it this way, Guy only went 8th gate when he was one of the last fighters in the most important end of the world battle AND EVEN THEN he only went 8th gate when his Taijutsu was the only thing that could work.\n\nOrochimaru was bad and everything but on the scale of things it was pretty small fries, but it wasn’t like everything was screwed if Guy didn’t go 8 gates. He could fight any of the invaders without 8 gates. Who would he need to go 8 gates for. It’s not like the village was going to get destroyed or anything. There was just some damage. \n\nEven if Orochimaru didn’t get injured vs Hirizun he would have to fight Jirya, Guy and Kakashi.\n\nKonahono would have been better off with him just saving his power for the next war or something. As bad as Orochimaru is, he never came close to destroying the village.",
                                            "author": "gcz77",
                                            "id": "hyn88wj",
                                            "parent_id": "t1_hykbu64",
                                            "score": 1,
                                            "created_utc": 1645970916.0,
                                            "replies": [
                                                {
                                                    "body": "None of kages died in IV war or Pain attack. Unlike durring inavison of Sand and Sound. As far as they knew, they were fighting for their survival when Orochimaru attacked. As far as they knew, village was going to get destroyed.\n\nTheir most important person in village - Hokage, was captured, that alone is reason for Gai to go all out to protect Leaf, as his subordinated.",
                                                    "author": "DrunkSaruman",
                                                    "id": "hynpktr",
                                                    "parent_id": "t1_hyn88wj",
                                                    "score": 1,
                                                    "created_utc": 1645978565.0,
                                                    "replies": [
                                                        {
                                                            "body": "I mean, ya, the Hokage died in the attack, just like every Hokage but Hashirama. The stakes weren’t that high. They were high for that point in the series, sure. But nowhere near as high as the 9 tails attack or a real war. The Hokage did die, just like Minato and Tobirama. I mean most of the Kage we know of died in war.\n\nIt would be bad tactics to use the villages absolute ace on something so small. Imagine something serious happened, the kind of thing that might actually hurt the village as much as a war or the 9 tails attack.\n\nI mean, Orchimaru was at best the 4th most threatening attack in Orochimarus life. The 9 tails was more dangerous, Pein was Legit, and the 4th war was an end of the world situation that united every village.\n\nI mean Orochimarus attack was bad and everything but was pretty regular for Ninja history. Pein legit destroyed the village. The fourth war took 7 tailed beasts, resurrected many many ninja who were each stronger than Orochimaru, turned Madara into a god, temporary killed the next two strongest ninja. Ya, basically captured every ninja and every living Kage long before Guy even mentioned opening the 8th gate.\n\nImagine Guy opened the 8th gate for Orochimaru and a serious war, the kind were lots of S class ninja die happens. He would look silly. There were more s class ninja in Tobiramas last battle than there were in the entire Orochimaru arc.\n\nYes, the Hokage got killed, like most Hokage. But in context and compared to actual wars it was pretty small.\n\nIn that point in the story, where we don’t know anything about the wars, and Orochimaru looks like the scariest guy out there it seems like a massive deal.",
                                                            "author": "gcz77",
                                                            "id": "hyq6h7c",
                                                            "parent_id": "t1_hynpktr",
                                                            "score": 1,
                                                            "created_utc": 1646015322.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Straight facts",
                    "author": "nasserg19",
                    "id": "hyciive",
                    "parent_id": "t1_hya0zlq",
                    "score": 1,
                    "created_utc": 1645768064.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Someone needs to edit this song with Kakashi and Guy dancing.",
            "author": "ThatNerdyGuy05",
            "id": "hy9w7mi",
            "parent_id": "t3_t0h4co",
            "score": 130,
            "created_utc": 1645727959.0,
            "replies": [
                {
                    "body": "Noted",
                    "author": "Bewadatau",
                    "id": "hybycf1",
                    "parent_id": "t1_hy9w7mi",
                    "score": 8,
                    "created_utc": 1645757781.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Their been no invading konoha if might guy was there all six paths of pain would get fucked up",
            "author": "Hinatafan24",
            "id": "hya0bpw",
            "parent_id": "t3_t0h4co",
            "score": 117,
            "created_utc": 1645729514.0,
            "replies": [
                {
                    "body": "He would defeat all the paths but he would've died in the process and Nagato would still be alive so it wouldn't really be worth it lol",
                    "author": "ubiasedhoodfriend",
                    "id": "hya80ew",
                    "parent_id": "t1_hya0bpw",
                    "score": 62,
                    "created_utc": 1645732414.0,
                    "replies": []
                },
                {
                    "body": "This is just my opinion but I dont think an 8 gates Guy beats Pain, I think 7th gate has a better shot. Hear me out. I'm not saying pain is stronger than 8 gates guy, just that I think the gates would have killed Guy before he could kill pain. Imagine Guy charges up Night Guy, charges at pain, and right at the last second runs straight into an invisible chameleon and kills it but also kills himself",
                    "author": "cam9704",
                    "id": "hyab7kd",
                    "parent_id": "t1_hya0bpw",
                    "score": 33,
                    "created_utc": 1645733605.0,
                    "replies": [
                        {
                            "body": "The night guy almost destroyed 10 tails Madara, with Guys crazy speed in the 8th gate he could probably blitz the 6 paths one after the other and kill them all with just a regular, precise punch or snap their necks or something. \n\nPain would lose in a couple of seconds if Guy went 8 gates",
                            "author": "LazyBriton",
                            "id": "hyag52i",
                            "parent_id": "t1_hyab7kd",
                            "score": 28,
                            "created_utc": 1645735426.0,
                            "replies": [
                                {
                                    "body": "Well his puppets would. Nagato was off in a cave.",
                                    "author": "Mr_Noms",
                                    "id": "hyc5jpu",
                                    "parent_id": "t1_hyag52i",
                                    "score": 8,
                                    "created_utc": 1645761136.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Where was he during the invasion?",
            "author": "Oblivious_Indian_Guy",
            "id": "hyahu8s",
            "parent_id": "t3_t0h4co",
            "score": 21,
            "created_utc": 1645736045.0,
            "replies": [
                {
                    "body": "On the other side of the planet",
                    "author": "BillionDavido",
                    "id": "hyaznyu",
                    "parent_id": "t1_hyahu8s",
                    "score": 42,
                    "created_utc": 1645742746.0,
                    "replies": []
                },
                {
                    "body": "On his way to the village. In the anime there a scene were team Guy sees and a dust cloud coming from the area of the village. They say something must be up and they start running to the village hoping they make it in time.\n\nIt’s just to explain why Guy wasn’t there. Which at the time seemed kind of strange. But once you find out about 8 gates it’s pretty obvious that the scene is meant to explain why he didn’t open the 8th gate.",
                    "author": "gcz77",
                    "id": "hzixlix",
                    "parent_id": "t1_hyahu8s",
                    "score": 1,
                    "created_utc": 1646532165.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Kishimoto was saving pain from guy with that plot.",
            "author": "xtremeultr",
            "id": "hyavtr4",
            "parent_id": "t3_t0h4co",
            "score": 16,
            "created_utc": 1645741239.0,
            "replies": []
        },
        {
            "body": "Guy needs to go to ukraine. He will open the 8th gate and solo the russian army",
            "author": "Lost_Assumption1467",
            "id": "hyabubj",
            "parent_id": "t3_t0h4co",
            "score": 39,
            "created_utc": 1645733840.0,
            "replies": [
                {
                    "body": "I really don’t feel like that would require the 8th Gate. \n\nPeople really out here lowballing anime characters like they don’t take punches with the force of a ballistic missile to the dome every fight and keep brawling.",
                    "author": "Xandril",
                    "id": "hych6l4",
                    "parent_id": "t1_hyabubj",
                    "score": 11,
                    "created_utc": 1645767260.0,
                    "replies": [
                        {
                            "body": "Or just get up from a massive impact crater kinda dusty, maybe with their hair a little messy.  \n\nHonestly I now want to see Team Guy vs the entire Russian military.  Lee’s gonna be out of control on those vodka rations!",
                            "author": "deadlysnoots",
                            "id": "hydr5kv",
                            "parent_id": "t1_hych6l4",
                            "score": 3,
                            "created_utc": 1645798274.0,
                            "replies": []
                        },
                        {
                            "body": "Yeah, Guy would solo the entire Russian army at just a gate or two. As a Jonin in base, he's able to react to lightning.  Which puts his speed from [around 200,000 mph](https://www.weather.gov/safety/lightning-science-negative-charged-flash#:~:text=In%20general%2C%20stepped%20leaders%20travel,200%20million%20miles%20per%20hour.) to 1/3 C. Nothing we have is touching him.",
                            "author": null,
                            "id": "hycj61k",
                            "parent_id": "t1_hych6l4",
                            "score": 3,
                            "created_utc": 1645768460.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Someone tell Naruto to stay put and enjoy his training, Guy soloed all six paths and then drop-kicked Nagato into the next time zone.",
            "author": "designerjeremiah",
            "id": "hyccy68",
            "parent_id": "t3_t0h4co",
            "score": 6,
            "created_utc": 1645764893.0,
            "replies": []
        },
        {
            "body": "Lol if guy was there might have had to break out the 8 gates.",
            "author": "zebibliopole",
            "id": "hy9rwjs",
            "parent_id": "t3_t0h4co",
            "score": 10,
            "created_utc": 1645726342.0,
            "replies": []
        },
        {
            "body": "This one's solid dank",
            "author": "Kulog555",
            "id": "hyb54f9",
            "parent_id": "t3_t0h4co",
            "score": 3,
            "created_utc": 1645744942.0,
            "replies": []
        },
        {
            "body": "u/savevideobot",
            "author": "Endmenow_Haha_please",
            "id": "hya8y3k",
            "parent_id": "t3_t0h4co",
            "score": 1,
            "created_utc": 1645732760.0,
            "replies": []
        },
        {
            "body": "u/savevideo",
            "author": "Gaiznfreedom",
            "id": "hyad6tt",
            "parent_id": "t3_t0h4co",
            "score": 1,
            "created_utc": 1645734335.0,
            "replies": []
        },
        {
            "body": "u/savevideo",
            "author": "Shrek_from_the_Hag",
            "id": "hyaheuu",
            "parent_id": "t3_t0h4co",
            "score": 1,
            "created_utc": 1645735890.0,
            "replies": [
                {
                    "body": "###[View link](https://redditsave.com/r/dankruto/comments/t0h4co/team_mighty_guy_really_skipped_the_whole_thing/)\n\n\n --- \n [**Info**](https://np.reddit.com/user/SaveVideo/comments/jv323v/info/)&#32;|&#32; [**Feedback**](https://np.reddit.com/message/compose/?to=Kryptonh&subject=Feedback for savevideo)&#32;|&#32;[**Donate**](https://ko-fi.com/getvideo) &#32;|&#32; [**DMCA**](https://np.reddit.com/message/compose/?to=Kryptonh&subject=Content removal request for savevideo&message=https://np.reddit.com//r/dankruto/comments/t0h4co/team_mighty_guy_really_skipped_the_whole_thing/) &#32;|&#32; \n [^(reddit video downloader)](https://redditsave.com) &#32;|&#32; [^(download video tiktok)](https://taksave.com)",
                    "author": "SaveVideo",
                    "id": "hyajn01",
                    "parent_id": "t1_hyaheuu",
                    "score": 1,
                    "created_utc": 1645736710.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Indeed",
            "author": "theamazingspiderstan",
            "id": "hyaltx6",
            "parent_id": "t3_t0h4co",
            "score": 1,
            "created_utc": 1645737521.0,
            "replies": []
        },
        {
            "body": "u/savevideo",
            "author": "Former_Arm_7569",
            "id": "hyb65ij",
            "parent_id": "t3_t0h4co",
            "score": 1,
            "created_utc": 1645745371.0,
            "replies": [
                {
                    "body": "###[View link](https://redditsave.com/r/dankruto/comments/t0h4co/team_mighty_guy_really_skipped_the_whole_thing/)\n\n\n --- \n [**Info**](https://np.reddit.com/user/SaveVideo/comments/jv323v/info/)&#32;|&#32; [**Feedback**](https://np.reddit.com/message/compose/?to=Kryptonh&subject=Feedback for savevideo)&#32;|&#32;[**Donate**](https://ko-fi.com/getvideo) &#32;|&#32; [**DMCA**](https://np.reddit.com/message/compose/?to=Kryptonh&subject=Content removal request for savevideo&message=https://np.reddit.com//r/dankruto/comments/t0h4co/team_mighty_guy_really_skipped_the_whole_thing/) &#32;|&#32; \n [^(reddit video downloader)](https://redditsave.com) &#32;|&#32; [^(download video tiktok)](https://taksave.com)",
                    "author": "SaveVideo",
                    "id": "hyb7yfd",
                    "parent_id": "t1_hyb65ij",
                    "score": 0,
                    "created_utc": 1645746140.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Lmao 🤣",
            "author": "Saamael007",
            "id": "hyby3e3",
            "parent_id": "t3_t0h4co",
            "score": 1,
            "created_utc": 1645757667.0,
            "replies": []
        },
        {
            "body": "Might coulda taken em",
            "author": "zeytiiin",
            "id": "hycgcbh",
            "parent_id": "t3_t0h4co",
            "score": 1,
            "created_utc": 1645766771.0,
            "replies": []
        },
        {
            "body": "Does anyone have the video of just the bears dancing to the music with maybe even the music in the background. Absolutely hilarious",
            "author": "Keksis_The_Betrayed",
            "id": "hyckfa1",
            "parent_id": "t3_t0h4co",
            "score": 1,
            "created_utc": 1645769251.0,
            "replies": [
                {
                    "body": "Search \"Dancing Bears Sweet Dreams\"",
                    "author": "Pervizzz",
                    "id": "hzd4vbg",
                    "parent_id": "t1_hyckfa1",
                    "score": 2,
                    "created_utc": 1646427130.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "This song was also used for Quicksilver in X-Men: Apocalypse right?",
            "author": "Life_Enjoyer4661",
            "id": "hyclrip",
            "parent_id": "t3_t0h4co",
            "score": 1,
            "created_utc": 1645770114.0,
            "replies": [
                {
                    "body": "This song wast eke hath used f'r quicksilv'r in x-men: apocalypse right?\n\n***\n\n\n\n^(I am a bot and I swapp'd some of thy words with Shakespeare words.)\n\nCommands: `!ShakespeareInsult`, `!fordo`, `!optout`",
                    "author": "Shakespeare-Bot",
                    "id": "hyclsc5",
                    "parent_id": "t1_hyclrip",
                    "score": 1,
                    "created_utc": 1645770129.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "And then guy wondering why konoha was destroyed",
            "author": "BenjaDaPro",
            "id": "hycmhg3",
            "parent_id": "t3_t0h4co",
            "score": 1,
            "created_utc": 1645770595.0,
            "replies": []
        },
        {
            "body": "Ten ten had too much screen time",
            "author": "Kurokatana94",
            "id": "hyd2vrc",
            "parent_id": "t3_t0h4co",
            "score": 1,
            "created_utc": 1645782979.0,
            "replies": []
        },
        {
            "body": "Everyone of you people that think Guy would have to whip out the 8th gate is DRUNK \n\nWhen pain attacked konoha he split up \nThe 6 paths were across the village \n\nKONOHAMARU won a 1v1 against a path dude \n\nKakashi 2v1d until choji and his dad showed up and they still beat a path \n\nThe Yahiko pains weakness was a 5 second interval between when he could use all mighty push and universal pull the 7th gate would’ve been plenty fast enough to exploit that \n\nIf guy was there he and Kakashi could’ve taken the yahiko pain \n\nChoji and his dad could’ve stomped the cyborg pain w brute force bcuz that’s all he is(which they did)\n\nKonohamaru beat the soul snatching pain \n\nSummoning pain isn’t much of a threat Sakura and Tsunade could’ve bullied the summons \n\nThe pain that absorbs ninjutsu is rock lees wet dream as an opponent and nejis considering they don’t use jutsu they use chakra to augment their taijutsu \n\nAnd the last pains only forte is bringing the other pains back to life \nLiterally any decent team could’ve handled him(shikamaru/ino/kiba/Hinata etc) \n\nWe don’t talk about tenten \n\nGuy was left out of the village on purpose because pain would’ve lost before naruto showed up \n\nHow in gods name would guy have needed the 8th gate when naruto won the fight in a state that is WEAKER than the 8th gate \n\nThe 8th gate rivals the Senjutsu and Rinnegan abilities of the 10 tails jinchuriki \n\nPain lost to the Senjutsu & 9 tails before he even used the full 9 \n\nPain literally lost to an inferior version of something guy almost ONE SIDEDLY demolished(yes guy had Lees assist in one moment but there is nothing to show that it was needed and he couldn’t just dodge the orbs himself) \n\nY’all are drunk put the bottle down",
            "author": "Paradox_Madden",
            "id": "hydkadx",
            "parent_id": "t3_t0h4co",
            "score": 1,
            "created_utc": 1645794879.0,
            "replies": []
        },
        {
            "body": "It was obvious after seeing guy's true power he would easily win with 8th gate of death.",
            "author": "Mission-Balance6765",
            "id": "hydkurj",
            "parent_id": "t3_t0h4co",
            "score": 1,
            "created_utc": 1645795178.0,
            "replies": []
        },
        {
            "body": "We really need a naruto what if series, especially to see this, what if team Guy were in the village when Pain showed up. We did get to see a tiny teaser in the opening where you see them fighting off a few of the paths, always thought that would have been foreshadowing but nope!",
            "author": "invertebro25",
            "id": "hydsh4g",
            "parent_id": "t3_t0h4co",
            "score": 1,
            "created_utc": 1645798877.0,
            "replies": []
        },
        {
            "body": "Guy was too powerful to be there lol",
            "author": "nasserg19",
            "id": "hye0mgb",
            "parent_id": "t3_t0h4co",
            "score": 1,
            "created_utc": 1645802385.0,
            "replies": []
        },
        {
            "body": "Don't let this take away from the fact that Guy's squad was largely shafted",
            "author": "ChuckMast3r",
            "id": "hyebxd5",
            "parent_id": "t3_t0h4co",
            "score": 1,
            "created_utc": 1645806811.0,
            "replies": []
        },
        {
            "body": "u/savevideobot",
            "author": "anime_gamerr",
            "id": "hyfka8q",
            "parent_id": "t3_t0h4co",
            "score": 1,
            "created_utc": 1645823833.0,
            "replies": []
        },
        {
            "body": "LINK TO THE BEAR VIDEO NOW",
            "author": "Budget-Pen8582",
            "id": "hyigkbs",
            "parent_id": "t3_t0h4co",
            "score": 1,
            "created_utc": 1645882535.0,
            "replies": []
        },
        {
            "body": "u/savevideo",
            "author": "AtmosphereSea7159",
            "id": "i0a3ogt",
            "parent_id": "t3_t0h4co",
            "score": 1,
            "created_utc": 1647027857.0,
            "replies": [
                {
                    "body": "###[View link](https://redditsave.com/r/dankruto/comments/t0h4co/team_mighty_guy_really_skipped_the_whole_thing/)\n\n\n --- \n [**Info**](https://np.reddit.com/user/SaveVideo/comments/jv323v/info/)&#32;|&#32; [**Feedback**](https://np.reddit.com/message/compose/?to=Kryptonh&subject=Feedback for savevideo)&#32;|&#32;[**Donate**](https://ko-fi.com/getvideo) &#32;|&#32; [**DMCA**](https://np.reddit.com/message/compose/?to=Kryptonh&subject=Content removal request for savevideo&message=https://np.reddit.com//r/dankruto/comments/t0h4co/team_mighty_guy_really_skipped_the_whole_thing/) &#32;|&#32; \n [^(reddit video downloader)](https://redditsave.com) &#32;|&#32; [^(download video tiktok)](https://taksave.com)",
                    "author": "SaveVideo",
                    "id": "i0a3p6r",
                    "parent_id": "t1_i0a3ogt",
                    "score": 1,
                    "created_utc": 1647027865.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "u/savevideo",
            "author": "PjTheOpGamer",
            "id": "i13yiqt",
            "parent_id": "t3_t0h4co",
            "score": 1,
            "created_utc": 1647573954.0,
            "replies": [
                {
                    "body": "###[View link](https://redditsave.com/r/dankruto/comments/t0h4co/team_mighty_guy_really_skipped_the_whole_thing/)\n\n\n --- \n [**Info**](https://np.reddit.com/user/SaveVideo/comments/jv323v/info/)&#32;|&#32; [**Feedback**](https://np.reddit.com/message/compose/?to=Kryptonh&subject=Feedback for savevideo)&#32;|&#32;[**Donate**](https://ko-fi.com/getvideo) &#32;|&#32; [**DMCA**](https://np.reddit.com/message/compose/?to=Kryptonh&subject=Content removal request for savevideo&message=https://np.reddit.com//r/dankruto/comments/t0h4co/team_mighty_guy_really_skipped_the_whole_thing/) &#32;|&#32; \n [^(reddit video downloader)](https://redditsave.com) &#32;|&#32; [^(download video tiktok)](https://taksave.com)",
                    "author": "SaveVideo",
                    "id": "i13yjb7",
                    "parent_id": "t1_i13yiqt",
                    "score": 1,
                    "created_utc": 1647573962.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Definitely the 8th. 7th he would have still lost",
            "author": "jonhak28",
            "id": "hya3k3q",
            "parent_id": "t1_hya0zlq",
            "score": 110,
            "created_utc": 1645730727.0,
            "replies": [
                {
                    "body": "I think he could a win with the 7th, considering he one-shot Kisame while the Akatsuki member was in his renowned element, and Guy was holding back to interrogate him. He could a held his own if he was going all out in 7 gates imo.",
                    "author": "Prestigious-Bunch153",
                    "id": "hyaisoi",
                    "parent_id": "t1_hya3k3q",
                    "score": 112,
                    "created_utc": 1645736400.0,
                    "replies": [
                        {
                            "body": "There’s nothing 7th Gate Guy could do to Kisame that Pain couldn’t do as well. The Rinnegan is obscenely broken, Guy would *need* to open the 8th Gate to take him down because 7 just wouldn’t be enough to secure the win",
                            "author": "Adminscantkeepmedown",
                            "id": "hyalvgg",
                            "parent_id": "t1_hyaisoi",
                            "score": 57,
                            "created_utc": 1645737536.0,
                            "replies": [
                                {
                                    "body": "The rinnagan is broken but the Pain bodies have low durability. The main thing he has to watch out for is chibaku tensai.",
                                    "author": "infamusforever223",
                                    "id": "hyawvr1",
                                    "parent_id": "t1_hyalvgg",
                                    "score": 47,
                                    "created_utc": 1645741646.0,
                                    "replies": [
                                        {
                                            "body": "Low durability you sure ? Cloaked Naruto was literally looney tuning Pain across the map, including trying to bash his head in with a giant boulder, but all it did was rip his outfit.",
                                            "author": "omkar529",
                                            "id": "hybrka4",
                                            "parent_id": "t1_hyawvr1",
                                            "score": 21,
                                            "created_utc": 1645754712.0,
                                            "replies": [
                                                {
                                                    "body": "The Deva path is the only one that didn't get dispatched in a couple of hits. Konahamaru even downed one with a single rasengan(keep in mind that he needed a shadow clone to hold it together) and had to be restored by the naraka path.",
                                                    "author": "infamusforever223",
                                                    "id": "hyc4jjv",
                                                    "parent_id": "t1_hybrka4",
                                                    "score": 11,
                                                    "created_utc": 1645760657.0,
                                                    "replies": []
                                                },
                                                {
                                                    "body": "Yeah and then he beat him with a single rasengan. That entire fight got really dumb once Naruto cloaked.",
                                                    "author": "evangelism2",
                                                    "id": "hycg95b",
                                                    "parent_id": "t1_hybrka4",
                                                    "score": 14,
                                                    "created_utc": 1645766722.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "30% 7th gate = kills transformed kisame in ideal conditions \n8th gate= Beats Juubi madara\nPain = Juubi madara level????",
                                    "author": "SHAGGY198",
                                    "id": "hycqrhd",
                                    "parent_id": "t1_hyalvgg",
                                    "score": 8,
                                    "created_utc": 1645773564.0,
                                    "replies": [
                                        {
                                            "body": "You got to remember that Madara was more or less *allowing* Guy to land some of those hits, he wanted the exhilaration of a proper fight. And even with him going easy so to speak, Minato and Kakashi were both there backing Guy up",
                                            "author": "RedShankyMan",
                                            "id": "hycu7t7",
                                            "parent_id": "t1_hycqrhd",
                                            "score": 10,
                                            "created_utc": 1645776106.0,
                                            "replies": [
                                                {
                                                    "body": "He also didn't want to be hit by some of those. He tried to shield himself off when he dealt with the force of Sekizo, and then was surprised when Night Guy bends space and hits him. \n\nBut yeah Madara wasn't taking it very seriously. It's clear he was having a good time and Guy wouldn't have been able to hit Madara at all if it wasn't for Gaara, Lee, Minato and Kakashi.",
                                                    "author": "Prestigious-Bunch153",
                                                    "id": "hyf9ufv",
                                                    "parent_id": "t1_hycu7t7",
                                                    "score": 2,
                                                    "created_utc": 1645819719.0,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "body": "The jump between 7 gates and 8 gates is massive. 7 is, maybe, an S class technique that matches up well with Kisame because he can’t absorb chakra from it. 7 \n\nKisame is a 32.5 in the data books. But Sasori, Sanin, Itachi, Hirizun, etc. are all much higher.\n\nSo you are waay overhyping Kisame.",
                                            "author": "gcz77",
                                            "id": "hyk67o4",
                                            "parent_id": "t1_hycqrhd",
                                            "score": 1,
                                            "created_utc": 1645909181.0,
                                            "replies": [
                                                {
                                                    "body": ">using data books lol\n\nAnyways that’s unfused kisame let alone full power 7th gate guy even though he stated he wasn’t going all out.",
                                                    "author": "SHAGGY198",
                                                    "id": "hykw3zg",
                                                    "parent_id": "t1_hyk67o4",
                                                    "score": 1,
                                                    "created_utc": 1645920351.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "Kisame ain’t that strong in the data books. Just a bit stronger than Hiashi Hyuga. So there is no comparison between Kisame and Pein.\n\nGuy could kill all the paths assuming that he can find the path that reincarnates the other paths. \n\nBut EVEN IF guy killed all the paths, he still didn’t have nature chakra to sense and find Peins REAL body. He wouldn’t even know that these weren’t really bodies, let alone how to find Pein.\n\n So Guy would save the day, kill all the paths and the. Die. Meanwhile Pein goes back to Rain, gets new bodies and comes back. \n\nIt doesn’t cost Pein very much. He would just loose some replaceable bodies.",
                            "author": "gcz77",
                            "id": "hyk4k52",
                            "parent_id": "t1_hyaisoi",
                            "score": 0,
                            "created_utc": 1645908480.0,
                            "replies": []
                        },
                        {
                            "body": "He only won cuz kisane used like ninjutsu or chakra absorbing jutsu. If he didn’t use that specific ability he could’ve won. It took guy all the way to 7 gates to barely beat kisame lol 7 gates r not doing shit to pain",
                            "author": "jonhak28",
                            "id": "hyak2ov",
                            "parent_id": "t1_hyaisoi",
                            "score": -20,
                            "created_utc": 1645736870.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "hyao445",
                                    "parent_id": "t1_hyak2ov",
                                    "score": 26,
                                    "created_utc": 1645738366.0,
                                    "replies": [
                                        {
                                            "body": "I’ll admit I haven’t watched the fight recently so maybe my memory is a little hazy but he really just won cuz kisame simply used the wrong attack unknowingly. There is no shot 7th gate is beating pain. 8th gate sure",
                                            "author": "jonhak28",
                                            "id": "hyapd5h",
                                            "parent_id": "t1_hyao445",
                                            "score": -9,
                                            "created_utc": 1645738830.0,
                                            "replies": [
                                                {
                                                    "body": "I think 7th gate no problem. The reason why it's so hard to get close to him is because physical attacks are the only thing that could really hurt him, and most long ranged physical attacks are visible. Guy can throw a punch in 7th gate form Meters away and still make contact with pain. And with that type of force I don't think almighty push could defend it. Guy also is really good at breaking down his opponents and what they are capable of. I do think he would need 7 gates, I do not think he would need the 8th gate though. It would be cool if some one could animate this though haha",
                                                    "author": null,
                                                    "id": "hyaqf0e",
                                                    "parent_id": "t1_hyapd5h",
                                                    "score": 12,
                                                    "created_utc": 1645739205.0,
                                                    "replies": [
                                                        {
                                                            "body": "Fan made stuff is always very impressive. It would be a dope fight to watch",
                                                            "author": "jonhak28",
                                                            "id": "hyaqx5n",
                                                            "parent_id": "t1_hyaqf0e",
                                                            "score": 2,
                                                            "created_utc": 1645739389.0,
                                                            "replies": []
                                                        },
                                                        {
                                                            "body": "Not commenting on who’d win, but there’s no way his long range punch breaks through almighty push.",
                                                            "author": "Oopake",
                                                            "id": "hyb8nt1",
                                                            "parent_id": "t1_hyaqf0e",
                                                            "score": 3,
                                                            "created_utc": 1645746438.0,
                                                            "replies": [
                                                                {
                                                                    "body": "Why? All we have seen is almighty push reflect physical items and attacks?",
                                                                    "author": null,
                                                                    "id": "hybset7",
                                                                    "parent_id": "t1_hyb8nt1",
                                                                    "score": 1,
                                                                    "created_utc": 1645755099.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "It took like 6 tailed Naruto to break through the almighty push Might guy was going to die against the bijuu of Naruto didn't save him I think pain claps anything but 8th gaye",
                                                                            "author": "PikaYoshl",
                                                                            "id": "hyburo8",
                                                                            "parent_id": "t1_hybset7",
                                                                            "score": 1,
                                                                            "created_utc": 1645756160.0,
                                                                            "replies": [
                                                                                {
                                                                                    "body": "We seem to forget all of these characters have different arsenals, different abilities, different personalities. This means different weaknesses. Guys 7 gates is so fast, Let alone powerful, he would be the perfect counter to pain. They just didn't leave him out of this rc just because lol",
                                                                                    "author": null,
                                                                                    "id": "hyc55a9",
                                                                                    "parent_id": "t1_hyburo8",
                                                                                    "score": 2,
                                                                                    "created_utc": 1645760946.0,
                                                                                    "replies": []
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "guy is literally the worst opponent for kisame. he is like the anti kisame. kisame gets stronger by taking Chakra. guy doesn't use Chakra...",
                            "author": "DartinBlaze448",
                            "id": "ijjljf6",
                            "parent_id": "t1_hyaisoi",
                            "score": 1,
                            "created_utc": 1660022729.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Bullshit",
                    "author": "Uzanto_Retejo",
                    "id": "hyekqh2",
                    "parent_id": "t1_hya3k3q",
                    "score": 0,
                    "created_utc": 1645810142.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "People like to claim Gai would dust the Pain if he was in village.\n\nBut last time there was invasion on village, Gai's feats in defending Konoha were no greater than someone like Asuma's.",
            "author": "DrunkSaruman",
            "id": "hyfk6f3",
            "parent_id": "t1_hya0zlq",
            "score": 2,
            "created_utc": 1645823791.0,
            "replies": [
                {
                    "body": "Ya, because Guy only breaks out 8 gates in worst case. Literally only breaks it out at when his Taijutsu is the only thing that can beat ninja god.\n\nHe didn’t break out 8 gates until he was one of the last guys fighting Madara, and even then he only broke out the 8 gates when Taisjutsu was the only thing that would work. He almost went through the biggest battle ever without using 8 gates, of course he was saving it for something huge.",
                    "author": "gcz77",
                    "id": "hyk6w36",
                    "parent_id": "t1_hyfk6f3",
                    "score": 1,
                    "created_utc": 1645909465.0,
                    "replies": [
                        {
                            "body": "Invasion of your home and your leader fighting to death would be considered the worst case and the time when people of village should give their 100% in fight.",
                            "author": "DrunkSaruman",
                            "id": "hykbu64",
                            "parent_id": "t1_hyk6w36",
                            "score": 1,
                            "created_utc": 1645911569.0,
                            "replies": [
                                {
                                    "body": "It’s obviously not the worst case given that Pein was waaay worse, and that Madara was way worse. Unless you think that sound invasion was worse than all that. Do you think so? It seemed bad, sure, but nothing like a full blown war where Kage and Elite Shinobi die.\n\nI mean there were more major deaths in Tobirama’s last battle.\n\nPut it this way, Guy only went 8th gate when he was one of the last fighters in the most important end of the world battle AND EVEN THEN he only went 8th gate when his Taijutsu was the only thing that could work.\n\nOrochimaru was bad and everything but on the scale of things it was pretty small fries, but it wasn’t like everything was screwed if Guy didn’t go 8 gates. He could fight any of the invaders without 8 gates. Who would he need to go 8 gates for. It’s not like the village was going to get destroyed or anything. There was just some damage. \n\nEven if Orochimaru didn’t get injured vs Hirizun he would have to fight Jirya, Guy and Kakashi.\n\nKonahono would have been better off with him just saving his power for the next war or something. As bad as Orochimaru is, he never came close to destroying the village.",
                                    "author": "gcz77",
                                    "id": "hyn88wj",
                                    "parent_id": "t1_hykbu64",
                                    "score": 1,
                                    "created_utc": 1645970916.0,
                                    "replies": [
                                        {
                                            "body": "None of kages died in IV war or Pain attack. Unlike durring inavison of Sand and Sound. As far as they knew, they were fighting for their survival when Orochimaru attacked. As far as they knew, village was going to get destroyed.\n\nTheir most important person in village - Hokage, was captured, that alone is reason for Gai to go all out to protect Leaf, as his subordinated.",
                                            "author": "DrunkSaruman",
                                            "id": "hynpktr",
                                            "parent_id": "t1_hyn88wj",
                                            "score": 1,
                                            "created_utc": 1645978565.0,
                                            "replies": [
                                                {
                                                    "body": "I mean, ya, the Hokage died in the attack, just like every Hokage but Hashirama. The stakes weren’t that high. They were high for that point in the series, sure. But nowhere near as high as the 9 tails attack or a real war. The Hokage did die, just like Minato and Tobirama. I mean most of the Kage we know of died in war.\n\nIt would be bad tactics to use the villages absolute ace on something so small. Imagine something serious happened, the kind of thing that might actually hurt the village as much as a war or the 9 tails attack.\n\nI mean, Orchimaru was at best the 4th most threatening attack in Orochimarus life. The 9 tails was more dangerous, Pein was Legit, and the 4th war was an end of the world situation that united every village.\n\nI mean Orochimarus attack was bad and everything but was pretty regular for Ninja history. Pein legit destroyed the village. The fourth war took 7 tailed beasts, resurrected many many ninja who were each stronger than Orochimaru, turned Madara into a god, temporary killed the next two strongest ninja. Ya, basically captured every ninja and every living Kage long before Guy even mentioned opening the 8th gate.\n\nImagine Guy opened the 8th gate for Orochimaru and a serious war, the kind were lots of S class ninja die happens. He would look silly. There were more s class ninja in Tobiramas last battle than there were in the entire Orochimaru arc.\n\nYes, the Hokage got killed, like most Hokage. But in context and compared to actual wars it was pretty small.\n\nIn that point in the story, where we don’t know anything about the wars, and Orochimaru looks like the scariest guy out there it seems like a massive deal.",
                                                    "author": "gcz77",
                                                    "id": "hyq6h7c",
                                                    "parent_id": "t1_hynpktr",
                                                    "score": 1,
                                                    "created_utc": 1646015322.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Straight facts",
            "author": "nasserg19",
            "id": "hyciive",
            "parent_id": "t1_hya0zlq",
            "score": 1,
            "created_utc": 1645768064.0,
            "replies": []
        },
        {
            "body": "Noted",
            "author": "Bewadatau",
            "id": "hybycf1",
            "parent_id": "t1_hy9w7mi",
            "score": 8,
            "created_utc": 1645757781.0,
            "replies": []
        },
        {
            "body": "He would defeat all the paths but he would've died in the process and Nagato would still be alive so it wouldn't really be worth it lol",
            "author": "ubiasedhoodfriend",
            "id": "hya80ew",
            "parent_id": "t1_hya0bpw",
            "score": 62,
            "created_utc": 1645732414.0,
            "replies": []
        },
        {
            "body": "This is just my opinion but I dont think an 8 gates Guy beats Pain, I think 7th gate has a better shot. Hear me out. I'm not saying pain is stronger than 8 gates guy, just that I think the gates would have killed Guy before he could kill pain. Imagine Guy charges up Night Guy, charges at pain, and right at the last second runs straight into an invisible chameleon and kills it but also kills himself",
            "author": "cam9704",
            "id": "hyab7kd",
            "parent_id": "t1_hya0bpw",
            "score": 33,
            "created_utc": 1645733605.0,
            "replies": [
                {
                    "body": "The night guy almost destroyed 10 tails Madara, with Guys crazy speed in the 8th gate he could probably blitz the 6 paths one after the other and kill them all with just a regular, precise punch or snap their necks or something. \n\nPain would lose in a couple of seconds if Guy went 8 gates",
                    "author": "LazyBriton",
                    "id": "hyag52i",
                    "parent_id": "t1_hyab7kd",
                    "score": 28,
                    "created_utc": 1645735426.0,
                    "replies": [
                        {
                            "body": "Well his puppets would. Nagato was off in a cave.",
                            "author": "Mr_Noms",
                            "id": "hyc5jpu",
                            "parent_id": "t1_hyag52i",
                            "score": 8,
                            "created_utc": 1645761136.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "On the other side of the planet",
            "author": "BillionDavido",
            "id": "hyaznyu",
            "parent_id": "t1_hyahu8s",
            "score": 42,
            "created_utc": 1645742746.0,
            "replies": []
        },
        {
            "body": "On his way to the village. In the anime there a scene were team Guy sees and a dust cloud coming from the area of the village. They say something must be up and they start running to the village hoping they make it in time.\n\nIt’s just to explain why Guy wasn’t there. Which at the time seemed kind of strange. But once you find out about 8 gates it’s pretty obvious that the scene is meant to explain why he didn’t open the 8th gate.",
            "author": "gcz77",
            "id": "hzixlix",
            "parent_id": "t1_hyahu8s",
            "score": 1,
            "created_utc": 1646532165.0,
            "replies": []
        },
        {
            "body": "I really don’t feel like that would require the 8th Gate. \n\nPeople really out here lowballing anime characters like they don’t take punches with the force of a ballistic missile to the dome every fight and keep brawling.",
            "author": "Xandril",
            "id": "hych6l4",
            "parent_id": "t1_hyabubj",
            "score": 11,
            "created_utc": 1645767260.0,
            "replies": [
                {
                    "body": "Or just get up from a massive impact crater kinda dusty, maybe with their hair a little messy.  \n\nHonestly I now want to see Team Guy vs the entire Russian military.  Lee’s gonna be out of control on those vodka rations!",
                    "author": "deadlysnoots",
                    "id": "hydr5kv",
                    "parent_id": "t1_hych6l4",
                    "score": 3,
                    "created_utc": 1645798274.0,
                    "replies": []
                },
                {
                    "body": "Yeah, Guy would solo the entire Russian army at just a gate or two. As a Jonin in base, he's able to react to lightning.  Which puts his speed from [around 200,000 mph](https://www.weather.gov/safety/lightning-science-negative-charged-flash#:~:text=In%20general%2C%20stepped%20leaders%20travel,200%20million%20miles%20per%20hour.) to 1/3 C. Nothing we have is touching him.",
                    "author": null,
                    "id": "hycj61k",
                    "parent_id": "t1_hych6l4",
                    "score": 3,
                    "created_utc": 1645768460.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "###[View link](https://redditsave.com/r/dankruto/comments/t0h4co/team_mighty_guy_really_skipped_the_whole_thing/)\n\n\n --- \n [**Info**](https://np.reddit.com/user/SaveVideo/comments/jv323v/info/)&#32;|&#32; [**Feedback**](https://np.reddit.com/message/compose/?to=Kryptonh&subject=Feedback for savevideo)&#32;|&#32;[**Donate**](https://ko-fi.com/getvideo) &#32;|&#32; [**DMCA**](https://np.reddit.com/message/compose/?to=Kryptonh&subject=Content removal request for savevideo&message=https://np.reddit.com//r/dankruto/comments/t0h4co/team_mighty_guy_really_skipped_the_whole_thing/) &#32;|&#32; \n [^(reddit video downloader)](https://redditsave.com) &#32;|&#32; [^(download video tiktok)](https://taksave.com)",
            "author": "SaveVideo",
            "id": "hyajn01",
            "parent_id": "t1_hyaheuu",
            "score": 1,
            "created_utc": 1645736710.0,
            "replies": []
        },
        {
            "body": "###[View link](https://redditsave.com/r/dankruto/comments/t0h4co/team_mighty_guy_really_skipped_the_whole_thing/)\n\n\n --- \n [**Info**](https://np.reddit.com/user/SaveVideo/comments/jv323v/info/)&#32;|&#32; [**Feedback**](https://np.reddit.com/message/compose/?to=Kryptonh&subject=Feedback for savevideo)&#32;|&#32;[**Donate**](https://ko-fi.com/getvideo) &#32;|&#32; [**DMCA**](https://np.reddit.com/message/compose/?to=Kryptonh&subject=Content removal request for savevideo&message=https://np.reddit.com//r/dankruto/comments/t0h4co/team_mighty_guy_really_skipped_the_whole_thing/) &#32;|&#32; \n [^(reddit video downloader)](https://redditsave.com) &#32;|&#32; [^(download video tiktok)](https://taksave.com)",
            "author": "SaveVideo",
            "id": "hyb7yfd",
            "parent_id": "t1_hyb65ij",
            "score": 0,
            "created_utc": 1645746140.0,
            "replies": []
        },
        {
            "body": "Search \"Dancing Bears Sweet Dreams\"",
            "author": "Pervizzz",
            "id": "hzd4vbg",
            "parent_id": "t1_hyckfa1",
            "score": 2,
            "created_utc": 1646427130.0,
            "replies": []
        },
        {
            "body": "This song wast eke hath used f'r quicksilv'r in x-men: apocalypse right?\n\n***\n\n\n\n^(I am a bot and I swapp'd some of thy words with Shakespeare words.)\n\nCommands: `!ShakespeareInsult`, `!fordo`, `!optout`",
            "author": "Shakespeare-Bot",
            "id": "hyclsc5",
            "parent_id": "t1_hyclrip",
            "score": 1,
            "created_utc": 1645770129.0,
            "replies": []
        },
        {
            "body": "###[View link](https://redditsave.com/r/dankruto/comments/t0h4co/team_mighty_guy_really_skipped_the_whole_thing/)\n\n\n --- \n [**Info**](https://np.reddit.com/user/SaveVideo/comments/jv323v/info/)&#32;|&#32; [**Feedback**](https://np.reddit.com/message/compose/?to=Kryptonh&subject=Feedback for savevideo)&#32;|&#32;[**Donate**](https://ko-fi.com/getvideo) &#32;|&#32; [**DMCA**](https://np.reddit.com/message/compose/?to=Kryptonh&subject=Content removal request for savevideo&message=https://np.reddit.com//r/dankruto/comments/t0h4co/team_mighty_guy_really_skipped_the_whole_thing/) &#32;|&#32; \n [^(reddit video downloader)](https://redditsave.com) &#32;|&#32; [^(download video tiktok)](https://taksave.com)",
            "author": "SaveVideo",
            "id": "i0a3p6r",
            "parent_id": "t1_i0a3ogt",
            "score": 1,
            "created_utc": 1647027865.0,
            "replies": []
        },
        {
            "body": "###[View link](https://redditsave.com/r/dankruto/comments/t0h4co/team_mighty_guy_really_skipped_the_whole_thing/)\n\n\n --- \n [**Info**](https://np.reddit.com/user/SaveVideo/comments/jv323v/info/)&#32;|&#32; [**Feedback**](https://np.reddit.com/message/compose/?to=Kryptonh&subject=Feedback for savevideo)&#32;|&#32;[**Donate**](https://ko-fi.com/getvideo) &#32;|&#32; [**DMCA**](https://np.reddit.com/message/compose/?to=Kryptonh&subject=Content removal request for savevideo&message=https://np.reddit.com//r/dankruto/comments/t0h4co/team_mighty_guy_really_skipped_the_whole_thing/) &#32;|&#32; \n [^(reddit video downloader)](https://redditsave.com) &#32;|&#32; [^(download video tiktok)](https://taksave.com)",
            "author": "SaveVideo",
            "id": "i13yjb7",
            "parent_id": "t1_i13yiqt",
            "score": 1,
            "created_utc": 1647573962.0,
            "replies": []
        },
        {
            "body": "I think he could a win with the 7th, considering he one-shot Kisame while the Akatsuki member was in his renowned element, and Guy was holding back to interrogate him. He could a held his own if he was going all out in 7 gates imo.",
            "author": "Prestigious-Bunch153",
            "id": "hyaisoi",
            "parent_id": "t1_hya3k3q",
            "score": 112,
            "created_utc": 1645736400.0,
            "replies": [
                {
                    "body": "There’s nothing 7th Gate Guy could do to Kisame that Pain couldn’t do as well. The Rinnegan is obscenely broken, Guy would *need* to open the 8th Gate to take him down because 7 just wouldn’t be enough to secure the win",
                    "author": "Adminscantkeepmedown",
                    "id": "hyalvgg",
                    "parent_id": "t1_hyaisoi",
                    "score": 57,
                    "created_utc": 1645737536.0,
                    "replies": [
                        {
                            "body": "The rinnagan is broken but the Pain bodies have low durability. The main thing he has to watch out for is chibaku tensai.",
                            "author": "infamusforever223",
                            "id": "hyawvr1",
                            "parent_id": "t1_hyalvgg",
                            "score": 47,
                            "created_utc": 1645741646.0,
                            "replies": [
                                {
                                    "body": "Low durability you sure ? Cloaked Naruto was literally looney tuning Pain across the map, including trying to bash his head in with a giant boulder, but all it did was rip his outfit.",
                                    "author": "omkar529",
                                    "id": "hybrka4",
                                    "parent_id": "t1_hyawvr1",
                                    "score": 21,
                                    "created_utc": 1645754712.0,
                                    "replies": [
                                        {
                                            "body": "The Deva path is the only one that didn't get dispatched in a couple of hits. Konahamaru even downed one with a single rasengan(keep in mind that he needed a shadow clone to hold it together) and had to be restored by the naraka path.",
                                            "author": "infamusforever223",
                                            "id": "hyc4jjv",
                                            "parent_id": "t1_hybrka4",
                                            "score": 11,
                                            "created_utc": 1645760657.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "Yeah and then he beat him with a single rasengan. That entire fight got really dumb once Naruto cloaked.",
                                            "author": "evangelism2",
                                            "id": "hycg95b",
                                            "parent_id": "t1_hybrka4",
                                            "score": 14,
                                            "created_utc": 1645766722.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "30% 7th gate = kills transformed kisame in ideal conditions \n8th gate= Beats Juubi madara\nPain = Juubi madara level????",
                            "author": "SHAGGY198",
                            "id": "hycqrhd",
                            "parent_id": "t1_hyalvgg",
                            "score": 8,
                            "created_utc": 1645773564.0,
                            "replies": [
                                {
                                    "body": "You got to remember that Madara was more or less *allowing* Guy to land some of those hits, he wanted the exhilaration of a proper fight. And even with him going easy so to speak, Minato and Kakashi were both there backing Guy up",
                                    "author": "RedShankyMan",
                                    "id": "hycu7t7",
                                    "parent_id": "t1_hycqrhd",
                                    "score": 10,
                                    "created_utc": 1645776106.0,
                                    "replies": [
                                        {
                                            "body": "He also didn't want to be hit by some of those. He tried to shield himself off when he dealt with the force of Sekizo, and then was surprised when Night Guy bends space and hits him. \n\nBut yeah Madara wasn't taking it very seriously. It's clear he was having a good time and Guy wouldn't have been able to hit Madara at all if it wasn't for Gaara, Lee, Minato and Kakashi.",
                                            "author": "Prestigious-Bunch153",
                                            "id": "hyf9ufv",
                                            "parent_id": "t1_hycu7t7",
                                            "score": 2,
                                            "created_utc": 1645819719.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "The jump between 7 gates and 8 gates is massive. 7 is, maybe, an S class technique that matches up well with Kisame because he can’t absorb chakra from it. 7 \n\nKisame is a 32.5 in the data books. But Sasori, Sanin, Itachi, Hirizun, etc. are all much higher.\n\nSo you are waay overhyping Kisame.",
                                    "author": "gcz77",
                                    "id": "hyk67o4",
                                    "parent_id": "t1_hycqrhd",
                                    "score": 1,
                                    "created_utc": 1645909181.0,
                                    "replies": [
                                        {
                                            "body": ">using data books lol\n\nAnyways that’s unfused kisame let alone full power 7th gate guy even though he stated he wasn’t going all out.",
                                            "author": "SHAGGY198",
                                            "id": "hykw3zg",
                                            "parent_id": "t1_hyk67o4",
                                            "score": 1,
                                            "created_utc": 1645920351.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Kisame ain’t that strong in the data books. Just a bit stronger than Hiashi Hyuga. So there is no comparison between Kisame and Pein.\n\nGuy could kill all the paths assuming that he can find the path that reincarnates the other paths. \n\nBut EVEN IF guy killed all the paths, he still didn’t have nature chakra to sense and find Peins REAL body. He wouldn’t even know that these weren’t really bodies, let alone how to find Pein.\n\n So Guy would save the day, kill all the paths and the. Die. Meanwhile Pein goes back to Rain, gets new bodies and comes back. \n\nIt doesn’t cost Pein very much. He would just loose some replaceable bodies.",
                    "author": "gcz77",
                    "id": "hyk4k52",
                    "parent_id": "t1_hyaisoi",
                    "score": 0,
                    "created_utc": 1645908480.0,
                    "replies": []
                },
                {
                    "body": "He only won cuz kisane used like ninjutsu or chakra absorbing jutsu. If he didn’t use that specific ability he could’ve won. It took guy all the way to 7 gates to barely beat kisame lol 7 gates r not doing shit to pain",
                    "author": "jonhak28",
                    "id": "hyak2ov",
                    "parent_id": "t1_hyaisoi",
                    "score": -20,
                    "created_utc": 1645736870.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "hyao445",
                            "parent_id": "t1_hyak2ov",
                            "score": 26,
                            "created_utc": 1645738366.0,
                            "replies": [
                                {
                                    "body": "I’ll admit I haven’t watched the fight recently so maybe my memory is a little hazy but he really just won cuz kisame simply used the wrong attack unknowingly. There is no shot 7th gate is beating pain. 8th gate sure",
                                    "author": "jonhak28",
                                    "id": "hyapd5h",
                                    "parent_id": "t1_hyao445",
                                    "score": -9,
                                    "created_utc": 1645738830.0,
                                    "replies": [
                                        {
                                            "body": "I think 7th gate no problem. The reason why it's so hard to get close to him is because physical attacks are the only thing that could really hurt him, and most long ranged physical attacks are visible. Guy can throw a punch in 7th gate form Meters away and still make contact with pain. And with that type of force I don't think almighty push could defend it. Guy also is really good at breaking down his opponents and what they are capable of. I do think he would need 7 gates, I do not think he would need the 8th gate though. It would be cool if some one could animate this though haha",
                                            "author": null,
                                            "id": "hyaqf0e",
                                            "parent_id": "t1_hyapd5h",
                                            "score": 12,
                                            "created_utc": 1645739205.0,
                                            "replies": [
                                                {
                                                    "body": "Fan made stuff is always very impressive. It would be a dope fight to watch",
                                                    "author": "jonhak28",
                                                    "id": "hyaqx5n",
                                                    "parent_id": "t1_hyaqf0e",
                                                    "score": 2,
                                                    "created_utc": 1645739389.0,
                                                    "replies": []
                                                },
                                                {
                                                    "body": "Not commenting on who’d win, but there’s no way his long range punch breaks through almighty push.",
                                                    "author": "Oopake",
                                                    "id": "hyb8nt1",
                                                    "parent_id": "t1_hyaqf0e",
                                                    "score": 3,
                                                    "created_utc": 1645746438.0,
                                                    "replies": [
                                                        {
                                                            "body": "Why? All we have seen is almighty push reflect physical items and attacks?",
                                                            "author": null,
                                                            "id": "hybset7",
                                                            "parent_id": "t1_hyb8nt1",
                                                            "score": 1,
                                                            "created_utc": 1645755099.0,
                                                            "replies": [
                                                                {
                                                                    "body": "It took like 6 tailed Naruto to break through the almighty push Might guy was going to die against the bijuu of Naruto didn't save him I think pain claps anything but 8th gaye",
                                                                    "author": "PikaYoshl",
                                                                    "id": "hyburo8",
                                                                    "parent_id": "t1_hybset7",
                                                                    "score": 1,
                                                                    "created_utc": 1645756160.0,
                                                                    "replies": [
                                                                        {
                                                                            "body": "We seem to forget all of these characters have different arsenals, different abilities, different personalities. This means different weaknesses. Guys 7 gates is so fast, Let alone powerful, he would be the perfect counter to pain. They just didn't leave him out of this rc just because lol",
                                                                            "author": null,
                                                                            "id": "hyc55a9",
                                                                            "parent_id": "t1_hyburo8",
                                                                            "score": 2,
                                                                            "created_utc": 1645760946.0,
                                                                            "replies": []
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "guy is literally the worst opponent for kisame. he is like the anti kisame. kisame gets stronger by taking Chakra. guy doesn't use Chakra...",
                    "author": "DartinBlaze448",
                    "id": "ijjljf6",
                    "parent_id": "t1_hyaisoi",
                    "score": 1,
                    "created_utc": 1660022729.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Bullshit",
            "author": "Uzanto_Retejo",
            "id": "hyekqh2",
            "parent_id": "t1_hya3k3q",
            "score": 0,
            "created_utc": 1645810142.0,
            "replies": []
        },
        {
            "body": "Ya, because Guy only breaks out 8 gates in worst case. Literally only breaks it out at when his Taijutsu is the only thing that can beat ninja god.\n\nHe didn’t break out 8 gates until he was one of the last guys fighting Madara, and even then he only broke out the 8 gates when Taisjutsu was the only thing that would work. He almost went through the biggest battle ever without using 8 gates, of course he was saving it for something huge.",
            "author": "gcz77",
            "id": "hyk6w36",
            "parent_id": "t1_hyfk6f3",
            "score": 1,
            "created_utc": 1645909465.0,
            "replies": [
                {
                    "body": "Invasion of your home and your leader fighting to death would be considered the worst case and the time when people of village should give their 100% in fight.",
                    "author": "DrunkSaruman",
                    "id": "hykbu64",
                    "parent_id": "t1_hyk6w36",
                    "score": 1,
                    "created_utc": 1645911569.0,
                    "replies": [
                        {
                            "body": "It’s obviously not the worst case given that Pein was waaay worse, and that Madara was way worse. Unless you think that sound invasion was worse than all that. Do you think so? It seemed bad, sure, but nothing like a full blown war where Kage and Elite Shinobi die.\n\nI mean there were more major deaths in Tobirama’s last battle.\n\nPut it this way, Guy only went 8th gate when he was one of the last fighters in the most important end of the world battle AND EVEN THEN he only went 8th gate when his Taijutsu was the only thing that could work.\n\nOrochimaru was bad and everything but on the scale of things it was pretty small fries, but it wasn’t like everything was screwed if Guy didn’t go 8 gates. He could fight any of the invaders without 8 gates. Who would he need to go 8 gates for. It’s not like the village was going to get destroyed or anything. There was just some damage. \n\nEven if Orochimaru didn’t get injured vs Hirizun he would have to fight Jirya, Guy and Kakashi.\n\nKonahono would have been better off with him just saving his power for the next war or something. As bad as Orochimaru is, he never came close to destroying the village.",
                            "author": "gcz77",
                            "id": "hyn88wj",
                            "parent_id": "t1_hykbu64",
                            "score": 1,
                            "created_utc": 1645970916.0,
                            "replies": [
                                {
                                    "body": "None of kages died in IV war or Pain attack. Unlike durring inavison of Sand and Sound. As far as they knew, they were fighting for their survival when Orochimaru attacked. As far as they knew, village was going to get destroyed.\n\nTheir most important person in village - Hokage, was captured, that alone is reason for Gai to go all out to protect Leaf, as his subordinated.",
                                    "author": "DrunkSaruman",
                                    "id": "hynpktr",
                                    "parent_id": "t1_hyn88wj",
                                    "score": 1,
                                    "created_utc": 1645978565.0,
                                    "replies": [
                                        {
                                            "body": "I mean, ya, the Hokage died in the attack, just like every Hokage but Hashirama. The stakes weren’t that high. They were high for that point in the series, sure. But nowhere near as high as the 9 tails attack or a real war. The Hokage did die, just like Minato and Tobirama. I mean most of the Kage we know of died in war.\n\nIt would be bad tactics to use the villages absolute ace on something so small. Imagine something serious happened, the kind of thing that might actually hurt the village as much as a war or the 9 tails attack.\n\nI mean, Orchimaru was at best the 4th most threatening attack in Orochimarus life. The 9 tails was more dangerous, Pein was Legit, and the 4th war was an end of the world situation that united every village.\n\nI mean Orochimarus attack was bad and everything but was pretty regular for Ninja history. Pein legit destroyed the village. The fourth war took 7 tailed beasts, resurrected many many ninja who were each stronger than Orochimaru, turned Madara into a god, temporary killed the next two strongest ninja. Ya, basically captured every ninja and every living Kage long before Guy even mentioned opening the 8th gate.\n\nImagine Guy opened the 8th gate for Orochimaru and a serious war, the kind were lots of S class ninja die happens. He would look silly. There were more s class ninja in Tobiramas last battle than there were in the entire Orochimaru arc.\n\nYes, the Hokage got killed, like most Hokage. But in context and compared to actual wars it was pretty small.\n\nIn that point in the story, where we don’t know anything about the wars, and Orochimaru looks like the scariest guy out there it seems like a massive deal.",
                                            "author": "gcz77",
                                            "id": "hyq6h7c",
                                            "parent_id": "t1_hynpktr",
                                            "score": 1,
                                            "created_utc": 1646015322.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "The night guy almost destroyed 10 tails Madara, with Guys crazy speed in the 8th gate he could probably blitz the 6 paths one after the other and kill them all with just a regular, precise punch or snap their necks or something. \n\nPain would lose in a couple of seconds if Guy went 8 gates",
            "author": "LazyBriton",
            "id": "hyag52i",
            "parent_id": "t1_hyab7kd",
            "score": 28,
            "created_utc": 1645735426.0,
            "replies": [
                {
                    "body": "Well his puppets would. Nagato was off in a cave.",
                    "author": "Mr_Noms",
                    "id": "hyc5jpu",
                    "parent_id": "t1_hyag52i",
                    "score": 8,
                    "created_utc": 1645761136.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Or just get up from a massive impact crater kinda dusty, maybe with their hair a little messy.  \n\nHonestly I now want to see Team Guy vs the entire Russian military.  Lee’s gonna be out of control on those vodka rations!",
            "author": "deadlysnoots",
            "id": "hydr5kv",
            "parent_id": "t1_hych6l4",
            "score": 3,
            "created_utc": 1645798274.0,
            "replies": []
        },
        {
            "body": "Yeah, Guy would solo the entire Russian army at just a gate or two. As a Jonin in base, he's able to react to lightning.  Which puts his speed from [around 200,000 mph](https://www.weather.gov/safety/lightning-science-negative-charged-flash#:~:text=In%20general%2C%20stepped%20leaders%20travel,200%20million%20miles%20per%20hour.) to 1/3 C. Nothing we have is touching him.",
            "author": null,
            "id": "hycj61k",
            "parent_id": "t1_hych6l4",
            "score": 3,
            "created_utc": 1645768460.0,
            "replies": []
        },
        {
            "body": "There’s nothing 7th Gate Guy could do to Kisame that Pain couldn’t do as well. The Rinnegan is obscenely broken, Guy would *need* to open the 8th Gate to take him down because 7 just wouldn’t be enough to secure the win",
            "author": "Adminscantkeepmedown",
            "id": "hyalvgg",
            "parent_id": "t1_hyaisoi",
            "score": 57,
            "created_utc": 1645737536.0,
            "replies": [
                {
                    "body": "The rinnagan is broken but the Pain bodies have low durability. The main thing he has to watch out for is chibaku tensai.",
                    "author": "infamusforever223",
                    "id": "hyawvr1",
                    "parent_id": "t1_hyalvgg",
                    "score": 47,
                    "created_utc": 1645741646.0,
                    "replies": [
                        {
                            "body": "Low durability you sure ? Cloaked Naruto was literally looney tuning Pain across the map, including trying to bash his head in with a giant boulder, but all it did was rip his outfit.",
                            "author": "omkar529",
                            "id": "hybrka4",
                            "parent_id": "t1_hyawvr1",
                            "score": 21,
                            "created_utc": 1645754712.0,
                            "replies": [
                                {
                                    "body": "The Deva path is the only one that didn't get dispatched in a couple of hits. Konahamaru even downed one with a single rasengan(keep in mind that he needed a shadow clone to hold it together) and had to be restored by the naraka path.",
                                    "author": "infamusforever223",
                                    "id": "hyc4jjv",
                                    "parent_id": "t1_hybrka4",
                                    "score": 11,
                                    "created_utc": 1645760657.0,
                                    "replies": []
                                },
                                {
                                    "body": "Yeah and then he beat him with a single rasengan. That entire fight got really dumb once Naruto cloaked.",
                                    "author": "evangelism2",
                                    "id": "hycg95b",
                                    "parent_id": "t1_hybrka4",
                                    "score": 14,
                                    "created_utc": 1645766722.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "30% 7th gate = kills transformed kisame in ideal conditions \n8th gate= Beats Juubi madara\nPain = Juubi madara level????",
                    "author": "SHAGGY198",
                    "id": "hycqrhd",
                    "parent_id": "t1_hyalvgg",
                    "score": 8,
                    "created_utc": 1645773564.0,
                    "replies": [
                        {
                            "body": "You got to remember that Madara was more or less *allowing* Guy to land some of those hits, he wanted the exhilaration of a proper fight. And even with him going easy so to speak, Minato and Kakashi were both there backing Guy up",
                            "author": "RedShankyMan",
                            "id": "hycu7t7",
                            "parent_id": "t1_hycqrhd",
                            "score": 10,
                            "created_utc": 1645776106.0,
                            "replies": [
                                {
                                    "body": "He also didn't want to be hit by some of those. He tried to shield himself off when he dealt with the force of Sekizo, and then was surprised when Night Guy bends space and hits him. \n\nBut yeah Madara wasn't taking it very seriously. It's clear he was having a good time and Guy wouldn't have been able to hit Madara at all if it wasn't for Gaara, Lee, Minato and Kakashi.",
                                    "author": "Prestigious-Bunch153",
                                    "id": "hyf9ufv",
                                    "parent_id": "t1_hycu7t7",
                                    "score": 2,
                                    "created_utc": 1645819719.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "The jump between 7 gates and 8 gates is massive. 7 is, maybe, an S class technique that matches up well with Kisame because he can’t absorb chakra from it. 7 \n\nKisame is a 32.5 in the data books. But Sasori, Sanin, Itachi, Hirizun, etc. are all much higher.\n\nSo you are waay overhyping Kisame.",
                            "author": "gcz77",
                            "id": "hyk67o4",
                            "parent_id": "t1_hycqrhd",
                            "score": 1,
                            "created_utc": 1645909181.0,
                            "replies": [
                                {
                                    "body": ">using data books lol\n\nAnyways that’s unfused kisame let alone full power 7th gate guy even though he stated he wasn’t going all out.",
                                    "author": "SHAGGY198",
                                    "id": "hykw3zg",
                                    "parent_id": "t1_hyk67o4",
                                    "score": 1,
                                    "created_utc": 1645920351.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Kisame ain’t that strong in the data books. Just a bit stronger than Hiashi Hyuga. So there is no comparison between Kisame and Pein.\n\nGuy could kill all the paths assuming that he can find the path that reincarnates the other paths. \n\nBut EVEN IF guy killed all the paths, he still didn’t have nature chakra to sense and find Peins REAL body. He wouldn’t even know that these weren’t really bodies, let alone how to find Pein.\n\n So Guy would save the day, kill all the paths and the. Die. Meanwhile Pein goes back to Rain, gets new bodies and comes back. \n\nIt doesn’t cost Pein very much. He would just loose some replaceable bodies.",
            "author": "gcz77",
            "id": "hyk4k52",
            "parent_id": "t1_hyaisoi",
            "score": 0,
            "created_utc": 1645908480.0,
            "replies": []
        },
        {
            "body": "He only won cuz kisane used like ninjutsu or chakra absorbing jutsu. If he didn’t use that specific ability he could’ve won. It took guy all the way to 7 gates to barely beat kisame lol 7 gates r not doing shit to pain",
            "author": "jonhak28",
            "id": "hyak2ov",
            "parent_id": "t1_hyaisoi",
            "score": -20,
            "created_utc": 1645736870.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "hyao445",
                    "parent_id": "t1_hyak2ov",
                    "score": 26,
                    "created_utc": 1645738366.0,
                    "replies": [
                        {
                            "body": "I’ll admit I haven’t watched the fight recently so maybe my memory is a little hazy but he really just won cuz kisame simply used the wrong attack unknowingly. There is no shot 7th gate is beating pain. 8th gate sure",
                            "author": "jonhak28",
                            "id": "hyapd5h",
                            "parent_id": "t1_hyao445",
                            "score": -9,
                            "created_utc": 1645738830.0,
                            "replies": [
                                {
                                    "body": "I think 7th gate no problem. The reason why it's so hard to get close to him is because physical attacks are the only thing that could really hurt him, and most long ranged physical attacks are visible. Guy can throw a punch in 7th gate form Meters away and still make contact with pain. And with that type of force I don't think almighty push could defend it. Guy also is really good at breaking down his opponents and what they are capable of. I do think he would need 7 gates, I do not think he would need the 8th gate though. It would be cool if some one could animate this though haha",
                                    "author": null,
                                    "id": "hyaqf0e",
                                    "parent_id": "t1_hyapd5h",
                                    "score": 12,
                                    "created_utc": 1645739205.0,
                                    "replies": [
                                        {
                                            "body": "Fan made stuff is always very impressive. It would be a dope fight to watch",
                                            "author": "jonhak28",
                                            "id": "hyaqx5n",
                                            "parent_id": "t1_hyaqf0e",
                                            "score": 2,
                                            "created_utc": 1645739389.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "Not commenting on who’d win, but there’s no way his long range punch breaks through almighty push.",
                                            "author": "Oopake",
                                            "id": "hyb8nt1",
                                            "parent_id": "t1_hyaqf0e",
                                            "score": 3,
                                            "created_utc": 1645746438.0,
                                            "replies": [
                                                {
                                                    "body": "Why? All we have seen is almighty push reflect physical items and attacks?",
                                                    "author": null,
                                                    "id": "hybset7",
                                                    "parent_id": "t1_hyb8nt1",
                                                    "score": 1,
                                                    "created_utc": 1645755099.0,
                                                    "replies": [
                                                        {
                                                            "body": "It took like 6 tailed Naruto to break through the almighty push Might guy was going to die against the bijuu of Naruto didn't save him I think pain claps anything but 8th gaye",
                                                            "author": "PikaYoshl",
                                                            "id": "hyburo8",
                                                            "parent_id": "t1_hybset7",
                                                            "score": 1,
                                                            "created_utc": 1645756160.0,
                                                            "replies": [
                                                                {
                                                                    "body": "We seem to forget all of these characters have different arsenals, different abilities, different personalities. This means different weaknesses. Guys 7 gates is so fast, Let alone powerful, he would be the perfect counter to pain. They just didn't leave him out of this rc just because lol",
                                                                    "author": null,
                                                                    "id": "hyc55a9",
                                                                    "parent_id": "t1_hyburo8",
                                                                    "score": 2,
                                                                    "created_utc": 1645760946.0,
                                                                    "replies": []
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "guy is literally the worst opponent for kisame. he is like the anti kisame. kisame gets stronger by taking Chakra. guy doesn't use Chakra...",
            "author": "DartinBlaze448",
            "id": "ijjljf6",
            "parent_id": "t1_hyaisoi",
            "score": 1,
            "created_utc": 1660022729.0,
            "replies": []
        },
        {
            "body": "Invasion of your home and your leader fighting to death would be considered the worst case and the time when people of village should give their 100% in fight.",
            "author": "DrunkSaruman",
            "id": "hykbu64",
            "parent_id": "t1_hyk6w36",
            "score": 1,
            "created_utc": 1645911569.0,
            "replies": [
                {
                    "body": "It’s obviously not the worst case given that Pein was waaay worse, and that Madara was way worse. Unless you think that sound invasion was worse than all that. Do you think so? It seemed bad, sure, but nothing like a full blown war where Kage and Elite Shinobi die.\n\nI mean there were more major deaths in Tobirama’s last battle.\n\nPut it this way, Guy only went 8th gate when he was one of the last fighters in the most important end of the world battle AND EVEN THEN he only went 8th gate when his Taijutsu was the only thing that could work.\n\nOrochimaru was bad and everything but on the scale of things it was pretty small fries, but it wasn’t like everything was screwed if Guy didn’t go 8 gates. He could fight any of the invaders without 8 gates. Who would he need to go 8 gates for. It’s not like the village was going to get destroyed or anything. There was just some damage. \n\nEven if Orochimaru didn’t get injured vs Hirizun he would have to fight Jirya, Guy and Kakashi.\n\nKonahono would have been better off with him just saving his power for the next war or something. As bad as Orochimaru is, he never came close to destroying the village.",
                    "author": "gcz77",
                    "id": "hyn88wj",
                    "parent_id": "t1_hykbu64",
                    "score": 1,
                    "created_utc": 1645970916.0,
                    "replies": [
                        {
                            "body": "None of kages died in IV war or Pain attack. Unlike durring inavison of Sand and Sound. As far as they knew, they were fighting for their survival when Orochimaru attacked. As far as they knew, village was going to get destroyed.\n\nTheir most important person in village - Hokage, was captured, that alone is reason for Gai to go all out to protect Leaf, as his subordinated.",
                            "author": "DrunkSaruman",
                            "id": "hynpktr",
                            "parent_id": "t1_hyn88wj",
                            "score": 1,
                            "created_utc": 1645978565.0,
                            "replies": [
                                {
                                    "body": "I mean, ya, the Hokage died in the attack, just like every Hokage but Hashirama. The stakes weren’t that high. They were high for that point in the series, sure. But nowhere near as high as the 9 tails attack or a real war. The Hokage did die, just like Minato and Tobirama. I mean most of the Kage we know of died in war.\n\nIt would be bad tactics to use the villages absolute ace on something so small. Imagine something serious happened, the kind of thing that might actually hurt the village as much as a war or the 9 tails attack.\n\nI mean, Orchimaru was at best the 4th most threatening attack in Orochimarus life. The 9 tails was more dangerous, Pein was Legit, and the 4th war was an end of the world situation that united every village.\n\nI mean Orochimarus attack was bad and everything but was pretty regular for Ninja history. Pein legit destroyed the village. The fourth war took 7 tailed beasts, resurrected many many ninja who were each stronger than Orochimaru, turned Madara into a god, temporary killed the next two strongest ninja. Ya, basically captured every ninja and every living Kage long before Guy even mentioned opening the 8th gate.\n\nImagine Guy opened the 8th gate for Orochimaru and a serious war, the kind were lots of S class ninja die happens. He would look silly. There were more s class ninja in Tobiramas last battle than there were in the entire Orochimaru arc.\n\nYes, the Hokage got killed, like most Hokage. But in context and compared to actual wars it was pretty small.\n\nIn that point in the story, where we don’t know anything about the wars, and Orochimaru looks like the scariest guy out there it seems like a massive deal.",
                                    "author": "gcz77",
                                    "id": "hyq6h7c",
                                    "parent_id": "t1_hynpktr",
                                    "score": 1,
                                    "created_utc": 1646015322.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Well his puppets would. Nagato was off in a cave.",
            "author": "Mr_Noms",
            "id": "hyc5jpu",
            "parent_id": "t1_hyag52i",
            "score": 8,
            "created_utc": 1645761136.0,
            "replies": []
        },
        {
            "body": "The rinnagan is broken but the Pain bodies have low durability. The main thing he has to watch out for is chibaku tensai.",
            "author": "infamusforever223",
            "id": "hyawvr1",
            "parent_id": "t1_hyalvgg",
            "score": 47,
            "created_utc": 1645741646.0,
            "replies": [
                {
                    "body": "Low durability you sure ? Cloaked Naruto was literally looney tuning Pain across the map, including trying to bash his head in with a giant boulder, but all it did was rip his outfit.",
                    "author": "omkar529",
                    "id": "hybrka4",
                    "parent_id": "t1_hyawvr1",
                    "score": 21,
                    "created_utc": 1645754712.0,
                    "replies": [
                        {
                            "body": "The Deva path is the only one that didn't get dispatched in a couple of hits. Konahamaru even downed one with a single rasengan(keep in mind that he needed a shadow clone to hold it together) and had to be restored by the naraka path.",
                            "author": "infamusforever223",
                            "id": "hyc4jjv",
                            "parent_id": "t1_hybrka4",
                            "score": 11,
                            "created_utc": 1645760657.0,
                            "replies": []
                        },
                        {
                            "body": "Yeah and then he beat him with a single rasengan. That entire fight got really dumb once Naruto cloaked.",
                            "author": "evangelism2",
                            "id": "hycg95b",
                            "parent_id": "t1_hybrka4",
                            "score": 14,
                            "created_utc": 1645766722.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "30% 7th gate = kills transformed kisame in ideal conditions \n8th gate= Beats Juubi madara\nPain = Juubi madara level????",
            "author": "SHAGGY198",
            "id": "hycqrhd",
            "parent_id": "t1_hyalvgg",
            "score": 8,
            "created_utc": 1645773564.0,
            "replies": [
                {
                    "body": "You got to remember that Madara was more or less *allowing* Guy to land some of those hits, he wanted the exhilaration of a proper fight. And even with him going easy so to speak, Minato and Kakashi were both there backing Guy up",
                    "author": "RedShankyMan",
                    "id": "hycu7t7",
                    "parent_id": "t1_hycqrhd",
                    "score": 10,
                    "created_utc": 1645776106.0,
                    "replies": [
                        {
                            "body": "He also didn't want to be hit by some of those. He tried to shield himself off when he dealt with the force of Sekizo, and then was surprised when Night Guy bends space and hits him. \n\nBut yeah Madara wasn't taking it very seriously. It's clear he was having a good time and Guy wouldn't have been able to hit Madara at all if it wasn't for Gaara, Lee, Minato and Kakashi.",
                            "author": "Prestigious-Bunch153",
                            "id": "hyf9ufv",
                            "parent_id": "t1_hycu7t7",
                            "score": 2,
                            "created_utc": 1645819719.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "The jump between 7 gates and 8 gates is massive. 7 is, maybe, an S class technique that matches up well with Kisame because he can’t absorb chakra from it. 7 \n\nKisame is a 32.5 in the data books. But Sasori, Sanin, Itachi, Hirizun, etc. are all much higher.\n\nSo you are waay overhyping Kisame.",
                    "author": "gcz77",
                    "id": "hyk67o4",
                    "parent_id": "t1_hycqrhd",
                    "score": 1,
                    "created_utc": 1645909181.0,
                    "replies": [
                        {
                            "body": ">using data books lol\n\nAnyways that’s unfused kisame let alone full power 7th gate guy even though he stated he wasn’t going all out.",
                            "author": "SHAGGY198",
                            "id": "hykw3zg",
                            "parent_id": "t1_hyk67o4",
                            "score": 1,
                            "created_utc": 1645920351.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "hyao445",
            "parent_id": "t1_hyak2ov",
            "score": 26,
            "created_utc": 1645738366.0,
            "replies": [
                {
                    "body": "I’ll admit I haven’t watched the fight recently so maybe my memory is a little hazy but he really just won cuz kisame simply used the wrong attack unknowingly. There is no shot 7th gate is beating pain. 8th gate sure",
                    "author": "jonhak28",
                    "id": "hyapd5h",
                    "parent_id": "t1_hyao445",
                    "score": -9,
                    "created_utc": 1645738830.0,
                    "replies": [
                        {
                            "body": "I think 7th gate no problem. The reason why it's so hard to get close to him is because physical attacks are the only thing that could really hurt him, and most long ranged physical attacks are visible. Guy can throw a punch in 7th gate form Meters away and still make contact with pain. And with that type of force I don't think almighty push could defend it. Guy also is really good at breaking down his opponents and what they are capable of. I do think he would need 7 gates, I do not think he would need the 8th gate though. It would be cool if some one could animate this though haha",
                            "author": null,
                            "id": "hyaqf0e",
                            "parent_id": "t1_hyapd5h",
                            "score": 12,
                            "created_utc": 1645739205.0,
                            "replies": [
                                {
                                    "body": "Fan made stuff is always very impressive. It would be a dope fight to watch",
                                    "author": "jonhak28",
                                    "id": "hyaqx5n",
                                    "parent_id": "t1_hyaqf0e",
                                    "score": 2,
                                    "created_utc": 1645739389.0,
                                    "replies": []
                                },
                                {
                                    "body": "Not commenting on who’d win, but there’s no way his long range punch breaks through almighty push.",
                                    "author": "Oopake",
                                    "id": "hyb8nt1",
                                    "parent_id": "t1_hyaqf0e",
                                    "score": 3,
                                    "created_utc": 1645746438.0,
                                    "replies": [
                                        {
                                            "body": "Why? All we have seen is almighty push reflect physical items and attacks?",
                                            "author": null,
                                            "id": "hybset7",
                                            "parent_id": "t1_hyb8nt1",
                                            "score": 1,
                                            "created_utc": 1645755099.0,
                                            "replies": [
                                                {
                                                    "body": "It took like 6 tailed Naruto to break through the almighty push Might guy was going to die against the bijuu of Naruto didn't save him I think pain claps anything but 8th gaye",
                                                    "author": "PikaYoshl",
                                                    "id": "hyburo8",
                                                    "parent_id": "t1_hybset7",
                                                    "score": 1,
                                                    "created_utc": 1645756160.0,
                                                    "replies": [
                                                        {
                                                            "body": "We seem to forget all of these characters have different arsenals, different abilities, different personalities. This means different weaknesses. Guys 7 gates is so fast, Let alone powerful, he would be the perfect counter to pain. They just didn't leave him out of this rc just because lol",
                                                            "author": null,
                                                            "id": "hyc55a9",
                                                            "parent_id": "t1_hyburo8",
                                                            "score": 2,
                                                            "created_utc": 1645760946.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "It’s obviously not the worst case given that Pein was waaay worse, and that Madara was way worse. Unless you think that sound invasion was worse than all that. Do you think so? It seemed bad, sure, but nothing like a full blown war where Kage and Elite Shinobi die.\n\nI mean there were more major deaths in Tobirama’s last battle.\n\nPut it this way, Guy only went 8th gate when he was one of the last fighters in the most important end of the world battle AND EVEN THEN he only went 8th gate when his Taijutsu was the only thing that could work.\n\nOrochimaru was bad and everything but on the scale of things it was pretty small fries, but it wasn’t like everything was screwed if Guy didn’t go 8 gates. He could fight any of the invaders without 8 gates. Who would he need to go 8 gates for. It’s not like the village was going to get destroyed or anything. There was just some damage. \n\nEven if Orochimaru didn’t get injured vs Hirizun he would have to fight Jirya, Guy and Kakashi.\n\nKonahono would have been better off with him just saving his power for the next war or something. As bad as Orochimaru is, he never came close to destroying the village.",
            "author": "gcz77",
            "id": "hyn88wj",
            "parent_id": "t1_hykbu64",
            "score": 1,
            "created_utc": 1645970916.0,
            "replies": [
                {
                    "body": "None of kages died in IV war or Pain attack. Unlike durring inavison of Sand and Sound. As far as they knew, they were fighting for their survival when Orochimaru attacked. As far as they knew, village was going to get destroyed.\n\nTheir most important person in village - Hokage, was captured, that alone is reason for Gai to go all out to protect Leaf, as his subordinated.",
                    "author": "DrunkSaruman",
                    "id": "hynpktr",
                    "parent_id": "t1_hyn88wj",
                    "score": 1,
                    "created_utc": 1645978565.0,
                    "replies": [
                        {
                            "body": "I mean, ya, the Hokage died in the attack, just like every Hokage but Hashirama. The stakes weren’t that high. They were high for that point in the series, sure. But nowhere near as high as the 9 tails attack or a real war. The Hokage did die, just like Minato and Tobirama. I mean most of the Kage we know of died in war.\n\nIt would be bad tactics to use the villages absolute ace on something so small. Imagine something serious happened, the kind of thing that might actually hurt the village as much as a war or the 9 tails attack.\n\nI mean, Orchimaru was at best the 4th most threatening attack in Orochimarus life. The 9 tails was more dangerous, Pein was Legit, and the 4th war was an end of the world situation that united every village.\n\nI mean Orochimarus attack was bad and everything but was pretty regular for Ninja history. Pein legit destroyed the village. The fourth war took 7 tailed beasts, resurrected many many ninja who were each stronger than Orochimaru, turned Madara into a god, temporary killed the next two strongest ninja. Ya, basically captured every ninja and every living Kage long before Guy even mentioned opening the 8th gate.\n\nImagine Guy opened the 8th gate for Orochimaru and a serious war, the kind were lots of S class ninja die happens. He would look silly. There were more s class ninja in Tobiramas last battle than there were in the entire Orochimaru arc.\n\nYes, the Hokage got killed, like most Hokage. But in context and compared to actual wars it was pretty small.\n\nIn that point in the story, where we don’t know anything about the wars, and Orochimaru looks like the scariest guy out there it seems like a massive deal.",
                            "author": "gcz77",
                            "id": "hyq6h7c",
                            "parent_id": "t1_hynpktr",
                            "score": 1,
                            "created_utc": 1646015322.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Low durability you sure ? Cloaked Naruto was literally looney tuning Pain across the map, including trying to bash his head in with a giant boulder, but all it did was rip his outfit.",
            "author": "omkar529",
            "id": "hybrka4",
            "parent_id": "t1_hyawvr1",
            "score": 21,
            "created_utc": 1645754712.0,
            "replies": [
                {
                    "body": "The Deva path is the only one that didn't get dispatched in a couple of hits. Konahamaru even downed one with a single rasengan(keep in mind that he needed a shadow clone to hold it together) and had to be restored by the naraka path.",
                    "author": "infamusforever223",
                    "id": "hyc4jjv",
                    "parent_id": "t1_hybrka4",
                    "score": 11,
                    "created_utc": 1645760657.0,
                    "replies": []
                },
                {
                    "body": "Yeah and then he beat him with a single rasengan. That entire fight got really dumb once Naruto cloaked.",
                    "author": "evangelism2",
                    "id": "hycg95b",
                    "parent_id": "t1_hybrka4",
                    "score": 14,
                    "created_utc": 1645766722.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "You got to remember that Madara was more or less *allowing* Guy to land some of those hits, he wanted the exhilaration of a proper fight. And even with him going easy so to speak, Minato and Kakashi were both there backing Guy up",
            "author": "RedShankyMan",
            "id": "hycu7t7",
            "parent_id": "t1_hycqrhd",
            "score": 10,
            "created_utc": 1645776106.0,
            "replies": [
                {
                    "body": "He also didn't want to be hit by some of those. He tried to shield himself off when he dealt with the force of Sekizo, and then was surprised when Night Guy bends space and hits him. \n\nBut yeah Madara wasn't taking it very seriously. It's clear he was having a good time and Guy wouldn't have been able to hit Madara at all if it wasn't for Gaara, Lee, Minato and Kakashi.",
                    "author": "Prestigious-Bunch153",
                    "id": "hyf9ufv",
                    "parent_id": "t1_hycu7t7",
                    "score": 2,
                    "created_utc": 1645819719.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "The jump between 7 gates and 8 gates is massive. 7 is, maybe, an S class technique that matches up well with Kisame because he can’t absorb chakra from it. 7 \n\nKisame is a 32.5 in the data books. But Sasori, Sanin, Itachi, Hirizun, etc. are all much higher.\n\nSo you are waay overhyping Kisame.",
            "author": "gcz77",
            "id": "hyk67o4",
            "parent_id": "t1_hycqrhd",
            "score": 1,
            "created_utc": 1645909181.0,
            "replies": [
                {
                    "body": ">using data books lol\n\nAnyways that’s unfused kisame let alone full power 7th gate guy even though he stated he wasn’t going all out.",
                    "author": "SHAGGY198",
                    "id": "hykw3zg",
                    "parent_id": "t1_hyk67o4",
                    "score": 1,
                    "created_utc": 1645920351.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I’ll admit I haven’t watched the fight recently so maybe my memory is a little hazy but he really just won cuz kisame simply used the wrong attack unknowingly. There is no shot 7th gate is beating pain. 8th gate sure",
            "author": "jonhak28",
            "id": "hyapd5h",
            "parent_id": "t1_hyao445",
            "score": -9,
            "created_utc": 1645738830.0,
            "replies": [
                {
                    "body": "I think 7th gate no problem. The reason why it's so hard to get close to him is because physical attacks are the only thing that could really hurt him, and most long ranged physical attacks are visible. Guy can throw a punch in 7th gate form Meters away and still make contact with pain. And with that type of force I don't think almighty push could defend it. Guy also is really good at breaking down his opponents and what they are capable of. I do think he would need 7 gates, I do not think he would need the 8th gate though. It would be cool if some one could animate this though haha",
                    "author": null,
                    "id": "hyaqf0e",
                    "parent_id": "t1_hyapd5h",
                    "score": 12,
                    "created_utc": 1645739205.0,
                    "replies": [
                        {
                            "body": "Fan made stuff is always very impressive. It would be a dope fight to watch",
                            "author": "jonhak28",
                            "id": "hyaqx5n",
                            "parent_id": "t1_hyaqf0e",
                            "score": 2,
                            "created_utc": 1645739389.0,
                            "replies": []
                        },
                        {
                            "body": "Not commenting on who’d win, but there’s no way his long range punch breaks through almighty push.",
                            "author": "Oopake",
                            "id": "hyb8nt1",
                            "parent_id": "t1_hyaqf0e",
                            "score": 3,
                            "created_utc": 1645746438.0,
                            "replies": [
                                {
                                    "body": "Why? All we have seen is almighty push reflect physical items and attacks?",
                                    "author": null,
                                    "id": "hybset7",
                                    "parent_id": "t1_hyb8nt1",
                                    "score": 1,
                                    "created_utc": 1645755099.0,
                                    "replies": [
                                        {
                                            "body": "It took like 6 tailed Naruto to break through the almighty push Might guy was going to die against the bijuu of Naruto didn't save him I think pain claps anything but 8th gaye",
                                            "author": "PikaYoshl",
                                            "id": "hyburo8",
                                            "parent_id": "t1_hybset7",
                                            "score": 1,
                                            "created_utc": 1645756160.0,
                                            "replies": [
                                                {
                                                    "body": "We seem to forget all of these characters have different arsenals, different abilities, different personalities. This means different weaknesses. Guys 7 gates is so fast, Let alone powerful, he would be the perfect counter to pain. They just didn't leave him out of this rc just because lol",
                                                    "author": null,
                                                    "id": "hyc55a9",
                                                    "parent_id": "t1_hyburo8",
                                                    "score": 2,
                                                    "created_utc": 1645760946.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "None of kages died in IV war or Pain attack. Unlike durring inavison of Sand and Sound. As far as they knew, they were fighting for their survival when Orochimaru attacked. As far as they knew, village was going to get destroyed.\n\nTheir most important person in village - Hokage, was captured, that alone is reason for Gai to go all out to protect Leaf, as his subordinated.",
            "author": "DrunkSaruman",
            "id": "hynpktr",
            "parent_id": "t1_hyn88wj",
            "score": 1,
            "created_utc": 1645978565.0,
            "replies": [
                {
                    "body": "I mean, ya, the Hokage died in the attack, just like every Hokage but Hashirama. The stakes weren’t that high. They were high for that point in the series, sure. But nowhere near as high as the 9 tails attack or a real war. The Hokage did die, just like Minato and Tobirama. I mean most of the Kage we know of died in war.\n\nIt would be bad tactics to use the villages absolute ace on something so small. Imagine something serious happened, the kind of thing that might actually hurt the village as much as a war or the 9 tails attack.\n\nI mean, Orchimaru was at best the 4th most threatening attack in Orochimarus life. The 9 tails was more dangerous, Pein was Legit, and the 4th war was an end of the world situation that united every village.\n\nI mean Orochimarus attack was bad and everything but was pretty regular for Ninja history. Pein legit destroyed the village. The fourth war took 7 tailed beasts, resurrected many many ninja who were each stronger than Orochimaru, turned Madara into a god, temporary killed the next two strongest ninja. Ya, basically captured every ninja and every living Kage long before Guy even mentioned opening the 8th gate.\n\nImagine Guy opened the 8th gate for Orochimaru and a serious war, the kind were lots of S class ninja die happens. He would look silly. There were more s class ninja in Tobiramas last battle than there were in the entire Orochimaru arc.\n\nYes, the Hokage got killed, like most Hokage. But in context and compared to actual wars it was pretty small.\n\nIn that point in the story, where we don’t know anything about the wars, and Orochimaru looks like the scariest guy out there it seems like a massive deal.",
                    "author": "gcz77",
                    "id": "hyq6h7c",
                    "parent_id": "t1_hynpktr",
                    "score": 1,
                    "created_utc": 1646015322.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "The Deva path is the only one that didn't get dispatched in a couple of hits. Konahamaru even downed one with a single rasengan(keep in mind that he needed a shadow clone to hold it together) and had to be restored by the naraka path.",
            "author": "infamusforever223",
            "id": "hyc4jjv",
            "parent_id": "t1_hybrka4",
            "score": 11,
            "created_utc": 1645760657.0,
            "replies": []
        },
        {
            "body": "Yeah and then he beat him with a single rasengan. That entire fight got really dumb once Naruto cloaked.",
            "author": "evangelism2",
            "id": "hycg95b",
            "parent_id": "t1_hybrka4",
            "score": 14,
            "created_utc": 1645766722.0,
            "replies": []
        },
        {
            "body": "He also didn't want to be hit by some of those. He tried to shield himself off when he dealt with the force of Sekizo, and then was surprised when Night Guy bends space and hits him. \n\nBut yeah Madara wasn't taking it very seriously. It's clear he was having a good time and Guy wouldn't have been able to hit Madara at all if it wasn't for Gaara, Lee, Minato and Kakashi.",
            "author": "Prestigious-Bunch153",
            "id": "hyf9ufv",
            "parent_id": "t1_hycu7t7",
            "score": 2,
            "created_utc": 1645819719.0,
            "replies": []
        },
        {
            "body": ">using data books lol\n\nAnyways that’s unfused kisame let alone full power 7th gate guy even though he stated he wasn’t going all out.",
            "author": "SHAGGY198",
            "id": "hykw3zg",
            "parent_id": "t1_hyk67o4",
            "score": 1,
            "created_utc": 1645920351.0,
            "replies": []
        },
        {
            "body": "I think 7th gate no problem. The reason why it's so hard to get close to him is because physical attacks are the only thing that could really hurt him, and most long ranged physical attacks are visible. Guy can throw a punch in 7th gate form Meters away and still make contact with pain. And with that type of force I don't think almighty push could defend it. Guy also is really good at breaking down his opponents and what they are capable of. I do think he would need 7 gates, I do not think he would need the 8th gate though. It would be cool if some one could animate this though haha",
            "author": null,
            "id": "hyaqf0e",
            "parent_id": "t1_hyapd5h",
            "score": 12,
            "created_utc": 1645739205.0,
            "replies": [
                {
                    "body": "Fan made stuff is always very impressive. It would be a dope fight to watch",
                    "author": "jonhak28",
                    "id": "hyaqx5n",
                    "parent_id": "t1_hyaqf0e",
                    "score": 2,
                    "created_utc": 1645739389.0,
                    "replies": []
                },
                {
                    "body": "Not commenting on who’d win, but there’s no way his long range punch breaks through almighty push.",
                    "author": "Oopake",
                    "id": "hyb8nt1",
                    "parent_id": "t1_hyaqf0e",
                    "score": 3,
                    "created_utc": 1645746438.0,
                    "replies": [
                        {
                            "body": "Why? All we have seen is almighty push reflect physical items and attacks?",
                            "author": null,
                            "id": "hybset7",
                            "parent_id": "t1_hyb8nt1",
                            "score": 1,
                            "created_utc": 1645755099.0,
                            "replies": [
                                {
                                    "body": "It took like 6 tailed Naruto to break through the almighty push Might guy was going to die against the bijuu of Naruto didn't save him I think pain claps anything but 8th gaye",
                                    "author": "PikaYoshl",
                                    "id": "hyburo8",
                                    "parent_id": "t1_hybset7",
                                    "score": 1,
                                    "created_utc": 1645756160.0,
                                    "replies": [
                                        {
                                            "body": "We seem to forget all of these characters have different arsenals, different abilities, different personalities. This means different weaknesses. Guys 7 gates is so fast, Let alone powerful, he would be the perfect counter to pain. They just didn't leave him out of this rc just because lol",
                                            "author": null,
                                            "id": "hyc55a9",
                                            "parent_id": "t1_hyburo8",
                                            "score": 2,
                                            "created_utc": 1645760946.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I mean, ya, the Hokage died in the attack, just like every Hokage but Hashirama. The stakes weren’t that high. They were high for that point in the series, sure. But nowhere near as high as the 9 tails attack or a real war. The Hokage did die, just like Minato and Tobirama. I mean most of the Kage we know of died in war.\n\nIt would be bad tactics to use the villages absolute ace on something so small. Imagine something serious happened, the kind of thing that might actually hurt the village as much as a war or the 9 tails attack.\n\nI mean, Orchimaru was at best the 4th most threatening attack in Orochimarus life. The 9 tails was more dangerous, Pein was Legit, and the 4th war was an end of the world situation that united every village.\n\nI mean Orochimarus attack was bad and everything but was pretty regular for Ninja history. Pein legit destroyed the village. The fourth war took 7 tailed beasts, resurrected many many ninja who were each stronger than Orochimaru, turned Madara into a god, temporary killed the next two strongest ninja. Ya, basically captured every ninja and every living Kage long before Guy even mentioned opening the 8th gate.\n\nImagine Guy opened the 8th gate for Orochimaru and a serious war, the kind were lots of S class ninja die happens. He would look silly. There were more s class ninja in Tobiramas last battle than there were in the entire Orochimaru arc.\n\nYes, the Hokage got killed, like most Hokage. But in context and compared to actual wars it was pretty small.\n\nIn that point in the story, where we don’t know anything about the wars, and Orochimaru looks like the scariest guy out there it seems like a massive deal.",
            "author": "gcz77",
            "id": "hyq6h7c",
            "parent_id": "t1_hynpktr",
            "score": 1,
            "created_utc": 1646015322.0,
            "replies": []
        },
        {
            "body": "Fan made stuff is always very impressive. It would be a dope fight to watch",
            "author": "jonhak28",
            "id": "hyaqx5n",
            "parent_id": "t1_hyaqf0e",
            "score": 2,
            "created_utc": 1645739389.0,
            "replies": []
        },
        {
            "body": "Not commenting on who’d win, but there’s no way his long range punch breaks through almighty push.",
            "author": "Oopake",
            "id": "hyb8nt1",
            "parent_id": "t1_hyaqf0e",
            "score": 3,
            "created_utc": 1645746438.0,
            "replies": [
                {
                    "body": "Why? All we have seen is almighty push reflect physical items and attacks?",
                    "author": null,
                    "id": "hybset7",
                    "parent_id": "t1_hyb8nt1",
                    "score": 1,
                    "created_utc": 1645755099.0,
                    "replies": [
                        {
                            "body": "It took like 6 tailed Naruto to break through the almighty push Might guy was going to die against the bijuu of Naruto didn't save him I think pain claps anything but 8th gaye",
                            "author": "PikaYoshl",
                            "id": "hyburo8",
                            "parent_id": "t1_hybset7",
                            "score": 1,
                            "created_utc": 1645756160.0,
                            "replies": [
                                {
                                    "body": "We seem to forget all of these characters have different arsenals, different abilities, different personalities. This means different weaknesses. Guys 7 gates is so fast, Let alone powerful, he would be the perfect counter to pain. They just didn't leave him out of this rc just because lol",
                                    "author": null,
                                    "id": "hyc55a9",
                                    "parent_id": "t1_hyburo8",
                                    "score": 2,
                                    "created_utc": 1645760946.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Why? All we have seen is almighty push reflect physical items and attacks?",
            "author": null,
            "id": "hybset7",
            "parent_id": "t1_hyb8nt1",
            "score": 1,
            "created_utc": 1645755099.0,
            "replies": [
                {
                    "body": "It took like 6 tailed Naruto to break through the almighty push Might guy was going to die against the bijuu of Naruto didn't save him I think pain claps anything but 8th gaye",
                    "author": "PikaYoshl",
                    "id": "hyburo8",
                    "parent_id": "t1_hybset7",
                    "score": 1,
                    "created_utc": 1645756160.0,
                    "replies": [
                        {
                            "body": "We seem to forget all of these characters have different arsenals, different abilities, different personalities. This means different weaknesses. Guys 7 gates is so fast, Let alone powerful, he would be the perfect counter to pain. They just didn't leave him out of this rc just because lol",
                            "author": null,
                            "id": "hyc55a9",
                            "parent_id": "t1_hyburo8",
                            "score": 2,
                            "created_utc": 1645760946.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "It took like 6 tailed Naruto to break through the almighty push Might guy was going to die against the bijuu of Naruto didn't save him I think pain claps anything but 8th gaye",
            "author": "PikaYoshl",
            "id": "hyburo8",
            "parent_id": "t1_hybset7",
            "score": 1,
            "created_utc": 1645756160.0,
            "replies": [
                {
                    "body": "We seem to forget all of these characters have different arsenals, different abilities, different personalities. This means different weaknesses. Guys 7 gates is so fast, Let alone powerful, he would be the perfect counter to pain. They just didn't leave him out of this rc just because lol",
                    "author": null,
                    "id": "hyc55a9",
                    "parent_id": "t1_hyburo8",
                    "score": 2,
                    "created_utc": 1645760946.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "We seem to forget all of these characters have different arsenals, different abilities, different personalities. This means different weaknesses. Guys 7 gates is so fast, Let alone powerful, he would be the perfect counter to pain. They just didn't leave him out of this rc just because lol",
            "author": null,
            "id": "hyc55a9",
            "parent_id": "t1_hyburo8",
            "score": 2,
            "created_utc": 1645760946.0,
            "replies": []
        }
    ]
}