{
    "title": "Sugar Relationships Aren't A Solution to Men's Problems With Women",
    "post_id": "s6wn62",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/s6wn62/sugar_relationships_arent_a_solution_to_mens/",
    "author": null,
    "body": "This is in reference to several recent threads where the SD clearly had no understanding of how female attraction works, and suffered the consequences (being ghosted, blown off, etc).\n\nAn SR is a romantic/ sexual relationship. \n\nThe direct exchange of money (sugar) doesn't absolve men from needing to present as attractive, in whatever way that means to the SD. It seems some (not all) men in this lifestyle think that just offering a wallet is enough to guarantee the attention of attractive, young women. (It's not.)\n\nFor the best possible experience, SDs should invest time, energy, & resources into being as physically/ emotionally attractive as possible. Including: grooming & style, building a body you are proud of, learning how women feel sexual attraction, and doing those actions. As well as not doing other actions that turn women off (oversharing, texting every day for weeks like girlfriends, being unattractive, etc.)\n\nImo, men who struggle with women in non-sugar dating, will have the same problems in SR until the core issues are addressed, and overcome. \n\nResources I recommend are working with a personal trainer, getting fashion/ image advice, reading books about seduction (Crucial). I have a list of 3 books all men should read on this topic, DM me if interested.",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/s6wn62/sugar_relationships_arent_a_solution_to_mens/",
    "score": 98,
    "upvote_ratio": 0.8,
    "created_utc": 1642509738.0,
    "num_comments": 122,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "Can't argue with any of this. To me romance is part of the fun of sugar, and in any relationship romance is about learning your partner's likes, dislikes, wants, needs, and focusing on giving them those things that make them feel appreciated and seen and safe with you. If you're all up in your own ego, fat chance of this happening, and your relationship is probably doomed.\n\nMoney, in general, isn't going to paper over much of anything besides need for food and shelter, but it doesn't fix deeper seeded issues or any hole in one's life. There are many people who need to work on themselves before they are ready for *any* kind of meaningful romantic relationship.",
            "author": "roscoe7585",
            "id": "ht6k9hd",
            "parent_id": "t3_s6wn62",
            "score": 20,
            "created_utc": 1642517435.0,
            "replies": [
                {
                    "body": "Deep seated",
                    "author": "handbookforgangsters",
                    "id": "ht7wl01",
                    "parent_id": "t1_ht6k9hd",
                    "score": 2,
                    "created_utc": 1642535610.0,
                    "replies": []
                },
                {
                    "body": "🏆\n\nPerfectly stated, you win the thread.",
                    "author": null,
                    "id": "ht6t4wu",
                    "parent_id": "t1_ht6k9hd",
                    "score": 1,
                    "created_utc": 1642520986.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "You make good sense but you may be preaching to the choir here. Most of the SDs that contribute to this forum understand that a good SR is more than sex and money. And I fear the men who need to understand your comment will not be influenced. But thank you for reminding all that sugar life is still life.",
            "author": "AFSMSgt",
            "id": "ht68o6h",
            "parent_id": "t3_s6wn62",
            "score": 36,
            "created_utc": 1642512061.0,
            "replies": [
                {
                    "body": "I appreciate your rational, not furiously angry, comment. \n\nI believe there's a trend, at least in this forum, of men thinking that the traditional rules don't apply, because money is directly involved. Then posting here, \"what did I do wrong???\"",
                    "author": null,
                    "id": "ht69ftd",
                    "parent_id": "t1_ht68o6h",
                    "score": 18,
                    "created_utc": 1642512467.0,
                    "replies": [
                        {
                            "body": "This is true. People say “I don’t want her to just want me for money” then proceed to offer no desirable traits or give her anything to admire and appreciate, besides money 👏🏻👏🏻👏🏻 If you want her to want you for more than money you need to have more than money to offer.",
                            "author": "WestCoastCompanion",
                            "id": "ht823rd",
                            "parent_id": "t1_ht69ftd",
                            "score": 18,
                            "created_utc": 1642537649.0,
                            "replies": [
                                {
                                    "body": "The foundation is finding an SB who appreciates those things beyond the allowance that you bring to the relationship.  And who brings more to the relationship that is important to you.  \n\nAvoiding the gym...... perhaps you need an sb who will whip you into shape.",
                                    "author": "pinotandsugar",
                                    "id": "ht9bu48",
                                    "parent_id": "t1_ht823rd",
                                    "score": 2,
                                    "created_utc": 1642555766.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "The amount of snarky replies to SBs that call them “low value” 😬",
                            "author": "post_typical",
                            "id": "ht6qkoq",
                            "parent_id": "t1_ht69ftd",
                            "score": 2,
                            "created_utc": 1642519995.0,
                            "replies": []
                        },
                        {
                            "body": "In fairness, there are more than a few posts by SBs complaining that their SD was not generous or asking how much more they should get for longer than usual dates. Lots of SB believe that if they just shake the tree harder more manna will fall out. Just as many SDs think women are only good for their holes.",
                            "author": "AFSMSgt",
                            "id": "ht73ja4",
                            "parent_id": "t1_ht69ftd",
                            "score": 1,
                            "created_utc": 1642524922.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "OP is indeed based/correct",
                    "author": "LaIndiaDeAzucar",
                    "id": "ht6e2la",
                    "parent_id": "t1_ht68o6h",
                    "score": 7,
                    "created_utc": 1642514708.0,
                    "replies": []
                },
                {
                    "body": "Sad that men who need to understand will not be influenced!",
                    "author": null,
                    "id": "ht6ks84",
                    "parent_id": "t1_ht68o6h",
                    "score": 0,
                    "created_utc": 1642517653.0,
                    "replies": []
                },
                {
                    "body": "Yeah I think this is preaching to the choir.",
                    "author": "Careless-Parfait-587",
                    "id": "ht73y1a",
                    "parent_id": "t1_ht68o6h",
                    "score": 1,
                    "created_utc": 1642525072.0,
                    "replies": [
                        {
                            "body": "There might be some backsliders in the choir that need to be recommended, myself included 😅",
                            "author": null,
                            "id": "ht7dqjd",
                            "parent_id": "t1_ht73y1a",
                            "score": 2,
                            "created_utc": 1642528664.0,
                            "replies": [
                                {
                                    "body": "Probably should just post your book list if you really want these guys to check them out (not thinking they'll PM).\n\nFrom what I've read on this forum it seems a problem that goes both ways.  Plenty of SBs saying they showed up... why isn't he having a great time or why isn't he spending more.\n\nReflecting on it now... it's possible most people just suck at relationships.  😉",
                                    "author": "WellAdjustedJ",
                                    "id": "ht93lpq",
                                    "parent_id": "t1_ht7dqjd",
                                    "score": 3,
                                    "created_utc": 1642552181.0,
                                    "replies": []
                                },
                                {
                                    "body": "Fair enough.",
                                    "author": "Careless-Parfait-587",
                                    "id": "ht7miyl",
                                    "parent_id": "t1_ht7dqjd",
                                    "score": 1,
                                    "created_utc": 1642531891.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Spot on",
                    "author": "pinotandsugar",
                    "id": "ht9bcrt",
                    "parent_id": "t1_ht68o6h",
                    "score": 1,
                    "created_utc": 1642555553.0,
                    "replies": []
                }
            ]
        },
        {
            "body": ">I was taken aback by the anger.\n\nWhenever someone comes into a community and glibly proclaims to have the answer, without having put in the work to earn community trust yet, the community will test them a bit.  That's true of every community everywhere, from my experience.   You'd think someone who advocates for understanding others, would understand this 😄\n\nOkay, snark aside, I'm solidly on team romance-your-SB.  But, then again, I like doing that, it's part of what sugar brings to me.  Someone to look good for, someone to romance, this is all my personal choice and I love doing it.  I would observe that it's factually untrue that this is really **necessary** \\-- Certainly there are physically and personality unattractive SDs with beautiful SBs, proving that money does address these shortcomings (to an extent, for some SBs).  But I am strongly with the basic premise, at least for myself; if anything, I appreciate the opportunities I have with unbelievably desirable women that financial support brings, now I still need to do all the work to make her love being in an SR with me.  That's MUCH more than physical and sexual attraction.\n\nThat said, I do think the community is justified in poking at this a bit.  In this case, two things you've said:\n\n>A frenzy as in women being angry about the books I suggest.\n\n&#x200B;\n\n>I have a saying, \"Women can smell 🐈 on a man, and they like it.\"\n\nIt's a basic fact of nature that when someone is desired by many, they become more desirable.  But when people describe using that fact as a strategy to manipulate others -- well, I've only seen that in certain men's communities that aren't well respected here or especially among women.  And that makes me wonder why women would get *angry* about the books you suggest.  Your almost sole focus on physical attraction for the SD, rather than the many other qualities that delight SBs, is also a hallmark of some of these communities.  Maybe these are unrelated and it's nothing; it's just hard to imagine why the women would be so angry at the books.\n\nBut back to the premise: yes, I personally choose to put in effort to look good for, and romance, my SB.  I enjoy it just for itself, as a gesture; but it does pay dividends IMO",
            "author": "Azurecole",
            "id": "ht6z9yz",
            "parent_id": "t3_s6wn62",
            "score": 14,
            "created_utc": 1642523327.0,
            "replies": [
                {
                    "body": "That's exactly what I was thinking too but didn't dare to write. I agree with most of OP's points, as I'm always a little irritated by people in this sub who act as if sugar dating is something completely different from dating. It is a form of dating and all the qualities that are important in vanilla dating are also important here (just maybe to a different extend).\n\nBut OP's post also comes off as self-promotional. And I don't like that. A few days ago in another comment, he told us that he recorded a podcast about his SR experience and asked for DMs (for a link), too. His primary audience seem to be SDs, not SBs, and I don't see why these books shouldn't be of interest for SBs, too. Is all of this just to get in contact with SDs/ presumably rich people? Maybe, OP could just explain himself a little.",
                    "author": "Inner_Examination_38",
                    "id": "ht7d9q0",
                    "parent_id": "t1_ht6z9yz",
                    "score": 3,
                    "created_utc": 1642528496.0,
                    "replies": [
                        {
                            "body": "Ugh.  Thanks for the heads up.  That tracks.",
                            "author": "WellAdjustedJ",
                            "id": "ht94xvc",
                            "parent_id": "t1_ht7d9q0",
                            "score": 2,
                            "created_utc": 1642552722.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "This is a great post even if not everyone agrees with you. It's solid.",
            "author": "Rrrraiiiiden",
            "id": "ht7bvn8",
            "parent_id": "t3_s6wn62",
            "score": 5,
            "created_utc": 1642527992.0,
            "replies": [
                {
                    "body": "Thanks dude 🤝",
                    "author": null,
                    "id": "ht7f7fn",
                    "parent_id": "t1_ht7bvn8",
                    "score": 2,
                    "created_utc": 1642529196.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I literally ended a relationship that was going pretty well over him not making the effort. It's in our texts, I told him I felt like he wasn't doing his part to make me feel the romance in the relationship. There was little to no communication in the end, after talks of getting serious. He said in an arrangement that isn't necessary. I gave up a literal whale for the reasons described in this post so yes, it was absolutely necessary to say. The haters are just being triggered and with good reason. You can't just throw money at someone and expect it to fill in all the gaps. And my SD was younger, fit, attractive, fun, hilarious, a great lay etc. But in the end he wanted something very empty, and so I blocked him.",
            "author": "Brilliant_Ad2518",
            "id": "ht69dma",
            "parent_id": "t3_s6wn62",
            "score": 16,
            "created_utc": 1642512435.0,
            "replies": [
                {
                    "body": "That must have been a tough decision for you to give up a whale, especially with the other very attractive qualities you listed (fit, fun, great in bed).\n\nThanks for proving my point, that I've noticed \\*some\\* SDs thinking that \"throwing money at someone\" overrides the fact that it's still a romantic relationship, with many of same expectations, for best results. \n\nGuys that don't want to do that would be better off seeing an escort regularly.",
                    "author": null,
                    "id": "ht6eknj",
                    "parent_id": "t1_ht69dma",
                    "score": 11,
                    "created_utc": 1642514941.0,
                    "replies": [
                        {
                            "body": "I spent a few days crying, not gonna lie. Then I dusted myself off and reminded myself I am young, I am successful, I am adored, and I am HOT ASF. So I will take my time to heal properly and then move forward. And yes darling, in the end I told him what he really wants... is a high priced escort. Which honestly yes I could have worked that angle, but I never once looked at him like that so the thought never crossed my mind. I enjoyed my time with him. Genuinely missed him when he was gone. Looking back now, there were sooo many signs... so many red flags. I collected them all and made myself a pretty red scarf 🤦‍♀️ Lesson learned. Almost entirely ruined dating for me.",
                            "author": "Brilliant_Ad2518",
                            "id": "ht9lvln",
                            "parent_id": "t1_ht6eknj",
                            "score": 5,
                            "created_utc": 1642560147.0,
                            "replies": [
                                {
                                    "body": "Great attitude. As always, there is a perfect Rihanna quote for this situation 😅: \"Never a failure, always a lesson\".\n\nBest wishes",
                                    "author": null,
                                    "id": "hterytf",
                                    "parent_id": "t1_ht9lvln",
                                    "score": 2,
                                    "created_utc": 1642648426.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "> my SD was younger, fit, attractive, fun, hilarious, a great lay etc\n\nThis is exactly why OP is wrong.\n\nOP said:\n\n>SDs should invest time, energy, & resources into being as physically/ emotionally attractive as possible\n\nYour whale was everything OP is telling guys to be.\n\nThe beauty of sugar is when a girl gets sick of a guy for whatever reason, there's 20 more waiting to date him.\n\nWhy put in effort, change yourself into someone you're not, all to please the unpleasable.\n\nYes basic hygiene etc are important. Beyond that, be yourself, and if you find someone who's a good fit she'll stick around.\n\nDon't waste time tilting at windmills.",
                    "author": "Whale_SD",
                    "id": "ht6kj2a",
                    "parent_id": "t1_ht69dma",
                    "score": 9,
                    "created_utc": 1642517546.0,
                    "replies": [
                        {
                            "body": "She's also saying to be emotionally attractive. After care is important. My man was an emotional black void and I ignored all the signs because I was genuinely in love with him. We always talked about dating since day one. 3 years in and the whole \"this is just an arrangement to me\" talk happened. It took a lot for him to show emotion, and anytime he did it was like we'd take one step forward and then five steps back....",
                            "author": "Brilliant_Ad2518",
                            "id": "ht9l09k",
                            "parent_id": "t1_ht6kj2a",
                            "score": 3,
                            "created_utc": 1642559767.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": ">An SR is a romantic/ sexual relationship. \n\n>The direct exchange of money (sugar) doesn't absolve men from needing to present as attractive, in whatever way that means to the SD. It seems some (not all) men in this lifestyle think that just offering a wallet is enough to guarantee the attention of attractive, young women. (It's not.)\n\n>For the best possible experience, SDs should invest time, energy, & resources into being as physically/ emotionally attractive as possible. Including: grooming & style, building a body you are proud of, learning how women feel sexual attraction, and doing those actions. As well as not doing other actions that turn women off (oversharing, texting every day for weeks like girlfriends, being unattractive, etc.)\n\n\nThis needs to be pinned. It goes over so many SDs heads  \n\n\n\n>Resources I recommend are working with a personal trainer, getting fashion/ image advice, reading books about seduction (Crucial). I have a list of 3 books all men should read on this topic, DM me if interested\n\nOP, are you shilling books? Why not publicly list the book titles?",
            "author": "WorldwideLoving",
            "id": "ht6eyg2",
            "parent_id": "t3_s6wn62",
            "score": 8,
            "created_utc": 1642515115.0,
            "replies": [
                {
                    "body": "Thanks I'm glad you liked my suggestions.\n\nI didn't want to create a possible frenzy over the books I recommend. \n\nI actually have written a book, but it's not directly related to this topic, so it isn't on the list.",
                    "author": null,
                    "id": "ht6husk",
                    "parent_id": "t1_ht6eyg2",
                    "score": 1,
                    "created_utc": 1642516413.0,
                    "replies": [
                        {
                            "body": ">I didn't want to create a possible frenzy over the books I recommend\n\nImpossible, there is a pdf book of almost every book i know and I've read hundreds of thousands of books both fictional and non fictional over my life, I'm a bookworm. \n\n>I actually have written a book, but it's not directly related to this topic, so it isn't on the list.\n\nAh see that would be shilling. \n\nThe books you're promoting, did you write them or know the author/s or have anything to do with publication of said books or do you recieve an affiliate for purchased books if they're perhaps only available on Amazon on your selling bay? That would be cause for concern regarding the information and if its actually decent or not or whether you're merely looking to make a profit from a subreddit.",
                            "author": "WorldwideLoving",
                            "id": "ht6ijd7",
                            "parent_id": "t1_ht6husk",
                            "score": 2,
                            "created_utc": 1642516706.0,
                            "replies": [
                                {
                                    "body": "A frenzy as in women being angry about the books I suggest.\n\nI am not selling anything.\n\nIf I was selling a book, it would make more sense to put the link in the OP, where more people would see if and click on it, don't you think?",
                                    "author": null,
                                    "id": "ht6jciz",
                                    "parent_id": "t1_ht6ijd7",
                                    "score": 2,
                                    "created_utc": 1642517050.0,
                                    "replies": [
                                        {
                                            "body": ">A frenzy as in women being angry about the books I suggest.\n\n\nWouldn't this be the opposite of literally any SDs dreams? \n\nIf this book is the elixir you claim it to be for SDs and how to clean themselves up and seduce SBs or whatever, that's 0 issue. The issue is you're apparently super cagey with the titles & given the cageyness, leads to more questions regarding your intentions. \n\n>I am not selling anything.\n\nI've heard that before from affiliate marketers & MLM people. \n\n>If I was selling a book, it would make more sense to put the link in the OP, where more people would see if and click on it, don't you think?\n\nNo, it would make more sense to get SDs to dm you, get an email from them & spam email them with book promos & links on a email mass send which is a marketing technique and a shark technique.",
                                            "author": "WorldwideLoving",
                                            "id": "ht6kcgj",
                                            "parent_id": "t1_ht6jciz",
                                            "score": 2,
                                            "created_utc": 1642517470.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "Your account is extremely new and you've posted mostly comments over less then a month between various subreddits. It doesn't add to your credit here within sugar & recommending books which you potentially have a part in, you're cagey with details and closed up like a clam. \n\nHowever, how do you find zkrollup? I've been looking at that for awhile. What's your preferred exchange & why",
                                            "author": "WorldwideLoving",
                                            "id": "ht6ky3s",
                                            "parent_id": "t1_ht6jciz",
                                            "score": 0,
                                            "created_utc": 1642517723.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Im fed up with so many guys wanting kinks that they can't seem to get vanilla. We are not dolls. I want some romance and respect and a guy with a sense of humour not someone who thinks having a 6 pack is somehow worthy to sugar date me. Are they so unaware what woemn actually want?",
            "author": "sexylondongirl",
            "id": "ht6kjfx",
            "parent_id": "t3_s6wn62",
            "score": 13,
            "created_utc": 1642517550.0,
            "replies": [
                {
                    "body": "In a word, YES.\n\nI think that modern men are fed a lot of ~~bullshit~~  propaganda about what women want, and they're confused. Particularly younger men, say, about and under 30.",
                    "author": null,
                    "id": "ht6lyv2",
                    "parent_id": "t1_ht6kjfx",
                    "score": 2,
                    "created_utc": 1642518145.0,
                    "replies": [
                        {
                            "body": "Yeah totally, the young guys are a bit deluded, they have no idea that macho is more impressive to their mates than to any women on the planet. Wake up guys.",
                            "author": "sexylondongirl",
                            "id": "ht6nls6",
                            "parent_id": "t1_ht6lyv2",
                            "score": 4,
                            "created_utc": 1642518815.0,
                            "replies": [
                                {
                                    "body": "Wait so are you saying be macho or not?",
                                    "author": "Careless-Parfait-587",
                                    "id": "ht74935",
                                    "parent_id": "t1_ht6nls6",
                                    "score": 2,
                                    "created_utc": 1642525186.0,
                                    "replies": [
                                        {
                                            "body": "Not who you asked, but IMO macho is very different than masculine. The latter is attractive.",
                                            "author": null,
                                            "id": "ht76dgy",
                                            "parent_id": "t1_ht74935",
                                            "score": 1,
                                            "created_utc": 1642525972.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "THIS! This is why I avoid younger daddies! It’s an entire mindset that permeates EVERYTHING they do. I know this isn’t ALL young daddies, but stereo types are stereo types for a reason.",
                            "author": null,
                            "id": "ht6xzh3",
                            "parent_id": "t1_ht6lyv2",
                            "score": 1,
                            "created_utc": 1642522842.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Money bridges the looks and age gap but it does not allow you to be an unpleasant human, a bad lover or have sub par hygiene. \n\nThat being said, you can do everything right and still get ghosted.  We are dealing with young women and you can't always predict why they did something. They have parents, friends, boyfriends cycling in and out of their life and many wish to avoid confrontation or uncomfortable conversations. Not every ghosting of blow off means you did something wrong.",
            "author": "LotBuilder",
            "id": "ht7b26o",
            "parent_id": "t3_s6wn62",
            "score": 6,
            "created_utc": 1642527696.0,
            "replies": [
                {
                    "body": "Agreed.\n\nExperiencing the issues you mention helped me understand why some men prefer older (28+) SBs.\n\nYoung, very attractive women are like celebrities. They have everything going on: men of all ages, races, statuses, etc. vying for their attention, not to mention friends, family, social media, college, etc. etc.\n\nEven leading with my wallet, and being overly generous, it's hard to keep their attention for very long.",
                    "author": null,
                    "id": "ht7f3dh",
                    "parent_id": "t1_ht7b26o",
                    "score": 0,
                    "created_utc": 1642529156.0,
                    "replies": [
                        {
                            "body": "That is a type that I avoid regardless of age. If their Instagram is nothing but concerts and travel I avoid them or relegate them to very part-time (when they need rent money) status.  \n\nI have had good luck with younger girls that are homebodies but issues still pop up that are beyond my control.  My 26 yo single mom is by far the most reliable.",
                            "author": "LotBuilder",
                            "id": "ht7hu31",
                            "parent_id": "t1_ht7f3dh",
                            "score": 3,
                            "created_utc": 1642530159.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "This is pretty good advice, since a SD is looking to skip the dating pool using SR.  You'll just end up getting dumped after a few dates.  I've had SBs that prefer being with me even though some other guys are offering 2-3x the $$ but they had no game whatsoever.  They are either trying to get the SB into a clingy relationship with $ or trying to show them off as trophy gf in public which is a big no for most women.\n\nIf you don't have a good physical appearance then you have to cough up the $ to find someone who doesn't care about your inadequacies.  \n\nAll you need to do is shed some weight, put on some better looking clothes, shave that ugly beard or fuzz, and wear a nice cologne and not too musky one.  \n\nI've got no problems keeping SBs, in fact I reject those I don't feel have a good connection with.  It ain't only about the $$.",
            "author": "MKTekke",
            "id": "ht6oas9",
            "parent_id": "t3_s6wn62",
            "score": 2,
            "created_utc": 1642519094.0,
            "replies": []
        },
        {
            "body": "Well said!",
            "author": null,
            "id": "ht7arnb",
            "parent_id": "t3_s6wn62",
            "score": 3,
            "created_utc": 1642527590.0,
            "replies": []
        },
        {
            "body": "I appreciate the reminder to bring my ‘A’ game to my future meet & greets and sugar dates. Thanks and good luck!",
            "author": "JohnLionHearted",
            "id": "ht8gcf2",
            "parent_id": "t3_s6wn62",
            "score": 3,
            "created_utc": 1642542842.0,
            "replies": [
                {
                    "body": "🤝 Thanks man, Same to you!",
                    "author": null,
                    "id": "ht8niuf",
                    "parent_id": "t1_ht8gcf2",
                    "score": 1,
                    "created_utc": 1642545590.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Agree, it's in the SDs best interest to dress well, be well presented, showered, etc. To me, its stunning these aren't foregone conclusions - like when a recruiter says \"make sure you are on time for the job interview.\" But I suppose sometimes you have to say it - just like when you call tech support for your printer and the first question is \"is the printer plugged in?\"\n\nI'd also argue that chemistry and attraction can be more complicated. I've been on plenty of dates where the spark (whether for her or me) just wasn't there. And there was nothing \"wrong\" with either of us. Just sometimes isn't there despite best efforts. I learned a long time ago not everyone is interested in everyone and that's ok.\n\nI'll also raise the bar and say that SRs are not a solution to a women's financial problems - often self inflicted. Plenty of SBs feel their time is more valuable than the SDs and its not true. There are similar steps an SB can take to be well presented and engaged during a date and be open to building a relationship/arrangement.  And recognize that \"hotness\" or having a pussy does not entitle you to my time, money, respect, or deference.\n\nI'll be glad to DM with any SB to give her my \"do not do this\" list. These include being late to dates, diddling on phone the entire time, one word answers, personal attacks on the SD, demands and requests you would never make of another human being, especially one that you would consider a friend or at least one you want to have a functional, professional, financial relationship with.",
            "author": "archhatter",
            "id": "ht674s1",
            "parent_id": "t3_s6wn62",
            "score": 9,
            "created_utc": 1642511201.0,
            "replies": []
        },
        {
            "body": "I would argue more often than not these men get ghosted or played because they don't know how to vet women before they even get to face to face interaction. There was red flags and cues he missed along the way.\n\nI'm all for self improvement. While also having to say your prescription is not going to address it directly. If these men read the stickies and read the horror stories they can avoid 60% of the bullshit.   \n\n\nThe other 40% imho boils down them not knowing how to read the room. And the handful of women who break bad in spite of passing all the tests. I've seen the pictures of sd's my female friends have dealt with. These men range from fat to dad bods.   \n\n\nIf you a guy has decent conversation skills, is not a creep, and looks neat that's all he needs to get some success in the sugar bowl.",
            "author": "southernslick",
            "id": "ht6wcua",
            "parent_id": "t3_s6wn62",
            "score": 4,
            "created_utc": 1642522221.0,
            "replies": []
        },
        {
            "body": "Interstingly polarized responses...",
            "author": "ShaArt5",
            "id": "ht681b8",
            "parent_id": "t3_s6wn62",
            "score": 7,
            "created_utc": 1642511712.0,
            "replies": [
                {
                    "body": "I was taken aback by the anger. \n\nThis is genuinely intended to help everyone involved have better outcomes in their SR, and relationships in general.",
                    "author": null,
                    "id": "ht6dw30",
                    "parent_id": "t1_ht681b8",
                    "score": 7,
                    "created_utc": 1642514625.0,
                    "replies": [
                        {
                            "body": "> I was taken aback by the anger. \n\nYou must be new here. lol",
                            "author": "Y_4Z44",
                            "id": "ht6rbbe",
                            "parent_id": "t1_ht6dw30",
                            "score": 6,
                            "created_utc": 1642520283.0,
                            "replies": [
                                {
                                    "body": "To Reddit, kind of. I avoided this site for years bc of the toxicity and full scale left/ progressive bias (my perception).\n\nThis, and a few fitness subs, are the only ones I participate on.",
                                    "author": null,
                                    "id": "ht6tf7h",
                                    "parent_id": "t1_ht6rbbe",
                                    "score": 1,
                                    "created_utc": 1642521094.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "The accuracy 🤌🏼",
            "author": null,
            "id": "ht6avvf",
            "parent_id": "t3_s6wn62",
            "score": 7,
            "created_utc": 1642513201.0,
            "replies": [
                {
                    "body": "Thank you.",
                    "author": null,
                    "id": "ht6syu9",
                    "parent_id": "t1_ht6avvf",
                    "score": 1,
                    "created_utc": 1642520922.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I think this is true to a degree. I know sugaring has helped me immensely in a lot of ways regarding women. That said, I do have a personal trainer, an ambitious lifestyle, therapist...etc. Which 100% helps. The money helps mitigate like 60% of the stupid bs that's in vanilla dating - it creates less variables. But like you said, you can't just ignore an SB - good morning, good night, telling her how awesome and pretty she is, buying her random gifts, dinner along with an allowance - they go a long way, like they would in vanilla dating.",
            "author": "Rrrraiiiiden",
            "id": "ht6lc8e",
            "parent_id": "t3_s6wn62",
            "score": 3,
            "created_utc": 1642517885.0,
            "replies": [
                {
                    "body": "I mean but if you enter into an arrangement with a guy that’s married why would you expect those things.\n\nEdit: typos",
                    "author": "Careless-Parfait-587",
                    "id": "ht74dl3",
                    "parent_id": "t1_ht6lc8e",
                    "score": 2,
                    "created_utc": 1642525232.0,
                    "replies": [
                        {
                            "body": ">nter into an arrangement with a guy that married why would you expect those things.\n\nEveryone's expectations are their own to set and their own to negotiate for.",
                            "author": "Rrrraiiiiden",
                            "id": "ht754tx",
                            "parent_id": "t1_ht74dl3",
                            "score": 3,
                            "created_utc": 1642525516.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Congrats on working on yourself. Can you talk more about how a therapist has benefitted you? Do you recommend therapy as an option for men?\n\nSome people think (and I have found) talk therapy to often not be helpful for men. \n\nCompletely agree about the rest of your comment. I lost an awesome SB at the very beginning of my SR experience bc of not communicating enough. I just didn't know if I should text her (bother her, I worried) when we weren't together.",
                    "author": null,
                    "id": "ht6mk24",
                    "parent_id": "t1_ht6lc8e",
                    "score": 3,
                    "created_utc": 1642518389.0,
                    "replies": [
                        {
                            "body": "Talk therapy is only as effective as your own ability to narrate your interior feelings.  Tragically, men are programmed to only either laugh or be angry.\n\nSomatic healing models are much more effective for people who are not emotionally intelligent yet.  Yoga is one such example.  The Body Keeps The Score is a wonderful book about somatic healing.\n\nI recommend talk therapy for everyone.  If you don’t have the ability to identify and name your feelings, you’re being ruled by them.  It feels awkward as hell at first but talk therapy (with a good therapist) flexes the necessary neural pathways to form trusting relationships.",
                            "author": "post_typical",
                            "id": "ht6rny4",
                            "parent_id": "t1_ht6mk24",
                            "score": 6,
                            "created_utc": 1642520420.0,
                            "replies": [
                                {
                                    "body": "Would recommend taking The Body Keeps the Score a little slowly if you’ve had any type of trauma. It’s been quite triggering for a lot of people, but it is a very great resource for healing.",
                                    "author": "Azucarbabby",
                                    "id": "ht7b8ka",
                                    "parent_id": "t1_ht6rny4",
                                    "score": 5,
                                    "created_utc": 1642527760.0,
                                    "replies": [
                                        {
                                            "body": "Very good advice & thank you.  I overlooked that disclaimer which I normally add.",
                                            "author": "post_typical",
                                            "id": "ht7ipve",
                                            "parent_id": "t1_ht7b8ka",
                                            "score": 1,
                                            "created_utc": 1642530485.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "This is incredibly insightful and based on my experience very true. We're getting a little woo woo lol.\n\nI've made a shit shit shit ton of progress in therapy in about 3 months, BUT this is coming from the last 5 years of doing yoga, meditation, and learning mind body connection both in meditation and in exercise (both yoga and resistance training). That said I would recommend therapy, even if you only plan on it for like 2-3 months at a time. The one thing I've learned is stops and starts with this kind of shit is that those are also beneficial.\n\nLastly u/ChanceBerryman I would say you specifically would benefit because your comment about worrying about what she might think sounds like you have identity issues that are cause from your primary caregivers as a child. but i'm not actually a therapist. the one thing sugaring has allowed me to do is be able to get over that shit in a safe space created by my wealth.",
                                    "author": "Rrrraiiiiden",
                                    "id": "ht7bcne",
                                    "parent_id": "t1_ht6rny4",
                                    "score": 3,
                                    "created_utc": 1642527800.0,
                                    "replies": [
                                        {
                                            "body": "Ever fix up your appearance, check your outfit or breath before meeting up with someone? Then you've \"worried\" about what she might think. This is perfectly normal - everyone wants to make a good impression.\n\nThat being said, everyone can benefit from working on the mind (like one would work on their body at a gym).  Therapy is like getting a personal trainer for the mind.",
                                            "author": "tumbleweedrunner2",
                                            "id": "ht9931y",
                                            "parent_id": "t1_ht7bcne",
                                            "score": 2,
                                            "created_utc": 1642554559.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "u/Rrrraiiiiden I appreciate your recommendatiion. I'm willing to try it out.",
                                            "author": null,
                                            "id": "ht7e97t",
                                            "parent_id": "t1_ht7bcne",
                                            "score": 1,
                                            "created_utc": 1642528850.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "As the great late (and fictional) Don Draper would say \"That's what the money's for.\" Kidding, kind of.\n\nThere are plenty of women & SBs who have no desire to be seduced.  They have no \"problems\" with their SD being slightly awkward, with a simple style and out of shape. \n\nHis heart & generosity mean more to them than the OPs list. \n\nSo I tip my hat 🤠 and give a wink 😉 to all those SBs whose love languages are \"gift giving\" & \"act of service\" from their Daddy.🥂",
            "author": "oso8daddy",
            "id": "ht76xz6",
            "parent_id": "t3_s6wn62",
            "score": 3,
            "created_utc": 1642526182.0,
            "replies": []
        },
        {
            "body": "I agree. But the solution that sugaring DOES solve for men who struggle with women outside of sugaring is that it gets women who ordinarily wouldn't give them the time of day to give it a shot.\n\nThe rest is up to the SD and and I'm totally fine with paying for that chance to present myself.",
            "author": "django_uncoined",
            "id": "ht6rm4i",
            "parent_id": "t3_s6wn62",
            "score": 2,
            "created_utc": 1642520400.0,
            "replies": [
                {
                    "body": "I believe we're making the same point.\n\nSugaring puts you in the company of women you wouldn't have a chance with otherwise. At least that's why I do it, in conjunction with occasionally vanilla dating. \n\nOnce that happens, the man still has to be attractive enough to keep the SB interested.",
                    "author": null,
                    "id": "ht6sgus",
                    "parent_id": "t1_ht6rm4i",
                    "score": 3,
                    "created_utc": 1642520730.0,
                    "replies": []
                },
                {
                    "body": "Any SD that has any physical or mental ineptness will just have to pay more to keep the women.\n\nBut, if you lead women with money only it will be the only link that you have.  Without anything else to keep them interested, you can only keep paying and will never stop.\n\nI've had SBs that came to see me for no PPM simply because they find other value being with me than only $$.",
                    "author": "MKTekke",
                    "id": "ht7otgu",
                    "parent_id": "t1_ht6rm4i",
                    "score": 2,
                    "created_utc": 1642532737.0,
                    "replies": [
                        {
                            "body": "Continuing to pay isn’t really a problem since that’s what an SD is supposed to to do in an SR.\n\nBut aside from that ‘leading with money’ doesn’t always lead the the outcome you describe. I’ve had several sugar relationships move past a certain point where the girl asks for payments to stop so we can just date.\n\nSome girls are just content dating a wealthier guy.",
                            "author": "django_uncoined",
                            "id": "ht7v5ov",
                            "parent_id": "t1_ht7otgu",
                            "score": 0,
                            "created_utc": 1642535084.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": ">As well as not doing other actions that turn women off (oversharing, texting every day for weeks like girlfriends, being unattractive, etc.)\n\nguess one can never be authentic",
            "author": "therewasguy",
            "id": "ht7vomj",
            "parent_id": "t3_s6wn62",
            "score": 2,
            "created_utc": 1642535278.0,
            "replies": [
                {
                    "body": "If you want to be non-sexual friends with women, and hear you're \"like a brother to me!\", go ahead.",
                    "author": null,
                    "id": "ht7zpul",
                    "parent_id": "t1_ht7vomj",
                    "score": 2,
                    "created_utc": 1642536780.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Great post agree 100%",
            "author": "Neither-Ad-2833",
            "id": "ht81f9y",
            "parent_id": "t3_s6wn62",
            "score": 2,
            "created_utc": 1642537400.0,
            "replies": []
        },
        {
            "body": "Men do sugaring because they have problems with vanilla relationships. If they could solve that problem then they wouldnt sugar lol",
            "author": "AspiringFIRE1993",
            "id": "htao56k",
            "parent_id": "t3_s6wn62",
            "score": 2,
            "created_utc": 1642582205.0,
            "replies": []
        },
        {
            "body": "Ok, I’m gonna play devil’s advocate here because, well why not? Just as in ANY relationship, every single arrangement is different. That doesn’t make one way better or worse. As we look at different SR we have to consider that there are people (SDs and SBs alike) that don’t have the desire or the capacity or the ability for romance or emotional intimacy. For some, it’s just not in their personality, others have been hurt so deeply and irreparably that the very thought of such vulnerability could send them into a panic attack! But that doesn’t negate the need for physical intimacy and contact. A sugar relationship is actually the best solution! It’s not meaningless whore hopping (NOT saying that the pros have no feelings! Nor am I trying to shame those girls, but from my conversations, those interactions are, typically, purely physical). A SR creates a safe space where SDs and SBs alike can create a physical connection with a safe relational connection, mutually caring for each other without the demand of romance. \nObviously there are thousands upon thousands of situations, every one is different! I am NOT saying this is the only reason some people do not want romance, only giving one possibility to showcase how the reasons for a SR vary from person to person. \nSo, perhaps, instead of insisting that every SD romance their SB, we should be encouraging clear and forthright communication of expectations, desires and needs. Not every SB is a good fit for the “romance-less” sugar relationship, it takes a certain maturity and selflessness to recognize and understand the necessity and the role of this kind of connection and arrangement. But at the end of the day there truly is someone for everyone. \n\nIn summation, I strongly agree that giving sugar does not absolve a man from being a gentleman and treating his SB with respect and care. I disagree that a SR is always romantic. Demanding the provision of romance could be detrimental or even harmful. \nFinally, as in ANY relationship (vanilla, sugar, familial, professional, etc.) communication is vital. Communicate clearly, openly and honestly, and may the odds be ever in your favor!",
            "author": null,
            "id": "ht79y4f",
            "parent_id": "t3_s6wn62",
            "score": 4,
            "created_utc": 1642527286.0,
            "replies": []
        },
        {
            "body": "While your list of attractive traits is good.  It's missing one of the big ones.  Having sexual options.  Little is more attractive to a woman then having other women who want you, having options to have sex with other women and choosing to spend time with her.",
            "author": "RiskyRewarder",
            "id": "ht6jhc1",
            "parent_id": "t3_s6wn62",
            "score": 5,
            "created_utc": 1642517106.0,
            "replies": [
                {
                    "body": "100%.\n\nI think a man that is doing everything else I listed would automatically have more sexual options, which, like you said, is catnip to women.\n\nI have a saying, \"Women can smell 🐈 on a man, and they like it.\"",
                    "author": null,
                    "id": "ht6lfwt",
                    "parent_id": "t1_ht6jhc1",
                    "score": -1,
                    "created_utc": 1642517928.0,
                    "replies": []
                },
                {
                    "body": "Exactly right. Women tend to be jealous, envious, and competitive with each other. So landing a guy that everyone wants is an ego boost. All the drama that comes from a man like that having all the options is both a gift and a curse!",
                    "author": "django_uncoined",
                    "id": "ht6rxy6",
                    "parent_id": "t1_ht6jhc1",
                    "score": -3,
                    "created_utc": 1642520526.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "ht7mod4",
                            "parent_id": "t1_ht6rxy6",
                            "score": 7,
                            "created_utc": 1642531947.0,
                            "replies": [
                                {
                                    "body": "For you. Loyalty isn’t defined by sex for everyone. \n\nFor me loyalty is about taking care of each other emotionally, contributing to each other, and sticking with each other through hard times. Sex and monogamy are frankly not attributes I’d gauge loyalty by at all.\n\nFurther, you’re responding to this as if I said being desirable is the only thing people find attractive in men. It’s not. But there’s no point denying that having a partner who is found attractive by others can itself be part of the attraction. Not for everyone, of course.",
                                    "author": "django_uncoined",
                                    "id": "ht7vvqt",
                                    "parent_id": "t1_ht7mod4",
                                    "score": 2,
                                    "created_utc": 1642535351.0,
                                    "replies": [
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "ht80zn0",
                                            "parent_id": "t1_ht7vvqt",
                                            "score": 2,
                                            "created_utc": 1642537245.0,
                                            "replies": [
                                                {
                                                    "body": "What you mean is you projected a whole bunch of things that I didn’t say. \n\nJust because some women are jealous doesn’t mean they all are. And just because some people like people who are wanted by others, doesn’t mean they all do. \n\nI didn’t say or imply either of those things.\n\nSomeone saying “Roses tend to be red” does not mean white roses don’t exist.",
                                                    "author": "django_uncoined",
                                                    "id": "ht8g76w",
                                                    "parent_id": "t1_ht80zn0",
                                                    "score": -1,
                                                    "created_utc": 1642542788.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Some people learn best from experience.  Sugar dating provides ample room for experimentation and exposure to the vastness of female and romantic opportunities.  \n\nIf the man (or woman) is introspective they can use these experiences to at the least improve their understanding of themselves.  We all have hang-ups.  Some of us see these hang-ups and seek better understanding.  People with limited social experiences will never get a chance to realize a better self, at least when dealing with the opposite sex.",
            "author": "sdphilly",
            "id": "ht6d9oa",
            "parent_id": "t3_s6wn62",
            "score": 2,
            "created_utc": 1642514334.0,
            "replies": []
        },
        {
            "body": "SR's are definitely a solution to some of men's biggest problems with women, but from a bigger picture perspective. That's why most SD's do SR's.\n\nHowever, your specific point is correct: an SR still needs romance, respect, etc all of those good things. A SD needs to be the best version of himself possible, even more-so than if he was just dating vanilla.\n\nBut more broadly, SR's solve a lot of problems in a unique way for men. An SR is the perfect solution for a single SD (like me) who knows he will:\n\n\\- never get married\n\n\\- doesn't do PPM\n\n\\- can't risk doing anything illegal (see: Robert Kraft), because of risk to business reputation\n\n\\- doesn't want kids\n\n\\- will only ever want to be with women who are in their 20s and early 30s\n\n\\- wants to avoid at all costs, the financial risks of alimony and child support\n\nSR's are the perfect solution to all of these problems: lawful, best ROI, hottest women, lowest risk",
            "author": "Nomad_Bill",
            "id": "ht6nt5n",
            "parent_id": "t3_s6wn62",
            "score": 2,
            "created_utc": 1642518900.0,
            "replies": [
                {
                    "body": "These are all excellent points. \n\nI guess if a guy's biggest problem is not knowing how to relate to women, SR doesn't solve that. \n\nFor everything else, you're spot on.",
                    "author": null,
                    "id": "ht6st5f",
                    "parent_id": "t1_ht6nt5n",
                    "score": 2,
                    "created_utc": 1642520860.0,
                    "replies": []
                },
                {
                    "body": ">SR's are the perfect solution to all of these problems:  lawful, best ROI, hottest women, lowest risk\n\nSpecifically, elaborate on the ROI area within this commentary lol",
                    "author": "WorldwideLoving",
                    "id": "ht6swl3",
                    "parent_id": "t1_ht6nt5n",
                    "score": 1,
                    "created_utc": 1642520898.0,
                    "replies": [
                        {
                            "body": "imo, Enjoyment vs. Investment of money and time is exponentially higher in sugaring.",
                            "author": null,
                            "id": "ht7feu0",
                            "parent_id": "t1_ht6swl3",
                            "score": 1,
                            "created_utc": 1642529271.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "It’s damn sure a solution to my sugar baby pockets 😋😂",
            "author": "Tiny_Cardiologist_13",
            "id": "ht6t5x7",
            "parent_id": "t3_s6wn62",
            "score": 2,
            "created_utc": 1642520996.0,
            "replies": []
        },
        {
            "body": "I agree.",
            "author": "Strange-Page-3654",
            "id": "ht71de4",
            "parent_id": "t3_s6wn62",
            "score": 2,
            "created_utc": 1642524120.0,
            "replies": []
        },
        {
            "body": "💯 Treat SR like any other R. Mutually beneficial many include financial support but don’t neglect emotional support. Everyone needs to understand what their partners want & need —- it’s different for each two people.",
            "author": "daddoms",
            "id": "ht7k2ul",
            "parent_id": "t3_s6wn62",
            "score": 2,
            "created_utc": 1642530989.0,
            "replies": [
                {
                    "body": "Well said!",
                    "author": null,
                    "id": "ht7zvm3",
                    "parent_id": "t1_ht7k2ul",
                    "score": 1,
                    "created_utc": 1642536838.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Very relevant and sensible post! \n\nDon’t though give a free pass to the ladies who have low standards and will date anyone for a few bucks.\n\nThe other point to make is there is a reason why many guys have to pay to date. Some have to because despite their charm as they are married / attached. Some do not want a regular committed relationship and love the flex of sugaring. Many are simply paying because they lack the physical and personality traits to date good looking women \n\nLastly if you think every gal who is on seeking is an A in terms of looks, body, fitness, manners, grace then look again. If anything such ladies are few and far in between. The number of women who are average looking, thrashy, overweight and out of shape (branded as thick/curvy/bbw) is significant. One may wonder what they are doing in a place where good looks are your forte.",
            "author": null,
            "id": "ht6kmbd",
            "parent_id": "t3_s6wn62",
            "score": 1,
            "created_utc": 1642517585.0,
            "replies": []
        },
        {
            "body": "Writing in response to\n\n>several recent threads\n\nbut not bothering to post this in those threads is really no different than vaguebooking. Like, you want to make sure to get this info out there to everybody, but don't bother commenting to the people that actually need it. I mean, ok, there's no need to fake the whole \"trying to be useful\" stuff lol\n\nNot sure I understand the whole phenomenon of, posting in response to somebody but not in their thread where they'll read it. Which is not at all exclusive to this thread.",
            "author": "NoLimitLexa",
            "id": "ht6rw8j",
            "parent_id": "t3_s6wn62",
            "score": 3,
            "created_utc": 1642520507.0,
            "replies": []
        },
        {
            "body": "Let’s be honest only about 30 percent of SBs care about  chemistry beyond the person having decent hygiene( taking shower brushing teeth) and the guy not being completely creepy or dangerous. A lot of you guys are over estimating the romance abilities. SBs look at money the way men look at sex, it doesn’t take much for a SB to come along. Some girls are trying to reduce unpleasantness, so not being obese or being under 60 helps, but anybody’s decent hygiene and allowance will find a SB.",
            "author": "Secret_Diet7053",
            "id": "ht7zrel",
            "parent_id": "t3_s6wn62",
            "score": 3,
            "created_utc": 1642536796.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "ht66uqu",
            "parent_id": "t3_s6wn62",
            "score": 1,
            "created_utc": 1642511040.0,
            "replies": [
                {
                    "body": "🎯 Thank you. I agree. SR is a great way for shy men, or men who don't have very much experience/ interactions with women, to get more comfortable.",
                    "author": null,
                    "id": "ht693yx",
                    "parent_id": "t1_ht66uqu",
                    "score": 3,
                    "created_utc": 1642512295.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Everyone should strive to be as attractive as they can be\n\n> Resources I recommend are working with a personal trainer, getting fashion/ image advice, reading books about seduction (Crucial).\n\nWouldn't a wealthy man who's also muscular, fashionable, and knows seduction/game be able to date vanilla and not need to be a SD?",
            "author": "sabordeazucar",
            "id": "ht6ljvm",
            "parent_id": "t3_s6wn62",
            "score": 1,
            "created_utc": 1642517973.0,
            "replies": [
                {
                    "body": "Ideally but 85% are married!",
                    "author": null,
                    "id": "ht6myok",
                    "parent_id": "t1_ht6ljvm",
                    "score": 5,
                    "created_utc": 1642518555.0,
                    "replies": [
                        {
                            "body": "And that's a crying shame. They got snapped up and their woman won't let them go. Doesn't stop some of them being SDs though ;-)",
                            "author": "sexylondongirl",
                            "id": "ht6nxf2",
                            "parent_id": "t1_ht6myok",
                            "score": 2,
                            "created_utc": 1642518948.0,
                            "replies": [
                                {
                                    "body": "I think wealth brings with it nothing more than options. Thats all. When they have wealth they can create options, be it homes, cars, women, toys etc.",
                                    "author": null,
                                    "id": "ht75o19",
                                    "parent_id": "t1_ht6nxf2",
                                    "score": 2,
                                    "created_utc": 1642525714.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": ">Wouldn't a wealthy man who's also muscular, fashionable, and knows eduction/game be able to date vanilla and not need to be a SD?\n\nYes, he would be able to date vanilla. And those who are utterly failing at vanilla dating, I would not advise to sugar date. But if you are already succesful, adding sugar  can make everything even better. At least, that's my impression.",
                    "author": "Inner_Examination_38",
                    "id": "ht6nenw",
                    "parent_id": "t1_ht6ljvm",
                    "score": 2,
                    "created_utc": 1642518736.0,
                    "replies": [
                        {
                            "body": "Agreed. Sugar on top makes everything better 😁",
                            "author": null,
                            "id": "ht6xcrm",
                            "parent_id": "t1_ht6nenw",
                            "score": 2,
                            "created_utc": 1642522604.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "There's other reasons for pursuing SR than not being able to date vanilla IMO.\n\nThere's several men in this sub who date vanilla and SR interchangeably, myself included.",
                    "author": null,
                    "id": "ht6x90y",
                    "parent_id": "t1_ht6ljvm",
                    "score": 1,
                    "created_utc": 1642522564.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "We never see pics of the men? Other the occasional \"I'm fat and bald\" quip - which may or may not be accurate - Im not at all how fit or handsome or whatever many of our regular participants are.",
            "author": null,
            "id": "ht6wsw9",
            "parent_id": "t3_s6wn62",
            "score": 1,
            "created_utc": 1642522393.0,
            "replies": []
        },
        {
            "body": "Sugar Relationships are different than vanilla relationships in some important ways and do therefore circumvent many issues one funds in a vanilla relationship.  In fact, if sugaring didn’t avoid some of these issues, there would be no reason to sugar.  \n\nA sugar relationship preserves independence.  It’s known from the get go marriage is unlikely.   There will therefore be no divorce, no kids, no child support, no alimony, no “where is this going” conversations.   \n\nIt is different, it is simpler.  An allowance is a substitute for some things that would normally occur in a vanilla relationship.",
            "author": "63daddy",
            "id": "ht84i8i",
            "parent_id": "t3_s6wn62",
            "score": 1,
            "created_utc": 1642538519.0,
            "replies": []
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "ht658an",
            "parent_id": "t3_s6wn62",
            "score": -1,
            "created_utc": 1642510094.0,
            "replies": [
                {
                    "body": "\"Incel\"??",
                    "author": null,
                    "id": "ht65evj",
                    "parent_id": "t1_ht658an",
                    "score": 5,
                    "created_utc": 1642510201.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Wow Thanks Mom! I had no idea!\n\nThis has to be a joke.",
            "author": "vince539839",
            "id": "ht65hsn",
            "parent_id": "t3_s6wn62",
            "score": -6,
            "created_utc": 1642510247.0,
            "replies": [
                {
                    "body": "Several threads in the last week of SBs complaining that men didn't shower before intimacy, and several threads by younger SDs making the mistakes I mentioned here, and asking why the women ghosted them.\n\nGreat that it's not applicable advice to you, but obviously other men need to hear it.",
                    "author": null,
                    "id": "ht65ohr",
                    "parent_id": "t1_ht65hsn",
                    "score": 11,
                    "created_utc": 1642510356.0,
                    "replies": [
                        {
                            "body": "Do you really think grown ass men who still don't know good hygiene, grooming, etc., will read your post and suddenly snap to it?\n\nWhy do people need to DM you for your book suggestions? Do they need to do it in the next 30 mins to also get the free gift?",
                            "author": "vince539839",
                            "id": "ht66h05",
                            "parent_id": "t1_ht65ohr",
                            "score": -6,
                            "created_utc": 1642510817.0,
                            "replies": [
                                {
                                    "body": "Frankly, I'm happy to hear about men who don't understand personal hygiene, gentlemanly conduct, mature behavior.  It makes it so easy for me to stand out from the crowd!",
                                    "author": "DaddyBeenThere",
                                    "id": "ht6crtj",
                                    "parent_id": "t1_ht66h05",
                                    "score": 6,
                                    "created_utc": 1642514103.0,
                                    "replies": [
                                        {
                                            "body": "The stories are funny but I think bad experiences will drive good SBs out of the bowl, limiting availability and quality.",
                                            "author": null,
                                            "id": "ht6j3te",
                                            "parent_id": "t1_ht6crtj",
                                            "score": 5,
                                            "created_utc": 1642516948.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "....what are you so angry about?\n\nthere was a thread of an SB saying a guy \"tasted like pee\". Two other guys posted, confused why they were ghosted, when they had done things that are obvious (to me, and men with more experience with women) turn offs.\n\nI didn't want to list the books here and have women piling on discrediting the books I recommend.",
                                    "author": null,
                                    "id": "ht67ccm",
                                    "parent_id": "t1_ht66h05",
                                    "score": 10,
                                    "created_utc": 1642511319.0,
                                    "replies": []
                                },
                                {
                                    "body": "This genuinely made me laugh!",
                                    "author": "packyourtoothbrush_",
                                    "id": "htaapyk",
                                    "parent_id": "t1_ht66h05",
                                    "score": 2,
                                    "created_utc": 1642572661.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "is my post one of these posts?  I tried dming but your dms are closed.  I'm curious about any specific feedback you have.",
                            "author": "newbieSDwtf",
                            "id": "ht7gp3x",
                            "parent_id": "t1_ht65ohr",
                            "score": 1,
                            "created_utc": 1642529740.0,
                            "replies": [
                                {
                                    "body": "I don't think so, but seeing your post history I think you could benefit. My DMs aren't closed, some other guys messaged me.",
                                    "author": null,
                                    "id": "ht7hllz",
                                    "parent_id": "t1_ht7gp3x",
                                    "score": 0,
                                    "created_utc": 1642530073.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "While you clearly have a point, I think that you've made generalizations which don't necessarily hold.\n\n&#x200B;\n\n>The direct exchange of money (sugar) doesn't absolve men from needing to present as attractive, in whatever way that means to the SD.\n\nIsn't it more important to be attractive to SBs, the target market?  \n\n\n>It seems some (not all) men in this lifestyle think that just offering a wallet is enough to guarantee the attention of attractive, young women. (It's not.)\n\nFor some SBs it is.\n\n&#x200B;\n\n>For the best possible experience, SDs should invest time, energy, & resources into being as physically/ emotionally attractive as possible. Including: grooming & style, building a body you are proud of, learning how women feel sexual attraction, and doing those actions.\n\nIt takes more, much more, than sexual attraction to make a good SR. You seem to concentrate primarily on the physical/sexual. I think that it's equally important to be attractive personality-wise, psychologically, emotionally, intellectually. I believe that my SB would agree. At 68, and having been told by my doctor two weeks ago for the first time in my life to lose some weight, I'm far from the most physically attractive SD that she could find. Yet we have a great SR, and she enjoys being with me, both in and out of bed.  \n\n\n>Imo, men who struggle with women in non-sugar dating, will have the same problems in SR . . . .\n\nI agree, regardless of what type of problem a guy has. IMO Sugar dating isn't really that different from vanilla dating.\n\n&#x200B;\n\n>Resources I recommend are working with a personal trainer, getting fashion/ image advice, reading books about seduction (Crucial).\n\nAgain, you're concentrating on the physical. It's equally important to have good manners, be happy, friendly, stable, consistent, reliable, honest, and more.",
            "author": null,
            "id": "ht86ul3",
            "parent_id": "t3_s6wn62",
            "score": 0,
            "created_utc": 1642539375.0,
            "replies": []
        },
        {
            "body": "I'll be honest. I personally feel I'm good after the initial encounter. I'm just too shy.",
            "author": "bonafideSugar",
            "id": "ht92lqw",
            "parent_id": "t3_s6wn62",
            "score": 0,
            "created_utc": 1642551756.0,
            "replies": []
        },
        {
            "body": "Thanks for the post. I can’t seem to send DMs to you. Would you please send me a DM to explain what these three crucial books on seduction men should read?",
            "author": "13reasons4Liberty",
            "id": "ht9axvy",
            "parent_id": "t3_s6wn62",
            "score": 0,
            "created_utc": 1642555381.0,
            "replies": []
        },
        {
            "body": "Hi. What are the 3 books you recommend?",
            "author": "linkus12",
            "id": "ht9l3f3",
            "parent_id": "t3_s6wn62",
            "score": 0,
            "created_utc": 1642559806.0,
            "replies": []
        },
        {
            "body": "To a degree. But they ARE wanting cash.",
            "author": "Feisty_Pear8536",
            "id": "ht9pz5r",
            "parent_id": "t3_s6wn62",
            "score": 0,
            "created_utc": 1642561956.0,
            "replies": []
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "ht7v63t",
            "parent_id": "t3_s6wn62",
            "score": 1,
            "created_utc": 1642535088.0,
            "replies": [
                {
                    "body": "I see you may have posted a number which is most likely an amount in relations to an arrangement. If this is the case, you are violating Rule #4 - \"No dollar amounts that are in reference to allowance/PPM are allowed.\"\n\nIf you are curious about Allowances reported by SLF contributors please see the [Allowance Master Thread 2021-2022](/r/sugarlifestyleforum/comments/pc22tk/allowance_master_thread_20212022/).\n\nYour post will not be approved until you remove the amount.  Please read the sub [Rules](/r/sugarlifestyleforum/comments/748zta/updated_and_clarified_rules_for_slf/) prior to posting anything else. \n\nIf you simply posted a number not referencing a monetary amount, please message the MODs to approve your post.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/sugarlifestyleforum) if you have any questions or concerns.*",
                    "author": "AutoModerator",
                    "id": "ht7v65k",
                    "parent_id": "t1_ht7v63t",
                    "score": 1,
                    "created_utc": 1642535089.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "The hygiene thing is obvious, (or at least should be). But you shouldn't have to use tinder tactics when you're a 56 year old man looking for an SB. The problem is that since tinder is so ridiculous thanks to the algorithm and crazy ratio of men to women, younger guys are on seeking tossing their paychecks at girls who would have swiped left on them.  You've got some 27 to 35 yo who makes 40 to 50k vs. a 60 year old offering a lot more so they go for younger. That's all it is,if you hit the genetic lottery over 40 great. but don't get your hopes up in this day and age they want to get paid to date a guy they'd fuark for free.",
            "author": "Blknior",
            "id": "htbjcs2",
            "parent_id": "t3_s6wn62",
            "score": 1,
            "created_utc": 1642602080.0,
            "replies": []
        },
        {
            "body": "I agree on everything but focusing on seduction by formal means has been pretty horrible for the guys I know who have done it.  It’s ugly shit with a lot of anthropological/social darwinist claims reinforce a miserable sexist world view and come off as extremely reductive or just false to people who have an actual interest in related topics.",
            "author": "JosephJohnPEEPS",
            "id": "hthv6yd",
            "parent_id": "t3_s6wn62",
            "score": 1,
            "created_utc": 1642705763.0,
            "replies": []
        },
        {
            "body": "Amazing post!",
            "author": "Status_Let_3850",
            "id": "htjjl4i",
            "parent_id": "t3_s6wn62",
            "score": 1,
            "created_utc": 1642730798.0,
            "replies": []
        },
        {
            "body": "Deep seated",
            "author": "handbookforgangsters",
            "id": "ht7wl01",
            "parent_id": "t1_ht6k9hd",
            "score": 2,
            "created_utc": 1642535610.0,
            "replies": []
        },
        {
            "body": "🏆\n\nPerfectly stated, you win the thread.",
            "author": null,
            "id": "ht6t4wu",
            "parent_id": "t1_ht6k9hd",
            "score": 1,
            "created_utc": 1642520986.0,
            "replies": []
        },
        {
            "body": "I appreciate your rational, not furiously angry, comment. \n\nI believe there's a trend, at least in this forum, of men thinking that the traditional rules don't apply, because money is directly involved. Then posting here, \"what did I do wrong???\"",
            "author": null,
            "id": "ht69ftd",
            "parent_id": "t1_ht68o6h",
            "score": 18,
            "created_utc": 1642512467.0,
            "replies": [
                {
                    "body": "This is true. People say “I don’t want her to just want me for money” then proceed to offer no desirable traits or give her anything to admire and appreciate, besides money 👏🏻👏🏻👏🏻 If you want her to want you for more than money you need to have more than money to offer.",
                    "author": "WestCoastCompanion",
                    "id": "ht823rd",
                    "parent_id": "t1_ht69ftd",
                    "score": 18,
                    "created_utc": 1642537649.0,
                    "replies": [
                        {
                            "body": "The foundation is finding an SB who appreciates those things beyond the allowance that you bring to the relationship.  And who brings more to the relationship that is important to you.  \n\nAvoiding the gym...... perhaps you need an sb who will whip you into shape.",
                            "author": "pinotandsugar",
                            "id": "ht9bu48",
                            "parent_id": "t1_ht823rd",
                            "score": 2,
                            "created_utc": 1642555766.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "The amount of snarky replies to SBs that call them “low value” 😬",
                    "author": "post_typical",
                    "id": "ht6qkoq",
                    "parent_id": "t1_ht69ftd",
                    "score": 2,
                    "created_utc": 1642519995.0,
                    "replies": []
                },
                {
                    "body": "In fairness, there are more than a few posts by SBs complaining that their SD was not generous or asking how much more they should get for longer than usual dates. Lots of SB believe that if they just shake the tree harder more manna will fall out. Just as many SDs think women are only good for their holes.",
                    "author": "AFSMSgt",
                    "id": "ht73ja4",
                    "parent_id": "t1_ht69ftd",
                    "score": 1,
                    "created_utc": 1642524922.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "OP is indeed based/correct",
            "author": "LaIndiaDeAzucar",
            "id": "ht6e2la",
            "parent_id": "t1_ht68o6h",
            "score": 7,
            "created_utc": 1642514708.0,
            "replies": []
        },
        {
            "body": "Sad that men who need to understand will not be influenced!",
            "author": null,
            "id": "ht6ks84",
            "parent_id": "t1_ht68o6h",
            "score": 0,
            "created_utc": 1642517653.0,
            "replies": []
        },
        {
            "body": "Yeah I think this is preaching to the choir.",
            "author": "Careless-Parfait-587",
            "id": "ht73y1a",
            "parent_id": "t1_ht68o6h",
            "score": 1,
            "created_utc": 1642525072.0,
            "replies": [
                {
                    "body": "There might be some backsliders in the choir that need to be recommended, myself included 😅",
                    "author": null,
                    "id": "ht7dqjd",
                    "parent_id": "t1_ht73y1a",
                    "score": 2,
                    "created_utc": 1642528664.0,
                    "replies": [
                        {
                            "body": "Probably should just post your book list if you really want these guys to check them out (not thinking they'll PM).\n\nFrom what I've read on this forum it seems a problem that goes both ways.  Plenty of SBs saying they showed up... why isn't he having a great time or why isn't he spending more.\n\nReflecting on it now... it's possible most people just suck at relationships.  😉",
                            "author": "WellAdjustedJ",
                            "id": "ht93lpq",
                            "parent_id": "t1_ht7dqjd",
                            "score": 3,
                            "created_utc": 1642552181.0,
                            "replies": []
                        },
                        {
                            "body": "Fair enough.",
                            "author": "Careless-Parfait-587",
                            "id": "ht7miyl",
                            "parent_id": "t1_ht7dqjd",
                            "score": 1,
                            "created_utc": 1642531891.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Spot on",
            "author": "pinotandsugar",
            "id": "ht9bcrt",
            "parent_id": "t1_ht68o6h",
            "score": 1,
            "created_utc": 1642555553.0,
            "replies": []
        },
        {
            "body": "That's exactly what I was thinking too but didn't dare to write. I agree with most of OP's points, as I'm always a little irritated by people in this sub who act as if sugar dating is something completely different from dating. It is a form of dating and all the qualities that are important in vanilla dating are also important here (just maybe to a different extend).\n\nBut OP's post also comes off as self-promotional. And I don't like that. A few days ago in another comment, he told us that he recorded a podcast about his SR experience and asked for DMs (for a link), too. His primary audience seem to be SDs, not SBs, and I don't see why these books shouldn't be of interest for SBs, too. Is all of this just to get in contact with SDs/ presumably rich people? Maybe, OP could just explain himself a little.",
            "author": "Inner_Examination_38",
            "id": "ht7d9q0",
            "parent_id": "t1_ht6z9yz",
            "score": 3,
            "created_utc": 1642528496.0,
            "replies": [
                {
                    "body": "Ugh.  Thanks for the heads up.  That tracks.",
                    "author": "WellAdjustedJ",
                    "id": "ht94xvc",
                    "parent_id": "t1_ht7d9q0",
                    "score": 2,
                    "created_utc": 1642552722.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Thanks dude 🤝",
            "author": null,
            "id": "ht7f7fn",
            "parent_id": "t1_ht7bvn8",
            "score": 2,
            "created_utc": 1642529196.0,
            "replies": []
        },
        {
            "body": "That must have been a tough decision for you to give up a whale, especially with the other very attractive qualities you listed (fit, fun, great in bed).\n\nThanks for proving my point, that I've noticed \\*some\\* SDs thinking that \"throwing money at someone\" overrides the fact that it's still a romantic relationship, with many of same expectations, for best results. \n\nGuys that don't want to do that would be better off seeing an escort regularly.",
            "author": null,
            "id": "ht6eknj",
            "parent_id": "t1_ht69dma",
            "score": 11,
            "created_utc": 1642514941.0,
            "replies": [
                {
                    "body": "I spent a few days crying, not gonna lie. Then I dusted myself off and reminded myself I am young, I am successful, I am adored, and I am HOT ASF. So I will take my time to heal properly and then move forward. And yes darling, in the end I told him what he really wants... is a high priced escort. Which honestly yes I could have worked that angle, but I never once looked at him like that so the thought never crossed my mind. I enjoyed my time with him. Genuinely missed him when he was gone. Looking back now, there were sooo many signs... so many red flags. I collected them all and made myself a pretty red scarf 🤦‍♀️ Lesson learned. Almost entirely ruined dating for me.",
                    "author": "Brilliant_Ad2518",
                    "id": "ht9lvln",
                    "parent_id": "t1_ht6eknj",
                    "score": 5,
                    "created_utc": 1642560147.0,
                    "replies": [
                        {
                            "body": "Great attitude. As always, there is a perfect Rihanna quote for this situation 😅: \"Never a failure, always a lesson\".\n\nBest wishes",
                            "author": null,
                            "id": "hterytf",
                            "parent_id": "t1_ht9lvln",
                            "score": 2,
                            "created_utc": 1642648426.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "> my SD was younger, fit, attractive, fun, hilarious, a great lay etc\n\nThis is exactly why OP is wrong.\n\nOP said:\n\n>SDs should invest time, energy, & resources into being as physically/ emotionally attractive as possible\n\nYour whale was everything OP is telling guys to be.\n\nThe beauty of sugar is when a girl gets sick of a guy for whatever reason, there's 20 more waiting to date him.\n\nWhy put in effort, change yourself into someone you're not, all to please the unpleasable.\n\nYes basic hygiene etc are important. Beyond that, be yourself, and if you find someone who's a good fit she'll stick around.\n\nDon't waste time tilting at windmills.",
            "author": "Whale_SD",
            "id": "ht6kj2a",
            "parent_id": "t1_ht69dma",
            "score": 9,
            "created_utc": 1642517546.0,
            "replies": [
                {
                    "body": "She's also saying to be emotionally attractive. After care is important. My man was an emotional black void and I ignored all the signs because I was genuinely in love with him. We always talked about dating since day one. 3 years in and the whole \"this is just an arrangement to me\" talk happened. It took a lot for him to show emotion, and anytime he did it was like we'd take one step forward and then five steps back....",
                    "author": "Brilliant_Ad2518",
                    "id": "ht9l09k",
                    "parent_id": "t1_ht6kj2a",
                    "score": 3,
                    "created_utc": 1642559767.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Thanks I'm glad you liked my suggestions.\n\nI didn't want to create a possible frenzy over the books I recommend. \n\nI actually have written a book, but it's not directly related to this topic, so it isn't on the list.",
            "author": null,
            "id": "ht6husk",
            "parent_id": "t1_ht6eyg2",
            "score": 1,
            "created_utc": 1642516413.0,
            "replies": [
                {
                    "body": ">I didn't want to create a possible frenzy over the books I recommend\n\nImpossible, there is a pdf book of almost every book i know and I've read hundreds of thousands of books both fictional and non fictional over my life, I'm a bookworm. \n\n>I actually have written a book, but it's not directly related to this topic, so it isn't on the list.\n\nAh see that would be shilling. \n\nThe books you're promoting, did you write them or know the author/s or have anything to do with publication of said books or do you recieve an affiliate for purchased books if they're perhaps only available on Amazon on your selling bay? That would be cause for concern regarding the information and if its actually decent or not or whether you're merely looking to make a profit from a subreddit.",
                    "author": "WorldwideLoving",
                    "id": "ht6ijd7",
                    "parent_id": "t1_ht6husk",
                    "score": 2,
                    "created_utc": 1642516706.0,
                    "replies": [
                        {
                            "body": "A frenzy as in women being angry about the books I suggest.\n\nI am not selling anything.\n\nIf I was selling a book, it would make more sense to put the link in the OP, where more people would see if and click on it, don't you think?",
                            "author": null,
                            "id": "ht6jciz",
                            "parent_id": "t1_ht6ijd7",
                            "score": 2,
                            "created_utc": 1642517050.0,
                            "replies": [
                                {
                                    "body": ">A frenzy as in women being angry about the books I suggest.\n\n\nWouldn't this be the opposite of literally any SDs dreams? \n\nIf this book is the elixir you claim it to be for SDs and how to clean themselves up and seduce SBs or whatever, that's 0 issue. The issue is you're apparently super cagey with the titles & given the cageyness, leads to more questions regarding your intentions. \n\n>I am not selling anything.\n\nI've heard that before from affiliate marketers & MLM people. \n\n>If I was selling a book, it would make more sense to put the link in the OP, where more people would see if and click on it, don't you think?\n\nNo, it would make more sense to get SDs to dm you, get an email from them & spam email them with book promos & links on a email mass send which is a marketing technique and a shark technique.",
                                    "author": "WorldwideLoving",
                                    "id": "ht6kcgj",
                                    "parent_id": "t1_ht6jciz",
                                    "score": 2,
                                    "created_utc": 1642517470.0,
                                    "replies": []
                                },
                                {
                                    "body": "Your account is extremely new and you've posted mostly comments over less then a month between various subreddits. It doesn't add to your credit here within sugar & recommending books which you potentially have a part in, you're cagey with details and closed up like a clam. \n\nHowever, how do you find zkrollup? I've been looking at that for awhile. What's your preferred exchange & why",
                                    "author": "WorldwideLoving",
                                    "id": "ht6ky3s",
                                    "parent_id": "t1_ht6jciz",
                                    "score": 0,
                                    "created_utc": 1642517723.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "In a word, YES.\n\nI think that modern men are fed a lot of ~~bullshit~~  propaganda about what women want, and they're confused. Particularly younger men, say, about and under 30.",
            "author": null,
            "id": "ht6lyv2",
            "parent_id": "t1_ht6kjfx",
            "score": 2,
            "created_utc": 1642518145.0,
            "replies": [
                {
                    "body": "Yeah totally, the young guys are a bit deluded, they have no idea that macho is more impressive to their mates than to any women on the planet. Wake up guys.",
                    "author": "sexylondongirl",
                    "id": "ht6nls6",
                    "parent_id": "t1_ht6lyv2",
                    "score": 4,
                    "created_utc": 1642518815.0,
                    "replies": [
                        {
                            "body": "Wait so are you saying be macho or not?",
                            "author": "Careless-Parfait-587",
                            "id": "ht74935",
                            "parent_id": "t1_ht6nls6",
                            "score": 2,
                            "created_utc": 1642525186.0,
                            "replies": [
                                {
                                    "body": "Not who you asked, but IMO macho is very different than masculine. The latter is attractive.",
                                    "author": null,
                                    "id": "ht76dgy",
                                    "parent_id": "t1_ht74935",
                                    "score": 1,
                                    "created_utc": 1642525972.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "THIS! This is why I avoid younger daddies! It’s an entire mindset that permeates EVERYTHING they do. I know this isn’t ALL young daddies, but stereo types are stereo types for a reason.",
                    "author": null,
                    "id": "ht6xzh3",
                    "parent_id": "t1_ht6lyv2",
                    "score": 1,
                    "created_utc": 1642522842.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Agreed.\n\nExperiencing the issues you mention helped me understand why some men prefer older (28+) SBs.\n\nYoung, very attractive women are like celebrities. They have everything going on: men of all ages, races, statuses, etc. vying for their attention, not to mention friends, family, social media, college, etc. etc.\n\nEven leading with my wallet, and being overly generous, it's hard to keep their attention for very long.",
            "author": null,
            "id": "ht7f3dh",
            "parent_id": "t1_ht7b26o",
            "score": 0,
            "created_utc": 1642529156.0,
            "replies": [
                {
                    "body": "That is a type that I avoid regardless of age. If their Instagram is nothing but concerts and travel I avoid them or relegate them to very part-time (when they need rent money) status.  \n\nI have had good luck with younger girls that are homebodies but issues still pop up that are beyond my control.  My 26 yo single mom is by far the most reliable.",
                    "author": "LotBuilder",
                    "id": "ht7hu31",
                    "parent_id": "t1_ht7f3dh",
                    "score": 3,
                    "created_utc": 1642530159.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "🤝 Thanks man, Same to you!",
            "author": null,
            "id": "ht8niuf",
            "parent_id": "t1_ht8gcf2",
            "score": 1,
            "created_utc": 1642545590.0,
            "replies": []
        },
        {
            "body": "I was taken aback by the anger. \n\nThis is genuinely intended to help everyone involved have better outcomes in their SR, and relationships in general.",
            "author": null,
            "id": "ht6dw30",
            "parent_id": "t1_ht681b8",
            "score": 7,
            "created_utc": 1642514625.0,
            "replies": [
                {
                    "body": "> I was taken aback by the anger. \n\nYou must be new here. lol",
                    "author": "Y_4Z44",
                    "id": "ht6rbbe",
                    "parent_id": "t1_ht6dw30",
                    "score": 6,
                    "created_utc": 1642520283.0,
                    "replies": [
                        {
                            "body": "To Reddit, kind of. I avoided this site for years bc of the toxicity and full scale left/ progressive bias (my perception).\n\nThis, and a few fitness subs, are the only ones I participate on.",
                            "author": null,
                            "id": "ht6tf7h",
                            "parent_id": "t1_ht6rbbe",
                            "score": 1,
                            "created_utc": 1642521094.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Thank you.",
            "author": null,
            "id": "ht6syu9",
            "parent_id": "t1_ht6avvf",
            "score": 1,
            "created_utc": 1642520922.0,
            "replies": []
        },
        {
            "body": "I mean but if you enter into an arrangement with a guy that’s married why would you expect those things.\n\nEdit: typos",
            "author": "Careless-Parfait-587",
            "id": "ht74dl3",
            "parent_id": "t1_ht6lc8e",
            "score": 2,
            "created_utc": 1642525232.0,
            "replies": [
                {
                    "body": ">nter into an arrangement with a guy that married why would you expect those things.\n\nEveryone's expectations are their own to set and their own to negotiate for.",
                    "author": "Rrrraiiiiden",
                    "id": "ht754tx",
                    "parent_id": "t1_ht74dl3",
                    "score": 3,
                    "created_utc": 1642525516.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Congrats on working on yourself. Can you talk more about how a therapist has benefitted you? Do you recommend therapy as an option for men?\n\nSome people think (and I have found) talk therapy to often not be helpful for men. \n\nCompletely agree about the rest of your comment. I lost an awesome SB at the very beginning of my SR experience bc of not communicating enough. I just didn't know if I should text her (bother her, I worried) when we weren't together.",
            "author": null,
            "id": "ht6mk24",
            "parent_id": "t1_ht6lc8e",
            "score": 3,
            "created_utc": 1642518389.0,
            "replies": [
                {
                    "body": "Talk therapy is only as effective as your own ability to narrate your interior feelings.  Tragically, men are programmed to only either laugh or be angry.\n\nSomatic healing models are much more effective for people who are not emotionally intelligent yet.  Yoga is one such example.  The Body Keeps The Score is a wonderful book about somatic healing.\n\nI recommend talk therapy for everyone.  If you don’t have the ability to identify and name your feelings, you’re being ruled by them.  It feels awkward as hell at first but talk therapy (with a good therapist) flexes the necessary neural pathways to form trusting relationships.",
                    "author": "post_typical",
                    "id": "ht6rny4",
                    "parent_id": "t1_ht6mk24",
                    "score": 6,
                    "created_utc": 1642520420.0,
                    "replies": [
                        {
                            "body": "Would recommend taking The Body Keeps the Score a little slowly if you’ve had any type of trauma. It’s been quite triggering for a lot of people, but it is a very great resource for healing.",
                            "author": "Azucarbabby",
                            "id": "ht7b8ka",
                            "parent_id": "t1_ht6rny4",
                            "score": 5,
                            "created_utc": 1642527760.0,
                            "replies": [
                                {
                                    "body": "Very good advice & thank you.  I overlooked that disclaimer which I normally add.",
                                    "author": "post_typical",
                                    "id": "ht7ipve",
                                    "parent_id": "t1_ht7b8ka",
                                    "score": 1,
                                    "created_utc": 1642530485.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "This is incredibly insightful and based on my experience very true. We're getting a little woo woo lol.\n\nI've made a shit shit shit ton of progress in therapy in about 3 months, BUT this is coming from the last 5 years of doing yoga, meditation, and learning mind body connection both in meditation and in exercise (both yoga and resistance training). That said I would recommend therapy, even if you only plan on it for like 2-3 months at a time. The one thing I've learned is stops and starts with this kind of shit is that those are also beneficial.\n\nLastly u/ChanceBerryman I would say you specifically would benefit because your comment about worrying about what she might think sounds like you have identity issues that are cause from your primary caregivers as a child. but i'm not actually a therapist. the one thing sugaring has allowed me to do is be able to get over that shit in a safe space created by my wealth.",
                            "author": "Rrrraiiiiden",
                            "id": "ht7bcne",
                            "parent_id": "t1_ht6rny4",
                            "score": 3,
                            "created_utc": 1642527800.0,
                            "replies": [
                                {
                                    "body": "Ever fix up your appearance, check your outfit or breath before meeting up with someone? Then you've \"worried\" about what she might think. This is perfectly normal - everyone wants to make a good impression.\n\nThat being said, everyone can benefit from working on the mind (like one would work on their body at a gym).  Therapy is like getting a personal trainer for the mind.",
                                    "author": "tumbleweedrunner2",
                                    "id": "ht9931y",
                                    "parent_id": "t1_ht7bcne",
                                    "score": 2,
                                    "created_utc": 1642554559.0,
                                    "replies": []
                                },
                                {
                                    "body": "u/Rrrraiiiiden I appreciate your recommendatiion. I'm willing to try it out.",
                                    "author": null,
                                    "id": "ht7e97t",
                                    "parent_id": "t1_ht7bcne",
                                    "score": 1,
                                    "created_utc": 1642528850.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I believe we're making the same point.\n\nSugaring puts you in the company of women you wouldn't have a chance with otherwise. At least that's why I do it, in conjunction with occasionally vanilla dating. \n\nOnce that happens, the man still has to be attractive enough to keep the SB interested.",
            "author": null,
            "id": "ht6sgus",
            "parent_id": "t1_ht6rm4i",
            "score": 3,
            "created_utc": 1642520730.0,
            "replies": []
        },
        {
            "body": "Any SD that has any physical or mental ineptness will just have to pay more to keep the women.\n\nBut, if you lead women with money only it will be the only link that you have.  Without anything else to keep them interested, you can only keep paying and will never stop.\n\nI've had SBs that came to see me for no PPM simply because they find other value being with me than only $$.",
            "author": "MKTekke",
            "id": "ht7otgu",
            "parent_id": "t1_ht6rm4i",
            "score": 2,
            "created_utc": 1642532737.0,
            "replies": [
                {
                    "body": "Continuing to pay isn’t really a problem since that’s what an SD is supposed to to do in an SR.\n\nBut aside from that ‘leading with money’ doesn’t always lead the the outcome you describe. I’ve had several sugar relationships move past a certain point where the girl asks for payments to stop so we can just date.\n\nSome girls are just content dating a wealthier guy.",
                    "author": "django_uncoined",
                    "id": "ht7v5ov",
                    "parent_id": "t1_ht7otgu",
                    "score": 0,
                    "created_utc": 1642535084.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "If you want to be non-sexual friends with women, and hear you're \"like a brother to me!\", go ahead.",
            "author": null,
            "id": "ht7zpul",
            "parent_id": "t1_ht7vomj",
            "score": 2,
            "created_utc": 1642536780.0,
            "replies": []
        },
        {
            "body": "100%.\n\nI think a man that is doing everything else I listed would automatically have more sexual options, which, like you said, is catnip to women.\n\nI have a saying, \"Women can smell 🐈 on a man, and they like it.\"",
            "author": null,
            "id": "ht6lfwt",
            "parent_id": "t1_ht6jhc1",
            "score": -1,
            "created_utc": 1642517928.0,
            "replies": []
        },
        {
            "body": "Exactly right. Women tend to be jealous, envious, and competitive with each other. So landing a guy that everyone wants is an ego boost. All the drama that comes from a man like that having all the options is both a gift and a curse!",
            "author": "django_uncoined",
            "id": "ht6rxy6",
            "parent_id": "t1_ht6jhc1",
            "score": -3,
            "created_utc": 1642520526.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "ht7mod4",
                    "parent_id": "t1_ht6rxy6",
                    "score": 7,
                    "created_utc": 1642531947.0,
                    "replies": [
                        {
                            "body": "For you. Loyalty isn’t defined by sex for everyone. \n\nFor me loyalty is about taking care of each other emotionally, contributing to each other, and sticking with each other through hard times. Sex and monogamy are frankly not attributes I’d gauge loyalty by at all.\n\nFurther, you’re responding to this as if I said being desirable is the only thing people find attractive in men. It’s not. But there’s no point denying that having a partner who is found attractive by others can itself be part of the attraction. Not for everyone, of course.",
                            "author": "django_uncoined",
                            "id": "ht7vvqt",
                            "parent_id": "t1_ht7mod4",
                            "score": 2,
                            "created_utc": 1642535351.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "ht80zn0",
                                    "parent_id": "t1_ht7vvqt",
                                    "score": 2,
                                    "created_utc": 1642537245.0,
                                    "replies": [
                                        {
                                            "body": "What you mean is you projected a whole bunch of things that I didn’t say. \n\nJust because some women are jealous doesn’t mean they all are. And just because some people like people who are wanted by others, doesn’t mean they all do. \n\nI didn’t say or imply either of those things.\n\nSomeone saying “Roses tend to be red” does not mean white roses don’t exist.",
                                            "author": "django_uncoined",
                                            "id": "ht8g76w",
                                            "parent_id": "t1_ht80zn0",
                                            "score": -1,
                                            "created_utc": 1642542788.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "These are all excellent points. \n\nI guess if a guy's biggest problem is not knowing how to relate to women, SR doesn't solve that. \n\nFor everything else, you're spot on.",
            "author": null,
            "id": "ht6st5f",
            "parent_id": "t1_ht6nt5n",
            "score": 2,
            "created_utc": 1642520860.0,
            "replies": []
        },
        {
            "body": ">SR's are the perfect solution to all of these problems:  lawful, best ROI, hottest women, lowest risk\n\nSpecifically, elaborate on the ROI area within this commentary lol",
            "author": "WorldwideLoving",
            "id": "ht6swl3",
            "parent_id": "t1_ht6nt5n",
            "score": 1,
            "created_utc": 1642520898.0,
            "replies": [
                {
                    "body": "imo, Enjoyment vs. Investment of money and time is exponentially higher in sugaring.",
                    "author": null,
                    "id": "ht7feu0",
                    "parent_id": "t1_ht6swl3",
                    "score": 1,
                    "created_utc": 1642529271.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Well said!",
            "author": null,
            "id": "ht7zvm3",
            "parent_id": "t1_ht7k2ul",
            "score": 1,
            "created_utc": 1642536838.0,
            "replies": []
        },
        {
            "body": "🎯 Thank you. I agree. SR is a great way for shy men, or men who don't have very much experience/ interactions with women, to get more comfortable.",
            "author": null,
            "id": "ht693yx",
            "parent_id": "t1_ht66uqu",
            "score": 3,
            "created_utc": 1642512295.0,
            "replies": []
        },
        {
            "body": "Ideally but 85% are married!",
            "author": null,
            "id": "ht6myok",
            "parent_id": "t1_ht6ljvm",
            "score": 5,
            "created_utc": 1642518555.0,
            "replies": [
                {
                    "body": "And that's a crying shame. They got snapped up and their woman won't let them go. Doesn't stop some of them being SDs though ;-)",
                    "author": "sexylondongirl",
                    "id": "ht6nxf2",
                    "parent_id": "t1_ht6myok",
                    "score": 2,
                    "created_utc": 1642518948.0,
                    "replies": [
                        {
                            "body": "I think wealth brings with it nothing more than options. Thats all. When they have wealth they can create options, be it homes, cars, women, toys etc.",
                            "author": null,
                            "id": "ht75o19",
                            "parent_id": "t1_ht6nxf2",
                            "score": 2,
                            "created_utc": 1642525714.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": ">Wouldn't a wealthy man who's also muscular, fashionable, and knows eduction/game be able to date vanilla and not need to be a SD?\n\nYes, he would be able to date vanilla. And those who are utterly failing at vanilla dating, I would not advise to sugar date. But if you are already succesful, adding sugar  can make everything even better. At least, that's my impression.",
            "author": "Inner_Examination_38",
            "id": "ht6nenw",
            "parent_id": "t1_ht6ljvm",
            "score": 2,
            "created_utc": 1642518736.0,
            "replies": [
                {
                    "body": "Agreed. Sugar on top makes everything better 😁",
                    "author": null,
                    "id": "ht6xcrm",
                    "parent_id": "t1_ht6nenw",
                    "score": 2,
                    "created_utc": 1642522604.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "There's other reasons for pursuing SR than not being able to date vanilla IMO.\n\nThere's several men in this sub who date vanilla and SR interchangeably, myself included.",
            "author": null,
            "id": "ht6x90y",
            "parent_id": "t1_ht6ljvm",
            "score": 1,
            "created_utc": 1642522564.0,
            "replies": []
        },
        {
            "body": "\"Incel\"??",
            "author": null,
            "id": "ht65evj",
            "parent_id": "t1_ht658an",
            "score": 5,
            "created_utc": 1642510201.0,
            "replies": []
        },
        {
            "body": "Several threads in the last week of SBs complaining that men didn't shower before intimacy, and several threads by younger SDs making the mistakes I mentioned here, and asking why the women ghosted them.\n\nGreat that it's not applicable advice to you, but obviously other men need to hear it.",
            "author": null,
            "id": "ht65ohr",
            "parent_id": "t1_ht65hsn",
            "score": 11,
            "created_utc": 1642510356.0,
            "replies": [
                {
                    "body": "Do you really think grown ass men who still don't know good hygiene, grooming, etc., will read your post and suddenly snap to it?\n\nWhy do people need to DM you for your book suggestions? Do they need to do it in the next 30 mins to also get the free gift?",
                    "author": "vince539839",
                    "id": "ht66h05",
                    "parent_id": "t1_ht65ohr",
                    "score": -6,
                    "created_utc": 1642510817.0,
                    "replies": [
                        {
                            "body": "Frankly, I'm happy to hear about men who don't understand personal hygiene, gentlemanly conduct, mature behavior.  It makes it so easy for me to stand out from the crowd!",
                            "author": "DaddyBeenThere",
                            "id": "ht6crtj",
                            "parent_id": "t1_ht66h05",
                            "score": 6,
                            "created_utc": 1642514103.0,
                            "replies": [
                                {
                                    "body": "The stories are funny but I think bad experiences will drive good SBs out of the bowl, limiting availability and quality.",
                                    "author": null,
                                    "id": "ht6j3te",
                                    "parent_id": "t1_ht6crtj",
                                    "score": 5,
                                    "created_utc": 1642516948.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "....what are you so angry about?\n\nthere was a thread of an SB saying a guy \"tasted like pee\". Two other guys posted, confused why they were ghosted, when they had done things that are obvious (to me, and men with more experience with women) turn offs.\n\nI didn't want to list the books here and have women piling on discrediting the books I recommend.",
                            "author": null,
                            "id": "ht67ccm",
                            "parent_id": "t1_ht66h05",
                            "score": 10,
                            "created_utc": 1642511319.0,
                            "replies": []
                        },
                        {
                            "body": "This genuinely made me laugh!",
                            "author": "packyourtoothbrush_",
                            "id": "htaapyk",
                            "parent_id": "t1_ht66h05",
                            "score": 2,
                            "created_utc": 1642572661.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "is my post one of these posts?  I tried dming but your dms are closed.  I'm curious about any specific feedback you have.",
                    "author": "newbieSDwtf",
                    "id": "ht7gp3x",
                    "parent_id": "t1_ht65ohr",
                    "score": 1,
                    "created_utc": 1642529740.0,
                    "replies": [
                        {
                            "body": "I don't think so, but seeing your post history I think you could benefit. My DMs aren't closed, some other guys messaged me.",
                            "author": null,
                            "id": "ht7hllz",
                            "parent_id": "t1_ht7gp3x",
                            "score": 0,
                            "created_utc": 1642530073.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I see you may have posted a number which is most likely an amount in relations to an arrangement. If this is the case, you are violating Rule #4 - \"No dollar amounts that are in reference to allowance/PPM are allowed.\"\n\nIf you are curious about Allowances reported by SLF contributors please see the [Allowance Master Thread 2021-2022](/r/sugarlifestyleforum/comments/pc22tk/allowance_master_thread_20212022/).\n\nYour post will not be approved until you remove the amount.  Please read the sub [Rules](/r/sugarlifestyleforum/comments/748zta/updated_and_clarified_rules_for_slf/) prior to posting anything else. \n\nIf you simply posted a number not referencing a monetary amount, please message the MODs to approve your post.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/sugarlifestyleforum) if you have any questions or concerns.*",
            "author": "AutoModerator",
            "id": "ht7v65k",
            "parent_id": "t1_ht7v63t",
            "score": 1,
            "created_utc": 1642535089.0,
            "replies": []
        },
        {
            "body": "This is true. People say “I don’t want her to just want me for money” then proceed to offer no desirable traits or give her anything to admire and appreciate, besides money 👏🏻👏🏻👏🏻 If you want her to want you for more than money you need to have more than money to offer.",
            "author": "WestCoastCompanion",
            "id": "ht823rd",
            "parent_id": "t1_ht69ftd",
            "score": 18,
            "created_utc": 1642537649.0,
            "replies": [
                {
                    "body": "The foundation is finding an SB who appreciates those things beyond the allowance that you bring to the relationship.  And who brings more to the relationship that is important to you.  \n\nAvoiding the gym...... perhaps you need an sb who will whip you into shape.",
                    "author": "pinotandsugar",
                    "id": "ht9bu48",
                    "parent_id": "t1_ht823rd",
                    "score": 2,
                    "created_utc": 1642555766.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "The amount of snarky replies to SBs that call them “low value” 😬",
            "author": "post_typical",
            "id": "ht6qkoq",
            "parent_id": "t1_ht69ftd",
            "score": 2,
            "created_utc": 1642519995.0,
            "replies": []
        },
        {
            "body": "In fairness, there are more than a few posts by SBs complaining that their SD was not generous or asking how much more they should get for longer than usual dates. Lots of SB believe that if they just shake the tree harder more manna will fall out. Just as many SDs think women are only good for their holes.",
            "author": "AFSMSgt",
            "id": "ht73ja4",
            "parent_id": "t1_ht69ftd",
            "score": 1,
            "created_utc": 1642524922.0,
            "replies": []
        },
        {
            "body": "There might be some backsliders in the choir that need to be recommended, myself included 😅",
            "author": null,
            "id": "ht7dqjd",
            "parent_id": "t1_ht73y1a",
            "score": 2,
            "created_utc": 1642528664.0,
            "replies": [
                {
                    "body": "Probably should just post your book list if you really want these guys to check them out (not thinking they'll PM).\n\nFrom what I've read on this forum it seems a problem that goes both ways.  Plenty of SBs saying they showed up... why isn't he having a great time or why isn't he spending more.\n\nReflecting on it now... it's possible most people just suck at relationships.  😉",
                    "author": "WellAdjustedJ",
                    "id": "ht93lpq",
                    "parent_id": "t1_ht7dqjd",
                    "score": 3,
                    "created_utc": 1642552181.0,
                    "replies": []
                },
                {
                    "body": "Fair enough.",
                    "author": "Careless-Parfait-587",
                    "id": "ht7miyl",
                    "parent_id": "t1_ht7dqjd",
                    "score": 1,
                    "created_utc": 1642531891.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Ugh.  Thanks for the heads up.  That tracks.",
            "author": "WellAdjustedJ",
            "id": "ht94xvc",
            "parent_id": "t1_ht7d9q0",
            "score": 2,
            "created_utc": 1642552722.0,
            "replies": []
        },
        {
            "body": "I spent a few days crying, not gonna lie. Then I dusted myself off and reminded myself I am young, I am successful, I am adored, and I am HOT ASF. So I will take my time to heal properly and then move forward. And yes darling, in the end I told him what he really wants... is a high priced escort. Which honestly yes I could have worked that angle, but I never once looked at him like that so the thought never crossed my mind. I enjoyed my time with him. Genuinely missed him when he was gone. Looking back now, there were sooo many signs... so many red flags. I collected them all and made myself a pretty red scarf 🤦‍♀️ Lesson learned. Almost entirely ruined dating for me.",
            "author": "Brilliant_Ad2518",
            "id": "ht9lvln",
            "parent_id": "t1_ht6eknj",
            "score": 5,
            "created_utc": 1642560147.0,
            "replies": [
                {
                    "body": "Great attitude. As always, there is a perfect Rihanna quote for this situation 😅: \"Never a failure, always a lesson\".\n\nBest wishes",
                    "author": null,
                    "id": "hterytf",
                    "parent_id": "t1_ht9lvln",
                    "score": 2,
                    "created_utc": 1642648426.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "She's also saying to be emotionally attractive. After care is important. My man was an emotional black void and I ignored all the signs because I was genuinely in love with him. We always talked about dating since day one. 3 years in and the whole \"this is just an arrangement to me\" talk happened. It took a lot for him to show emotion, and anytime he did it was like we'd take one step forward and then five steps back....",
            "author": "Brilliant_Ad2518",
            "id": "ht9l09k",
            "parent_id": "t1_ht6kj2a",
            "score": 3,
            "created_utc": 1642559767.0,
            "replies": []
        },
        {
            "body": ">I didn't want to create a possible frenzy over the books I recommend\n\nImpossible, there is a pdf book of almost every book i know and I've read hundreds of thousands of books both fictional and non fictional over my life, I'm a bookworm. \n\n>I actually have written a book, but it's not directly related to this topic, so it isn't on the list.\n\nAh see that would be shilling. \n\nThe books you're promoting, did you write them or know the author/s or have anything to do with publication of said books or do you recieve an affiliate for purchased books if they're perhaps only available on Amazon on your selling bay? That would be cause for concern regarding the information and if its actually decent or not or whether you're merely looking to make a profit from a subreddit.",
            "author": "WorldwideLoving",
            "id": "ht6ijd7",
            "parent_id": "t1_ht6husk",
            "score": 2,
            "created_utc": 1642516706.0,
            "replies": [
                {
                    "body": "A frenzy as in women being angry about the books I suggest.\n\nI am not selling anything.\n\nIf I was selling a book, it would make more sense to put the link in the OP, where more people would see if and click on it, don't you think?",
                    "author": null,
                    "id": "ht6jciz",
                    "parent_id": "t1_ht6ijd7",
                    "score": 2,
                    "created_utc": 1642517050.0,
                    "replies": [
                        {
                            "body": ">A frenzy as in women being angry about the books I suggest.\n\n\nWouldn't this be the opposite of literally any SDs dreams? \n\nIf this book is the elixir you claim it to be for SDs and how to clean themselves up and seduce SBs or whatever, that's 0 issue. The issue is you're apparently super cagey with the titles & given the cageyness, leads to more questions regarding your intentions. \n\n>I am not selling anything.\n\nI've heard that before from affiliate marketers & MLM people. \n\n>If I was selling a book, it would make more sense to put the link in the OP, where more people would see if and click on it, don't you think?\n\nNo, it would make more sense to get SDs to dm you, get an email from them & spam email them with book promos & links on a email mass send which is a marketing technique and a shark technique.",
                            "author": "WorldwideLoving",
                            "id": "ht6kcgj",
                            "parent_id": "t1_ht6jciz",
                            "score": 2,
                            "created_utc": 1642517470.0,
                            "replies": []
                        },
                        {
                            "body": "Your account is extremely new and you've posted mostly comments over less then a month between various subreddits. It doesn't add to your credit here within sugar & recommending books which you potentially have a part in, you're cagey with details and closed up like a clam. \n\nHowever, how do you find zkrollup? I've been looking at that for awhile. What's your preferred exchange & why",
                            "author": "WorldwideLoving",
                            "id": "ht6ky3s",
                            "parent_id": "t1_ht6jciz",
                            "score": 0,
                            "created_utc": 1642517723.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yeah totally, the young guys are a bit deluded, they have no idea that macho is more impressive to their mates than to any women on the planet. Wake up guys.",
            "author": "sexylondongirl",
            "id": "ht6nls6",
            "parent_id": "t1_ht6lyv2",
            "score": 4,
            "created_utc": 1642518815.0,
            "replies": [
                {
                    "body": "Wait so are you saying be macho or not?",
                    "author": "Careless-Parfait-587",
                    "id": "ht74935",
                    "parent_id": "t1_ht6nls6",
                    "score": 2,
                    "created_utc": 1642525186.0,
                    "replies": [
                        {
                            "body": "Not who you asked, but IMO macho is very different than masculine. The latter is attractive.",
                            "author": null,
                            "id": "ht76dgy",
                            "parent_id": "t1_ht74935",
                            "score": 1,
                            "created_utc": 1642525972.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "THIS! This is why I avoid younger daddies! It’s an entire mindset that permeates EVERYTHING they do. I know this isn’t ALL young daddies, but stereo types are stereo types for a reason.",
            "author": null,
            "id": "ht6xzh3",
            "parent_id": "t1_ht6lyv2",
            "score": 1,
            "created_utc": 1642522842.0,
            "replies": []
        },
        {
            "body": "That is a type that I avoid regardless of age. If their Instagram is nothing but concerts and travel I avoid them or relegate them to very part-time (when they need rent money) status.  \n\nI have had good luck with younger girls that are homebodies but issues still pop up that are beyond my control.  My 26 yo single mom is by far the most reliable.",
            "author": "LotBuilder",
            "id": "ht7hu31",
            "parent_id": "t1_ht7f3dh",
            "score": 3,
            "created_utc": 1642530159.0,
            "replies": []
        },
        {
            "body": "> I was taken aback by the anger. \n\nYou must be new here. lol",
            "author": "Y_4Z44",
            "id": "ht6rbbe",
            "parent_id": "t1_ht6dw30",
            "score": 6,
            "created_utc": 1642520283.0,
            "replies": [
                {
                    "body": "To Reddit, kind of. I avoided this site for years bc of the toxicity and full scale left/ progressive bias (my perception).\n\nThis, and a few fitness subs, are the only ones I participate on.",
                    "author": null,
                    "id": "ht6tf7h",
                    "parent_id": "t1_ht6rbbe",
                    "score": 1,
                    "created_utc": 1642521094.0,
                    "replies": []
                }
            ]
        },
        {
            "body": ">nter into an arrangement with a guy that married why would you expect those things.\n\nEveryone's expectations are their own to set and their own to negotiate for.",
            "author": "Rrrraiiiiden",
            "id": "ht754tx",
            "parent_id": "t1_ht74dl3",
            "score": 3,
            "created_utc": 1642525516.0,
            "replies": []
        },
        {
            "body": "Talk therapy is only as effective as your own ability to narrate your interior feelings.  Tragically, men are programmed to only either laugh or be angry.\n\nSomatic healing models are much more effective for people who are not emotionally intelligent yet.  Yoga is one such example.  The Body Keeps The Score is a wonderful book about somatic healing.\n\nI recommend talk therapy for everyone.  If you don’t have the ability to identify and name your feelings, you’re being ruled by them.  It feels awkward as hell at first but talk therapy (with a good therapist) flexes the necessary neural pathways to form trusting relationships.",
            "author": "post_typical",
            "id": "ht6rny4",
            "parent_id": "t1_ht6mk24",
            "score": 6,
            "created_utc": 1642520420.0,
            "replies": [
                {
                    "body": "Would recommend taking The Body Keeps the Score a little slowly if you’ve had any type of trauma. It’s been quite triggering for a lot of people, but it is a very great resource for healing.",
                    "author": "Azucarbabby",
                    "id": "ht7b8ka",
                    "parent_id": "t1_ht6rny4",
                    "score": 5,
                    "created_utc": 1642527760.0,
                    "replies": [
                        {
                            "body": "Very good advice & thank you.  I overlooked that disclaimer which I normally add.",
                            "author": "post_typical",
                            "id": "ht7ipve",
                            "parent_id": "t1_ht7b8ka",
                            "score": 1,
                            "created_utc": 1642530485.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "This is incredibly insightful and based on my experience very true. We're getting a little woo woo lol.\n\nI've made a shit shit shit ton of progress in therapy in about 3 months, BUT this is coming from the last 5 years of doing yoga, meditation, and learning mind body connection both in meditation and in exercise (both yoga and resistance training). That said I would recommend therapy, even if you only plan on it for like 2-3 months at a time. The one thing I've learned is stops and starts with this kind of shit is that those are also beneficial.\n\nLastly u/ChanceBerryman I would say you specifically would benefit because your comment about worrying about what she might think sounds like you have identity issues that are cause from your primary caregivers as a child. but i'm not actually a therapist. the one thing sugaring has allowed me to do is be able to get over that shit in a safe space created by my wealth.",
                    "author": "Rrrraiiiiden",
                    "id": "ht7bcne",
                    "parent_id": "t1_ht6rny4",
                    "score": 3,
                    "created_utc": 1642527800.0,
                    "replies": [
                        {
                            "body": "Ever fix up your appearance, check your outfit or breath before meeting up with someone? Then you've \"worried\" about what she might think. This is perfectly normal - everyone wants to make a good impression.\n\nThat being said, everyone can benefit from working on the mind (like one would work on their body at a gym).  Therapy is like getting a personal trainer for the mind.",
                            "author": "tumbleweedrunner2",
                            "id": "ht9931y",
                            "parent_id": "t1_ht7bcne",
                            "score": 2,
                            "created_utc": 1642554559.0,
                            "replies": []
                        },
                        {
                            "body": "u/Rrrraiiiiden I appreciate your recommendatiion. I'm willing to try it out.",
                            "author": null,
                            "id": "ht7e97t",
                            "parent_id": "t1_ht7bcne",
                            "score": 1,
                            "created_utc": 1642528850.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Continuing to pay isn’t really a problem since that’s what an SD is supposed to to do in an SR.\n\nBut aside from that ‘leading with money’ doesn’t always lead the the outcome you describe. I’ve had several sugar relationships move past a certain point where the girl asks for payments to stop so we can just date.\n\nSome girls are just content dating a wealthier guy.",
            "author": "django_uncoined",
            "id": "ht7v5ov",
            "parent_id": "t1_ht7otgu",
            "score": 0,
            "created_utc": 1642535084.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "ht7mod4",
            "parent_id": "t1_ht6rxy6",
            "score": 7,
            "created_utc": 1642531947.0,
            "replies": [
                {
                    "body": "For you. Loyalty isn’t defined by sex for everyone. \n\nFor me loyalty is about taking care of each other emotionally, contributing to each other, and sticking with each other through hard times. Sex and monogamy are frankly not attributes I’d gauge loyalty by at all.\n\nFurther, you’re responding to this as if I said being desirable is the only thing people find attractive in men. It’s not. But there’s no point denying that having a partner who is found attractive by others can itself be part of the attraction. Not for everyone, of course.",
                    "author": "django_uncoined",
                    "id": "ht7vvqt",
                    "parent_id": "t1_ht7mod4",
                    "score": 2,
                    "created_utc": 1642535351.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "ht80zn0",
                            "parent_id": "t1_ht7vvqt",
                            "score": 2,
                            "created_utc": 1642537245.0,
                            "replies": [
                                {
                                    "body": "What you mean is you projected a whole bunch of things that I didn’t say. \n\nJust because some women are jealous doesn’t mean they all are. And just because some people like people who are wanted by others, doesn’t mean they all do. \n\nI didn’t say or imply either of those things.\n\nSomeone saying “Roses tend to be red” does not mean white roses don’t exist.",
                                    "author": "django_uncoined",
                                    "id": "ht8g76w",
                                    "parent_id": "t1_ht80zn0",
                                    "score": -1,
                                    "created_utc": 1642542788.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "imo, Enjoyment vs. Investment of money and time is exponentially higher in sugaring.",
            "author": null,
            "id": "ht7feu0",
            "parent_id": "t1_ht6swl3",
            "score": 1,
            "created_utc": 1642529271.0,
            "replies": []
        },
        {
            "body": "And that's a crying shame. They got snapped up and their woman won't let them go. Doesn't stop some of them being SDs though ;-)",
            "author": "sexylondongirl",
            "id": "ht6nxf2",
            "parent_id": "t1_ht6myok",
            "score": 2,
            "created_utc": 1642518948.0,
            "replies": [
                {
                    "body": "I think wealth brings with it nothing more than options. Thats all. When they have wealth they can create options, be it homes, cars, women, toys etc.",
                    "author": null,
                    "id": "ht75o19",
                    "parent_id": "t1_ht6nxf2",
                    "score": 2,
                    "created_utc": 1642525714.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Agreed. Sugar on top makes everything better 😁",
            "author": null,
            "id": "ht6xcrm",
            "parent_id": "t1_ht6nenw",
            "score": 2,
            "created_utc": 1642522604.0,
            "replies": []
        },
        {
            "body": "Do you really think grown ass men who still don't know good hygiene, grooming, etc., will read your post and suddenly snap to it?\n\nWhy do people need to DM you for your book suggestions? Do they need to do it in the next 30 mins to also get the free gift?",
            "author": "vince539839",
            "id": "ht66h05",
            "parent_id": "t1_ht65ohr",
            "score": -6,
            "created_utc": 1642510817.0,
            "replies": [
                {
                    "body": "Frankly, I'm happy to hear about men who don't understand personal hygiene, gentlemanly conduct, mature behavior.  It makes it so easy for me to stand out from the crowd!",
                    "author": "DaddyBeenThere",
                    "id": "ht6crtj",
                    "parent_id": "t1_ht66h05",
                    "score": 6,
                    "created_utc": 1642514103.0,
                    "replies": [
                        {
                            "body": "The stories are funny but I think bad experiences will drive good SBs out of the bowl, limiting availability and quality.",
                            "author": null,
                            "id": "ht6j3te",
                            "parent_id": "t1_ht6crtj",
                            "score": 5,
                            "created_utc": 1642516948.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "....what are you so angry about?\n\nthere was a thread of an SB saying a guy \"tasted like pee\". Two other guys posted, confused why they were ghosted, when they had done things that are obvious (to me, and men with more experience with women) turn offs.\n\nI didn't want to list the books here and have women piling on discrediting the books I recommend.",
                    "author": null,
                    "id": "ht67ccm",
                    "parent_id": "t1_ht66h05",
                    "score": 10,
                    "created_utc": 1642511319.0,
                    "replies": []
                },
                {
                    "body": "This genuinely made me laugh!",
                    "author": "packyourtoothbrush_",
                    "id": "htaapyk",
                    "parent_id": "t1_ht66h05",
                    "score": 2,
                    "created_utc": 1642572661.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "is my post one of these posts?  I tried dming but your dms are closed.  I'm curious about any specific feedback you have.",
            "author": "newbieSDwtf",
            "id": "ht7gp3x",
            "parent_id": "t1_ht65ohr",
            "score": 1,
            "created_utc": 1642529740.0,
            "replies": [
                {
                    "body": "I don't think so, but seeing your post history I think you could benefit. My DMs aren't closed, some other guys messaged me.",
                    "author": null,
                    "id": "ht7hllz",
                    "parent_id": "t1_ht7gp3x",
                    "score": 0,
                    "created_utc": 1642530073.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "The foundation is finding an SB who appreciates those things beyond the allowance that you bring to the relationship.  And who brings more to the relationship that is important to you.  \n\nAvoiding the gym...... perhaps you need an sb who will whip you into shape.",
            "author": "pinotandsugar",
            "id": "ht9bu48",
            "parent_id": "t1_ht823rd",
            "score": 2,
            "created_utc": 1642555766.0,
            "replies": []
        },
        {
            "body": "Probably should just post your book list if you really want these guys to check them out (not thinking they'll PM).\n\nFrom what I've read on this forum it seems a problem that goes both ways.  Plenty of SBs saying they showed up... why isn't he having a great time or why isn't he spending more.\n\nReflecting on it now... it's possible most people just suck at relationships.  😉",
            "author": "WellAdjustedJ",
            "id": "ht93lpq",
            "parent_id": "t1_ht7dqjd",
            "score": 3,
            "created_utc": 1642552181.0,
            "replies": []
        },
        {
            "body": "Fair enough.",
            "author": "Careless-Parfait-587",
            "id": "ht7miyl",
            "parent_id": "t1_ht7dqjd",
            "score": 1,
            "created_utc": 1642531891.0,
            "replies": []
        },
        {
            "body": "Great attitude. As always, there is a perfect Rihanna quote for this situation 😅: \"Never a failure, always a lesson\".\n\nBest wishes",
            "author": null,
            "id": "hterytf",
            "parent_id": "t1_ht9lvln",
            "score": 2,
            "created_utc": 1642648426.0,
            "replies": []
        },
        {
            "body": "A frenzy as in women being angry about the books I suggest.\n\nI am not selling anything.\n\nIf I was selling a book, it would make more sense to put the link in the OP, where more people would see if and click on it, don't you think?",
            "author": null,
            "id": "ht6jciz",
            "parent_id": "t1_ht6ijd7",
            "score": 2,
            "created_utc": 1642517050.0,
            "replies": [
                {
                    "body": ">A frenzy as in women being angry about the books I suggest.\n\n\nWouldn't this be the opposite of literally any SDs dreams? \n\nIf this book is the elixir you claim it to be for SDs and how to clean themselves up and seduce SBs or whatever, that's 0 issue. The issue is you're apparently super cagey with the titles & given the cageyness, leads to more questions regarding your intentions. \n\n>I am not selling anything.\n\nI've heard that before from affiliate marketers & MLM people. \n\n>If I was selling a book, it would make more sense to put the link in the OP, where more people would see if and click on it, don't you think?\n\nNo, it would make more sense to get SDs to dm you, get an email from them & spam email them with book promos & links on a email mass send which is a marketing technique and a shark technique.",
                    "author": "WorldwideLoving",
                    "id": "ht6kcgj",
                    "parent_id": "t1_ht6jciz",
                    "score": 2,
                    "created_utc": 1642517470.0,
                    "replies": []
                },
                {
                    "body": "Your account is extremely new and you've posted mostly comments over less then a month between various subreddits. It doesn't add to your credit here within sugar & recommending books which you potentially have a part in, you're cagey with details and closed up like a clam. \n\nHowever, how do you find zkrollup? I've been looking at that for awhile. What's your preferred exchange & why",
                    "author": "WorldwideLoving",
                    "id": "ht6ky3s",
                    "parent_id": "t1_ht6jciz",
                    "score": 0,
                    "created_utc": 1642517723.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Wait so are you saying be macho or not?",
            "author": "Careless-Parfait-587",
            "id": "ht74935",
            "parent_id": "t1_ht6nls6",
            "score": 2,
            "created_utc": 1642525186.0,
            "replies": [
                {
                    "body": "Not who you asked, but IMO macho is very different than masculine. The latter is attractive.",
                    "author": null,
                    "id": "ht76dgy",
                    "parent_id": "t1_ht74935",
                    "score": 1,
                    "created_utc": 1642525972.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "To Reddit, kind of. I avoided this site for years bc of the toxicity and full scale left/ progressive bias (my perception).\n\nThis, and a few fitness subs, are the only ones I participate on.",
            "author": null,
            "id": "ht6tf7h",
            "parent_id": "t1_ht6rbbe",
            "score": 1,
            "created_utc": 1642521094.0,
            "replies": []
        },
        {
            "body": "Would recommend taking The Body Keeps the Score a little slowly if you’ve had any type of trauma. It’s been quite triggering for a lot of people, but it is a very great resource for healing.",
            "author": "Azucarbabby",
            "id": "ht7b8ka",
            "parent_id": "t1_ht6rny4",
            "score": 5,
            "created_utc": 1642527760.0,
            "replies": [
                {
                    "body": "Very good advice & thank you.  I overlooked that disclaimer which I normally add.",
                    "author": "post_typical",
                    "id": "ht7ipve",
                    "parent_id": "t1_ht7b8ka",
                    "score": 1,
                    "created_utc": 1642530485.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "This is incredibly insightful and based on my experience very true. We're getting a little woo woo lol.\n\nI've made a shit shit shit ton of progress in therapy in about 3 months, BUT this is coming from the last 5 years of doing yoga, meditation, and learning mind body connection both in meditation and in exercise (both yoga and resistance training). That said I would recommend therapy, even if you only plan on it for like 2-3 months at a time. The one thing I've learned is stops and starts with this kind of shit is that those are also beneficial.\n\nLastly u/ChanceBerryman I would say you specifically would benefit because your comment about worrying about what she might think sounds like you have identity issues that are cause from your primary caregivers as a child. but i'm not actually a therapist. the one thing sugaring has allowed me to do is be able to get over that shit in a safe space created by my wealth.",
            "author": "Rrrraiiiiden",
            "id": "ht7bcne",
            "parent_id": "t1_ht6rny4",
            "score": 3,
            "created_utc": 1642527800.0,
            "replies": [
                {
                    "body": "Ever fix up your appearance, check your outfit or breath before meeting up with someone? Then you've \"worried\" about what she might think. This is perfectly normal - everyone wants to make a good impression.\n\nThat being said, everyone can benefit from working on the mind (like one would work on their body at a gym).  Therapy is like getting a personal trainer for the mind.",
                    "author": "tumbleweedrunner2",
                    "id": "ht9931y",
                    "parent_id": "t1_ht7bcne",
                    "score": 2,
                    "created_utc": 1642554559.0,
                    "replies": []
                },
                {
                    "body": "u/Rrrraiiiiden I appreciate your recommendatiion. I'm willing to try it out.",
                    "author": null,
                    "id": "ht7e97t",
                    "parent_id": "t1_ht7bcne",
                    "score": 1,
                    "created_utc": 1642528850.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "For you. Loyalty isn’t defined by sex for everyone. \n\nFor me loyalty is about taking care of each other emotionally, contributing to each other, and sticking with each other through hard times. Sex and monogamy are frankly not attributes I’d gauge loyalty by at all.\n\nFurther, you’re responding to this as if I said being desirable is the only thing people find attractive in men. It’s not. But there’s no point denying that having a partner who is found attractive by others can itself be part of the attraction. Not for everyone, of course.",
            "author": "django_uncoined",
            "id": "ht7vvqt",
            "parent_id": "t1_ht7mod4",
            "score": 2,
            "created_utc": 1642535351.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "ht80zn0",
                    "parent_id": "t1_ht7vvqt",
                    "score": 2,
                    "created_utc": 1642537245.0,
                    "replies": [
                        {
                            "body": "What you mean is you projected a whole bunch of things that I didn’t say. \n\nJust because some women are jealous doesn’t mean they all are. And just because some people like people who are wanted by others, doesn’t mean they all do. \n\nI didn’t say or imply either of those things.\n\nSomeone saying “Roses tend to be red” does not mean white roses don’t exist.",
                            "author": "django_uncoined",
                            "id": "ht8g76w",
                            "parent_id": "t1_ht80zn0",
                            "score": -1,
                            "created_utc": 1642542788.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I think wealth brings with it nothing more than options. Thats all. When they have wealth they can create options, be it homes, cars, women, toys etc.",
            "author": null,
            "id": "ht75o19",
            "parent_id": "t1_ht6nxf2",
            "score": 2,
            "created_utc": 1642525714.0,
            "replies": []
        },
        {
            "body": "Frankly, I'm happy to hear about men who don't understand personal hygiene, gentlemanly conduct, mature behavior.  It makes it so easy for me to stand out from the crowd!",
            "author": "DaddyBeenThere",
            "id": "ht6crtj",
            "parent_id": "t1_ht66h05",
            "score": 6,
            "created_utc": 1642514103.0,
            "replies": [
                {
                    "body": "The stories are funny but I think bad experiences will drive good SBs out of the bowl, limiting availability and quality.",
                    "author": null,
                    "id": "ht6j3te",
                    "parent_id": "t1_ht6crtj",
                    "score": 5,
                    "created_utc": 1642516948.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "....what are you so angry about?\n\nthere was a thread of an SB saying a guy \"tasted like pee\". Two other guys posted, confused why they were ghosted, when they had done things that are obvious (to me, and men with more experience with women) turn offs.\n\nI didn't want to list the books here and have women piling on discrediting the books I recommend.",
            "author": null,
            "id": "ht67ccm",
            "parent_id": "t1_ht66h05",
            "score": 10,
            "created_utc": 1642511319.0,
            "replies": []
        },
        {
            "body": "This genuinely made me laugh!",
            "author": "packyourtoothbrush_",
            "id": "htaapyk",
            "parent_id": "t1_ht66h05",
            "score": 2,
            "created_utc": 1642572661.0,
            "replies": []
        },
        {
            "body": "I don't think so, but seeing your post history I think you could benefit. My DMs aren't closed, some other guys messaged me.",
            "author": null,
            "id": "ht7hllz",
            "parent_id": "t1_ht7gp3x",
            "score": 0,
            "created_utc": 1642530073.0,
            "replies": []
        },
        {
            "body": ">A frenzy as in women being angry about the books I suggest.\n\n\nWouldn't this be the opposite of literally any SDs dreams? \n\nIf this book is the elixir you claim it to be for SDs and how to clean themselves up and seduce SBs or whatever, that's 0 issue. The issue is you're apparently super cagey with the titles & given the cageyness, leads to more questions regarding your intentions. \n\n>I am not selling anything.\n\nI've heard that before from affiliate marketers & MLM people. \n\n>If I was selling a book, it would make more sense to put the link in the OP, where more people would see if and click on it, don't you think?\n\nNo, it would make more sense to get SDs to dm you, get an email from them & spam email them with book promos & links on a email mass send which is a marketing technique and a shark technique.",
            "author": "WorldwideLoving",
            "id": "ht6kcgj",
            "parent_id": "t1_ht6jciz",
            "score": 2,
            "created_utc": 1642517470.0,
            "replies": []
        },
        {
            "body": "Your account is extremely new and you've posted mostly comments over less then a month between various subreddits. It doesn't add to your credit here within sugar & recommending books which you potentially have a part in, you're cagey with details and closed up like a clam. \n\nHowever, how do you find zkrollup? I've been looking at that for awhile. What's your preferred exchange & why",
            "author": "WorldwideLoving",
            "id": "ht6ky3s",
            "parent_id": "t1_ht6jciz",
            "score": 0,
            "created_utc": 1642517723.0,
            "replies": []
        },
        {
            "body": "Not who you asked, but IMO macho is very different than masculine. The latter is attractive.",
            "author": null,
            "id": "ht76dgy",
            "parent_id": "t1_ht74935",
            "score": 1,
            "created_utc": 1642525972.0,
            "replies": []
        },
        {
            "body": "Very good advice & thank you.  I overlooked that disclaimer which I normally add.",
            "author": "post_typical",
            "id": "ht7ipve",
            "parent_id": "t1_ht7b8ka",
            "score": 1,
            "created_utc": 1642530485.0,
            "replies": []
        },
        {
            "body": "Ever fix up your appearance, check your outfit or breath before meeting up with someone? Then you've \"worried\" about what she might think. This is perfectly normal - everyone wants to make a good impression.\n\nThat being said, everyone can benefit from working on the mind (like one would work on their body at a gym).  Therapy is like getting a personal trainer for the mind.",
            "author": "tumbleweedrunner2",
            "id": "ht9931y",
            "parent_id": "t1_ht7bcne",
            "score": 2,
            "created_utc": 1642554559.0,
            "replies": []
        },
        {
            "body": "u/Rrrraiiiiden I appreciate your recommendatiion. I'm willing to try it out.",
            "author": null,
            "id": "ht7e97t",
            "parent_id": "t1_ht7bcne",
            "score": 1,
            "created_utc": 1642528850.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "ht80zn0",
            "parent_id": "t1_ht7vvqt",
            "score": 2,
            "created_utc": 1642537245.0,
            "replies": [
                {
                    "body": "What you mean is you projected a whole bunch of things that I didn’t say. \n\nJust because some women are jealous doesn’t mean they all are. And just because some people like people who are wanted by others, doesn’t mean they all do. \n\nI didn’t say or imply either of those things.\n\nSomeone saying “Roses tend to be red” does not mean white roses don’t exist.",
                    "author": "django_uncoined",
                    "id": "ht8g76w",
                    "parent_id": "t1_ht80zn0",
                    "score": -1,
                    "created_utc": 1642542788.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "The stories are funny but I think bad experiences will drive good SBs out of the bowl, limiting availability and quality.",
            "author": null,
            "id": "ht6j3te",
            "parent_id": "t1_ht6crtj",
            "score": 5,
            "created_utc": 1642516948.0,
            "replies": []
        },
        {
            "body": "What you mean is you projected a whole bunch of things that I didn’t say. \n\nJust because some women are jealous doesn’t mean they all are. And just because some people like people who are wanted by others, doesn’t mean they all do. \n\nI didn’t say or imply either of those things.\n\nSomeone saying “Roses tend to be red” does not mean white roses don’t exist.",
            "author": "django_uncoined",
            "id": "ht8g76w",
            "parent_id": "t1_ht80zn0",
            "score": -1,
            "created_utc": 1642542788.0,
            "replies": []
        }
    ]
}