{
    "title": "What is going on with seeking ?",
    "post_id": "o5szt7",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/o5szt7/what_is_going_on_with_seeking/",
    "author": "New_Awareness_1859",
    "body": "Hi everyone ! \nI'm getting more and more disappointed at the website seeking. I used to actually like it and I found most of my sugar daddies there but lately 2 sugar daddies contacted me and this is how it went: \n\" SD- Oh hi, I just found your profile and you are gorgeous. I would love to meet you. I think you are very interesting, and we have lots in common.  \" \nI was thinking that he seemed like a nice guy, by reading his profile. \nBut then, when we started the allowence talk he said this: \n\" Oh I don't think we are looking for the same thing. I want someone Who is with me because she likes me, I don't want to give you money in return or anything.\" \n\"Me: -Then if you don't want to give money or anything how would you claim to be a sugar daddy ? Why would I give anything to you or even meet you if I don't get anything ? You are on seeking, we seek sugar relationships here. Not normal ones. \"\nTo what he responded: \n\" I know that most women want money and stuff but I don't think they are all like that. \" \nJust wtf.  He's the second one sending a message like this. Is this happening to any of you ? What are they thinking ?",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/o5szt7/what_is_going_on_with_seeking/",
    "score": 103,
    "upvote_ratio": 0.94,
    "created_utc": 1624384419.0,
    "num_comments": 79,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "Just another guy who’s just trying to fuck a girl out of his league for the price of dinner :/",
            "author": null,
            "id": "h2p3x3u",
            "parent_id": "t3_o5szt7",
            "score": 60,
            "created_utc": 1624396848.0,
            "replies": [
                {
                    "body": "not even a dinner..",
                    "author": "your_right11",
                    "id": "h2qzkbm",
                    "parent_id": "t1_h2p3x3u",
                    "score": 3,
                    "created_utc": 1624439113.0,
                    "replies": []
                },
                {
                    "body": "Exactly. Also SB's try to meet guys who are clearly not in their league.",
                    "author": "smooth_criminal_syd",
                    "id": "h2pdr0f",
                    "parent_id": "t1_h2p3x3u",
                    "score": 5,
                    "created_utc": 1624401771.0,
                    "replies": [
                        {
                            "body": "Aren’t both sides, generally, trying to meet people out of their league though?",
                            "author": "goingfivehole",
                            "id": "h2qent5",
                            "parent_id": "t1_h2pdr0f",
                            "score": 6,
                            "created_utc": 1624421639.0,
                            "replies": [
                                {
                                    "body": "Really easy to tell who is a sugar baby and who is a sugar daddy in this thread",
                                    "author": "ThoughtfullyPriced",
                                    "id": "h2qkhs5",
                                    "parent_id": "t1_h2qent5",
                                    "score": 10,
                                    "created_utc": 1624425654.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "I mean, when you phrase it like that...is that really so wrong? I respect the hustle. And the keeping alive of hope that maybe there aren't really leagues. It's just inconvenient for the SB looking to get paid for what they do. Of course I also respect the SB saying \"that's not how it works here, I'm here bc I need financial help.\"\n\nHopefully both types of ppl can find what they need.",
                    "author": "Thriller83",
                    "id": "h2pzm3a",
                    "parent_id": "t1_h2p3x3u",
                    "score": 4,
                    "created_utc": 1624413410.0,
                    "replies": [
                        {
                            "body": "I think he should be on tinder then",
                            "author": "ColdHeaux",
                            "id": "h2tgcc7",
                            "parent_id": "t1_h2pzm3a",
                            "score": 7,
                            "created_utc": 1624485540.0,
                            "replies": [
                                {
                                    "body": "When guys in those \"lower leagues\" go on tinder, nobody responds to their likes or messages though. That's what brings them to the sugar dating sites. At least there they will get a few bites.",
                                    "author": "Thriller83",
                                    "id": "h3c7idg",
                                    "parent_id": "t1_h2tgcc7",
                                    "score": 1,
                                    "created_utc": 1624899311.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Yeah that’s fair! You’re right, we are all looking for different things",
                            "author": null,
                            "id": "h2q2ewb",
                            "parent_id": "t1_h2pzm3a",
                            "score": 3,
                            "created_utc": 1624414910.0,
                            "replies": []
                        },
                        {
                            "body": "Some are not there because they “need” financial help… some of us simply enjoy it.  I look at it as a show of his appreciation… that feels good.",
                            "author": "RealEarthAngel",
                            "id": "h2ty199",
                            "parent_id": "t1_h2pzm3a",
                            "score": 1,
                            "created_utc": 1624494741.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "They are playing the odds is my guess.",
            "author": "AShatteredKing",
            "id": "h2oct4n",
            "parent_id": "t3_o5szt7",
            "score": 52,
            "created_utc": 1624384628.0,
            "replies": [
                {
                    "body": "They sure are",
                    "author": "New_Awareness_1859",
                    "id": "h2oe1gb",
                    "parent_id": "t1_h2oct4n",
                    "score": 13,
                    "created_utc": 1624385179.0,
                    "replies": [
                        {
                            "body": "Be thankful that he revealed himself early",
                            "author": "pinotandsugar",
                            "id": "h2podvg",
                            "parent_id": "t1_h2oe1gb",
                            "score": 13,
                            "created_utc": 1624407525.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "They are the male version of platonic.",
                    "author": null,
                    "id": "h2rgm9y",
                    "parent_id": "t1_h2oct4n",
                    "score": 5,
                    "created_utc": 1624452686.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "It largely has to do with the Sugar Relationship topic becoming more mainstream in general.   When I started in the Bowl 7 or so years ago, there were scammers/fakes but far less of the variety we see now.  Today, there are many more younger men using this as a quasi-dating site where they are fine paying for nice dates and maybe some spoiling but not willing to provide allowances.  Then there women using this to sells pics, establish platonic relationships, escort, etc.  \n\nUnfortunately,  it takes a ton of effort to filter out the fakes/flakes and scammers but there are a subset of people on both sides still in it for the right reasons.   Your appetite to deal with the BS is your decision.",
            "author": "Mister_BossMan",
            "id": "h2oxrgi",
            "parent_id": "t3_o5szt7",
            "score": 14,
            "created_utc": 1624393990.0,
            "replies": [
                {
                    "body": "Unfortunately there are apparently a lot of folks claiming to have been able to have sugar free intimate relationships off the site.  Most likely more like fishing stories after the second bottle of wine. And also attracting those who see it as a  game where you win through deception.",
                    "author": "pinotandsugar",
                    "id": "h2powtm",
                    "parent_id": "t1_h2oxrgi",
                    "score": 4,
                    "created_utc": 1624407811.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Curious if you're clear in your profile? Or how many others make this clear in their profile. \n\nUnder my Seeking it says \"traditional sugar daddy/sugar baby relationship\", which I think is plenty clear, and then I address it early on in messaging too.\n\nCan't really say I get all that upset about guys that are upfront about their intentions. If you do, maybe you need to be more realistic about how meaningful something is after 2-3 texts. \n\nPlenty of guys are still dishonest about their intentions, of course, then at the M&G they're all \"no I'd never pay, you misunderstood\" lol. All you can do with them is politely finish the M&G, ask them to arrange for a hotel with room service for the next meeting, then block and ghost. Because, you know, f them",
            "author": "NoLimitLexa",
            "id": "h2og3oo",
            "parent_id": "t3_o5szt7",
            "score": 21,
            "created_utc": 1624386112.0,
            "replies": [
                {
                    "body": "I am super clear in my profile, actually. \nAhahahah love that !",
                    "author": "New_Awareness_1859",
                    "id": "h2oq10n",
                    "parent_id": "t1_h2og3oo",
                    "score": 14,
                    "created_utc": 1624390554.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "h2oxdcp",
                            "parent_id": "t1_h2oq10n",
                            "score": 7,
                            "created_utc": 1624393811.0,
                            "replies": [
                                {
                                    "body": "Split the bill?!! 🤣",
                                    "author": "SDchat",
                                    "id": "h2pa25n",
                                    "parent_id": "t1_h2oxdcp",
                                    "score": 10,
                                    "created_utc": 1624399865.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "I do not have a problem with anyone seeking anything as long as they are up front about it. I do not have a problem with people acting in good faith being unable to reach an agreement. But outright deceptive people? May I suggest, “make sure a nice expensive bottle of champagne is waiting in the room when I arrive, I’ll want to get right to it. You can Venmo me afterwards.”",
                    "author": "Some_Random_SD",
                    "id": "h2okw1v",
                    "parent_id": "t1_h2og3oo",
                    "score": 11,
                    "created_utc": 1624388253.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "h2pruqg",
            "parent_id": "t3_o5szt7",
            "score": 11,
            "created_utc": 1624409416.0,
            "replies": [
                {
                    "body": "Same. They put it right on their profiles \"virtual only\" or \"seeking online arrangement\". Why are they even on the site? SA rules plainly state that the site is not for online arrangements.",
                    "author": "SugarPieHunnieBunch",
                    "id": "h2q3tg5",
                    "parent_id": "t1_h2pruqg",
                    "score": 6,
                    "created_utc": 1624415666.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Unfortunately with the liability that SA fears that they have (ala Craig’s list) there has been a move to plausible deniability. This includes banning anyone who hints of arrangements involving sex and money. With that, and a few other things, it just becomes another site for some guys to find hookups. It has been losing it’s sugar’ exclusivity for some time now. There is still wheat in the mix, you just have to spend longer separating the chaff.",
            "author": "SDforreal",
            "id": "h2oggk6",
            "parent_id": "t3_o5szt7",
            "score": 20,
            "created_utc": 1624386272.0,
            "replies": [
                {
                    "body": "True, It's sad tbh",
                    "author": "New_Awareness_1859",
                    "id": "h2opujz",
                    "parent_id": "t1_h2oggk6",
                    "score": 5,
                    "created_utc": 1624390473.0,
                    "replies": []
                },
                {
                    "body": "No that's false. You can talk about allowance all you want, you just can't do anything that would be considered against the law, i.e. prostitution. If you prostitution specific terms like PPM, or speak directly of exchanging money for sex, you stand a decent chance of getting banned.",
                    "author": "tyranthraxxus",
                    "id": "h2pb98u",
                    "parent_id": "t1_h2oggk6",
                    "score": 1,
                    "created_utc": 1624400478.0,
                    "replies": [
                        {
                            "body": "I think we are saying the same thing, ‘sex and money’ and ‘exchanging money for sex’.",
                            "author": "SDforreal",
                            "id": "h2puq0c",
                            "parent_id": "t1_h2pb98u",
                            "score": 4,
                            "created_utc": 1624410867.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Guys paying 100 a month membership to not offer allowances lol   losers",
            "author": "wb19081908",
            "id": "h2pdoyw",
            "parent_id": "t3_o5szt7",
            "score": 14,
            "created_utc": 1624401741.0,
            "replies": []
        },
        {
            "body": "Maybe they think they are attractive enough to get a girl just looking for a dude to pay for dinners and the odd vacation  but no actual allowance?",
            "author": "fatsocalsd",
            "id": "h2od95m",
            "parent_id": "t3_o5szt7",
            "score": 9,
            "created_utc": 1624384825.0,
            "replies": [
                {
                    "body": "I was thinking about that but they were both older than 55, which normally is no problem, but in this case they were not attractive at all, and one even tried to invite me to have dinner with him, and said we could split the bill 😂 the audacity!!",
                    "author": "New_Awareness_1859",
                    "id": "h2odzgn",
                    "parent_id": "t1_h2od95m",
                    "score": 24,
                    "created_utc": 1624385155.0,
                    "replies": [
                        {
                            "body": "SPLIT THE BILL? They must be trolling. Smh",
                            "author": "prettylilprostitute",
                            "id": "h2ooo1r",
                            "parent_id": "t1_h2odzgn",
                            "score": 17,
                            "created_utc": 1624389942.0,
                            "replies": [
                                {
                                    "body": "I know right! But he got all upset that I called him crazy, and that makes me believe that he was not trolling at all 😂",
                                    "author": "New_Awareness_1859",
                                    "id": "h2oqn9z",
                                    "parent_id": "t1_h2ooo1r",
                                    "score": 15,
                                    "created_utc": 1624390832.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "\\- and one even tried to invite me to have dinner with him, and said we could split the bill\n\nNo fricking way!?!?",
                            "author": "Intrepid_Seeker",
                            "id": "h2ojrd9",
                            "parent_id": "t1_h2odzgn",
                            "score": 14,
                            "created_utc": 1624387747.0,
                            "replies": [
                                {
                                    "body": "I swear to god 😂",
                                    "author": "New_Awareness_1859",
                                    "id": "h2oq9ib",
                                    "parent_id": "t1_h2ojrd9",
                                    "score": 9,
                                    "created_utc": 1624390661.0,
                                    "replies": [
                                        {
                                            "body": "Tell you what...You pick up the tab and I'll gladly leave the tip. 15%.",
                                            "author": "Intrepid_Seeker",
                                            "id": "h2oqgsy",
                                            "parent_id": "t1_h2oq9ib",
                                            "score": 9,
                                            "created_utc": 1624390751.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": ">> one even tried to invite me to have dinner with him, and said we could split the bill\n\nNoooooo!! That’s a no for me even in vanilla dating!!\n\nDefinitely an odds thing like previously said. I feel like some guys try SA b/c much younger women will actually speak to them, while their chances are very low of matching & meeting 20-somethings on vanilla dating apps. On SA, if they’re lucky, they might get a girl who doesn’t bring up ppm/allowance/sugar at all before an m&g, & then they can try to steer it in their favor.",
                            "author": "riiirii",
                            "id": "h2olby8",
                            "parent_id": "t1_h2odzgn",
                            "score": 11,
                            "created_utc": 1624388448.0,
                            "replies": [
                                {
                                    "body": "True, I hate to think about it because they are wasting those girls time and that gets on my nerves, that's why I always bring it up in first conversation.",
                                    "author": "New_Awareness_1859",
                                    "id": "h2oqhdq",
                                    "parent_id": "t1_h2olby8",
                                    "score": 4,
                                    "created_utc": 1624390758.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Wtf.  I was trying to see things from the other guys perspective like maybe he is just a spoiling boyfriend who takes you on nice dinners and buys you stuff but no set allowance.  He wants you to pay part of the bills?!?  Wtf .  For what it’s worth the last time I checked seeking it was over run with cam girls/only fans/escorts / straight up scammers, so the men’s perspective isn’t so great currently, you can definitely still use the site to give a sugar relationship but have to screen a lot harder /waste more time than I care to waste",
                            "author": "pussy_impaler337",
                            "id": "h2pr0aq",
                            "parent_id": "t1_h2odzgn",
                            "score": 3,
                            "created_utc": 1624408962.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I reiterate for the 12th time. Non SDs are here in increasing numbers. We are talking scammers, johns ,and vanilla daters. They are trying their luck and some girls are dumb enough to fall for it.  Men on Seeking are not viable vanilla guys looking to find their true love. They are guys who are out of their depth trying to get young girls who think they are \"wealthy\" and will support them with classy treats ,trips, and gifts. The joke is ultimately on the girls unfortunately.   \n\nAgain, Before meeting a \"SD\" ask, \"Are you a traditional SD who believes in the allowance sugar model\"  Only go if he says \"Yes\". Even then he could be lying or pays street walker rates but you won't get \" I want someone Who is with me because she likes me, I don't want to give you money in return or anything\".   \n\nI like the \"you get a hotel lined up and text me the room number. I'll bring the champagne\" Block. If a fake daddy books a few hotels for a no-show he will think twice before continuing to do it.",
            "author": "GSSD",
            "id": "h2p31xu",
            "parent_id": "t3_o5szt7",
            "score": 5,
            "created_utc": 1624396427.0,
            "replies": [
                {
                    "body": ">Again, Before meeting a \"SD\" ask, \"Are you a traditional SD who believes in the allowance sugar model\"  Only go if he says \"Yes\".\n\nThis is great advice! Heck, go one further and put it right in your profile!",
                    "author": "tyranthraxxus",
                    "id": "h2pbrw8",
                    "parent_id": "t1_h2p31xu",
                    "score": 3,
                    "created_utc": 1624400741.0,
                    "replies": [
                        {
                            "body": "It’s in countless profiles. Worded differently but reminding SDs that an allowance is expected.",
                            "author": "chairman212121",
                            "id": "h2qpt34",
                            "parent_id": "t1_h2pbrw8",
                            "score": 1,
                            "created_utc": 1624429948.0,
                            "replies": [
                                {
                                    "body": "I see the word \"allowance\" in less than 1% of profiles. 🤷‍♂️\n\nIf it's worded differently to exclude the word allowance, then it's not the same.",
                                    "author": "tyranthraxxus",
                                    "id": "h2snguk",
                                    "parent_id": "t1_h2qpt34",
                                    "score": 1,
                                    "created_utc": 1624472445.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "SA has changed ALOT. A ton don’t expect to give any form of allowance at all and will call you nasty names if you mention it. Seriously the reality of finding an SD whose generous beyond paying for dinner and some petty cash seems rarer by the day",
            "author": "Obvious-Run3596",
            "id": "h2qawne",
            "parent_id": "t3_o5szt7",
            "score": 3,
            "created_utc": 1624419598.0,
            "replies": []
        },
        {
            "body": "I can argue that many of them are reaching out to me to buy their photos without ever wanna meet in person",
            "author": "DaHydroMan",
            "id": "h2qcfbt",
            "parent_id": "t3_o5szt7",
            "score": 3,
            "created_utc": 1624420389.0,
            "replies": []
        },
        {
            "body": "it's not just seeking I've had similar experiences on sugar book the sugar dating world is becoming a bit more popular recently and that's causing alot of vanilla people to join and make these mistakes",
            "author": "CindyyApple",
            "id": "h2oew58",
            "parent_id": "t3_o5szt7",
            "score": 5,
            "created_utc": 1624385566.0,
            "replies": [
                {
                    "body": "It's sad tbh, I hate when they waste my time like that",
                    "author": "New_Awareness_1859",
                    "id": "h2oq63a",
                    "parent_id": "t1_h2oew58",
                    "score": 1,
                    "created_utc": 1624390617.0,
                    "replies": [
                        {
                            "body": "amen!",
                            "author": "CindyyApple",
                            "id": "h32rnx5",
                            "parent_id": "t1_h2oq63a",
                            "score": 1,
                            "created_utc": 1624683155.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I just posted about this! I’ve had the exact same experience!",
            "author": "LittleFireFly29",
            "id": "h2p7408",
            "parent_id": "t3_o5szt7",
            "score": 2,
            "created_utc": 1624398398.0,
            "replies": []
        },
        {
            "body": "Do they not have search filters anymore?  Why aren't these people just listing as searching for SGF/SBF",
            "author": "brock0791",
            "id": "h2p7hn4",
            "parent_id": "t3_o5szt7",
            "score": 2,
            "created_utc": 1624398583.0,
            "replies": []
        },
        {
            "body": "Edit: ok, I read your other comments and changed my mind. These guys were definitely douchebags.",
            "author": "tyranthraxxus",
            "id": "h2payy7",
            "parent_id": "t3_o5szt7",
            "score": 2,
            "created_utc": 1624400333.0,
            "replies": []
        },
        {
            "body": "I actually heard from one of my *potential* SD’s that Seeking is being recommended by some YT creators as a “dating site”. So that’s happening in the world. 🤨",
            "author": "idontevenlikeplants",
            "id": "h2plzin",
            "parent_id": "t3_o5szt7",
            "score": 2,
            "created_utc": 1624406204.0,
            "replies": []
        },
        {
            "body": "I suppose 1% of those disappointing fellows can honestly claim that they use ‘Seeking’ as a dating site—on account of it is presenting itself thusly nowadays.  But even that small percentage might be generous seeing as they're paying infinitely more than the cost of a vanilla site for the joy of antagonizing every single respondent.",
            "author": null,
            "id": "h2pmkvx",
            "parent_id": "t3_o5szt7",
            "score": 2,
            "created_utc": 1624406531.0,
            "replies": []
        },
        {
            "body": "Is there actual sugar daddies here?",
            "author": "Sweetbaby83",
            "id": "h2po5e3",
            "parent_id": "t3_o5szt7",
            "score": 2,
            "created_utc": 1624407397.0,
            "replies": []
        },
        {
            "body": "Or worse you get stood up by the last 3 potential SD or cancelled on during meet and greet the day of.",
            "author": "xoxrubyrose",
            "id": "h2pqhii",
            "parent_id": "t3_o5szt7",
            "score": 2,
            "created_utc": 1624408676.0,
            "replies": []
        },
        {
            "body": "It's especially disheartening when I get insulted about talking sugar😵",
            "author": "SxyStnr",
            "id": "h2prcrj",
            "parent_id": "t3_o5szt7",
            "score": 2,
            "created_utc": 1624409151.0,
            "replies": [
                {
                    "body": "Sameeeeeee",
                    "author": "New_Awareness_1859",
                    "id": "h2qoiqz",
                    "parent_id": "t1_h2prcrj",
                    "score": 1,
                    "created_utc": 1624428867.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I think it’s time to recognize that SA is a less viable path than it used to be. It was quite good c. 2007, although there were still scammers. I urge SBs in particular to be careful if they are in the bowl - it really could be a huge waste of time. The evolution of online dating in all its forms has really handicapped the real SDs and SBs who seek these relationships through SA.",
            "author": "JSBelle",
            "id": "h2q4f2f",
            "parent_id": "t3_o5szt7",
            "score": 2,
            "created_utc": 1624415990.0,
            "replies": []
        },
        {
            "body": "Lmfaoo wtf split the billl ?? 🤦🏽‍♀️",
            "author": "drangonfly24",
            "id": "h2q6mo3",
            "parent_id": "t3_o5szt7",
            "score": 2,
            "created_utc": 1624417182.0,
            "replies": []
        },
        {
            "body": "The number of guys who can afford to pay *anything* is small if you look at income and wealth distribution in most companies. \n\nThe number who can afford to pay even the amount in the allowance master thread is even smaller. Like 5% of the male population of working age.\n\nThat means a lot of women hunting that 5% of guys on seeking.\n\nThat means every second you spend once you've been told they don’t/can't pay is wasted.\n\nEvery second you waste gives other women hunting the 5% an advantage over you.\n\nNext, because that 5% is so hard to find, those with good profiles and actually reach out have a huge advantage. (That applies to both sexes).\n\nAlso, because a lot of women (and scammers) are hunting the 5%, often they are busy enough that they don’t reach out...they don’t need to. (That also applies to the top 5% of women imho). Hence the advantage to those of both sexes that actively reach out.\n\nWhat is happening on SA is that it now has a representative profile of men in society (of whom only 5% can pay what on the allowance master thread). Previously,  it had a much higher proportion of individuals who actually could pay the amounts discussed in the allowance thread.",
            "author": "Mangotingthroneway",
            "id": "h2qd4ma",
            "parent_id": "t3_o5szt7",
            "score": 2,
            "created_utc": 1624420758.0,
            "replies": []
        },
        {
            "body": "I’ve seen quite a number of SB profiles that say ‘I don’t need money/I only want to travel/date/etc’ And then there’s the marriage minded and romance tag which is very frequent. (1 in 10 profiles? I think). And that sends a message that SBs can be had for no payment. Just the way it is. \nAnd as for low-balling, it’s sometimes used as a way of saying ‘no thanks’ without the confrontation or making the SB feel rejected.",
            "author": "chairman212121",
            "id": "h2qmope",
            "parent_id": "t3_o5szt7",
            "score": 2,
            "created_utc": 1624427362.0,
            "replies": []
        },
        {
            "body": "With the no allowance SD and their close relative the platonic Sb, I wonder how many times they get told\nNo before they just give up. Or start putting it on their profile, or bring it up immediately as to not waste anyone’s time. Everyone on here hates platonic SB’s, but I don’t mind it if they explicitly say on their profile platonic only, or they want a non sexual relationship. I mean yea it sucks but at least they put it in their profile which saves me time from messaging them. No allowance SD’s should do the same. \n\nI would imagine the guy in the OP’s story has been told no hundreds of times, yet he still persists. I would have given up after about a day lol.",
            "author": "Texasguy115",
            "id": "h2r4ays",
            "parent_id": "t3_o5szt7",
            "score": 2,
            "created_utc": 1624443659.0,
            "replies": []
        },
        {
            "body": "just ignore",
            "author": "sleepy-and-sarcastic",
            "id": "h2sykvy",
            "parent_id": "t3_o5szt7",
            "score": 2,
            "created_utc": 1624477570.0,
            "replies": []
        },
        {
            "body": "The whole point of the name “Seeking Arrangement” was so that people would understand what it was for.",
            "author": "RealEarthAngel",
            "id": "h2txh9k",
            "parent_id": "t3_o5szt7",
            "score": 2,
            "created_utc": 1624494434.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "h2qilmw",
            "parent_id": "t3_o5szt7",
            "score": 1,
            "created_utc": 1624424258.0,
            "replies": [
                {
                    "body": "SBs who have become proactive in approaching SDs report greater success in finding a real One.",
                    "author": "chairman212121",
                    "id": "h2qqw5z",
                    "parent_id": "t1_h2qilmw",
                    "score": 1,
                    "created_utc": 1624430879.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Sugar is what two people agree.  Believe it or not, there are women on SA who are more interested in dinners, vacations and gifts than in money.  Doesn't mean they are right or that you are wrong, just different goals.",
            "author": "hal99514",
            "id": "h2oudv6",
            "parent_id": "t3_o5szt7",
            "score": -2,
            "created_utc": 1624392462.0,
            "replies": [
                {
                    "body": "People keep saying that but I've never met one",
                    "author": "SLFSLF2021",
                    "id": "h2owmv8",
                    "parent_id": "t1_h2oudv6",
                    "score": 8,
                    "created_utc": 1624393478.0,
                    "replies": [
                        {
                            "body": "It seems to be more common in single mothers over 25.",
                            "author": "hal99514",
                            "id": "h2oyfb8",
                            "parent_id": "t1_h2owmv8",
                            "score": 4,
                            "created_utc": 1624394284.0,
                            "replies": [
                                {
                                    "body": "Yeah I've seen a few profiles looking for that, can't blame them though when places like tinder are basically rhe straight version of grinder.",
                                    "author": "second-last-mohican",
                                    "id": "h2p1j48",
                                    "parent_id": "t1_h2oyfb8",
                                    "score": 2,
                                    "created_utc": 1624395704.0,
                                    "replies": [
                                        {
                                            "body": "Single mothers, as a group, don't get asked out as much.  If you can get past her doubts and insecurities to the first few dates, the wow factor!",
                                            "author": "hal99514",
                                            "id": "h2p2g8j",
                                            "parent_id": "t1_h2p1j48",
                                            "score": 1,
                                            "created_utc": 1624396137.0,
                                            "replies": [
                                                {
                                                    "body": "[deleted]",
                                                    "author": null,
                                                    "id": "h2p3q1h",
                                                    "parent_id": "t1_h2p2g8j",
                                                    "score": 1,
                                                    "created_utc": 1624396755.0,
                                                    "replies": [
                                                        {
                                                            "body": "SD for sure, possibly the SB as well.",
                                                            "author": "hal99514",
                                                            "id": "h2plqit",
                                                            "parent_id": "t1_h2p3q1h",
                                                            "score": 1,
                                                            "created_utc": 1624406067.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "I’ve seen many profiles that state ‘no money’. I had one SB who waited until the M&G to say ‘no money’ but yes to being spoiled",
                            "author": "chairman212121",
                            "id": "h2qq27j",
                            "parent_id": "t1_h2owmv8",
                            "score": 1,
                            "created_utc": 1624430160.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Totally agree with you. But in this case they were not offering literally anything.  Not gifts not vacations- nothing. Like I said in other reply,  one of them asked me to go with him for dinner and asked to split the Bill.",
                    "author": "New_Awareness_1859",
                    "id": "h2ouwo2",
                    "parent_id": "t1_h2oudv6",
                    "score": 3,
                    "created_utc": 1624392699.0,
                    "replies": [
                        {
                            "body": "If that's happening often, you really need to take a close look at how you vette your POTs.  Where is this happening?",
                            "author": "hal99514",
                            "id": "h2oyrql",
                            "parent_id": "t1_h2ouwo2",
                            "score": -1,
                            "created_utc": 1624394440.0,
                            "replies": [
                                {
                                    "body": "Seeking arrangements .",
                                    "author": "New_Awareness_1859",
                                    "id": "h2oz46c",
                                    "parent_id": "t1_h2oyrql",
                                    "score": 1,
                                    "created_utc": 1624394596.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "If the op is to be believed, the sd in her story wants to split the bill at dinner...",
                    "author": "pussy_impaler337",
                    "id": "h2prd0v",
                    "parent_id": "t1_h2oudv6",
                    "score": 1,
                    "created_utc": 1624409155.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Honestly as an SD I posted in a previous post regarding an arrangement that was actually a relationship I was in. She was young corporate executive that enjoyed being treated like a queen and enjoyed dates without having to pay for everything she told me below 40 is all entitled men who don’t know how to treat a successful woman and they are awful in bed their was no allowance many people do believe that SA is also a dating site even women believe as one of SB actually married her SD huge mistake",
            "author": "vincenzo-101",
            "id": "h2sl565",
            "parent_id": "t3_o5szt7",
            "score": 1,
            "created_utc": 1624471389.0,
            "replies": []
        },
        {
            "body": "Searching for Seeking Arrangement, I constantly get automatically redirected to Seeking.  Don't think they're the same thing at all.",
            "author": "Devastavit",
            "id": "h2t9avk",
            "parent_id": "t3_o5szt7",
            "score": 1,
            "created_utc": 1624482258.0,
            "replies": []
        },
        {
            "body": "He knows whats up - he is just trying to avoid typing something incriminating (or that will get him banned). He wants to make a strictly legal approach given that, post Matt Gaetz, the place is likely crawling with feds. So you just say \"we will talk\". You show up at the M&G with a short hot dress and no panties. Then do the Sharon Stone flash and tell him that $XXX PPM and you can be the master of all you survey.  No normal guy can resist the pink flash.",
            "author": "DATY9998",
            "id": "h2uqtgw",
            "parent_id": "t3_o5szt7",
            "score": 1,
            "created_utc": 1624511163.0,
            "replies": [
                {
                    "body": "so basically prostitution SOP?",
                    "author": "TheAsianCShooter",
                    "id": "iazijyp",
                    "parent_id": "t1_h2uqtgw",
                    "score": 1,
                    "created_utc": 1654220870.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "not even a dinner..",
            "author": "your_right11",
            "id": "h2qzkbm",
            "parent_id": "t1_h2p3x3u",
            "score": 3,
            "created_utc": 1624439113.0,
            "replies": []
        },
        {
            "body": "Exactly. Also SB's try to meet guys who are clearly not in their league.",
            "author": "smooth_criminal_syd",
            "id": "h2pdr0f",
            "parent_id": "t1_h2p3x3u",
            "score": 5,
            "created_utc": 1624401771.0,
            "replies": [
                {
                    "body": "Aren’t both sides, generally, trying to meet people out of their league though?",
                    "author": "goingfivehole",
                    "id": "h2qent5",
                    "parent_id": "t1_h2pdr0f",
                    "score": 6,
                    "created_utc": 1624421639.0,
                    "replies": [
                        {
                            "body": "Really easy to tell who is a sugar baby and who is a sugar daddy in this thread",
                            "author": "ThoughtfullyPriced",
                            "id": "h2qkhs5",
                            "parent_id": "t1_h2qent5",
                            "score": 10,
                            "created_utc": 1624425654.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I mean, when you phrase it like that...is that really so wrong? I respect the hustle. And the keeping alive of hope that maybe there aren't really leagues. It's just inconvenient for the SB looking to get paid for what they do. Of course I also respect the SB saying \"that's not how it works here, I'm here bc I need financial help.\"\n\nHopefully both types of ppl can find what they need.",
            "author": "Thriller83",
            "id": "h2pzm3a",
            "parent_id": "t1_h2p3x3u",
            "score": 4,
            "created_utc": 1624413410.0,
            "replies": [
                {
                    "body": "I think he should be on tinder then",
                    "author": "ColdHeaux",
                    "id": "h2tgcc7",
                    "parent_id": "t1_h2pzm3a",
                    "score": 7,
                    "created_utc": 1624485540.0,
                    "replies": [
                        {
                            "body": "When guys in those \"lower leagues\" go on tinder, nobody responds to their likes or messages though. That's what brings them to the sugar dating sites. At least there they will get a few bites.",
                            "author": "Thriller83",
                            "id": "h3c7idg",
                            "parent_id": "t1_h2tgcc7",
                            "score": 1,
                            "created_utc": 1624899311.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Yeah that’s fair! You’re right, we are all looking for different things",
                    "author": null,
                    "id": "h2q2ewb",
                    "parent_id": "t1_h2pzm3a",
                    "score": 3,
                    "created_utc": 1624414910.0,
                    "replies": []
                },
                {
                    "body": "Some are not there because they “need” financial help… some of us simply enjoy it.  I look at it as a show of his appreciation… that feels good.",
                    "author": "RealEarthAngel",
                    "id": "h2ty199",
                    "parent_id": "t1_h2pzm3a",
                    "score": 1,
                    "created_utc": 1624494741.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "They sure are",
            "author": "New_Awareness_1859",
            "id": "h2oe1gb",
            "parent_id": "t1_h2oct4n",
            "score": 13,
            "created_utc": 1624385179.0,
            "replies": [
                {
                    "body": "Be thankful that he revealed himself early",
                    "author": "pinotandsugar",
                    "id": "h2podvg",
                    "parent_id": "t1_h2oe1gb",
                    "score": 13,
                    "created_utc": 1624407525.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "They are the male version of platonic.",
            "author": null,
            "id": "h2rgm9y",
            "parent_id": "t1_h2oct4n",
            "score": 5,
            "created_utc": 1624452686.0,
            "replies": []
        },
        {
            "body": "Unfortunately there are apparently a lot of folks claiming to have been able to have sugar free intimate relationships off the site.  Most likely more like fishing stories after the second bottle of wine. And also attracting those who see it as a  game where you win through deception.",
            "author": "pinotandsugar",
            "id": "h2powtm",
            "parent_id": "t1_h2oxrgi",
            "score": 4,
            "created_utc": 1624407811.0,
            "replies": []
        },
        {
            "body": "I am super clear in my profile, actually. \nAhahahah love that !",
            "author": "New_Awareness_1859",
            "id": "h2oq10n",
            "parent_id": "t1_h2og3oo",
            "score": 14,
            "created_utc": 1624390554.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "h2oxdcp",
                    "parent_id": "t1_h2oq10n",
                    "score": 7,
                    "created_utc": 1624393811.0,
                    "replies": [
                        {
                            "body": "Split the bill?!! 🤣",
                            "author": "SDchat",
                            "id": "h2pa25n",
                            "parent_id": "t1_h2oxdcp",
                            "score": 10,
                            "created_utc": 1624399865.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I do not have a problem with anyone seeking anything as long as they are up front about it. I do not have a problem with people acting in good faith being unable to reach an agreement. But outright deceptive people? May I suggest, “make sure a nice expensive bottle of champagne is waiting in the room when I arrive, I’ll want to get right to it. You can Venmo me afterwards.”",
            "author": "Some_Random_SD",
            "id": "h2okw1v",
            "parent_id": "t1_h2og3oo",
            "score": 11,
            "created_utc": 1624388253.0,
            "replies": []
        },
        {
            "body": "Same. They put it right on their profiles \"virtual only\" or \"seeking online arrangement\". Why are they even on the site? SA rules plainly state that the site is not for online arrangements.",
            "author": "SugarPieHunnieBunch",
            "id": "h2q3tg5",
            "parent_id": "t1_h2pruqg",
            "score": 6,
            "created_utc": 1624415666.0,
            "replies": []
        },
        {
            "body": "True, It's sad tbh",
            "author": "New_Awareness_1859",
            "id": "h2opujz",
            "parent_id": "t1_h2oggk6",
            "score": 5,
            "created_utc": 1624390473.0,
            "replies": []
        },
        {
            "body": "No that's false. You can talk about allowance all you want, you just can't do anything that would be considered against the law, i.e. prostitution. If you prostitution specific terms like PPM, or speak directly of exchanging money for sex, you stand a decent chance of getting banned.",
            "author": "tyranthraxxus",
            "id": "h2pb98u",
            "parent_id": "t1_h2oggk6",
            "score": 1,
            "created_utc": 1624400478.0,
            "replies": [
                {
                    "body": "I think we are saying the same thing, ‘sex and money’ and ‘exchanging money for sex’.",
                    "author": "SDforreal",
                    "id": "h2puq0c",
                    "parent_id": "t1_h2pb98u",
                    "score": 4,
                    "created_utc": 1624410867.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I was thinking about that but they were both older than 55, which normally is no problem, but in this case they were not attractive at all, and one even tried to invite me to have dinner with him, and said we could split the bill 😂 the audacity!!",
            "author": "New_Awareness_1859",
            "id": "h2odzgn",
            "parent_id": "t1_h2od95m",
            "score": 24,
            "created_utc": 1624385155.0,
            "replies": [
                {
                    "body": "SPLIT THE BILL? They must be trolling. Smh",
                    "author": "prettylilprostitute",
                    "id": "h2ooo1r",
                    "parent_id": "t1_h2odzgn",
                    "score": 17,
                    "created_utc": 1624389942.0,
                    "replies": [
                        {
                            "body": "I know right! But he got all upset that I called him crazy, and that makes me believe that he was not trolling at all 😂",
                            "author": "New_Awareness_1859",
                            "id": "h2oqn9z",
                            "parent_id": "t1_h2ooo1r",
                            "score": 15,
                            "created_utc": 1624390832.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "\\- and one even tried to invite me to have dinner with him, and said we could split the bill\n\nNo fricking way!?!?",
                    "author": "Intrepid_Seeker",
                    "id": "h2ojrd9",
                    "parent_id": "t1_h2odzgn",
                    "score": 14,
                    "created_utc": 1624387747.0,
                    "replies": [
                        {
                            "body": "I swear to god 😂",
                            "author": "New_Awareness_1859",
                            "id": "h2oq9ib",
                            "parent_id": "t1_h2ojrd9",
                            "score": 9,
                            "created_utc": 1624390661.0,
                            "replies": [
                                {
                                    "body": "Tell you what...You pick up the tab and I'll gladly leave the tip. 15%.",
                                    "author": "Intrepid_Seeker",
                                    "id": "h2oqgsy",
                                    "parent_id": "t1_h2oq9ib",
                                    "score": 9,
                                    "created_utc": 1624390751.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": ">> one even tried to invite me to have dinner with him, and said we could split the bill\n\nNoooooo!! That’s a no for me even in vanilla dating!!\n\nDefinitely an odds thing like previously said. I feel like some guys try SA b/c much younger women will actually speak to them, while their chances are very low of matching & meeting 20-somethings on vanilla dating apps. On SA, if they’re lucky, they might get a girl who doesn’t bring up ppm/allowance/sugar at all before an m&g, & then they can try to steer it in their favor.",
                    "author": "riiirii",
                    "id": "h2olby8",
                    "parent_id": "t1_h2odzgn",
                    "score": 11,
                    "created_utc": 1624388448.0,
                    "replies": [
                        {
                            "body": "True, I hate to think about it because they are wasting those girls time and that gets on my nerves, that's why I always bring it up in first conversation.",
                            "author": "New_Awareness_1859",
                            "id": "h2oqhdq",
                            "parent_id": "t1_h2olby8",
                            "score": 4,
                            "created_utc": 1624390758.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Wtf.  I was trying to see things from the other guys perspective like maybe he is just a spoiling boyfriend who takes you on nice dinners and buys you stuff but no set allowance.  He wants you to pay part of the bills?!?  Wtf .  For what it’s worth the last time I checked seeking it was over run with cam girls/only fans/escorts / straight up scammers, so the men’s perspective isn’t so great currently, you can definitely still use the site to give a sugar relationship but have to screen a lot harder /waste more time than I care to waste",
                    "author": "pussy_impaler337",
                    "id": "h2pr0aq",
                    "parent_id": "t1_h2odzgn",
                    "score": 3,
                    "created_utc": 1624408962.0,
                    "replies": []
                }
            ]
        },
        {
            "body": ">Again, Before meeting a \"SD\" ask, \"Are you a traditional SD who believes in the allowance sugar model\"  Only go if he says \"Yes\".\n\nThis is great advice! Heck, go one further and put it right in your profile!",
            "author": "tyranthraxxus",
            "id": "h2pbrw8",
            "parent_id": "t1_h2p31xu",
            "score": 3,
            "created_utc": 1624400741.0,
            "replies": [
                {
                    "body": "It’s in countless profiles. Worded differently but reminding SDs that an allowance is expected.",
                    "author": "chairman212121",
                    "id": "h2qpt34",
                    "parent_id": "t1_h2pbrw8",
                    "score": 1,
                    "created_utc": 1624429948.0,
                    "replies": [
                        {
                            "body": "I see the word \"allowance\" in less than 1% of profiles. 🤷‍♂️\n\nIf it's worded differently to exclude the word allowance, then it's not the same.",
                            "author": "tyranthraxxus",
                            "id": "h2snguk",
                            "parent_id": "t1_h2qpt34",
                            "score": 1,
                            "created_utc": 1624472445.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "It's sad tbh, I hate when they waste my time like that",
            "author": "New_Awareness_1859",
            "id": "h2oq63a",
            "parent_id": "t1_h2oew58",
            "score": 1,
            "created_utc": 1624390617.0,
            "replies": [
                {
                    "body": "amen!",
                    "author": "CindyyApple",
                    "id": "h32rnx5",
                    "parent_id": "t1_h2oq63a",
                    "score": 1,
                    "created_utc": 1624683155.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Sameeeeeee",
            "author": "New_Awareness_1859",
            "id": "h2qoiqz",
            "parent_id": "t1_h2prcrj",
            "score": 1,
            "created_utc": 1624428867.0,
            "replies": []
        },
        {
            "body": "SBs who have become proactive in approaching SDs report greater success in finding a real One.",
            "author": "chairman212121",
            "id": "h2qqw5z",
            "parent_id": "t1_h2qilmw",
            "score": 1,
            "created_utc": 1624430879.0,
            "replies": []
        },
        {
            "body": "People keep saying that but I've never met one",
            "author": "SLFSLF2021",
            "id": "h2owmv8",
            "parent_id": "t1_h2oudv6",
            "score": 8,
            "created_utc": 1624393478.0,
            "replies": [
                {
                    "body": "It seems to be more common in single mothers over 25.",
                    "author": "hal99514",
                    "id": "h2oyfb8",
                    "parent_id": "t1_h2owmv8",
                    "score": 4,
                    "created_utc": 1624394284.0,
                    "replies": [
                        {
                            "body": "Yeah I've seen a few profiles looking for that, can't blame them though when places like tinder are basically rhe straight version of grinder.",
                            "author": "second-last-mohican",
                            "id": "h2p1j48",
                            "parent_id": "t1_h2oyfb8",
                            "score": 2,
                            "created_utc": 1624395704.0,
                            "replies": [
                                {
                                    "body": "Single mothers, as a group, don't get asked out as much.  If you can get past her doubts and insecurities to the first few dates, the wow factor!",
                                    "author": "hal99514",
                                    "id": "h2p2g8j",
                                    "parent_id": "t1_h2p1j48",
                                    "score": 1,
                                    "created_utc": 1624396137.0,
                                    "replies": [
                                        {
                                            "body": "[deleted]",
                                            "author": null,
                                            "id": "h2p3q1h",
                                            "parent_id": "t1_h2p2g8j",
                                            "score": 1,
                                            "created_utc": 1624396755.0,
                                            "replies": [
                                                {
                                                    "body": "SD for sure, possibly the SB as well.",
                                                    "author": "hal99514",
                                                    "id": "h2plqit",
                                                    "parent_id": "t1_h2p3q1h",
                                                    "score": 1,
                                                    "created_utc": 1624406067.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "I’ve seen many profiles that state ‘no money’. I had one SB who waited until the M&G to say ‘no money’ but yes to being spoiled",
                    "author": "chairman212121",
                    "id": "h2qq27j",
                    "parent_id": "t1_h2owmv8",
                    "score": 1,
                    "created_utc": 1624430160.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Totally agree with you. But in this case they were not offering literally anything.  Not gifts not vacations- nothing. Like I said in other reply,  one of them asked me to go with him for dinner and asked to split the Bill.",
            "author": "New_Awareness_1859",
            "id": "h2ouwo2",
            "parent_id": "t1_h2oudv6",
            "score": 3,
            "created_utc": 1624392699.0,
            "replies": [
                {
                    "body": "If that's happening often, you really need to take a close look at how you vette your POTs.  Where is this happening?",
                    "author": "hal99514",
                    "id": "h2oyrql",
                    "parent_id": "t1_h2ouwo2",
                    "score": -1,
                    "created_utc": 1624394440.0,
                    "replies": [
                        {
                            "body": "Seeking arrangements .",
                            "author": "New_Awareness_1859",
                            "id": "h2oz46c",
                            "parent_id": "t1_h2oyrql",
                            "score": 1,
                            "created_utc": 1624394596.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "If the op is to be believed, the sd in her story wants to split the bill at dinner...",
            "author": "pussy_impaler337",
            "id": "h2prd0v",
            "parent_id": "t1_h2oudv6",
            "score": 1,
            "created_utc": 1624409155.0,
            "replies": []
        },
        {
            "body": "so basically prostitution SOP?",
            "author": "TheAsianCShooter",
            "id": "iazijyp",
            "parent_id": "t1_h2uqtgw",
            "score": 1,
            "created_utc": 1654220870.0,
            "replies": []
        },
        {
            "body": "Aren’t both sides, generally, trying to meet people out of their league though?",
            "author": "goingfivehole",
            "id": "h2qent5",
            "parent_id": "t1_h2pdr0f",
            "score": 6,
            "created_utc": 1624421639.0,
            "replies": [
                {
                    "body": "Really easy to tell who is a sugar baby and who is a sugar daddy in this thread",
                    "author": "ThoughtfullyPriced",
                    "id": "h2qkhs5",
                    "parent_id": "t1_h2qent5",
                    "score": 10,
                    "created_utc": 1624425654.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I think he should be on tinder then",
            "author": "ColdHeaux",
            "id": "h2tgcc7",
            "parent_id": "t1_h2pzm3a",
            "score": 7,
            "created_utc": 1624485540.0,
            "replies": [
                {
                    "body": "When guys in those \"lower leagues\" go on tinder, nobody responds to their likes or messages though. That's what brings them to the sugar dating sites. At least there they will get a few bites.",
                    "author": "Thriller83",
                    "id": "h3c7idg",
                    "parent_id": "t1_h2tgcc7",
                    "score": 1,
                    "created_utc": 1624899311.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yeah that’s fair! You’re right, we are all looking for different things",
            "author": null,
            "id": "h2q2ewb",
            "parent_id": "t1_h2pzm3a",
            "score": 3,
            "created_utc": 1624414910.0,
            "replies": []
        },
        {
            "body": "Some are not there because they “need” financial help… some of us simply enjoy it.  I look at it as a show of his appreciation… that feels good.",
            "author": "RealEarthAngel",
            "id": "h2ty199",
            "parent_id": "t1_h2pzm3a",
            "score": 1,
            "created_utc": 1624494741.0,
            "replies": []
        },
        {
            "body": "Be thankful that he revealed himself early",
            "author": "pinotandsugar",
            "id": "h2podvg",
            "parent_id": "t1_h2oe1gb",
            "score": 13,
            "created_utc": 1624407525.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "h2oxdcp",
            "parent_id": "t1_h2oq10n",
            "score": 7,
            "created_utc": 1624393811.0,
            "replies": [
                {
                    "body": "Split the bill?!! 🤣",
                    "author": "SDchat",
                    "id": "h2pa25n",
                    "parent_id": "t1_h2oxdcp",
                    "score": 10,
                    "created_utc": 1624399865.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I think we are saying the same thing, ‘sex and money’ and ‘exchanging money for sex’.",
            "author": "SDforreal",
            "id": "h2puq0c",
            "parent_id": "t1_h2pb98u",
            "score": 4,
            "created_utc": 1624410867.0,
            "replies": []
        },
        {
            "body": "SPLIT THE BILL? They must be trolling. Smh",
            "author": "prettylilprostitute",
            "id": "h2ooo1r",
            "parent_id": "t1_h2odzgn",
            "score": 17,
            "created_utc": 1624389942.0,
            "replies": [
                {
                    "body": "I know right! But he got all upset that I called him crazy, and that makes me believe that he was not trolling at all 😂",
                    "author": "New_Awareness_1859",
                    "id": "h2oqn9z",
                    "parent_id": "t1_h2ooo1r",
                    "score": 15,
                    "created_utc": 1624390832.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "\\- and one even tried to invite me to have dinner with him, and said we could split the bill\n\nNo fricking way!?!?",
            "author": "Intrepid_Seeker",
            "id": "h2ojrd9",
            "parent_id": "t1_h2odzgn",
            "score": 14,
            "created_utc": 1624387747.0,
            "replies": [
                {
                    "body": "I swear to god 😂",
                    "author": "New_Awareness_1859",
                    "id": "h2oq9ib",
                    "parent_id": "t1_h2ojrd9",
                    "score": 9,
                    "created_utc": 1624390661.0,
                    "replies": [
                        {
                            "body": "Tell you what...You pick up the tab and I'll gladly leave the tip. 15%.",
                            "author": "Intrepid_Seeker",
                            "id": "h2oqgsy",
                            "parent_id": "t1_h2oq9ib",
                            "score": 9,
                            "created_utc": 1624390751.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": ">> one even tried to invite me to have dinner with him, and said we could split the bill\n\nNoooooo!! That’s a no for me even in vanilla dating!!\n\nDefinitely an odds thing like previously said. I feel like some guys try SA b/c much younger women will actually speak to them, while their chances are very low of matching & meeting 20-somethings on vanilla dating apps. On SA, if they’re lucky, they might get a girl who doesn’t bring up ppm/allowance/sugar at all before an m&g, & then they can try to steer it in their favor.",
            "author": "riiirii",
            "id": "h2olby8",
            "parent_id": "t1_h2odzgn",
            "score": 11,
            "created_utc": 1624388448.0,
            "replies": [
                {
                    "body": "True, I hate to think about it because they are wasting those girls time and that gets on my nerves, that's why I always bring it up in first conversation.",
                    "author": "New_Awareness_1859",
                    "id": "h2oqhdq",
                    "parent_id": "t1_h2olby8",
                    "score": 4,
                    "created_utc": 1624390758.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Wtf.  I was trying to see things from the other guys perspective like maybe he is just a spoiling boyfriend who takes you on nice dinners and buys you stuff but no set allowance.  He wants you to pay part of the bills?!?  Wtf .  For what it’s worth the last time I checked seeking it was over run with cam girls/only fans/escorts / straight up scammers, so the men’s perspective isn’t so great currently, you can definitely still use the site to give a sugar relationship but have to screen a lot harder /waste more time than I care to waste",
            "author": "pussy_impaler337",
            "id": "h2pr0aq",
            "parent_id": "t1_h2odzgn",
            "score": 3,
            "created_utc": 1624408962.0,
            "replies": []
        },
        {
            "body": "It’s in countless profiles. Worded differently but reminding SDs that an allowance is expected.",
            "author": "chairman212121",
            "id": "h2qpt34",
            "parent_id": "t1_h2pbrw8",
            "score": 1,
            "created_utc": 1624429948.0,
            "replies": [
                {
                    "body": "I see the word \"allowance\" in less than 1% of profiles. 🤷‍♂️\n\nIf it's worded differently to exclude the word allowance, then it's not the same.",
                    "author": "tyranthraxxus",
                    "id": "h2snguk",
                    "parent_id": "t1_h2qpt34",
                    "score": 1,
                    "created_utc": 1624472445.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "amen!",
            "author": "CindyyApple",
            "id": "h32rnx5",
            "parent_id": "t1_h2oq63a",
            "score": 1,
            "created_utc": 1624683155.0,
            "replies": []
        },
        {
            "body": "It seems to be more common in single mothers over 25.",
            "author": "hal99514",
            "id": "h2oyfb8",
            "parent_id": "t1_h2owmv8",
            "score": 4,
            "created_utc": 1624394284.0,
            "replies": [
                {
                    "body": "Yeah I've seen a few profiles looking for that, can't blame them though when places like tinder are basically rhe straight version of grinder.",
                    "author": "second-last-mohican",
                    "id": "h2p1j48",
                    "parent_id": "t1_h2oyfb8",
                    "score": 2,
                    "created_utc": 1624395704.0,
                    "replies": [
                        {
                            "body": "Single mothers, as a group, don't get asked out as much.  If you can get past her doubts and insecurities to the first few dates, the wow factor!",
                            "author": "hal99514",
                            "id": "h2p2g8j",
                            "parent_id": "t1_h2p1j48",
                            "score": 1,
                            "created_utc": 1624396137.0,
                            "replies": [
                                {
                                    "body": "[deleted]",
                                    "author": null,
                                    "id": "h2p3q1h",
                                    "parent_id": "t1_h2p2g8j",
                                    "score": 1,
                                    "created_utc": 1624396755.0,
                                    "replies": [
                                        {
                                            "body": "SD for sure, possibly the SB as well.",
                                            "author": "hal99514",
                                            "id": "h2plqit",
                                            "parent_id": "t1_h2p3q1h",
                                            "score": 1,
                                            "created_utc": 1624406067.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "I’ve seen many profiles that state ‘no money’. I had one SB who waited until the M&G to say ‘no money’ but yes to being spoiled",
            "author": "chairman212121",
            "id": "h2qq27j",
            "parent_id": "t1_h2owmv8",
            "score": 1,
            "created_utc": 1624430160.0,
            "replies": []
        },
        {
            "body": "If that's happening often, you really need to take a close look at how you vette your POTs.  Where is this happening?",
            "author": "hal99514",
            "id": "h2oyrql",
            "parent_id": "t1_h2ouwo2",
            "score": -1,
            "created_utc": 1624394440.0,
            "replies": [
                {
                    "body": "Seeking arrangements .",
                    "author": "New_Awareness_1859",
                    "id": "h2oz46c",
                    "parent_id": "t1_h2oyrql",
                    "score": 1,
                    "created_utc": 1624394596.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Really easy to tell who is a sugar baby and who is a sugar daddy in this thread",
            "author": "ThoughtfullyPriced",
            "id": "h2qkhs5",
            "parent_id": "t1_h2qent5",
            "score": 10,
            "created_utc": 1624425654.0,
            "replies": []
        },
        {
            "body": "When guys in those \"lower leagues\" go on tinder, nobody responds to their likes or messages though. That's what brings them to the sugar dating sites. At least there they will get a few bites.",
            "author": "Thriller83",
            "id": "h3c7idg",
            "parent_id": "t1_h2tgcc7",
            "score": 1,
            "created_utc": 1624899311.0,
            "replies": []
        },
        {
            "body": "Split the bill?!! 🤣",
            "author": "SDchat",
            "id": "h2pa25n",
            "parent_id": "t1_h2oxdcp",
            "score": 10,
            "created_utc": 1624399865.0,
            "replies": []
        },
        {
            "body": "I know right! But he got all upset that I called him crazy, and that makes me believe that he was not trolling at all 😂",
            "author": "New_Awareness_1859",
            "id": "h2oqn9z",
            "parent_id": "t1_h2ooo1r",
            "score": 15,
            "created_utc": 1624390832.0,
            "replies": []
        },
        {
            "body": "I swear to god 😂",
            "author": "New_Awareness_1859",
            "id": "h2oq9ib",
            "parent_id": "t1_h2ojrd9",
            "score": 9,
            "created_utc": 1624390661.0,
            "replies": [
                {
                    "body": "Tell you what...You pick up the tab and I'll gladly leave the tip. 15%.",
                    "author": "Intrepid_Seeker",
                    "id": "h2oqgsy",
                    "parent_id": "t1_h2oq9ib",
                    "score": 9,
                    "created_utc": 1624390751.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "True, I hate to think about it because they are wasting those girls time and that gets on my nerves, that's why I always bring it up in first conversation.",
            "author": "New_Awareness_1859",
            "id": "h2oqhdq",
            "parent_id": "t1_h2olby8",
            "score": 4,
            "created_utc": 1624390758.0,
            "replies": []
        },
        {
            "body": "I see the word \"allowance\" in less than 1% of profiles. 🤷‍♂️\n\nIf it's worded differently to exclude the word allowance, then it's not the same.",
            "author": "tyranthraxxus",
            "id": "h2snguk",
            "parent_id": "t1_h2qpt34",
            "score": 1,
            "created_utc": 1624472445.0,
            "replies": []
        },
        {
            "body": "Yeah I've seen a few profiles looking for that, can't blame them though when places like tinder are basically rhe straight version of grinder.",
            "author": "second-last-mohican",
            "id": "h2p1j48",
            "parent_id": "t1_h2oyfb8",
            "score": 2,
            "created_utc": 1624395704.0,
            "replies": [
                {
                    "body": "Single mothers, as a group, don't get asked out as much.  If you can get past her doubts and insecurities to the first few dates, the wow factor!",
                    "author": "hal99514",
                    "id": "h2p2g8j",
                    "parent_id": "t1_h2p1j48",
                    "score": 1,
                    "created_utc": 1624396137.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "h2p3q1h",
                            "parent_id": "t1_h2p2g8j",
                            "score": 1,
                            "created_utc": 1624396755.0,
                            "replies": [
                                {
                                    "body": "SD for sure, possibly the SB as well.",
                                    "author": "hal99514",
                                    "id": "h2plqit",
                                    "parent_id": "t1_h2p3q1h",
                                    "score": 1,
                                    "created_utc": 1624406067.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Seeking arrangements .",
            "author": "New_Awareness_1859",
            "id": "h2oz46c",
            "parent_id": "t1_h2oyrql",
            "score": 1,
            "created_utc": 1624394596.0,
            "replies": []
        },
        {
            "body": "Tell you what...You pick up the tab and I'll gladly leave the tip. 15%.",
            "author": "Intrepid_Seeker",
            "id": "h2oqgsy",
            "parent_id": "t1_h2oq9ib",
            "score": 9,
            "created_utc": 1624390751.0,
            "replies": []
        },
        {
            "body": "Single mothers, as a group, don't get asked out as much.  If you can get past her doubts and insecurities to the first few dates, the wow factor!",
            "author": "hal99514",
            "id": "h2p2g8j",
            "parent_id": "t1_h2p1j48",
            "score": 1,
            "created_utc": 1624396137.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "h2p3q1h",
                    "parent_id": "t1_h2p2g8j",
                    "score": 1,
                    "created_utc": 1624396755.0,
                    "replies": [
                        {
                            "body": "SD for sure, possibly the SB as well.",
                            "author": "hal99514",
                            "id": "h2plqit",
                            "parent_id": "t1_h2p3q1h",
                            "score": 1,
                            "created_utc": 1624406067.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "h2p3q1h",
            "parent_id": "t1_h2p2g8j",
            "score": 1,
            "created_utc": 1624396755.0,
            "replies": [
                {
                    "body": "SD for sure, possibly the SB as well.",
                    "author": "hal99514",
                    "id": "h2plqit",
                    "parent_id": "t1_h2p3q1h",
                    "score": 1,
                    "created_utc": 1624406067.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "SD for sure, possibly the SB as well.",
            "author": "hal99514",
            "id": "h2plqit",
            "parent_id": "t1_h2p3q1h",
            "score": 1,
            "created_utc": 1624406067.0,
            "replies": []
        }
    ]
}