{
    "title": "Non SB-Friends Rant",
    "post_id": "eubgd5",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/eubgd5/non_sbfriends_rant/",
    "author": "azn_sugar_angel",
    "body": "Can any other SBs relate to this annoying struggle? I’ve seen it on some other forums but not on this one. None of my friends are in the sugar world but a few know about my arrangement. I got lucky with a VERY generous SD who loves giving gifts and always is asking me what would make me happy. My friends know this (because they ask). I can’t tell you how many times I’ve gotten variations of “ask him for ___ and give it to me” or “Get me something while you’re there”. It makes me so prickly! This bothers me for two reasons\n\n1. I’M WORKING! If I get spoiled it’s because I’m earning it!! It’s not a traditional job I understand but I just cannot impress upon them enough, how much time and effort goes into cultivating a real relationship like this. It is not some old pathetic guy who is throwing things at me to buy my love. This is a successful man who yes will buy you things/pay for your company but in return for equal effort.  You literally are forming yourself to be the perfect companion, always “on” 24/7 if you’re together, be entertaining, attentive, pleasant etc CONSISTENTLY regardless of whatever is happening in your life/your feelings. Girl this purse is a work bonus \n\n2. I have an actual relationship/friendship with my SD. Why would I take advantage of him?? I don’t ask for things I don’t need and if he tells me he wants to buy me X and I genuinely will not get use from it I’ll say that! I don’t ask for things for myself why would I do that for you? \n\nI also try to put similar effort in all my friendships and try to be generous/thoughtful myself. I give gifts, send flowers for any small life achievement and it’s not like I flaunt any of the nice things I’m given. It just gives off this air of entitlement that rubs me the wrong way. \n\nfin",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/eubgd5/non_sbfriends_rant/",
    "score": 93,
    "upvote_ratio": 0.94,
    "created_utc": 1580067146.0,
    "num_comments": 47,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "Dont tell your friends about your sd. They will only hold it against you. Nothing good comes from telling non sbs about srs. Nothing.",
            "author": "dade_murphy1",
            "id": "ffno4cq",
            "parent_id": "t3_eubgd5",
            "score": 48,
            "created_utc": 1580068414.0,
            "replies": [
                {
                    "body": "I am a fool! I thought if I told a handful of my close friends (none who knew each other) that I would be able to get them to understand what it’s like and that I’m not just randomly getting lucky but I underestimated the effect it would have on a few of them.",
                    "author": "azn_sugar_angel",
                    "id": "ffnqxlq",
                    "parent_id": "t1_ffno4cq",
                    "score": 11,
                    "created_utc": 1580069559.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "ffo4rzj",
                            "parent_id": "t1_ffnqxlq",
                            "score": 11,
                            "created_utc": 1580074163.0,
                            "replies": [
                                {
                                    "body": "Oh understood! Any of the luxury items I’ve gotten during this have been unsolicited gifts. All of my allowance has gone to paying off a medical bill and now it goes to my rent and student loan payment and the rest goes into a savings account dedicated to my future student loan payments",
                                    "author": "azn_sugar_angel",
                                    "id": "ffonrho",
                                    "parent_id": "t1_ffo4rzj",
                                    "score": 5,
                                    "created_utc": 1580079667.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "You also have to think long term. Some may be fine with it, but you can't take it back. If you have a falling out, your friends can easily spread it to others. On top of that if your SD requires discretion, you will have possibly jeopardized that aspect if you see him in public. You're in the bowl, so if you bump into someone you know, they will know he is too.\n\nRemember there is a lot of competition amongst young women in society, so if any start feeling insecure about where their life is heading (financially, dating a successful guy etc), they may turn the focus on you.\n\nI met one SB whose ex-friend did the dog act of sending screenshots of her SA profile to her parents and SO.\n\nYour cover story should be: you like older guys, they often have their shit together and are happy to go out to nice places (unlike younger guys). You met on tinder/bumble etc.\n\n\"\\[I\\] give gifts, send flowers for any small life achievement\"\n\nI really like how caring and sharing you are, but this can accidentally cause resentment. For some people it may feel like you are rubbing their nose in their lack of success or poor financial situation.",
                            "author": "schmeeSD",
                            "id": "ffo65xl",
                            "parent_id": "t1_ffnqxlq",
                            "score": 4,
                            "created_utc": 1580074496.0,
                            "replies": [
                                {
                                    "body": "Oh this. I don’t want to meet my SB’s friends or have them know what I look like. Last thing I want is one of her friends coming up to me in public for some reason.",
                                    "author": "emptyoverflow",
                                    "id": "ffoes44",
                                    "parent_id": "t1_ffo65xl",
                                    "score": 3,
                                    "created_utc": 1580076904.0,
                                    "replies": []
                                },
                                {
                                    "body": "I agree with this! My SD loves the idea of my friends knowing that I’m being spoiled by an SD which is why I think he gets me all these flashy gifts but I’m the opposite. We’re super discrete so they don’t know what he looks like/his name/specific profession and only go out in public together out of state. I’m from a really affluent area and all my friends are relatively well off/have high paying jobs. We’ve all been surrounded by flashy labels and I never got a “keeping up with the Jones’s” vibe from them at all but I think that I was unrealistic about the stigma attached to sugaring in combo with everything",
                                    "author": "azn_sugar_angel",
                                    "id": "ffopj7l",
                                    "parent_id": "t1_ffo65xl",
                                    "score": 2,
                                    "created_utc": 1580080195.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Agree. Sugar is best enjoyed if treated like a beautiful dream you saw when you were sleeping. Only you know and remember what you saw and it’s hard to explain it to others in your real life.",
                    "author": null,
                    "id": "ffo3pab",
                    "parent_id": "t1_ffno4cq",
                    "score": 10,
                    "created_utc": 1580073783.0,
                    "replies": []
                },
                {
                    "body": "Exactly.",
                    "author": "perryplats",
                    "id": "ffnpefj",
                    "parent_id": "t1_ffno4cq",
                    "score": 3,
                    "created_utc": 1580068935.0,
                    "replies": []
                },
                {
                    "body": "This is very true :( \nSame happened to me.",
                    "author": "SheHasntHaveherses",
                    "id": "ffp7x93",
                    "parent_id": "t1_ffno4cq",
                    "score": 3,
                    "created_utc": 1580088463.0,
                    "replies": [
                        {
                            "body": "Even as an sd, nobody knows i am one.",
                            "author": "dade_murphy1",
                            "id": "ffpw53s",
                            "parent_id": "t1_ffp7x93",
                            "score": 1,
                            "created_utc": 1580108040.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Be a good actress and pretend you guys broke up so your material friends won’t bug you anymore",
            "author": "SlfFng",
            "id": "ffnyz5c",
            "parent_id": "t3_eubgd5",
            "score": 14,
            "created_utc": 1580072442.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "ffnojzy",
            "parent_id": "t3_eubgd5",
            "score": 31,
            "created_utc": 1580068591.0,
            "replies": [
                {
                    "body": "I definitely will take that advice! My mistake was being so excited when I first started in this new world and sharing all these weird experiences with them. \nThey were all super supportive when I was getting my bearings and going on m&gs. But you’re right because the tunes have changed now that they know how much I enjoy my SDs company and then they see me with some of the nicer gifts that they know I would’ve never purchased myself.",
                    "author": "azn_sugar_angel",
                    "id": "ffns52r",
                    "parent_id": "t1_ffnojzy",
                    "score": 16,
                    "created_utc": 1580070043.0,
                    "replies": [
                        {
                            "body": "My suspicion (and correct me if I'm wrong) is that your friends are also relatively young. Youth and entitlement are intricately wound vines. This typically fades with age, as people gain more life experience. Which is to say, it might be a passing phase. If it's not, consider how you speak to them about it (as others say), or perhaps getting more insightful friends! I think it's important to have a place to talk about your experiences (while being mindful not to brag) without them getting weird. But hear you on this - everything you say about it being 'work' is spot on. (And yes, folks, 'work' can mean a lot of things - all relationships are work!)",
                            "author": "_velvet_blue",
                            "id": "ffnwf8m",
                            "parent_id": "t1_ffns52r",
                            "score": 7,
                            "created_utc": 1580071613.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Yep this just a story of young money.  Nothing specific.  And magnifies when your contemporaries have little.\n\nRemember one thing - “the hamburger still taste like a hamburger” - bill gates.\n\nChannel is just a purse.  After 3-5 years of having stuff like that you begin to get no enjoyment from them.",
                    "author": "chitraders",
                    "id": "ffo3adn",
                    "parent_id": "t1_ffnojzy",
                    "score": 8,
                    "created_utc": 1580073636.0,
                    "replies": []
                },
                {
                    "body": "My daughters income jumped when she got promoted, twice what her friends make.  She has lost some friends over it.  She can afford really good restaurants, they want to stay home.  She can travel, they might take in a movie.  She has tried paying their way but they end up resentful.\n\nShe has had to find some more affluent friends.  Lots of SBs seek out other SBs for friendship.",
                    "author": "MidwestAmMan",
                    "id": "ffqg8n1",
                    "parent_id": "t1_ffnojzy",
                    "score": 1,
                    "created_utc": 1580133692.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "My SBs roommate asked her if she could “share me”.  She helps herself to my SBs stuff since she figures I’m an inexhaustible supplier.  When she’s hungry she asks my SB to have me bring dinner.  \n\nLast night I noticed my SB filtering the bag of food I brought over, putting the best away for herself and giving a little to her roommate.\n\nOther girls don’t realize how hard you girls work for your sugar money.  How difficult it is to find a good sugar daddy.  They take for granted and take advantage.",
            "author": "MidwestAmMan",
            "id": "ffnpqwj",
            "parent_id": "t3_eubgd5",
            "score": 12,
            "created_utc": 1580069078.0,
            "replies": []
        },
        {
            "body": "There is a saying often parroted here (and part of the reason why discussion of dollar amounts is banned)\n\nComparison is a thief of joy.\n\nThe friends you told are stealing your joy because of your success in cultivating a sugar arrangement.",
            "author": "Church42",
            "id": "ffnxunc",
            "parent_id": "t3_eubgd5",
            "score": 10,
            "created_utc": 1580072138.0,
            "replies": []
        },
        {
            "body": "When a SB tells her friends the details of her arrangement three things happen:\n\n1.  They get very jealous.  \n2. That jealousy causes them to jump on SA.\n3. That jealousy turns on you.  \n\nI can’t tell you how many SB’s over the years have had trouble with friends or family members getting jealous over the years.   The worst was when my SB’s mom started to charge her $1200/mo rent out of the blue.  She just got an apartment and it really strained their relationship.  \n\nThe advice I always give my SB’s is be very discreet with their money.   When you get flashy,  they get greedy.",
            "author": "LotBuilder",
            "id": "ffom0xe",
            "parent_id": "t3_eubgd5",
            "score": 9,
            "created_utc": 1580079002.0,
            "replies": [
                {
                    "body": "Sooooo true",
                    "author": "SheHasntHaveherses",
                    "id": "ffp8dt3",
                    "parent_id": "t1_ffom0xe",
                    "score": 1,
                    "created_utc": 1580088775.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Unless they're sugaring themselves, they won't fully understand everything that goes into finding an SR and being lucky enough to have a successful one at that. Like everyone else said, limit how much you mention the gifts your SD gives. You could say it's a fake Chanel or you thrifted it online. Yes, some people have a sense of entitlement. They see what you have and want it, but ignore the work you did to get there. Speaking from experience, this is true of SB friends, too.\n\nBUT (and it's a big BUTT) your SD is worth bragging about and I don't blame you for wanting to share your happiness. Unfortunately, sometimes seeing your good fortune brings out the ugliness in other people. Keep being yourself. You're such a thoughtful and genuine person, gauging from this post alone. Only best wishes from me! ❤️",
            "author": "emilyeverafter-llc",
            "id": "ffoguop",
            "parent_id": "t3_eubgd5",
            "score": 7,
            "created_utc": 1580077500.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "ffnpv8b",
            "parent_id": "t3_eubgd5",
            "score": 7,
            "created_utc": 1580069128.0,
            "replies": [
                {
                    "body": "Yes!  I’m rapidly realizing this... just a little late 😑",
                    "author": "azn_sugar_angel",
                    "id": "ffnqd2t",
                    "parent_id": "t1_ffnpv8b",
                    "score": 1,
                    "created_utc": 1580069334.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Oh I made this mistake when I was younger, went from a broke college student to a baller with a generous SD and I wanted to share with my friends so we started going out and I would pay for everything... eventually it was expected of me to always fit the bill, some would even dare to take my debit card and charge it bc probably \"I wouldn't noticed \". \nI got invited to things not because they wanted to hang out with me but bc they expected me to pay for them... eventually my circle got very small... same happened with my family.  It's so frustrating and insolationg that everyone you care for starts to treat you like an ATM bc you are \"successful \". \nIf I could change something about my past would be to SHUT THE F UP about it and live frugally and quiet about the $$$. Things would have been so different now. I feel like I can't trust anyone  :/  even when trying to date vanilla guys would start experiencing me to foot the bill too bc \"i have it good\" 🙃 one way of another they would always try to take advantage of me, even my mum demanded me to buy her a house... but doesn't have the same energy for the men in the family, her husband included 🙄🙄🙄🙄. \n\nGurls keep the money to yourselves or move to the other side of the world 😬😝",
            "author": "SheHasntHaveherses",
            "id": "ffp7pvz",
            "parent_id": "t3_eubgd5",
            "score": 8,
            "created_utc": 1580088317.0,
            "replies": []
        },
        {
            "body": "Some women are so petty...I'm sorry.",
            "author": "BratinaHat",
            "id": "ffnucfg",
            "parent_id": "t3_eubgd5",
            "score": 7,
            "created_utc": 1580070940.0,
            "replies": []
        },
        {
            "body": "From the SD side: if I had a SB that was squeezing me for stuff for her friends without telling me I’d be pissed. The SR would be over for me. I’m generous when I can be, but don’t take advantage of me.",
            "author": "mraspencer",
            "id": "ffnnuk2",
            "parent_id": "t3_eubgd5",
            "score": 11,
            "created_utc": 1580068304.0,
            "replies": [
                {
                    "body": "Yeah. I’m not a genie in a bottle...\n\nIf you rub me the right way.... where am I going with this?!?",
                    "author": "EastTexas_SD",
                    "id": "ffnrskc",
                    "parent_id": "t1_ffnnuk2",
                    "score": 10,
                    "created_utc": 1580069904.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "preach!",
            "author": "TheBestToothache",
            "id": "ffnl7uv",
            "parent_id": "t3_eubgd5",
            "score": 5,
            "created_utc": 1580067483.0,
            "replies": []
        },
        {
            "body": "Sugaring can fall on the sex work spectrum- many pairings see it as a give and take of resources including time, finances, and emotional authenticity. It takes WORK. If you look to share your experiences in the bowl, the best thing you can do is surround yourself with friends that respect sex workers and the lifestyle you’ve chosen, and are emotionally mature themselves. Good, mature friends won’t expect you to gift them from your salary, and although the sugar in sugaring is often seen as a gift (especially to outsiders) you should treat it as a salary or self care money. \n\nI love to spoil my friends when I can, but would resent it if they asked.",
            "author": "cannedoll96",
            "id": "ffoc8jq",
            "parent_id": "t3_eubgd5",
            "score": 4,
            "created_utc": 1580076164.0,
            "replies": []
        },
        {
            "body": "Perhaps your friends only recognize the financial aspect of your SR and not the emotional connection? Or maybe they are just selfish?\n\nIn my first SR I was spending 1/3 of it on me and my friends and saving the other 2/3. They never asked for anything but I was excited to have disposal income amd was willing to buy an item of clothing or offer to pay for our outings. Even with that, my friends were grateful but encouraged me to save more of it and not spend it on them. It was great advice lol. \n\nI think you need better friends imo",
            "author": "JoyfulNicole",
            "id": "ffp7rm4",
            "parent_id": "t3_eubgd5",
            "score": 5,
            "created_utc": 1580088351.0,
            "replies": []
        },
        {
            "body": "How fucking rude!!! Why do they think they're entitled to his generosity, they're not giving him anything in return.\n\nI'm lucky in that the friends I've told about my sugaring have never and (I hope) would never ask for anything from my SD. I'm sorry your friends are so disrespectful.",
            "author": "ms_moogle",
            "id": "ffoahfy",
            "parent_id": "t3_eubgd5",
            "score": 4,
            "created_utc": 1580075717.0,
            "replies": []
        },
        {
            "body": "You are laser focused, respect. Repeating. Don't talk about Fight Club.Currently working on a creative project that involves some of my recent experiences. Had to collaborate with non SR people and even though they are super open minded creatives, the judging was real. Granted, my specific situation would shock most, I'm sure you can imagine...They weren't even judging that, it was the lifestyle itself. Either way, looks like you're on your way to becoming the Warren Buffet of SBs ;)",
            "author": null,
            "id": "ffosqcl",
            "parent_id": "t3_eubgd5",
            "score": 3,
            "created_utc": 1580081242.0,
            "replies": []
        },
        {
            "body": "THIS is why I don’t tell anyone anything about my relationships. I had a girl I went to college with be upset with ME because I refused to pay for her breakfast with MY allowance cash. Tell them it’s not their money and keep your arrangement under the rug. \n\nI hated not being able to brag to my friends but *shrug* it’s not worth the conversation.",
            "author": null,
            "id": "ffpfd2p",
            "parent_id": "t3_eubgd5",
            "score": 3,
            "created_utc": 1580093662.0,
            "replies": []
        },
        {
            "body": "I am always myself with my SD, and he encourages me to be that way. Authenticity is important to me. I am not \"working\" when i'm with my SD. As to the friends issue, I have a friend that jokes I should have my SD buy him stuff but he's 100% joking and it doesn't bother me one bit. If I had friends who felt entitled to taking advantage of my relationship with my SD, then they sound like people I wouldn't want to be friends with in general.",
            "author": null,
            "id": "ffnm8et",
            "parent_id": "t3_eubgd5",
            "score": 8,
            "created_utc": 1580067762.0,
            "replies": [
                {
                    "body": "When I use the term “working” I’m not insinuating that I’m being disingenuous lol. My SD and I are very close but the entire crux of a sugar relationship lies on the priority you as an SB give to their needs. So that means going to meet him on his day off even when I’m feeling lazy, making time in my day to text him and check in, if I’m in a bad mood/stressed on a day we are supposed to meet I set that aside or reschedule.  \nAnd yes it’s teasing and jokes and none of my friends demand this or get made when I don’t. But behind every joke is truth so it’s just an indicator that they see me getting these gifts as either 1. Not being deserving of it 2. Thinking of it as a cheap transactional relationship. I wouldn’t stop being friends with people who just don’t understand my SR, it’s not something I expect. This is just something that annoys me lol not a toxic trait lol",
                    "author": "azn_sugar_angel",
                    "id": "ffnp7tj",
                    "parent_id": "t1_ffnm8et",
                    "score": 7,
                    "created_utc": 1580068860.0,
                    "replies": []
                },
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "ffntvub",
                    "parent_id": "t1_ffnm8et",
                    "score": -2,
                    "created_utc": 1580070756.0,
                    "replies": [
                        {
                            "body": "Definitely, I genuinely care about him so of course I put effort into the relationship. I like to get dressed up for him, etc. But I do this not cause I \"need\" to but because I *want* to, just like he wants to take me grocery shopping because it puts a smile on my face.",
                            "author": null,
                            "id": "ffnv3ys",
                            "parent_id": "t1_ffntvub",
                            "score": 1,
                            "created_utc": 1580071253.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I have girlfriend like this. Sometimes, when I am in a good mood, I am her platonic sugar momma. But when I am not, i always told her she needs to lose weight and can join me. Your welcome",
            "author": "princessindo",
            "id": "ffno6mp",
            "parent_id": "t3_eubgd5",
            "score": 5,
            "created_utc": 1580068440.0,
            "replies": [
                {
                    "body": "Facts 😂😂",
                    "author": "JoyfulNicole",
                    "id": "ffp7vmt",
                    "parent_id": "t1_ffno6mp",
                    "score": 3,
                    "created_utc": 1580088431.0,
                    "replies": []
                },
                {
                    "body": "You don't need to be slim to sugar, I'm curvy and very popular.",
                    "author": null,
                    "id": "ffp9hai",
                    "parent_id": "t1_ffno6mp",
                    "score": 3,
                    "created_utc": 1580089506.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Maybe this is just me, but a huge desire of none would be to be able to occasionally include my SBs friends into the mix, joining us for dinner and sex, it maybe just the sex part ;)\n\nI would definitely as an incremental allowance for the roommate. \n\nYou definitely should not tell most of your friends about this stuff, but having a SB friend around for the occasional menage a trois is a nice asset, especially if you could join her and hey SD every once in a while.",
            "author": "ridadori",
            "id": "ffp5pvc",
            "parent_id": "t3_eubgd5",
            "score": 2,
            "created_utc": 1580086906.0,
            "replies": []
        },
        {
            "body": "“ask him for ___ and give it to me” or “Get me something while you’re there”.\n\nDepending on how real you want to be with them ,say \"well, if you want to invest (many) hours of your free time, sleep with an older man, be available whenhe can see you ,then maybe you can get gifts also. He doesn't giftme for looking cute.\"\n\nI know, you won't say that. But if you want to educate these greedy friends of yours then tell them how it is. You're lucky you like him, because many SBs onlt tolerate their SDs for the benefits.",
            "author": "GSSD",
            "id": "ffqf561",
            "parent_id": "t3_eubgd5",
            "score": 2,
            "created_utc": 1580132750.0,
            "replies": []
        },
        {
            "body": "This type of friend is everywhere. I did findom for a while and my best friend would literally tell me to “add another” item in the cart for her and get pissy whenever I said no. She would expect me to cover any of our expenses if she knew I had just rinsed someone. \n\nIt’s work and I’m earning it. I told her what to do and how easy it was. You think she did it for herself?",
            "author": "icantfigureredditout",
            "id": "ffo16to",
            "parent_id": "t3_eubgd5",
            "score": 2,
            "created_utc": 1580073076.0,
            "replies": [
                {
                    "body": "I had a friend like this. They kept complaining to me that they couldn't find genuine pay pigs and that I should send them to her instead. I gave them tips on how to be more successful, but they never took my advice and continued to complain. To the point one time when money was mentioned, they outright said in a group chat that their bank account was -$39 and that my client should pay them instead of me.",
                    "author": "lexxi_labelle",
                    "id": "fforakm",
                    "parent_id": "t1_ffo16to",
                    "score": 3,
                    "created_utc": 1580080782.0,
                    "replies": [
                        {
                            "body": "Your friend sounds like a real treat",
                            "author": "JoyfulNicole",
                            "id": "ffp8abj",
                            "parent_id": "t1_fforakm",
                            "score": 3,
                            "created_utc": 1580088709.0,
                            "replies": [
                                {
                                    "body": "Oh that's only the half of it...",
                                    "author": "lexxi_labelle",
                                    "id": "ffq0ojf",
                                    "parent_id": "t1_ffp8abj",
                                    "score": 1,
                                    "created_utc": 1580114014.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Sounds like pure jealousy. It's probably better for you not to share further information of your earnings in the future.",
                            "author": "verosse",
                            "id": "ffrrkea",
                            "parent_id": "t1_fforakm",
                            "score": 2,
                            "created_utc": 1580164247.0,
                            "replies": [
                                {
                                    "body": "Oh I don't plan on it.",
                                    "author": "lexxi_labelle",
                                    "id": "ffrul51",
                                    "parent_id": "t1_ffrrkea",
                                    "score": 1,
                                    "created_utc": 1580166170.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Well..\nEven tho I don't consider sugaring my job (I have an actual relationship.  I'm not putting on a \"show\" or the \"perfect companion mask\")\n\nI do have friends that are non supportive of me being a stay at home SGF - they say it's too traditional for them. So obvs I had to cut off some friendships bc of different life ideals✌🏽",
            "author": null,
            "id": "ffo6hub",
            "parent_id": "t3_eubgd5",
            "score": 1,
            "created_utc": 1580074614.0,
            "replies": [
                {
                    "body": "I'm on the same boat!\n\nFortunately almost all my close friends whom I've told about it are very happy and supportive of my decision, with the exception of one who is no longer my friend.",
                    "author": "verosse",
                    "id": "ffrs6b9",
                    "parent_id": "t1_ffo6hub",
                    "score": 1,
                    "created_utc": 1580164631.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I am a fool! I thought if I told a handful of my close friends (none who knew each other) that I would be able to get them to understand what it’s like and that I’m not just randomly getting lucky but I underestimated the effect it would have on a few of them.",
            "author": "azn_sugar_angel",
            "id": "ffnqxlq",
            "parent_id": "t1_ffno4cq",
            "score": 11,
            "created_utc": 1580069559.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "ffo4rzj",
                    "parent_id": "t1_ffnqxlq",
                    "score": 11,
                    "created_utc": 1580074163.0,
                    "replies": [
                        {
                            "body": "Oh understood! Any of the luxury items I’ve gotten during this have been unsolicited gifts. All of my allowance has gone to paying off a medical bill and now it goes to my rent and student loan payment and the rest goes into a savings account dedicated to my future student loan payments",
                            "author": "azn_sugar_angel",
                            "id": "ffonrho",
                            "parent_id": "t1_ffo4rzj",
                            "score": 5,
                            "created_utc": 1580079667.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "You also have to think long term. Some may be fine with it, but you can't take it back. If you have a falling out, your friends can easily spread it to others. On top of that if your SD requires discretion, you will have possibly jeopardized that aspect if you see him in public. You're in the bowl, so if you bump into someone you know, they will know he is too.\n\nRemember there is a lot of competition amongst young women in society, so if any start feeling insecure about where their life is heading (financially, dating a successful guy etc), they may turn the focus on you.\n\nI met one SB whose ex-friend did the dog act of sending screenshots of her SA profile to her parents and SO.\n\nYour cover story should be: you like older guys, they often have their shit together and are happy to go out to nice places (unlike younger guys). You met on tinder/bumble etc.\n\n\"\\[I\\] give gifts, send flowers for any small life achievement\"\n\nI really like how caring and sharing you are, but this can accidentally cause resentment. For some people it may feel like you are rubbing their nose in their lack of success or poor financial situation.",
                    "author": "schmeeSD",
                    "id": "ffo65xl",
                    "parent_id": "t1_ffnqxlq",
                    "score": 4,
                    "created_utc": 1580074496.0,
                    "replies": [
                        {
                            "body": "Oh this. I don’t want to meet my SB’s friends or have them know what I look like. Last thing I want is one of her friends coming up to me in public for some reason.",
                            "author": "emptyoverflow",
                            "id": "ffoes44",
                            "parent_id": "t1_ffo65xl",
                            "score": 3,
                            "created_utc": 1580076904.0,
                            "replies": []
                        },
                        {
                            "body": "I agree with this! My SD loves the idea of my friends knowing that I’m being spoiled by an SD which is why I think he gets me all these flashy gifts but I’m the opposite. We’re super discrete so they don’t know what he looks like/his name/specific profession and only go out in public together out of state. I’m from a really affluent area and all my friends are relatively well off/have high paying jobs. We’ve all been surrounded by flashy labels and I never got a “keeping up with the Jones’s” vibe from them at all but I think that I was unrealistic about the stigma attached to sugaring in combo with everything",
                            "author": "azn_sugar_angel",
                            "id": "ffopj7l",
                            "parent_id": "t1_ffo65xl",
                            "score": 2,
                            "created_utc": 1580080195.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Agree. Sugar is best enjoyed if treated like a beautiful dream you saw when you were sleeping. Only you know and remember what you saw and it’s hard to explain it to others in your real life.",
            "author": null,
            "id": "ffo3pab",
            "parent_id": "t1_ffno4cq",
            "score": 10,
            "created_utc": 1580073783.0,
            "replies": []
        },
        {
            "body": "Exactly.",
            "author": "perryplats",
            "id": "ffnpefj",
            "parent_id": "t1_ffno4cq",
            "score": 3,
            "created_utc": 1580068935.0,
            "replies": []
        },
        {
            "body": "This is very true :( \nSame happened to me.",
            "author": "SheHasntHaveherses",
            "id": "ffp7x93",
            "parent_id": "t1_ffno4cq",
            "score": 3,
            "created_utc": 1580088463.0,
            "replies": [
                {
                    "body": "Even as an sd, nobody knows i am one.",
                    "author": "dade_murphy1",
                    "id": "ffpw53s",
                    "parent_id": "t1_ffp7x93",
                    "score": 1,
                    "created_utc": 1580108040.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I definitely will take that advice! My mistake was being so excited when I first started in this new world and sharing all these weird experiences with them. \nThey were all super supportive when I was getting my bearings and going on m&gs. But you’re right because the tunes have changed now that they know how much I enjoy my SDs company and then they see me with some of the nicer gifts that they know I would’ve never purchased myself.",
            "author": "azn_sugar_angel",
            "id": "ffns52r",
            "parent_id": "t1_ffnojzy",
            "score": 16,
            "created_utc": 1580070043.0,
            "replies": [
                {
                    "body": "My suspicion (and correct me if I'm wrong) is that your friends are also relatively young. Youth and entitlement are intricately wound vines. This typically fades with age, as people gain more life experience. Which is to say, it might be a passing phase. If it's not, consider how you speak to them about it (as others say), or perhaps getting more insightful friends! I think it's important to have a place to talk about your experiences (while being mindful not to brag) without them getting weird. But hear you on this - everything you say about it being 'work' is spot on. (And yes, folks, 'work' can mean a lot of things - all relationships are work!)",
                    "author": "_velvet_blue",
                    "id": "ffnwf8m",
                    "parent_id": "t1_ffns52r",
                    "score": 7,
                    "created_utc": 1580071613.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Yep this just a story of young money.  Nothing specific.  And magnifies when your contemporaries have little.\n\nRemember one thing - “the hamburger still taste like a hamburger” - bill gates.\n\nChannel is just a purse.  After 3-5 years of having stuff like that you begin to get no enjoyment from them.",
            "author": "chitraders",
            "id": "ffo3adn",
            "parent_id": "t1_ffnojzy",
            "score": 8,
            "created_utc": 1580073636.0,
            "replies": []
        },
        {
            "body": "My daughters income jumped when she got promoted, twice what her friends make.  She has lost some friends over it.  She can afford really good restaurants, they want to stay home.  She can travel, they might take in a movie.  She has tried paying their way but they end up resentful.\n\nShe has had to find some more affluent friends.  Lots of SBs seek out other SBs for friendship.",
            "author": "MidwestAmMan",
            "id": "ffqg8n1",
            "parent_id": "t1_ffnojzy",
            "score": 1,
            "created_utc": 1580133692.0,
            "replies": []
        },
        {
            "body": "Sooooo true",
            "author": "SheHasntHaveherses",
            "id": "ffp8dt3",
            "parent_id": "t1_ffom0xe",
            "score": 1,
            "created_utc": 1580088775.0,
            "replies": []
        },
        {
            "body": "Yes!  I’m rapidly realizing this... just a little late 😑",
            "author": "azn_sugar_angel",
            "id": "ffnqd2t",
            "parent_id": "t1_ffnpv8b",
            "score": 1,
            "created_utc": 1580069334.0,
            "replies": []
        },
        {
            "body": "Yeah. I’m not a genie in a bottle...\n\nIf you rub me the right way.... where am I going with this?!?",
            "author": "EastTexas_SD",
            "id": "ffnrskc",
            "parent_id": "t1_ffnnuk2",
            "score": 10,
            "created_utc": 1580069904.0,
            "replies": []
        },
        {
            "body": "When I use the term “working” I’m not insinuating that I’m being disingenuous lol. My SD and I are very close but the entire crux of a sugar relationship lies on the priority you as an SB give to their needs. So that means going to meet him on his day off even when I’m feeling lazy, making time in my day to text him and check in, if I’m in a bad mood/stressed on a day we are supposed to meet I set that aside or reschedule.  \nAnd yes it’s teasing and jokes and none of my friends demand this or get made when I don’t. But behind every joke is truth so it’s just an indicator that they see me getting these gifts as either 1. Not being deserving of it 2. Thinking of it as a cheap transactional relationship. I wouldn’t stop being friends with people who just don’t understand my SR, it’s not something I expect. This is just something that annoys me lol not a toxic trait lol",
            "author": "azn_sugar_angel",
            "id": "ffnp7tj",
            "parent_id": "t1_ffnm8et",
            "score": 7,
            "created_utc": 1580068860.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "ffntvub",
            "parent_id": "t1_ffnm8et",
            "score": -2,
            "created_utc": 1580070756.0,
            "replies": [
                {
                    "body": "Definitely, I genuinely care about him so of course I put effort into the relationship. I like to get dressed up for him, etc. But I do this not cause I \"need\" to but because I *want* to, just like he wants to take me grocery shopping because it puts a smile on my face.",
                    "author": null,
                    "id": "ffnv3ys",
                    "parent_id": "t1_ffntvub",
                    "score": 1,
                    "created_utc": 1580071253.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Facts 😂😂",
            "author": "JoyfulNicole",
            "id": "ffp7vmt",
            "parent_id": "t1_ffno6mp",
            "score": 3,
            "created_utc": 1580088431.0,
            "replies": []
        },
        {
            "body": "You don't need to be slim to sugar, I'm curvy and very popular.",
            "author": null,
            "id": "ffp9hai",
            "parent_id": "t1_ffno6mp",
            "score": 3,
            "created_utc": 1580089506.0,
            "replies": []
        },
        {
            "body": "I had a friend like this. They kept complaining to me that they couldn't find genuine pay pigs and that I should send them to her instead. I gave them tips on how to be more successful, but they never took my advice and continued to complain. To the point one time when money was mentioned, they outright said in a group chat that their bank account was -$39 and that my client should pay them instead of me.",
            "author": "lexxi_labelle",
            "id": "fforakm",
            "parent_id": "t1_ffo16to",
            "score": 3,
            "created_utc": 1580080782.0,
            "replies": [
                {
                    "body": "Your friend sounds like a real treat",
                    "author": "JoyfulNicole",
                    "id": "ffp8abj",
                    "parent_id": "t1_fforakm",
                    "score": 3,
                    "created_utc": 1580088709.0,
                    "replies": [
                        {
                            "body": "Oh that's only the half of it...",
                            "author": "lexxi_labelle",
                            "id": "ffq0ojf",
                            "parent_id": "t1_ffp8abj",
                            "score": 1,
                            "created_utc": 1580114014.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Sounds like pure jealousy. It's probably better for you not to share further information of your earnings in the future.",
                    "author": "verosse",
                    "id": "ffrrkea",
                    "parent_id": "t1_fforakm",
                    "score": 2,
                    "created_utc": 1580164247.0,
                    "replies": [
                        {
                            "body": "Oh I don't plan on it.",
                            "author": "lexxi_labelle",
                            "id": "ffrul51",
                            "parent_id": "t1_ffrrkea",
                            "score": 1,
                            "created_utc": 1580166170.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I'm on the same boat!\n\nFortunately almost all my close friends whom I've told about it are very happy and supportive of my decision, with the exception of one who is no longer my friend.",
            "author": "verosse",
            "id": "ffrs6b9",
            "parent_id": "t1_ffo6hub",
            "score": 1,
            "created_utc": 1580164631.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "ffo4rzj",
            "parent_id": "t1_ffnqxlq",
            "score": 11,
            "created_utc": 1580074163.0,
            "replies": [
                {
                    "body": "Oh understood! Any of the luxury items I’ve gotten during this have been unsolicited gifts. All of my allowance has gone to paying off a medical bill and now it goes to my rent and student loan payment and the rest goes into a savings account dedicated to my future student loan payments",
                    "author": "azn_sugar_angel",
                    "id": "ffonrho",
                    "parent_id": "t1_ffo4rzj",
                    "score": 5,
                    "created_utc": 1580079667.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "You also have to think long term. Some may be fine with it, but you can't take it back. If you have a falling out, your friends can easily spread it to others. On top of that if your SD requires discretion, you will have possibly jeopardized that aspect if you see him in public. You're in the bowl, so if you bump into someone you know, they will know he is too.\n\nRemember there is a lot of competition amongst young women in society, so if any start feeling insecure about where their life is heading (financially, dating a successful guy etc), they may turn the focus on you.\n\nI met one SB whose ex-friend did the dog act of sending screenshots of her SA profile to her parents and SO.\n\nYour cover story should be: you like older guys, they often have their shit together and are happy to go out to nice places (unlike younger guys). You met on tinder/bumble etc.\n\n\"\\[I\\] give gifts, send flowers for any small life achievement\"\n\nI really like how caring and sharing you are, but this can accidentally cause resentment. For some people it may feel like you are rubbing their nose in their lack of success or poor financial situation.",
            "author": "schmeeSD",
            "id": "ffo65xl",
            "parent_id": "t1_ffnqxlq",
            "score": 4,
            "created_utc": 1580074496.0,
            "replies": [
                {
                    "body": "Oh this. I don’t want to meet my SB’s friends or have them know what I look like. Last thing I want is one of her friends coming up to me in public for some reason.",
                    "author": "emptyoverflow",
                    "id": "ffoes44",
                    "parent_id": "t1_ffo65xl",
                    "score": 3,
                    "created_utc": 1580076904.0,
                    "replies": []
                },
                {
                    "body": "I agree with this! My SD loves the idea of my friends knowing that I’m being spoiled by an SD which is why I think he gets me all these flashy gifts but I’m the opposite. We’re super discrete so they don’t know what he looks like/his name/specific profession and only go out in public together out of state. I’m from a really affluent area and all my friends are relatively well off/have high paying jobs. We’ve all been surrounded by flashy labels and I never got a “keeping up with the Jones’s” vibe from them at all but I think that I was unrealistic about the stigma attached to sugaring in combo with everything",
                    "author": "azn_sugar_angel",
                    "id": "ffopj7l",
                    "parent_id": "t1_ffo65xl",
                    "score": 2,
                    "created_utc": 1580080195.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Even as an sd, nobody knows i am one.",
            "author": "dade_murphy1",
            "id": "ffpw53s",
            "parent_id": "t1_ffp7x93",
            "score": 1,
            "created_utc": 1580108040.0,
            "replies": []
        },
        {
            "body": "My suspicion (and correct me if I'm wrong) is that your friends are also relatively young. Youth and entitlement are intricately wound vines. This typically fades with age, as people gain more life experience. Which is to say, it might be a passing phase. If it's not, consider how you speak to them about it (as others say), or perhaps getting more insightful friends! I think it's important to have a place to talk about your experiences (while being mindful not to brag) without them getting weird. But hear you on this - everything you say about it being 'work' is spot on. (And yes, folks, 'work' can mean a lot of things - all relationships are work!)",
            "author": "_velvet_blue",
            "id": "ffnwf8m",
            "parent_id": "t1_ffns52r",
            "score": 7,
            "created_utc": 1580071613.0,
            "replies": []
        },
        {
            "body": "Definitely, I genuinely care about him so of course I put effort into the relationship. I like to get dressed up for him, etc. But I do this not cause I \"need\" to but because I *want* to, just like he wants to take me grocery shopping because it puts a smile on my face.",
            "author": null,
            "id": "ffnv3ys",
            "parent_id": "t1_ffntvub",
            "score": 1,
            "created_utc": 1580071253.0,
            "replies": []
        },
        {
            "body": "Your friend sounds like a real treat",
            "author": "JoyfulNicole",
            "id": "ffp8abj",
            "parent_id": "t1_fforakm",
            "score": 3,
            "created_utc": 1580088709.0,
            "replies": [
                {
                    "body": "Oh that's only the half of it...",
                    "author": "lexxi_labelle",
                    "id": "ffq0ojf",
                    "parent_id": "t1_ffp8abj",
                    "score": 1,
                    "created_utc": 1580114014.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Sounds like pure jealousy. It's probably better for you not to share further information of your earnings in the future.",
            "author": "verosse",
            "id": "ffrrkea",
            "parent_id": "t1_fforakm",
            "score": 2,
            "created_utc": 1580164247.0,
            "replies": [
                {
                    "body": "Oh I don't plan on it.",
                    "author": "lexxi_labelle",
                    "id": "ffrul51",
                    "parent_id": "t1_ffrrkea",
                    "score": 1,
                    "created_utc": 1580166170.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Oh understood! Any of the luxury items I’ve gotten during this have been unsolicited gifts. All of my allowance has gone to paying off a medical bill and now it goes to my rent and student loan payment and the rest goes into a savings account dedicated to my future student loan payments",
            "author": "azn_sugar_angel",
            "id": "ffonrho",
            "parent_id": "t1_ffo4rzj",
            "score": 5,
            "created_utc": 1580079667.0,
            "replies": []
        },
        {
            "body": "Oh this. I don’t want to meet my SB’s friends or have them know what I look like. Last thing I want is one of her friends coming up to me in public for some reason.",
            "author": "emptyoverflow",
            "id": "ffoes44",
            "parent_id": "t1_ffo65xl",
            "score": 3,
            "created_utc": 1580076904.0,
            "replies": []
        },
        {
            "body": "I agree with this! My SD loves the idea of my friends knowing that I’m being spoiled by an SD which is why I think he gets me all these flashy gifts but I’m the opposite. We’re super discrete so they don’t know what he looks like/his name/specific profession and only go out in public together out of state. I’m from a really affluent area and all my friends are relatively well off/have high paying jobs. We’ve all been surrounded by flashy labels and I never got a “keeping up with the Jones’s” vibe from them at all but I think that I was unrealistic about the stigma attached to sugaring in combo with everything",
            "author": "azn_sugar_angel",
            "id": "ffopj7l",
            "parent_id": "t1_ffo65xl",
            "score": 2,
            "created_utc": 1580080195.0,
            "replies": []
        },
        {
            "body": "Oh that's only the half of it...",
            "author": "lexxi_labelle",
            "id": "ffq0ojf",
            "parent_id": "t1_ffp8abj",
            "score": 1,
            "created_utc": 1580114014.0,
            "replies": []
        },
        {
            "body": "Oh I don't plan on it.",
            "author": "lexxi_labelle",
            "id": "ffrul51",
            "parent_id": "t1_ffrrkea",
            "score": 1,
            "created_utc": 1580166170.0,
            "replies": []
        }
    ]
}