{
    "title": "Im in love?",
    "post_id": "ashbw7",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/ashbw7/im_in_love/",
    "author": "pmmeyourpizzapix",
    "body": "Story time because I’m sick as a dog in bed and I feel like sharing! \nBack in October I watched a stupid YouTube video in which SA was mentioned. I was dating a loser I thought I wanted to propose to. We were together for 1 and a half years. I looked at the website and texted an old room mate who is a SB and asked her what she thought. She told me to talk to my BF and see what he thought. He gave me freedom to sleep with a woman during our relationship so I figured it was worth a shot. He dumped me that day before I ever even brought it up to him. Lol. So I joined SA! \n\nI got a few messages from some scammers and quickly realized this wasn’t going to be as easy as I had hoped. No worries, I’m a patient gal who believes good things come to those who wait. Had a few awful dates. Got some funny messages. Met a dream boat that killed off his wife (METAPHORICALLY LOL) and dumped me when I told him I knew she was alive and well. I never threatened him, I just let him know I knew and it was pretty easy to find her so he should be careful of others who would not handle it the way I did. Maybe you saw that post? Idk. But after he dumped me I had a better idea of what i was looking for and what i wanted. \n\nIn my search, I had started a conversation with an older fella with quite the profile. You ever come accounts that offer a phone, car, all expenses paid, a beautiful home? And you’re like yeah okay. Well I humored such an account. And after a few messages, god knows why, I fell off and never replied to his ‘what are you looking for?’. Well, I reviewed his page and said fuck it! I replied to his 2 month old message and hoped for the best. \nI apologized for never replying and asked if he would care to get coffee or something. AND HE REPLIED! 😍 we got a late dinner and talked for hours. It was so natural to us both. He was so fun to talk with and such a character! \n\nWe ended up meeting a couple more times before I went back to his place for the night. He wasn’t kidding when he said he had a beautiful home to share! I grew up in a two bedroom home with a family of 5. I’m not a material girl at all and I got into this whole thing to help get myself out of debt. But I will admit it’s such a wonderful change of pace! \n\nI was in a weird place and didn’t think I even wanted to be alive when we started our relationship. He saw potential in me and believes I can be a successful woman. Oh great now I’m tearing up. LOL. You can get through this pizza girl! Well! I told him about how I was tempted to run off to Mexico to see my mom and get my head straight and just like that I was on a plane to go see her. One way ticket. ‘Stay as long as you feel like you need to.’ he said. He would be waiting for me to come back to him. I spent a beautiful time with my mother and opened up to her about what was going on. She supported and accepted that I found someone so willing to not only take care of me but help me become the woman I strive to be. And I missed him. We kept in touch all day everyday and i never got sick of his messages. On the contrary, I would light up when I saw a message from him. I told him I was ready to come back and he sent me my ticket information. \n\nSeeing that man walk into the airport with his goofy smile was one of the best feelings I have had in such a long time. We had a long talk the next day and I can officially call myself a VERY appreciative spoiled girlfriend! And he is the best boyfriend a girl could ever ask for. I’m so sorry this is so long! I just wanted to share with people who would understand. Although this started the way it did, I can honestly say I care about and even Love this goofy, kinky, adorable man. \n\nTLDR found SA, got dumped by vanilla bf, had short SR with a paranoid metaphorical wife killer, met a silly man, fell in love? Idk fucking read it. Lol. \n\nDon’t give up. Don’t be so closed to the idea of being a SGF! You might be pleasantly surprised! And communication is KEY! \n\nEDIT: I just wanted to add something. I’ve been without a car for the last year. I’ve happily walked and taken the bus in that time. He text me saying he banged up his truck on the way home and of course I was more worried for his safety. He came up to me in bed and told me someone cut him off so he swerved into a pole... then he asked me if I wanted to check out the damage. I followed him to the garage and i was greeted by the car we went to look at a couple days ago with a beautiful bow sitting on the hood!!! That little stinker got me so good! My birthday is on Thursday and this is hands down the best birthday ever. It could have been a bike with a bow in there and he would have received the same tears! I can’t necessarily go posting all over about it no matter how bad I want to so I had to edit it in and celebrate with you guys! 😭❤️ ",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/ashbw7/im_in_love/",
    "score": 99,
    "upvote_ratio": 0.96,
    "created_utc": 1550621188.0,
    "num_comments": 37,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "So glad to hear that another two people are having better lives. And your story is quite touching.",
            "author": "AKA_Mr_X",
            "id": "egueycu",
            "parent_id": "t3_ashbw7",
            "score": 33,
            "created_utc": 1550624335.0,
            "replies": [
                {
                    "body": "Thank you for taking the time to read it! I hope I make him as happy as he makes me. 🥰",
                    "author": "pmmeyourpizzapix",
                    "id": "egugcmq",
                    "parent_id": "t1_egueycu",
                    "score": 6,
                    "created_utc": 1550625428.0,
                    "replies": [
                        {
                            "body": "🎵🎶🎵🎶🎶🎶🎵\n\n[Love’s in the air...](https://youtu.be/NNC0kIzM1Fo)  😁\n\n🎵🎶🎵🎶🎵🎵🎵",
                            "author": "AKA_Mr_X",
                            "id": "eguh0dj",
                            "parent_id": "t1_egugcmq",
                            "score": 4,
                            "created_utc": 1550625935.0,
                            "replies": [
                                {
                                    "body": "I danced in bed to that. 😊 thank you! ",
                                    "author": "pmmeyourpizzapix",
                                    "id": "eguh761",
                                    "parent_id": "t1_eguh0dj",
                                    "score": 3,
                                    "created_utc": 1550626079.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Had to read the whole thing. :)  SR's really can be so great for both partners, and such partnerships have existed throughout history.  So glad things are working well for you! ",
            "author": "HappyBear1952",
            "id": "egugvmj",
            "parent_id": "t3_ashbw7",
            "score": 12,
            "created_utc": 1550625834.0,
            "replies": [
                {
                    "body": "Thank you very much! I never imagined to have these feeling when I entered this world but I am so glad. ",
                    "author": "pmmeyourpizzapix",
                    "id": "egugyua",
                    "parent_id": "t1_egugvmj",
                    "score": 2,
                    "created_utc": 1550625903.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "egul6r0",
            "parent_id": "t3_ashbw7",
            "score": 9,
            "created_utc": 1550629114.0,
            "replies": [
                {
                    "body": "Aw! I’m sorry it has to come to an end but I’m happy you got to experience it! And now you know what you want for sure! I’m so grateful for what I’ve found and i can’t wait to see where it takes us. Best of luck on your next adventure babe! ❤️❤️ thank you for reading my story! ",
                    "author": "pmmeyourpizzapix",
                    "id": "eguo79z",
                    "parent_id": "t1_egul6r0",
                    "score": 3,
                    "created_utc": 1550631451.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "eguoeoa",
                            "parent_id": "t1_eguo79z",
                            "score": 4,
                            "created_utc": 1550631613.0,
                            "replies": [
                                {
                                    "body": "Don’t lose hope! Thank you for saying that! 😭😘",
                                    "author": "pmmeyourpizzapix",
                                    "id": "eguyzni",
                                    "parent_id": "t1_eguoeoa",
                                    "score": 2,
                                    "created_utc": 1550641092.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "[removed]",
            "author": null,
            "id": "egukzti",
            "parent_id": "t3_ashbw7",
            "score": 3,
            "created_utc": 1550628968.0,
            "replies": [
                {
                    "body": "Thank you!! ",
                    "author": "pmmeyourpizzapix",
                    "id": "egul0zw",
                    "parent_id": "t1_egukzti",
                    "score": 2,
                    "created_utc": 1550628993.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "It should come as no shock that I am fucking stoked for you. Congrats.",
            "author": null,
            "id": "egufmw8",
            "parent_id": "t3_ashbw7",
            "score": 4,
            "created_utc": 1550624875.0,
            "replies": [
                {
                    "body": "Thank you!! ",
                    "author": "pmmeyourpizzapix",
                    "id": "egugdn0",
                    "parent_id": "t1_egufmw8",
                    "score": 1,
                    "created_utc": 1550625450.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "eguq2vh",
            "parent_id": "t3_ashbw7",
            "score": 3,
            "created_utc": 1550632943.0,
            "replies": [
                {
                    "body": "Thank you!! He’s fantastical and I’m so thankful to be his and vice versa. 😊",
                    "author": "pmmeyourpizzapix",
                    "id": "eguz1sp",
                    "parent_id": "t1_eguq2vh",
                    "score": 2,
                    "created_utc": 1550641155.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "This is a great story and I'm very happy for you. \n\nMake sure you dont become too dependent on him if for some reason things end.  Use this as an opportunity to build a reserve and rebuild your independence and confidence.  \n\nIndepence and confidence are attractive characteristics that he should appreciate.  If not, that would tell you a lot about him and you will be better equipped for your next relationship.",
            "author": "willfromvb",
            "id": "egva71y",
            "parent_id": "t3_ashbw7",
            "score": 3,
            "created_utc": 1550657576.0,
            "replies": [
                {
                    "body": "Great advice. Thanks! 🙂",
                    "author": "pmmeyourpizzapix",
                    "id": "egvpk36",
                    "parent_id": "t1_egva71y",
                    "score": 1,
                    "created_utc": 1550674984.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Take it slow girl, you still might be in the rebound phase. You are equating his act of generosities as act of love and reciprocating. Enjoy though, it’s a good feeling to loved n cared for. ",
            "author": null,
            "id": "eguhtz5",
            "parent_id": "t3_ashbw7",
            "score": 4,
            "created_utc": 1550626562.0,
            "replies": [
                {
                    "body": "Thanks but I had a few rebounds. I am taking things slowly and have only asked for shampoo and conditioner. I am in the process of moving in and he gives what he wants and I accept it with very much appreciation. I feel very cared for and so much genuine love. ",
                    "author": "pmmeyourpizzapix",
                    "id": "egukbtm",
                    "parent_id": "t1_eguhtz5",
                    "score": 3,
                    "created_utc": 1550628467.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "May and December!",
            "author": null,
            "id": "egujyhh",
            "parent_id": "t3_ashbw7",
            "score": 1,
            "created_utc": 1550628181.0,
            "replies": [
                {
                    "body": "Come again? Lol\n\nEdit: googled it. I’m gonna take it as a compliment! Lol. Hey thanks! ",
                    "author": "pmmeyourpizzapix",
                    "id": "egujzwk",
                    "parent_id": "t1_egujyhh",
                    "score": 1,
                    "created_utc": 1550628210.0,
                    "replies": [
                        {
                            "body": "I prefer May and September. Congrats!",
                            "author": "HwdSD",
                            "id": "egup3vr",
                            "parent_id": "t1_egujzwk",
                            "score": 1,
                            "created_utc": 1550632175.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "  😥 😮 🤣😍 all in one!! congratulations on your new found happiness!   ",
            "author": "IAm2Legit2Sit",
            "id": "eguq955",
            "parent_id": "t3_ashbw7",
            "score": 1,
            "created_utc": 1550633080.0,
            "replies": [
                {
                    "body": "Thank you so much! ",
                    "author": "pmmeyourpizzapix",
                    "id": "eguz2jg",
                    "parent_id": "t1_eguq955",
                    "score": 2,
                    "created_utc": 1550641179.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "You are so lucky! I'm so happy for you! Good job girl. You did it.",
            "author": "sugarbabydreams3663",
            "id": "eguukxi",
            "parent_id": "t3_ashbw7",
            "score": 1,
            "created_utc": 1550636736.0,
            "replies": [
                {
                    "body": "I am pretty lucky! I am so glad I reached out to him when I did. Thank you! ",
                    "author": "pmmeyourpizzapix",
                    "id": "eguz42z",
                    "parent_id": "t1_eguukxi",
                    "score": 1,
                    "created_utc": 1550641225.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "congrats, lady. fee better soon! ",
            "author": "yikesmysexlife",
            "id": "eguulwo",
            "parent_id": "t3_ashbw7",
            "score": 1,
            "created_utc": 1550636762.0,
            "replies": [
                {
                    "body": "Thank you! He brought me soup and medicine! I’m starting to feel much better but I’m going to hit that NyQuil juuuuust to be sure! Lol. ",
                    "author": "pmmeyourpizzapix",
                    "id": "eguz5zg",
                    "parent_id": "t1_eguulwo",
                    "score": 3,
                    "created_utc": 1550641282.0,
                    "replies": [
                        {
                            "body": "Now THIS shows his real affection.  The car is nice and all, but it's the nurturing care he's giving you while you are sick that shows his true feelings. You two care deeply for each other.  It is rare in the bowl.  But when it does happen it is beautiful.  Thanks for filling my heart with warmth on a cold day!!! ",
                            "author": null,
                            "id": "egvdzay",
                            "parent_id": "t1_eguz5zg",
                            "score": 2,
                            "created_utc": 1550663716.0,
                            "replies": [
                                {
                                    "body": "He always asked me if I’ve eaten (still getting over an eating disorder), he makes sure to ask if I slept well, he calls to ask about my day, and so much more. And every time he’s come in the bedroom this morning he’s said guess what! Tomorrow’s your birthday!! Lol. He’s such a sweet goof and I love him very much. And I know a lot of people are saying to take things slow which we have but things have come so naturally for us. 😊❤️",
                                    "author": "pmmeyourpizzapix",
                                    "id": "egvpxpm",
                                    "parent_id": "t1_egvdzay",
                                    "score": 1,
                                    "created_utc": 1550675268.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "This is nice and makes me feel fuzzy\nCongrats good luck with your new relationship you both sound really good for each other",
            "author": "plussizefairy",
            "id": "egvjs5m",
            "parent_id": "t3_ashbw7",
            "score": 1,
            "created_utc": 1550670173.0,
            "replies": [
                {
                    "body": "Thank you! I hope other SBs find something similar at some point! It is beautiful! ",
                    "author": "pmmeyourpizzapix",
                    "id": "egvq4sq",
                    "parent_id": "t1_egvjs5m",
                    "score": 2,
                    "created_utc": 1550675415.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Congrats!",
            "author": "ThrowawaySD1000",
            "id": "eguj6st",
            "parent_id": "t3_ashbw7",
            "score": 0,
            "created_utc": 1550627600.0,
            "replies": [
                {
                    "body": "Thank you!! ",
                    "author": "pmmeyourpizzapix",
                    "id": "egujfc7",
                    "parent_id": "t1_eguj6st",
                    "score": 1,
                    "created_utc": 1550627776.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Dont get your hopes up, things are still new. Take it day by day. That being saud, very happy for you. Age difference? ",
            "author": "dade_murphy1",
            "id": "egui8n9",
            "parent_id": "t3_ashbw7",
            "score": -1,
            "created_utc": 1550626874.0,
            "replies": [
                {
                    "body": "Am half his age. I’m not getting my hopes up, just taking it day by day and enjoying the time I have with him. 😊 ",
                    "author": "pmmeyourpizzapix",
                    "id": "egujb2k",
                    "parent_id": "t1_egui8n9",
                    "score": 3,
                    "created_utc": 1550627689.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Love your story..! This is how sugar can definitely be sweeter sometimes... Congrats ;)",
            "author": "ruphun",
            "id": "egve2o9",
            "parent_id": "t3_ashbw7",
            "score": -1,
            "created_utc": 1550663844.0,
            "replies": [
                {
                    "body": "Thank you for reading it! I’ve found the sweetest sugar! 🧁",
                    "author": "pmmeyourpizzapix",
                    "id": "egvq2gn",
                    "parent_id": "t1_egve2o9",
                    "score": 1,
                    "created_utc": 1550675365.0,
                    "replies": [
                        {
                            "body": "You’re welcome! 😉",
                            "author": "ruphun",
                            "id": "egvqq5v",
                            "parent_id": "t1_egvq2gn",
                            "score": 2,
                            "created_utc": 1550675857.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Thank you for taking the time to read it! I hope I make him as happy as he makes me. 🥰",
            "author": "pmmeyourpizzapix",
            "id": "egugcmq",
            "parent_id": "t1_egueycu",
            "score": 6,
            "created_utc": 1550625428.0,
            "replies": [
                {
                    "body": "🎵🎶🎵🎶🎶🎶🎵\n\n[Love’s in the air...](https://youtu.be/NNC0kIzM1Fo)  😁\n\n🎵🎶🎵🎶🎵🎵🎵",
                    "author": "AKA_Mr_X",
                    "id": "eguh0dj",
                    "parent_id": "t1_egugcmq",
                    "score": 4,
                    "created_utc": 1550625935.0,
                    "replies": [
                        {
                            "body": "I danced in bed to that. 😊 thank you! ",
                            "author": "pmmeyourpizzapix",
                            "id": "eguh761",
                            "parent_id": "t1_eguh0dj",
                            "score": 3,
                            "created_utc": 1550626079.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Thank you very much! I never imagined to have these feeling when I entered this world but I am so glad. ",
            "author": "pmmeyourpizzapix",
            "id": "egugyua",
            "parent_id": "t1_egugvmj",
            "score": 2,
            "created_utc": 1550625903.0,
            "replies": []
        },
        {
            "body": "Aw! I’m sorry it has to come to an end but I’m happy you got to experience it! And now you know what you want for sure! I’m so grateful for what I’ve found and i can’t wait to see where it takes us. Best of luck on your next adventure babe! ❤️❤️ thank you for reading my story! ",
            "author": "pmmeyourpizzapix",
            "id": "eguo79z",
            "parent_id": "t1_egul6r0",
            "score": 3,
            "created_utc": 1550631451.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "eguoeoa",
                    "parent_id": "t1_eguo79z",
                    "score": 4,
                    "created_utc": 1550631613.0,
                    "replies": [
                        {
                            "body": "Don’t lose hope! Thank you for saying that! 😭😘",
                            "author": "pmmeyourpizzapix",
                            "id": "eguyzni",
                            "parent_id": "t1_eguoeoa",
                            "score": 2,
                            "created_utc": 1550641092.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Thank you!! ",
            "author": "pmmeyourpizzapix",
            "id": "egul0zw",
            "parent_id": "t1_egukzti",
            "score": 2,
            "created_utc": 1550628993.0,
            "replies": []
        },
        {
            "body": "Thank you!! ",
            "author": "pmmeyourpizzapix",
            "id": "egugdn0",
            "parent_id": "t1_egufmw8",
            "score": 1,
            "created_utc": 1550625450.0,
            "replies": []
        },
        {
            "body": "Thank you!! He’s fantastical and I’m so thankful to be his and vice versa. 😊",
            "author": "pmmeyourpizzapix",
            "id": "eguz1sp",
            "parent_id": "t1_eguq2vh",
            "score": 2,
            "created_utc": 1550641155.0,
            "replies": []
        },
        {
            "body": "Great advice. Thanks! 🙂",
            "author": "pmmeyourpizzapix",
            "id": "egvpk36",
            "parent_id": "t1_egva71y",
            "score": 1,
            "created_utc": 1550674984.0,
            "replies": []
        },
        {
            "body": "Thanks but I had a few rebounds. I am taking things slowly and have only asked for shampoo and conditioner. I am in the process of moving in and he gives what he wants and I accept it with very much appreciation. I feel very cared for and so much genuine love. ",
            "author": "pmmeyourpizzapix",
            "id": "egukbtm",
            "parent_id": "t1_eguhtz5",
            "score": 3,
            "created_utc": 1550628467.0,
            "replies": []
        },
        {
            "body": "Come again? Lol\n\nEdit: googled it. I’m gonna take it as a compliment! Lol. Hey thanks! ",
            "author": "pmmeyourpizzapix",
            "id": "egujzwk",
            "parent_id": "t1_egujyhh",
            "score": 1,
            "created_utc": 1550628210.0,
            "replies": [
                {
                    "body": "I prefer May and September. Congrats!",
                    "author": "HwdSD",
                    "id": "egup3vr",
                    "parent_id": "t1_egujzwk",
                    "score": 1,
                    "created_utc": 1550632175.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Thank you so much! ",
            "author": "pmmeyourpizzapix",
            "id": "eguz2jg",
            "parent_id": "t1_eguq955",
            "score": 2,
            "created_utc": 1550641179.0,
            "replies": []
        },
        {
            "body": "I am pretty lucky! I am so glad I reached out to him when I did. Thank you! ",
            "author": "pmmeyourpizzapix",
            "id": "eguz42z",
            "parent_id": "t1_eguukxi",
            "score": 1,
            "created_utc": 1550641225.0,
            "replies": []
        },
        {
            "body": "Thank you! He brought me soup and medicine! I’m starting to feel much better but I’m going to hit that NyQuil juuuuust to be sure! Lol. ",
            "author": "pmmeyourpizzapix",
            "id": "eguz5zg",
            "parent_id": "t1_eguulwo",
            "score": 3,
            "created_utc": 1550641282.0,
            "replies": [
                {
                    "body": "Now THIS shows his real affection.  The car is nice and all, but it's the nurturing care he's giving you while you are sick that shows his true feelings. You two care deeply for each other.  It is rare in the bowl.  But when it does happen it is beautiful.  Thanks for filling my heart with warmth on a cold day!!! ",
                    "author": null,
                    "id": "egvdzay",
                    "parent_id": "t1_eguz5zg",
                    "score": 2,
                    "created_utc": 1550663716.0,
                    "replies": [
                        {
                            "body": "He always asked me if I’ve eaten (still getting over an eating disorder), he makes sure to ask if I slept well, he calls to ask about my day, and so much more. And every time he’s come in the bedroom this morning he’s said guess what! Tomorrow’s your birthday!! Lol. He’s such a sweet goof and I love him very much. And I know a lot of people are saying to take things slow which we have but things have come so naturally for us. 😊❤️",
                            "author": "pmmeyourpizzapix",
                            "id": "egvpxpm",
                            "parent_id": "t1_egvdzay",
                            "score": 1,
                            "created_utc": 1550675268.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Thank you! I hope other SBs find something similar at some point! It is beautiful! ",
            "author": "pmmeyourpizzapix",
            "id": "egvq4sq",
            "parent_id": "t1_egvjs5m",
            "score": 2,
            "created_utc": 1550675415.0,
            "replies": []
        },
        {
            "body": "Thank you!! ",
            "author": "pmmeyourpizzapix",
            "id": "egujfc7",
            "parent_id": "t1_eguj6st",
            "score": 1,
            "created_utc": 1550627776.0,
            "replies": []
        },
        {
            "body": "Am half his age. I’m not getting my hopes up, just taking it day by day and enjoying the time I have with him. 😊 ",
            "author": "pmmeyourpizzapix",
            "id": "egujb2k",
            "parent_id": "t1_egui8n9",
            "score": 3,
            "created_utc": 1550627689.0,
            "replies": []
        },
        {
            "body": "Thank you for reading it! I’ve found the sweetest sugar! 🧁",
            "author": "pmmeyourpizzapix",
            "id": "egvq2gn",
            "parent_id": "t1_egve2o9",
            "score": 1,
            "created_utc": 1550675365.0,
            "replies": [
                {
                    "body": "You’re welcome! 😉",
                    "author": "ruphun",
                    "id": "egvqq5v",
                    "parent_id": "t1_egvq2gn",
                    "score": 2,
                    "created_utc": 1550675857.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "🎵🎶🎵🎶🎶🎶🎵\n\n[Love’s in the air...](https://youtu.be/NNC0kIzM1Fo)  😁\n\n🎵🎶🎵🎶🎵🎵🎵",
            "author": "AKA_Mr_X",
            "id": "eguh0dj",
            "parent_id": "t1_egugcmq",
            "score": 4,
            "created_utc": 1550625935.0,
            "replies": [
                {
                    "body": "I danced in bed to that. 😊 thank you! ",
                    "author": "pmmeyourpizzapix",
                    "id": "eguh761",
                    "parent_id": "t1_eguh0dj",
                    "score": 3,
                    "created_utc": 1550626079.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "eguoeoa",
            "parent_id": "t1_eguo79z",
            "score": 4,
            "created_utc": 1550631613.0,
            "replies": [
                {
                    "body": "Don’t lose hope! Thank you for saying that! 😭😘",
                    "author": "pmmeyourpizzapix",
                    "id": "eguyzni",
                    "parent_id": "t1_eguoeoa",
                    "score": 2,
                    "created_utc": 1550641092.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I prefer May and September. Congrats!",
            "author": "HwdSD",
            "id": "egup3vr",
            "parent_id": "t1_egujzwk",
            "score": 1,
            "created_utc": 1550632175.0,
            "replies": []
        },
        {
            "body": "Now THIS shows his real affection.  The car is nice and all, but it's the nurturing care he's giving you while you are sick that shows his true feelings. You two care deeply for each other.  It is rare in the bowl.  But when it does happen it is beautiful.  Thanks for filling my heart with warmth on a cold day!!! ",
            "author": null,
            "id": "egvdzay",
            "parent_id": "t1_eguz5zg",
            "score": 2,
            "created_utc": 1550663716.0,
            "replies": [
                {
                    "body": "He always asked me if I’ve eaten (still getting over an eating disorder), he makes sure to ask if I slept well, he calls to ask about my day, and so much more. And every time he’s come in the bedroom this morning he’s said guess what! Tomorrow’s your birthday!! Lol. He’s such a sweet goof and I love him very much. And I know a lot of people are saying to take things slow which we have but things have come so naturally for us. 😊❤️",
                    "author": "pmmeyourpizzapix",
                    "id": "egvpxpm",
                    "parent_id": "t1_egvdzay",
                    "score": 1,
                    "created_utc": 1550675268.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "You’re welcome! 😉",
            "author": "ruphun",
            "id": "egvqq5v",
            "parent_id": "t1_egvq2gn",
            "score": 2,
            "created_utc": 1550675857.0,
            "replies": []
        },
        {
            "body": "I danced in bed to that. 😊 thank you! ",
            "author": "pmmeyourpizzapix",
            "id": "eguh761",
            "parent_id": "t1_eguh0dj",
            "score": 3,
            "created_utc": 1550626079.0,
            "replies": []
        },
        {
            "body": "Don’t lose hope! Thank you for saying that! 😭😘",
            "author": "pmmeyourpizzapix",
            "id": "eguyzni",
            "parent_id": "t1_eguoeoa",
            "score": 2,
            "created_utc": 1550641092.0,
            "replies": []
        },
        {
            "body": "He always asked me if I’ve eaten (still getting over an eating disorder), he makes sure to ask if I slept well, he calls to ask about my day, and so much more. And every time he’s come in the bedroom this morning he’s said guess what! Tomorrow’s your birthday!! Lol. He’s such a sweet goof and I love him very much. And I know a lot of people are saying to take things slow which we have but things have come so naturally for us. 😊❤️",
            "author": "pmmeyourpizzapix",
            "id": "egvpxpm",
            "parent_id": "t1_egvdzay",
            "score": 1,
            "created_utc": 1550675268.0,
            "replies": []
        }
    ]
}