{
    "title": "8 month Results w/ Finasteride & Minoxidil",
    "post_id": "oo2m7m",
    "post_url": "https://www.reddit.com/r/malehairadvice/comments/oo2m7m/8_month_results_w_finasteride_minoxidil/",
    "author": "zacboring",
    "body": "",
    "url": "https://www.reddit.com/gallery/oo2m7m",
    "score": 977,
    "upvote_ratio": 0.99,
    "created_utc": 1626789679.0,
    "num_comments": 105,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "I tried to keep track of the days to be more precise, but I lost count around month 5. But yeah, a lot of you have been asking for an update— so here it is!\n\nMy findings:\n\n1. This stuff actually works if you start early enough and commit to taking it every day. \n\n2. Erectile dysfunction is NOT guaranteed. Never happened to me, but I know that risk is a major deterrent to a lot of people. \n\n3. Your hair will grow back (to varying extent), but it will never be the same as it was before. My coverage is pretty *decent* now but the texture is a bit odd, and the actual quality of the regrown hairs isn’t fantastic. The fibers are thin, slightly frizzy, and seem to not like growing past 5in in length (at least in my case).\n\n4. Despite all the new growth; my hair looks horrible when it’s wet. Showers, pools, and getting caught in the rain are all slight fears of mine if others are around. \n\n5. It feels amazing to not be forced to plan outfits around what hats I have available. For the first time in two years I feel comfortable going outside uncovered and it’s sooooo nice. \n\nAnd yes, before any of you ask— my eyebrows ARE different but it’s the same guy in both photos, I promise (I started coloring them with beard dye because no matter what the insecurities never end, haha).",
            "author": "zacboring",
            "id": "h5vllgh",
            "parent_id": "t3_oo2m7m",
            "score": 159,
            "created_utc": 1626790733.0,
            "replies": [
                {
                    "body": "Holy shit dude that was a drastic change! Congrats on the progress!\n\nIs this a lasting effect or do you have to continue taking the drugs?",
                    "author": "Bektus",
                    "id": "h5vteoa",
                    "parent_id": "t1_h5vllgh",
                    "score": 68,
                    "created_utc": 1626794144.0,
                    "replies": [
                        {
                            "body": "Fin is a one way trip or crash. And if you mess up your daily intake you can squander your progress. Minox you can leave it once you have enough. Everybody leave it at some point because it always have sides, and unlike finn sides that go away in a week or two, minox are constant and annoying.",
                            "author": "DarkGhost999",
                            "id": "h5vuztx",
                            "parent_id": "t1_h5vteoa",
                            "score": 21,
                            "created_utc": 1626794810.0,
                            "replies": [
                                {
                                    "body": "What do u mean by sides?",
                                    "author": "Neosam718",
                                    "id": "h5w2br0",
                                    "parent_id": "t1_h5vuztx",
                                    "score": 11,
                                    "created_utc": 1626797847.0,
                                    "replies": [
                                        {
                                            "body": "Minox can have little annoying side effects that stack up and makes you leave it, first and foremost dry scalp, headaches, growing of unwanted hair in your face (probably because you touch your face and still have the substance) and if you are old of age you could feel palpitations in your heart. This is a vasodilator so it makes sense. Those are the common ones that you eventually develop, one, two, all of them, or new ones that no one saw coming. I think minox is better for the people who want to grow a beard, because that hair is permanent, so you take a year or two and leave it.\n\nFin sides depend mostly on your life. I felt sexual undesire for 2 weeks, then it left, months later I felt and increase in sexual desire but probably was because I started exercising hard. Some people feel various things, but most realistically, if you are a sad anxious balding man living a life going downhill and then you take something like fin and expect results in a month, you will probably pin every litle thing your feel to the drug, and it will be a lot of them because you will be hyper aware. Fin can also develop ginecomastia if you are kinda on the fatty side of the family, eat shit and don't move a muscle.",
                                            "author": "DarkGhost999",
                                            "id": "h5w560z",
                                            "parent_id": "t1_h5w2br0",
                                            "score": 20,
                                            "created_utc": 1626799013.0,
                                            "replies": [
                                                {
                                                    "body": "Thank you so much for the reply, i personally have a bold patch in my beard that kills the look of it and I'm a little hesitant on the idea if using Min but I'm not sure if I have any other options. Btw are side effects temporary or would they stick around for good?",
                                                    "author": "Neosam718",
                                                    "id": "h5wbsyk",
                                                    "parent_id": "t1_h5w560z",
                                                    "score": 3,
                                                    "created_utc": 1626801763.0,
                                                    "replies": [
                                                        {
                                                            "body": "There are no permanent side effects from minox, the substance effect last 12 hours (hence why twice a day max for faster, not \"better\", just faster results) and from there everything starts to go. The only permanent side effect of minox that I know of is a one in a trillion case of a hyper-responder guy who also had a rare medical condition and despite this he kept using unknown amounts of minox for a long time, the results were... lovecraftian. You better not know. I shouldn't even mention it because its extremely rare, but its in my knowledge and I can't lie.",
                                                            "author": "DarkGhost999",
                                                            "id": "h5we48n",
                                                            "parent_id": "t1_h5wbsyk",
                                                            "score": 8,
                                                            "created_utc": 1626802733.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "body": "I’ve been on minox for about 3 months and the only side effect I felt was the headaches, but they went away after a few weeks. Started finasteride about a week ago and the headaches are about the same as I felt with minox. I just know they’re side effects I gotta deal with for a bit and they’ll go away. Also my endocrinologist told me finasteride can effect your liver, but since I get my blood work checked regularly, she gave me the green light to take the medication as i am healthy. Just a little heads up in case any of y’all have any liver issues.",
                                                    "author": "NerfNerd94",
                                                    "id": "hqslmxy",
                                                    "parent_id": "t1_h5w560z",
                                                    "score": 2,
                                                    "created_utc": 1641033781.0,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "body": "Sadly min always gave me a headache and increased my tinnitus",
                                            "author": "gin-o-cide",
                                            "id": "h5w7hed",
                                            "parent_id": "t1_h5w2br0",
                                            "score": 4,
                                            "created_utc": 1626799970.0,
                                            "replies": [
                                                {
                                                    "body": "oh man I have tinnitus too. I feel you man. Across time and space.",
                                                    "author": "DarkGhost999",
                                                    "id": "h5w8olm",
                                                    "parent_id": "t1_h5w7hed",
                                                    "score": 3,
                                                    "created_utc": 1626800467.0,
                                                    "replies": [
                                                        {
                                                            "body": "Stay strong brother. Remember, anxiety makes it worse!",
                                                            "author": "gin-o-cide",
                                                            "id": "h5w9tq5",
                                                            "parent_id": "t1_h5w8olm",
                                                            "score": 7,
                                                            "created_utc": 1626800943.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                },
                                                {
                                                    "body": "A lot of tinnitus is low b vitamins. Take a super B supplement (one with at least 6 different types of vitamin b) and give it six weeks.",
                                                    "author": "TacoT1000",
                                                    "id": "h93qme9",
                                                    "parent_id": "t1_h5w7hed",
                                                    "score": 3,
                                                    "created_utc": 1629077749.0,
                                                    "replies": [
                                                        {
                                                            "body": "People like you are the worst.",
                                                            "author": "lars_jeppesen",
                                                            "id": "i34h071",
                                                            "parent_id": "t1_h93qme9",
                                                            "score": 0,
                                                            "created_utc": 1648917229.0,
                                                            "replies": []
                                                        },
                                                        {
                                                            "body": "Can confirm this isn’t the cause for me 🥲",
                                                            "author": "kbizz92",
                                                            "id": "jfgvuyx",
                                                            "parent_id": "t1_h93qme9",
                                                            "score": 1,
                                                            "created_utc": 1680975130.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "body": "this comment would be like 30x easier to read if you actually wrote out the full words you're trying to say...",
                                    "author": "Koiq",
                                    "id": "h5xnhj9",
                                    "parent_id": "t1_h5vuztx",
                                    "score": 6,
                                    "created_utc": 1626822449.0,
                                    "replies": [
                                        {
                                            "body": "You just aren’t in the hair game bro, need to brush up on the vernacular. Hahaha",
                                            "author": "TinyEyedTim",
                                            "id": "h6yunz9",
                                            "parent_id": "t1_h5xnhj9",
                                            "score": 1,
                                            "created_utc": 1627573441.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "I started using min and fin .. and no from no hair for 15 yrs to shit ton of peach fuzzy hair",
                                    "author": "redbullf1fan2017",
                                    "id": "h8m2dih",
                                    "parent_id": "t1_h5vuztx",
                                    "score": 2,
                                    "created_utc": 1628739123.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "If the dates are accurate then that's day 242!\n\nCongratulations!",
                    "author": "isarl",
                    "id": "h5wxwr2",
                    "parent_id": "t1_h5vllgh",
                    "score": 10,
                    "created_utc": 1626811073.0,
                    "replies": [
                        {
                            "body": "Thank you! I’m horrible at math",
                            "author": "zacboring",
                            "id": "h5x4a2d",
                            "parent_id": "t1_h5wxwr2",
                            "score": 7,
                            "created_utc": 1626813783.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Think you'll use transplants to fill out the hair? I think you're an excellent candidate for it to reverse almost all your loss.",
                    "author": "salgat",
                    "id": "h5xkdfl",
                    "parent_id": "t1_h5vllgh",
                    "score": 7,
                    "created_utc": 1626820979.0,
                    "replies": [
                        {
                            "body": "I’d honestly like to in the future if I can afford it. It’s still a bit thin in the crown, and I’d like the hairline to be a tad fuller. But we’ll see! I’m certainly not upset with the results I’ve gotten!",
                            "author": "zacboring",
                            "id": "h5xnsyf",
                            "parent_id": "t1_h5xkdfl",
                            "score": 5,
                            "created_utc": 1626822601.0,
                            "replies": [
                                {
                                    "body": "What’s the cost per filled prescription (per month?) each?  Does insurance cover any of it? I don’t want to go broke but thinking of trying this combo. Thanks. Appreciate the updates.",
                                    "author": "Content-Box-7526",
                                    "id": "jfs74sw",
                                    "parent_id": "t1_h5xnsyf",
                                    "score": 1,
                                    "created_utc": 1681182249.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "I’d say the quality of the new hair is pretty damn good! I mean it looks like you got a hair transplant for Christ sakes",
                    "author": "LankyDinner5982",
                    "id": "i6myvgl",
                    "parent_id": "t1_h5vllgh",
                    "score": 4,
                    "created_utc": 1651215340.0,
                    "replies": []
                },
                {
                    "body": "For #3. Do you mean grow back from \"before it naturally started balding\" or do you mean to grow back from the shedding period?",
                    "author": "ihopeshelovedme",
                    "id": "hzx08jw",
                    "parent_id": "t1_h5vllgh",
                    "score": 3,
                    "created_utc": 1646789662.0,
                    "replies": [
                        {
                            "body": "Before it started balding, I guess? I dunno, the two are kinda the same stage in my mind",
                            "author": "zacboring",
                            "id": "hzxe86r",
                            "parent_id": "t1_hzx08jw",
                            "score": 5,
                            "created_utc": 1646796003.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Good lord, this has to be one of the best transformations I’ve ever seen.\n\nWell done!",
            "author": "evosaintx",
            "id": "h5wqzjy",
            "parent_id": "t3_oo2m7m",
            "score": 40,
            "created_utc": 1626808164.0,
            "replies": [
                {
                    "body": "Thank you!",
                    "author": "zacboring",
                    "id": "h5x4czs",
                    "parent_id": "t1_h5wqzjy",
                    "score": 8,
                    "created_utc": 1626813818.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "You went from David Harbour to Miles Teller!",
            "author": "Markedwards54",
            "id": "h5x2bq0",
            "parent_id": "t3_oo2m7m",
            "score": 27,
            "created_utc": 1626812947.0,
            "replies": [
                {
                    "body": "With a hint of Tarantino IMO.",
                    "author": null,
                    "id": "h5x4nvv",
                    "parent_id": "t1_h5x2bq0",
                    "score": 13,
                    "created_utc": 1626813944.0,
                    "replies": [
                        {
                            "body": "Quentin Hairantino",
                            "author": "masnaer",
                            "id": "h5xsszx",
                            "parent_id": "t1_h5x4nvv",
                            "score": 11,
                            "created_utc": 1626825018.0,
                            "replies": []
                        },
                        {
                            "body": "I see that, too, with a hint of Ewan McGregor.",
                            "author": "FiveMileDammit",
                            "id": "h5xa717",
                            "parent_id": "t1_h5x4nvv",
                            "score": 3,
                            "created_utc": 1626816333.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "😂😂😂",
                    "author": "zacboring",
                    "id": "h5x472r",
                    "parent_id": "t1_h5x2bq0",
                    "score": 4,
                    "created_utc": 1626813748.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Lost 15 years in 240 days, nice",
            "author": "hardthumbs",
            "id": "h5xp1o3",
            "parent_id": "t3_oo2m7m",
            "score": 12,
            "created_utc": 1626823193.0,
            "replies": []
        },
        {
            "body": "Oral min?",
            "author": "Frosty-Foot4203",
            "id": "h5vyqgq",
            "parent_id": "t3_oo2m7m",
            "score": 12,
            "created_utc": 1626796356.0,
            "replies": [
                {
                    "body": "Topical. Liquid form in a eye-dropper, and I rub it on my scalp 1-2x per day",
                    "author": "zacboring",
                    "id": "h5w7685",
                    "parent_id": "t1_h5vyqgq",
                    "score": 9,
                    "created_utc": 1626799841.0,
                    "replies": [
                        {
                            "body": "Did you also add min to the front, where hair recedes for most people or just the back / top?",
                            "author": "emotionally_tipsy",
                            "id": "h68wz0s",
                            "parent_id": "t1_h5w7685",
                            "score": 2,
                            "created_utc": 1627047591.0,
                            "replies": [
                                {
                                    "body": "I put it all over the top of my head. It says to only use it on the crown, but it has worked for me so far. It definitely helped my hairline thicken up",
                                    "author": "zacboring",
                                    "id": "h68z36q",
                                    "parent_id": "t1_h68wz0s",
                                    "score": 3,
                                    "created_utc": 1627048609.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "That's some big progress, mate. Congrats!\n\nI get that a random stranger likely won't comment away your insecurities, but I wouldn't stress about getting it wet and the rest. Very few people look good with their wet and I've seen people with much worse hair and never judged (and I'm the sort of bad person to have a quiet conversation with friend later if someone looks odd).",
            "author": "FatBrah",
            "id": "h5w2tff",
            "parent_id": "t3_oo2m7m",
            "score": 19,
            "created_utc": 1626798046.0,
            "replies": [
                {
                    "body": "Thank you! I appreciate it! I certainly can’t complain, I’d rather have weird wet hair than no hair at all. Haha",
                    "author": "zacboring",
                    "id": "h5w7jl4",
                    "parent_id": "t1_h5w2tff",
                    "score": 6,
                    "created_utc": 1626799997.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "From serial killer to 90’s teen movie character.",
            "author": "monsieurpommefrites",
            "id": "h5yvnps",
            "parent_id": "t3_oo2m7m",
            "score": 8,
            "created_utc": 1626845095.0,
            "replies": [
                {
                    "body": "😂",
                    "author": "zacboring",
                    "id": "h5zzizd",
                    "parent_id": "t1_h5yvnps",
                    "score": 3,
                    "created_utc": 1626873264.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "How can I give this more than One upvote ?",
            "author": "Carlitoris",
            "id": "h5w6ih9",
            "parent_id": "t3_oo2m7m",
            "score": 15,
            "created_utc": 1626799570.0,
            "replies": [
                {
                    "body": "❤️",
                    "author": "zacboring",
                    "id": "h5w7ma3",
                    "parent_id": "t1_h5w6ih9",
                    "score": 2,
                    "created_utc": 1626800027.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "You look like a  handsome Quentin Tarantino.",
            "author": "ramzzrulezz",
            "id": "h60t984",
            "parent_id": "t3_oo2m7m",
            "score": 7,
            "created_utc": 1626886337.0,
            "replies": [
                {
                    "body": "I’ve received this comparison several times, but never with “handsome” preceding it. I’m shocked— but honored",
                    "author": "zacboring",
                    "id": "h60xild",
                    "parent_id": "t1_h60t984",
                    "score": 2,
                    "created_utc": 1626888106.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I am so happy you posted this! So many are so scared to start treatment and permanently loose their hair. Hopefully this is enough encouragement.",
            "author": "panmines",
            "id": "h5yadyg",
            "parent_id": "t3_oo2m7m",
            "score": 6,
            "created_utc": 1626833537.0,
            "replies": [
                {
                    "body": "No problem! And I totally agree, there’s a lot of fear and confusion around these options. I had so many people telling me to just shave my head and get over it. It was super depressing. I’m glad I decided to try it, but upset I waited so long. I probably could’ve saved all of my density if I started back in 2017",
                    "author": "zacboring",
                    "id": "h5ydnnc",
                    "parent_id": "t1_h5yadyg",
                    "score": 3,
                    "created_utc": 1626835141.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "This is why I don't like the whole \" if you're balding just shave it all off\" advice. Even with a ball spot on the top and thinning, you can still great.",
            "author": "daybreakin",
            "id": "h62iwat",
            "parent_id": "t3_oo2m7m",
            "score": 6,
            "created_utc": 1626913584.0,
            "replies": []
        },
        {
            "body": "Do you have a pic of the top of your head?",
            "author": "LongjumpingAd9719",
            "id": "h5w2r99",
            "parent_id": "t3_oo2m7m",
            "score": 9,
            "created_utc": 1626798023.0,
            "replies": [
                {
                    "body": "If you swipe over it’s the second image",
                    "author": "zacboring",
                    "id": "h5w7azs",
                    "parent_id": "t1_h5w2r99",
                    "score": 8,
                    "created_utc": 1626799896.0,
                    "replies": [
                        {
                            "body": "On I see. Great result! Looks good.",
                            "author": "LongjumpingAd9719",
                            "id": "h5xuy1x",
                            "parent_id": "t1_h5w7azs",
                            "score": 3,
                            "created_utc": 1626826066.0,
                            "replies": [
                                {
                                    "body": "Thank you!",
                                    "author": "zacboring",
                                    "id": "h5xxcgk",
                                    "parent_id": "t1_h5xuy1x",
                                    "score": 2,
                                    "created_utc": 1626827241.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Do I have to go through a dermatologist or specialist to get this?  Ive been using Bosley for about two months now with the foam so it’s too early to really see results.",
            "author": "Artrock80",
            "id": "h5wglgt",
            "parent_id": "t3_oo2m7m",
            "score": 3,
            "created_utc": 1626803769.0,
            "replies": [
                {
                    "body": "Dermatologist for Finasteride, Walmart for the Minoxidil. I got a consultation through an app!",
                    "author": "zacboring",
                    "id": "h5x4jwr",
                    "parent_id": "t1_h5wglgt",
                    "score": 6,
                    "created_utc": 1626813898.0,
                    "replies": [
                        {
                            "body": "Which app? Do you need a SSN to get a prescription?",
                            "author": "RandmTask",
                            "id": "huezr2m",
                            "parent_id": "t1_h5x4jwr",
                            "score": 2,
                            "created_utc": 1643272506.0,
                            "replies": [
                                {
                                    "body": "I used HeyDoctor, but I don’t think it exists anymore (I think it was bought out by GoodRX). I can’t remember if I had to give a SSN, but I did have to send a photo of my ID on the app to prove that I was a real person",
                                    "author": "zacboring",
                                    "id": "hufqk2j",
                                    "parent_id": "t1_huezr2m",
                                    "score": 2,
                                    "created_utc": 1643290767.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "Any doctor including a general practitioner can prescribe finasteride. Ask for 5mg pills that you will use a pill cutter to quarter them. Generic 5mg is like $12 at Walmart for a 4 month supply.",
                    "author": "salgat",
                    "id": "h5ydz4q",
                    "parent_id": "t1_h5wglgt",
                    "score": 2,
                    "created_utc": 1626835300.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Looks like a different guy different colour eyebrows",
            "author": "Beestieboy1992",
            "id": "h5x96tt",
            "parent_id": "t3_oo2m7m",
            "score": 2,
            "created_utc": 1626815888.0,
            "replies": []
        },
        {
            "body": "amazing, congrats!",
            "author": "zinarayr",
            "id": "h5xbht4",
            "parent_id": "t3_oo2m7m",
            "score": 2,
            "created_utc": 1626816915.0,
            "replies": []
        },
        {
            "body": "Looking sick my man",
            "author": "Zombiethrowawaygo",
            "id": "h5xuq01",
            "parent_id": "t3_oo2m7m",
            "score": 2,
            "created_utc": 1626825952.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "h6uh54t",
            "parent_id": "t3_oo2m7m",
            "score": 2,
            "created_utc": 1627489270.0,
            "replies": [
                {
                    "body": "Yeah, that video is from 2016 before my hair started falling out. Started with a tiny bald patch at my crown around August of 2016 and spread from there until we reached the photo on the left. It’s crazy what poor genetics and stress can do to your body in just 4 years",
                    "author": "zacboring",
                    "id": "h6uhvbn",
                    "parent_id": "t1_h6uh54t",
                    "score": 1,
                    "created_utc": 1627489563.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "h6uklbs",
                            "parent_id": "t1_h6uhvbn",
                            "score": 1,
                            "created_utc": 1627490666.0,
                            "replies": [
                                {
                                    "body": "That photo was taken in a car at a low angle to strategically hide a thinning hairline and a bald patch in the back. I knew what angles I could use to cover it, I was FAR from a full head of hair. Genetics caused the slow thinning from 2016-2019, but 2020 brought the stress-induced hairloss in large chunks. Leading to my “before” photos back in November. \n\nI totally understand your skepticism, I probably wouldn’t believe it either. But all of those photos are clearly taken in the same room, and I’ve been taking two different medications, vitamins, and derma-rolling for 8 months now and was lucky enough to restore my hair back to how it was in 2018 (if I started earlier I probably could’ve fully reversed it). I’m at work at the moment, but once I’m home I’ll find some screen grabs from a video project I’ve been shooting for the last few years and we have some scenes where we failed to cover my bald spots. You’d be surprised how quickly my coverage went downhill",
                                    "author": "zacboring",
                                    "id": "h6ur2j3",
                                    "parent_id": "t1_h6uklbs",
                                    "score": 2,
                                    "created_utc": 1627493318.0,
                                    "replies": [
                                        {
                                            "body": "Did the mods delete this, or did he?",
                                            "author": "zacboring",
                                            "id": "h6w1mvl",
                                            "parent_id": "t1_h6ur2j3",
                                            "score": 1,
                                            "created_utc": 1627513345.0,
                                            "replies": [
                                                {
                                                    "body": "What did he say?\n\n\nNot related but you should post this on r/Tressless.",
                                                    "author": "cobaltorange",
                                                    "id": "h6w6ui6",
                                                    "parent_id": "t1_h6w1mvl",
                                                    "score": 1,
                                                    "created_utc": 1627515857.0,
                                                    "replies": [
                                                        {
                                                            "body": "He was saying he didn’t believe the pictures were the same person and was asking for more proof, essentially. \n\nI totally forgot about that subreddit. I used to check it a few years back but had to stop because it was bumming me out. A lot of negativity over there at the time, if I remember correctly. Might have to look into it again",
                                                            "author": "zacboring",
                                                            "id": "h6x10cv",
                                                            "parent_id": "t1_h6w6ui6",
                                                            "score": 1,
                                                            "created_utc": 1627531074.0,
                                                            "replies": []
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Omg yasssssss 🤩🥳🤩🥳🤩🥳🤩🥳🤩🥳",
            "author": "stacececey",
            "id": "h8px201",
            "parent_id": "t3_oo2m7m",
            "score": 2,
            "created_utc": 1628811971.0,
            "replies": []
        },
        {
            "body": "Man I just started a few weeks ago, and while it isn't as extreme, I hope I get similar results that you got. Because that looks great and gives me hope haha. Congrats!",
            "author": null,
            "id": "h9rn1zj",
            "parent_id": "t3_oo2m7m",
            "score": 2,
            "created_utc": 1629533767.0,
            "replies": [
                {
                    "body": "Thank you! Good luck with everything! It took me about 3 or 4 months to notice any results, so just hang in there! And don’t forget to take pictures, it’ll help you keep track",
                    "author": "zacboring",
                    "id": "h9shnc4",
                    "parent_id": "t1_h9rn1zj",
                    "score": 2,
                    "created_utc": 1629555409.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Impressive man!  You're 25 though?  Man it's crazy how much older hair loss makes people look.  You look great now though.  I'm 34 and am just now noticing a slight thinning in the vertex of my scalp mostly, I have started minoxidil and am strongly considering trying finasteride (applied topically though just to reduce DHT build up in the scalp, not reduce its other positive functions in other parts of the body).  Have you tried using it topically or do you just take it orally?  Great pics and thanks so much for all of the info!",
            "author": "YakuzaDemon13",
            "id": "igps5ot",
            "parent_id": "t3_oo2m7m",
            "score": 2,
            "created_utc": 1658191318.0,
            "replies": [
                {
                    "body": "I’ve actually never tried the topical Finasteride (only topical Minoxidil), but I’ve heard that some people prefer it!  I just take the 1mg pill once per day. The sooner you start something the better though!",
                    "author": "zacboring",
                    "id": "igqby0p",
                    "parent_id": "t1_igps5ot",
                    "score": 1,
                    "created_utc": 1658200297.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Hey, I know this post is old but I'd definitely try microneedling if you haven't already. It's been shown to increase hair regrowth two-fold. It can give you much thicker regrowth than with just minoxidil. It works great for non-responders or those who get underwhelming results from min alone. Therefore, it could work even better for hyper-responders. You should get a dermapen with 12-pin cartridges at 1-1.5mm depths at a 1x a week to once every other week frequency. You can decrease the frequency after you've been doing it for a while. Anecdotally, microneedling results can stay around a lot longer than min results and (possibly) keep min assisted hairs around even if you quit min. Take the previous sentence with a grain of salt but there are several examples online of significant microneedling results, with and without min.  Though it usually takes longer than min (up to 6-12 months), the outcome could last a lot longer; ostensibly 2-7 years, the average length of a growth cycle. Though you should do your own research before trying any alternative methods, I'd highly consider it as someone who has greatly benefited from it. You should check out More Plates More Dates on Youtube for highly detailed and scientific advice on this matter, and as well as the myriad examples on r/tressless.",
            "author": "poppedcornea",
            "id": "iwrcfff",
            "parent_id": "t3_oo2m7m",
            "score": 2,
            "created_utc": 1668714256.0,
            "replies": [
                {
                    "body": "Thank you! I actually was micro needling quite a bit at the start, but I’ve really gotten lazy with it the last few months. Definitely hopping back on",
                    "author": "zacboring",
                    "id": "ix3rw3r",
                    "parent_id": "t1_iwrcfff",
                    "score": 1,
                    "created_utc": 1668957207.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Hey man I know this is old thread but for the frizzy and undesirable feel of your hair. when I first started trying to get my hair back I put on a solution of BENTONITE CLAY, ALOE GEL, and APPLE CIDER VINEGAR (I’m sure you can find a recipe online) Rubbed in in my hair and let it sit for half and hour. It made my hair incredibly smooth and silky. The apple cider vinegar smelled a bit when I sweat but just wash it out good. Just started my Finasteride and minoxidil journey and ordered a derma roller .5mm…. Can’t wait to see",
            "author": "Stewz-99",
            "id": "jhhvz11",
            "parent_id": "t3_oo2m7m",
            "score": 2,
            "created_utc": 1682325300.0,
            "replies": []
        },
        {
            "body": "Finasteride can also cause mood issues, such as increased anxiety and feelings of depression, so it's important to consider before taking.",
            "author": "gomi-panda",
            "id": "h5x7lmp",
            "parent_id": "t3_oo2m7m",
            "score": 1,
            "created_utc": 1626815194.0,
            "replies": []
        },
        {
            "body": "Day 364 did quick math correct me if I’m wrong",
            "author": "RapTVCalifornia",
            "id": "h5whngu",
            "parent_id": "t3_oo2m7m",
            "score": -1,
            "created_utc": 1626804214.0,
            "replies": [
                {
                    "body": "It's actually day 243. 364 would be almost a year.",
                    "author": "unnecessaryeater",
                    "id": "h5wod65",
                    "parent_id": "t1_h5whngu",
                    "score": 3,
                    "created_utc": 1626807054.0,
                    "replies": [
                        {
                            "body": "Oh yeah I misread the month and day I switched them",
                            "author": "RapTVCalifornia",
                            "id": "h5wv1ah",
                            "parent_id": "t1_h5wod65",
                            "score": 1,
                            "created_utc": 1626809872.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "What’s your fin regimen?",
            "author": "Oooooooooooohdaddy",
            "id": "h5wcf79",
            "parent_id": "t3_oo2m7m",
            "score": 1,
            "created_utc": 1626802019.0,
            "replies": [
                {
                    "body": "One pill (1mg) per day around 5:00pm",
                    "author": "zacboring",
                    "id": "h5x8tro",
                    "parent_id": "t1_h5wcf79",
                    "score": 2,
                    "created_utc": 1626815730.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "h5wd98n",
            "parent_id": "t3_oo2m7m",
            "score": 1,
            "created_utc": 1626802367.0,
            "replies": [
                {
                    "body": "Most products I’ve tried have weighed it down too much or made it look thin, so I typically don’t use anything to style it. I just shape it how I want when it’s wet. \n\nAnd I’m honestly afraid to see how it looks if it’s cut short, so I’m sticking with the longer style for now, haha. It might be fine though",
                    "author": "zacboring",
                    "id": "h5x4xqr",
                    "parent_id": "t1_h5wd98n",
                    "score": 1,
                    "created_utc": 1626814061.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "h5x7kxk",
                            "parent_id": "t1_h5x4xqr",
                            "score": 3,
                            "created_utc": 1626815185.0,
                            "replies": [
                                {
                                    "body": "Awesome, thank you! I’ll give that a shot",
                                    "author": "zacboring",
                                    "id": "h5x8xmc",
                                    "parent_id": "t1_h5x7kxk",
                                    "score": 1,
                                    "created_utc": 1626815778.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Completely amazing progress, mate.  \\*\\*\\*\\*\\*",
            "author": null,
            "id": "h5wxw3r",
            "parent_id": "t3_oo2m7m",
            "score": 1,
            "created_utc": 1626811065.0,
            "replies": []
        },
        {
            "body": "r/moreplatesmoredates Derek should check this out totally.",
            "author": null,
            "id": "h5xx8ab",
            "parent_id": "t3_oo2m7m",
            "score": 1,
            "created_utc": 1626827185.0,
            "replies": []
        },
        {
            "body": "Wow bro congrats, keep with it you look great",
            "author": "yerm1",
            "id": "h5y1wr2",
            "parent_id": "t3_oo2m7m",
            "score": 1,
            "created_utc": 1626829507.0,
            "replies": []
        },
        {
            "body": "Could you tell me exactly what you take? I wanna try this stuff but I don't know which ones to get.",
            "author": "bobbydinner",
            "id": "h5y3tj1",
            "parent_id": "t3_oo2m7m",
            "score": 1,
            "created_utc": 1626830433.0,
            "replies": [
                {
                    "body": "I just have a generic prescription for the Finasteride pills (the name brand is “Propecia”, but it’s waaay more expensive. So I get the unlabeled Finasteride from the pharmacy), and the Minoxidil I use on my scalp is just the liquid form from Equate that you can get off the shelf at Walmart or CVS. It’s typically in a white and blue box labeled “Hair Regrowth Treatment”. That’s it! I went as cheap as I could find, haha. \n\nI’ve heard good things about Keeps (they use the same stuff just repackaged) but I’ve never went through them before.",
                    "author": "zacboring",
                    "id": "h5ycwtn",
                    "parent_id": "t1_h5y3tj1",
                    "score": 2,
                    "created_utc": 1626834779.0,
                    "replies": [
                        {
                            "body": "[deleted]",
                            "author": null,
                            "id": "h6tw7hv",
                            "parent_id": "t1_h5ycwtn",
                            "score": 1,
                            "created_utc": 1627480271.0,
                            "replies": [
                                {
                                    "body": "It comes in 1mg and 5mg. Dermatologists prescribe 1mg for hairloss, and 5mg is for shrinking your prostate or something. \n\nI take the 1mg once per day, but I’ve never cut them in half. Not sure how effective it would be, but I’d think half a pill would still help better than no pill at all.",
                                    "author": "zacboring",
                                    "id": "h6uh7p2",
                                    "parent_id": "t1_h6tw7hv",
                                    "score": 2,
                                    "created_utc": 1627489299.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Kevin Mann. Is that you?",
            "author": null,
            "id": "h5yy7fh",
            "parent_id": "t3_oo2m7m",
            "score": 1,
            "created_utc": 1626846897.0,
            "replies": []
        },
        {
            "body": "Looks good. Now, how about Kill Bill 3 ??",
            "author": "OptoWompa",
            "id": "h5zb6jm",
            "parent_id": "t3_oo2m7m",
            "score": 1,
            "created_utc": 1626855155.0,
            "replies": []
        },
        {
            "body": "How’s your dick?",
            "author": "StunningEstates",
            "id": "h5zjw4n",
            "parent_id": "t3_oo2m7m",
            "score": 1,
            "created_utc": 1626862939.0,
            "replies": [
                {
                    "body": "Unimpressive, but fully functional",
                    "author": "zacboring",
                    "id": "h5zzthb",
                    "parent_id": "t1_h5zjw4n",
                    "score": 4,
                    "created_utc": 1626873413.0,
                    "replies": [
                        {
                            "body": "Nice!...Nice?",
                            "author": "StunningEstates",
                            "id": "h60006m",
                            "parent_id": "t1_h5zzthb",
                            "score": 2,
                            "created_utc": 1626873506.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "wow!",
            "author": null,
            "id": "h61pgqt",
            "parent_id": "t3_oo2m7m",
            "score": 1,
            "created_utc": 1626899785.0,
            "replies": []
        },
        {
            "body": "That's amazing!! I can only imagine the feeling 😃\n\nHow old are you? (if you mind answering )\n\nI've read few medical articles where they've highlighted development of man-boobs as a side effect of finasteride. Did your doctor mention anything around this or have you noticed any 'development'?",
            "author": "LordZuk0",
            "id": "h64495a",
            "parent_id": "t3_oo2m7m",
            "score": 1,
            "created_utc": 1626952336.0,
            "replies": [
                {
                    "body": "Feels pretty good!\n\nNo worries! I’m 25\n\nI have put on some weight, but I don’t know if I can fully blame the Finasteride on that. My diet is horrible, I got a desk job 10 months ago, and I quit going to the gym. I never got the “man boobs” but I did get pretty soft around my midsection. And I got a consultation through an app, so my doctor didn’t really discuss anything with me, haha",
                    "author": "zacboring",
                    "id": "h6475do",
                    "parent_id": "t1_h64495a",
                    "score": 2,
                    "created_utc": 1626954402.0,
                    "replies": [
                        {
                            "body": "Which app did you use to get Rx from dr.",
                            "author": "1ofthosedays2",
                            "id": "hlb4elt",
                            "parent_id": "t1_h6475do",
                            "score": 1,
                            "created_utc": 1637357917.0,
                            "replies": [
                                {
                                    "body": "“HeyDoctor”, but it’s not around anymore. I believe they were bought out by GoodRX. Not sure if they still offer the same services or not, I haven’t checked the app since",
                                    "author": "zacboring",
                                    "id": "hllumge",
                                    "parent_id": "t1_hlb4elt",
                                    "score": 1,
                                    "created_utc": 1637559010.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "dude you just got 20 years younger",
            "author": "extravagantjiggle",
            "id": "h6bfxzx",
            "parent_id": "t3_oo2m7m",
            "score": 1,
            "created_utc": 1627089742.0,
            "replies": []
        },
        {
            "body": "Holy shit.",
            "author": "mriolo84",
            "id": "h6l06wm",
            "parent_id": "t3_oo2m7m",
            "score": 1,
            "created_utc": 1627305304.0,
            "replies": []
        },
        {
            "body": "has it gotten better? They say it takes a full 12 months for best results.",
            "author": "druhoang",
            "id": "hnixsj4",
            "parent_id": "t3_oo2m7m",
            "score": 1,
            "created_utc": 1638834329.0,
            "replies": [
                {
                    "body": "Yes and no. I’ll make a post soon showing my one year before/after. It’s definitely better than when I started, but not much different from my 8 month photos",
                    "author": "zacboring",
                    "id": "hnjvg2f",
                    "parent_id": "t1_hnixsj4",
                    "score": 1,
                    "created_utc": 1638849159.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Great results ,can you tell what's your age now?",
            "author": "CR7__LM10",
            "id": "hzfh81t",
            "parent_id": "t3_oo2m7m",
            "score": 1,
            "created_utc": 1646467737.0,
            "replies": [
                {
                    "body": "25!",
                    "author": "zacboring",
                    "id": "hzjzks4",
                    "parent_id": "t1_hzfh81t",
                    "score": 1,
                    "created_utc": 1646554656.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "You're a handsome dude. Congrats on the results, would you recommend minoxidl for not major hair loss? I'm already on fin.",
            "author": "lucushoodYE",
            "id": "j2amkj1",
            "parent_id": "t3_oo2m7m",
            "score": 1,
            "created_utc": 1672434912.0,
            "replies": [
                {
                    "body": "Thanks! And if you haven’t had much loss yet I wouldn’t even bother with Minoxidil. The Finasteride should be enough to keep what you have",
                    "author": "zacboring",
                    "id": "j2kq34i",
                    "parent_id": "t1_j2amkj1",
                    "score": 1,
                    "created_utc": 1672622675.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Holy shit dude that was a drastic change! Congrats on the progress!\n\nIs this a lasting effect or do you have to continue taking the drugs?",
            "author": "Bektus",
            "id": "h5vteoa",
            "parent_id": "t1_h5vllgh",
            "score": 68,
            "created_utc": 1626794144.0,
            "replies": [
                {
                    "body": "Fin is a one way trip or crash. And if you mess up your daily intake you can squander your progress. Minox you can leave it once you have enough. Everybody leave it at some point because it always have sides, and unlike finn sides that go away in a week or two, minox are constant and annoying.",
                    "author": "DarkGhost999",
                    "id": "h5vuztx",
                    "parent_id": "t1_h5vteoa",
                    "score": 21,
                    "created_utc": 1626794810.0,
                    "replies": [
                        {
                            "body": "What do u mean by sides?",
                            "author": "Neosam718",
                            "id": "h5w2br0",
                            "parent_id": "t1_h5vuztx",
                            "score": 11,
                            "created_utc": 1626797847.0,
                            "replies": [
                                {
                                    "body": "Minox can have little annoying side effects that stack up and makes you leave it, first and foremost dry scalp, headaches, growing of unwanted hair in your face (probably because you touch your face and still have the substance) and if you are old of age you could feel palpitations in your heart. This is a vasodilator so it makes sense. Those are the common ones that you eventually develop, one, two, all of them, or new ones that no one saw coming. I think minox is better for the people who want to grow a beard, because that hair is permanent, so you take a year or two and leave it.\n\nFin sides depend mostly on your life. I felt sexual undesire for 2 weeks, then it left, months later I felt and increase in sexual desire but probably was because I started exercising hard. Some people feel various things, but most realistically, if you are a sad anxious balding man living a life going downhill and then you take something like fin and expect results in a month, you will probably pin every litle thing your feel to the drug, and it will be a lot of them because you will be hyper aware. Fin can also develop ginecomastia if you are kinda on the fatty side of the family, eat shit and don't move a muscle.",
                                    "author": "DarkGhost999",
                                    "id": "h5w560z",
                                    "parent_id": "t1_h5w2br0",
                                    "score": 20,
                                    "created_utc": 1626799013.0,
                                    "replies": [
                                        {
                                            "body": "Thank you so much for the reply, i personally have a bold patch in my beard that kills the look of it and I'm a little hesitant on the idea if using Min but I'm not sure if I have any other options. Btw are side effects temporary or would they stick around for good?",
                                            "author": "Neosam718",
                                            "id": "h5wbsyk",
                                            "parent_id": "t1_h5w560z",
                                            "score": 3,
                                            "created_utc": 1626801763.0,
                                            "replies": [
                                                {
                                                    "body": "There are no permanent side effects from minox, the substance effect last 12 hours (hence why twice a day max for faster, not \"better\", just faster results) and from there everything starts to go. The only permanent side effect of minox that I know of is a one in a trillion case of a hyper-responder guy who also had a rare medical condition and despite this he kept using unknown amounts of minox for a long time, the results were... lovecraftian. You better not know. I shouldn't even mention it because its extremely rare, but its in my knowledge and I can't lie.",
                                                    "author": "DarkGhost999",
                                                    "id": "h5we48n",
                                                    "parent_id": "t1_h5wbsyk",
                                                    "score": 8,
                                                    "created_utc": 1626802733.0,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "body": "I’ve been on minox for about 3 months and the only side effect I felt was the headaches, but they went away after a few weeks. Started finasteride about a week ago and the headaches are about the same as I felt with minox. I just know they’re side effects I gotta deal with for a bit and they’ll go away. Also my endocrinologist told me finasteride can effect your liver, but since I get my blood work checked regularly, she gave me the green light to take the medication as i am healthy. Just a little heads up in case any of y’all have any liver issues.",
                                            "author": "NerfNerd94",
                                            "id": "hqslmxy",
                                            "parent_id": "t1_h5w560z",
                                            "score": 2,
                                            "created_utc": 1641033781.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "Sadly min always gave me a headache and increased my tinnitus",
                                    "author": "gin-o-cide",
                                    "id": "h5w7hed",
                                    "parent_id": "t1_h5w2br0",
                                    "score": 4,
                                    "created_utc": 1626799970.0,
                                    "replies": [
                                        {
                                            "body": "oh man I have tinnitus too. I feel you man. Across time and space.",
                                            "author": "DarkGhost999",
                                            "id": "h5w8olm",
                                            "parent_id": "t1_h5w7hed",
                                            "score": 3,
                                            "created_utc": 1626800467.0,
                                            "replies": [
                                                {
                                                    "body": "Stay strong brother. Remember, anxiety makes it worse!",
                                                    "author": "gin-o-cide",
                                                    "id": "h5w9tq5",
                                                    "parent_id": "t1_h5w8olm",
                                                    "score": 7,
                                                    "created_utc": 1626800943.0,
                                                    "replies": []
                                                }
                                            ]
                                        },
                                        {
                                            "body": "A lot of tinnitus is low b vitamins. Take a super B supplement (one with at least 6 different types of vitamin b) and give it six weeks.",
                                            "author": "TacoT1000",
                                            "id": "h93qme9",
                                            "parent_id": "t1_h5w7hed",
                                            "score": 3,
                                            "created_utc": 1629077749.0,
                                            "replies": [
                                                {
                                                    "body": "People like you are the worst.",
                                                    "author": "lars_jeppesen",
                                                    "id": "i34h071",
                                                    "parent_id": "t1_h93qme9",
                                                    "score": 0,
                                                    "created_utc": 1648917229.0,
                                                    "replies": []
                                                },
                                                {
                                                    "body": "Can confirm this isn’t the cause for me 🥲",
                                                    "author": "kbizz92",
                                                    "id": "jfgvuyx",
                                                    "parent_id": "t1_h93qme9",
                                                    "score": 1,
                                                    "created_utc": 1680975130.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "body": "this comment would be like 30x easier to read if you actually wrote out the full words you're trying to say...",
                            "author": "Koiq",
                            "id": "h5xnhj9",
                            "parent_id": "t1_h5vuztx",
                            "score": 6,
                            "created_utc": 1626822449.0,
                            "replies": [
                                {
                                    "body": "You just aren’t in the hair game bro, need to brush up on the vernacular. Hahaha",
                                    "author": "TinyEyedTim",
                                    "id": "h6yunz9",
                                    "parent_id": "t1_h5xnhj9",
                                    "score": 1,
                                    "created_utc": 1627573441.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "I started using min and fin .. and no from no hair for 15 yrs to shit ton of peach fuzzy hair",
                            "author": "redbullf1fan2017",
                            "id": "h8m2dih",
                            "parent_id": "t1_h5vuztx",
                            "score": 2,
                            "created_utc": 1628739123.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "If the dates are accurate then that's day 242!\n\nCongratulations!",
            "author": "isarl",
            "id": "h5wxwr2",
            "parent_id": "t1_h5vllgh",
            "score": 10,
            "created_utc": 1626811073.0,
            "replies": [
                {
                    "body": "Thank you! I’m horrible at math",
                    "author": "zacboring",
                    "id": "h5x4a2d",
                    "parent_id": "t1_h5wxwr2",
                    "score": 7,
                    "created_utc": 1626813783.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Think you'll use transplants to fill out the hair? I think you're an excellent candidate for it to reverse almost all your loss.",
            "author": "salgat",
            "id": "h5xkdfl",
            "parent_id": "t1_h5vllgh",
            "score": 7,
            "created_utc": 1626820979.0,
            "replies": [
                {
                    "body": "I’d honestly like to in the future if I can afford it. It’s still a bit thin in the crown, and I’d like the hairline to be a tad fuller. But we’ll see! I’m certainly not upset with the results I’ve gotten!",
                    "author": "zacboring",
                    "id": "h5xnsyf",
                    "parent_id": "t1_h5xkdfl",
                    "score": 5,
                    "created_utc": 1626822601.0,
                    "replies": [
                        {
                            "body": "What’s the cost per filled prescription (per month?) each?  Does insurance cover any of it? I don’t want to go broke but thinking of trying this combo. Thanks. Appreciate the updates.",
                            "author": "Content-Box-7526",
                            "id": "jfs74sw",
                            "parent_id": "t1_h5xnsyf",
                            "score": 1,
                            "created_utc": 1681182249.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I’d say the quality of the new hair is pretty damn good! I mean it looks like you got a hair transplant for Christ sakes",
            "author": "LankyDinner5982",
            "id": "i6myvgl",
            "parent_id": "t1_h5vllgh",
            "score": 4,
            "created_utc": 1651215340.0,
            "replies": []
        },
        {
            "body": "For #3. Do you mean grow back from \"before it naturally started balding\" or do you mean to grow back from the shedding period?",
            "author": "ihopeshelovedme",
            "id": "hzx08jw",
            "parent_id": "t1_h5vllgh",
            "score": 3,
            "created_utc": 1646789662.0,
            "replies": [
                {
                    "body": "Before it started balding, I guess? I dunno, the two are kinda the same stage in my mind",
                    "author": "zacboring",
                    "id": "hzxe86r",
                    "parent_id": "t1_hzx08jw",
                    "score": 5,
                    "created_utc": 1646796003.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Thank you!",
            "author": "zacboring",
            "id": "h5x4czs",
            "parent_id": "t1_h5wqzjy",
            "score": 8,
            "created_utc": 1626813818.0,
            "replies": []
        },
        {
            "body": "With a hint of Tarantino IMO.",
            "author": null,
            "id": "h5x4nvv",
            "parent_id": "t1_h5x2bq0",
            "score": 13,
            "created_utc": 1626813944.0,
            "replies": [
                {
                    "body": "Quentin Hairantino",
                    "author": "masnaer",
                    "id": "h5xsszx",
                    "parent_id": "t1_h5x4nvv",
                    "score": 11,
                    "created_utc": 1626825018.0,
                    "replies": []
                },
                {
                    "body": "I see that, too, with a hint of Ewan McGregor.",
                    "author": "FiveMileDammit",
                    "id": "h5xa717",
                    "parent_id": "t1_h5x4nvv",
                    "score": 3,
                    "created_utc": 1626816333.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "😂😂😂",
            "author": "zacboring",
            "id": "h5x472r",
            "parent_id": "t1_h5x2bq0",
            "score": 4,
            "created_utc": 1626813748.0,
            "replies": []
        },
        {
            "body": "Topical. Liquid form in a eye-dropper, and I rub it on my scalp 1-2x per day",
            "author": "zacboring",
            "id": "h5w7685",
            "parent_id": "t1_h5vyqgq",
            "score": 9,
            "created_utc": 1626799841.0,
            "replies": [
                {
                    "body": "Did you also add min to the front, where hair recedes for most people or just the back / top?",
                    "author": "emotionally_tipsy",
                    "id": "h68wz0s",
                    "parent_id": "t1_h5w7685",
                    "score": 2,
                    "created_utc": 1627047591.0,
                    "replies": [
                        {
                            "body": "I put it all over the top of my head. It says to only use it on the crown, but it has worked for me so far. It definitely helped my hairline thicken up",
                            "author": "zacboring",
                            "id": "h68z36q",
                            "parent_id": "t1_h68wz0s",
                            "score": 3,
                            "created_utc": 1627048609.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Thank you! I appreciate it! I certainly can’t complain, I’d rather have weird wet hair than no hair at all. Haha",
            "author": "zacboring",
            "id": "h5w7jl4",
            "parent_id": "t1_h5w2tff",
            "score": 6,
            "created_utc": 1626799997.0,
            "replies": []
        },
        {
            "body": "😂",
            "author": "zacboring",
            "id": "h5zzizd",
            "parent_id": "t1_h5yvnps",
            "score": 3,
            "created_utc": 1626873264.0,
            "replies": []
        },
        {
            "body": "❤️",
            "author": "zacboring",
            "id": "h5w7ma3",
            "parent_id": "t1_h5w6ih9",
            "score": 2,
            "created_utc": 1626800027.0,
            "replies": []
        },
        {
            "body": "I’ve received this comparison several times, but never with “handsome” preceding it. I’m shocked— but honored",
            "author": "zacboring",
            "id": "h60xild",
            "parent_id": "t1_h60t984",
            "score": 2,
            "created_utc": 1626888106.0,
            "replies": []
        },
        {
            "body": "No problem! And I totally agree, there’s a lot of fear and confusion around these options. I had so many people telling me to just shave my head and get over it. It was super depressing. I’m glad I decided to try it, but upset I waited so long. I probably could’ve saved all of my density if I started back in 2017",
            "author": "zacboring",
            "id": "h5ydnnc",
            "parent_id": "t1_h5yadyg",
            "score": 3,
            "created_utc": 1626835141.0,
            "replies": []
        },
        {
            "body": "If you swipe over it’s the second image",
            "author": "zacboring",
            "id": "h5w7azs",
            "parent_id": "t1_h5w2r99",
            "score": 8,
            "created_utc": 1626799896.0,
            "replies": [
                {
                    "body": "On I see. Great result! Looks good.",
                    "author": "LongjumpingAd9719",
                    "id": "h5xuy1x",
                    "parent_id": "t1_h5w7azs",
                    "score": 3,
                    "created_utc": 1626826066.0,
                    "replies": [
                        {
                            "body": "Thank you!",
                            "author": "zacboring",
                            "id": "h5xxcgk",
                            "parent_id": "t1_h5xuy1x",
                            "score": 2,
                            "created_utc": 1626827241.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Dermatologist for Finasteride, Walmart for the Minoxidil. I got a consultation through an app!",
            "author": "zacboring",
            "id": "h5x4jwr",
            "parent_id": "t1_h5wglgt",
            "score": 6,
            "created_utc": 1626813898.0,
            "replies": [
                {
                    "body": "Which app? Do you need a SSN to get a prescription?",
                    "author": "RandmTask",
                    "id": "huezr2m",
                    "parent_id": "t1_h5x4jwr",
                    "score": 2,
                    "created_utc": 1643272506.0,
                    "replies": [
                        {
                            "body": "I used HeyDoctor, but I don’t think it exists anymore (I think it was bought out by GoodRX). I can’t remember if I had to give a SSN, but I did have to send a photo of my ID on the app to prove that I was a real person",
                            "author": "zacboring",
                            "id": "hufqk2j",
                            "parent_id": "t1_huezr2m",
                            "score": 2,
                            "created_utc": 1643290767.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Any doctor including a general practitioner can prescribe finasteride. Ask for 5mg pills that you will use a pill cutter to quarter them. Generic 5mg is like $12 at Walmart for a 4 month supply.",
            "author": "salgat",
            "id": "h5ydz4q",
            "parent_id": "t1_h5wglgt",
            "score": 2,
            "created_utc": 1626835300.0,
            "replies": []
        },
        {
            "body": "Yeah, that video is from 2016 before my hair started falling out. Started with a tiny bald patch at my crown around August of 2016 and spread from there until we reached the photo on the left. It’s crazy what poor genetics and stress can do to your body in just 4 years",
            "author": "zacboring",
            "id": "h6uhvbn",
            "parent_id": "t1_h6uh54t",
            "score": 1,
            "created_utc": 1627489563.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "h6uklbs",
                    "parent_id": "t1_h6uhvbn",
                    "score": 1,
                    "created_utc": 1627490666.0,
                    "replies": [
                        {
                            "body": "That photo was taken in a car at a low angle to strategically hide a thinning hairline and a bald patch in the back. I knew what angles I could use to cover it, I was FAR from a full head of hair. Genetics caused the slow thinning from 2016-2019, but 2020 brought the stress-induced hairloss in large chunks. Leading to my “before” photos back in November. \n\nI totally understand your skepticism, I probably wouldn’t believe it either. But all of those photos are clearly taken in the same room, and I’ve been taking two different medications, vitamins, and derma-rolling for 8 months now and was lucky enough to restore my hair back to how it was in 2018 (if I started earlier I probably could’ve fully reversed it). I’m at work at the moment, but once I’m home I’ll find some screen grabs from a video project I’ve been shooting for the last few years and we have some scenes where we failed to cover my bald spots. You’d be surprised how quickly my coverage went downhill",
                            "author": "zacboring",
                            "id": "h6ur2j3",
                            "parent_id": "t1_h6uklbs",
                            "score": 2,
                            "created_utc": 1627493318.0,
                            "replies": [
                                {
                                    "body": "Did the mods delete this, or did he?",
                                    "author": "zacboring",
                                    "id": "h6w1mvl",
                                    "parent_id": "t1_h6ur2j3",
                                    "score": 1,
                                    "created_utc": 1627513345.0,
                                    "replies": [
                                        {
                                            "body": "What did he say?\n\n\nNot related but you should post this on r/Tressless.",
                                            "author": "cobaltorange",
                                            "id": "h6w6ui6",
                                            "parent_id": "t1_h6w1mvl",
                                            "score": 1,
                                            "created_utc": 1627515857.0,
                                            "replies": [
                                                {
                                                    "body": "He was saying he didn’t believe the pictures were the same person and was asking for more proof, essentially. \n\nI totally forgot about that subreddit. I used to check it a few years back but had to stop because it was bumming me out. A lot of negativity over there at the time, if I remember correctly. Might have to look into it again",
                                                    "author": "zacboring",
                                                    "id": "h6x10cv",
                                                    "parent_id": "t1_h6w6ui6",
                                                    "score": 1,
                                                    "created_utc": 1627531074.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Thank you! Good luck with everything! It took me about 3 or 4 months to notice any results, so just hang in there! And don’t forget to take pictures, it’ll help you keep track",
            "author": "zacboring",
            "id": "h9shnc4",
            "parent_id": "t1_h9rn1zj",
            "score": 2,
            "created_utc": 1629555409.0,
            "replies": []
        },
        {
            "body": "I’ve actually never tried the topical Finasteride (only topical Minoxidil), but I’ve heard that some people prefer it!  I just take the 1mg pill once per day. The sooner you start something the better though!",
            "author": "zacboring",
            "id": "igqby0p",
            "parent_id": "t1_igps5ot",
            "score": 1,
            "created_utc": 1658200297.0,
            "replies": []
        },
        {
            "body": "Thank you! I actually was micro needling quite a bit at the start, but I’ve really gotten lazy with it the last few months. Definitely hopping back on",
            "author": "zacboring",
            "id": "ix3rw3r",
            "parent_id": "t1_iwrcfff",
            "score": 1,
            "created_utc": 1668957207.0,
            "replies": []
        },
        {
            "body": "It's actually day 243. 364 would be almost a year.",
            "author": "unnecessaryeater",
            "id": "h5wod65",
            "parent_id": "t1_h5whngu",
            "score": 3,
            "created_utc": 1626807054.0,
            "replies": [
                {
                    "body": "Oh yeah I misread the month and day I switched them",
                    "author": "RapTVCalifornia",
                    "id": "h5wv1ah",
                    "parent_id": "t1_h5wod65",
                    "score": 1,
                    "created_utc": 1626809872.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "One pill (1mg) per day around 5:00pm",
            "author": "zacboring",
            "id": "h5x8tro",
            "parent_id": "t1_h5wcf79",
            "score": 2,
            "created_utc": 1626815730.0,
            "replies": []
        },
        {
            "body": "Most products I’ve tried have weighed it down too much or made it look thin, so I typically don’t use anything to style it. I just shape it how I want when it’s wet. \n\nAnd I’m honestly afraid to see how it looks if it’s cut short, so I’m sticking with the longer style for now, haha. It might be fine though",
            "author": "zacboring",
            "id": "h5x4xqr",
            "parent_id": "t1_h5wd98n",
            "score": 1,
            "created_utc": 1626814061.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "h5x7kxk",
                    "parent_id": "t1_h5x4xqr",
                    "score": 3,
                    "created_utc": 1626815185.0,
                    "replies": [
                        {
                            "body": "Awesome, thank you! I’ll give that a shot",
                            "author": "zacboring",
                            "id": "h5x8xmc",
                            "parent_id": "t1_h5x7kxk",
                            "score": 1,
                            "created_utc": 1626815778.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I just have a generic prescription for the Finasteride pills (the name brand is “Propecia”, but it’s waaay more expensive. So I get the unlabeled Finasteride from the pharmacy), and the Minoxidil I use on my scalp is just the liquid form from Equate that you can get off the shelf at Walmart or CVS. It’s typically in a white and blue box labeled “Hair Regrowth Treatment”. That’s it! I went as cheap as I could find, haha. \n\nI’ve heard good things about Keeps (they use the same stuff just repackaged) but I’ve never went through them before.",
            "author": "zacboring",
            "id": "h5ycwtn",
            "parent_id": "t1_h5y3tj1",
            "score": 2,
            "created_utc": 1626834779.0,
            "replies": [
                {
                    "body": "[deleted]",
                    "author": null,
                    "id": "h6tw7hv",
                    "parent_id": "t1_h5ycwtn",
                    "score": 1,
                    "created_utc": 1627480271.0,
                    "replies": [
                        {
                            "body": "It comes in 1mg and 5mg. Dermatologists prescribe 1mg for hairloss, and 5mg is for shrinking your prostate or something. \n\nI take the 1mg once per day, but I’ve never cut them in half. Not sure how effective it would be, but I’d think half a pill would still help better than no pill at all.",
                            "author": "zacboring",
                            "id": "h6uh7p2",
                            "parent_id": "t1_h6tw7hv",
                            "score": 2,
                            "created_utc": 1627489299.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Unimpressive, but fully functional",
            "author": "zacboring",
            "id": "h5zzthb",
            "parent_id": "t1_h5zjw4n",
            "score": 4,
            "created_utc": 1626873413.0,
            "replies": [
                {
                    "body": "Nice!...Nice?",
                    "author": "StunningEstates",
                    "id": "h60006m",
                    "parent_id": "t1_h5zzthb",
                    "score": 2,
                    "created_utc": 1626873506.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Feels pretty good!\n\nNo worries! I’m 25\n\nI have put on some weight, but I don’t know if I can fully blame the Finasteride on that. My diet is horrible, I got a desk job 10 months ago, and I quit going to the gym. I never got the “man boobs” but I did get pretty soft around my midsection. And I got a consultation through an app, so my doctor didn’t really discuss anything with me, haha",
            "author": "zacboring",
            "id": "h6475do",
            "parent_id": "t1_h64495a",
            "score": 2,
            "created_utc": 1626954402.0,
            "replies": [
                {
                    "body": "Which app did you use to get Rx from dr.",
                    "author": "1ofthosedays2",
                    "id": "hlb4elt",
                    "parent_id": "t1_h6475do",
                    "score": 1,
                    "created_utc": 1637357917.0,
                    "replies": [
                        {
                            "body": "“HeyDoctor”, but it’s not around anymore. I believe they were bought out by GoodRX. Not sure if they still offer the same services or not, I haven’t checked the app since",
                            "author": "zacboring",
                            "id": "hllumge",
                            "parent_id": "t1_hlb4elt",
                            "score": 1,
                            "created_utc": 1637559010.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Yes and no. I’ll make a post soon showing my one year before/after. It’s definitely better than when I started, but not much different from my 8 month photos",
            "author": "zacboring",
            "id": "hnjvg2f",
            "parent_id": "t1_hnixsj4",
            "score": 1,
            "created_utc": 1638849159.0,
            "replies": []
        },
        {
            "body": "25!",
            "author": "zacboring",
            "id": "hzjzks4",
            "parent_id": "t1_hzfh81t",
            "score": 1,
            "created_utc": 1646554656.0,
            "replies": []
        },
        {
            "body": "Thanks! And if you haven’t had much loss yet I wouldn’t even bother with Minoxidil. The Finasteride should be enough to keep what you have",
            "author": "zacboring",
            "id": "j2kq34i",
            "parent_id": "t1_j2amkj1",
            "score": 1,
            "created_utc": 1672622675.0,
            "replies": []
        },
        {
            "body": "Fin is a one way trip or crash. And if you mess up your daily intake you can squander your progress. Minox you can leave it once you have enough. Everybody leave it at some point because it always have sides, and unlike finn sides that go away in a week or two, minox are constant and annoying.",
            "author": "DarkGhost999",
            "id": "h5vuztx",
            "parent_id": "t1_h5vteoa",
            "score": 21,
            "created_utc": 1626794810.0,
            "replies": [
                {
                    "body": "What do u mean by sides?",
                    "author": "Neosam718",
                    "id": "h5w2br0",
                    "parent_id": "t1_h5vuztx",
                    "score": 11,
                    "created_utc": 1626797847.0,
                    "replies": [
                        {
                            "body": "Minox can have little annoying side effects that stack up and makes you leave it, first and foremost dry scalp, headaches, growing of unwanted hair in your face (probably because you touch your face and still have the substance) and if you are old of age you could feel palpitations in your heart. This is a vasodilator so it makes sense. Those are the common ones that you eventually develop, one, two, all of them, or new ones that no one saw coming. I think minox is better for the people who want to grow a beard, because that hair is permanent, so you take a year or two and leave it.\n\nFin sides depend mostly on your life. I felt sexual undesire for 2 weeks, then it left, months later I felt and increase in sexual desire but probably was because I started exercising hard. Some people feel various things, but most realistically, if you are a sad anxious balding man living a life going downhill and then you take something like fin and expect results in a month, you will probably pin every litle thing your feel to the drug, and it will be a lot of them because you will be hyper aware. Fin can also develop ginecomastia if you are kinda on the fatty side of the family, eat shit and don't move a muscle.",
                            "author": "DarkGhost999",
                            "id": "h5w560z",
                            "parent_id": "t1_h5w2br0",
                            "score": 20,
                            "created_utc": 1626799013.0,
                            "replies": [
                                {
                                    "body": "Thank you so much for the reply, i personally have a bold patch in my beard that kills the look of it and I'm a little hesitant on the idea if using Min but I'm not sure if I have any other options. Btw are side effects temporary or would they stick around for good?",
                                    "author": "Neosam718",
                                    "id": "h5wbsyk",
                                    "parent_id": "t1_h5w560z",
                                    "score": 3,
                                    "created_utc": 1626801763.0,
                                    "replies": [
                                        {
                                            "body": "There are no permanent side effects from minox, the substance effect last 12 hours (hence why twice a day max for faster, not \"better\", just faster results) and from there everything starts to go. The only permanent side effect of minox that I know of is a one in a trillion case of a hyper-responder guy who also had a rare medical condition and despite this he kept using unknown amounts of minox for a long time, the results were... lovecraftian. You better not know. I shouldn't even mention it because its extremely rare, but its in my knowledge and I can't lie.",
                                            "author": "DarkGhost999",
                                            "id": "h5we48n",
                                            "parent_id": "t1_h5wbsyk",
                                            "score": 8,
                                            "created_utc": 1626802733.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "I’ve been on minox for about 3 months and the only side effect I felt was the headaches, but they went away after a few weeks. Started finasteride about a week ago and the headaches are about the same as I felt with minox. I just know they’re side effects I gotta deal with for a bit and they’ll go away. Also my endocrinologist told me finasteride can effect your liver, but since I get my blood work checked regularly, she gave me the green light to take the medication as i am healthy. Just a little heads up in case any of y’all have any liver issues.",
                                    "author": "NerfNerd94",
                                    "id": "hqslmxy",
                                    "parent_id": "t1_h5w560z",
                                    "score": 2,
                                    "created_utc": 1641033781.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "Sadly min always gave me a headache and increased my tinnitus",
                            "author": "gin-o-cide",
                            "id": "h5w7hed",
                            "parent_id": "t1_h5w2br0",
                            "score": 4,
                            "created_utc": 1626799970.0,
                            "replies": [
                                {
                                    "body": "oh man I have tinnitus too. I feel you man. Across time and space.",
                                    "author": "DarkGhost999",
                                    "id": "h5w8olm",
                                    "parent_id": "t1_h5w7hed",
                                    "score": 3,
                                    "created_utc": 1626800467.0,
                                    "replies": [
                                        {
                                            "body": "Stay strong brother. Remember, anxiety makes it worse!",
                                            "author": "gin-o-cide",
                                            "id": "h5w9tq5",
                                            "parent_id": "t1_h5w8olm",
                                            "score": 7,
                                            "created_utc": 1626800943.0,
                                            "replies": []
                                        }
                                    ]
                                },
                                {
                                    "body": "A lot of tinnitus is low b vitamins. Take a super B supplement (one with at least 6 different types of vitamin b) and give it six weeks.",
                                    "author": "TacoT1000",
                                    "id": "h93qme9",
                                    "parent_id": "t1_h5w7hed",
                                    "score": 3,
                                    "created_utc": 1629077749.0,
                                    "replies": [
                                        {
                                            "body": "People like you are the worst.",
                                            "author": "lars_jeppesen",
                                            "id": "i34h071",
                                            "parent_id": "t1_h93qme9",
                                            "score": 0,
                                            "created_utc": 1648917229.0,
                                            "replies": []
                                        },
                                        {
                                            "body": "Can confirm this isn’t the cause for me 🥲",
                                            "author": "kbizz92",
                                            "id": "jfgvuyx",
                                            "parent_id": "t1_h93qme9",
                                            "score": 1,
                                            "created_utc": 1680975130.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "this comment would be like 30x easier to read if you actually wrote out the full words you're trying to say...",
                    "author": "Koiq",
                    "id": "h5xnhj9",
                    "parent_id": "t1_h5vuztx",
                    "score": 6,
                    "created_utc": 1626822449.0,
                    "replies": [
                        {
                            "body": "You just aren’t in the hair game bro, need to brush up on the vernacular. Hahaha",
                            "author": "TinyEyedTim",
                            "id": "h6yunz9",
                            "parent_id": "t1_h5xnhj9",
                            "score": 1,
                            "created_utc": 1627573441.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "I started using min and fin .. and no from no hair for 15 yrs to shit ton of peach fuzzy hair",
                    "author": "redbullf1fan2017",
                    "id": "h8m2dih",
                    "parent_id": "t1_h5vuztx",
                    "score": 2,
                    "created_utc": 1628739123.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Thank you! I’m horrible at math",
            "author": "zacboring",
            "id": "h5x4a2d",
            "parent_id": "t1_h5wxwr2",
            "score": 7,
            "created_utc": 1626813783.0,
            "replies": []
        },
        {
            "body": "I’d honestly like to in the future if I can afford it. It’s still a bit thin in the crown, and I’d like the hairline to be a tad fuller. But we’ll see! I’m certainly not upset with the results I’ve gotten!",
            "author": "zacboring",
            "id": "h5xnsyf",
            "parent_id": "t1_h5xkdfl",
            "score": 5,
            "created_utc": 1626822601.0,
            "replies": [
                {
                    "body": "What’s the cost per filled prescription (per month?) each?  Does insurance cover any of it? I don’t want to go broke but thinking of trying this combo. Thanks. Appreciate the updates.",
                    "author": "Content-Box-7526",
                    "id": "jfs74sw",
                    "parent_id": "t1_h5xnsyf",
                    "score": 1,
                    "created_utc": 1681182249.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Before it started balding, I guess? I dunno, the two are kinda the same stage in my mind",
            "author": "zacboring",
            "id": "hzxe86r",
            "parent_id": "t1_hzx08jw",
            "score": 5,
            "created_utc": 1646796003.0,
            "replies": []
        },
        {
            "body": "Quentin Hairantino",
            "author": "masnaer",
            "id": "h5xsszx",
            "parent_id": "t1_h5x4nvv",
            "score": 11,
            "created_utc": 1626825018.0,
            "replies": []
        },
        {
            "body": "I see that, too, with a hint of Ewan McGregor.",
            "author": "FiveMileDammit",
            "id": "h5xa717",
            "parent_id": "t1_h5x4nvv",
            "score": 3,
            "created_utc": 1626816333.0,
            "replies": []
        },
        {
            "body": "Did you also add min to the front, where hair recedes for most people or just the back / top?",
            "author": "emotionally_tipsy",
            "id": "h68wz0s",
            "parent_id": "t1_h5w7685",
            "score": 2,
            "created_utc": 1627047591.0,
            "replies": [
                {
                    "body": "I put it all over the top of my head. It says to only use it on the crown, but it has worked for me so far. It definitely helped my hairline thicken up",
                    "author": "zacboring",
                    "id": "h68z36q",
                    "parent_id": "t1_h68wz0s",
                    "score": 3,
                    "created_utc": 1627048609.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "On I see. Great result! Looks good.",
            "author": "LongjumpingAd9719",
            "id": "h5xuy1x",
            "parent_id": "t1_h5w7azs",
            "score": 3,
            "created_utc": 1626826066.0,
            "replies": [
                {
                    "body": "Thank you!",
                    "author": "zacboring",
                    "id": "h5xxcgk",
                    "parent_id": "t1_h5xuy1x",
                    "score": 2,
                    "created_utc": 1626827241.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Which app? Do you need a SSN to get a prescription?",
            "author": "RandmTask",
            "id": "huezr2m",
            "parent_id": "t1_h5x4jwr",
            "score": 2,
            "created_utc": 1643272506.0,
            "replies": [
                {
                    "body": "I used HeyDoctor, but I don’t think it exists anymore (I think it was bought out by GoodRX). I can’t remember if I had to give a SSN, but I did have to send a photo of my ID on the app to prove that I was a real person",
                    "author": "zacboring",
                    "id": "hufqk2j",
                    "parent_id": "t1_huezr2m",
                    "score": 2,
                    "created_utc": 1643290767.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "h6uklbs",
            "parent_id": "t1_h6uhvbn",
            "score": 1,
            "created_utc": 1627490666.0,
            "replies": [
                {
                    "body": "That photo was taken in a car at a low angle to strategically hide a thinning hairline and a bald patch in the back. I knew what angles I could use to cover it, I was FAR from a full head of hair. Genetics caused the slow thinning from 2016-2019, but 2020 brought the stress-induced hairloss in large chunks. Leading to my “before” photos back in November. \n\nI totally understand your skepticism, I probably wouldn’t believe it either. But all of those photos are clearly taken in the same room, and I’ve been taking two different medications, vitamins, and derma-rolling for 8 months now and was lucky enough to restore my hair back to how it was in 2018 (if I started earlier I probably could’ve fully reversed it). I’m at work at the moment, but once I’m home I’ll find some screen grabs from a video project I’ve been shooting for the last few years and we have some scenes where we failed to cover my bald spots. You’d be surprised how quickly my coverage went downhill",
                    "author": "zacboring",
                    "id": "h6ur2j3",
                    "parent_id": "t1_h6uklbs",
                    "score": 2,
                    "created_utc": 1627493318.0,
                    "replies": [
                        {
                            "body": "Did the mods delete this, or did he?",
                            "author": "zacboring",
                            "id": "h6w1mvl",
                            "parent_id": "t1_h6ur2j3",
                            "score": 1,
                            "created_utc": 1627513345.0,
                            "replies": [
                                {
                                    "body": "What did he say?\n\n\nNot related but you should post this on r/Tressless.",
                                    "author": "cobaltorange",
                                    "id": "h6w6ui6",
                                    "parent_id": "t1_h6w1mvl",
                                    "score": 1,
                                    "created_utc": 1627515857.0,
                                    "replies": [
                                        {
                                            "body": "He was saying he didn’t believe the pictures were the same person and was asking for more proof, essentially. \n\nI totally forgot about that subreddit. I used to check it a few years back but had to stop because it was bumming me out. A lot of negativity over there at the time, if I remember correctly. Might have to look into it again",
                                            "author": "zacboring",
                                            "id": "h6x10cv",
                                            "parent_id": "t1_h6w6ui6",
                                            "score": 1,
                                            "created_utc": 1627531074.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Oh yeah I misread the month and day I switched them",
            "author": "RapTVCalifornia",
            "id": "h5wv1ah",
            "parent_id": "t1_h5wod65",
            "score": 1,
            "created_utc": 1626809872.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "h5x7kxk",
            "parent_id": "t1_h5x4xqr",
            "score": 3,
            "created_utc": 1626815185.0,
            "replies": [
                {
                    "body": "Awesome, thank you! I’ll give that a shot",
                    "author": "zacboring",
                    "id": "h5x8xmc",
                    "parent_id": "t1_h5x7kxk",
                    "score": 1,
                    "created_utc": 1626815778.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "h6tw7hv",
            "parent_id": "t1_h5ycwtn",
            "score": 1,
            "created_utc": 1627480271.0,
            "replies": [
                {
                    "body": "It comes in 1mg and 5mg. Dermatologists prescribe 1mg for hairloss, and 5mg is for shrinking your prostate or something. \n\nI take the 1mg once per day, but I’ve never cut them in half. Not sure how effective it would be, but I’d think half a pill would still help better than no pill at all.",
                    "author": "zacboring",
                    "id": "h6uh7p2",
                    "parent_id": "t1_h6tw7hv",
                    "score": 2,
                    "created_utc": 1627489299.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Nice!...Nice?",
            "author": "StunningEstates",
            "id": "h60006m",
            "parent_id": "t1_h5zzthb",
            "score": 2,
            "created_utc": 1626873506.0,
            "replies": []
        },
        {
            "body": "Which app did you use to get Rx from dr.",
            "author": "1ofthosedays2",
            "id": "hlb4elt",
            "parent_id": "t1_h6475do",
            "score": 1,
            "created_utc": 1637357917.0,
            "replies": [
                {
                    "body": "“HeyDoctor”, but it’s not around anymore. I believe they were bought out by GoodRX. Not sure if they still offer the same services or not, I haven’t checked the app since",
                    "author": "zacboring",
                    "id": "hllumge",
                    "parent_id": "t1_hlb4elt",
                    "score": 1,
                    "created_utc": 1637559010.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "What do u mean by sides?",
            "author": "Neosam718",
            "id": "h5w2br0",
            "parent_id": "t1_h5vuztx",
            "score": 11,
            "created_utc": 1626797847.0,
            "replies": [
                {
                    "body": "Minox can have little annoying side effects that stack up and makes you leave it, first and foremost dry scalp, headaches, growing of unwanted hair in your face (probably because you touch your face and still have the substance) and if you are old of age you could feel palpitations in your heart. This is a vasodilator so it makes sense. Those are the common ones that you eventually develop, one, two, all of them, or new ones that no one saw coming. I think minox is better for the people who want to grow a beard, because that hair is permanent, so you take a year or two and leave it.\n\nFin sides depend mostly on your life. I felt sexual undesire for 2 weeks, then it left, months later I felt and increase in sexual desire but probably was because I started exercising hard. Some people feel various things, but most realistically, if you are a sad anxious balding man living a life going downhill and then you take something like fin and expect results in a month, you will probably pin every litle thing your feel to the drug, and it will be a lot of them because you will be hyper aware. Fin can also develop ginecomastia if you are kinda on the fatty side of the family, eat shit and don't move a muscle.",
                    "author": "DarkGhost999",
                    "id": "h5w560z",
                    "parent_id": "t1_h5w2br0",
                    "score": 20,
                    "created_utc": 1626799013.0,
                    "replies": [
                        {
                            "body": "Thank you so much for the reply, i personally have a bold patch in my beard that kills the look of it and I'm a little hesitant on the idea if using Min but I'm not sure if I have any other options. Btw are side effects temporary or would they stick around for good?",
                            "author": "Neosam718",
                            "id": "h5wbsyk",
                            "parent_id": "t1_h5w560z",
                            "score": 3,
                            "created_utc": 1626801763.0,
                            "replies": [
                                {
                                    "body": "There are no permanent side effects from minox, the substance effect last 12 hours (hence why twice a day max for faster, not \"better\", just faster results) and from there everything starts to go. The only permanent side effect of minox that I know of is a one in a trillion case of a hyper-responder guy who also had a rare medical condition and despite this he kept using unknown amounts of minox for a long time, the results were... lovecraftian. You better not know. I shouldn't even mention it because its extremely rare, but its in my knowledge and I can't lie.",
                                    "author": "DarkGhost999",
                                    "id": "h5we48n",
                                    "parent_id": "t1_h5wbsyk",
                                    "score": 8,
                                    "created_utc": 1626802733.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "I’ve been on minox for about 3 months and the only side effect I felt was the headaches, but they went away after a few weeks. Started finasteride about a week ago and the headaches are about the same as I felt with minox. I just know they’re side effects I gotta deal with for a bit and they’ll go away. Also my endocrinologist told me finasteride can effect your liver, but since I get my blood work checked regularly, she gave me the green light to take the medication as i am healthy. Just a little heads up in case any of y’all have any liver issues.",
                            "author": "NerfNerd94",
                            "id": "hqslmxy",
                            "parent_id": "t1_h5w560z",
                            "score": 2,
                            "created_utc": 1641033781.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "Sadly min always gave me a headache and increased my tinnitus",
                    "author": "gin-o-cide",
                    "id": "h5w7hed",
                    "parent_id": "t1_h5w2br0",
                    "score": 4,
                    "created_utc": 1626799970.0,
                    "replies": [
                        {
                            "body": "oh man I have tinnitus too. I feel you man. Across time and space.",
                            "author": "DarkGhost999",
                            "id": "h5w8olm",
                            "parent_id": "t1_h5w7hed",
                            "score": 3,
                            "created_utc": 1626800467.0,
                            "replies": [
                                {
                                    "body": "Stay strong brother. Remember, anxiety makes it worse!",
                                    "author": "gin-o-cide",
                                    "id": "h5w9tq5",
                                    "parent_id": "t1_h5w8olm",
                                    "score": 7,
                                    "created_utc": 1626800943.0,
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "body": "A lot of tinnitus is low b vitamins. Take a super B supplement (one with at least 6 different types of vitamin b) and give it six weeks.",
                            "author": "TacoT1000",
                            "id": "h93qme9",
                            "parent_id": "t1_h5w7hed",
                            "score": 3,
                            "created_utc": 1629077749.0,
                            "replies": [
                                {
                                    "body": "People like you are the worst.",
                                    "author": "lars_jeppesen",
                                    "id": "i34h071",
                                    "parent_id": "t1_h93qme9",
                                    "score": 0,
                                    "created_utc": 1648917229.0,
                                    "replies": []
                                },
                                {
                                    "body": "Can confirm this isn’t the cause for me 🥲",
                                    "author": "kbizz92",
                                    "id": "jfgvuyx",
                                    "parent_id": "t1_h93qme9",
                                    "score": 1,
                                    "created_utc": 1680975130.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "this comment would be like 30x easier to read if you actually wrote out the full words you're trying to say...",
            "author": "Koiq",
            "id": "h5xnhj9",
            "parent_id": "t1_h5vuztx",
            "score": 6,
            "created_utc": 1626822449.0,
            "replies": [
                {
                    "body": "You just aren’t in the hair game bro, need to brush up on the vernacular. Hahaha",
                    "author": "TinyEyedTim",
                    "id": "h6yunz9",
                    "parent_id": "t1_h5xnhj9",
                    "score": 1,
                    "created_utc": 1627573441.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I started using min and fin .. and no from no hair for 15 yrs to shit ton of peach fuzzy hair",
            "author": "redbullf1fan2017",
            "id": "h8m2dih",
            "parent_id": "t1_h5vuztx",
            "score": 2,
            "created_utc": 1628739123.0,
            "replies": []
        },
        {
            "body": "What’s the cost per filled prescription (per month?) each?  Does insurance cover any of it? I don’t want to go broke but thinking of trying this combo. Thanks. Appreciate the updates.",
            "author": "Content-Box-7526",
            "id": "jfs74sw",
            "parent_id": "t1_h5xnsyf",
            "score": 1,
            "created_utc": 1681182249.0,
            "replies": []
        },
        {
            "body": "I put it all over the top of my head. It says to only use it on the crown, but it has worked for me so far. It definitely helped my hairline thicken up",
            "author": "zacboring",
            "id": "h68z36q",
            "parent_id": "t1_h68wz0s",
            "score": 3,
            "created_utc": 1627048609.0,
            "replies": []
        },
        {
            "body": "Thank you!",
            "author": "zacboring",
            "id": "h5xxcgk",
            "parent_id": "t1_h5xuy1x",
            "score": 2,
            "created_utc": 1626827241.0,
            "replies": []
        },
        {
            "body": "I used HeyDoctor, but I don’t think it exists anymore (I think it was bought out by GoodRX). I can’t remember if I had to give a SSN, but I did have to send a photo of my ID on the app to prove that I was a real person",
            "author": "zacboring",
            "id": "hufqk2j",
            "parent_id": "t1_huezr2m",
            "score": 2,
            "created_utc": 1643290767.0,
            "replies": []
        },
        {
            "body": "That photo was taken in a car at a low angle to strategically hide a thinning hairline and a bald patch in the back. I knew what angles I could use to cover it, I was FAR from a full head of hair. Genetics caused the slow thinning from 2016-2019, but 2020 brought the stress-induced hairloss in large chunks. Leading to my “before” photos back in November. \n\nI totally understand your skepticism, I probably wouldn’t believe it either. But all of those photos are clearly taken in the same room, and I’ve been taking two different medications, vitamins, and derma-rolling for 8 months now and was lucky enough to restore my hair back to how it was in 2018 (if I started earlier I probably could’ve fully reversed it). I’m at work at the moment, but once I’m home I’ll find some screen grabs from a video project I’ve been shooting for the last few years and we have some scenes where we failed to cover my bald spots. You’d be surprised how quickly my coverage went downhill",
            "author": "zacboring",
            "id": "h6ur2j3",
            "parent_id": "t1_h6uklbs",
            "score": 2,
            "created_utc": 1627493318.0,
            "replies": [
                {
                    "body": "Did the mods delete this, or did he?",
                    "author": "zacboring",
                    "id": "h6w1mvl",
                    "parent_id": "t1_h6ur2j3",
                    "score": 1,
                    "created_utc": 1627513345.0,
                    "replies": [
                        {
                            "body": "What did he say?\n\n\nNot related but you should post this on r/Tressless.",
                            "author": "cobaltorange",
                            "id": "h6w6ui6",
                            "parent_id": "t1_h6w1mvl",
                            "score": 1,
                            "created_utc": 1627515857.0,
                            "replies": [
                                {
                                    "body": "He was saying he didn’t believe the pictures were the same person and was asking for more proof, essentially. \n\nI totally forgot about that subreddit. I used to check it a few years back but had to stop because it was bumming me out. A lot of negativity over there at the time, if I remember correctly. Might have to look into it again",
                                    "author": "zacboring",
                                    "id": "h6x10cv",
                                    "parent_id": "t1_h6w6ui6",
                                    "score": 1,
                                    "created_utc": 1627531074.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Awesome, thank you! I’ll give that a shot",
            "author": "zacboring",
            "id": "h5x8xmc",
            "parent_id": "t1_h5x7kxk",
            "score": 1,
            "created_utc": 1626815778.0,
            "replies": []
        },
        {
            "body": "It comes in 1mg and 5mg. Dermatologists prescribe 1mg for hairloss, and 5mg is for shrinking your prostate or something. \n\nI take the 1mg once per day, but I’ve never cut them in half. Not sure how effective it would be, but I’d think half a pill would still help better than no pill at all.",
            "author": "zacboring",
            "id": "h6uh7p2",
            "parent_id": "t1_h6tw7hv",
            "score": 2,
            "created_utc": 1627489299.0,
            "replies": []
        },
        {
            "body": "“HeyDoctor”, but it’s not around anymore. I believe they were bought out by GoodRX. Not sure if they still offer the same services or not, I haven’t checked the app since",
            "author": "zacboring",
            "id": "hllumge",
            "parent_id": "t1_hlb4elt",
            "score": 1,
            "created_utc": 1637559010.0,
            "replies": []
        },
        {
            "body": "Minox can have little annoying side effects that stack up and makes you leave it, first and foremost dry scalp, headaches, growing of unwanted hair in your face (probably because you touch your face and still have the substance) and if you are old of age you could feel palpitations in your heart. This is a vasodilator so it makes sense. Those are the common ones that you eventually develop, one, two, all of them, or new ones that no one saw coming. I think minox is better for the people who want to grow a beard, because that hair is permanent, so you take a year or two and leave it.\n\nFin sides depend mostly on your life. I felt sexual undesire for 2 weeks, then it left, months later I felt and increase in sexual desire but probably was because I started exercising hard. Some people feel various things, but most realistically, if you are a sad anxious balding man living a life going downhill and then you take something like fin and expect results in a month, you will probably pin every litle thing your feel to the drug, and it will be a lot of them because you will be hyper aware. Fin can also develop ginecomastia if you are kinda on the fatty side of the family, eat shit and don't move a muscle.",
            "author": "DarkGhost999",
            "id": "h5w560z",
            "parent_id": "t1_h5w2br0",
            "score": 20,
            "created_utc": 1626799013.0,
            "replies": [
                {
                    "body": "Thank you so much for the reply, i personally have a bold patch in my beard that kills the look of it and I'm a little hesitant on the idea if using Min but I'm not sure if I have any other options. Btw are side effects temporary or would they stick around for good?",
                    "author": "Neosam718",
                    "id": "h5wbsyk",
                    "parent_id": "t1_h5w560z",
                    "score": 3,
                    "created_utc": 1626801763.0,
                    "replies": [
                        {
                            "body": "There are no permanent side effects from minox, the substance effect last 12 hours (hence why twice a day max for faster, not \"better\", just faster results) and from there everything starts to go. The only permanent side effect of minox that I know of is a one in a trillion case of a hyper-responder guy who also had a rare medical condition and despite this he kept using unknown amounts of minox for a long time, the results were... lovecraftian. You better not know. I shouldn't even mention it because its extremely rare, but its in my knowledge and I can't lie.",
                            "author": "DarkGhost999",
                            "id": "h5we48n",
                            "parent_id": "t1_h5wbsyk",
                            "score": 8,
                            "created_utc": 1626802733.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "I’ve been on minox for about 3 months and the only side effect I felt was the headaches, but they went away after a few weeks. Started finasteride about a week ago and the headaches are about the same as I felt with minox. I just know they’re side effects I gotta deal with for a bit and they’ll go away. Also my endocrinologist told me finasteride can effect your liver, but since I get my blood work checked regularly, she gave me the green light to take the medication as i am healthy. Just a little heads up in case any of y’all have any liver issues.",
                    "author": "NerfNerd94",
                    "id": "hqslmxy",
                    "parent_id": "t1_h5w560z",
                    "score": 2,
                    "created_utc": 1641033781.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Sadly min always gave me a headache and increased my tinnitus",
            "author": "gin-o-cide",
            "id": "h5w7hed",
            "parent_id": "t1_h5w2br0",
            "score": 4,
            "created_utc": 1626799970.0,
            "replies": [
                {
                    "body": "oh man I have tinnitus too. I feel you man. Across time and space.",
                    "author": "DarkGhost999",
                    "id": "h5w8olm",
                    "parent_id": "t1_h5w7hed",
                    "score": 3,
                    "created_utc": 1626800467.0,
                    "replies": [
                        {
                            "body": "Stay strong brother. Remember, anxiety makes it worse!",
                            "author": "gin-o-cide",
                            "id": "h5w9tq5",
                            "parent_id": "t1_h5w8olm",
                            "score": 7,
                            "created_utc": 1626800943.0,
                            "replies": []
                        }
                    ]
                },
                {
                    "body": "A lot of tinnitus is low b vitamins. Take a super B supplement (one with at least 6 different types of vitamin b) and give it six weeks.",
                    "author": "TacoT1000",
                    "id": "h93qme9",
                    "parent_id": "t1_h5w7hed",
                    "score": 3,
                    "created_utc": 1629077749.0,
                    "replies": [
                        {
                            "body": "People like you are the worst.",
                            "author": "lars_jeppesen",
                            "id": "i34h071",
                            "parent_id": "t1_h93qme9",
                            "score": 0,
                            "created_utc": 1648917229.0,
                            "replies": []
                        },
                        {
                            "body": "Can confirm this isn’t the cause for me 🥲",
                            "author": "kbizz92",
                            "id": "jfgvuyx",
                            "parent_id": "t1_h93qme9",
                            "score": 1,
                            "created_utc": 1680975130.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "You just aren’t in the hair game bro, need to brush up on the vernacular. Hahaha",
            "author": "TinyEyedTim",
            "id": "h6yunz9",
            "parent_id": "t1_h5xnhj9",
            "score": 1,
            "created_utc": 1627573441.0,
            "replies": []
        },
        {
            "body": "Did the mods delete this, or did he?",
            "author": "zacboring",
            "id": "h6w1mvl",
            "parent_id": "t1_h6ur2j3",
            "score": 1,
            "created_utc": 1627513345.0,
            "replies": [
                {
                    "body": "What did he say?\n\n\nNot related but you should post this on r/Tressless.",
                    "author": "cobaltorange",
                    "id": "h6w6ui6",
                    "parent_id": "t1_h6w1mvl",
                    "score": 1,
                    "created_utc": 1627515857.0,
                    "replies": [
                        {
                            "body": "He was saying he didn’t believe the pictures were the same person and was asking for more proof, essentially. \n\nI totally forgot about that subreddit. I used to check it a few years back but had to stop because it was bumming me out. A lot of negativity over there at the time, if I remember correctly. Might have to look into it again",
                            "author": "zacboring",
                            "id": "h6x10cv",
                            "parent_id": "t1_h6w6ui6",
                            "score": 1,
                            "created_utc": 1627531074.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "Thank you so much for the reply, i personally have a bold patch in my beard that kills the look of it and I'm a little hesitant on the idea if using Min but I'm not sure if I have any other options. Btw are side effects temporary or would they stick around for good?",
            "author": "Neosam718",
            "id": "h5wbsyk",
            "parent_id": "t1_h5w560z",
            "score": 3,
            "created_utc": 1626801763.0,
            "replies": [
                {
                    "body": "There are no permanent side effects from minox, the substance effect last 12 hours (hence why twice a day max for faster, not \"better\", just faster results) and from there everything starts to go. The only permanent side effect of minox that I know of is a one in a trillion case of a hyper-responder guy who also had a rare medical condition and despite this he kept using unknown amounts of minox for a long time, the results were... lovecraftian. You better not know. I shouldn't even mention it because its extremely rare, but its in my knowledge and I can't lie.",
                    "author": "DarkGhost999",
                    "id": "h5we48n",
                    "parent_id": "t1_h5wbsyk",
                    "score": 8,
                    "created_utc": 1626802733.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I’ve been on minox for about 3 months and the only side effect I felt was the headaches, but they went away after a few weeks. Started finasteride about a week ago and the headaches are about the same as I felt with minox. I just know they’re side effects I gotta deal with for a bit and they’ll go away. Also my endocrinologist told me finasteride can effect your liver, but since I get my blood work checked regularly, she gave me the green light to take the medication as i am healthy. Just a little heads up in case any of y’all have any liver issues.",
            "author": "NerfNerd94",
            "id": "hqslmxy",
            "parent_id": "t1_h5w560z",
            "score": 2,
            "created_utc": 1641033781.0,
            "replies": []
        },
        {
            "body": "oh man I have tinnitus too. I feel you man. Across time and space.",
            "author": "DarkGhost999",
            "id": "h5w8olm",
            "parent_id": "t1_h5w7hed",
            "score": 3,
            "created_utc": 1626800467.0,
            "replies": [
                {
                    "body": "Stay strong brother. Remember, anxiety makes it worse!",
                    "author": "gin-o-cide",
                    "id": "h5w9tq5",
                    "parent_id": "t1_h5w8olm",
                    "score": 7,
                    "created_utc": 1626800943.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "A lot of tinnitus is low b vitamins. Take a super B supplement (one with at least 6 different types of vitamin b) and give it six weeks.",
            "author": "TacoT1000",
            "id": "h93qme9",
            "parent_id": "t1_h5w7hed",
            "score": 3,
            "created_utc": 1629077749.0,
            "replies": [
                {
                    "body": "People like you are the worst.",
                    "author": "lars_jeppesen",
                    "id": "i34h071",
                    "parent_id": "t1_h93qme9",
                    "score": 0,
                    "created_utc": 1648917229.0,
                    "replies": []
                },
                {
                    "body": "Can confirm this isn’t the cause for me 🥲",
                    "author": "kbizz92",
                    "id": "jfgvuyx",
                    "parent_id": "t1_h93qme9",
                    "score": 1,
                    "created_utc": 1680975130.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "What did he say?\n\n\nNot related but you should post this on r/Tressless.",
            "author": "cobaltorange",
            "id": "h6w6ui6",
            "parent_id": "t1_h6w1mvl",
            "score": 1,
            "created_utc": 1627515857.0,
            "replies": [
                {
                    "body": "He was saying he didn’t believe the pictures were the same person and was asking for more proof, essentially. \n\nI totally forgot about that subreddit. I used to check it a few years back but had to stop because it was bumming me out. A lot of negativity over there at the time, if I remember correctly. Might have to look into it again",
                    "author": "zacboring",
                    "id": "h6x10cv",
                    "parent_id": "t1_h6w6ui6",
                    "score": 1,
                    "created_utc": 1627531074.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "There are no permanent side effects from minox, the substance effect last 12 hours (hence why twice a day max for faster, not \"better\", just faster results) and from there everything starts to go. The only permanent side effect of minox that I know of is a one in a trillion case of a hyper-responder guy who also had a rare medical condition and despite this he kept using unknown amounts of minox for a long time, the results were... lovecraftian. You better not know. I shouldn't even mention it because its extremely rare, but its in my knowledge and I can't lie.",
            "author": "DarkGhost999",
            "id": "h5we48n",
            "parent_id": "t1_h5wbsyk",
            "score": 8,
            "created_utc": 1626802733.0,
            "replies": []
        },
        {
            "body": "Stay strong brother. Remember, anxiety makes it worse!",
            "author": "gin-o-cide",
            "id": "h5w9tq5",
            "parent_id": "t1_h5w8olm",
            "score": 7,
            "created_utc": 1626800943.0,
            "replies": []
        },
        {
            "body": "People like you are the worst.",
            "author": "lars_jeppesen",
            "id": "i34h071",
            "parent_id": "t1_h93qme9",
            "score": 0,
            "created_utc": 1648917229.0,
            "replies": []
        },
        {
            "body": "Can confirm this isn’t the cause for me 🥲",
            "author": "kbizz92",
            "id": "jfgvuyx",
            "parent_id": "t1_h93qme9",
            "score": 1,
            "created_utc": 1680975130.0,
            "replies": []
        },
        {
            "body": "He was saying he didn’t believe the pictures were the same person and was asking for more proof, essentially. \n\nI totally forgot about that subreddit. I used to check it a few years back but had to stop because it was bumming me out. A lot of negativity over there at the time, if I remember correctly. Might have to look into it again",
            "author": "zacboring",
            "id": "h6x10cv",
            "parent_id": "t1_h6w6ui6",
            "score": 1,
            "created_utc": 1627531074.0,
            "replies": []
        }
    ]
}