{
    "title": "SB told me she is bi and asked to bring another girl to the room. Turned out she brought her long term girlfriend. I feel it was wrong.",
    "post_id": "m8n5si",
    "post_url": "https://www.reddit.com/r/sugarlifestyleforum/comments/m8n5si/sb_told_me_she_is_bi_and_asked_to_bring_another/",
    "author": "hitonce_1919",
    "body": "So I am with this girl whose 27 and has a decent personality for around 4 months.\nin our first few dates she kept hinting that she can be okay with having another girl around or play with other girls (which I really don't like that much)..  Since our third intimidat she said it clearly that she is bi and would like to explore that side. I told her I am okay with that outside the relationship,  but she kept bringing it up.\nThen because of the new Lock down I asked her to move in with me for a few weeks, she agreed and we had a very great time together. And I wanted to make her happy so I agreed to bring a girl to play with.she made it clear that she wanted to select the girl not me.\nThen she told me she found a very nice girl she knew through SA and looks perfect. And she wanted to invite her for the weekend. The new girl came and we had a very nice time and the two seemed to bond so well. They spent most of the weekend together in her room and had just a few hours with me.. we had a few intimate time all together and me with each alone. \nThen the girl offered to stay with us for a week and without an allowance since she can't travel back to her city. She was scared of leaving so I agreed that she can stay and I will continue paying her for the whole week. \nThings didn't really go well. I felt left out the two girls enjoyed each other more than they did with me. I felt terrible and asked the girl to leave at the end of the week. Which was last Friday. \nMy SB didn't like that and reacted badly and cried. After a couple of drinks she told me she has been in a relationship with this girl for a long time and she was afraid if she told me that I would have not accepted.\nI asked the SB to leave and gave her allowance to stay in a hotel or travel.  Now she has been calling and apologizing and asking to reconsider and that she and her gf could both be SBs for me without paying extra allowance.\nThe girls are sweet but I kind of lost the connection and feel I was tricked or cheated. \n\nWas I right and justified to feel betrayed? Am I being over dramatic? Or should I move on?",
    "url": "https://www.reddit.com/r/sugarlifestyleforum/comments/m8n5si/sb_told_me_she_is_bi_and_asked_to_bring_another/",
    "score": 152,
    "upvote_ratio": 0.95,
    "created_utc": 1616177037.0,
    "num_comments": 75,
    "links": [
        []
    ],
    "comments": [
        {
            "body": "Doesn't matter if they fucked you or not...You suddenly became the 3rd most important person in your own damn house. You became a 3rd wheel.  Thats why it felt so uncomfortable/bad.\n\nGood for you standing up for yourself and kicking both out.",
            "author": "AlaskanSnowDragon",
            "id": "gri8tiz",
            "parent_id": "t3_m8n5si",
            "score": 210,
            "created_utc": 1616177483.0,
            "replies": [
                {
                    "body": "Yes, emotionally it wasn't easy to deal with. I felt like I was rejected by them",
                    "author": "hitonce_1919",
                    "id": "gricmfb",
                    "parent_id": "t1_gri8tiz",
                    "score": 64,
                    "created_utc": 1616179164.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "She should have told you who this girl was beforehand",
            "author": null,
            "id": "gri8d52",
            "parent_id": "t3_m8n5si",
            "score": 68,
            "created_utc": 1616177285.0,
            "replies": []
        },
        {
            "body": "I'd have some questions about letting either of them live in my house, beginning with why your SB was so gung-ho to get a threesome going with her partner to the point she lied about it, and now why they are begging to both live with you. And, if past is precedent, I don't know that you're going to get straight answers if you try to have an open, honest, adult conversation about it. This sounds like a situation I'd avoid all together and move on from.",
            "author": "Cledaddy23",
            "id": "gribusr",
            "parent_id": "t3_m8n5si",
            "score": 52,
            "created_utc": 1616178828.0,
            "replies": [
                {
                    "body": "I thought it was a fetish she wants to explore. But it was a terrible way of introducing her gf to my life",
                    "author": "hitonce_1919",
                    "id": "gricsir",
                    "parent_id": "t1_gribusr",
                    "score": 24,
                    "created_utc": 1616179240.0,
                    "replies": [
                        {
                            "body": "It was also terrible of her not to respect your boundaries when you expressed disinterest in the first place.",
                            "author": "Cledaddy23",
                            "id": "griyq8u",
                            "parent_id": "t1_gricsir",
                            "score": 20,
                            "created_utc": 1616189590.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "The easy part is that yes, not telling you was wrong on her part, but making you feel like an outside in your own SR -- and your own home -- is absolutely grounds for considering ending the SR.\n\nThe more difficult questions are the ones you should be asking yourself.  I'd start with why you let in a third person when you were ostensibly quarantining (that was your rationalizing for inviting her to live with you, right?).  You said you wanted to make her happy, which is great, but in light of the rest of the context, I have a feeling this was more about reactively giving in to her, than proactively making her happy.\n\nThen, the girl comes over, they stay together in the room and make you feel like an outsider, and your reaction is ... to let her stay a whole week.  I'm going to be blunt: this is a spineless inability to set and stick with your own boundaries, and is a dangerous (to you) personality flaw in the bowl.  If you'd put your foot down right there, this entire story might have been different -- and more importantly, ended differently.   We often, understandably, see young SBs manipulated or intimidated into not protecting their boundaries; it isn't as often than an SD does it.  Not trying to throw shade, but giving you advice like I'd give an SB who had put herself in a bad position due to not defending her boundaries: do some introspection, and consider leaving the bowl if you can't stick up for yourself.\n\nGood for you for asking her to leave at week's end, and ending the SR.    Like you, I find that this isn't a matter of forgiveness.  If I feel betrayed, that magical love bubble pops and it's not possible to get it back.  I might forgive her, but if the bubble pops, wouldn't be able to re-start the SR.",
            "author": "Azurecole",
            "id": "gridhn4",
            "parent_id": "t3_m8n5si",
            "score": 41,
            "created_utc": 1616179554.0,
            "replies": [
                {
                    "body": "What she did was wrong, by not expressing she had a GF before they even started the SR, BUT - her wanting to have her own personal space and her own personal time in his home is not what’s to blame here. Even in a SR or when sharing housing quarters, a woman (or man) is allowed to have alone time. Arrangements are not a 100% full time job unless it’s serious enough to where marriage is being discussed or they’re dating without an allowance. “Feeling like an outsider in his own arrangement” sounds very stretched to me. He was hurt that she lied the entire time (which is understandable on his part), but you should just leave it at that without all the extra dramatization.",
                    "author": "upscaleitalia",
                    "id": "grk2ur6",
                    "parent_id": "t1_gridhn4",
                    "score": 3,
                    "created_utc": 1616212053.0,
                    "replies": [
                        {
                            "body": ">her wanting to have her own personal space and her own personal time in his home is not what’s to blame here.\n\nYou're making that up... I'm not sure why.  His exactly words were \"They spent most of the weekend together in her room and had just a few hours with me\".  There's a difference between taking some personal space, and spending almost no time with your SD/host.\n\n>Arrangements are not a 100% full time job unless it’s serious enough to  where marriage is being discussed or they’re dating without an  allowance.\n\nThat's a strawman -- no one said it's a 100% full time job, so there's no reason to argue that that's not what it is.  But it's also not \"move into his house, lie about bringing in your longterm girlfriend, spend almost no time with your SD and all the time locked away with her\".  I've never been with an SB for a few days and not spent time together, more than just a few hours.\n\nIf this were just about a little personal time, this entire post wouldn't be here.\n\n>“Feeling like an outsider in his own arrangement” sounds very stretched to me.\n\nIt's not stretched, it's basically what he said -- he felt left out\n\nI agree that in the scenario you *invented* \\-- she and the girlfriend hadn't lied about their relationship, and they took some alone time but also spent time with him and made him feel included -- that's no issue at all.  That's basically the dream.  But the actual scenario does not describe that.  If someone posts the scenario you described -- that is, one totally different than in this post -- I'd be with you.",
                            "author": "Azurecole",
                            "id": "grk43af",
                            "parent_id": "t1_grk2ur6",
                            "score": 7,
                            "created_utc": 1616212874.0,
                            "replies": [
                                {
                                    "body": "There’s a difference between seeing your SB for a few days on a trip, and actually living together. She could have spent time with him the entire 3 weeks out of the month without a pause, and she spent one weekend to herself. There’s absolutely nothing wrong with that. Again, arrangements aren’t a full time job. They crossed the line when they moved in with one another. They should not have done that at all. He was looking for the cheapest way to help her out, and she was looking for the easiest escape-route to have little to no responsibility, while having a girlfriend. They’re both in the wrong.",
                                    "author": "upscaleitalia",
                                    "id": "grm6i6h",
                                    "parent_id": "t1_grk43af",
                                    "score": 1,
                                    "created_utc": 1616266374.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "First, what she did was wrong -- bringing in another person under the false pretext that she was just someone she found/knew from SA. It was dishonest.\n\nSecond, she treated you really poorly once the other woman was there.\n\nWhen I add those up, for me it'd be a \"see ya.\"  I don't blame you for losing the connection, at all.\n\nIt's always up to you if you want to give her, or them, another chance. But my vote is that you did not overreact whatsoever.  And if you never want to see either of them again that's perfectly reasonable and to me expected.",
            "author": null,
            "id": "grii6iw",
            "parent_id": "t3_m8n5si",
            "score": 17,
            "created_utc": 1616181721.0,
            "replies": []
        },
        {
            "body": "Let’s cross post this r/AmITheAsshole\n\n\nNTA\n(Not the Asshole)\n\n\nWhat they did to you was shitty. Sounds like they’re trying to get one over on you... good job standing up for yourself!",
            "author": "hereyougococo",
            "id": "grja11l",
            "parent_id": "t3_m8n5si",
            "score": 6,
            "created_utc": 1616195480.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "grifoee",
            "parent_id": "t3_m8n5si",
            "score": 11,
            "created_utc": 1616180555.0,
            "replies": [
                {
                    "body": "> I prefer to only sexually disappoint one woman at a time.\n\nhaha....thats an exact thing I say when subject of 3-somes ever come up. \"most guys have a hard enough time pleasing one girl, what the hell you gonna do with 2, now you'll just have 2 girls talking shit about you\" lol",
                    "author": "AlaskanSnowDragon",
                    "id": "grij3y0",
                    "parent_id": "t1_grifoee",
                    "score": 10,
                    "created_utc": 1616182154.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "gripsqk",
            "parent_id": "t3_m8n5si",
            "score": 25,
            "created_utc": 1616185217.0,
            "replies": [
                {
                    "body": "I'd like to sign up as well 🥺",
                    "author": "Mothernaturestits",
                    "id": "grizuhz",
                    "parent_id": "t1_gripsqk",
                    "score": 4,
                    "created_utc": 1616190158.0,
                    "replies": []
                },
                {
                    "body": "Same",
                    "author": "askredditwaytoomuch",
                    "id": "grj501l",
                    "parent_id": "t1_gripsqk",
                    "score": 1,
                    "created_utc": 1616192795.0,
                    "replies": []
                }
            ]
        },
        {
            "body": ">Or should I move on?\n\n>So I am with this girl whose 27 and has a decent personality for around 4 months\n\nYou should move on, especially if she's only decent and not amazing.",
            "author": "FFBraver",
            "id": "grjl285",
            "parent_id": "t3_m8n5si",
            "score": 5,
            "created_utc": 1616201534.0,
            "replies": []
        },
        {
            "body": "My take: it was wrong of her to bring her girlfriend along and frame it as if she is just another girl she knows from SA, but I have to ask - why did you even let the other woman over in the first place if you didn’t want it that much?\n\nYour story sounds like a series of poor choices on your end, not upholding your boundaries and not clearly communicating how you felt every time something changed. \n\nYou didn’t want another woman, but allowed it anyway. You felt like your SB was closer and spending more time with the other woman, didn’t say anything, and then proceeded to allow the other woman to stay for a week. You continued to feel left out, didn’t express your feelings, and then kicked out the other girl. Your SB then got emotional, spilled the beans, and then you kicked her out too. \n\nNone of this would have happened if you had simply said “No” when she asked about bringing in another woman. Your SB wasn’t going to die without being with another woman for the few weeks while she was with you and if she felt she was, then she should not have been staying with you in the first place.\n\nI think unfortunately this is a great lesson for you about staying more firm on your boundaries and desired relationship dynamics.",
            "author": "GlitterAndSugar",
            "id": "griyz3j",
            "parent_id": "t3_m8n5si",
            "score": 8,
            "created_utc": 1616189717.0,
            "replies": []
        },
        {
            "body": "[deleted]",
            "author": null,
            "id": "grihvos",
            "parent_id": "t3_m8n5si",
            "score": 17,
            "created_utc": 1616181582.0,
            "replies": [
                {
                    "body": "right... i m like i wish these were my only sb problems...lol",
                    "author": "Buckeyechamp21",
                    "id": "grj7vcx",
                    "parent_id": "t1_grihvos",
                    "score": 7,
                    "created_utc": 1616194319.0,
                    "replies": []
                },
                {
                    "body": "😂",
                    "author": "mraspencer",
                    "id": "grik1gv",
                    "parent_id": "t1_grihvos",
                    "score": 2,
                    "created_utc": 1616182591.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Your feelings are valid and they created a really awkward situation. It actually sounds awful. Having a sugar relationship is great because you can be pretty honest about your relationship status and sex. Maybe this SB was a newbie. But I think you should stay away as they don’t seem to make you feel good. There’s no point in being in a sugar relationship if you feel left out.",
            "author": "Adira5",
            "id": "grjavly",
            "parent_id": "t3_m8n5si",
            "score": 3,
            "created_utc": 1616195937.0,
            "replies": []
        },
        {
            "body": "Tough one.\nShe stuffed up and went about things totally wrong.\n\nIf you haven’t already emotionally switched off and mentally moved on I’d meet her for a talk. Then decide.\n\nSounds like you did get on well prior.",
            "author": "sydsyd3",
            "id": "griom7l",
            "parent_id": "t3_m8n5si",
            "score": 5,
            "created_utc": 1616184670.0,
            "replies": []
        },
        {
            "body": "\"It's like you discovered plutonium by accident!!\"",
            "author": "Binnsken",
            "id": "grj1wun",
            "parent_id": "t3_m8n5si",
            "score": 4,
            "created_utc": 1616191205.0,
            "replies": []
        },
        {
            "body": "I realize the world is different post-Covid but a live- in threesome is usually every guy’s fantasy",
            "author": "mraspencer",
            "id": "grik6wh",
            "parent_id": "t3_m8n5si",
            "score": 5,
            "created_utc": 1616182662.0,
            "replies": [
                {
                    "body": "In my mind, that fantasy only checks out if its FMF, and not in the slightest if its FFM, (which is what OP stumbled into ...)",
                    "author": "Gemini-Fox",
                    "id": "griw4df",
                    "parent_id": "t1_grik6wh",
                    "score": 6,
                    "created_utc": 1616188289.0,
                    "replies": [
                        {
                            "body": "FF      M",
                            "author": null,
                            "id": "griydxk",
                            "parent_id": "t1_griw4df",
                            "score": 6,
                            "created_utc": 1616189417.0,
                            "replies": []
                        },
                        {
                            "body": "You do know the order of the letters really is only a \"thing\" in subs like this and in more recent years. \n\nI promise, if you search pornhub for MMF, the dudes aren't playing with each other.",
                            "author": "mraspencer",
                            "id": "griyckd",
                            "parent_id": "t1_griw4df",
                            "score": 1,
                            "created_utc": 1616189399.0,
                            "replies": [
                                {
                                    "body": "don't ruin it for me haha",
                                    "author": "Gemini-Fox",
                                    "id": "griyvvm",
                                    "parent_id": "t1_griyckd",
                                    "score": 2,
                                    "created_utc": 1616189671.0,
                                    "replies": []
                                },
                                {
                                    "body": "Okay honestly as someone who used to browse pornhub a lot I had to start searching “MFM” and not “MMF” sooo... 🤷‍♀️ I think its becoming more mainstream",
                                    "author": "galactosegirl",
                                    "id": "grj16ix",
                                    "parent_id": "t1_griyckd",
                                    "score": 2,
                                    "created_utc": 1616190833.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                },
                {
                    "body": "I bet...",
                    "author": null,
                    "id": "grira4e",
                    "parent_id": "t1_grik6wh",
                    "score": 1,
                    "created_utc": 1616185916.0,
                    "replies": []
                },
                {
                    "body": "Not when they treat him as he described.",
                    "author": null,
                    "id": "grjntei",
                    "parent_id": "t1_grik6wh",
                    "score": 1,
                    "created_utc": 1616203083.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "You did the right thing, she wanted you to cover the bill for her GF coming over. If she would have presented it that way things would have gone better with honesty. Being the 3rd wheel sucks when she sold the package to you as a fantasy type thing. She can go play with her girlfriend at home , you can move on to someone better for you",
            "author": "KnocDown",
            "id": "grinks6",
            "parent_id": "t3_m8n5si",
            "score": 4,
            "created_utc": 1616184196.0,
            "replies": []
        },
        {
            "body": "Hmm I understand why you would feel that way. Your feelings are totally valid and you aren't overreacting. I think you should let her go. There are plenty of other sugar babies on sugarbook and seeking. You don't need to stay with her if you are uncomfortable.",
            "author": "yukiiiiiiie",
            "id": "grj5gmw",
            "parent_id": "t3_m8n5si",
            "score": 2,
            "created_utc": 1616193035.0,
            "replies": []
        },
        {
            "body": "This is why I avoid any threesomes",
            "author": "RealisticSD",
            "id": "grjwpfu",
            "parent_id": "t3_m8n5si",
            "score": 2,
            "created_utc": 1616208186.0,
            "replies": []
        },
        {
            "body": "I’m sorry but it honestly sounds like they‘re hustlers.  \nYou’re not being over-dramatic; they’re both trying to play you.",
            "author": "SilverStateNative",
            "id": "grizww7",
            "parent_id": "t3_m8n5si",
            "score": 3,
            "created_utc": 1616190190.0,
            "replies": []
        },
        {
            "body": "I'm calling BS",
            "author": "bdogdog",
            "id": "grjf6zd",
            "parent_id": "t3_m8n5si",
            "score": 4,
            "created_utc": 1616198292.0,
            "replies": []
        },
        {
            "body": "Just dump her.  She lied about the other girl.  If they come together you will always be left out.",
            "author": "wb19081908",
            "id": "grilu7p",
            "parent_id": "t3_m8n5si",
            "score": 2,
            "created_utc": 1616183427.0,
            "replies": []
        },
        {
            "body": "The main reason I do not like FMF threesomes. I spend too much time watching.\n\nIn this case, you had a good time with each. They like you and each other. What is the problem? Are you jealous you were not the center of attention 24/7.  Isn't it better that your SB has someone she cares for rather than a stranger who may not be compatible with her? \n\nLet her back, and the girlfriend too.",
            "author": "AFSMSgt",
            "id": "gritaxu",
            "parent_id": "t3_m8n5si",
            "score": 1,
            "created_utc": 1616186901.0,
            "replies": [
                {
                    "body": "> Isn't it better that your SB has someone she cares for rather than a stranger who may not be compatible with her?\n\nSure, and god speed.  They can love each other over the horizon.\n\nBut in terms of a transactional SB relationship, no that's not ok.  If they want to be with each other that much, they should support each other, and not expect a third wheel to sit in the corner and support one or both.",
                    "author": "sexytimeinseattle",
                    "id": "grj34vj",
                    "parent_id": "t1_gritaxu",
                    "score": 1,
                    "created_utc": 1616191833.0,
                    "replies": [
                        {
                            "body": "You have a point",
                            "author": "AFSMSgt",
                            "id": "grj6d3h",
                            "parent_id": "t1_grj34vj",
                            "score": 1,
                            "created_utc": 1616193517.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "If it was me, I would give them another shot.  What's the harm to try since it seems they would like to reconcile things?  Maybe you can express what you would like different from them in terms of more balanced time.",
            "author": "mike_o212",
            "id": "griarzx",
            "parent_id": "t3_m8n5si",
            "score": 0,
            "created_utc": 1616178345.0,
            "replies": []
        },
        {
            "body": "It's an arrangement, not your girl friend. You had two women living with you, having sex with you. I think you should set some ground rules like your expectations but besides that, I think that was a perfect setup and you blew it.\n\nI previously had an arrangement with two best friends for two years and it was the best two years of my life.",
            "author": "askredditwaytoomuch",
            "id": "grj5b3y",
            "parent_id": "t3_m8n5si",
            "score": 1,
            "created_utc": 1616192955.0,
            "replies": [
                {
                    "body": ">It's an arrangement, not your girl friend. \n\nIt's an arrangement, not his escort.   There is, practically by definition, some level of strings attached and emotional intimacy -- there's a relationship aspect to this, if not, he's just seeing an escort and calling it something else.  And that relationship aspect might not have the same obligations to each other that a boyfriend/girlfriend relationship has, but it does come with some basic expectations around respect (and making him feel like a 3rd wheel in his own SR and own home, that's pure disrespect).\n\nAnyway, just a different perspective.",
                    "author": "Azurecole",
                    "id": "grj88j6",
                    "parent_id": "t1_grj5b3y",
                    "score": 0,
                    "created_utc": 1616194519.0,
                    "replies": []
                }
            ]
        },
        {
            "body": ">Was I right and justified to feel betrayed? Am I being over dramatic? Or should I move on? \n\nNo. Yes. Yes.\n\nOkay, let me add some detail here.\n\n* Betrayal - I simply do not see that. Definitely taken advantage of with your SB and her GF basically getting free rent.\n* Dramatic - totally dude. You're the SD, more experienced and mature. You should not be the drama queen in the relationship. Now, none of that is to say your feelings are not valid. Being angry, frustrated, shut out, and more - are all totally fair. But your description definitely shows a bit on a drama side\n* Moving on - if you've lost the connection - totally. Especially since you noted that you're not into the threesome situation",
            "author": "sfwinefan",
            "id": "grict2d",
            "parent_id": "t3_m8n5si",
            "score": 0,
            "created_utc": 1616179247.0,
            "replies": [
                {
                    "body": "I agree betrayal is a strong word.  But mislead to the point of being hurt or insulted is valid.\n\nAnd I think hes only being overly dramatic in the sense he thought about it too much.  Soon as realized he was being 3rd wheeled let alone being lied to shoulda just been a clean cut. Just chop away the dead weight and tell them to GTFO your house.  \nBut dude made the mistake of catching feels for his SB...Thats his big mistake really.",
                    "author": "AlaskanSnowDragon",
                    "id": "gridwb3",
                    "parent_id": "t1_grict2d",
                    "score": 3,
                    "created_utc": 1616179738.0,
                    "replies": []
                },
                {
                    "body": "Not rent free ... the GF is having sex with him too... he already has his SB there, the incremental cost of GF is minuscule ... seriously lots of guys would die for this situation.",
                    "author": "daddoms",
                    "id": "grid8el",
                    "parent_id": "t1_grict2d",
                    "score": 0,
                    "created_utc": 1616179439.0,
                    "replies": [
                        {
                            "body": "Re-read the OP's post, he continued to pay an allowance to the both of them ...\n\n>I agreed that she can stay and I will continue paying her for the whole week.\n\nNow, on to your point:\n\n>seriously lots of guys would die for this situation \n\n1. True\n2. The OP does not sound like one of them (which is the important part for this thread)",
                            "author": "sfwinefan",
                            "id": "grie09r",
                            "parent_id": "t1_grid8el",
                            "score": 5,
                            "created_utc": 1616179789.0,
                            "replies": [
                                {
                                    "body": "No guys would die for the situation where they're third-wheeled in their own SR and own home.  And that, I think, is the real crux of the matter, all magnified by the fact that when he saw he was getting third wheeled, his reaction was to reward them by letting her stay the whole week with allowance.  \n\nWithout the third wheeling, agree it could be quite a fun situation.  But if the queen had balls, and all that.",
                                    "author": "Azurecole",
                                    "id": "griekx1",
                                    "parent_id": "t1_grie09r",
                                    "score": 5,
                                    "created_utc": 1616180051.0,
                                    "replies": []
                                },
                                {
                                    "body": "Yes 🙌 again to each their own.",
                                    "author": "daddoms",
                                    "id": "griehxu",
                                    "parent_id": "t1_grie09r",
                                    "score": 0,
                                    "created_utc": 1616180014.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "The dishonesty itself would be enough to make me end an arrangement-- one that maybe if it had been presented honestly, might not have in itself been a dealbreaker depending on your feelings toward it. But she got you to pay her to give that other girl sugar and that's just not what the arrangement was.",
            "author": "ColdHeaux",
            "id": "grj3jze",
            "parent_id": "t3_m8n5si",
            "score": 1,
            "created_utc": 1616192054.0,
            "replies": []
        },
        {
            "body": "You're too good for these girls and seems like you're getting used. If they look at such a sweet hearted generous person and feel entitled and justified to take what they want from you with no regard to the feelings of the provider, well that is super fucked up and they need to leave. \n\nShe isn't an honest person and lied about something HUGE! How could you ever trust her again , she lied from the very beginning and probably only told you since she feared you'd find out first. By allowing this to slide, you're enabling her to continue with her extreme dishonesty and disrespect since she knows she can get away with it and still gets what she wants.\n\nWe have all been so lonely that we will stay with a toxic person since it seems better than being alone..but the shit you have to deal with is never ever worth it and it just eats into your happiness together and for yourself. Plus, the longer you stay with toxic people , the longer you won't meet the right fit since they're making you unavailable, and you will carry the damage you get from the toxic relationship which is going to negatively impact future relationships, may even cause you to avoid the good ones even since we get jaded.\n\nYou deserve so much better and to be valued as the gift you truly are. Any woman would lucky to have the treasure of your kindness and your company ❤️",
            "author": "kimchi_Queen",
            "id": "grkukp7",
            "parent_id": "t3_m8n5si",
            "score": 1,
            "created_utc": 1616238150.0,
            "replies": [
                {
                    "body": "this post is filled with wisdom.",
                    "author": "wikishart",
                    "id": "grm4ybs",
                    "parent_id": "t1_grkukp7",
                    "score": 2,
                    "created_utc": 1616265713.0,
                    "replies": [
                        {
                            "body": "Awe thanks :) \n\nThe good ones keep being good, even when they're being taken advantage of by bad people.\n\nThe bad ones feel they are always being taken advantage of even when they have done no good.",
                            "author": "kimchi_Queen",
                            "id": "grmzcwx",
                            "parent_id": "t1_grm4ybs",
                            "score": 1,
                            "created_utc": 1616278926.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "OMG dude, really? Betrayed? What are you thinking. If you aren’t into that just be nice.\n\nMy take: she said she is bi. You aren’t comfortable but said it’s ok outside your relationship. She has a GF outside your relationship. The mistake was trying to be a throuple. Throuples are hard.",
            "author": "daddoms",
            "id": "grib31f",
            "parent_id": "t3_m8n5si",
            "score": 0,
            "created_utc": 1616178482.0,
            "replies": [
                {
                    "body": "She was sneaky. I felt like a idiot when she told me the truth",
                    "author": "hitonce_1919",
                    "id": "gricx5s",
                    "parent_id": "t1_grib31f",
                    "score": 1,
                    "created_utc": 1616179298.0,
                    "replies": [
                        {
                            "body": "Don’t feel like an idiot. She’s bi, that’s who she is. You can’t change that. She was likely apprehensive about telling you for fear you’d be judgmental. You don’t have to continue in any relationship you aren’t comfortable with, but you aren’t an idiot.",
                            "author": "daddoms",
                            "id": "griecb6",
                            "parent_id": "t1_gricx5s",
                            "score": -2,
                            "created_utc": 1616179943.0,
                            "replies": [
                                {
                                    "body": "Bi doesn't mean dishonest ✨ not all bi people need/want more than one person",
                                    "author": "Mothernaturestits",
                                    "id": "grj00c6",
                                    "parent_id": "t1_griecb6",
                                    "score": 6,
                                    "created_utc": 1616190239.0,
                                    "replies": [
                                        {
                                            "body": "How am I even implying that bi is dishonest??? I’m just saying that someone who holds back part of their identity might be apprehensive. I’m not saying that anyone has an obligation to tell their entire identity either. If you want to be with her then accept her for who she is.",
                                            "author": "daddoms",
                                            "id": "grj1nv2",
                                            "parent_id": "t1_grj00c6",
                                            "score": -1,
                                            "created_utc": 1616191078.0,
                                            "replies": [
                                                {
                                                    "body": "Ah, my mistake then. I misunderstood what you were implying.",
                                                    "author": "Mothernaturestits",
                                                    "id": "grj1rse",
                                                    "parent_id": "t1_grj1nv2",
                                                    "score": 2,
                                                    "created_utc": 1616191133.0,
                                                    "replies": []
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "Get them back and just sleep with the friend for a couple of weeks ... see how that goes down (I’m joking obviously)",
            "author": "OneMore97",
            "id": "grklokc",
            "parent_id": "t3_m8n5si",
            "score": 0,
            "created_utc": 1616228443.0,
            "replies": []
        },
        {
            "body": "Dude that's like most guys dream come true your crazy for asking them to leave .....",
            "author": "Funguy3435",
            "id": "grk1uph",
            "parent_id": "t3_m8n5si",
            "score": -1,
            "created_utc": 1616211402.0,
            "replies": []
        },
        {
            "body": "Yes your being ove dramatic now if that was my girlfriend and should was bi I would accept her for who she is and do anything for her to put a smile on her face",
            "author": "Infamous_Option8161",
            "id": "grk5hnv",
            "parent_id": "t3_m8n5si",
            "score": -1,
            "created_utc": 1616213848.0,
            "replies": [
                {
                    "body": "This is not about OP accepting her being bi. They clearly do. This is about the SB lying about being in a relationship with a girl who she was already in a relationship with.",
                    "author": "Killer_Yandere",
                    "id": "grk9nb1",
                    "parent_id": "t1_grk5hnv",
                    "score": 2,
                    "created_utc": 1616216950.0,
                    "replies": [
                        {
                            "body": "yeah she basically put forth a trap to direct funds to her girlfriend. That's the problem. I don't know why people are going into the \"bi people don't have to date you\" etc. kinds of lines of thinking.\n\nThey conspired to find a way to extract more money out of the guy. He feels badly used (which he was). He's hurt (he should be). People telling him to suck it up and not be a drama queen are asking for toxic masculinity. \n\nHe's human, he got used badly, he has feelings, he feels like an object and not a person. He's entitled to be hurt.",
                            "author": "wikishart",
                            "id": "grm3zti",
                            "parent_id": "t1_grk9nb1",
                            "score": 2,
                            "created_utc": 1616265314.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I don't understand why they didn't just bring it up to begin with. I would have reacted the same way. Really can't stand anyone lying to me.",
            "author": "lowyellyow",
            "id": "griung8",
            "parent_id": "t3_m8n5si",
            "score": 1,
            "created_utc": 1616187558.0,
            "replies": [
                {
                    "body": "some people seem to lie by default.",
                    "author": "wikishart",
                    "id": "grm3ozr",
                    "parent_id": "t1_griung8",
                    "score": 1,
                    "created_utc": 1616265192.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "I’m so sorry you had to go through that.  That is deceiving on her part.",
            "author": "Calypso2040",
            "id": "grk4nw3",
            "parent_id": "t3_m8n5si",
            "score": 1,
            "created_utc": 1616213268.0,
            "replies": []
        },
        {
            "body": "Move on",
            "author": "kryptik808",
            "id": "grkejjv",
            "parent_id": "t3_m8n5si",
            "score": 1,
            "created_utc": 1616221165.0,
            "replies": []
        },
        {
            "body": "Jfc. The entertainment of this sub is so good. \"My sb tricked me into thinking our threesome was with a random sb . It turned out to be her gf, so when I cut her off, they offered me a 2 for 1 deal, both live in . I'm still very pisded so I said no\" it's like an episode of Maury lol. Tbh my dream is to have 2 sbs living with me, and they are best friends lol.",
            "author": "dade_murphy1",
            "id": "grkpnsq",
            "parent_id": "t3_m8n5si",
            "score": 1,
            "created_utc": 1616232837.0,
            "replies": []
        },
        {
            "body": "Sounds like they were trying to take advantage.",
            "author": null,
            "id": "grl2mtk",
            "parent_id": "t3_m8n5si",
            "score": 1,
            "created_utc": 1616245003.0,
            "replies": []
        },
        {
            "body": "Another sucker exploited by savvy professionals.",
            "author": "IAMDIRECT",
            "id": "grl3v9e",
            "parent_id": "t3_m8n5si",
            "score": 1,
            "created_utc": 1616245850.0,
            "replies": []
        },
        {
            "body": "😭, kinda sad story , I feel sorry for girls",
            "author": "LongETH",
            "id": "grlciew",
            "parent_id": "t3_m8n5si",
            "score": 1,
            "created_utc": 1616251173.0,
            "replies": []
        },
        {
            "body": "Totally understandable man, you were definitely the 3rd wheel and I would’ve reacted the same way so don’t feel bad at all because trust me they didn’t.",
            "author": "Mary1945",
            "id": "grlnsig",
            "parent_id": "t3_m8n5si",
            "score": 1,
            "created_utc": 1616257195.0,
            "replies": []
        },
        {
            "body": "Doesn't make it right but sounds like they were probably really struggling to the point where sugar was a last resort to pay bills and it hurt for them to be apart.",
            "author": "brock0791",
            "id": "grlptro",
            "parent_id": "t3_m8n5si",
            "score": 1,
            "created_utc": 1616258252.0,
            "replies": []
        },
        {
            "body": "Seems like the group consensus is that failing to tell the truth, then admitting it and apologizing, is an unforgivable offense. I don't agree. OP, you weren't so excited about the threesome, but it sounds like the sex was good. They just didn't spend a lot of time with you aside from the sex. And they tried to manipulate you into letting them stay together instead of he my truthful, which they scorekeeper was wrong\n\nIt doesn't seem like a bad setup to me, and my advice would be to try it one more with the request that you want more social time, too, because you felt a little left out. If you like the result you win. If not you move on. But you play it out with what was a good SB. The potential upside seems very big!\n\nPeople make mistakes and do hurtful things in relationships - if the rule is one strike and you're out, we'd all be lonely",
            "author": "ziggy440",
            "id": "grlxthn",
            "parent_id": "t3_m8n5si",
            "score": 1,
            "created_utc": 1616262305.0,
            "replies": []
        },
        {
            "body": "lies lies lies\nseems it's the norm huh?",
            "author": "GeneAsBob",
            "id": "grnacyl",
            "parent_id": "t3_m8n5si",
            "score": 1,
            "created_utc": 1616283943.0,
            "replies": []
        },
        {
            "body": "Yes, emotionally it wasn't easy to deal with. I felt like I was rejected by them",
            "author": "hitonce_1919",
            "id": "gricmfb",
            "parent_id": "t1_gri8tiz",
            "score": 64,
            "created_utc": 1616179164.0,
            "replies": []
        },
        {
            "body": "I thought it was a fetish she wants to explore. But it was a terrible way of introducing her gf to my life",
            "author": "hitonce_1919",
            "id": "gricsir",
            "parent_id": "t1_gribusr",
            "score": 24,
            "created_utc": 1616179240.0,
            "replies": [
                {
                    "body": "It was also terrible of her not to respect your boundaries when you expressed disinterest in the first place.",
                    "author": "Cledaddy23",
                    "id": "griyq8u",
                    "parent_id": "t1_gricsir",
                    "score": 20,
                    "created_utc": 1616189590.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "What she did was wrong, by not expressing she had a GF before they even started the SR, BUT - her wanting to have her own personal space and her own personal time in his home is not what’s to blame here. Even in a SR or when sharing housing quarters, a woman (or man) is allowed to have alone time. Arrangements are not a 100% full time job unless it’s serious enough to where marriage is being discussed or they’re dating without an allowance. “Feeling like an outsider in his own arrangement” sounds very stretched to me. He was hurt that she lied the entire time (which is understandable on his part), but you should just leave it at that without all the extra dramatization.",
            "author": "upscaleitalia",
            "id": "grk2ur6",
            "parent_id": "t1_gridhn4",
            "score": 3,
            "created_utc": 1616212053.0,
            "replies": [
                {
                    "body": ">her wanting to have her own personal space and her own personal time in his home is not what’s to blame here.\n\nYou're making that up... I'm not sure why.  His exactly words were \"They spent most of the weekend together in her room and had just a few hours with me\".  There's a difference between taking some personal space, and spending almost no time with your SD/host.\n\n>Arrangements are not a 100% full time job unless it’s serious enough to  where marriage is being discussed or they’re dating without an  allowance.\n\nThat's a strawman -- no one said it's a 100% full time job, so there's no reason to argue that that's not what it is.  But it's also not \"move into his house, lie about bringing in your longterm girlfriend, spend almost no time with your SD and all the time locked away with her\".  I've never been with an SB for a few days and not spent time together, more than just a few hours.\n\nIf this were just about a little personal time, this entire post wouldn't be here.\n\n>“Feeling like an outsider in his own arrangement” sounds very stretched to me.\n\nIt's not stretched, it's basically what he said -- he felt left out\n\nI agree that in the scenario you *invented* \\-- she and the girlfriend hadn't lied about their relationship, and they took some alone time but also spent time with him and made him feel included -- that's no issue at all.  That's basically the dream.  But the actual scenario does not describe that.  If someone posts the scenario you described -- that is, one totally different than in this post -- I'd be with you.",
                    "author": "Azurecole",
                    "id": "grk43af",
                    "parent_id": "t1_grk2ur6",
                    "score": 7,
                    "created_utc": 1616212874.0,
                    "replies": [
                        {
                            "body": "There’s a difference between seeing your SB for a few days on a trip, and actually living together. She could have spent time with him the entire 3 weeks out of the month without a pause, and she spent one weekend to herself. There’s absolutely nothing wrong with that. Again, arrangements aren’t a full time job. They crossed the line when they moved in with one another. They should not have done that at all. He was looking for the cheapest way to help her out, and she was looking for the easiest escape-route to have little to no responsibility, while having a girlfriend. They’re both in the wrong.",
                            "author": "upscaleitalia",
                            "id": "grm6i6h",
                            "parent_id": "t1_grk43af",
                            "score": 1,
                            "created_utc": 1616266374.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "> I prefer to only sexually disappoint one woman at a time.\n\nhaha....thats an exact thing I say when subject of 3-somes ever come up. \"most guys have a hard enough time pleasing one girl, what the hell you gonna do with 2, now you'll just have 2 girls talking shit about you\" lol",
            "author": "AlaskanSnowDragon",
            "id": "grij3y0",
            "parent_id": "t1_grifoee",
            "score": 10,
            "created_utc": 1616182154.0,
            "replies": []
        },
        {
            "body": "I'd like to sign up as well 🥺",
            "author": "Mothernaturestits",
            "id": "grizuhz",
            "parent_id": "t1_gripsqk",
            "score": 4,
            "created_utc": 1616190158.0,
            "replies": []
        },
        {
            "body": "Same",
            "author": "askredditwaytoomuch",
            "id": "grj501l",
            "parent_id": "t1_gripsqk",
            "score": 1,
            "created_utc": 1616192795.0,
            "replies": []
        },
        {
            "body": "right... i m like i wish these were my only sb problems...lol",
            "author": "Buckeyechamp21",
            "id": "grj7vcx",
            "parent_id": "t1_grihvos",
            "score": 7,
            "created_utc": 1616194319.0,
            "replies": []
        },
        {
            "body": "😂",
            "author": "mraspencer",
            "id": "grik1gv",
            "parent_id": "t1_grihvos",
            "score": 2,
            "created_utc": 1616182591.0,
            "replies": []
        },
        {
            "body": "In my mind, that fantasy only checks out if its FMF, and not in the slightest if its FFM, (which is what OP stumbled into ...)",
            "author": "Gemini-Fox",
            "id": "griw4df",
            "parent_id": "t1_grik6wh",
            "score": 6,
            "created_utc": 1616188289.0,
            "replies": [
                {
                    "body": "FF      M",
                    "author": null,
                    "id": "griydxk",
                    "parent_id": "t1_griw4df",
                    "score": 6,
                    "created_utc": 1616189417.0,
                    "replies": []
                },
                {
                    "body": "You do know the order of the letters really is only a \"thing\" in subs like this and in more recent years. \n\nI promise, if you search pornhub for MMF, the dudes aren't playing with each other.",
                    "author": "mraspencer",
                    "id": "griyckd",
                    "parent_id": "t1_griw4df",
                    "score": 1,
                    "created_utc": 1616189399.0,
                    "replies": [
                        {
                            "body": "don't ruin it for me haha",
                            "author": "Gemini-Fox",
                            "id": "griyvvm",
                            "parent_id": "t1_griyckd",
                            "score": 2,
                            "created_utc": 1616189671.0,
                            "replies": []
                        },
                        {
                            "body": "Okay honestly as someone who used to browse pornhub a lot I had to start searching “MFM” and not “MMF” sooo... 🤷‍♀️ I think its becoming more mainstream",
                            "author": "galactosegirl",
                            "id": "grj16ix",
                            "parent_id": "t1_griyckd",
                            "score": 2,
                            "created_utc": 1616190833.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "I bet...",
            "author": null,
            "id": "grira4e",
            "parent_id": "t1_grik6wh",
            "score": 1,
            "created_utc": 1616185916.0,
            "replies": []
        },
        {
            "body": "Not when they treat him as he described.",
            "author": null,
            "id": "grjntei",
            "parent_id": "t1_grik6wh",
            "score": 1,
            "created_utc": 1616203083.0,
            "replies": []
        },
        {
            "body": "> Isn't it better that your SB has someone she cares for rather than a stranger who may not be compatible with her?\n\nSure, and god speed.  They can love each other over the horizon.\n\nBut in terms of a transactional SB relationship, no that's not ok.  If they want to be with each other that much, they should support each other, and not expect a third wheel to sit in the corner and support one or both.",
            "author": "sexytimeinseattle",
            "id": "grj34vj",
            "parent_id": "t1_gritaxu",
            "score": 1,
            "created_utc": 1616191833.0,
            "replies": [
                {
                    "body": "You have a point",
                    "author": "AFSMSgt",
                    "id": "grj6d3h",
                    "parent_id": "t1_grj34vj",
                    "score": 1,
                    "created_utc": 1616193517.0,
                    "replies": []
                }
            ]
        },
        {
            "body": ">It's an arrangement, not your girl friend. \n\nIt's an arrangement, not his escort.   There is, practically by definition, some level of strings attached and emotional intimacy -- there's a relationship aspect to this, if not, he's just seeing an escort and calling it something else.  And that relationship aspect might not have the same obligations to each other that a boyfriend/girlfriend relationship has, but it does come with some basic expectations around respect (and making him feel like a 3rd wheel in his own SR and own home, that's pure disrespect).\n\nAnyway, just a different perspective.",
            "author": "Azurecole",
            "id": "grj88j6",
            "parent_id": "t1_grj5b3y",
            "score": 0,
            "created_utc": 1616194519.0,
            "replies": []
        },
        {
            "body": "I agree betrayal is a strong word.  But mislead to the point of being hurt or insulted is valid.\n\nAnd I think hes only being overly dramatic in the sense he thought about it too much.  Soon as realized he was being 3rd wheeled let alone being lied to shoulda just been a clean cut. Just chop away the dead weight and tell them to GTFO your house.  \nBut dude made the mistake of catching feels for his SB...Thats his big mistake really.",
            "author": "AlaskanSnowDragon",
            "id": "gridwb3",
            "parent_id": "t1_grict2d",
            "score": 3,
            "created_utc": 1616179738.0,
            "replies": []
        },
        {
            "body": "Not rent free ... the GF is having sex with him too... he already has his SB there, the incremental cost of GF is minuscule ... seriously lots of guys would die for this situation.",
            "author": "daddoms",
            "id": "grid8el",
            "parent_id": "t1_grict2d",
            "score": 0,
            "created_utc": 1616179439.0,
            "replies": [
                {
                    "body": "Re-read the OP's post, he continued to pay an allowance to the both of them ...\n\n>I agreed that she can stay and I will continue paying her for the whole week.\n\nNow, on to your point:\n\n>seriously lots of guys would die for this situation \n\n1. True\n2. The OP does not sound like one of them (which is the important part for this thread)",
                    "author": "sfwinefan",
                    "id": "grie09r",
                    "parent_id": "t1_grid8el",
                    "score": 5,
                    "created_utc": 1616179789.0,
                    "replies": [
                        {
                            "body": "No guys would die for the situation where they're third-wheeled in their own SR and own home.  And that, I think, is the real crux of the matter, all magnified by the fact that when he saw he was getting third wheeled, his reaction was to reward them by letting her stay the whole week with allowance.  \n\nWithout the third wheeling, agree it could be quite a fun situation.  But if the queen had balls, and all that.",
                            "author": "Azurecole",
                            "id": "griekx1",
                            "parent_id": "t1_grie09r",
                            "score": 5,
                            "created_utc": 1616180051.0,
                            "replies": []
                        },
                        {
                            "body": "Yes 🙌 again to each their own.",
                            "author": "daddoms",
                            "id": "griehxu",
                            "parent_id": "t1_grie09r",
                            "score": 0,
                            "created_utc": 1616180014.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "this post is filled with wisdom.",
            "author": "wikishart",
            "id": "grm4ybs",
            "parent_id": "t1_grkukp7",
            "score": 2,
            "created_utc": 1616265713.0,
            "replies": [
                {
                    "body": "Awe thanks :) \n\nThe good ones keep being good, even when they're being taken advantage of by bad people.\n\nThe bad ones feel they are always being taken advantage of even when they have done no good.",
                    "author": "kimchi_Queen",
                    "id": "grmzcwx",
                    "parent_id": "t1_grm4ybs",
                    "score": 1,
                    "created_utc": 1616278926.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "She was sneaky. I felt like a idiot when she told me the truth",
            "author": "hitonce_1919",
            "id": "gricx5s",
            "parent_id": "t1_grib31f",
            "score": 1,
            "created_utc": 1616179298.0,
            "replies": [
                {
                    "body": "Don’t feel like an idiot. She’s bi, that’s who she is. You can’t change that. She was likely apprehensive about telling you for fear you’d be judgmental. You don’t have to continue in any relationship you aren’t comfortable with, but you aren’t an idiot.",
                    "author": "daddoms",
                    "id": "griecb6",
                    "parent_id": "t1_gricx5s",
                    "score": -2,
                    "created_utc": 1616179943.0,
                    "replies": [
                        {
                            "body": "Bi doesn't mean dishonest ✨ not all bi people need/want more than one person",
                            "author": "Mothernaturestits",
                            "id": "grj00c6",
                            "parent_id": "t1_griecb6",
                            "score": 6,
                            "created_utc": 1616190239.0,
                            "replies": [
                                {
                                    "body": "How am I even implying that bi is dishonest??? I’m just saying that someone who holds back part of their identity might be apprehensive. I’m not saying that anyone has an obligation to tell their entire identity either. If you want to be with her then accept her for who she is.",
                                    "author": "daddoms",
                                    "id": "grj1nv2",
                                    "parent_id": "t1_grj00c6",
                                    "score": -1,
                                    "created_utc": 1616191078.0,
                                    "replies": [
                                        {
                                            "body": "Ah, my mistake then. I misunderstood what you were implying.",
                                            "author": "Mothernaturestits",
                                            "id": "grj1rse",
                                            "parent_id": "t1_grj1nv2",
                                            "score": 2,
                                            "created_utc": 1616191133.0,
                                            "replies": []
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "This is not about OP accepting her being bi. They clearly do. This is about the SB lying about being in a relationship with a girl who she was already in a relationship with.",
            "author": "Killer_Yandere",
            "id": "grk9nb1",
            "parent_id": "t1_grk5hnv",
            "score": 2,
            "created_utc": 1616216950.0,
            "replies": [
                {
                    "body": "yeah she basically put forth a trap to direct funds to her girlfriend. That's the problem. I don't know why people are going into the \"bi people don't have to date you\" etc. kinds of lines of thinking.\n\nThey conspired to find a way to extract more money out of the guy. He feels badly used (which he was). He's hurt (he should be). People telling him to suck it up and not be a drama queen are asking for toxic masculinity. \n\nHe's human, he got used badly, he has feelings, he feels like an object and not a person. He's entitled to be hurt.",
                    "author": "wikishart",
                    "id": "grm3zti",
                    "parent_id": "t1_grk9nb1",
                    "score": 2,
                    "created_utc": 1616265314.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "some people seem to lie by default.",
            "author": "wikishart",
            "id": "grm3ozr",
            "parent_id": "t1_griung8",
            "score": 1,
            "created_utc": 1616265192.0,
            "replies": []
        },
        {
            "body": "It was also terrible of her not to respect your boundaries when you expressed disinterest in the first place.",
            "author": "Cledaddy23",
            "id": "griyq8u",
            "parent_id": "t1_gricsir",
            "score": 20,
            "created_utc": 1616189590.0,
            "replies": []
        },
        {
            "body": ">her wanting to have her own personal space and her own personal time in his home is not what’s to blame here.\n\nYou're making that up... I'm not sure why.  His exactly words were \"They spent most of the weekend together in her room and had just a few hours with me\".  There's a difference between taking some personal space, and spending almost no time with your SD/host.\n\n>Arrangements are not a 100% full time job unless it’s serious enough to  where marriage is being discussed or they’re dating without an  allowance.\n\nThat's a strawman -- no one said it's a 100% full time job, so there's no reason to argue that that's not what it is.  But it's also not \"move into his house, lie about bringing in your longterm girlfriend, spend almost no time with your SD and all the time locked away with her\".  I've never been with an SB for a few days and not spent time together, more than just a few hours.\n\nIf this were just about a little personal time, this entire post wouldn't be here.\n\n>“Feeling like an outsider in his own arrangement” sounds very stretched to me.\n\nIt's not stretched, it's basically what he said -- he felt left out\n\nI agree that in the scenario you *invented* \\-- she and the girlfriend hadn't lied about their relationship, and they took some alone time but also spent time with him and made him feel included -- that's no issue at all.  That's basically the dream.  But the actual scenario does not describe that.  If someone posts the scenario you described -- that is, one totally different than in this post -- I'd be with you.",
            "author": "Azurecole",
            "id": "grk43af",
            "parent_id": "t1_grk2ur6",
            "score": 7,
            "created_utc": 1616212874.0,
            "replies": [
                {
                    "body": "There’s a difference between seeing your SB for a few days on a trip, and actually living together. She could have spent time with him the entire 3 weeks out of the month without a pause, and she spent one weekend to herself. There’s absolutely nothing wrong with that. Again, arrangements aren’t a full time job. They crossed the line when they moved in with one another. They should not have done that at all. He was looking for the cheapest way to help her out, and she was looking for the easiest escape-route to have little to no responsibility, while having a girlfriend. They’re both in the wrong.",
                    "author": "upscaleitalia",
                    "id": "grm6i6h",
                    "parent_id": "t1_grk43af",
                    "score": 1,
                    "created_utc": 1616266374.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "FF      M",
            "author": null,
            "id": "griydxk",
            "parent_id": "t1_griw4df",
            "score": 6,
            "created_utc": 1616189417.0,
            "replies": []
        },
        {
            "body": "You do know the order of the letters really is only a \"thing\" in subs like this and in more recent years. \n\nI promise, if you search pornhub for MMF, the dudes aren't playing with each other.",
            "author": "mraspencer",
            "id": "griyckd",
            "parent_id": "t1_griw4df",
            "score": 1,
            "created_utc": 1616189399.0,
            "replies": [
                {
                    "body": "don't ruin it for me haha",
                    "author": "Gemini-Fox",
                    "id": "griyvvm",
                    "parent_id": "t1_griyckd",
                    "score": 2,
                    "created_utc": 1616189671.0,
                    "replies": []
                },
                {
                    "body": "Okay honestly as someone who used to browse pornhub a lot I had to start searching “MFM” and not “MMF” sooo... 🤷‍♀️ I think its becoming more mainstream",
                    "author": "galactosegirl",
                    "id": "grj16ix",
                    "parent_id": "t1_griyckd",
                    "score": 2,
                    "created_utc": 1616190833.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "You have a point",
            "author": "AFSMSgt",
            "id": "grj6d3h",
            "parent_id": "t1_grj34vj",
            "score": 1,
            "created_utc": 1616193517.0,
            "replies": []
        },
        {
            "body": "Re-read the OP's post, he continued to pay an allowance to the both of them ...\n\n>I agreed that she can stay and I will continue paying her for the whole week.\n\nNow, on to your point:\n\n>seriously lots of guys would die for this situation \n\n1. True\n2. The OP does not sound like one of them (which is the important part for this thread)",
            "author": "sfwinefan",
            "id": "grie09r",
            "parent_id": "t1_grid8el",
            "score": 5,
            "created_utc": 1616179789.0,
            "replies": [
                {
                    "body": "No guys would die for the situation where they're third-wheeled in their own SR and own home.  And that, I think, is the real crux of the matter, all magnified by the fact that when he saw he was getting third wheeled, his reaction was to reward them by letting her stay the whole week with allowance.  \n\nWithout the third wheeling, agree it could be quite a fun situation.  But if the queen had balls, and all that.",
                    "author": "Azurecole",
                    "id": "griekx1",
                    "parent_id": "t1_grie09r",
                    "score": 5,
                    "created_utc": 1616180051.0,
                    "replies": []
                },
                {
                    "body": "Yes 🙌 again to each their own.",
                    "author": "daddoms",
                    "id": "griehxu",
                    "parent_id": "t1_grie09r",
                    "score": 0,
                    "created_utc": 1616180014.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Awe thanks :) \n\nThe good ones keep being good, even when they're being taken advantage of by bad people.\n\nThe bad ones feel they are always being taken advantage of even when they have done no good.",
            "author": "kimchi_Queen",
            "id": "grmzcwx",
            "parent_id": "t1_grm4ybs",
            "score": 1,
            "created_utc": 1616278926.0,
            "replies": []
        },
        {
            "body": "Don’t feel like an idiot. She’s bi, that’s who she is. You can’t change that. She was likely apprehensive about telling you for fear you’d be judgmental. You don’t have to continue in any relationship you aren’t comfortable with, but you aren’t an idiot.",
            "author": "daddoms",
            "id": "griecb6",
            "parent_id": "t1_gricx5s",
            "score": -2,
            "created_utc": 1616179943.0,
            "replies": [
                {
                    "body": "Bi doesn't mean dishonest ✨ not all bi people need/want more than one person",
                    "author": "Mothernaturestits",
                    "id": "grj00c6",
                    "parent_id": "t1_griecb6",
                    "score": 6,
                    "created_utc": 1616190239.0,
                    "replies": [
                        {
                            "body": "How am I even implying that bi is dishonest??? I’m just saying that someone who holds back part of their identity might be apprehensive. I’m not saying that anyone has an obligation to tell their entire identity either. If you want to be with her then accept her for who she is.",
                            "author": "daddoms",
                            "id": "grj1nv2",
                            "parent_id": "t1_grj00c6",
                            "score": -1,
                            "created_utc": 1616191078.0,
                            "replies": [
                                {
                                    "body": "Ah, my mistake then. I misunderstood what you were implying.",
                                    "author": "Mothernaturestits",
                                    "id": "grj1rse",
                                    "parent_id": "t1_grj1nv2",
                                    "score": 2,
                                    "created_utc": 1616191133.0,
                                    "replies": []
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "body": "yeah she basically put forth a trap to direct funds to her girlfriend. That's the problem. I don't know why people are going into the \"bi people don't have to date you\" etc. kinds of lines of thinking.\n\nThey conspired to find a way to extract more money out of the guy. He feels badly used (which he was). He's hurt (he should be). People telling him to suck it up and not be a drama queen are asking for toxic masculinity. \n\nHe's human, he got used badly, he has feelings, he feels like an object and not a person. He's entitled to be hurt.",
            "author": "wikishart",
            "id": "grm3zti",
            "parent_id": "t1_grk9nb1",
            "score": 2,
            "created_utc": 1616265314.0,
            "replies": []
        },
        {
            "body": "There’s a difference between seeing your SB for a few days on a trip, and actually living together. She could have spent time with him the entire 3 weeks out of the month without a pause, and she spent one weekend to herself. There’s absolutely nothing wrong with that. Again, arrangements aren’t a full time job. They crossed the line when they moved in with one another. They should not have done that at all. He was looking for the cheapest way to help her out, and she was looking for the easiest escape-route to have little to no responsibility, while having a girlfriend. They’re both in the wrong.",
            "author": "upscaleitalia",
            "id": "grm6i6h",
            "parent_id": "t1_grk43af",
            "score": 1,
            "created_utc": 1616266374.0,
            "replies": []
        },
        {
            "body": "don't ruin it for me haha",
            "author": "Gemini-Fox",
            "id": "griyvvm",
            "parent_id": "t1_griyckd",
            "score": 2,
            "created_utc": 1616189671.0,
            "replies": []
        },
        {
            "body": "Okay honestly as someone who used to browse pornhub a lot I had to start searching “MFM” and not “MMF” sooo... 🤷‍♀️ I think its becoming more mainstream",
            "author": "galactosegirl",
            "id": "grj16ix",
            "parent_id": "t1_griyckd",
            "score": 2,
            "created_utc": 1616190833.0,
            "replies": []
        },
        {
            "body": "No guys would die for the situation where they're third-wheeled in their own SR and own home.  And that, I think, is the real crux of the matter, all magnified by the fact that when he saw he was getting third wheeled, his reaction was to reward them by letting her stay the whole week with allowance.  \n\nWithout the third wheeling, agree it could be quite a fun situation.  But if the queen had balls, and all that.",
            "author": "Azurecole",
            "id": "griekx1",
            "parent_id": "t1_grie09r",
            "score": 5,
            "created_utc": 1616180051.0,
            "replies": []
        },
        {
            "body": "Yes 🙌 again to each their own.",
            "author": "daddoms",
            "id": "griehxu",
            "parent_id": "t1_grie09r",
            "score": 0,
            "created_utc": 1616180014.0,
            "replies": []
        },
        {
            "body": "Bi doesn't mean dishonest ✨ not all bi people need/want more than one person",
            "author": "Mothernaturestits",
            "id": "grj00c6",
            "parent_id": "t1_griecb6",
            "score": 6,
            "created_utc": 1616190239.0,
            "replies": [
                {
                    "body": "How am I even implying that bi is dishonest??? I’m just saying that someone who holds back part of their identity might be apprehensive. I’m not saying that anyone has an obligation to tell their entire identity either. If you want to be with her then accept her for who she is.",
                    "author": "daddoms",
                    "id": "grj1nv2",
                    "parent_id": "t1_grj00c6",
                    "score": -1,
                    "created_utc": 1616191078.0,
                    "replies": [
                        {
                            "body": "Ah, my mistake then. I misunderstood what you were implying.",
                            "author": "Mothernaturestits",
                            "id": "grj1rse",
                            "parent_id": "t1_grj1nv2",
                            "score": 2,
                            "created_utc": 1616191133.0,
                            "replies": []
                        }
                    ]
                }
            ]
        },
        {
            "body": "How am I even implying that bi is dishonest??? I’m just saying that someone who holds back part of their identity might be apprehensive. I’m not saying that anyone has an obligation to tell their entire identity either. If you want to be with her then accept her for who she is.",
            "author": "daddoms",
            "id": "grj1nv2",
            "parent_id": "t1_grj00c6",
            "score": -1,
            "created_utc": 1616191078.0,
            "replies": [
                {
                    "body": "Ah, my mistake then. I misunderstood what you were implying.",
                    "author": "Mothernaturestits",
                    "id": "grj1rse",
                    "parent_id": "t1_grj1nv2",
                    "score": 2,
                    "created_utc": 1616191133.0,
                    "replies": []
                }
            ]
        },
        {
            "body": "Ah, my mistake then. I misunderstood what you were implying.",
            "author": "Mothernaturestits",
            "id": "grj1rse",
            "parent_id": "t1_grj1nv2",
            "score": 2,
            "created_utc": 1616191133.0,
            "replies": []
        }
    ]
}